
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "МассивКасс") Тогда
		НомерЭлемента = 0;
		Для Каждого СтрокаМассива Из Параметры.МассивКасс Цикл
			НомерЭлемента = НомерЭлемента + 1;
			НоваяСтрока = ТаблицаКассыККМ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
			НоваяСтрока.НомерСтраницы = НомерЭлемента;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПараметрыОповещения = Новый Структура("ПлатежныеСистемыПодключены", Истина);
	Оповестить("НастройкаПлатежныхСистем", ПараметрыОповещения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодключитьСБП(Команда)
	ОткрытьНастройкуСБП();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКассовыйQR(Команда)
	ОткрытьНастройкуКассовогоQR();
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьЮКасса(Команда)
	ОткрытьНастройкуЮКасса();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройке(Команда)
	НастроитьФорму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НастройкаСБППриИзменении(Элемент)
	УстановитьДоступностьПерейтиКНастройке();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЮКассаПриИзменении(Элемент)
	УстановитьДоступностьПерейтиКНастройке();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФорму()
	Элементы.СтраницыНастройки.ТекущаяСтраница = Элементы.СтраницаНастройки;
	Элементы.ГруппаОбщаяИнформацияСБП.Видимость = НастройкаСБП;
	Элементы.ГруппаПодключениеЮКасса.Видимость = НастройкаЮКасса;
	
	Для Каждого СтрокаТаблицы Из ТаблицаКассыККМ Цикл
		Элементы.НомерСтраницы.СписокВыбора.Добавить(СтрокаТаблицы.НомерСтраницы, Строка(СтрокаТаблицы.КассаККМ));
	КонецЦикла;
	НомерСтраницы = 1;
	Элементы.НомерСтраницы.Видимость = НЕ ТаблицаКассыККМ.Количество() = 1;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуСБП()
	СписокСтрок = ТаблицаКассыККМ.НайтиСтроки(Новый Структура("НомерСтраницы", НомерСтраницы));
	
	Если СписокСтрок.Количество() > 0 Тогда
		МодульСБПКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СистемаБыстрыхПлатежейКлиент");
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Организация", СписокСтрок[0].Организация);
		ДополнительныеПараметры.Вставить("ТорговыйОбъект", СписокСтрок[0].ТорговыйОбъект);
		ПараметрыПодключения = Новый Структура("ОтборУчастников, БИК");
		МодульСБПКлиент.ПодключитьСистемуБыстрыхПлатежей(ПараметрыПодключения, , ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКассовогоQR()
	СписокСтрок = ТаблицаКассыККМ.НайтиСтроки(Новый Структура("НомерСтраницы", НомерСтраницы));
	
	Если СписокСтрок.Количество() > 0 Тогда
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОткрытьФормуНастройкиКассовогоQRКода(
			СписокСтрок[0].КассаККМ,
			СписокСтрок[0].Организация,
			СписокСтрок[0].ТорговыйОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуЮКасса()
	СписокСтрок = ТаблицаКассыККМ.НайтиСтроки(Новый Структура("НомерСтраницы", НомерСтраницы));
	
	Если СписокСтрок.Количество() > 0 Тогда
		СтандартнаяОбработка	 = Ложь;
		ПоОрганизации			 = Новый Структура("Организация", СписокСтрок[0].Организация);
		ОткрытьФорму("Справочник.НастройкиОнлайнОплат.Форма.ФормаЭлемента", ПоОрганизации , ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПерейтиКНастройке()
	Элементы.ПерейтиКНастройке.Доступность = НастройкаСБП Или НастройкаЮКасса;
КонецПроцедуры

#КонецОбласти
