
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Перем ТекстОшибки;
	
	ДокументОснование = ПараметрКоманды;
	
	// Для предотвращения повторного открытия форм ввода чека коррекции по одному Документу расчетов
	// назначается ключ уникальности в виде УникальныйИдентификатора документа расчетов
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекККМКоррекции") Тогда
		
		РеквизитыОснования = ДанныеДокументаОснования(ДокументОснование);
		
		Если РеквизитыОснования.НеприменениеККТ Тогда
			ДокументРасчетов = ДокументОснование;
		Иначе
			ДокументРасчетов = РеквизитыОснования.ДокументРасчетов;
		КонецЕсли;
		
	Иначе
		
		ДокументРасчетов = ДокументОснование;
		
	КонецЕсли;
	
	Если Не ПроверитьВозможностьКоррекцииДокументаОснования(ДокументОснование, ТекстОшибки) Тогда
		
		Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
			ТекстОшибки = НСтр("ru = 'Создание чека коррекции недоступно для документа.'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
		
	КонецЕсли;
	
	КлючУникальности = ДокументРасчетов.УникальныйИдентификатор();
	
	ПараметрыФормы = Новый Структура("ДокументОснование", ДокументОснование);
	
	ОткрытьФорму("Обработка.СозданиеЧековКоррекции.Форма",
		ПараметрыФормы,
		,
		КлючУникальности,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДанныеДокументаОснования(Основание)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "НеприменениеККТ, ДокументРасчетов");
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьКоррекцииДокументаОснования(ДокументОснование, ТекстОшибки)
	
	Результат = Истина;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходИзКассы") Тогда
		
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ВидОперации");
		
		ВидОперацииПодразумеваетЧек = ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Покупателю
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Поставщику
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.НашейОрганизации
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.НаРасходы
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Налоги
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Прочее;
		
		Если Не ВидОперацииПодразумеваетЧек Тогда
			
			Результат = Ложь;
			ТекстОшибки = НСтр("ru = 'Вид операции документа не предусматривает формирование чеков.'");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти