#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработкаПрерыванияОперацииПлатежнойСистемы(Форма, Отказ) Экспорт
	
	Если Форма.ПлатежнаяСистема_СанкционированноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыФормы = Форма.Элементы;
	
	ТекущийСлой = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьТекущийСлойГруппы(
		ЭлементыФормы.ГруппаСлоевПанелиДействийПлатежнойСистемы);
	
	Если ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ТекущаяСтраница(
		ЭлементыФормы.ГруппаДлительнаяОперация, ТекущийСлой) Тогда
		
		ТекстОшибки = НСтр("ru = 'Будет прервано выполнение операции.'");
		
	ИначеЕсли Не Форма.ПлатежнаяСистема_НоваяЗаявка.Оплачивается
		И Форма.ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа
		И (ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ТекущаяСтраница(ЭлементыФормы.ГруппаИстеклоВремяОжидания, ТекущийСлой)
		ИЛИ ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ТекущаяСтраница(ЭлементыФормы.ГруппаQRКод, ТекущийСлой)
		ИЛИ ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ТекущаяСтраница(ЭлементыФормы.ГруппаИнструкция, ТекущийСлой)) Тогда
		
		ТекстОшибки = НСтр("ru = 'При закрытии QR-код станет неактуальным для проведения оплаты.'");
		
	Иначе
		
		ТекстОшибки = "";
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		
		Отказ = Истина;
		ПояснениеКОшибке = НСтр("ru = 'Подтвердить закрытие оплаты платежной системой?'");
		ВывестиИнформацию(Форма, ТекстОшибки, ПояснениеКОшибке, "ГруппаВопросПредупреждение");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФоновыеЗадания(Форма) Экспорт
	
	Если ЗначениеЗаполнено(Форма.ПлатежнаяСистема_НоваяЗаявка.ВидОплатыПлатежнойСистемы) Тогда
		
		Если Форма.ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа Тогда
			
			Если Форма.ПлатежнаяСистема_НоваяЗаявка.Оплачивается Тогда
				ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
					НСтр("ru = 'Получение подтверждения оплаты. Пожалуйста, подождите...'"));
				ПерейтиНаСтраницу(Форма, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
				Форма.ПодключитьОбработчикОжидания("ОпределитьСтатусОплаты", 0.1, Истина);
			Иначе
				ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
					НСтр("ru = 'Получение QR-кода оплаты платежной системы. Пожалуйста, подождите...'"));
				ПерейтиНаСтраницу(Форма, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
				Форма.ПодключитьОбработчикОжидания("ПолучитьИдентификаторОплаты", 0.1, Истина);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.НастроитьФормуПоИнтеграции(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтложитьЧек(Форма, ОповещениеЗавершитьОперацию) Экспорт
	
	Если ЗначениеЗаполнено(Форма.ПлатежнаяСистема_НоваяЗаявка.КассоваяСсылка) Тогда
		
		ПояснениеКОшибке = НСтр("ru = 'Проведите операцию, если клиент подтверждает оплату.'");
		ТекстОшибки      = НСтр("ru = 'Уточните оплатил ли клиент чек.'");
		
		ВывестиИнформацию(Форма, ТекстОшибки, ПояснениеКОшибке, "ГруппаВопросОтложитьЧек");
		
	Иначе
		
		ОтложитьОперацию(Форма, ОповещениеЗавершитьОперацию, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиИнформацию(Форма, ЗаголовокИнформации, ТекстИнформации, СтраницаФормы) Экспорт
	
	Элементы = Форма.Элементы;
	Элементы.ФормаИнструкция.Видимость = Ложь;
	
	Элементы["ДекорацияЗаголовок" + СтраницаФормы].Заголовок = ЗаголовокИнформации;
	Элементы["ДекорацияТекст" + СтраницаФормы].Заголовок     = ТекстИнформации;
	
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьТекущийСлойГруппы(Элементы[СтраницаФормы]);
	
	Если СтраницаФормы = "ГруппаВопросОтложитьЧек" Тогда
		Элементы.ФормаОтложитьПринудительно.Важность = ВажностьКнопки.Главная;
	ИначеЕсли СтраницаФормы = "ГруппаВопросПредупреждение" Тогда
		Элементы.ФормаЗакрытьПринудительно.Важность = ВажностьКнопки.Главная;
	ИначеЕсли СтраницаФормы = "ГруппаПодтверждениеОплатыВозврата" Тогда
		Элементы.ФормаПодтвердитьОплатуВозвратПринудительно.Важность = ВажностьКнопки.Главная;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПечатьПречека(Форма, ПовторнаяПечатьЧека = Ложь, ИдентификаторУстройстваФР = Неопределено) Экспорт
	
	Если НЕ ПовторнаяПечатьЧека
		И МенеджерОборудованияРМККлиент.ПодключенныеДисплеиПокупателяВыводятQRКод() Тогда
		
		ВывестиПречекНаЭкран(Форма);
		
	Иначе 
		
		Форма.Доступность 				 = Ложь;
		СтруктураСФормой				 = Новый Структура("Форма", Форма);
		ОписаниеОповещениеПриЗавершении  = Новый ОписаниеОповещения("ПечатьПречекаЗавершение", ЭтотОбъект, СтруктураСФормой);
	
		ПараметрыОперации = МенеджерОборудованияРМККлиент.ПараметрыПечатиQRКодаНаФискальномУстройстве();
		
		ПараметрыОперации.СуммаОперации		  = Форма.ПлатежнаяСистема_НоваяЗаявка.ИтогПоОрганизации;
		ПараметрыОперации.ТипПлатежнойСистемы = Форма.ПлатежнаяСистема_НоваяЗаявка.ТипПлатежнойСистемы;
		ПараметрыОперации.QRКод.ЗначениеКода  = Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторQRКода;
		ПараметрыОперации.QRКод.ТекстПользователя = НСтр("ru='Для совершения платежа отсканируйте QR-код'");
	
		МенеджерОборудованияРМККлиент.НачатьПечатьQRКодаНаФискальномУстройстве(ОписаниеОповещениеПриЗавершении, 
																						Неопределено, 
																						ИдентификаторУстройстваФР, 
																						ПараметрыОперации); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПечатьПречекаЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Форма			  = Параметры.Форма;
	Форма.Доступность = Истина;
	
	Если НЕ РезультатВыполнения.Результат Тогда  
		
		ЗаголовокИнформации	= НСтр("ru = 'Печать последнего слип чека'");
		ТекстИнформации		= РезультатВыполнения.ОписаниеОшибки;
		
		ВыводитьПредупреждение = Форма.Элементы.Найти("ГруппаОшибкаПредупреждение") = Неопределено;
		
		Если ВыводитьПредупреждение Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстИнформации);
		Иначе
			ВывестиИнформацию(
				Форма,
				ЗаголовокИнформации,
				ТекстИнформации,
				"ГруппаОшибкаПредупреждение");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьИдентификаторОплаты(Форма, ПечатьQRКода = Ложь) Экспорт
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ЗаявкаНаОплату = НоваяЗаявка(Форма);
	РезультатВыполнения = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ПолучитьИдентификаторОплаты(
		ЗаявкаНаОплату, Форма.УникальныйИдентификатор);
	
	Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияФормированияQRКода = РезультатВыполнения.ИдентификаторЗадания;
	
	СтруктураСФормой = Новый Структура();
	СтруктураСФормой.Вставить("Форма",        Форма);
	СтруктураСФормой.Вставить("ПечатьQRКода", ПечатьQRКода);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьИдентификаторОплатыЗавершение",
		ЭтотОбъект, СтруктураСФормой);
	
	Если РезультатВыполнения.Статус <> "Выполняется" Тогда
		ПолучитьИдентификаторОплатыЗавершение(РезультатВыполнения, СтруктураСФормой);
		Возврат;
	КонецЕсли;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

Процедура ПолучитьИдентификаторОплатыЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если Форма.ПлатежнаяСистема_СанкционированноеЗакрытие Тогда // уже на актуально
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		ОбработатьРезультатПолученияИдентификатораОплаты(РезультатОперации, ДополнительныеПараметры);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", РезультатВыполнения.КраткоеПредставлениеОшибки);
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
		
	ИначеЕсли РезультатВыполнения.Статус = "Отменено" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке",
			НСтр("ru = 'Не удалось выполнить получение QR-кода. Задание отменено администратором.'"));
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьСтатусОплаты(Форма, ДополнительныеПараметры) Экспорт
	
	ОповещениеЗавершитьОперацию = ДополнительныеПараметры.ОповещениеЗавершитьОперацию;
	КоличествоПовторов          = ДополнительныеПараметры.КоличествоПовторов;
	
	ДокументОплаты = Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументОплаты;
	Интеграция = Форма.ПлатежнаяСистема_НоваяЗаявка.Интеграция;
	РезультатВыполнения = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ОпределитьСтатусОплатыОплаты(
		ДокументОплаты,
		Интеграция,
		Форма.УникальныйИдентификатор);
	
	Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияПроверкиСтатуса = РезультатВыполнения.ИдентификаторЗадания;
	
	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("Форма",                       Форма);
	ПараметрыЗавершения.Вставить("ОповещениеЗавершитьОперацию", ОповещениеЗавершитьОперацию);
	ПараметрыЗавершения.Вставить("КоличествоПовторов",          КоличествоПовторов);
	
	Если РезультатВыполнения.Статус <> "Выполняется" Тогда
		
		ОпределитьСтатусОплатыЗавершение(РезультатВыполнения, ПараметрыЗавершения);
		Возврат;
		
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОпределитьСтатусОплатыЗавершение", ЭтотОбъект, ПараметрыЗавершения);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.Интервал = 1;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

Процедура ОпределитьСтатусОплатыЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если Форма.ПлатежнаяСистема_СанкционированноеЗакрытие Тогда // уже на актуально
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		ОбработатьСтатусОплаты(РезультатОперации, ДополнительныеПараметры);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", РезультатВыполнения.КраткоеПредставлениеОшибки);
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
		
	ИначеЕсли РезультатВыполнения.Статус = "Отменено" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке",
			НСтр("ru = 'Не удалось определить статус оплаты. Задание отменено администратором.'"));
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВозвратОплаты(Форма, ДополнительныеПараметры) Экспорт
	
	ОповещениеЗавершитьОперацию = ДополнительныеПараметры.ОповещениеЗавершитьОперацию;
	
	ЗаявкаНаВозврат = НоваяЗаявка(Форма);
	РезультатВыполнения = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ВозвратОплаты(
		ЗаявкаНаВозврат, 
		Форма.УникальныйИдентификатор);
	
	Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияВозврата = РезультатВыполнения.ИдентификаторЗадания;
	
	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("Форма",                       Форма);
	ПараметрыЗавершения.Вставить("ОповещениеЗавершитьОперацию", ОповещениеЗавершитьОперацию);
	
	Если РезультатВыполнения.Статус <> "Выполняется" Тогда
		ВозвратОплатыЗавершение(РезультатВыполнения, ПараметрыЗавершения);
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВозвратОплатыЗавершение", ЭтотОбъект, ПараметрыЗавершения);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.Интервал = 1;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

Процедура ВозвратОплатыЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если Форма.ПлатежнаяСистема_СанкционированноеЗакрытие Тогда // уже на актуально
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		Если Не ЗначениеЗаполнено(Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументВозврата) Тогда
			Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументВозврата = РезультатОперации.ДокументВозврата;
		КонецЕсли;
		
		ОбработатьСтатусВозврата(РезультатОперации, ДополнительныеПараметры, Истина);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", РезультатВыполнения.КраткоеПредставлениеОшибки);
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
		
	ИначеЕсли РезультатВыполнения.Статус = "Отменено" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке",
			НСтр("ru = 'Не удалось выполнить возврат. Задание отменено администратором.'"));
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьСтатусВозврата(Форма, ДополнительныеПараметры) Экспорт
	
	ОповещениеЗавершитьОперацию = ДополнительныеПараметры.ОповещениеЗавершитьОперацию;
	
	ДокументВозврата = Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументВозврата;
	Интеграция       = Форма.ПлатежнаяСистема_НоваяЗаявка.Интеграция;
	
	РезультатВыполнения = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ОпределитьСтатусВозврата(
		ДокументВозврата,
		Интеграция,
		Форма.УникальныйИдентификатор);
	
	Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияПроверкиСтатуса = РезультатВыполнения.ИдентификаторЗадания;
	
	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("Форма",                       Форма);
	ПараметрыЗавершения.Вставить("ОповещениеЗавершитьОперацию", ОповещениеЗавершитьОперацию);
	
	Если РезультатВыполнения.Статус <> "Выполняется" Тогда
		ОпределитьСтатусВозвратаЗавершение(РезультатВыполнения, ПараметрыЗавершения);
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОпределитьСтатусВозвратаЗавершение", ЭтотОбъект, ПараметрыЗавершения);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.Интервал = 1;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

Процедура ОпределитьСтатусВозвратаЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если Форма.ПлатежнаяСистема_СанкционированноеЗакрытие Тогда // уже на актуально
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		ОбработатьСтатусВозврата(РезультатОперации, ДополнительныеПараметры);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", РезультатВыполнения.КраткоеПредставлениеОшибки);
		ПерейтиНаСтраницу(Форма, "ГруппаОшибкаПолученияСтатуса", ПараметрыСтраницы);
		
	ИначеЕсли РезультатВыполнения.Статус = "Отменено" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке",
			НСтр("ru = 'Не удалось получить статус возврата. Задание отменено.'"));
		ПерейтиНаСтраницу(Форма, "ГруппаОшибкаПолученияСтатуса", ПараметрыСтраницы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтменитьОперацию(Форма, ОповещениеЗавершитьОтмену) Экспорт
	
	ДокументОплаты                         = Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументОплаты;
	ОтменаЗаказа                           = Форма.ПлатежнаяСистема_НоваяЗаявка.ОтменаЗаказа;
	Интеграция                             = Форма.ПлатежнаяСистема_НоваяЗаявка.Интеграция;
	ИдентификаторЗаданияФормированияQRКода = Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияФормированияQRКода;
	ИдентификаторЗаданияПроверкиСтатуса    = Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияПроверкиСтатуса;
	ИдентификаторЗаданияВозврата           = Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияВозврата;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	Если Не ЗначениеЗаполнено(Интеграция) Тогда
		ВыполнитьОбработкуОповещения(ОповещениеЗавершитьОтмену, "ОтменитьЧек");
	КонецЕсли;
	
	РезультатВыполнения = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ОтменитьОперацию(
		ДокументОплаты,
		ОтменаЗаказа,
		Интеграция,
		ИдентификаторЗаданияФормированияQRКода,
		ИдентификаторЗаданияПроверкиСтатуса,
		ИдентификаторЗаданияВозврата,
		Форма.УникальныйИдентификатор);
	
	Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияОтменаЗаказа = РезультатВыполнения.ИдентификаторЗадания;
	
	СтруктураСФормой      = Новый Структура("Форма, ОповещениеЗавершитьОтмену", Форма, ОповещениеЗавершитьОтмену);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОтменитьОперациюЗавершение", ЭтотОбъект, СтруктураСФормой);
	
	Если РезультатВыполнения.Статус <> "Выполняется" Тогда
		ОтменитьОперациюЗавершение(РезультатВыполнения, СтруктураСФормой);
		Возврат;
	КонецЕсли;
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

Процедура ОтменитьОперациюЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт

	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;

	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		Если РезультатОперации <> Неопределено
			И ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
			
			ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", РезультатОперации.СообщениеОбОшибке);
			ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
				
		Иначе
			
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗавершитьОтмену, "ОтменитьЧек");
			
		КонецЕсли;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", РезультатВыполнения.КраткоеПредставлениеОшибки);
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
	
	ИначеЕсли РезультатВыполнения.Статус = "Отменено" Тогда
		
		ПараметрыСтраницы = Новый Структура(
			"СообщениеОбОшибке", 
			НСтр("ru = 'Не удалось отменить оплату. Задание отменено администратором.'"));
			
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтложитьОперацию(Форма, ОповещениеЗавершить, ВыполнитьОтмену = Истина) Экспорт
	
	ДокументОплаты 							= Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументОплаты;
	ОтменаЗаказа							= Форма.ПлатежнаяСистема_НоваяЗаявка.ОтменаЗаказа;
	Интеграция 								= Форма.ПлатежнаяСистема_НоваяЗаявка.Интеграция;
	ИдентификаторЗаданияФормированияQRКода 	= Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияФормированияQRКода;
	ИдентификаторЗаданияПроверкиСтатуса 	= Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияПроверкиСтатуса;
	ИдентификаторЗаданияВозврата			= Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияВозврата;

	ПараметрыСтраницы = Новый Структура(
		"ТекстДлительнойОперации",
		НСтр("ru = 'Откладывание платежа. Пожалуйста, подождите...'"));

	ПерейтиНаСтраницу(Форма, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
		
	Если ВыполнитьОтмену Тогда
			
		ПараметрыОжидания 	= ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;

		РезультатВыполнения = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ОтменитьОперацию(
			ДокументОплаты, 
			ОтменаЗаказа,
			Интеграция, 
			ИдентификаторЗаданияФормированияQRКода, 
			ИдентификаторЗаданияПроверкиСтатуса, 
			ИдентификаторЗаданияВозврата,
			Форма.УникальныйИдентификатор);
		
		Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияОтменаЗаказа = РезультатВыполнения.ИдентификаторЗадания;
	
		СтруктураСФормой		= Новый Структура("Форма, ОповещениеЗавершить", Форма, ОповещениеЗавершить);
		ОповещениеОЗавершении 	= Новый ОписаниеОповещения("ОтложитьОперациюЗавершение", ЭтотОбъект, СтруктураСФормой);
	
		Если РезультатВыполнения.Статус <> "Выполняется" Тогда
			ОтложитьОперациюЗавершение(РезультатВыполнения, СтруктураСФормой);
			Возврат;
		КонецЕсли;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			РезультатВыполнения,
			ОповещениеОЗавершении,
			ПараметрыОжидания);
	Иначе
			
		ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ОтменитьФоновыеЗадания(
			ИдентификаторЗаданияФормированияQRКода, 
			ИдентификаторЗаданияПроверкиСтатуса, 
			ИдентификаторЗаданияВозврата);
			
		ВыполнитьОбработкуОповещения(ОповещениеЗавершить, "ОтложитьЧек");
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПодтвердитьОплату(Форма, ДополнительныеПараметры) Экспорт
	
	ОповещениеЗавершитьОперацию = ДополнительныеПараметры.ОповещениеЗавершитьОперацию;
	
	ИдентификаторЗаданияФормированияQRКода = Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияФормированияQRКода;
	ИдентификаторЗаданияПроверкиСтатуса    = Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияПроверкиСтатуса;
	ИдентификаторЗаданияВозврата           = Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторЗаданияВозврата;
	
	ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
		НСтр("ru = 'Подтверждение оплаты. Пожалуйста, подождите...'"));
	ПерейтиНаСтраницу(Форма, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
	
	ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ОтменитьФоновыеЗадания(
		ИдентификаторЗаданияФормированияQRКода,
		ИдентификаторЗаданияПроверкиСтатуса,
		ИдентификаторЗаданияВозврата);
	
	ВыполнитьОбработкуОповещения(ОповещениеЗавершитьОперацию, "ДобавитьВидОплатыРучноеПодтверждение");
	
КонецПроцедуры

Процедура ПодтвердитьВозврат(Форма, ДополнительныеПараметры) Экспорт
	
	ДокументВозврата = Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументВозврата;
	Интеграция       = Форма.ПлатежнаяСистема_НоваяЗаявка.Интеграция;
	
	РезультатОперации = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ПодтвердитьВозврат(
		ДокументВозврата,
		Интеграция);
	
	ОбработатьСтатусВозврата(РезультатОперации, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОтложитьОперациюЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт

	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		Если РезультатОперации <> Неопределено
			И ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
			
			ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", РезультатОперации.СообщениеОбОшибке);
			ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
			
		КонецЕсли;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", РезультатВыполнения.КраткоеПредставлениеОшибки);
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
	
	ИначеЕсли РезультатВыполнения.Статус = "Отменено" Тогда
		
		ПараметрыСтраницы = Новый Структура(
			"СообщениеОбОшибке", 
			НСтр("ru = 'Не удалось завершить оплату. Задание отменено администратором.'"));
		
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗавершить, "ОтложитьЧек");
	
КонецПроцедуры

Функция ОпределитьПараметрыОплатыПоОперациямДокумента(ВидыОплат, ДокументОперации) Экспорт
	
	ПараметрыОплаты = Новый Структура("Организация, ВидОплаты, ПлатежнаяСистема, ИдентификаторПС");
	
	НастройкиПодключенияОперации = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.НастройкиПодключенияОперации(ДокументОперации);
	
	Для Каждого Интеграция Из НастройкиПодключенияОперации Цикл
		
		СтрокиОплаты = ВидыОплат.НайтиСтроки(Новый Структура("Интеграция", Интеграция));
		
		Если СтрокиОплаты.Количество() Тогда
			ПараметрыОплаты.Организация      = СтрокиОплаты[0].Организация;
			ПараметрыОплаты.ВидОплаты        = СтрокиОплаты[0].ВидОплаты;
			ПараметрыОплаты.ПлатежнаяСистема = СтрокиОплаты[0].ПлатежнаяСистема;
			ПараметрыОплаты.ИдентификаторПС  = СтрокиОплаты[0].ИдентификаторПС;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПараметрыОплаты;
	
КонецФункции

Функция ОпределитьВидОплаты(Форма, ВидыОплат) Экспорт
	
	Ключ = Новый Структура("ИдентификаторПС", Форма.ПлатежнаяСистема_ИдентификаторПС);
	
	СтрокиОплаты = ВидыОплат.НайтиСтроки(Ключ);
		
	Если СтрокиОплаты.Количество() Тогда
		ВидОплаты = СтрокиОплаты[0].ВидОплаты;
	КонецЕсли;
	
	Возврат ВидОплаты;
	
КонецФункции

Функция ОпределитьСпособОплаты(Форма, ВидыОплат, ВыбраннаяОрганизация = Неопределено) Экспорт
	
	Ключ = Новый Структура("ИдентификаторПС", Форма.ПлатежнаяСистема_ИдентификаторПС);
	
	Если ВыбраннаяОрганизация <> Неопределено Тогда
		Ключ.Вставить("Организация",  ВыбраннаяОрганизация);
	КонецЕсли;
	
	СтрокиОплаты = ВидыОплат.НайтиСтроки(Ключ);
		
	Если СтрокиОплаты.Количество() Тогда
		СпособОплаты = СтрокиОплаты[0].СпособОплаты;
	КонецЕсли;
	
	Возврат СпособОплаты;
	
КонецФункции

Функция ОпределитьКомиссию(ИдентификаторПС, ВидыОплат, Организация, ВидОперацииПродажа) Экспорт
	
	Ключ = Новый Структура();
	Ключ.Вставить("ИдентификаторПС", ИдентификаторПС);
	Ключ.Вставить("Организация",     Организация);
	
	СтрокиОплаты = ВидыОплат.НайтиСтроки(Ключ);
		
	Если СтрокиОплаты.Количество() Тогда
		ПроцентКомиссии = ?(ВидОперацииПродажа, СтрокиОплаты[0].ПроцентКомиссии, СтрокиОплаты[0].ПроцентКомиссииПриВозврате);
	Иначе
		ПроцентКомиссии = 0;
	КонецЕсли;
	
	Возврат ПроцентКомиссии;
	
КонецФункции

Функция ВозвратВозможен(ПлатежнаяСистема, ТекстПредупреждения = "") Экспорт
	
	ВозвратВозможен = Истина;
	
	Если ПлатежнаяСистема = ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.ЮКасса") Тогда
		
		ВозвратВозможен 	= Ложь;
		ТекстПредупреждения = НСтр("ru = 'Чек был оплачен платежной системой ЮKassa. Возврат по данной системе невозможен. 
								|Проведите возврат другими видами оплат'");
		
	КонецЕсли;
	
	Возврат ВозвратВозможен
	
КонецФункции

#Область ПомощникНастройкиКассовогоМеста

// Выполняет открытие формы настройка кассового qr-кода СБП
//
// Параметры:
//  КассаККМ 		- ОпределяемыйТип.КассаККМРМК - касса qr-кода;
//  Организация 	- ОпределяемыйТип.ОрганизацияРМК - организация кассового qr-кода;
//  ТорговыйОбъект 	- ОпределяемыйТип.ТорговыйОбъектРМК - торговый объект кассового qr-кода;
//
//@skip-warning
Процедура ОткрытьФормуНастройкиКассовогоQRКода(КассаККМ, Организация, ТорговыйОбъект) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиентПереопределяемый.ОткрытьФормуНастройкиКассовогоQRКода(
		КассаККМ,
		Организация,
		ТорговыйОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиПречекНаЭкран(Форма)
	
	Если МенеджерОборудованияРМККлиент.ПодключенныеДисплеиПокупателяВыводятQRКод() Тогда
		
		Форма.Доступность 				 = Ложь;
		СтруктураСФормой				 = Новый Структура("Форма", Форма);
		ОписаниеОповещениеПриЗавершении  = Новый ОписаниеОповещения("ПечатьПречекаЗавершение", ЭтотОбъект, СтруктураСФормой);
	
		ТипыОперацийДисплеяПокупателя = МенеджерОборудованияРМККлиент.ТипыОперацийДисплеяПокупателя();
		ИсходныеДанные = МенеджерОборудованияРМККлиент.ИсходныеДанныеДляПервичнойПередачиНаДисплейПокупателя();
		ИсходныеДанные.ОповещениеПриЗавершении = ОписаниеОповещениеПриЗавершении;
		ИсходныеДанные.ИспользоватьПодключаемоеОборудование = Форма.ИспользоватьПодключаемоеОборудование;
		ИсходныеДанные.Операция = ТипыОперацийДисплеяПокупателя.ПречекQR;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СуммаСкидки") Тогда
			ИсходныеДанные.СуммаСкидки =  Форма.СуммаСкидки;
		Иначе
			ИсходныеДанные.СуммаСкидки =  0;
		КонецЕсли;
		ИсходныеДанные.СуммаИтого = Форма.ПлатежнаяСистема_НоваяЗаявка.ИтогПоОрганизации;
		ИсходныеДанные.СуммаКОплате = Форма.ПлатежнаяСистема_НоваяЗаявка.ИтогПоОрганизации;
		ИсходныеДанные.Организация = Форма.ПлатежнаяСистема_НоваяЗаявка.Организация;
		ИсходныеДанные.ЗначениеQRКода = Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторQRКода;
		ИсходныеДанные.КартинкаQRКода = Форма.ПлатежнаяСистема_НоваяЗаявка.КартинкаQRКода;
		МенеджерОборудованияРМККлиент.ВывестиИнформациюНаДисплейПокупателя(ИсходныеДанные.Операция, ИсходныеДанные, Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьРезультатПолученияИдентификатораОплаты(РезультатОперации, ДополнительныеПараметры)
	
	Форма        = ДополнительныеПараметры.Форма;
	ПечатьQRКода = ДополнительныеПараметры.ПечатьQRКода;
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", НСтр("ru = 'Неизвестная ошибка'"));
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыСтраницы, РезультатОперации, Истина);
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументОплаты) Тогда
			Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументОплаты = РезультатОперации.ДокументОплаты;
		КонецЕсли;
		
		Если РезультатОперации.Свойство("КассоваяСсылка") Тогда
			Форма.ПлатежнаяСистема_НоваяЗаявка.КассоваяСсылка = РезультатОперации.КассоваяСсылка;
		КонецЕсли;
		
		Если РезультатОперации.Свойство("ОтменаЗаказа") Тогда
			Форма.ПлатежнаяСистема_НоваяЗаявка.ОтменаЗаказа = РезультатОперации.ОтменаЗаказа;
		КонецЕсли;
		
		СтруктураQRКода = Неопределено;
		ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.СформироватьДанныеQRКода(
			СтруктураQRКода,
			Форма.ПлатежнаяСистема_НоваяЗаявка.Интеграция,
			РезультатОперации.QRКод,
			Форма.УникальныйИдентификатор);
		
		ЗаполнитьЗначенияСвойств(Форма.ПлатежнаяСистема_НоваяЗаявка, СтруктураQRКода);
		
		Форма.ПлатежнаяСистема_ДанныеQRКода = Форма.ПлатежнаяСистема_НоваяЗаявка.ДанныеQRКода;
		
		ПерейтиНаСтраницу(Форма, "ГруппаQRКод");
		
		Если ПечатьQRКода Тогда
			ПечатьПречека(Форма, , Форма.ПлатежнаяСистема_НоваяЗаявка.ПодключаемоеОборудование);
		Иначе
			ВывестиПречекНаЭкран(Форма);
		КонецЕсли;
		
		Форма.ПодключитьОбработчикОжидания("ОпределитьСтатусОплаты", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСтатусОплаты(РезультатОперации, ДополнительныеПараметры)
	
	Форма                       = ДополнительныеПараметры.Форма;
	ОповещениеЗавершитьОперацию = ДополнительныеПараметры.ОповещениеЗавершитьОперацию;
	КоличествоПовторов          = ДополнительныеПараметры.КоличествоПовторов;
	
	Если РезультатОперации.СтатусОперации = "Выполняется" Тогда
		
		КоличествоПовторов = КоличествоПовторов - 1;
		
		Если КоличествоПовторов > 0 Тогда
			
			Если Не Форма.ИстеклоВремяОжидания Тогда
				
				Форма.ИстеклоВремяОжидания = Истина;
				
				Если Форма.ПлатежнаяСистема_НоваяЗаявка.Оплачивается Тогда
					ПерейтиНаСтраницу(Форма, "ГруппаДлительнаяОперация");
				Иначе
					ПерейтиНаСтраницу(Форма, "ГруппаQRКод");
				КонецЕсли;
				
			КонецЕсли;
			
			ДополнительныеПараметры.КоличествоПовторов = КоличествоПовторов;
			ОпределитьСтатусОплаты(Форма, ДополнительныеПараметры);
			
		Иначе
			
			Форма.ИстеклоВремяОжидания = Ложь;
			ПерейтиНаСтраницу(Форма, "ГруппаИстеклоВремяОжидания");
			
		КонецЕсли;
		
	ИначеЕсли РезультатОперации.СтатусОперации = "Выполнена" Тогда
		
		ЗаполнитьЗначенияСвойств(Форма.ПлатежнаяСистема_НоваяЗаявка, РезультатОперации);
		ЗаполнитьЗначенияСвойств(Форма.ПлатежнаяСистема_НоваяЗаявка, РезультатОперации.ПараметрыОперации);
		
		ПерейтиНаСтраницу(Форма, "ГруппаЗавершение");
		ВыполнитьОбработкуОповещения(ОповещениеЗавершитьОперацию, "ДобавитьВидОплаты");
		
	ИначеЕсли РезультатОперации.СтатусОперации = "Отменена" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке",
			НСтр("ru = 'Операция отменена. Истек срок действия QR-кода или операция была отклонена платежной системой.'"));
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
		
	ИначеЕсли РезультатОперации.СтатусОперации = "Ошибка" Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", РезультатОперации.СообщениеОбОшибке);
		ПерейтиНаСтраницу(Форма, "ГруппаОшибкаПолученияСтатуса", ПараметрыСтраницы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСтатусВозврата(РезультатОперации, ДополнительныеПараметры, ЗапускПроверкиСтатуса = Ложь)
	
	Форма                       = ДополнительныеПараметры.Форма;
	ОповещениеЗавершитьОперацию = ДополнительныеПараметры.ОповещениеЗавершитьОперацию;
	
	ПлатежнаяСистема = Форма.ПлатежнаяСистема_БанкКлиента;
	
	Если РезультатОперации.СтатусОперации = "ТребуетсяПодтверждение" Тогда
		
		Если ЗначениеЗаполнено(РезультатОперации.Подтверждение.НомерТелефона)
			И ЗначениеЗаполнено(РезультатОперации.Подтверждение.НомерСчета) Тогда
			
			ШаблонСтроки = НСтр("ru = 'Денежные средства будут переведены %1 (номер телефона %2) в %3 на расчетный счет %4.
										|Проверьте реквизиты и подтвердите перевод.'");
			
			Форма.Элементы.ДекорацияПодтверждениеВозврата.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонСтроки,
					РезультатОперации.Подтверждение.ФИО,
					РезультатОперации.Подтверждение.НомерТелефона,
					Форма.Элементы.ПлатежнаяСистема.СписокВыбора.НайтиПоЗначению(ПлатежнаяСистема).Представление,
					РезультатОперации.Подтверждение.НомерСчета);
				
		Иначе
			
			ШаблонСтроки = НСтр("ru = 'Денежные средства будут переведены %1 в %2 на расчетный счет.
										|Проверьте реквизиты и подтвердите перевод.'");
			
			Форма.Элементы.ДекорацияПодтверждениеВозврата.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонСтроки,
					РезультатОперации.Подтверждение.ФИО,
					Форма.Элементы.ПлатежнаяСистема.СписокВыбора.НайтиПоЗначению(ПлатежнаяСистема).Представление);
					
		КонецЕсли;
		
		ПерейтиНаСтраницу(Форма, "ГруппаПодтверждениеВозврата");
		
	ИначеЕсли РезультатОперации.СтатусОперации = "Выполняется" Тогда
		
		Если ЗапускПроверкиСтатуса Тогда
			ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
				НСтр("ru = 'Получение подтверждения возврата оплаты. Пожалуйста, подождите...'"));
			ПерейтиНаСтраницу(Форма, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
			ОпределитьСтатусВозврата(Форма, ДополнительныеПараметры);
		Иначе
			ПерейтиНаСтраницу(Форма, "ГруппаИстеклоВремяОжидания");
		КонецЕсли;
		
	ИначеЕсли РезультатОперации.СтатусОперации = "Выполнена" Тогда
		
		ПерейтиНаСтраницу(Форма, "ГруппаЗавершение");
		
		ВыполнитьОбработкуОповещения(ОповещениеЗавершитьОперацию, "ДобавитьВидОплаты");
		
	Иначе
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", РезультатОперации.СообщениеОбОшибке);
		ПерейтиНаСтраницу(Форма, "ГруппаОшибка", ПараметрыСтраницы);
		
	КонецЕсли;
	
КонецПроцедуры

Функция НоваяЗаявка(Форма)
	
	ТекущаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	НастройкиИнтеграции = Форма.ПлатежнаяСистема_НоваяЗаявка.НастройкиИнтеграции;
	
	Заявка = Новый Структура;
	Заявка.Вставить("ДокументОплаты",             Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументОплаты);
	Заявка.Вставить("ИтогПоЧеку",                 Форма.ПлатежнаяСистема_НоваяЗаявка.ИтогПоОрганизации);
	Заявка.Вставить("НомерДокумента",             Форма.ПлатежнаяСистема_НоваяЗаявка.НомерДокумента);
	Заявка.Вставить("Дата",                       ТекущаяДата);
	Заявка.Вставить("Интеграция",                 Форма.ПлатежнаяСистема_НоваяЗаявка.Интеграция);
	Заявка.Вставить("Организация",                Форма.ПлатежнаяСистема_НоваяЗаявка.Организация);
	Заявка.Вставить("ТорговыйОбъект",             Форма.ПлатежнаяСистема_НоваяЗаявка.Магазин);
	Заявка.Вставить("ИспользоватьКассовуюСсылку", НастройкиИнтеграции.КассовыеСсылки);
	Заявка.Вставить("КассаККМ",                   Форма.ПлатежнаяСистема_НоваяЗаявка.КассаККМ);
	Заявка.Вставить("СпособОплаты",               Форма.ПлатежнаяСистема_НоваяЗаявка.СпособОплатыПлатежнойСистемы);
	
	Если Не Форма.ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа Тогда
		
		Заявка.Вставить("ДокументОплаты",      Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументОплаты); 
		Заявка.Вставить("ДокументВозврата",    Форма.ПлатежнаяСистема_НоваяЗаявка.ДокументВозврата);
		Заявка.Вставить("ИдентификаторОплаты", Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторОплаты);
		Заявка.Вставить("ПлатежнаяСистема",
			?(ЗначениеЗаполнено(Форма.ПлатежнаяСистема_БанкКлиента), Форма.ПлатежнаяСистема_БанкКлиента, Неопределено));
		
	Иначе
		Заявка.Вставить("Товары", Форма.ПлатежнаяСистема_НоваяЗаявка.Товары);
	КонецЕсли;
	
	Возврат Заявка;
	
КонецФункции

Процедура ПерейтиНаСтраницу(Форма, ИмяЭлемента, ПараметрыСтраницы = Неопределено) Экспорт
	
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьТекущийСлойГруппы(Форма.Элементы.ГруппаПанельДействий);
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьТекущийСлойГруппы(Форма.Элементы[ИмяЭлемента]);
	
	СообщениеОбОшибке       = "";
	ТекстДлительнойОперации = "";
	Если ПараметрыСтраницы <> Неопределено Тогда
		ПараметрыСтраницы.Свойство("СообщениеОбОшибке",       СообщениеОбОшибке);
		ПараметрыСтраницы.Свойство("ТекстДлительнойОперации", ТекстДлительнойОперации);
	КонецЕсли;
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.НастроитьФормуПоИнтеграции(
		Форма, СообщениеОбОшибке, ТекстДлительнойОперации);
	
КонецПроцедуры

#КонецОбласти

