
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидПоказателяВидОперации = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.ВидОперации;
	ВидПоказателяСтатья 	 = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Статья;
	ВидПоказателяАвтор 		 = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Автор;
	ВидПоказателяСумма 		 = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Сумма;
	ВидыОперацийПустаяСсылка = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.ПустаяСсылка();
	ПользователиПустаяСсылка = Справочники.Пользователи.ПустаяСсылка();
	СтатьяПустаяссылка 	 = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Параметры.Маршрут) Тогда
		Запись.Маршрут = Параметры.Маршрут;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ВидПоказателя) Тогда
		Запись.ВидПоказателя = Параметры.ВидПоказателя;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ДанныеЗаявки) Тогда
		ДанныеЗаявки = Параметры.ДанныеЗаявки;
		Запись.ВидПоказателя = ВидПоказателяАвтор;
		Запись.ЗначениеДляСравнения = ДанныеЗаявки.Автор;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидСравнения();
	
	Если Не ЗначениеЗаполнено(Запись.ЗначениеДляСравнения) Тогда
		УстановитьТипЗначенияДляСравнения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПоказателяПриИзменении(Элемент)
	
	УстановитьВидСравнения();
	УстановитьТипЗначенияДляСравнения();
	
	Если ЗначениеЗаполнено(ДанныеЗаявки) Тогда
		УстановитьЗначениеДляСравнения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидСравнения()
	
	Если Запись.ВидПоказателя <> ВидПоказателяСумма Тогда
	
		Элементы.ВидСравнения.КнопкаВыпадающегоСписка = Ложь;
		Элементы.ВидСравнения.ТолькоПросмотр = Истина;
		Запись.ВидСравнения = ПредопределенноеЗначение("Перечисление.ВидСравненияЗначений.Равно");
		
	Иначе
		
		Элементы.ВидСравнения.КнопкаВыпадающегоСписка = Истина;
		Элементы.ВидСравнения.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьТипЗначенияДляСравнения()
	
	Если Запись.ВидПоказателя = ВидПоказателяВидОперации Тогда
		
		Запись.ЗначениеДляСравнения = ВидыОперацийПустаяСсылка;
		
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяСтатья Тогда
		
		Запись.ЗначениеДляСравнения = СтатьяПустаяссылка;
		
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяАвтор Тогда
		
		Запись.ЗначениеДляСравнения = ПользователиПустаяСсылка;
		
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяСумма Тогда
		
		Запись.ЗначениеДляСравнения = 0;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеДляСравнения()
	
	Если Запись.ВидПоказателя = ВидПоказателяВидОперации Тогда
		
		Запись.ЗначениеДляСравнения = ДанныеЗаявки.ВидОперации;
	
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяСтатья Тогда
		
		Запись.ЗначениеДляСравнения = ДанныеЗаявки.Статья;
	
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяАвтор Тогда
		
		Запись.ЗначениеДляСравнения = ДанныеЗаявки.Автор;
		
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяСумма Тогда
		
		Запись.ЗначениеДляСравнения = ДанныеЗаявки.Сумма;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти