////////////////////////////////////////////////////////////////////////////////
// Модуль формы Обработка.ОбменСКонтрагентами.ТекущиеДелаПоЭДО85.

// Параметры формы:
//  * РежимОтображения - Строка - режим просмотра, устанавливаемый при открытии.
//                                Доступные значения: См. РежимыОтображенияФормы.
//  * Раздел - Строка - раздел, устанавливаемый при открытии. Доступные разделы: см. ИнициализироватьРазделы.
//  * ОтборУчетныхДокументов - Массив Из Структура - отборы, которые нужно установить на прикладной документ в разделе "Создать": 
//   ** Поле - Строка - путь к данным, на которые устанавливается отбор. Должно начинаться с "Документ".
//		Примеры: "Документ", "Документ.Организация".
//   ** ВидСравнения - ВидСравненияКомпоновкиДанных - вид сравнения отбора.
//   ** Значение - Произвольный - значение отбора.
//  * ОтборВходящихДокументов - Массив Из Структура - отборы, которые нужно установить на входящие электронные документы:
//   ** Поле - Строка - путь к данным, на которые устанавливается отбор. Должно начинаться с "ЭлектронныйДокумент".
//		Примеры: "ЭлектронныйДокумент", "ЭлектронныйДокумент.СодержитДанныеОМаркируемыхТоварах"
//   ** ВидСравнения - ВидСравненияКомпоновкиДанных - вид сравнения отбора.
//   ** Значение - Произвольный - значение отбора.
//  * ОтборИсходящихДокументов - Массив Из Структура - отборы, которые нужно установить на исходящие электронные документы:
//   ** Поле - Строка - путь к данным, на которые устанавливается отбор. Должно начинаться с "ЭлектронныйДокумент".
//		Примеры: "ЭлектронныйДокумент", "ЭлектронныйДокумент.СодержитДанныеОМаркируемыхТоварах"
//   ** ВидСравнения - ВидСравненияКомпоновкиДанных - вид сравнения отбора.
//   ** Значение - Произвольный - значение отбора.
//   
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВариантыИнтерфейса = ИнтерфейсДокументовЭДОКлиентСервер.ВариантыИнтерфейсаДокументовЭДО();
	ТекущийВариантИнтерфейса = ИнтерфейсДокументовЭДО.ВариантИнтерфейсаДокументовЭДО();
	Если ТекущийВариантИнтерфейса <> ВариантыИнтерфейса.Расширенный Тогда
		ВызватьИсключение ИнтерфейсДокументовЭДО.ТекстСообщенияОНедоступностиОткрытияФормыТекущихДелЭДО( 
			Метаданные.Обработки.ИнтерфейсДокументовЭДО.Формы.ТекущиеДелаПоЭДО.Синоним,
			ТекущийВариантИнтерфейса);
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(
		"РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам", ЭтотОбъект);
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(
		"РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами", ЭтотОбъект);
	
	Если ТолькоПросмотр Тогда
		Для Каждого Команда Из Команды Цикл
			Команда.ИзменяетСохраняемыеДанные = Истина;
		КонецЦикла;
	КонецЕсли;
	
	АдресКэшаРасчетов = ПоместитьВоВременноеХранилище(Новый Соответствие, УникальныйИдентификатор);
	
	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
	ЗаполнитьНастройкиФормы();
	
	УстановитьУсловноеОформление();
	
	ОбновитьЗаголовокФормы();
	
	ОбновитьЗаголовкиЭлементов();
	
	ИнициализироватьДерево();

	ИнтерфейсДокументовЭДО.ИнициализироватьРазделыТекущихДел(ОписаниеРазделов);
	
	Если ЗначениеЗаполнено(Параметры.РежимОтображения) Тогда
		УстановитьРежимОтображения(Параметры.РежимОтображения);
	КонецЕсли;

	ОбновитьВидимостьРазделовДерева(ДеревоДействий, РежимОтображения);
	
	СформироватьТаблицуБыстрогоОтбора();
	ЗагрузитьОтборы();
	НастроитьБыстрыеОтборы(ЭтотОбъект);

	НастроитьВидимостьДоступностьКомандПоПравам();
	
	Для Каждого ТаблицаФормы Из ТаблицыФормы() Цикл
		СкрытьСлужебныеКомандыТаблицы(Элементы[ТаблицаФормы.Значение].КоманднаяПанель.ПодчиненныеЭлементы);
	КонецЦикла;
	
	НастроитьВидимостьДоговоровКонтрагентов();

	УстановитьОтборУчетныхДокументов(Параметры.ОтборУчетныхДокументов);
	УстановитьОтборВходящихДокументов(Параметры.ОтборВходящихДокументов);
	УстановитьОтборИсходящихДокументов(Параметры.ОтборИсходящихДокументов);

	НастроитьСпискиРазделов();
	Если ЗначениеЗаполнено(Параметры.Раздел) Тогда
		ПоказатьРазделСПроверкой(Параметры.Раздел);
	Иначе
		ПоказатьРаздел(РазделыФормы().Входящие);
	КонецЕсли;
	
	ОбновитьНавигациюПоРазделамНаСервере(Истина, Ложь);

	УстановитьНавигационнуюСсылкуФормы();

	УстановитьСвойстваПереопределяемыхЭлементовФормы();
	
	УстановитьОтображениеЭлементовПоНастройкамПользователя();
	
	ВывестиВерсиюБЭД();
	
	Задолженность = СведенияОЗадолженности();
	ПоказатьУведомленияПоЗадолженности(ЭтотОбъект, Задолженность);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	КонтекстныеПодсказкиБЭД.КонтекстныеПодсказки_ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПанельКонтекстныхНовостей,
		Элементы.ГруппаКонтекстныхПодсказок);
	СформироватьКонтекст();
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	
	ПараметрыПриСозданииНаСервере = АвтоматическоеПолучениеЭДО.НовыеПараметрыФормыСпискаПриСозданииНаСервере();
	АвтоматическоеПолучениеЭДО.ФормаСпискаПриСозданииНаСервере(ЭтотОбъект, ПараметрыПриСозданииНаСервере);
	
	УчетныеЗаписиЭДО.НастроитьГруппуПредупреждениеОЗавершенииДокументовТакском(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияСостоянияЭДО()
		Или ИмяСобытия = "ОбновитьСостояниеПриглашений"
		Или ИмяСобытия = ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияТекущихДелЭДО()Тогда

		ОбновитьТекущиеДелаПоЭДО(Параметр);
		
	ИначеЕсли ИмяСобытия = "ВыполнитьСинхронизацию" Тогда
		
		Активизировать();
		ОтправитьИПолучитьЭД(Неопределено);

	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
		И (Источник = "ОтправлятьВходящиеДокументыНаУтверждение"
		Или Источник = "ИспользоватьОтложеннуюОтправкуЭлектронныхДокументов") Тогда

		Если Источник = "ОтправлятьВходящиеДокументыНаУтверждение" Тогда
			ПриИзмененииУтвержденияВходящихДокументов();
		КонецЕсли;
		
		ОбновитьОтображениеДанных();
		ОбновитьЗаголовкиЭлементов();
		РазблокироватьЗаблокированныеЭлементыФормы();
		ПодключитьОбработчикОжидания("РазвернутьУзлыДереваОтложенно", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант" 
		И Источник = "ИспользоватьРазделениеДокументовПоОтветственнымЭДО" Тогда
		
		РежимОтображения = РежимыОтображенияФормы().ВсеДокументы;
		ОбновитьОтображениеДанных();
		
	ИначеЕсли ИмяСобытия = "ПрочтениеОбновитьСписок" Тогда
		
		ОбновитьДинамическиеСписки();
		
	ИначеЕсли ИмяСобытия = ИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияНастроекТекущихДелЭДО() Тогда
		
		ПриИзмененииНастроек();
		
	КонецЕсли;
	
	ОчиститьОбластьПросмотраЕслиСписокПуст();

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	КонтекстныеПодсказкиБЭДКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	
	АвтоматическоеПолучениеЭДОКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбработкаНеисправностейБЭДКлиент.ЗаполнитьДанныеСлужбыПоддержки(ТелефонСлужбыПоддержки, АдресЭлектроннойПочтыСлужбыПоддержки);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	КонтекстныеПодсказкиБЭДКлиент.КонтекстныеНовости_ПриОткрытии(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)

	СохранитьОтборы(ИмяФормы, "Отборы", БыстрыеОтборы);

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормы, "РежимОтображения", РежимОтображения);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	ОбновитьНавигациюПоРазделамНаСервере(Ложь, Истина);
	
	ПоказыватьОбластьПросмотра = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы,
		"ПоказыватьОбластьПросмотра", Ложь);
	ПоказыватьОбластьЛегенды = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы, 
		"ПоказыватьОбластьЛегенды", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказатьКомментарийСостояния(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ПоказатьКомментарийКСостояниюДокумента(ТекущийКомментарийСостояния);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПомощьНажатие(Элемент)
	
	ПодменюПомощьПоказатьВыборИзМеню(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПомощьКартинкаНажатие(Элемент)
	
	ПодменюПомощьПоказатьВыборИзМеню(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСервисНажатие(Элемент)
	
	ПодменюСервисПоказатьВыборИзМеню(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСервисКартинкаНажатие(Элемент)
	
	ПодменюСервисПоказатьВыборИзМеню(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкиНажатие(Элемент)
	
	ПодменюНастройкиПоказатьВыборИзМеню(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкиКартинкаНажатие(Элемент)
	
	ПодменюНастройкиПоказатьВыборИзМеню(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБыстрыеОтборыНажатие(Элемент)
	
	ПоказатьБыстрыеОтборы = Не ПоказатьБыстрыеОтборы;
	НастроитьБыстрыеОтборы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБыстрыеОтборыКартинкаНажатие(Элемент)
	
	ПоказатьБыстрыеОтборы = Не ПоказатьБыстрыеОтборы;
	НастроитьБыстрыеОтборы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПредупреждениеОЗавершенииДокументовТакскомОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УчетныеЗаписиЭДОКлиент.ОбработкаНавигационнойСсылкиЗавершенияДокументовТакском(Элемент, 
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
		
КонецПроцедуры

#Область ОбработчикиСобытийОбластьПросмотра

&НаКлиенте
Процедура НадписьОшибкаФормированияПредставленияОбработкаНавигационнойСсылки(Элемент, 
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьЖурналРегистрации" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОтборЖурналаРегистрации = Новый Структура;
		ОтборЖурналаРегистрации.Вставить("Данные", "ЭлектронныеДокументыЭДО.ПредставлениеДанныхДокумента");
		ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ОтборЖурналаРегистрации, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийДокументУчетаПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущийСписок = ПолучитьТекущийСписок();

	Если ЗначениеЗаполнено(ТекущийДокументУчета) Тогда
		ПоказатьЗначение( , ТекущийДокументУчета);
	ИначеЕсли ТекущийСписок = Элементы.ВходящиеЭД Тогда
			
		ТекущиеДанные = ТекущийСписок.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьДанныеВЗависимостиОтОтраженияВУчете(ТекущиеДанные.КонтрольОтраженияВУчете);
		
	Иначе

		ПоказатьРасширенныйПодборДокументовУчета();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийФайлПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДляРедактирования = Ложь;
	ИнтерфейсДокументовЭДОКлиент.ОткрытьФайл(ТекущийФайл, УникальныйИдентификатор, ДляРедактирования);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНоменклатураКонтрагентов

&НаКлиенте
Процедура НоменклатураКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле,	СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПоказатьСопоставлениеНоменклатуры();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБыстрыеОтборы

&НаКлиенте
Процедура БыстрыеОтборыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если СтрНайти(Поле.Имя, "Кнопка") <> 0 Тогда

		ИмяСписка = СписокРаздела(ТекущийРаздел);
		Список = ЭтотОбъект[ИмяСписка];

		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Раздел", ТекущийРаздел);

		Оповещение = Новый ОписаниеОповещения("ПриОкончанииНастройкиСписка", ЭтотОбъект, ДопПараметры);

		ИнтерфейсДокументовЭДОКлиент.ОткрытьНастройкиОтборовСписка(Оповещение, ЭтотОбъект, Список.КомпоновщикНастроек)
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БыстрыеОтборыПриАктивизацииСтроки(Элемент)
	
	СтрокаБыстрыеОтборы = Элементы.БыстрыеОтборы.ТекущаяСтрока;
	ТекущиеДанныеБыстрыеОтборы = Элементы.БыстрыеОтборы.ТекущиеДанные;
	
	Если ТекущаяСтрокаВОтбореВПапке = СтрокаБыстрыеОтборы Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаВОтбореВПапке = СтрокаБыстрыеОтборы;
	
	Если ТекущаяСтрокаВОтбореВПапке = Неопределено
		Или ТекущиеДанныеБыстрыеОтборы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанныеБыстрыеОтборы.Значение = Неопределено
		И ТекущиеДанныеБыстрыеОтборы.Тип = "Булево" Тогда
		
		Элементы.БыстрыеОтборыЗначение.КнопкаВыпадающегоСписка = Истина;
		Элементы.БыстрыеОтборыЗначение.КнопкаВыбора = Ложь;
		
	ИначеЕсли СтрНайти(ТекущиеДанныеБыстрыеОтборы.Тип, "СправочникСсылка")
		Или ТекущиеДанныеБыстрыеОтборы.Параметр = "ВидДокумента" Тогда
		
		Элементы.БыстрыеОтборыЗначение.КнопкаВыпадающегоСписка = Истина;
		Элементы.БыстрыеОтборыЗначение.КнопкаВыбора = Истина;
		
	ИначеЕсли ТекущиеДанныеБыстрыеОтборы.Тип = "Дата" Тогда
		
		Элементы.БыстрыеОтборыЗначение.КнопкаВыпадающегоСписка = Ложь;
		Элементы.БыстрыеОтборыЗначение.КнопкаВыбора = Истина;
		
	Иначе
		
		Элементы.БыстрыеОтборыЗначение.КнопкаВыпадающегоСписка = Ложь;
		Элементы.БыстрыеОтборыЗначение.КнопкаВыбора = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БыстрыеОтборыЗначениеПриИзменении(Элемент)

	ДанныеБыстрыеОтборы = Элемент.Родитель.ТекущиеДанные;
	Если ДанныеБыстрыеОтборы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеБыстрыеОтборы.Тип = "Число" И ДанныеБыстрыеОтборы.Значение = 0 Тогда
		ДанныеБыстрыеОтборы.Значение = Неопределено;
	КонецЕсли;
	
	ПриИзмененииОтбора();

КонецПроцедуры

&НаКлиенте
Процедура БыстрыеОтборыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ДанныеБыстрыеОтборы = Элемент.ТекущиеДанные;
	Если ДанныеБыстрыеОтборы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеБыстрыеОтборы.Тип = "Число" И ДанныеБыстрыеОтборы.Значение = Неопределено Тогда
		ДанныеБыстрыеОтборы.Значение = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БыстрыеОтборыПриОкончанииРедактирования(Элемент, НоваяСтрока,	ОтменаРедактирования)

	ДанныеБыстрыеОтборы = Элемент.ТекущиеДанные;
	Если ДанныеБыстрыеОтборы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеБыстрыеОтборы.Тип = "Число" И ДанныеБыстрыеОтборы.Значение = 0 Тогда
		ДанныеБыстрыеОтборы.Значение = Неопределено;
	КонецЕсли;

	СохраняемыеВНастройкахДанныеМодифицированы = Истина;

КонецПроцедуры

&НаКлиенте
Процедура БыстрыеОтборыЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	БыстрыеОтборыУстановлены = Ложь;

	ДанныеБыстрыеОтборы = Элементы.БыстрыеОтборы.ТекущиеДанные;
	Если ДанныеБыстрыеОтборы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НазваниеСправочникаКонтрагенты = ИмяПрикладногоСправочника("Контрагенты");
	Если Не ЗначениеЗаполнено(НазваниеСправочникаКонтрагенты) Тогда
		НазваниеСправочникаКонтрагенты = "Контрагенты";
	КонецЕсли;

	НазваниеСправочникаОрганизации = ИмяПрикладногоСправочника("Организации");
	Если Не ЗначениеЗаполнено(НазваниеСправочникаОрганизации) Тогда
		НазваниеСправочникаОрганизации = "Организации";
	КонецЕсли;
	
	Если ДанныеБыстрыеОтборы.Тип = "Строка" Тогда
		ДанныеБыстрыеОтборы.Значение = "";
	ИначеЕсли ДанныеБыстрыеОтборы.Тип = "Дата" Тогда
		ДанныеБыстрыеОтборы.Значение = Дата(1, 1, 1);
	ИначеЕсли ДанныеБыстрыеОтборы.Тип = "Число" Тогда
		ДанныеБыстрыеОтборы.Значение = Неопределено;
	ИначеЕсли ДанныеБыстрыеОтборы.Тип = "Булево" Тогда
		ДанныеБыстрыеОтборы.Значение = Неопределено;
	ИначеЕсли ДанныеБыстрыеОтборы.Тип = "ПеречислениеСсылка.ТипыДокументовЭДО" Тогда
		ДанныеБыстрыеОтборы.Значение = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ПустаяСсылка");
	ИначеЕсли ДанныеБыстрыеОтборы.Тип = "СправочникСсылка." + НазваниеСправочникаКонтрагенты Тогда
		ДанныеБыстрыеОтборы.Значение = ПредопределенноеЗначение("Справочник." + НазваниеСправочникаКонтрагенты 
			+ ".ПустаяСсылка");
	ИначеЕсли ДанныеБыстрыеОтборы.Тип = "СправочникСсылка." + НазваниеСправочникаОрганизации Тогда
		ДанныеБыстрыеОтборы.Значение = ПредопределенноеЗначение("Справочник." + НазваниеСправочникаОрганизации 
			+ ".ПустаяСсылка");
	ИначеЕсли ДанныеБыстрыеОтборы.Тип = "СправочникСсылка.Пользователи" Тогда
		ДанныеБыстрыеОтборы.Значение = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	ИначеЕсли ДанныеБыстрыеОтборы.Тип = "ПеречислениеСсылка.НаправленияЭДО" Тогда
		ДанныеБыстрыеОтборы.Значение = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.ПустаяСсылка");
	ИначеЕсли ДанныеБыстрыеОтборы.Тип = "СправочникСсылка.ВидыДокументовЭДО" Тогда
		ДанныеБыстрыеОтборы.Значение = ПредопределенноеЗначение("Справочник.ВидыДокументовЭДО.ПустаяСсылка");;
	КонецЕсли;

	ПриИзмененииОтбора();

КонецПроцедуры

&НаКлиенте
Процедура БыстрыеОтборыЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ДанныеБыстрыеОтборы = Элементы.БыстрыеОтборы.ТекущиеДанные;
	Если ДанныеБыстрыеОтборы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеБыстрыеОтборы.Параметр = "ВидДокумента" Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = СписокВидовДокументов;
	ИначеЕсли ДанныеБыстрыеОтборы.Параметр = "Прочтен" Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Истина);
		ДанныеВыбора.Добавить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоДействий

&НаКлиенте
Процедура ДеревоДействийПриАктивизацииСтроки(Элемент)

	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НовыйРаздел = Элемент.ТекущиеДанные.Значение;
	Если НовыйРаздел <> ТекущийРаздел Тогда
		ПриИзмененииРаздела(НовыйРаздел, Истина);
		ПодключитьОбработчикОжидания("УстановитьУсловноеОформлениеКлиент", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВходящиеЭД

&НаКлиенте
Процедура ВходящиеЭДПриИзменении(Элемент)
		
	Оповестить(ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияТекущихДелЭДО());

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);

	ЭтоКаталогТоваров =
		(ДанныеСтроки.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.КаталогТоваров"));

	Если Поле.Имя = "ВходящиеЭДОтражениеВУчете" И Не ЭтоКаталогТоваров Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьДанныеВЗависимостиОтОтраженияВУчете(ДанныеСтроки.КонтрольОтраженияВУчете);
	Иначе
		СтандартнаяОбработка = Ложь;
		ОткрытьЭлектронныйДокументДляПросмотра(ДанныеСтроки);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВходящиеЭДПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки,
		Строки)

	Если Не ЗначениеЗаполнено(Строки) Тогда
		Возврат;
	КонецЕсли;

	ЭлектронныеДокументы = Новый Массив;

	Для каждого ТекущаяСтрока Из Строки Цикл

		Данные = ТекущаяСтрока.Значение.Данные;
		ЭлектронныеДокументы.Добавить(Данные.ЭлектронныйДокумент);

	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = ИнтеграцияЭДО.ТекстЗапросаОбъектовУчетаЭлектронныхДокументов();
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныеДокументы);

	УстановитьПривилегированныйРежим(Истина);
	Основания = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);

	Для каждого ТекущаяСтрока Из Строки Цикл

		Данные = ТекущаяСтрока.Значение.Данные;

		ОтборЭД = Новый Структура("ЭлектронныйДокумент", Данные.ЭлектронныйДокумент);
		ОснованияЭД = Основания.НайтиСтроки(ОтборЭД);

		Если ЗначениеЗаполнено(ОснованияЭД) Тогда

			Представление = "";
			КоличествоОснований = ОснованияЭД.Количество();
			Если КоличествоОснований = 1 Тогда
				Представление = Строка(ОснованияЭД[0].ОбъектУчета);
			Иначе
				ШаблонСтроки = НСтр("ru = ';%1 документ;;%1 документа;%1 документов;%1 документов'");
				Представление = СтрокаСЧислом(ШаблонСтроки, КоличествоОснований, ВидЧисловогоЗначения.Количественное);
			КонецЕсли;
			Данные.ОтражениеВУчете = Представление;

		ИначеЕсли Данные.КонтрольОтраженияВУчете = 0 Тогда
			Данные.ОтражениеВУчете = НСтр("ru = 'Сопоставить номенклатуру'");
		ИначеЕсли Данные.КонтрольОтраженияВУчете = 1 Тогда
			Если Данные.ТипДокумента = Перечисления.ТипыДокументовЭДО.КонтрактЕИС Тогда
				Данные.ОтражениеВУчете = НСтр("ru = 'Создать контракт'");
			Иначе
				Данные.ОтражениеВУчете = НСтр("ru = 'Создать документы'");
			КонецЕсли;
		ИначеЕсли Данные.КонтрольОтраженияВУчете = 2 Тогда
			Данные.ОтражениеВУчете = НСтр("ru = 'Провести документы'");
		Иначе
			Данные.ОтражениеВУчете = НСтр("ru = '<Не требуется>'");
		КонецЕсли;

	КонецЦикла;
	
	РассчитатьДополнительныеПоляПакетов(Строки);

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДОбработкаЗапросаОбновления()

	ОбновитьНавигациюПоРазделамНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущийИдентификаторПакета = ТекущиеДанные.КлючСортировкиПакета;
		ТекущийЭлектронныйДокумент = ТекущиеДанные.ЭлектронныйДокумент;
	Иначе
		ТекущийИдентификаторПакета = "";
		ТекущийЭлектронныйДокумент = Неопределено;
	КонецЕсли;
	
	Если ПакетноеОтображение Тогда
		ЗаполнитьВыбранныеДанные();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсходящиеЭД

&НаКлиенте
Процедура ИсходящиеЭДПриИзменении(Элемент)
	
	Оповестить(ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияТекущихДелЭДО());
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДВыбор(Элемент, ВыбраннаяСтрока, Поле,
		СтандартнаяОбработка)

	Если Поле.Имя = "ИсходящиеЭДОтражениеВУчете" Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьУчетныйДокумент("ИсходящиеЭД");
	Иначе
		СтандартнаяОбработка = Ложь;
		ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
		ОткрытьЭлектронныйДокументДляПросмотра(ДанныеСтроки);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсходящиеЭДПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки,
		Строки)
	
	Если Не ЗначениеЗаполнено(Строки) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументы = Новый Массив;

	Для каждого ТекущаяСтрока Из Строки Цикл

		Данные = ТекущаяСтрока.Значение.Данные;
		ЭлектронныеДокументы.Добавить(Данные.ЭлектронныйДокумент);

	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = ИнтеграцияЭДО.ТекстЗапросаОбъектовУчетаЭлектронныхДокументов();
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныеДокументы);

	УстановитьПривилегированныйРежим(Истина);
	Основания = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);

	Для каждого ТекущаяСтрока Из Строки Цикл

		Данные = ТекущаяСтрока.Значение.Данные;

		ОтборЭД = Новый Структура("ЭлектронныйДокумент", Данные.ЭлектронныйДокумент);
		ОснованияЭД = Основания.НайтиСтроки(ОтборЭД);

		Если ЗначениеЗаполнено(ОснованияЭД) Тогда

			Представление = "";
			КоличествоОснований = ОснованияЭД.Количество();
			Если КоличествоОснований = 1 Тогда
				Представление = Строка(ОснованияЭД[0].ОбъектУчета);
			Иначе
				ШаблонСтроки = НСтр("ru = ';%1 документ;;%1 документа;%1 документов;%1 документов'");
				Представление = СтрокаСЧислом(ШаблонСтроки, КоличествоОснований, ВидЧисловогоЗначения.Количественное);
			КонецЕсли;
			Данные.ОтражениеВУчете = Представление;

		КонецЕсли;
	
	КонецЦикла;
	
	РассчитатьДополнительныеПоляПакетов(Строки);

КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДОбработкаЗапросаОбновления()

	ОбновитьНавигациюПоРазделамНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущийИдентификаторПакета = ТекущиеДанные.КлючСортировкиПакета;
		ТекущийЭлектронныйДокумент = ТекущиеДанные.ЭлектронныйДокумент;
	Иначе
		ТекущийИдентификаторПакета = "";
		ТекущийЭлектронныйДокумент = Неопределено;
	КонецЕсли;
	
	Если ПакетноеОтображение Тогда
		ЗаполнитьВыбранныеДанные();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСформироватьЭД

&НаКлиенте
Процедура СформироватьЭДВыбор(Элемент, ВыбраннаяСтрока, Поле,
		СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьЭДПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;

	ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОзнакомитьсяЭД

&НаКлиенте
Процедура ОзнакомитьсяЭДВыбор(Элемент, ВыбраннаяСтрока, Поле,
		СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Данные = Элемент.ДанныеСтроки(ВыбраннаяСтрока);

	ПоказатьЗначение(, Данные.ЭлектронныйДокумент);

КонецПроцедуры

&НаКлиенте
Процедура ОзнакомитьсяЭДОбработкаЗапросаОбновления()

	ОбновитьНавигациюПоРазделамНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОзнакомитьсяЭДПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущийИдентификаторПакета = ТекущиеДанные.КлючСортировкиПакета;
		ТекущийЭлектронныйДокумент = ТекущиеДанные.ЭлектронныйДокумент;
	Иначе
		ТекущийИдентификаторПакета = "";
		ТекущийЭлектронныйДокумент = Неопределено;
	КонецЕсли;
	
	Если ПакетноеОтображение Тогда
		ЗаполнитьВыбранныеДанные();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.2, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОзнакомитьсяЭДПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	РассчитатьДополнительныеПоляПакетов(Строки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтправитьЭД

&НаКлиенте
Процедура ОтправитьЭДВыбор(Элемент, ВыбраннаяСтрока, Поле,
		СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Данные = Элемент.ДанныеСтроки(ВыбраннаяСтрока);

	ПоказатьЗначение(, Данные.ЭлектронныйДокумент);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЭДПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущийИдентификаторПакета = ТекущиеДанные.КлючСортировкиПакета;
		ТекущийЭлектронныйДокумент = ТекущиеДанные.ЭлектронныйДокумент;
	Иначе
		ТекущийИдентификаторПакета = "";
		ТекущийЭлектронныйДокумент = Неопределено;
	КонецЕсли;
	
	Если ПакетноеОтображение Тогда
		ЗаполнитьВыбранныеДанные();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.2, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтправитьЭДПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	РассчитатьДополнительныеПоляПакетов(Строки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОшибкиЭД

&НаКлиенте
Процедура ОшибкиЭДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Данные = Элемент.ДанныеСтроки(ВыбраннаяСтрока);

	ПоказатьЗначение(, Данные.ЭлектронныйДокумент);

КонецПроцедуры

&НаКлиенте
Процедура ОшибкиЭДПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущийИдентификаторПакета = ТекущиеДанные.КлючСортировкиПакета;
		ТекущийЭлектронныйДокумент = ТекущиеДанные.ЭлектронныйДокумент;
	Иначе
		ТекущийИдентификаторПакета = "";
		ТекущийЭлектронныйДокумент = Неопределено;
	КонецЕсли;
	
	Если ПакетноеОтображение Тогда
		ЗаполнитьВыбранныеДанные();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.2, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОшибкиЭДПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	РассчитатьДополнительныеПоляПакетов(Строки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьЭДПометитьНаУдаления(Команда)
	
	Если Элементы.ПанельСписков.ТекущаяСтраница <> Элементы.СтраницаОтправитьЭД Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элементы.ОтправитьЭД.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйДокумент = ТекущиеДанные.ЭлектронныйДокумент;
	ПометкаУдаления = ТекущиеДанные.ПометкаУдаления;
	
	ДополнительныеПараметры = Новый Структура("ЭлектронныйДокумент", ЭлектронныйДокумент);
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьПометкуУдаленияВопрос", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщегоНазначенияБЭДКлиент.ЗадатьВопросНаУстановкуПометкиУдаления(ПометкаУдаления, ОписаниеОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриглашенияЭДПриглашенияОтправитьВАрхив(Команда)

	Если Элементы.ПриглашенияЭД.ПолучитьСтрокиДляОбработки().Количество() Тогда
		Элементы.ПриглашенияЭДОтправитьПриглашенияВАрхив.Доступность = Ложь;
		ЗаблокированныеЭлементыФормы.Добавить("ПриглашенияЭДОтправитьПриглашенияВАрхив");
		ПодключитьОбработчикОжидания("ВыполнитьОтправкуПриглашенийВАрхив", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьИПолучитьЭД(Команда)

	Если Не ИспользоватьЭП Тогда
		ТекстСообщения = НастройкиБЭДКлиентСервер.ТекстСообщенияОНеобходимостиНастройкиСистемы("ОтправкаИПолучениеЭД");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;	
	КонецЕсли; 

	НастроитьДоступностьЭлементовКомандыОтправитьИПолучить();
	
	Оповещение = Новый ОписаниеОповещения("ОтправкаПолучениеЭДЗавершение", ЭтотОбъект);
	ИнтерфейсДокументовЭДОКлиент.ОтправитьПолучитьДокументыЭДО(ЭтотОбъект, Оповещение);	

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДокумент(Команда)

	Если Элементы.СформироватьЭД.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, Элементы.СформироватьЭД.ТекущиеДанные.Документ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыЭДУстановитьСтатусОтмененКонтейнера(Команда)

	УстановитьСтатусОтменен(Элементы.КонтейнерыЭД.ПолучитьСтрокиДляОбработки());

КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыЭДРаспаковатьВыделенныеКонтейнеры(Команда)

	СинхронизацияЭДОКлиент.РаспаковатьТранспортныеКонтейнеры(Элементы.КонтейнерыЭД.ПолучитьСтрокиДляОбработки()); 
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЭДСформироватьПодписатьИОтправить(Команда)
	
	Если Элементы.СформироватьЭД.ПолучитьСтрокиДляОбработки().Количество() Тогда
		Элементы.СформироватьЭДСформироватьПодписатьИОтправить.Доступность = Ложь;
		ЗаблокированныеЭлементыФормы.Добавить("СформироватьЭДСформироватьПодписатьИОтправить");
		ПодключитьОбработчикОжидания("ВыполнитьСформироватьПодписатьИОтправить", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЭДПросмотретьЭД(Команда)
	
	Если Элементы.СформироватьЭД.ТекущиеДанные <> Неопределено Тогда
		ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокументОбъектаУчета(Элементы.СформироватьЭД.ТекущиеДанные.Документ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДУтвердитьЭД(Команда)
	
	УтвердитьЭД();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЭДВернутьНаПодготовкуКОтправке(Команда)
	
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел,
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	НаборДействий = Новый Соответствие;	
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтменитьОтправку"));
		
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов;

	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДПодписать(Команда)

	Если Элементы.ВходящиеЭД.ПолучитьСтрокиДляОбработки().Количество() Тогда
		Элементы.ВходящиеЭДПодписать.Доступность = Ложь;
		ЗаблокированныеЭлементыФормы.Добавить("ВходящиеЭДПодписать");
		ПодключитьОбработчикОжидания("ВыполнитьКомандаПодписать", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДПодписать(Команда)

	Если Элементы.ИсходящиеЭД.ПолучитьСтрокиДляОбработки().Количество() Тогда
		Элементы.ИсходящиеЭДПодписать.Доступность = Ложь;
		ЗаблокированныеЭлементыФормы.Добавить("ИсходящиеЭДПодписать");
		ПодключитьОбработчикОжидания("ВыполнитьКомандаПодписать", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЭДОтправить(Команда)
	
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел,
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОтправитьЭДОтправить.Доступность = Ложь;
	Элементы.ОтправитьЭДВернутьНаПодготовкуКОтправке.Доступность = Ложь;
	ЗаблокированныеЭлементыФормы.Добавить("ОтправитьЭДОтправить");
	ЗаблокированныеЭлементыФормы.Добавить("ОтправитьЭДВернутьНаПодготовкуКОтправке");
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);

	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
		ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	Если Не ИнтерфейсДокументовЭДОВызовСервера.ОтложеннаяОтправкаЭлектронныхДокументов() Тогда
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Отправить"));
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов;

	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДОтказатьсяОтПодписания(Команда)

	ОтказатьсяОтПодписания();
		
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДОтклонитьПодписание(Команда)

	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел,
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
		
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел,
		"ЭлектронныйДокумент, ИдентификаторПакета");
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбъектыДействий.ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбъектыДействий.ПакетыДокументов);
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект));
	
	НаборДействий = Новый Соответствие;
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтклонитьПодписание"));
	
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);	
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.ОтклонитьПодписание"));
			
	Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки",
		ИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);
				
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причину отклонения документа'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Отклонить'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для отказа от подписания по выбранным ЭД необходимо указать причину.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДУтвердитьПодписатьИОтправить(Команда)

	Если Элементы.ВходящиеЭД.ПолучитьСтрокиДляОбработки().Количество() Тогда
		Элементы.ВходящиеЭДУтвердитьПодписатьИОтправить.Доступность = Ложь;
		ЗаблокированныеЭлементыФормы.Добавить("ВходящиеЭДУтвердитьПодписатьИОтправить");
		ПодключитьОбработчикОжидания("ВыполнитьУтвердитьПодписатьИОтправить", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДУтвердитьПодписатьИОтправить(Команда)

	Если Элементы.ИсходящиеЭД.ПолучитьСтрокиДляОбработки().Количество() Тогда
		Элементы.ИсходящиеЭДУтвердитьПодписатьИОтправить.Доступность = Ложь;
		ЗаблокированныеЭлементыФормы.Добавить("ИсходящиеЭДУтвердитьПодписатьИОтправить");
		ПодключитьОбработчикОжидания("ВыполнитьУтвердитьПодписатьИОтправить", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СброситьОтбор(Команда)

	СброситьОтборНаСервере();
	НастроитьБыстрыеОтборы(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриглашенияЭДОтправитьПриглашения(Команда)

	ОчиститьСообщения();
	ДанныеПриглашений = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"КлючПриглашения, ИдентификаторОрганизации, ИдентификаторКонтрагента, Контрагент, Организация");

	ИсходящиеПриглашения = Новый Массив;

	Для Каждого ДанныеПриглашения Из ДанныеПриглашений Цикл	
		ИсходящееПриглашение = СинхронизацияЭДОКлиент.НовоеПриглашениеНаИдентификатор();
		ЗаполнитьЗначенияСвойств(ИсходящееПриглашение, ДанныеПриглашения);	
		ИсходящиеПриглашения.Добавить(ИсходящееПриглашение);
	КонецЦикла;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОтправкаПриглашенийОповещениеОЗавершении", ЭтотОбъект);
		
	СинхронизацияЭДОКлиент.ОтправитьПриглашения(ИсходящиеПриглашения, ЭтотОбъект, ОбработчикОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПриглашенияЭДПринятьПриглашения(Команда)

	Если Элементы.ПриглашенияЭД.ПолучитьСтрокиДляОбработки().Количество() Тогда
		Элементы.ПриглашенияЭДПринятьПриглашения.Доступность = Ложь;
		ЗаблокированныеЭлементыФормы.Добавить("ПриглашенияЭДПринятьПриглашения");
		ПодключитьОбработчикОжидания("НачатьПринятиеПриглашений", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриглашенияЭДОтклонитьПриглашения(Команда)

	Если Элементы.ПриглашенияЭД.ПолучитьСтрокиДляОбработки().Количество() Тогда
		Элементы.ПриглашенияЭДОтклонитьПриглашения.Доступность = Ложь;
		ЗаблокированныеЭлементыФормы.Добавить("ПриглашенияЭДОтклонитьПриглашения");
		ПодключитьОбработчикОжидания("НачатьОтклонениеПриглашений", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриглашенияЭДОтозватьПриглашение(Команда)

	Если Элементы.ПриглашенияЭД.ПолучитьСтрокиДляОбработки().Количество() Тогда
		Элементы.ПриглашенияЭДОтозватьПриглашение.Доступность = Ложь;
		ЗаблокированныеЭлементыФормы.Добавить("ПриглашенияЭДОтозватьПриглашение");
		ПодключитьОбработчикОжидания("НачатьОтзывПриглашений", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДПринятьАннулирование(Команда)

	ПринятьАннулирование();

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДОтклонитьАннулирование(Команда)

	ОтклонитьАннулирование();

КонецПроцедуры

&НаКлиенте
Процедура ОзнакомитьсяЭДОтправитьВАрхив(Команда)

	Строки = Элементы.ОзнакомитьсяЭД.ПолучитьСтрокиДляОбработки();

	ЭлектронныеДокументы = ЭлектронныеДокументыНаОзнакомление(Строки);
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтправитьВАрхив"));
		
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ЭлектронныеДокументы;

	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);

	ОбновитьНавигациюПоРазделам();

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДОтклонитьДокумент(Команда)
	
	ОтклонитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДСопоставитьНоменклатуру(Команда)

	ПоказатьСопоставлениеНоменклатуры();

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДПровестиУчетныеДокументы(Команда)

	ЭлектронныеДокументы = Новый Массив;

	Для Каждого СтрокаСписка Из Элементы.ВходящиеЭД.ПолучитьСтрокиДляОбработки() Цикл

		Данные = Элементы.ВходящиеЭД.ДанныеСтроки(СтрокаСписка);
		ЭлектронныеДокументы.Добавить(Данные.ЭлектронныйДокумент);

	КонецЦикла;

	Если Не ЗначениеЗаполнено(ЭлектронныеДокументы) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для проведения необходимо выбрать электронный документ.'"));
		Возврат;
	КонецЕсли;

	НаборУчетныхДокументов = УчетныеДокументыНаКонтролеПроведенияЭД(ЭлектронныеДокументы);

	Если Не ЗначениеЗаполнено(НаборУчетныхДокументов) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для выбранных электронных документов проведение не требуется.'"));
		Возврат;
	КонецЕсли;

	ПоказатьВопросОПроведенииУчетныхДокументов(НаборУчетныхДокументов);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКонтрагентовОткрытьНоменклатуруКонтрагентов(Команда)

	СопоставлениеНоменклатурыКонтрагентовКлиент.ОткрытьФормуСпискаНоменклатурыКонтрагентов(Новый Структура, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЭДСоздатьПроизвольныйДокумент(Команда)

	ЛегкийИнтерфейсДокументовЭДОКлиент.СоздатьДокументыПоФайламКоманда(УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОшибкиЭДОтправитьПовторно(Команда)

	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел,
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтправитьПовторно"));
		
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов;

	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДПометитьКакПрочтенные(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ПометитьКакПрочтенные(Элементы.ВходящиеЭД);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДПометитьКакПрочтенные(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ПометитьКакПрочтенные(Элементы.ИсходящиеЭД);
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДЗакрытьПринудительно(Команда)
	
	ЗакрытьПринудительно();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДЗакрытьПринудительно(Команда)
	
	ЗакрытьПринудительно();
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭДПеренаправить(Команда)
	
	Перенаправить();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДПеренаправить(Команда)
	
	Перенаправить();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДПринятьАннулирование(Команда)
	
	ПринятьАннулирование();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДОтклонитьАннулирование(Команда)
	
	ОтклонитьАннулирование();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЭДЗакрытьПринудительно(Команда)
	
	ЗакрытьПринудительно();
	
КонецПроцедуры

&НаКлиенте
Процедура ОзнакомитьсяЭДПеренаправить(Команда)
	
	Перенаправить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЭДЗакрытьПринудительно(Команда)
	
	ЗакрытьПринудительно();
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиЭДЗакрытьПринудительно(Команда)
	
	ЗакрытьПринудительно();
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиЭДПеренаправить(Команда)
	
	Перенаправить();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКонтрагентовСопоставитьНоменклатуру(Команда)
	
	ПоказатьСопоставлениеНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭДСоздатьПроизвольныйДокумент(Команда)
	
	ЛегкийИнтерфейсДокументовЭДОКлиент.СоздатьДокументыПоФайламКоманда(УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПриглашенияЭДНовоеПриглашение(Команда)
	
	ПараметрыПриглашения = СинхронизацияЭДОКлиент.НовыеПараметрыОткрытияПомощникаОтправкиПриглашения();
	СинхронизацияЭДОКлиент.ОткрытьПомощникОтправкиПриглашения(ПараметрыПриглашения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьМассовыйВыборДокументов(Команда)
	
	ИспользоватьРежимМножественногоВыделенияВСписках = Не ИспользоватьРежимМножественногоВыделенияВСписках;
	
	НастроитьМассовыйВыборДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура Техподдержка(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьОбращениеВСлужбуТехническойПоддержки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолезныеСсылки(Команда)

	ИнтерфейсДокументовЭДОКлиент.ОткрытьФормуПолезныхСсылок();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьИдея(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьСтраницуОпроса();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиЭДО(Команда)
	
	НастройкиЭДОКлиент.ОткрытьФормуНастроекЭДО();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМашиночитаемыеДоверенности(Команда)

	МашиночитаемыеДоверенностиКлиент.ОткрытьОбщуюФормуСписковМЧД();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАрхивЭДО(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьАрхивЭДО();
	
КонецПроцедуры

&НаКлиенте
Процедура МассоваяОтправкаФайлов(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьФормуМассовойЗагрузкиФайлов();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодписи(Команда)
	
	ОбщегоНазначенияБЭДКлиент.ОткрытьФормуБЭД("Обработка.ИнтерфейсДокументовЭДО.Форма.ПроверкаПодписей");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональныеНастройки(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБЭД.Форма.ПерсональныеНастройки",, ЭтотОбъект,,,,,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

&НаСервере
Процедура ЗаполнитьНастройкиФормы()
	
	ЗагрузитьНастройкиИзФормыТакси();
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();

	РежимОтображения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы, "РежимОтображения",
		РежимыОтображенияФормы().ВсеДокументы);
	
	ПакетноеОтображение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы, "ПакетноеОтображение", Истина);
	
	ИспользоватьЭП = ОбщегоНазначенияБЭД.ЗначениеФункциональнойОпции("ИспользоватьЭлектронныеПодписиЭД");
	
	ОтложеннаяОтправкаЭлектронныхДокументов = НастройкиЭДО.ОтложеннаяОтправкаЭлектронныхДокументов();
	
	ПоказыватьОбластьПросмотра = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы,
		"ПоказыватьОбластьПросмотра", Ложь);
	
	ПоказыватьОбластьЛегенды = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы, 
		"ПоказыватьОбластьЛегенды", Ложь);
		
	ПоказыватьПомеченныеНаУдаление = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		ИнтерфейсДокументовЭДОКлиентСервер.КлючОбъектаНастроекИнтерфейсаЭДО(),
		"ОтображатьУдаленные", Ложь);
		
	ЖирныйШрифтФормы = ШрифтыСтиля.ЖирныйШрифтТекстаВторогоУровня85БЭД;
	ОбычныйШрифтФормы = ШрифтыСтиля.ТекстВторогоУровня;
	
	ОтправлятьВходящиеДокументыНаУтверждение = НастройкиЭДО.ОтправлятьВходящиеДокументыНаУтверждение();
	
	ЕстьПравоОбработкиДокументов = ЭлектронныеДокументыЭДО.ЕстьПравоОбработкиДокументов();
	ЕстьПравоАдминистрирования = ОбщегоНазначенияБЭД.ЕстьПравоАдминистрирования();
	ЕстьПравоВыполненияОбмена = СинхронизацияЭДО.ЕстьПравоВыполненияОбмена();
	
	БыстрыеОтборыУстановлены = Ложь;
	
	СписокВидовДокументов.ЗагрузитьЗначения(ИнтерфейсДокументовЭДО.ВидыЭлектронныхДокументовДоступныеДляОтборов());
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокФормы()

	РежимыОтображения = РежимыОтображенияФормы();

	Если РежимОтображения = РежимыОтображения.КИсполнению Тогда
		СуффиксЗаголовка = НСтр("ru = 'к исполнению'");
	ИначеЕсли РежимОтображения = РежимыОтображения.МоиДокументы Тогда
		СуффиксЗаголовка = НСтр("ru = 'мои документы'");
	ИначеЕсли РежимОтображения = РежимыОтображения.ВсеДокументы Тогда
		СуффиксЗаголовка = НСтр("ru = 'весь документооборот'");
	Иначе
		СуффиксЗаголовка = "";
	КонецЕсли;

	Если ПакетноеОтображение Тогда
		СуффиксЗаголовка = СуффиксЗаголовка + НСтр("ru = ', по пакетам'");
	Иначе
		СуффиксЗаголовка = СуффиксЗаголовка + НСтр("ru = ', по документам'");
	КонецЕсли;

	Заголовок = СтрШаблон(НСтр("ru = 'Текущие дела ЭДО (%1)'"), СуффиксЗаголовка);

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовкиЭлементов()

	Если НастройкиЭДО.ИспользуютсяВнутренниеДокументы() Тогда
		ЗаголовокКолонкиКонтрагентИсходящихЭД = НСтр("ru = 'Контрагент / Организация'");
	Иначе
		ЗаголовокКолонкиКонтрагентИсходящихЭД = НСтр("ru = 'Контрагент'");
	КонецЕсли;
	
	Элементы.ИсходящиеЭДКонтрагент.Заголовок = ЗаголовокКолонкиКонтрагентИсходящихЭД;
	Элементы.СформироватьЭДКонтрагент.Заголовок = ЗаголовокКолонкиКонтрагентИсходящихЭД;
	
	Элементы.ОтправитьЭДОтправить.Заголовок = НСтр("ru = 'Отправить'");
	
	Если ОтложеннаяОтправкаЭлектронныхДокументов Тогда
		Элементы.ОтправитьЭДОтправить.Заголовок = НСтр("ru = 'Подготовить к отправке'");
		Элементы.ИсходящиеЭДПодписать.Заголовок = НСтр("ru = 'Подписать'");
		Элементы.СформироватьЭДСформироватьПодписатьИОтправить.Заголовок = НСтр("ru = 'Создать и подписать'");
		Команды.ВходящиеЭДУтвердитьПодписатьИОтправить.Подсказка =
			НСтр("ru = 'Создать, подписать и подготовить к отправке
			|выделенные электронные документы'");
		Если Не ИспользоватьЭП Тогда
			Элементы.СформироватьЭДСформироватьПодписатьИОтправить.Заголовок = НСтр("ru = 'Создать'");
			Команды.ВходящиеЭДУтвердитьПодписатьИОтправить.Подсказка = НСтр("ru = 'Создать и подготовить к отправке
				|выделенные электронные документы'");
		КонецЕсли;
	ИначеЕсли Не ИспользоватьЭП Тогда
		Элементы.СформироватьЭДСформироватьПодписатьИОтправить.Заголовок = НСтр("ru = 'Создать и отправить'");
		Команды.ВходящиеЭДУтвердитьПодписатьИОтправить.Подсказка = НСтр("ru = 'Создать и отправить
			|выделенные электронные документы'");
	КонецЕсли;
	
	Если Не ОтправлятьВходящиеДокументыНаУтверждение Тогда
		Элементы.ВходящиеЭДУтвердитьПодписатьИОтправить.Заголовок = НСтр("ru = 'Подписать и отправить'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДерево()

	Дерево = РеквизитФормыВЗначение("ДеревоДействий");
	Дерево.Строки.Очистить();
	Разделы = РазделыФормы();

	СтрокаВходящие = Дерево.Строки.Добавить();
	СтрокаВходящие.Значение = Разделы.Входящие;
	НовЗапись = СтрокаВходящие.Строки.Добавить();
	НовЗапись.Значение = Разделы.Обработать;
	
	Если ОтправлятьВходящиеДокументыНаУтверждение Тогда
		НовЗапись = СтрокаВходящие.Строки.Добавить();
		НовЗапись.Значение = Разделы.Утвердить;
	КонецЕсли;
	
	Если ИспользоватьЭП Тогда
		НовЗапись = СтрокаВходящие.Строки.Добавить();
		НовЗапись.Значение = Разделы.Подписать;
	КонецЕсли;
	
	НовЗапись = СтрокаВходящие.Строки.Добавить();
	НовЗапись.Значение = Разделы.Исправить;
	
	НовЗапись = СтрокаВходящие.Строки.Добавить();
	НовЗапись.Значение = Разделы.Аннулировать;
	НовЗапись = СтрокаВходящие.Строки.Добавить();
	НовЗапись.Значение = Разделы.НаКонтроле;

	СтрокаИсходящие = Дерево.Строки.Добавить();
	СтрокаИсходящие.Значение = Разделы.Исходящие;
	
	НовЗапись = СтрокаИсходящие.Строки.Добавить();
	НовЗапись.Значение = Разделы.Сформировать;
	
	Если ИспользоватьЭП Тогда
		НовЗапись = СтрокаИсходящие.Строки.Добавить();
		НовЗапись.Значение = Разделы.ПодписатьИсх;
	КонецЕсли;
	НовЗапись = СтрокаИсходящие.Строки.Добавить();
	НовЗапись.Значение = Разделы.ИсправитьИсх;

	НовЗапись = СтрокаИсходящие.Строки.Добавить();
	НовЗапись.Значение = Разделы.АннулироватьИсх;
	НовЗапись = СтрокаИсходящие.Строки.Добавить();
	НовЗапись.Значение = Разделы.НаКонтролеИсх;

	НовЗапись = Дерево.Строки.Добавить();
	НовЗапись.Значение = Разделы.НоменклатураКонтрагентов;

	НовЗапись = Дерево.Строки.Добавить();
	НовЗапись.Значение = Разделы.Ознакомиться;

	НовЗапись = Дерево.Строки.Добавить();
	НовЗапись.Значение = Разделы.Отправить;
	НовЗапись = Дерево.Строки.Добавить();
	НовЗапись.Значение = Разделы.Распаковать;
	НовЗапись = Дерево.Строки.Добавить();
	НовЗапись.Значение = Разделы.Ошибки;

	СтрокаПриглашения = Дерево.Строки.Добавить();
	СтрокаПриглашения.Значение = Разделы.Приглашения;
	НовЗапись = СтрокаПриглашения.Строки.Добавить();
	НовЗапись.Значение = Разделы.ТребуетсяПригласить;
	НовЗапись = СтрокаПриглашения.Строки.Добавить();
	НовЗапись.Значение = Разделы.ЖдемСогласия;
	НовЗапись = СтрокаПриглашения.Строки.Добавить();
	НовЗапись.Значение = Разделы.ТребуетсяСогласие;
	НовЗапись = СтрокаПриглашения.Строки.Добавить();
	НовЗапись.Значение = Разделы.ПриглашенияОзнакомиться;

	ЗначениеВРеквизитФормы(Дерево, "ДеревоДействий");

КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьДоступностьКомандПоПравам()

	НедоступныеКоманды = Новый СписокЗначений;
	
	Если Не ЕстьПравоОбработкиДокументов Тогда

		НедоступныеКоманды.Добавить("ВходящиеЭДЗакрытьПринудительно");
		НедоступныеКоманды.Добавить("ИсходящиеЭДЗакрытьПринудительно");
		НедоступныеКоманды.Добавить("ОтправитьЭДЗакрытьПринудительно");
		НедоступныеКоманды.Добавить("ОшибкиЭДЗакрытьПринудительно");
		НедоступныеКоманды.Добавить("СформироватьЭДЗакрытьПринудительно");
		НедоступныеКоманды.Добавить("ВходящиеЭДПеренаправить");
		НедоступныеКоманды.Добавить("ИсходящиеЭДПеренаправить");
		НедоступныеКоманды.Добавить("ОзнакомитьсяЭДПеренаправить");
		НедоступныеКоманды.Добавить("ОшибкиЭДПеренаправить");
		НедоступныеКоманды.Добавить("ВходящиеЭДУтвердитьЭД");
		НедоступныеКоманды.Добавить("ОтправитьЭДВернутьНаПодготовкуКОтправке");
		НедоступныеКоманды.Добавить("ВходящиеЭДПодписать");
		НедоступныеКоманды.Добавить("ИсходящиеЭДПодписать");
		НедоступныеКоманды.Добавить("ОтправитьЭДОтправить");
		НедоступныеКоманды.Добавить("ИсходящиеЭДОтклонитьПодписание");
		НедоступныеКоманды.Добавить("ВходящиеЭДПринятьАннулирование");
		НедоступныеКоманды.Добавить("ИсходящиеЭДПринятьАннулирование");
		НедоступныеКоманды.Добавить("ВходящиеЭДОтклонитьДокумент");
		НедоступныеКоманды.Добавить("ВходящиеЭДОтказатьсяОтПодписания");
		НедоступныеКоманды.Добавить("ВходящиеЭДОтклонитьАннулирование");
		НедоступныеКоманды.Добавить("ИсходящиеЭДОтклонитьАннулирование");
		НедоступныеКоманды.Добавить("СформироватьЭДИзменитьДокумент");
		НедоступныеКоманды.Добавить("СформироватьЭДПросмотретьЭД");
		НедоступныеКоманды.Добавить("КонтейнерыЭДУстановитьСтатусОтмененКонтейнера");
		НедоступныеКоманды.Добавить("КонтейнерыЭДРаспаковатьВыделенныеКонтейнеры");
		НедоступныеКоманды.Добавить("ВходящиеЭДУтвердитьПодписатьИОтправить");
		НедоступныеКоманды.Добавить("ИсходящиеЭДУтвердитьПодписатьИОтправить");
		НедоступныеКоманды.Добавить("СформироватьЭДСформироватьПодписатьИОтправить");
		НедоступныеКоманды.Добавить("ОзнакомитьсяЭДОтправитьВАрхив");
		НедоступныеКоманды.Добавить("СформироватьЭДМассоваяОтправкаФайлов");
		НедоступныеКоманды.Добавить("ИсходящиеЭДМассоваяОтправкаФайлов");
		НедоступныеКоманды.Добавить("ОтправитьЭДМассоваяОтправкаФайлов");
		НедоступныеКоманды.Добавить("ОшибкиЭДМассоваяОтправкаФайлов");

	КонецЕсли;

	Если Не НастройкиЭДО.ЕстьПравоНастройкиОбмена() Тогда

		НедоступныеКоманды.Добавить("ПриглашенияЭДОтправитьПриглашенияВАрхив");
		НедоступныеКоманды.Добавить("ПриглашенияЭДПринятьПриглашения");
		НедоступныеКоманды.Добавить("ПриглашенияЭДОтправитьПриглашения");
		НедоступныеКоманды.Добавить("ПриглашенияЭДОтклонитьПриглашения");
		НедоступныеКоманды.Добавить("ПриглашенияЭДОтозватьПриглашение");

	КонецЕсли;
	
	Если Не ЕстьПравоВыполненияОбмена Тогда
		Элементы.СформироватьЭДОтправитьИПолучить.Видимость = Ложь;
		Элементы.ПриглашенияЭДОтправитьИПолучить.Видимость = Ложь;
		Элементы.ОзнакомитьсяЭДОтправитьИПолучить.Видимость = Ложь;
		Элементы.ВходящиеЭДОтправитьИПолучить.Видимость = Ложь;
		Элементы.ИсходящиеЭДОтправитьИПолучить.Видимость = Ложь;
		Элементы.КонтейнерыЭДОтправитьИПолучить.Видимость = Ложь;
		Элементы.ОшибкиЭДОтправитьИПолучить.Видимость = Ложь;
		Элементы.ОтправитьЭДОтправитьИПолучить.Видимость = Ложь;
		Элементы.НоменклатураКонтрагентовОтправитьИПолучить.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияБЭД.ЕстьПравоАдминистрирования() Тогда
		Элементы.СформироватьЭДПроверитьПодписи.Видимость = Ложь;
		Элементы.ИсходящиеЭДПроверитьПодписи.Видимость = Ложь;
		Элементы.ОшибкиЭДПроверитьПодписи.Видимость = Ложь;
		Элементы.ВходящиеЭДПроверитьПодписи.Видимость = Ложь;
		Элементы.ОтправитьЭДПроверитьПодписи.Видимость = Ложь;
		Элементы.ОзнакомитьсяЭДПроверитьПодписи.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьДоговоровКонтрагентов()
	
	Если ИнтеграцияЭДО.ИспользуютсяДоговорыКонтрагентов() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ВходящиеЭДДоговорКонтрагента.Видимость = Ложь;
	Элементы.ИсходящиеЭДДоговорКонтрагента.Видимость = Ложь;

КонецПроцедуры

&НаСервере
Процедура УстановитьНавигационнуюСсылкуФормы()
	
	НавигационнаяСсылка = "e1cib/app/" + ИмяФормы;
	
КонецПроцедуры

#Область УсловноеОформление

&НаКлиенте
Процедура УстановитьУсловноеОформлениеКлиент()
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	ИменаСписков = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		"ВходящиеЭД,ИсходящиеЭД,ОзнакомитьсяЭД,ОтправитьЭД,ОшибкиЭД,Сформировать");
	Для Каждого ИмяСписка Из ИменаСписков Цикл
		ЭтотОбъект[ИмяСписка].УсловноеОформление.Элементы.Очистить();
	КонецЦикла;
	
	УстановитьУсловноеОформлениеБыстрыхОтборов();
	
	УстановитьУсловноеОформлениеПанелиРазделов();
	
	УстановитьУсловноеОформлениеСписков();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПанелиРазделов()
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоДействийДействие.Имя);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ОбычныйШрифтКомпактнаяФорма85БЭД);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоДействийДействие.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоДействий.ТребуетсяОбработка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЖирныйШрифтКомпактнаяФорма85БЭД);

	// Скрытие строк дерева действий
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоДействийДействие.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоДействийНомерКартинки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоДействий.Скрыть");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеБыстрыхОтборов()
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.БыстрыеОтборыЗначение.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БыстрыеОтборы.Значение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("Формат", "ЧН=");

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.БыстрыеОтборыЗначение.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.БыстрыеОтборыПредставлениеПараметра.Имя);
	
	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТекущийРаздел");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = РазделыФормы().Сформировать;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БыстрыеОтборы.Параметр");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("ВидДокумента");
	СписокЗначений.Добавить("ДополнительнаяИнформация");
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТекущийРаздел");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = РазделыФормы().Отправить;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БыстрыеОтборы.Параметр");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("ВидДокумента");
	СписокЗначений.Добавить("ДополнительнаяИнформация");
	СписокЗначений.Добавить("Сумма_С");
	СписокЗначений.Добавить("Сумма_По");
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТекущийРаздел");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = РазделыФормы().Распаковать;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БыстрыеОтборы.Параметр");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("ВидДокумента");
	СписокЗначений.Добавить("ДополнительнаяИнформация");
	СписокЗначений.Добавить("Сумма_С");
	СписокЗначений.Добавить("Сумма_По");
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.СветлоСерыйБЭД);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	// Видимость колонок редактирования быстрого отбора
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.БыстрыеОтборыПредставлениеПараметра.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.БыстрыеОтборыЗначение.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БыстрыеОтборы.Кнопка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	// Видимость колонки с кнопкой
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.БыстрыеОтборыКнопка.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БыстрыеОтборы.Кнопка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСписков()
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект,
		"Сформировать.Дата", "СформироватьЭДДата");
		
	СпискиФормы = СпискиФормы();
	
	Для Каждого ИмяСписка Из СпискиФормы Цикл
		УстановитьУсловноеОформлениеСпискаДляЕдинообразияШрифтов(ИмяСписка.Значение);
	КонецЦикла;
	
	ИменаСписковЭлектронныхДокументов = Новый Массив;
	ИменаСписковЭлектронныхДокументов.Добавить(СпискиФормы.ВходящиеЭД);
	ИменаСписковЭлектронныхДокументов.Добавить(СпискиФормы.ИсходящиеЭД);
	ИменаСписковЭлектронныхДокументов.Добавить(СпискиФормы.ОзнакомитьсяЭД);
	ИменаСписковЭлектронныхДокументов.Добавить(СпискиФормы.ОтправитьЭД);
	ИменаСписковЭлектронныхДокументов.Добавить(СпискиФормы.ОшибкиЭД);

	Для Каждого ИмяСписка Из ИменаСписковЭлектронныхДокументов Цикл
		
		ИнтерфейсДокументовЭДО.УстановитьУсловноеОформлениеСпискаДляПодсветкиНевалидныхПодписейПоМЧД(ЭтотОбъект,
			ИмяСписка);
		
		УстановитьУсловноеОформлениеСпискаДляПомеченныхНаУдалениеДокументов(ИмяСписка);
		
		УстановитьУсловноеОформлениеСпискаДляНепрочитанныхДокументов(ИмяСписка);
		
		УстановитьУсловноеОформлениеПоИспользованиюПакетногоОтображения(ИмяСписка);
		
		УстановитьУсловноеОформлениеДляОтображенияДатыПолучения(ИмяСписка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСпискаДляЕдинообразияШрифтов(ИмяСписка)

	Элемент = ЭтотОбъект[ИмяСписка].УсловноеОформление.Элементы.Добавить();

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ОбычныйШрифтКомпактнаяФорма85БЭД);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСпискаДляПомеченныхНаУдалениеДокументов(ИмяСписка)
	
	ПолеПометкаУдаления = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	Если ЭтотОбъект[ИмяСписка].УсловноеОформление.ДоступныеПоляПолей.НайтиПоле(ПолеПометкаУдаления) = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Элемент = ЭтотОбъект[ИмяСписка].УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Отображение помеченных на удаление электронных документов'");

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = ПолеПометкаУдаления;
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЗачеркнутыйШрифтКомпактнаяФорма85БЭД);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.Серый);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСпискаДляНепрочитанныхДокументов(ИмяСписка)
	
	ИспользоватьПрочтениеДокументовЭДО = ПолучитьФункциональнуюОпцию("ИспользоватьПрочтениеДокументовЭДО");
	Если Не ИспользоватьПрочтениеДокументовЭДО Тогда
		Возврат;
	КонецЕсли;
	
	ПолеПрочтен = Новый ПолеКомпоновкиДанных("Прочтен");
	ПолеПометкаУдаления = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	Если ЭтотОбъект[ИмяСписка].УсловноеОформление.ДоступныеПоляПолей.НайтиПоле(ПолеПрочтен) = Неопределено
		Или ЭтотОбъект[ИмяСписка].УсловноеОформление.ДоступныеПоляПолей.НайтиПоле(ПолеПометкаУдаления) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = ЭтотОбъект[ИмяСписка].УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = ПолеПрочтен;
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = ПолеПометкаУдаления;
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЖирныйШрифтКомпактнаяФорма85БЭД);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДляОтображенияДатыПолучения(ИмяСписка)
	
	Если ИмяСписка = "ВходящиеЭД" Тогда
		ИмяПоляДаты = "ДатаПолучения";
	ИначеЕсли ИмяСписка = "ИсходящиеЭД" Тогда
		ИмяПоляДаты = "ДатаСоздания";
	ИначеЕсли ИмяСписка = "ОзнакомитьсяЭД" Или ИмяСписка = "ОтправитьЭД" Тогда
		ИмяПоляДаты = "ДатаСозданияПолучения";
	ИначеЕсли ИмяСписка = "ОшибкиЭД" Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + ИмяПоляДаты].Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
	ОтборЭлемента.Использование = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ=ЧЧ:мм");
		
	Элемент.Представление = 
		НСтр("ru = 'Отображать дату сегодняшних писем только в виде времени ""09:46"" (стандартная настройка)'");
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + ИмяПоляДаты].Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
	ОтборЭлемента.Использование = Истина;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца);
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ='dd MMMM'");
	
	Элемент.Представление = 
		НСтр("ru = 'Отображать дату документов за эту неделю в виде ""Вт 10.06"" (стандартная настройка)'");
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + ИмяПоляДаты].Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца);
	ОтборЭлемента.Использование = Истина;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоГода);
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ='dd.MM'");
	
	Элемент.Представление = НСтр("ru = 'Отображать дату документов за этот год в виде ""10.06"" (стандартная настройка)'");
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + ИмяПоляДаты].Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоГода);
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ='dd.MM.yy'");
			
	Элемент.Представление = НСтр("ru = 'Отображать дату документов за период более ранний, чем этот год в виде ""10.06.2022"" 
		|(стандартная настройка)'");
	
КонецПроцедуры

#Область РаботаСПакетами

&НаСервере
Процедура УстановитьУсловноеОформлениеПоИспользованиюПакетногоОтображения(ИмяСписка)
	
	Если ПакетноеОтображение Тогда
		
		УстановитьУсловноеОформлениеДляВыделенияДокументовПакета(ИмяСписка);
		
	Иначе
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяСписка + "ПредставлениеДокументовВнеОтбора");
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДляВыделенияДокументовПакета(ИмяСписка)
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяСписка);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КлючиВыбранныхДокументов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + ".КлючДокумента");
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КлючиВыбранныхПакетов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + ".КлючПакета");
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + ".КлючПакета");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаПалитры.СветлоСерыйБЭД);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяСписка + "Контрагент");
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + ".ПервыйДокументПакета");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + ".КлючСортировкиПакета");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
КонецПроцедуры

#КонецОбласти // РаботаСПакетами

#КонецОбласти // УсловноеОформление

#КонецОбласти // ИнициализацияФормы

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗакрытьПринудительно()
	
	ДополнительныеПараметры = Новый Структура;
	
	Если ТекущийРаздел = РазделыФормы().Сформировать Тогда
		Обработчик = Новый ОписаниеОповещения("ВыполнитьОтменуФормированияДокументовПослеВводаСтроки", ЭтотОбъект, ДополнительныеПараметры);
	
		ОбъектыУчета = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, "Документ");
		ДополнительныеПараметры.Вставить("ОбъектыУчета", ОбъектыУчета);
	Иначе
		Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки", ИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);
		
		ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, "ЭлектронныйДокумент, ИдентификаторПакета");
		ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	
		ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбъектыДействий.ЭлектронныеДокументы);
		ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбъектыДействий.ПакетыДокументов);
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения", Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект));
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ЗакрытьПринудительно"));
	
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);	
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.ЗакрытьПринудительно"));
					
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причину закрытия документооборота'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Закрыть электронный документ'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для закрытия документооборота по выбранным ЭД необходимо указать причину закрытия.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура УтвердитьЭД()
	
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, "ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Утвердить"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.СформироватьОтвет"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить"));
		
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов;

	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаПодписать()
		
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, "ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);

	НаборДействий = Новый Соответствие;
	
	Если ТекущийРаздел <> РазделыФормы().ПодписатьИсх Тогда
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Утвердить"));
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.СформироватьОтвет"));
	КонецЕсли;
	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
		ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Подписать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
		ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	Если Не ОтложеннаяОтправкаЭлектронныхДокументов Тогда
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Отправить"));
	КонецЕсли;
		
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения", 
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияДействийПоЭДО", ПараметрыВыполненияДействийПоЭДО);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ДополнительныеПараметры);

	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСформироватьПодписатьИОтправить()
	
	ВыделенныеСтроки = Элементы.СформироватьЭД.ПолучитьСтрокиДляОбработки();
	НаборОбъектовУчета = Новый Массив(ВыделенныеСтроки.Количество());
	Для Индекс = 0 По НаборОбъектовУчета.ВГраница() Цикл
		НаборОбъектовУчета[Индекс] = Элементы.СформироватьЭД.ДанныеСтроки(ВыделенныеСтроки[Индекс]).Документ;
	КонецЦикла;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("ОбъектыУчета", НаборОбъектовУчета);
	ДополнительныеПараметры.Вставить("РежимПодписатьОтправить", Истина);
		
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ДополнительныеПараметры);
	ДополнительныеПараметры.Вставить("Оповещение", Оповещение);
	
	Если ОтложеннаяОтправкаЭлектронныхДокументов Тогда
		ЭлектронныеДокументыЭДОКлиент.СформироватьПодписатьПодготовитьКОтправкеЭД(НаборОбъектовУчета,
			ДополнительныеПараметры);
	Иначе
		ЭлектронныеДокументыЭДОКлиент.СформироватьПодписатьОтправитьЭД(НаборОбъектовУчета, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьсяОтПодписания()

	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел,
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	ЭлектронныеДокументыЭДОКлиент.ОтказатьсяОтПодписания(ОбъектыДействий, ОписаниеОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура ПринятьАннулирование()

	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел,
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПринятьАннулирование"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить"));
				
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов; 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения", 
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияДействийПоЭДО", ПараметрыВыполненияДействийПоЭДО);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ДополнительныеПараметры);

	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);

КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьАннулирование()

	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел,
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);

	ДополнительныеПараметры = Новый Структура;
	
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбъектыДействий.ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбъектыДействий.ПакетыДокументов);
	
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект));
	
	НаборДействий = Новый Соответствие;
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтклонитьАннулирование"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить"));
		
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);	
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.ОтклонитьАннулирование"));
	
	Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки",
		ИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);
	
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причины отклонения аннулирования документа'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Отклонить аннулирование'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для отклонения аннулирования документа необходимо указать причину.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура Перенаправить()

	ИмяТаблицы = ТаблицаРаздела(ТекущийРаздел);

	ТекущаяТаблица = Элементы[ИмяТаблицы];
	Если ТипЗнч(ТекущаяТаблица) = Тип("ТаблицаФормы")
			И ТекущаяТаблица.ПолучитьСтрокиДляОбработки().Количество() > 0 Тогда

		Если ТекущаяТаблица = Элементы.ОзнакомитьсяЭД Тогда

			Строки = ТекущаяТаблица.ПолучитьСтрокиДляОбработки();
			ЭлектронныеДокументы = ЭлектронныеДокументыНаОзнакомление(Строки);

		ИначеЕсли ТекущаяТаблица = Элементы.ВходящиеЭД
				ИЛИ ТекущаяТаблица = Элементы.ИсходящиеЭД Тогда

			ЭлектронныеДокументы = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, "ЭлектронныйДокумент");

		Иначе
			ЭлектронныеДокументы = ТекущаяТаблица.ПолучитьСтрокиДляОбработки();
		КонецЕсли;

		ДополнитьДокументамиПакетов(ЭлектронныеДокументы);

		ОбработкаОповещения = Новый ОписаниеОповещения("УстановитьОтветственногоОповещение", ЭтотОбъект);	
		ИнтерфейсДокументовЭДОКлиент.ПеренаправитьЭлектронныеДокументы(ЭлектронныеДокументы, ОбработкаОповещения);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьДокумент()
	
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел,
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	ИнтерфейсДокументовЭДОКлиент.ОтклонитьОбъекты(ОбъектыДействий,
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаПолучениеЭДЗавершение(Результат, Контекст) Экспорт

	НастроитьДоступностьЭлементовКомандыОтправитьИПолучить(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭлектронныйДокументДляПросмотра(ДанныеСтроки)

	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.ЗамерВремени(
		"Обработка.ОбменСКонтрагентами.Форма.ТекущиеДелаПоЭДО.ОткрытьЭлектронныйДокументДляПросмотра");

	ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокумент(ДанныеСтроки.ЭлектронныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУтвердитьПодписатьИОтправить()

	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел,
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	
	НаборДействий = Новый Соответствие;
	Если ТекущийРаздел <> РазделыФормы().Исходящие Тогда
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Утвердить"));
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.СформироватьОтвет"));
	КонецЕсли;
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
		ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Подписать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
		ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	Если Не ОтложеннаяОтправкаЭлектронныхДокументов Тогда
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Отправить"));
	КонецЕсли;
	ПараметрыВыполненияДействийПоЭДО = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов; 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения", 
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияДействийПоЭДО", ПараметрыВыполненияДействийПоЭДО);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ДополнительныеПараметры);
	
	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);

КонецПроцедуры

&НаКлиенте
Процедура НачатьОтзывПриглашений()

	ОтправитьОтветНаПриглашения(ОтветНаПриглашение_Отозвать());

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтветНаПриглашения(Действие)

	ОчиститьСообщения();
	ДанныеПриглашений = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"КлючПриглашения, ИдентификаторОрганизации, Организация, ИдентификаторКонтрагента, СпособОбменаЭД, Контрагент, НовыйКонтрагент");
	
	ВходящиеПриглашения = Новый Массив;

	Для Каждого ДанныеПриглашения Из ДанныеПриглашений Цикл
		ВходящееПриглашение = СинхронизацияЭДОКлиент.НовоеВходящееПриглашение();
		ЗаполнитьЗначенияСвойств(ВходящееПриглашение, ДанныеПриглашения, , "Контрагент");
		Если ТипЗнч(ДанныеПриглашения.Контрагент) = ТипЗнч(ПустойКонтрагент) Тогда
			ВходящееПриглашение.Контрагент = ДанныеПриглашения.Контрагент;
		Иначе
			ВходящееПриглашение.Контрагент = ПустойКонтрагент;
		КонецЕсли;
		ВходящееПриглашение.СпособОбмена = ДанныеПриглашения.СпособОбменаЭД;
		ВходящиеПриглашения.Добавить(ВходящееПриглашение);
	КонецЦикла;

	Оповещение = Новый ОписаниеОповещения("ПослеОтправкиОтветовНаПриглашения", ЭтотОбъект, Новый Структура("ОтветНаПриглашение", Действие));

	Если Действие = ОтветНаПриглашение_Принять() Тогда
		СинхронизацияЭДОКлиент.ПринятьПриглашения(ВходящиеПриглашения, ЭтотОбъект, Оповещение);
	ИначеЕсли Действие = ОтветНаПриглашение_Отклонить() Тогда
		СинхронизацияЭДОКлиент.ОтклонитьПриглашения(ВходящиеПриглашения, ЭтотОбъект, Оповещение);
	ИначеЕсли Действие = ОтветНаПриглашение_Отозвать() Тогда
		СинхронизацияЭДОКлиент.ОтозватьПриглашения(ВходящиеПриглашения, ЭтотОбъект, Оповещение);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура НачатьПринятиеПриглашений()

	ОтправитьОтветНаПриглашения(ОтветНаПриглашение_Принять());

КонецПроцедуры

&НаКлиенте
Процедура НачатьОтклонениеПриглашений()

	ОтправитьОтветНаПриглашения(ОтветНаПриглашение_Отклонить());

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтправкуПриглашенийВАрхив()

	ВыбранныеИдентификаторы = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, "КлючПриглашения, ИдентификаторОрганизации, ИдентификаторКонтрагента");
	Если ВыбранныеИдентификаторы.Количество() > 0 Тогда
		Отправлено = ВыполнитьОтправкуПриглашенийВАрхивНаСервере(ВыбранныеИдентификаторы);
		Если Отправлено > 0 Тогда
			Строка = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(НСтр("ru = ';%1 приглашение;;%1 приглашения;%1 приглашений;%1 приглашения'"), Отправлено);
			Шаблон = НСтр("ru = 'В архив отправлено %1'");
			ПоказатьОповещениеПользователя(НСтр("ru = 'Успешно'"), , СтрШаблон(Шаблон, Строка));
		КонецЕсли;
		РазблокироватьЗаблокированныеЭлементыФормы();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыполнитьОтправкуПриглашенийВАрхивНаСервере(Знач ВыбранныеИдентификаторы)
	Отправлено = ОтправитьПриглашенияВАрхив(ВыбранныеИдентификаторы);
	ОбновитьНавигациюПоРазделамНаСервере();
	Возврат Отправлено;
КонецФункции

&НаСервереБезКонтекста
Функция ОтправитьПриглашенияВАрхив(ВыбранныеИдентификаторы)

	Возврат ПриглашенияЭДО.ОтправитьПриглашенияВАрхив(ВыбранныеИдентификаторы);

КонецФункции

&НаКлиенте
Процедура УстановитьСтатусОтменен(МассивЭД)

	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	Количество = 0;
	УстановитьСтатусТранспортныхКонтейнеров(МассивЭД,
		ПредопределенноеЗначение("Перечисление.СтатусыТранспортныхСообщенийБЭД.Отменен"),
		Количество, КонтекстДиагностики);
	ТекстОповещения = НСтр("ru = 'Изменен статус транспортного контейнера на ""Отменен"": (%1)'");
	ТекстОповещения = СтрЗаменить(ТекстОповещения, "%1", Количество);
	ПоказатьОповещениеПользователя(НСтр("ru = 'Обмен электронными документами'"), , ТекстОповещения);
	ОбновитьНавигациюПоРазделам();
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСтатусТранспортныхКонтейнеров(Знач МассивКонтейнеров, Знач СтатусКонтейнера,
		КоличествоИзмененных, КонтекстДиагностики)

	КоличествоИзмененных = 0;
	Для Каждого СтрокаТаблицы Из МассивКонтейнеров Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Если СинхронизацияЭДО.ИзменитьСтатусТранспортногоКонтейнера(СтрокаТаблицы.Ссылка, СтатусКонтейнера) Тогда
				КоличествоИзмененных = КоличествоИзмененных + 1;
			КонецЕсли;
			КоличествоИзмененных = КоличествоИзмененных + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ТекстОперации = НСтр("ru = 'Изменение статуса транспортных контейнеров ЭД'");
			ДополнительныеПараметрыОшибки = Новый Структура;
			ДополнительныеПараметрыОшибки.Вставить("СсылкаНаОбъект", СтрокаТаблицы.Ссылка);
			Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ТекстОперации,
				ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), ДополнительныеПараметрыОшибки);
			ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка,
				ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами);
				
		КонецПопытки;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПометкуУдаленияВопрос(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено
		Или Ответ.Значение <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьПометкуУдаления(ДополнительныеПараметры.ЭлектронныйДокумент);
	
	Оповестить(ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияТекущихДелЭДО());
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПометкуУдаления(ЭлектронныйДокумент)
	
	ОбъектСсылка = ЭлектронныйДокумент.ПолучитьОбъект();
	ОбъектСсылка.УстановитьПометкуУдаления(Не ОбъектСсылка.ПометкаУдаления);
	
КонецПроцедуры

#Область ОбработчикиАсинхронныхДиалогов

&НаКлиенте
Процедура ВыполнитьОтменуФормированияДокументовПослеВводаСтроки(Комментарий, ДополнительныеПараметры) Экспорт
	
	Если Комментарий = Неопределено Тогда
		Возврат; 
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОВызовСервера.ОтменитьФормированиеДокументовПоОбъектамУчета(ДополнительныеПараметры.ОбъектыУчета, Комментарий);	
	
	Оповестить(ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияТекущихДелЭДО());
			
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаПриглашенийОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КонтекстДиагностики = Результат.КонтекстДиагностики;

	Если Результат.Успех Тогда
	
		ТекстЗаголовка = НСтр("ru = 'Отправка приглашений получателям'");
		
		ОтправленоПриглашений = Результат.КоличествоОтправленных;
		ШаблонСообщения = НСтр("ru = 'Отправлено приглашений: %1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ОтправленоПриглашений);

		ПоказатьОповещениеПользователя(ТекстЗаголовка, , ТекстСообщения);

		ОбновитьНавигациюПоРазделам();
		
	КонецЕсли;

	Если ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(КонтекстДиагностики) Тогда
			ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтправкиОтветовНаПриглашения(Результат, Контекст) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КонтекстДиагностики = Результат.КонтекстДиагностики;

	Если Результат.Успех Тогда
		
		КоличествоОбработанныхПриглашений = Результат.КоличествоОбработанных;
		
		Если Контекст.ОтветНаПриглашение = ОтветНаПриглашение_Принять() Тогда
			ТекстЗаголовка = НСтр("ru = 'Принимаются приглашения'");
			ШаблонСообщения = НСтр("ru = 'Принято приглашений: %1'");
		ИначеЕсли Контекст.ОтветНаПриглашение = ОтветНаПриглашение_Отклонить() Тогда
			ТекстЗаголовка = НСтр("ru = 'Отклоняются приглашения'");
			ШаблонСообщения = НСтр("ru = 'Отклонено приглашений: %1'");
		ИначеЕсли Контекст.ОтветНаПриглашение = ОтветНаПриглашение_Отозвать() Тогда
			ТекстЗаголовка = НСтр("ru = 'Отзываются приглашения'");
			ШаблонСообщения = НСтр("ru = 'Отозвано приглашений: %1'");
		КонецЕсли;

		ТекстСообщения = СтрШаблон(ШаблонСообщения, КоличествоОбработанныхПриглашений);

		ПоказатьОповещениеПользователя(ТекстЗаголовка, , ТекстСообщения);

		ОбновитьНавигациюПоРазделам();
	
	КонецЕсли;

	Если ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(КонтекстДиагностики) Тогда
		ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);			
	КонецЕсли;

	РазблокироватьЗаблокированныеЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтветственногоОповещение(Знач Результат, Знач ДополнительныеПараметры) Экспорт

	Если Результат = Истина Тогда
		ОбновитьДинамическиеСписки();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияДействийПоЭДО(Результат, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда

		Если Результат.Свойство("КонтекстДиагностики")
			И ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(Результат.КонтекстДиагностики) Тогда
			
			Ошибки = Результат.КонтекстДиагностики.Диагностика.Ошибки;
			Если Ошибки.Количество() = 1
				И ОбработкаНеисправностейБЭДКлиентСервер.ЭтоОшибкаДанногоВида(Ошибки[0],
					МашиночитаемыеДоверенностиКлиентСервер.ВидОшибкиЕстьПодписиСМЧДДоверенностьНеНайдена()) Тогда
						МашиночитаемыеДоверенностиКлиент.ОткрытьДиалогРучногоПодтвержденияПроверкиПодписиПоМЧД(
							Результат.КонтекстДиагностики, ДополнительныеПараметры);
			Иначе
				ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(Результат.КонтекстДиагностики);
			КонецЕсли;

		ИначеЕсли Результат.Свойство("ОшибкиФормирования") И Результат.ОшибкиФормирования.Количество() Тогда

			ПараметрыОбработки = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыПроблемПриОбработкеДокументов();
			ПараметрыОбработки.АдресСведенийОбОшибках = ПоместитьВоВременноеХранилище(Результат.ОшибкиФормирования,
				Новый УникальныйИдентификатор());
			Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
				И ДополнительныеПараметры.Свойство("ОбъектыУчета") Тогда
				ПараметрыОбработки.СписокДокументовКОтправке = ДополнительныеПараметры.ОбъектыУчета;
			КонецЕсли;
			Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
				И ДополнительныеПараметры.Свойство("РежимПодписатьОтправить") Тогда
				ПараметрыОбработки.РежимПодписатьОтправить = ДополнительныеПараметры.РежимПодписатьОтправить;				
			КонецЕсли;
			Если Результат.ОшибкиФормирования.Количество() = 1
				И Результат.ОшибкиФормирования[0].Свойство("ОшибкаФормированияВПрикладнойЧасти") 
				И Результат.ОшибкиФормирования[0].ОшибкаФормированияВПрикладнойЧасти <> Неопределено Тогда
				ПараметрыОбработки.Вставить("ОткрытьФормуРучногоФормированияОтветногоТитула", Истина);
			КонецЕсли;
			Оповещение = Новый ОписаниеОповещения("ПослеЗавершенияРаботыПомощникаФормирования", ЭтотОбъект, ДополнительныеПараметры);
			ИнтерфейсДокументовЭДОКлиент.ПоказатьПроблемыПриОбработкеДокументов(Оповещение, ПараметрыОбработки);
	
		КонецЕсли;
		
		ПараметрыСобытия = ИнтерфейсДокументовЭДОКлиент.НовыеПараметрыСобытияОбновленияСостоянияЭДО();
		ЭлектронныеДокументы = ПараметрыСобытия.ЭлектронныеДокументы;
		Если Результат.Свойство("ОбработанныеДокументы") Тогда
			ОбработанныеДокументы = Результат.ОбработанныеДокументы;
		ИначеЕсли Результат.Свойство("Итог") Тогда
			ОбработанныеДокументы = Результат.Итог.ОбработанныеДокументы;
		Иначе
			ОбработанныеДокументы = Новый Массив;
		КонецЕсли;
		
		Для Каждого ОбработанныйДокумент Из ОбработанныеДокументы Цикл
			ЭлектронныеДокументы.Добавить(ОбработанныйДокумент.Ключ);
		КонецЦикла;
		
		Оповестить(ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияСостоянияЭДО(), ПараметрыСобытия);

	КонецЕсли;
	
	ОбновитьНавигациюПоРазделам();
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.2, Истина);
	РазблокироватьЗаблокированныеЭлементыФормы();
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияРаботыПомощникаФормирования(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат <> Неопределено Тогда
		ОповещениеЗавершения = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ДополнительныеПараметры);
		ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(ОповещениеЗавершения, Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиАсинхронныхДиалогов

#КонецОбласти // ОбработчикиКоманд

#Область РаботаСПакетами

&НаСервереБезКонтекста
Процедура ДополнитьДокументамиПакетов(ЭлектронныеДокументы)
	
	ПакетыДокументовЭДО.ДополнитьДокументамиПакетов(ЭлектронныеДокументы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РассчитатьДополнительныеПоляПакетов(Строки)
	
	ПакетноеОтображение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"Обработка.ИнтерфейсДокументовЭДО.Форма.ТекущиеДелаПоЭДО85", "ПакетноеОтображение", Истина);
	
	КоличествоОтображаемыхДокументовПакета = Новый Соответствие;
	ИдентификаторыДокументовПакетов = Новый Соответствие;
	
	Четное = Ложь;
	
	ДанныеЧетности = Новый ТаблицаЗначений;
	ДанныеЧетности.Колонки.Добавить("Дата");
	ДанныеЧетности.Колонки.Добавить("Идентификатор");
	ДанныеЧетности.Колонки.Добавить("Номер");
	ДанныеЧетности.Колонки.Добавить("ПорядокСортировкиВПакете");
	
	Для Каждого ТекущаяСтрока Из Строки Цикл
		
		ДанныеСтроки = ТекущаяСтрока.Значение.Данные;

		СтрДанныеЧетности = ДанныеЧетности.Добавить();
		
		СтрДанныеЧетности.Дата = ДанныеСтроки.ДатаПакета;
		СтрДанныеЧетности.Идентификатор = ДанныеСтроки.КлючСортировкиПакета;
		СтрДанныеЧетности.ПорядокСортировкиВПакете = ДанныеСтроки.ПорядокСортировкиВПакете;
		
		Если Не ЗначениеЗаполнено(ДанныеСтроки.КлючСортировкиПакета) Тогда
			СтрДанныеЧетности.Номер = ДанныеСтроки.НомерСлужебный;
			Продолжить;
		КонецЕсли;
		
		ТекущееКоличествоДокументовВПакете = КоличествоОтображаемыхДокументовПакета[ДанныеСтроки.КлючСортировкиПакета];
		Если ТекущееКоличествоДокументовВПакете = Неопределено Тогда
			ТекущееКоличествоДокументовВПакете = 0;
		КонецЕсли;
		КоличествоОтображаемыхДокументовПакета.Вставить(ДанныеСтроки.КлючСортировкиПакета,
			ТекущееКоличествоДокументовВПакете + 1);
	
		СписокДокументов = ИдентификаторыДокументовПакетов[ДанныеСтроки.КлючСортировкиПакета];
		Если СписокДокументов = Неопределено Тогда
			СписокДокументов = Новый ТаблицаЗначений;
			СписокДокументов.Колонки.Добавить("ПорядокСортировкиВПакете");
			СписокДокументов.Колонки.Добавить("НомерСлужебный");
		КонецЕсли;
		
		Документ = СписокДокументов.Добавить();
		Документ.ПорядокСортировкиВПакете = ДанныеСтроки.ПорядокСортировкиВПакете;
		Документ.НомерСлужебный = ДанныеСтроки.НомерСлужебный;
		
		ИдентификаторыДокументовПакетов.Вставить(ДанныеСтроки.КлючСортировкиПакета, СписокДокументов);	
		
	КонецЦикла;
		
	ДанныеЧетности.Сортировать("Дата Возр, Идентификатор Возр, ПорядокСортировкиВПакете Возр, Номер Возр");
	ДанныеЧетности.Свернуть("Номер, Дата, Идентификатор");
	ДанныеЧетности.Индексы.Добавить("Идентификатор");
	ДанныеЧетности.Индексы.Добавить("Номер");
	ДанныеЧетности.Колонки.Добавить("Четность");
	
	Для Каждого Стр Из ДанныеЧетности Цикл
		Стр.Четность = Четное;
		Четное = Не Четное;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из Строки Цикл
		
		ДанныеСтроки = ТекущаяСтрока.Значение.Данные;
		
		ДанныеСтроки.КлючДокумента = Строка(ДанныеСтроки.ЭлектронныйДокумент.УникальныйИдентификатор());
		Если ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторПакета) Тогда
			ДанныеСтроки.КлючПакета = Строка(ДанныеСтроки.ИдентификаторПакета);
		Иначе
			ДанныеСтроки.КлючПакета = "";
		КонецЕсли;
		
		ТекущиеИдентификаторы = ИдентификаторыДокументовПакетов[ДанныеСтроки.КлючСортировкиПакета];
		
		Если ТекущиеИдентификаторы = Неопределено Тогда
			ДанныеСтроки.ПервыйДокументПакета = Истина;
			ДанныеСтроки.ИндексКартинкиПакета = 0; 
			ДанныеСтроки.Четность = ДанныеЧетности.Найти(ДанныеСтроки.НомерСлужебный,"Номер").Четность;
			Продолжить;
		КонецЕсли;
		
		ТекущиеИдентификаторы.Сортировать("ПорядокСортировкиВПакете Возр, НомерСлужебный Возр");
			
		ТекущаяСтрока.Значение.Данные.ПервыйДокументПакета = ДанныеСтроки.НомерСлужебный = ТекущиеИдентификаторы[0].НомерСлужебный;
		ДанныеСтроки.Четность = ДанныеЧетности.Найти(ДанныеСтроки.КлючСортировкиПакета,"Идентификатор").Четность;	
		
		ДанныеСтроки.ИндексКартинкиПакета = 0;
		
		Если ДанныеСтроки.ПервыйДокументПакета И ЗначениеЗаполнено(ДанныеСтроки.КлючСортировкиПакета)
			И ПакетноеОтображение Тогда
				
			ДанныеСтроки.ИндексКартинкиПакета = 1;
			
		ИначеЕсли Не ДанныеСтроки.ПервыйДокументПакета И ЗначениеЗаполнено(ДанныеСтроки.КлючСортировкиПакета)
			И ПакетноеОтображение Тогда
			
			ДанныеСтроки.ИндексКартинкиПакета = 0;
			Если ДанныеСтроки.Свойство("ДатаПакета") Тогда
				ДанныеСтроки.ДатаПакета = ""; 
			КонецЕсли;
			Если ДанныеСтроки.Свойство("СостояниеЭДО") Тогда
				ДанныеСтроки.СостояниеЭДО = "";
			КонецЕсли;
			Если ДанныеСтроки.Свойство("Ответственный") Тогда
				ДанныеСтроки.Ответственный = "";
			КонецЕсли;
			Если ДанныеСтроки.Свойство("ДополнительнаяИнформация") Тогда
				ДанныеСтроки.ДополнительнаяИнформация = "";
			КонецЕсли;
			
		КонецЕсли; 
		
		КоличествоОтображаемыхДокументов = КоличествоОтображаемыхДокументовПакета.Получить(
			ДанныеСтроки.КлючСортировкиПакета);
		
		Если ДанныеСтроки.НомерСлужебный = ТекущиеИдентификаторы[ТекущиеИдентификаторы.Количество()-1].НомерСлужебный
			И ДанныеСтроки.КоличествоДокументовВПакете > КоличествоОтображаемыхДокументов Тогда
			
			КоличествоСкрытыхДокументов = ДанныеСтроки.КоличествоДокументовВПакете - КоличествоОтображаемыхДокументов;
			ШаблонСтроки = НСтр("ru = ';%1 документ;;%1 документа;%1 документов;%1 документов'");
			
			ПредставлениеСкрытыхДокументов = СтрокаСЧислом(
				ШаблонСтроки,
				КоличествоСкрытыхДокументов,
				ВидЧисловогоЗначения.Количественное);
			
			ДанныеСтроки.ПредставлениеДокументовВнеОтбора = СтрШаблон("%1%2%3",
				НСтр("ru = 'и еще'"),
				Символы.НПП,
				ПредставлениеСкрытыхДокументов);
				
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // РаботаСПакетами

#Область РаботаСРазделами

&НаКлиентеНаСервереБезКонтекста
Функция СписокРаздела(Знач Раздел)

	Разделы = РазделыФормы();
	Списки = СпискиФормы();

	СпискиРазделов = Новый Соответствие;
	СпискиРазделов.Вставить(Разделы.Входящие, Списки.ВходящиеЭД);
	СпискиРазделов.Вставить(Разделы.Обработать, Списки.ВходящиеЭД);
	СпискиРазделов.Вставить(Разделы.Утвердить, Списки.ВходящиеЭД);
	СпискиРазделов.Вставить(Разделы.Подписать, Списки.ВходящиеЭД);
	СпискиРазделов.Вставить(Разделы.Исправить, Списки.ВходящиеЭД);
	СпискиРазделов.Вставить(Разделы.Аннулировать, Списки.ВходящиеЭД);
	СпискиРазделов.Вставить(Разделы.НаКонтроле, Списки.ВходящиеЭД);
	СпискиРазделов.Вставить(Разделы.СообщенияВх, Списки.ВходящиеЭД);

	СпискиРазделов.Вставить(Разделы.Исходящие, Списки.ИсходящиеЭД);
	СпискиРазделов.Вставить(Разделы.ПодписатьИсх, Списки.ИсходящиеЭД);
	СпискиРазделов.Вставить(Разделы.ИсправитьИсх, Списки.ИсходящиеЭД);
	СпискиРазделов.Вставить(Разделы.АннулироватьИсх, Списки.ИсходящиеЭД);
	СпискиРазделов.Вставить(Разделы.НаКонтролеИсх, Списки.ИсходящиеЭД);
	СпискиРазделов.Вставить(Разделы.СообщенияИсх, Списки.ИсходящиеЭД);

	СпискиРазделов.Вставить(Разделы.Сформировать, Списки.Сформировать);

	СпискиРазделов.Вставить(Разделы.Ознакомиться, Списки.ОзнакомитьсяЭД);

	СпискиРазделов.Вставить(Разделы.Отправить, Списки.ОтправитьЭД);
	СпискиРазделов.Вставить(Разделы.Распаковать, Списки.КонтейнерыЭД);
	СпискиРазделов.Вставить(Разделы.Ошибки, Списки.ОшибкиЭД);

	СпискиРазделов.Вставить(Разделы.Приглашения, Списки.ПриглашенияЭД);
	СпискиРазделов.Вставить(Разделы.ТребуетсяПригласить, Списки.ПриглашенияЭД);
	СпискиРазделов.Вставить(Разделы.ЖдемСогласия, Списки.ПриглашенияЭД);
	СпискиРазделов.Вставить(Разделы.ТребуетсяСогласие, Списки.ПриглашенияЭД);
	СпискиРазделов.Вставить(Разделы.ПриглашенияОзнакомиться, Списки.ПриглашенияЭД);

	СпискиРазделов.Вставить(Разделы.НоменклатураКонтрагентов, Списки.НоменклатураКонтрагентов);

	Список = СпискиРазделов.Получить(Раздел);

	Возврат Список;

КонецФункции

&НаСервереБезКонтекста
Функция СтраницаРаздела(Знач Раздел)

	Разделы = РазделыФормы();
	Страницы = СтраницыФормы();

	СтраницыРазделов = Новый Соответствие;
	СтраницыРазделов.Вставить(Разделы.Входящие, Страницы.ВходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.Обработать, Страницы.ВходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.Утвердить, Страницы.ВходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.Подписать, Страницы.ВходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.Исправить, Страницы.ВходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.Аннулировать, Страницы.ВходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.НаКонтроле, Страницы.ВходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.СообщенияВх, Страницы.ВходящиеЭД);

	СтраницыРазделов.Вставить(Разделы.Исходящие, Страницы.ИсходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.ПодписатьИсх, Страницы.ИсходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.ИсправитьИсх, Страницы.ИсходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.АннулироватьИсх, Страницы.ИсходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.НаКонтролеИсх, Страницы.ИсходящиеЭД);
	СтраницыРазделов.Вставить(Разделы.СообщенияИсх, Страницы.ИсходящиеЭД);

	СтраницыРазделов.Вставить(Разделы.Сформировать, Страницы.СформироватьЭД);

	СтраницыРазделов.Вставить(Разделы.Ознакомиться, Страницы.ОзнакомитьсяЭД);

	СтраницыРазделов.Вставить(Разделы.Отправить, Страницы.ОтправитьЭД);
	СтраницыРазделов.Вставить(Разделы.Распаковать, Страницы.КонтейнерыЭД);
	СтраницыРазделов.Вставить(Разделы.Ошибки, Страницы.ОшибкиЭД);

	СтраницыРазделов.Вставить(Разделы.Приглашения, Страницы.ПриглашенияЭД);
	СтраницыРазделов.Вставить(Разделы.ТребуетсяПригласить, Страницы.ПриглашенияЭД);
	СтраницыРазделов.Вставить(Разделы.ЖдемСогласия, Страницы.ПриглашенияЭД);
	СтраницыРазделов.Вставить(Разделы.ТребуетсяСогласие, Страницы.ПриглашенияЭД);
	СтраницыРазделов.Вставить(Разделы.ПриглашенияОзнакомиться, Страницы.ПриглашенияЭД);

	СтраницыРазделов.Вставить(Разделы.НоменклатураКонтрагентов, Страницы.НоменклатураКонтрагентов);

	Возврат СтраницыРазделов.Получить(Раздел);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТаблицаРаздела(Знач Раздел)

	Разделы = РазделыФормы();
	Таблицы = ТаблицыФормы();

	ТаблицыРазделов = Новый Соответствие;
	ТаблицыРазделов.Вставить(Разделы.Входящие, Таблицы.ВходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.Обработать, Таблицы.ВходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.Утвердить, Таблицы.ВходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.Подписать, Таблицы.ВходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.Исправить, Таблицы.ВходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.Аннулировать, Таблицы.ВходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.НаКонтроле, Таблицы.ВходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.СообщенияВх, Таблицы.ВходящиеЭД);

	ТаблицыРазделов.Вставить(Разделы.Исходящие, Таблицы.ИсходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.ПодписатьИсх, Таблицы.ИсходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.ИсправитьИсх, Таблицы.ИсходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.АннулироватьИсх, Таблицы.ИсходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.НаКонтролеИсх, Таблицы.ИсходящиеЭД);
	ТаблицыРазделов.Вставить(Разделы.СообщенияИсх, Таблицы.ИсходящиеЭД);

	ТаблицыРазделов.Вставить(Разделы.Сформировать, Таблицы.СформироватьЭД);

	ТаблицыРазделов.Вставить(Разделы.Ознакомиться, Таблицы.ОзнакомитьсяЭД);

	ТаблицыРазделов.Вставить(Разделы.Отправить, Таблицы.ОтправитьЭД);
	ТаблицыРазделов.Вставить(Разделы.Распаковать, Таблицы.КонтейнерыЭД);
	ТаблицыРазделов.Вставить(Разделы.Ошибки, Таблицы.ОшибкиЭД);

	ТаблицыРазделов.Вставить(Разделы.Приглашения, Таблицы.ПриглашенияЭД);
	ТаблицыРазделов.Вставить(Разделы.ТребуетсяПригласить, Таблицы.ПриглашенияЭД);
	ТаблицыРазделов.Вставить(Разделы.ЖдемСогласия, Таблицы.ПриглашенияЭД);
	ТаблицыРазделов.Вставить(Разделы.ТребуетсяСогласие, Таблицы.ПриглашенияЭД);
	ТаблицыРазделов.Вставить(Разделы.ПриглашенияОзнакомиться, Таблицы.ПриглашенияЭД);

	ТаблицыРазделов.Вставить(Разделы.НоменклатураКонтрагентов, Таблицы.НоменклатураКонтрагентов);

	Таблица = ТаблицыРазделов.Получить(Раздел);

	Возврат Таблица;

КонецФункции

&НаСервереБезКонтекста
Функция ЗаменитьПоляРаздела(Знач СтрокаПолей, Знач ПараметрыЗамены)
	
	Если ПараметрыЗамены.Количество() = 0 Тогда
		Возврат СтрокаПолей;
	КонецЕсли;
	
	СтрокаПолейБезПробелов = СтрЗаменить(СтрокаПолей, " ", "");
	СтрокаПолейБезПереносовИПробелов = СтрЗаменить(СтрокаПолейБезПробелов, Символы.ПС, "");
	
	Поля = СтрРазделить(СтрокаПолейБезПереносовИПробелов, ",");
	
	Для Каждого Замена Из ПараметрыЗамены Цикл
		Позиция = Поля.Найти(Замена.Ключ);
		
		Если Позиция = Неопределено Тогда
			Продолжить; // Ключ отсутствует
		КонецЕсли;
		
		Поля[Позиция] = Замена.Значение;
	КонецЦикла;
	
	Возврат СтрСоединить(Поля, ",");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоляРаздела(Знач Раздел, Знач ПакетноеОтображение)

	Разделы = РазделыФормы();

	ПоляТаблицыВходящие = "ВидДокумента, ДатаПакета, Дата, Номер, СуммаДокумента, Контрагент, Организация, СостояниеЭДО,
		|НаправлениеЭД, Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, Описание, ОтражениеВУчете,
		|ЭлектронныйДокумент";
	ПоляТаблицыИсходящие = "ВидДокумента, ДатаПакета, Дата, Номер, СуммаДокумента, Контрагент, Организация, Подписи,
		|СостояниеЭДО, НаправлениеЭД, Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, Описание,
		|ОтражениеВУчете, ЭлектронныйДокумент";
	ПоляТаблицыСформировать = "ВидДокумента, Дата, Номер, Документ, Контрагент, Организация, СуммаДокумента";
	ПоляТаблицыКонтейнерыЭД = "Дата, Контрагент, Организация, Соглашение, Статус, Ссылка";
	ПоляТаблицыПриглашения = "Контрагент, ИдентификаторКонтрагента,СпособОбменаЭД, НовыйКонтрагент,
		|ИдентификаторОрганизации, Организация, СтатусПодключения, ЭлектроннаяПочта, ТекстПриглашения, ОписаниеОшибки,
		|ДатаОтправки, ДатаПолучения";
	ПоляТаблицыОзнакомиться = "ВидДокумента, ДатаПакета, Дата, Номер, СостояниеЭДО, Организация, Контрагент,
		|СуммаДокумента, ЭлектронныйДокумент";
	ПоляТаблицыОтправить = "ВидДокумента, ДатаПакета, Дата, Номер, Организация, Контрагент, СуммаДокумента,
		|ЭлектронныйДокумент";
	ПоляТаблицыНоменклатураКонтрагентов = "Контрагент, Сопоставить";
	ПоляТаблицыОшибки = "ВидДокумента, ДатаПакета, Дата, Номер, СуммаДокумента, Контрагент, Организация, СостояниеЭДО,
		|НаправлениеЭД, Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, Описание, ОтражениеВУчете, Ссылка";

	ПоляТаблицы = "";
	ПоляРаздела = "";

	Если Раздел = Разделы.Входящие Тогда

		ПоляТаблицы = ПоляТаблицыВходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, СостояниеЭДО,
			|НаправлениеЭД, Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, Описание, ОтражениеВУчете";

	ИначеЕсли Раздел = Разделы.Обработать Тогда

		ПоляТаблицы = ПоляТаблицыВходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, СостояниеЭДО, НаправлениеЭД,
			|Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, ОтражениеВУчете, Описание";

	ИначеЕсли Раздел = Разделы.Утвердить Тогда

		ПоляТаблицы = ПоляТаблицыВходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, НаправлениеЭД,
			|Ответственный, ДополнительнаяИнформация, ОтражениеВУчете, Описание";

	ИначеЕсли Раздел = Разделы.Подписать Тогда

		ПоляТаблицы = ПоляТаблицыВходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, НаправлениеЭД,
			|Ответственный, ДополнительнаяИнформация, ОтражениеВУчете, Описание"

	ИначеЕсли Раздел = Разделы.Исправить Тогда

		ПоляТаблицы = ПоляТаблицыВходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, СостояниеЭДО, НаправлениеЭД,
			|Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, ОтражениеВУчете, Описание";

	ИначеЕсли Раздел = Разделы.Аннулировать Тогда

		ПоляТаблицы = ПоляТаблицыВходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, НаправлениеЭД,
			|Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, Описание, ОтражениеВУчете";

	ИначеЕсли Раздел = Разделы.НаКонтроле Тогда

		ПоляТаблицы = ПоляТаблицыВходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, СостояниеЭДО,
			|НаправлениеЭД, Ответственный, ДополнительнаяИнформация, ОтражениеВУчете, Описание";

	ИначеЕсли Раздел = Разделы.Исходящие Тогда

		ПоляТаблицы = ПоляТаблицыИсходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, СостояниеЭДО,
			|НаправлениеЭД, Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, Описание, ОтражениеВУчете";

	ИначеЕсли Раздел = Разделы.Сформировать Тогда

		ПоляТаблицы = ПоляТаблицыСформировать;
		ПоляРаздела = ПоляТаблицыСформировать;

	ИначеЕсли Раздел = Разделы.ПодписатьИсх Тогда

		ПоляТаблицы = ПоляТаблицыИсходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, Подписи, НаправлениеЭД,
			|Ответственный, ДополнительнаяИнформация, Описание, ОтражениеВУчете";

	ИначеЕсли Раздел = Разделы.ИсправитьИсх Тогда

		ПоляТаблицы = ПоляТаблицыИсходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, НаправлениеЭД, Ответственный,
			|ДополнительнаяИнформация, ПричинаОтклонения, Описание, ОтражениеВУчете";

	ИначеЕсли Раздел = Разделы.АннулироватьИсх Тогда

		ПоляТаблицы = ПоляТаблицыИсходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, НаправлениеЭД,
			|Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, Описание, ОтражениеВУчете";

	ИначеЕсли Раздел = Разделы.НаКонтролеИсх Тогда

		ПоляТаблицы = ПоляТаблицыИсходящие;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, СостояниеЭДО,
			|НаправлениеЭД, Ответственный, ДополнительнаяИнформация, Описание, ОтражениеВУчете";

	ИначеЕсли Раздел = Разделы.Ознакомиться Тогда

		ПоляТаблицы = ПоляТаблицыОзнакомиться;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СостояниеЭДО, Организация, Контрагент, СуммаДокумента, Описание";

	ИначеЕсли Раздел = Разделы.Отправить Тогда

		ПоляТаблицы = ПоляТаблицыОтправить;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, Описание";

	ИначеЕсли Раздел = Разделы.Распаковать Тогда

		ПоляТаблицы = ПоляТаблицыКонтейнерыЭД;
		ПоляРаздела = "Дата, Контрагент, Организация, Соглашение, Ссылка";

	ИначеЕсли Раздел = Разделы.Ошибки Тогда

		ПоляТаблицы = ПоляТаблицыОшибки;
		ПоляРаздела = "ВидДокумента, Дата, Номер, СуммаДокумента, Контрагент, Организация, НаправлениеЭД, Ответственный,
			|ДополнительнаяИнформация, ПричинаОтклонения, Описание, ОтражениеВУчете";

	ИначеЕсли Раздел = Разделы.Приглашения Тогда

		ПоляТаблицы = ПоляТаблицыПриглашения;
		ПоляРаздела = "Контрагент, Организация, СтатусПодключения, ОписаниеОшибки";

	ИначеЕсли Раздел = Разделы.ТребуетсяПригласить Тогда

		ПоляТаблицы = ПоляТаблицыПриглашения;
		ПоляРаздела = "Контрагент, Организация, ТекстПриглашения, ОписаниеОшибки";

	ИначеЕсли Раздел = Разделы.ЖдемСогласия Тогда

		ПоляТаблицы = ПоляТаблицыПриглашения;
		ПоляРаздела = "Контрагент, Организация, СтатусПодключения, ДатаОтправки";

	ИначеЕсли Раздел = Разделы.ТребуетсяСогласие Тогда

		ПоляТаблицы = ПоляТаблицыПриглашения;
		ПоляРаздела = "Контрагент, ИдентификаторКонтрагента, Организация, ДатаПолучения";

	ИначеЕсли Раздел = Разделы.ПриглашенияОзнакомиться Тогда

		ПоляТаблицы = ПоляТаблицыПриглашения;
		ПоляРаздела = "Контрагент, ИдентификаторКонтрагента, Организация, СтатусПодключения, ДатаПолучения";

	ИначеЕсли Раздел = Разделы.НоменклатураКонтрагентов Тогда

		ПоляТаблицы = ПоляТаблицыНоменклатураКонтрагентов;
		ПоляРаздела = ПоляТаблицыНоменклатураКонтрагентов;

	КонецЕсли;

	Если ПакетноеОтображение Тогда
		
		РазделыБезДатыПакета = Новый Массив;
		РазделыБезДатыПакета.Добавить(Разделы.Сформировать);
		РазделыБезДатыПакета.Добавить(Разделы.Распаковать);
		
		Если РазделыБезДатыПакета.Найти(Раздел) = Неопределено Тогда
			ПараметрыЗамены = Новый Структура("Дата", "ДатаПакета");
			ПоляРаздела = ЗаменитьПоляРаздела(ПоляРаздела, ПараметрыЗамены);
		КонецЕсли;
			
	КонецЕсли;

	ПоляТаблицыБезПереносовСтрок = СтрЗаменить(ПоляТаблицы, Символы.ПС, "");
	ПоляТаблицы = СтрЗаменить(ПоляТаблицыБезПереносовСтрок, " ", "");
	ПоляРазделаБезПереносовСтрок = СтрЗаменить(ПоляРаздела, Символы.ПС, "");
	ПоляРаздела = СтрЗаменить(ПоляРазделаБезПереносовСтрок, " ", "");

	МассивПолеТаблицы = СтрРазделить(ПоляТаблицы, ",", Ложь);
	МассивПолейРаздела = СтрРазделить(ПоляРаздела, ",", Ложь);

	ВидимостьПолей = Новый Соответствие;
	Для каждого Поле Из МассивПолеТаблицы Цикл

		Видимость = (МассивПолейРаздела.Найти(Поле) <> Неопределено);
		ВидимостьПолей.Вставить(Поле, Видимость);

	КонецЦикла;

	Возврат ВидимостьПолей;

КонецФункции

&НаСервере
Функция НастройкиОтображенияРазделов()

	СписокПользователей = Новый Массив;
	СписокПользователей.Добавить(Пользователи.АвторизованныйПользователь());
	Если РежимОтображения <> РежимыОтображенияФормы().МоиДокументы Тогда
		СписокПользователей.Добавить(ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	КонецЕсли;

	НастройкиОтображения = Новый Структура;
	НастройкиОтображения.Вставить("РежимОтображения", РежимОтображения);
	НастройкиОтображения.Вставить("СписокПользователей", СписокПользователей);
	НастройкиОтображения.Вставить("ОтправлятьВходящиеДокументыНаУтверждение", ОтправлятьВходящиеДокументыНаУтверждение);
	НастройкиОтображения.Вставить("ПоказыватьПомеченныеНаУдаление", ПоказыватьПомеченныеНаУдаление);

	Возврат НастройкиОтображения;

КонецФункции

&НаСервере
Процедура НастроитьСпискиРазделов()

	НастройкиОтображения = НастройкиОтображенияРазделов();

	УстановитьПараметрыСписковРазделов(НастройкиОтображения);

	СоздатьОтборПоРазделамВСпискахРазделов(НастройкиОтображения);

	СоздатьБыстрыйОтборВСпискахРазделов();

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСписковРазделов(Знач НастройкиОтображения)
	
	Форма = ЭтотОбъект;
	Разделы = РазделыФормы();
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ДатаПереходаНаВерсиюСПрочтенностью = РаботаСПрочтениямиВызовСервера.ПолучитьДатуПереходаНаВерсиюСПрочтенностью();

	ОграничениеОтбора = Новый Массив;
	ОграничениеОтбора.Добавить("СписокПользователей");
	ОграничениеОтбора.Добавить("ПараметрыДанных");

	ИмяСписка = СписокРаздела(Разделы.Входящие);
	Список = Форма[ИмяСписка];
	Список.Параметры.УстановитьЗначениеПараметра("РежимОтображения", НастройкиОтображения.РежимОтображения);
	Список.Параметры.УстановитьЗначениеПараметра("СписокПользователей", НастройкиОтображения.СписокПользователей);
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ТекущийПользователь);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаПереходаНаВерсиюСПрочтенностью", ДатаПереходаНаВерсиюСПрочтенностью);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьПомеченныеНаУдаление", НастройкиОтображения.ПоказыватьПомеченныеНаУдаление);
	Список.УстановитьОграниченияИспользованияВОтборе(ОграничениеОтбора);

	ИмяСписка = СписокРаздела(Разделы.Исходящие);
	Список = Форма[ИмяСписка];
	Список.Параметры.УстановитьЗначениеПараметра("РежимОтображения", НастройкиОтображения.РежимОтображения);
	Список.Параметры.УстановитьЗначениеПараметра("СписокПользователей", НастройкиОтображения.СписокПользователей);
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ТекущийПользователь);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаПереходаНаВерсиюСПрочтенностью", ДатаПереходаНаВерсиюСПрочтенностью);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьПомеченныеНаУдаление", НастройкиОтображения.ПоказыватьПомеченныеНаУдаление);
	Список.УстановитьОграниченияИспользованияВОтборе(ОграничениеОтбора);
	
	ИмяСписка = СписокРаздела(Разделы.Ознакомиться);
	Список = Форма[ИмяСписка];
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьПомеченныеНаУдаление", НастройкиОтображения.ПоказыватьПомеченныеНаУдаление);
	Список.УстановитьОграниченияИспользованияВОтборе(ОграничениеОтбора);
	
	ИмяСписка = СписокРаздела(Разделы.Отправить);
	Список = Форма[ИмяСписка];
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьПомеченныеНаУдаление", НастройкиОтображения.ПоказыватьПомеченныеНаУдаление);
	Список.УстановитьОграниченияИспользованияВОтборе(ОграничениеОтбора);
	
	ИмяСписка = СписокРаздела(Разделы.Ошибки);
	Список = Форма[ИмяСписка];
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьПомеченныеНаУдаление", НастройкиОтображения.ПоказыватьПомеченныеНаУдаление);
	Список.УстановитьОграниченияИспользованияВОтборе(ОграничениеОтбора);
	
	ТипыДоговорСКонтрагентомЭДО.ЗагрузитьЗначения(Метаданные.ОпределяемыеТипы.ДоговорСКонтрагентомЭДО.Тип.Типы());
	ПустойКонтрагент = Метаданные.ОпределяемыеТипы.КонтрагентБЭД.Тип.ПривестиЗначение();
	
	ПриглашенияЭД.Параметры.УстановитьЗначениеПараметра("ПустойКонтрагент", ПустойКонтрагент);
	ПриглашенияЭД.Параметры.УстановитьЗначениеПараметра("ИНН", НСтр("ru = 'ИНН'"));
	
	Сформировать.Параметры.УстановитьЗначениеПараметра("ПустойКонтрагент", ПустойКонтрагент);
	Сформировать.Параметры.УстановитьЗначениеПараметра("ТипыДоговорСКонтрагентомЭДО", ТипыДоговорСКонтрагентомЭДО);

КонецПроцедуры

&НаСервере
Процедура СоздатьБыстрыйОтборВСпискахРазделов()

	ВсеСписки = Новый Массив;
	ВсеСписки.Добавить(ВходящиеЭД);
	ВсеСписки.Добавить(ИсходящиеЭД);
	ВсеСписки.Добавить(ОтправитьЭД);
	ВсеСписки.Добавить(КонтейнерыЭД);
	ВсеСписки.Добавить(ПриглашенияЭД);
	ВсеСписки.Добавить(Сформировать);

	Для Каждого Список Из ВсеСписки Цикл

		ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, "БыстрыйОтбор",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СоздатьОтборПоРазделамВСпискахРазделов(Знач НастройкиОтображения)

	РазделыФорм = РазделыФормы();

	// Исходящие
	Список = ИсходящиеЭД;

	Разделы = Новый Массив;
	Разделы.Добавить(РазделыФорм.Исходящие);

	Разделы.Добавить(РазделыФорм.ПодписатьИсх);
	Разделы.Добавить(РазделыФорм.ИсправитьИсх);
	Разделы.Добавить(РазделыФорм.АннулироватьИсх);
	Разделы.Добавить(РазделыФорм.НаКонтролеИсх);

	СоздатьГруппуОтбораПоРазделам(Разделы, НастройкиОтображения, Список.Отбор);

	// Входящие
	Список = ВходящиеЭД;

	Разделы = Новый Массив;
	Разделы.Добавить(РазделыФорм.Входящие);
	Разделы.Добавить(РазделыФорм.Обработать);
	Разделы.Добавить(РазделыФорм.Утвердить);
	Разделы.Добавить(РазделыФорм.Подписать);
	Разделы.Добавить(РазделыФорм.Исправить);
	Разделы.Добавить(РазделыФорм.Аннулировать);
	Разделы.Добавить(РазделыФорм.НаКонтроле);

	СоздатьГруппуОтбораПоРазделам(Разделы, НастройкиОтображения, Список.Отбор);

	// Ознакомиться
	Список = ОзнакомитьсяЭД;

	Разделы = Новый Массив;
	Разделы.Добавить(РазделыФорм.Ознакомиться);

	СоздатьГруппуОтбораПоРазделам(Разделы, НастройкиОтображения, Список.Отбор);

	// Отправить
	Список = ОтправитьЭД;

	Разделы = Новый Массив;
	Разделы.Добавить(РазделыФорм.Отправить);

	СоздатьГруппуОтбораПоРазделам(Разделы, НастройкиОтображения, Список.Отбор);
	
	// Контейнеры
	Список = КонтейнерыЭД;

	Разделы = Новый Массив;
	Разделы.Добавить(РазделыФорм.Распаковать);

	СоздатьГруппуОтбораПоРазделам(Разделы, НастройкиОтображения, Список.Отбор);

	// Приглашения
	Список = ПриглашенияЭД;

	Разделы = Новый Массив;
	Разделы.Добавить(РазделыФорм.ТребуетсяПригласить);
	Разделы.Добавить(РазделыФорм.ЖдемСогласия);
	Разделы.Добавить(РазделыФорм.ТребуетсяСогласие);
	Разделы.Добавить(РазделыФорм.ПриглашенияОзнакомиться);

	СоздатьГруппуОтбораПоРазделам(Разделы, НастройкиОтображения, Список.Отбор);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьГруппуОтбораПоРазделам(Знач Разделы, Знач НастройкиОтображения, Отбор)
	
	ГруппаОтборПоРазделам = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Отбор.Элементы,
		"ОтборПоРазделам", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);

	Для Каждого Раздел Из Разделы Цикл		
				
		ГруппаРаздел = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаОтборПоРазделам, "Раздел"
			+ Раздел, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);

		СоздатьОтборПоРазделу(Раздел, НастройкиОтображения, ГруппаРаздел);

	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьОтборПоРазделу(Знач Раздел, Знач НастройкиОтображения, ГруппаОтбора)

	// Изменения в отборы вносить согласовано с текстами запросов количества элементов в разделе.
	// См. метод ТекстЗапросаКоличестваЭлементовПоРазделуБезОтбора.
	РежимОтображения = НастройкиОтображения.РежимОтображения;
	СписокПользователей = НастройкиОтображения.СписокПользователей;
	Разделы = РазделыФормы();
	РежимыОтображенияФормы = РежимыОтображенияФормы();

	Если Раздел = Разделы.Входящие Тогда

		Если РежимОтображения <> РежимыОтображенияФормы.ВсеДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;
		
		ЗначенияСостояниеЭДО = Новый Массив;
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.Аннулирован"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОбменЗавершен"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ЗакрытПринудительно"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ЗакрытСОтклонением"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СостояниеЭДО", ЗначенияСостояниеЭДО,
			ВидСравненияКомпоновкиДанных.НеВСписке, , Истина);
	
	ИначеЕсли Раздел = Разделы.Обработать Тогда

		Если РежимОтображения <> РежимыОтображенияФормы.ВсеДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;

		Значение = Истина;

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ЕстьКонтрольОтражения", Истина,
			ВидСравненияКомпоновкиДанных.Равно, , Истина);

		Значение = Новый Массив;
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяУточнение"));
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.Аннулирован"));
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования"));
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяОтправкаАннулирования"));
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеАннулирования"));
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.НеСформирован"));
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ЗакрытПринудительно"));
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ЗакрытСОтклонением"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора,
			"СостояниеЭДО", Значение, ВидСравненияКомпоновкиДанных.НеВСписке,, Истина);

	ИначеЕсли Раздел = Разделы.Утвердить Тогда

		Если РежимОтображения <> РежимыОтображенияФормы.ВсеДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;

		Значение = ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяУтверждение");

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СостояниеЭДО", Значение,
			ВидСравненияКомпоновкиДанных.Равно, , Истина);
		
	ИначеЕсли Раздел = Разделы.Подписать Тогда

		Если РежимОтображения = РежимыОтображенияФормы.МоиДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;

		Значения = Новый Массив;
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписание"));
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения"));
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СостояниеЭДО", Значения,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.Исправить Тогда

		Если РежимОтображения <> РежимыОтображенияФормы.ВсеДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;

		Значение = Новый Массив;
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяУточнение"));

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СостояниеЭДО", Значение,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.Аннулировать Тогда

		Если РежимОтображения <> РежимыОтображенияФормы.ВсеДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;

		Значение = Новый Массив;
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования"));
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования"));
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяОтправкаАннулирования"));

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СостояниеЭДО", Значение,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.НаКонтроле Тогда

		Если РежимОтображения = РежимыОтображенияФормы.МоиДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "РежимОтображения", РежимыОтображенияФормы.КИсполнению,
			ВидСравненияКомпоновкиДанных.НеРавно, , Истина);

		ЗначенияСостояниеЭДО = Новый Массив;
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеАннулирования"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяИзвещениеОПолучении"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяИсправление"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПередачаОператору"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждение"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеОператора"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяОтветНаПриглашение"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяИзвещениеПоОтклонению"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяИзвещениеОПолучении"));
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СостояниеЭДО", ЗначенияСостояниеЭДО,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.Исходящие Тогда

		Если РежимОтображения = РежимыОтображенияФормы.МоиДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;
		
		ЗначенияСостояниеЭДО = Новый Массив;
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.Аннулирован"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОбменЗавершен"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ЗакрытПринудительно"));
		ЗначенияСостояниеЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ЗакрытСОтклонением"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СостояниеЭДО", ЗначенияСостояниеЭДО,
			ВидСравненияКомпоновкиДанных.НеВСписке, , Истина);
	
	ИначеЕсли Раздел = Разделы.ПодписатьИсх Тогда

		Если РежимОтображения = РежимыОтображенияФормы.МоиДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		ИначеЕсли РежимОтображения = РежимыОтображенияФормы.КИсполнению Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "НаПодпись", Истина, 
				ВидСравненияКомпоновкиДанных.Равно, , Истина);

		КонецЕсли;

		Значения = Новый Массив;
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписание"));
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения"));
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещенияПоОтклонению"));

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СостояниеЭДО", Значения,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.ИсправитьИсх Тогда

		Если РежимОтображения <> РежимыОтображенияФормы.ВсеДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;

		Значение = Новый Массив;
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяУточнение"));

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СостояниеЭДО", Значение,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.АннулироватьИсх Тогда

		Если РежимОтображения <> РежимыОтображенияФормы.ВсеДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;
		
		Значения = Новый Массив;
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования"));
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования"));

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СостояниеЭДО", Значения,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.НаКонтролеИсх Тогда

		Если РежимОтображения = РежимыОтображенияФормы.МоиДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "РежимОтображения", РежимыОтображенияФормы.КИсполнению,
			ВидСравненияКомпоновкиДанных.НеРавно, , Истина);

		ЗначенияСостоянийЭДО = Новый Массив;
		ЗначенияСостоянийЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеАннулирования"));
		ЗначенияСостоянийЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяИзвещениеОПолучении"));
		ЗначенияСостоянийЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяИсправление"));
		ЗначенияСостоянийЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПередачаОператору"));
		ЗначенияСостоянийЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждение"));
		ЗначенияСостоянийЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеОператора"));
		ЗначенияСостоянийЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяОтветНаПриглашение"));
		ЗначенияСостоянийЭДО.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяИзвещениеПоОтклонению"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СостояниеЭДО", ЗначенияСостоянийЭДО,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.Ознакомиться Тогда

		Если РежимОтображения <> РежимыОтображенияФормы.ВсеДокументы Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ответственный", СписокПользователей,
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

		КонецЕсли;

	ИначеЕсли Раздел = Разделы.Отправить Тогда
		
		Возврат;
		
	ИначеЕсли Раздел = Разделы.Распаковать Тогда

		Значение = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Входящий");

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Направление", Значение,
			ВидСравненияКомпоновкиДанных.Равно, , Истина);

		Значение = ТранспортныеКонтейнерыЭДО.СтатусыНеРаспакованныхТранспортныхСообщенийБЭД();

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Статус", Значение,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.ТребуетсяПригласить Тогда

		Значение = Новый Массив;
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ТребуетсяОтправить"));

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СтатусПодключения", Значение,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.ЖдемСогласия Тогда

		Значение = Новый Массив;
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ОжидаемСогласия"));
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.НастройкаРоуминга"));

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СтатусПодключения", Значение,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.ТребуетсяСогласие Тогда

		Значение = Новый Массив;
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ТребуетсяСогласие"));

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "СтатусПодключения", Значение,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

	ИначеЕсли Раздел = Разделы.ПриглашенияОзнакомиться Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ознакомиться", Истина,
			ВидСравненияКомпоновкиДанных.Равно, , Истина);

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаКоличестваЭлементовПоРазделуБезОтбора(Знач Раздел,
		ОтправлятьВходящиеДокументыНаУтверждение)

	// Изменения в тексты запросов вносить согласовано с отборами по разделу.
	// См. метод СоздатьОтборПоРазделу.

	ПараметрыТекущихЭД = ИнтерфейсДокументовЭДО.НовыеПараметрыОпределенияТекущихЭлектронныхДокументов();
	ПараметрыТекущихЭД.Раздел = Раздел;
	ПараметрыТекущихЭД.КоличествоПолучаемыхЗаписей = 1000;
	ПараметрыТекущихЭД.ОтправлятьВходящиеДокументыНаУтверждение = ОтправлятьВходящиеДокументыНаУтверждение;

	Запрос = ИнтерфейсДокументовЭДО.ЗапросКоличестваТекущихЭлектронныхДокументов(ПараметрыТекущихЭД);

	Возврат Запрос.Текст;

КонецФункции

&НаКлиенте
Процедура ПриИзмененииРаздела(Знач НовыйРаздел, ИсключитьСерверныеВызовы = Ложь)

// &ЗамерПроизводительности
	ИмяОперации = СтрШаблон("Обработка.РабочиеМестаЭДО.Форма.ТекущиеДела.ПоказатьРаздел.%1", НовыйРаздел);
	ОценкаПроизводительностиКлиент.ЗамерВремени(ИмяОперации);

	Если ИсключитьСерверныеВызовы Тогда
		ТекущийРаздел = НовыйРаздел;
		ПодключитьОбработчикОжидания("ПоказатьРазделКлиент", 0.1, Истина);
	Иначе
		ПоказатьРаздел(НовыйРаздел);
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновитьСчетчикиВПанелиРазделов", 2, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРазделКлиент()
	ПоказатьРаздел(ТекущийРаздел);
КонецПроцедуры

&НаСервере
Процедура ПоказатьРаздел(Знач Раздел)

	ТекущийРаздел = Раздел;

	ПоказатьКомандыРаздела(Раздел);
	ПоказатьСписокРаздела(Раздел);
	
	ОчиститьВыделениеСтрок(Элементы.СформироватьЭД);
	ОчиститьВыделениеСтрок(Элементы.ВходящиеЭД);
	ОчиститьВыделениеСтрок(Элементы.КонтейнерыЭД);
	ОчиститьВыделениеСтрок(Элементы.ОтправитьЭД);
	ОчиститьВыделениеСтрок(Элементы.ИсходящиеЭД);
	ОчиститьВыделениеСтрок(Элементы.СформироватьЭД);
	
	ПоказатьЭлементыРаздела(Раздел);

КонецПроцедуры

&НаСервере
Процедура ОчиститьВыделениеСтрок(Элемент)

	Элемент.ВыделенныеСтроки.Очистить();

КонецПроцедуры

&НаСервере
Процедура ПоказатьРазделСПроверкой(Знач Раздел)

	ОтборПоИмени = Новый Структура("Имя", Раздел);
	НайденныеСтроки = ОписаниеРазделов.НайтиСтроки(ОтборПоИмени);
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		ПоказатьРаздел(Раздел);
	Иначе
		ШаблонИсключения = НСтр("ru = 'Неизвестный раздел текущих дел ЭДО: {%1}'");
		ВызватьИсключение СтрШаблон(ШаблонИсключения, Раздел);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоказатьКомандыРаздела(Знач Раздел)
	
	Разделы = РазделыФормы();
	ВыполненПереходНаУниверсальныеСообщения = РегламентыЭДО.ВыполненПереходНаУниверсальныеСообщения();
	ИмяКомандыОтклонения = ?(ВыполненПереходНаУниверсальныеСообщения, "ВходящиеЭДОтказатьсяОтПодписания",
		"ВходящиеЭДОтклонитьДокумент");
	
	КомандыРазделов = Новый Соответствие;
	
	// Команды списка ВходящиеЭД
	КомандыРазделов.Вставить(Разделы.Входящие, "ВходящиеЭДЗакрытьПринудительно, ВходящиеЭДПеренаправить,
		|ВходящиеЭДУтвердитьПодписатьИОтправить");
	КомандыРазделов.Вставить(Разделы.Обработать, "ВходящиеЭДСопоставитьНоменклатуру, ВходящиеЭДПровестиУчетныеДокументы, 
		|ВходящиеЭДЗакрытьПринудительно, ВходящиеЭДПеренаправить");
	КомандыРазделов.Вставить(Разделы.Утвердить, "ВходящиеЭДЗакрытьПринудительно, ВходящиеЭДПеренаправить,
		|ВходящиеЭДУтвердитьЭД, " + ИмяКомандыОтклонения);
	КомандыРазделов.Вставить(Разделы.Подписать, "ВходящиеЭДЗакрытьПринудительно, ВходящиеЭДПеренаправить, 
		|ВходящиеЭДПодписать, " + ИмяКомандыОтклонения);
	КомандыРазделов.Вставить(Разделы.Исправить, "ВходящиеЭДЗакрытьПринудительно, ВходящиеЭДПеренаправить");
	КомандыРазделов.Вставить(Разделы.Аннулировать, "ВходящиеЭДЗакрытьПринудительно, ВходящиеЭДПеренаправить, 
		|ВходящиеЭДПринятьАннулирование, ВходящиеЭДОтклонитьАннулирование");
	КомандыРазделов.Вставить(Разделы.НаКонтроле, "ВходящиеЭДЗакрытьПринудительно, ВходящиеЭДПеренаправить");

	// Команды списка ИсходящиеЭД
	КомандыРазделов.Вставить(Разделы.Исходящие, "ИсходящиеЭДЗакрытьПринудительно, ИсходящиеЭДСоздатьПроизвольныйДокумент,
		|ИсходящиеЭДПеренаправить, ИсходящиеЭДУтвердитьПодписатьИОтправить, ИсходящиеЭДМассоваяОтправкаФайлов");
	КомандыРазделов.Вставить(Разделы.Сформировать, "СформироватьЭДЗакрытьПринудительно, СформироватьЭДИзменитьДокумент,
		|СформироватьЭДПросмотретьЭД, СформироватьЭДСформироватьПодписатьИОтправить, 
		|СформироватьЭДСоздатьПроизвольныйДокумент, СформироватьЭДМассоваяОтправкаФайлов");
	КомандыРазделов.Вставить(Разделы.ПодписатьИсх, "ИсходящиеЭДЗакрытьПринудительно, ИсходящиеЭДПеренаправить,
		|ИсходящиеЭДПодписать, ИсходящиеЭДОтклонитьПодписание, ИсходящиеЭДМассоваяОтправкаФайлов");
	КомандыРазделов.Вставить(Разделы.ИсправитьИсх, "ИсходящиеЭДЗакрытьПринудительно, ИсходящиеЭДПеренаправить,
		|ИсходящиеЭДМассоваяОтправкаФайлов");
	КомандыРазделов.Вставить(Разделы.АннулироватьИсх, "ИсходящиеЭДЗакрытьПринудительно, ИсходящиеЭДПеренаправить,
		|ИсходящиеЭДПринятьАннулирование, ИсходящиеЭДОтклонитьАннулирование, ИсходящиеЭДМассоваяОтправкаФайлов");
	КомандыРазделов.Вставить(Разделы.НаКонтролеИсх, "ИсходящиеЭДЗакрытьПринудительно, ИсходящиеЭДПеренаправить,
		|ИсходящиеЭДМассоваяОтправкаФайлов");

	// Команды списка ОзнакомитьсяЭД
	КомандыРазделов.Вставить(Разделы.Ознакомиться, "ОзнакомитьсяЭДОтправитьВАрхив, ОзнакомитьсяЭДПеренаправить");

	// Команды списка ОтправитьЭД
	КомандыРазделов.Вставить(Разделы.Отправить, "ОтправитьЭДОтправить, ОтправитьЭДВернутьНаПодготовкуКОтправке,
		|ОтправитьЭДЗакрытьПринудительно, ОтправитьЭДМассоваяОтправкаФайлов");
		
	// Команды списка КонтейнерыЭД
	КомандыРазделов.Вставить(Разделы.Распаковать, "КонтейнерыЭДРаспаковатьВыделенныеКонтейнеры,
		|КонтейнерыЭДУстановитьСтатусОтмененКонтейнера");
		
	// Команды списка ОшибкиЭД
	КомандыРазделов.Вставить(Разделы.Ошибки, "ОшибкиЭДОтправитьПовторно, ОшибкиЭДЗакрытьПринудительно,
		|ОшибкиЭДПеренаправить, ОшибкиЭДМассоваяОтправкаФайлов");
		
	// Команды списка ПриглашенияЭД
	КомандыРазделов.Вставить(Разделы.Приглашения, "ПриглашенияЭДНовоеПриглашение");
	КомандыРазделов.Вставить(Разделы.ТребуетсяПригласить, "ПриглашенияЭДОтправитьПриглашения, ПриглашенияЭДНовоеПриглашение");
	КомандыРазделов.Вставить(Разделы.ЖдемСогласия, "ПриглашенияЭДОтозватьПриглашение");
	КомандыРазделов.Вставить(Разделы.ТребуетсяСогласие, "ПриглашенияЭДПринятьПриглашения, ПриглашенияЭДОтклонитьПриглашения");
	КомандыРазделов.Вставить(Разделы.ПриглашенияОзнакомиться, "ПриглашенияЭДОтправитьПриглашенияВАрхив");

	// Команды списка НоменклатураКонтрагентов
	КомандыРазделов.Вставить(Разделы.НоменклатураКонтрагентов, "НоменклатураКонтрагентовОткрытьНоменклатуруКонтрагентов, 
		|НоменклатураКонтрагентовСопоставитьНоменклатуру, НоменклатураКонтрагентовПравилаПоискаПоЧастиНаименования");

	ЭлементыКоманд = Новый Соответствие;
	ЭлементыКоманд.Вставить("ВходящиеЭДЗакрытьПринудительно", Элементы.ВходящиеЭДЗакрытьПринудительно);
	ЭлементыКоманд.Вставить("ВходящиеЭДПеренаправить", Элементы.ВходящиеЭДПеренаправить);
	ЭлементыКоманд.Вставить("ВходящиеЭДУтвердитьПодписатьИОтправить", Элементы.ВходящиеЭДУтвердитьПодписатьИОтправить);
	ЭлементыКоманд.Вставить("ВходящиеЭДСопоставитьНоменклатуру", Элементы.ВходящиеЭДСопоставитьНоменклатуру);
	ЭлементыКоманд.Вставить("ВходящиеЭДПровестиУчетныеДокументы", Элементы.ВходящиеЭДПровестиУчетныеДокументы);
	ЭлементыКоманд.Вставить("ВходящиеЭДУтвердитьЭД", Элементы.ВходящиеЭДУтвердитьЭД);
	ЭлементыКоманд.Вставить("ВходящиеЭДОтказатьсяОтПодписания", Элементы.ВходящиеЭДОтказатьсяОтПодписания);
	ЭлементыКоманд.Вставить("ВходящиеЭДОтклонитьДокумент", Элементы.ВходящиеЭДОтклонитьДокумент);
	ЭлементыКоманд.Вставить("ВходящиеЭДПодписать", Элементы.ВходящиеЭДПодписать);
	ЭлементыКоманд.Вставить("ВходящиеЭДПринятьАннулирование", Элементы.ВходящиеЭДПринятьАннулирование);
	ЭлементыКоманд.Вставить("ВходящиеЭДОтклонитьАннулирование", Элементы.ВходящиеЭДОтклонитьАннулирование);
		
	ЭлементыКоманд.Вставить("ИсходящиеЭДЗакрытьПринудительно", Элементы.ИсходящиеЭДЗакрытьПринудительно);
	ЭлементыКоманд.Вставить("ИсходящиеЭДСоздатьПроизвольныйДокумент",
		Элементы.ИсходящиеЭДСоздатьПроизвольныйДокумент);
	ЭлементыКоманд.Вставить("ИсходящиеЭДПеренаправить", Элементы.ИсходящиеЭДПеренаправить);
	ЭлементыКоманд.Вставить("ИсходящиеЭДУтвердитьПодписатьИОтправить", Элементы.ИсходящиеЭДУтвердитьПодписатьИОтправить);
	ЭлементыКоманд.Вставить("СформироватьЭДЗакрытьПринудительно", Элементы.СформироватьЭДЗакрытьПринудительно);
	ЭлементыКоманд.Вставить("СформироватьЭДСоздатьПроизвольныйДокумент",
		Элементы.СформироватьЭДСоздатьПроизвольныйДокумент);
	ЭлементыКоманд.Вставить("СформироватьЭДИзменитьДокумент", Элементы.СформироватьЭДИзменитьДокумент);
	ЭлементыКоманд.Вставить("СформироватьЭДПросмотретьЭД", Элементы.СформироватьЭДПросмотретьЭД);
	ЭлементыКоманд.Вставить("СформироватьЭДСформироватьПодписатьИОтправить",
		Элементы.СформироватьЭДСформироватьПодписатьИОтправить);
	ЭлементыКоманд.Вставить("ИсходящиеЭДПодписать", Элементы.ИсходящиеЭДПодписать);
	ЭлементыКоманд.Вставить("ИсходящиеЭДОтклонитьПодписание", Элементы.ИсходящиеЭДОтклонитьПодписание);
	ЭлементыКоманд.Вставить("ИсходящиеЭДПринятьАннулирование", Элементы.ИсходящиеЭДПринятьАннулирование);
	ЭлементыКоманд.Вставить("ИсходящиеЭДОтклонитьАннулирование", Элементы.ИсходящиеЭДОтклонитьАннулирование);
	
	ЭлементыКоманд.Вставить("ОзнакомитьсяЭДОтправитьВАрхив", Элементы.ОзнакомитьсяЭДОтправитьВАрхив);
	ЭлементыКоманд.Вставить("ОзнакомитьсяЭДПеренаправить", Элементы.ОзнакомитьсяЭДПеренаправить);
	
	ЭлементыКоманд.Вставить("ОтправитьЭДОтправить", Элементы.ОтправитьЭДОтправить);
	ЭлементыКоманд.Вставить("ОтправитьЭДВернутьНаПодготовкуКОтправке", Элементы.ОтправитьЭДВернутьНаПодготовкуКОтправке);
	ЭлементыКоманд.Вставить("ОтправитьЭДЗакрытьПринудительно", Элементы.ОтправитьЭДЗакрытьПринудительно);
	
	ЭлементыКоманд.Вставить("КонтейнерыЭДРаспаковатьВыделенныеКонтейнеры",
		Элементы.КонтейнерыЭДРаспаковатьВыделенныеКонтейнеры);
	ЭлементыКоманд.Вставить("КонтейнерыЭДУстановитьСтатусОтмененКонтейнера",
		Элементы.КонтейнерыЭДУстановитьСтатусОтмененКонтейнера);
		
	ЭлементыКоманд.Вставить("ОшибкиЭДОтправитьПовторно", Элементы.ОшибкиЭДОтправитьПовторно);
	ЭлементыКоманд.Вставить("ОшибкиЭДЗакрытьПринудительно", Элементы.ОшибкиЭДЗакрытьПринудительно);
	ЭлементыКоманд.Вставить("ОшибкиЭДПеренаправить", Элементы.ОшибкиЭДПеренаправить);
	
	ЭлементыКоманд.Вставить("ПриглашенияЭДОтправитьПриглашения", Элементы.ПриглашенияЭДОтправитьПриглашения);
	ЭлементыКоманд.Вставить("ПриглашенияЭДОтозватьПриглашение", Элементы.ПриглашенияЭДОтозватьПриглашение);
	ЭлементыКоманд.Вставить("ПриглашенияЭДПринятьПриглашения", Элементы.ПриглашенияЭДПринятьПриглашения);
	ЭлементыКоманд.Вставить("ПриглашенияЭДОтклонитьПриглашения", Элементы.ПриглашенияЭДОтклонитьПриглашения);
	ЭлементыКоманд.Вставить("ПриглашенияЭДОтправитьПриглашенияВАрхив",
		Элементы.ПриглашенияЭДОтправитьПриглашенияВАрхив);
	ЭлементыКоманд.Вставить("ПриглашенияЭДНовоеПриглашение", Элементы.ПриглашенияЭДНовоеПриглашение);
		
	ЭлементыКоманд.Вставить("НоменклатураКонтрагентовОткрытьНоменклатуруКонтрагентов",
		Элементы.НоменклатураКонтрагентовОткрытьНоменклатуруКонтрагентов);
	ЭлементыКоманд.Вставить("НоменклатураКонтрагентовСопоставитьНоменклатуру",
		Элементы.НоменклатураКонтрагентовСопоставитьНоменклатуру);
	ЭлементыКоманд.Вставить("НоменклатураКонтрагентовПравилаПоискаПоЧастиНаименования",
		Элементы.НоменклатураКонтрагентовПравилаПоискаПоЧастиНаименования);
		
	ЭлементыКоманд.Вставить("СформироватьЭДМассоваяОтправкаФайлов", Элементы.СформироватьЭДМассоваяОтправкаФайлов);
	ЭлементыКоманд.Вставить("ИсходящиеЭДМассоваяОтправкаФайлов", Элементы.ИсходящиеЭДМассоваяОтправкаФайлов);
	ЭлементыКоманд.Вставить("ОтправитьЭДМассоваяОтправкаФайлов", Элементы.ОтправитьЭДМассоваяОтправкаФайлов);
	ЭлементыКоманд.Вставить("ОшибкиЭДМассоваяОтправкаФайлов", Элементы.ОшибкиЭДМассоваяОтправкаФайлов);

	КомандыРазделаСтрокой = КомандыРазделов.Получить(Раздел);
	КомандыРазделаСтрокойБезПробелов = СтрЗаменить(КомандыРазделаСтрокой, " ", "");
	КомандыРазделаСтрокойБезПереносовИПробелов = СтрЗаменить(КомандыРазделаСтрокойБезПробелов, Символы.ПС, "");
	КомандыРаздела = СтрРазделить(КомандыРазделаСтрокойБезПереносовИПробелов, ",");

	Для Каждого КлючЗначение Из ЭлементыКоманд Цикл

		ИмяКоманды = КлючЗначение.Ключ;
		ЭлементФормы = КлючЗначение.Значение;

		ЕстьКоманда = КомандыРаздела.Найти(ИмяКоманды) <> Неопределено;
		КомандаДоступна = (НедоступныеКоманды.НайтиПоЗначению(ИмяКоманды) = Неопределено);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементФормы.Имя, "Видимость",
			ЕстьКоманда И КомандаДоступна);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПоказатьСписокРаздела(Знач Раздел)

	ПоказатьСтраницуРаздела(Раздел);

	ПоказатьПоляРаздела(Раздел, ПакетноеОтображение);

	ПрименитьОтборыКРазделу(Раздел);

КонецПроцедуры

&НаСервере
Процедура ПоказатьСтраницуРаздела(Знач Раздел)

	ИмяСтраницы = СтраницаРаздела(Раздел);

	Если ЗначениеЗаполнено(ИмяСтраницы) Тогда
		Элементы.ПанельСписков.ТекущаяСтраница = Элементы[ИмяСтраницы];
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоказатьПоляРаздела(Знач Раздел, Знач ПакетноеОтображение)

	ИмяТаблицы = ТаблицаРаздела(Раздел);
	Если Не ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Возврат;
	КонецЕсли;

	ПоляТаблицы = ПоляРаздела(Раздел, ПакетноеОтображение);

	Для Каждого Поле Из ПоляТаблицы Цикл

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяТаблицы
			+ Поле.Ключ, "Видимость", Поле.Значение);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьНавигациюПоРазделамНаСервере(Знач ПересчитатьКоличество = Истина,
		Знач ПересчитатьКоличествоОтбор = Истина)

	ОбновитьСчетчикиВПанелиРазделовНаСервере(ПересчитатьКоличество, ПересчитатьКоличествоОтбор);

	ПерейтиВТекущийРазделНаСервере();
	ОбновитьДинамическиеСписки();

КонецПроцедуры

&НаСервере
Процедура ОбновитьСчетчикиВПанелиРазделовНаСервере(Знач ПересчитатьКоличество, Знач ПересчитатьКоличествоОтбор)
	
	РассчитатьКоличествоЭлементовВРазделах(ПересчитатьКоличество, ПересчитатьКоличествоОтбор);

	ОбновитьДеревоНавигации(ДеревоДействий.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСчетчикиВПанелиРазделов()
	
	ОбновитьСчетчикиВПанелиРазделовНаСервере(Истина, Истина);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДеревоНавигации(ЭлементыДереваНавигации)

	КОбработке = 0;

	Для Каждого СтрокаНавигации Из ЭлементыДереваНавигации Цикл

		ОтборРаздела = Новый Структура("Имя", СтрокаНавигации.Значение);
		НайденныеСтроки = ОписаниеРазделов.НайтиСтроки(ОтборРаздела);
		Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Продолжить;
		КонецЕсли;
		Раздел = НайденныеСтроки[0];

		СтрокаНавигации.Представление = Раздел.Представление;

		ВложенныеЭлементы = СтрокаНавигации.ПолучитьЭлементы();
		ЕстьВложенныеЭлементы = (ВложенныеЭлементы.Количество() > 0);

		Если ЕстьВложенныеЭлементы Тогда

			КОбработкеВложенные = ОбновитьДеревоНавигации(ВложенныеЭлементы);
			КОбработке = КОбработке + КОбработкеВложенные;
			СтрокаНавигации.ТребуетсяОбработка = КОбработкеВложенные;
		ИначеЕсли Раздел.Видимость Тогда
			КОбработке = КОбработке + Раздел.Количество;
			СтрокаНавигации.ТребуетсяОбработка = (Раздел.Количество > 0);
		КонецЕсли;

		Если Раздел.РассчитыватьКоличество И Раздел.КоличествоРассчитано
				И Раздел.Количество > 0 Тогда

			КоличествоОтборСтрокой = ?(Раздел.КоличествоОтбор >= 1000, "999+", Формат(Раздел.КоличествоОтбор, "ЧН=0; ЧГ=0"));
			СтрокаНавигации.Представление = СтрокаНавигации.Представление + " ("
				+ КоличествоОтборСтрокой;

			Если Раздел.Количество <> Раздел.КоличествоОтбор Тогда

				КоличествоСтрокой = ?(Раздел.Количество >= 1000, "999+", Формат(Раздел.Количество, "ЧН=0; ЧГ=0"));
				СтрокаНавигации.Представление = СтрокаНавигации.Представление + "/"
					+ КоличествоСтрокой;

			КонецЕсли;

			СтрокаНавигации.Представление = СтрокаНавигации.Представление + ")";

		КонецЕсли;

	КонецЦикла;

	Возврат КОбработке;

КонецФункции

&НаКлиенте
Процедура ОбновитьНавигациюПоРазделам()

	ОбновитьНавигациюПоРазделамНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПерейтиВТекущийРазделНаСервере()

	ИдентификаторСтроки = 0;
	ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("Значение", ИдентификаторСтроки,
		ДеревоДействий.ПолучитьЭлементы(), ТекущийРаздел, Ложь);

	Если Элементы.ДеревоДействий.ТекущаяСтрока <> ИдентификаторСтроки Тогда
		Элементы.ДеревоДействий.ТекущаяСтрока = ИдентификаторСтроки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрименитьОтборыКРазделу(Знач Раздел)

	ИмяСписка = СписокРаздела(Раздел);
	Список = ЭтотОбъект[ИмяСписка];

	ПрименитьОтборыКСпискуРаздела(Раздел, Список);

	УстановитьТекстКнопкиБыстрыхОтборов(Раздел);

	УстановитьДоступностьСбросаОтбора(Раздел);

КонецПроцедуры

&НаСервере
Процедура ПрименитьОтборыКСпискуРаздела(Знач Раздел, Список)

	УстановитьОтборПоРазделу(Раздел, Список);

	УстановитьБыстрыеОтборыПоРазделу(Раздел, Список);

	ОбработатьПересечениеПользовательскихОтборовИОтбораПоРазделу(Раздел, Список);

	ОбработатьПересечениеПользовательскихОтборовИБыстрыхОтборов(Раздел, Список);
	
	НастроитьБыстрыеОтборы(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПользовательскиеНастройкиПоРазделу(Знач Раздел, Знач Настройки)

	ИмяСписка = СписокРаздела(Раздел);
	Список = ЭтотОбъект[ИмяСписка];
	Список.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Настройки);
	СинхронизироватьПользовательскиеОтборы(ИмяСписка);
	ПриИзмененииОтбораНаСервере();

КонецПроцедуры

&НаСервере
Процедура СброситьКэшРасчетов()

	Если Не (ОбновитьКэшРасчетовОбщий ИЛИ ОбновитьКэшРасчетовОтбор) Тогда
		Возврат;
	КонецЕсли;

	КэшРасчетов = ПолучитьИзВременногоХранилища(АдресКэшаРасчетов);

	Для каждого КлючЗначение Из КэшРасчетов Цикл

		Раздел = КлючЗначение.Ключ;
		Макеты = КлючЗначение.Значение;

		Если ОбновитьКэшРасчетовОбщий Тогда
			Макеты.Общий = Неопределено;
		КонецЕсли;
		Если ОбновитьКэшРасчетовОтбор Тогда
			Макеты.Отбор = Неопределено;
		КонецЕсли;

		КэшРасчетов.Вставить(Раздел, Макеты);

	КонецЦикла;

	ОбновитьКэшРасчетовОбщий = Ложь;
	ОбновитьКэшРасчетовОтбор = Ложь;

	ПоместитьВоВременноеХранилище(КэшРасчетов, АдресКэшаРасчетов);

КонецПроцедуры

&НаСервере
Функция МакетРасчетаПоРазделу(Знач Раздел,
		Знач УчитыватьПользовательскиеНастройки, КэшРасчетов)

		// Ищем макет в кэше.
	Макет = Неопределено;
	ИспользуемыйМакет = ?(УчитыватьПользовательскиеНастройки, "Отбор", "Общий");

	Макеты = КэшРасчетов[Раздел];

	Если Макеты = Неопределено Тогда
		Макеты = Новый Структура("Общий,Отбор");
	Иначе
		Макет = Макеты[ИспользуемыйМакет];
	КонецЕсли;

	Если Макет <> Неопределено Тогда
		Возврат Макет;
	КонецЕсли;

	// Не нашли в кэше, формируем новый.
	Форма = ЭтотОбъект;

	// Заполняем СписокЭД копией списка раздела, 
	// применяем к нему необходимые отборы,
	// получаем из него итоговые настройки.
	ИмяСписка = СписокРаздела(Раздел);
	Список = форма[ИмяСписка];

	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	ЗаполнитьЗначенияСвойств(СвойстваСписка, Список);
	ЗаполнитьЗначенияСвойств(СписокЭД, СвойстваСписка);

	ФиксированныеНастройки = Список.КомпоновщикНастроек.ФиксированныеНастройки;
	СписокЭД.КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(ФиксированныеНастройки);
	СписокЭД.Порядок.Элементы.Очистить();

	Если УчитыватьПользовательскиеНастройки Тогда
	// Добавляем пользовательские настройки.
		ПользовательскиеНастройки = Список.КомпоновщикНастроек.ПользовательскиеНастройки;
		СписокЭД.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
	Иначе
	// Убираем пользовательские отборы.
		ПользовательскийОтбор = ИнтерфейсДокументовЭДО.ПользовательскийОтборСписка(СписокЭД);
		ПользовательскийОтбор.Элементы.Очистить();
	КонецЕсли;

	ПрименитьОтборыКСпискуРаздела(Раздел, СписокЭД);

	Если Не УчитыватьПользовательскиеНастройки Тогда
	// Убираем быстрый поиск из настроек.
		ГруппаБыстрыйОтбор = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(СписокЭД.Отбор.Элементы, "БыстрыйОтбор");
		ГруппаБыстрыйОтбор.Использование = Ложь;
	КонецЕсли;

	Настройки = СписокЭД.КомпоновщикНастроек.ПолучитьНастройки();

	Настройки.Порядок.Элементы.Очистить();
	Настройки.УсловноеОформление.Элементы.Очистить();

	// Определяем схему компоновки и меняем запрос.
	ИмяТаблицы = ТаблицаРаздела(Раздел);
	Таблица = Форма.Элементы[ИмяТаблицы];
	Схема = Таблица.ПолучитьИсполняемуюСхемуКомпоновкиДанных();

	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(Схема.НаборыДанных[0].Запрос);
	ПоследнийЗапрос = СхемаЗапроса.ПакетЗапросов.Получить(СхемаЗапроса.ПакетЗапросов.Количество()
		- 1);
		
	ЗапросСпискаСодержитАгрегатнуюФункциюИГруппировку = Ложь;
	ПоляДляДобавления = Новый Массив;
		
	Для Каждого Оператор Из ПоследнийЗапрос.Операторы Цикл

		Если Оператор.Группировка.Количество() Тогда  
			
			ПоляДляУдаления = Новый Массив;
			
			Для Каждого ВыбираемоеПоле Из Оператор.ВыбираемыеПоля Цикл
				
				Если ВыбираемоеПоле.СодержитАгрегатнуюФункцию() Тогда
					ЗапросСпискаСодержитАгрегатнуюФункциюИГруппировку = Истина;
					
					// Убираем поля с агрегатной функцией и добавляем новое, преобразовав к обычному выражению.
					АгрегатноеВыражение = Строка(ВыбираемоеПоле); 
					НачалоПараметра = СтрНайти(АгрегатноеВыражение, "(");
					ДлинаПараметраВыражения = СтрДлина(АгрегатноеВыражение) - НачалоПараметра - 1;
					ПараметрВыражения = Сред(АгрегатноеВыражение, НачалоПараметра + 1, ДлинаПараметраВыражения);
					ПутьКПолю = СокрЛП(СтрЗаменить(ПараметрВыражения, "РАЗЛИЧНЫЕ", ""));
	
					НовоеПолеСхемыЗапроса = Оператор.ВыбираемыеПоля.Добавить(ПутьКПолю);
					КолонкаПоля = ПоследнийЗапрос.Колонки.Найти(НовоеПолеСхемыЗапроса);
					ПоляДляДобавления.Добавить(КолонкаПоля.Псевдоним);
					
					ПоляДляУдаления.Добавить(ВыбираемоеПоле);
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого ПолеДляУдаления Из ПоляДляУдаления Цикл
				ИндексПоля = Оператор.ВыбираемыеПоля.Индекс(ПолеДляУдаления);
				Оператор.ВыбираемыеПоля.Удалить(ИндексПоля);
			КонецЦикла;
			
		КонецЕсли;
		
		Оператор.КоличествоПолучаемыхЗаписей = 1000;
		Если Не ЗапросСпискаСодержитАгрегатнуюФункциюИГруппировку Тогда
			// Добавляем в настройках только поле-счетчик.
			ПолеСчетчик = Оператор.ВыбираемыеПоля.Добавить("1");
			КолонкаСчетчик = ПоследнийЗапрос.Колонки.Найти(ПолеСчетчик);
			КолонкаСчетчик.Псевдоним = "_Счетчик";
			ПоляДляДобавления.Добавить(КолонкаСчетчик.Псевдоним);
		КонецЕсли;
		
	КонецЦикла;
	
	Схема.НаборыДанных[0].Запрос = СхемаЗапроса.ПолучитьТекстЗапроса();
	Настройки.Структура.Очистить();
	ДетальныеЗаписи = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Для Каждого ПолеДляДобавления Из ПоляДляДобавления Цикл
		ВыбранноеПоле = ДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(ПолеДляДобавления);
	КонецЦикла;

	// Выполняем схему.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), Ложь);

	// Помещаем рассчитанный макет в кэш
	Макеты[ИспользуемыйМакет] = Макет;
	КэшРасчетов.Вставить(Раздел, Макеты);

	Возврат Макет;

КонецФункции

&НаСервере
Процедура РассчитатьКоличествоЭлементовВРазделах(Знач ПересчитатьКоличество = Истина,
		Знач ПересчитатьКоличествоОтбор = Истина)

	Если Не (ПересчитатьКоличество ИЛИ ПересчитатьКоличествоОтбор) Тогда
		Возврат;
	КонецЕсли;

	СброситьКэшРасчетов();

	КэшРасчетов = ПолучитьИзВременногоХранилища(АдресКэшаРасчетов);

	ДанныеДляРасчета = Новый Массив;

	Для каждого Раздел Из ОписаниеРазделов Цикл

		Если Не (Раздел.РассчитыватьКоличество И Раздел.Видимость) Тогда
			Продолжить;
		КонецЕсли;

		Если ПересчитатьКоличество Тогда
			ЭлементРасчета = Новый Структура("Раздел, УчитыватьОтбор, Количество", Раздел.Имя, Ложь, 0);
			ДанныеДляРасчета.Добавить(ЭлементРасчета);
		КонецЕсли;

		Если ПересчитатьКоличествоОтбор
				И (ЕстьПользовательскийОтборПоРазделу(Раздел.Имя)
				ИЛИ ЕстьФиксированныйОтборПоРазделу(Раздел.Имя)) Тогда
			ЭлементРасчета = Новый Структура("Раздел, УчитыватьОтбор, Количество", Раздел.Имя, Истина, 0);
			ДанныеДляРасчета.Добавить(ЭлементРасчета);
		КонецЕсли;

	КонецЦикла;

	ВыполнитьРасчетКоличестваЭлементовВРазделах(ДанныеДляРасчета, КэшРасчетов);

	Для каждого ЭлементРасчета Из ДанныеДляРасчета Цикл

		ОтборРаздела = Новый Структура("Имя", ЭлементРасчета.Раздел);
		ВсеСтрокиРаздела = ОписаниеРазделов.НайтиСтроки(ОтборРаздела);

		Для каждого СтрокаРаздела Из ВсеСтрокиРаздела Цикл

			Если ЭлементРасчета.УчитыватьОтбор Тогда
				СтрокаРаздела.КоличествоОтбор = ЭлементРасчета.Количество;
			Иначе
				СтрокаРаздела.Количество = ЭлементРасчета.Количество;
				СтрокаРаздела.КоличествоОтбор = ЭлементРасчета.Количество;
			КонецЕсли;

			СтрокаРаздела.КоличествоРассчитано = Истина;

		КонецЦикла;

	КонецЦикла;

	ПоместитьВоВременноеХранилище(КэшРасчетов, АдресКэшаРасчетов);

КонецПроцедуры

&НаСервере
Процедура ВыполнитьРасчетКоличестваЭлементовВРазделах(ДанныеДляРасчета,
		КэшРасчетов)

	Если Не ЗначениеЗаполнено(ДанныеДляРасчета) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	ЧастиТекстаЗапроса = Новый Массив;

	НастройкиОтображения = НастройкиОтображенияРазделов();

	Запрос.УстановитьПараметр("РежимОтображения", НастройкиОтображения.РежимОтображения);
	Запрос.УстановитьПараметр("СписокПользователей", НастройкиОтображения.СписокПользователей);
	Запрос.УстановитьПараметр("ТипыДоговорСКонтрагентомЭДО", ТипыДоговорСКонтрагентомЭДО);

	ПоложениеРезультатовВПакете = Новый ТаблицаЗначений;
	ПоложениеРезультатовВПакете.Колонки.Добавить("Раздел");
	ПоложениеРезультатовВПакете.Колонки.Добавить("УчитыватьОтбор");
	ПоложениеРезультатовВПакете.Колонки.Добавить("Индекс");

	КоличествоЗапросовВПакете = 0;
	РазделительЗапросовВПакете = "
		|;
		|";

	Для каждого ЭлементРасчета Из ДанныеДляРасчета Цикл

		Если ЭлементРасчета.УчитыватьОтбор Тогда

			Макет = МакетРасчетаПоРазделу(ЭлементРасчета.Раздел, ЭлементРасчета.УчитыватьОтбор, КэшРасчетов);
			ТекстЗапроса = Макет.НаборыДанных[0].Запрос;

			// Обернем запрос в выборку количества
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
			Шаблон =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КОЛИЧЕСТВО(1) КАК _Счетчик
				|ИЗ
				|	(%1) КАК _ВложенныйЗапрос";
			ТекстЗапроса = СтрШаблон(Шаблон, ТекстЗапроса);

			// Переименовываем и устанавливаем параметры запроса.
			Префикс = СтрШаблон("%1_%2_", ЭлементРасчета.Раздел, Формат(ЭлементРасчета.УчитыватьОтбор, "БЛ=Ложь; БИ=Истина"));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&", "&" + Префикс);

			Для каждого Параметр Из Макет.ЗначенияПараметров Цикл
				Запрос.УстановитьПараметр(Префикс + Параметр.Имя, Параметр.Значение);
			КонецЦикла;

		Иначе

			ТекстЗапроса = ТекстЗапросаКоличестваЭлементовПоРазделуБезОтбора(ЭлементРасчета.Раздел, НастройкиОтображения.ОтправлятьВходящиеДокументыНаУтверждение);
			Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
				Продолжить;
			КонецЕсли;

		КонецЕсли;

		// Добавляем уничтожение временных таблиц, чтобы избежать конфликта имен.
		КоличествоВТ = ДобавитьУничтожениеВременныхТаблицВЗапрос(ТекстЗапроса);

		Если ЗначениеЗаполнено(ЧастиТекстаЗапроса) Тогда
			ЧастиТекстаЗапроса.Добавить(РазделительЗапросовВПакете);
		КонецЕсли;

		ТекстЗапросаВПакете = СтрШаблон("////////////////////////////////////////////////////////////////////////////
			|// %1 (%2)
			|
			|%3", ЭлементРасчета.Раздел, ЭлементРасчета.УчитыватьОтбор, ТекстЗапроса);
		ЧастиТекстаЗапроса.Добавить(ТекстЗапросаВПакете);

		// Вычисляем положение результата по разделу в пакете.
		КоличествоЗапросовВПакете = КоличествоЗапросовВПакете + 1 + КоличествоВТ * 2;

		СтрокаПоложения = ПоложениеРезультатовВПакете.Добавить();
		СтрокаПоложения.Раздел = ЭлементРасчета.Раздел;
		СтрокаПоложения.УчитыватьОтбор = ЭлементРасчета.УчитыватьОтбор;
		СтрокаПоложения.Индекс = КоличествоЗапросовВПакете - КоличествоВТ - 1;

	КонецЦикла;

	// Заполняем результаты по разделам по данным пакета.
	Запрос.Текст = СтрСоединить(ЧастиТекстаЗапроса);
	Результаты = Запрос.ВыполнитьПакет();

	Для каждого ЭлементРасчета Из ДанныеДляРасчета Цикл

		ОтборСтрок = Новый Структура("Раздел,УчитыватьОтбор");
		ЗаполнитьЗначенияСвойств(ОтборСтрок, ЭлементРасчета);

		НайденныеСтроки = ПоложениеРезультатовВПакете.НайтиСтроки(ОтборСтрок);
		Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Продолжить;
		КонецЕсли;

		ИндексРезультата = НайденныеСтроки[0].Индекс;

		Результат = Результаты[ИндексРезультата];

		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;

		Выборка = Результат.Выбрать();
		КоличествоЭлементов = 0;
		Пока Выборка.Следующий() Цикл
			КоличествоЭлементов = КоличествоЭлементов + Выборка._Счетчик;
		КонецЦикла;
		ЭлементРасчета.Количество = КоличествоЭлементов;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПоказатьЭлементыРаздела(Знач Раздел)

	Элементы.ВходящиеЭД.КартинкаСтрок = БиблиотекаКартинок.КоллекцияТиповДокументовЭДО;
	Элементы.ГруппаЛегенда.Видимость = ПоказыватьОбластьЛегенды;
	ОчиститьОбластьПросмотра(ЭтотОбъект);
	НастроитьВидимостьОбластиПросмотра(Раздел);
	
КонецПроцедуры

// Возвращаемое значение:
//  См. ИнтерфейсДокументовЭДО.РазделыТекущихДел
&НаСервереБезКонтекста
Функция РазделыФормы()
	
	Возврат ИнтерфейсДокументовЭДО.РазделыТекущихДел();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СпискиФормы()
	
	Результат = Новый Структура;
	Результат.Вставить("ВходящиеЭД", "ВходящиеЭД");
	Результат.Вставить("ИсходящиеЭД", "ИсходящиеЭД");
	Результат.Вставить("Сформировать", "Сформировать");
	Результат.Вставить("ОзнакомитьсяЭД", "ОзнакомитьсяЭД");
	Результат.Вставить("ОтправитьЭД", "ОтправитьЭД");
	Результат.Вставить("КонтейнерыЭД", "КонтейнерыЭД");
	Результат.Вставить("ОшибкиЭД", "ОшибкиЭД");
	Результат.Вставить("ПриглашенияЭД", "ПриглашенияЭД");
	Результат.Вставить("НоменклатураКонтрагентов", "НоменклатураКонтрагентов");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтраницыФормы()
	
	Результат = Новый Структура;
	Результат.Вставить("ВходящиеЭД", "СтраницаВходящиеЭД");
	Результат.Вставить("ИсходящиеЭД", "СтраницаИсходящиеЭД");
	Результат.Вставить("СформироватьЭД", "СтраницаСформироватьЭД");
	Результат.Вставить("ОзнакомитьсяЭД", "СтраницаОзнакомитьсяЭД");
	Результат.Вставить("ОтправитьЭД", "СтраницаОтправитьЭД");
	Результат.Вставить("КонтейнерыЭД", "СтраницаКонтейнерыЭД");
	Результат.Вставить("ОшибкиЭД", "СтраницаОшибкиЭД");
	Результат.Вставить("ПриглашенияЭД", "СтраницаПриглашенияЭД");
	Результат.Вставить("НоменклатураКонтрагентов", "СтраницаНоменклатураКонтрагентов");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТаблицыФормы()
	
	Результат = Новый Структура;
	Результат.Вставить("ВходящиеЭД", "ВходящиеЭД");
	Результат.Вставить("ИсходящиеЭД", "ИсходящиеЭД");
	Результат.Вставить("СформироватьЭД", "СформироватьЭД");
	Результат.Вставить("ОзнакомитьсяЭД", "ОзнакомитьсяЭД");
	Результат.Вставить("ОтправитьЭД", "ОтправитьЭД");
	Результат.Вставить("КонтейнерыЭД", "КонтейнерыЭД");
	Результат.Вставить("ОшибкиЭД", "ОшибкиЭД");
	Результат.Вставить("ПриглашенияЭД", "ПриглашенияЭД");
	Результат.Вставить("НоменклатураКонтрагентов", "НоменклатураКонтрагентов");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимыОтображенияФормы()
	
	Результат = Новый Структура;
	Результат.Вставить("ВсеДокументы", "ВсеДокументы");
	Результат.Вставить("МоиДокументы", "МоиДокументы");
	Результат.Вставить("КИсполнению", "КИсполнению");
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СкрытьСлужебныеКомандыТаблицы(СписокКоманд)
	
	Для Каждого ЭлементКоманды Из СписокКоманд Цикл
		Если СтрНайти(ЭлементКоманды.Имя, "ОчиститьОформлениеОтметокТаблицы") <> 0
			Или СтрНайти(ЭлементКоманды.Имя, "ВыделитьВсе") <> 0 Тогда
			ЭлементКоманды.Видимость = Ложь;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементКоманды) = Тип("ГруппаФормы")
			И ЭлементКоманды.ПодчиненныеЭлементы.Количество() Тогда
			СкрытьСлужебныеКомандыТаблицы(ЭлементКоманды.ПодчиненныеЭлементы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // РаботаСРазделами

#Область РаботаСОтборами

&НаСервереБезКонтекста
Функция ПолеДоступноДляОтбора(Знач Отбор, Знач Поле)

	Если Поле = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;

	ДоступноеПоле = Отбор.ДоступныеПоляОтбора.НайтиПоле(Поле);

	Возврат (ДоступноеПоле <> Неопределено);

КонецФункции

&НаСервереБезКонтекста
Процедура СкопироватьЭлементыОтбораРекурсивно(Отбор, Приемник, Источник)

	Для каждого ЭлементОтбора Из Источник.Элементы Цикл

		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда

			ГруппаПриемник = Приемник.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ГруппаПриемник, ЭлементОтбора);

			СкопироватьЭлементыОтбораРекурсивно(Отбор, ГруппаПриемник, ЭлементОтбора);

		Иначе

			ИмяПоля = Строка(ЭлементОтбора.ЛевоеЗначение);

			Если Не ПолеДоступноДляОтбора(Отбор, ИмяПоля) Тогда
				Продолжить;
			КонецЕсли;

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Приемник, ИмяПоля, ЭлементОтбора.ПравоеЗначение, ЭлементОтбора.ВидСравнения, ЭлементОтбора.Представление, ЭлементОтбора.Использование, ЭлементОтбора.РежимОтображения, ЭлементОтбора.ИдентификаторПользовательскойНастройки);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииНастройкиСписка(Настройки, ДопПараметры) Экспорт

	Раздел = ДопПараметры.Раздел;

	Если ТипЗнч(Настройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда

		ЗагрузитьПользовательскиеНастройкиПоРазделу(Раздел, Настройки);

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭлементОтбораВалиден(ЭлементОтбора, ПараметрыВалидацииОтборов)
	ЭлементОтбораВалиден = Истина;

	ОписаниеТипов = Новый ОписаниеТипов(ЭлементОтбора.Тип);
	ТипЗначения = ТипЗнч(ЭлементОтбора.Значение);
	Если ЭлементОтбора.Значение <> Неопределено И Не ОписаниеТипов.СодержитТип(ТипЗначения) Тогда
		ЭлементОтбораВалиден = Ложь;
		Если ПараметрыВалидацииОтборов.РегистрироватьПредупреждение Тогда
			ПараметрыПредупреждения = Новый Структура;
			ПараметрыПредупреждения.Вставить("Параметр", ЭлементОтбора.Параметр);
			ПараметрыПредупреждения.Вставить("Тип", ЭлементОтбора.Тип);
			ПараметрыПредупреждения.Вставить("ТипЗначения", ТипЗначения);
			ЗарегистрироватьПредупреждение(ПараметрыПредупреждения, ПараметрыВалидацииОтборов.ШаблонПредупреждения);
		КонецЕсли;
	КонецЕсли;

	Возврат ЭлементОтбораВалиден;
КонецФункции

&НаСервере
Процедура ЗагрузитьОтборы()
	ПараметрыВалидацииОтборов = ПараметрыВалидацииОтборов();
	Отборы = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы, "Отборы", Новый ТаблицаЗначений);
	СтруктураПоиска = Новый Структура("Параметр, Тип", Неопределено, "");
	Для Каждого ЭлементОтбора Из Отборы Цикл
		Если Не ЭлементОтбораВалиден(ЭлементОтбора, ПараметрыВалидацииОтборов) Тогда
			СохраняемыеВНастройкахДанныеМодифицированы = Истина;
			Продолжить;
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ЭлементОтбора);
		НайденныеСтроки = БыстрыеОтборы.НайтиСтроки(СтруктураПоиска);
		Для Каждого ЭлементКоллекции Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(ЭлементКоллекции, ЭлементОтбора);
		КонецЦикла;
		Если ЗначениеЗаполнено(ЭлементОтбора.Значение) Тогда
			БыстрыеОтборыУстановлены = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗарегистрироватьПредупреждение(Данные, ШаблонПредупреждения)
	ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонПредупреждения.ШаблонТекста,
		Данные);
	ОбщегоНазначенияБЭД.ЗаписатьВЖурналРегистрации(ТекстПредупреждения, ШаблонПредупреждения.Подсистема,
		УровеньЖурналаРегистрации.Предупреждение);
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКомандыСбросаОтбора(Доступность)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СброситьОтбор", "Доступность", Доступность);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьОтборы(Знач ИмяФормы, Знач Ключ, Знач Значение)

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормы, Ключ, Значение.Выгрузить());

КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицуБыстрогоОтбора()

	БыстрыеОтборы.Очистить();

	НазваниеСправочникаКонтрагенты = ИнтеграцияЭДО.ИмяПрикладногоСправочника("Контрагенты");
	Если Не ЗначениеЗаполнено(НазваниеСправочникаКонтрагенты) Тогда
		НазваниеСправочникаКонтрагенты = "Контрагенты";
	КонецЕсли;

	ИспользуетсяНесколькоОрганизацийЭД = ИнтеграцияЭДО.ИспользуетсяНесколькоОрганизаций();

	Если ИспользуетсяНесколькоОрганизацийЭД Тогда

		НазваниеСправочникаОрганизации = ИнтеграцияЭДО.ИмяПрикладногоСправочника("Организации");
		Если Не ЗначениеЗаполнено(НазваниеСправочникаОрганизации) Тогда
			НазваниеСправочникаОрганизации = "Организации";
		КонецЕсли;

		НоваяСтрока = БыстрыеОтборы.Добавить();
		НоваяСтрока.Параметр = "Организация";
		НоваяСтрока.ПредставлениеПараметра = НСтр("ru = 'Организация:'");
		НоваяСтрока.Тип = "СправочникСсылка." + НазваниеСправочникаОрганизации;
		НоваяСтрока.Значение = ИнтеграцияЭДО.ПолучитьПустуюСсылку("Организации");
		НоваяСтрока.Кнопка = "";
	КонецЕсли;

	НоваяСтрока = БыстрыеОтборы.Добавить();
	НоваяСтрока.Параметр = "Контрагент";
	НоваяСтрока.ПредставлениеПараметра = НСтр("ru = 'Контрагент:'");
	НоваяСтрока.Тип = "СправочникСсылка." + НазваниеСправочникаКонтрагенты;
	НоваяСтрока.Значение = ИнтеграцияЭДО.ПолучитьПустуюСсылку("Контрагенты");
	НоваяСтрока.Кнопка = "";

	НоваяСтрока = БыстрыеОтборы.Добавить();
	НоваяСтрока.Параметр = "Дата_С";
	НоваяСтрока.ПредставлениеПараметра = НСтр("ru = 'Дата с:'");
	НоваяСтрока.Тип = "Дата";
	НоваяСтрока.Значение = Дата(1, 1, 1);
	НоваяСтрока.Кнопка = "";

	НоваяСтрока = БыстрыеОтборы.Добавить();
	НоваяСтрока.Параметр = "Дата_По";
	НоваяСтрока.ПредставлениеПараметра = НСтр("ru = 'Дата по:'");
	НоваяСтрока.Тип = "Дата";
	НоваяСтрока.Значение = Дата(1, 1, 1);
	НоваяСтрока.Кнопка = "";

	НоваяСтрока = БыстрыеОтборы.Добавить();
	НоваяСтрока.Параметр = "Сумма_С";
	НоваяСтрока.ПредставлениеПараметра = НСтр("ru = 'Сумма с:'");
	НоваяСтрока.Тип = "Число";
	НоваяСтрока.Значение = Неопределено;
	НоваяСтрока.Кнопка = "";

	НоваяСтрока = БыстрыеОтборы.Добавить();
	НоваяСтрока.Параметр = "Сумма_По";
	НоваяСтрока.ПредставлениеПараметра = НСтр("ru = 'Сумма по:'");
	НоваяСтрока.Тип = "Число";
	НоваяСтрока.Значение = Неопределено;
	НоваяСтрока.Кнопка = "";

	НоваяСтрока = БыстрыеОтборы.Добавить();
	НоваяСтрока.Параметр = "ВидДокумента";
	НоваяСтрока.ПредставлениеПараметра = НСтр("ru = 'Вид документа:'");
	НоваяСтрока.Тип = "СправочникСсылка.ВидыДокументовЭДО";
	НоваяСтрока.Значение = Справочники.ВидыДокументовЭДО.ПустаяСсылка();
	НоваяСтрока.Кнопка = "";

	НоваяСтрока = БыстрыеОтборы.Добавить();
	НоваяСтрока.Параметр = "ДополнительнаяИнформация";
	НоваяСтрока.ПредставлениеПараметра = НСтр("ru = 'Доп. информация:'");
	НоваяСтрока.Тип = "Строка";
	НоваяСтрока.Значение = "";
	НоваяСтрока.Кнопка = "";

	Если ПолучитьФункциональнуюОпцию("ИспользоватьПрочтениеДокументовЭДО") Тогда
		
		НоваяСтрока = БыстрыеОтборы.Добавить();
		НоваяСтрока.Параметр = "Прочтен";
		НоваяСтрока.ПредставлениеПараметра = НСтр("ru = 'Прочтен:'");
		НоваяСтрока.Тип = "Булево";
		НоваяСтрока.Значение = Неопределено;
		НоваяСтрока.Кнопка = "";
		
	КонецЕсли;

	НоваяСтрока = БыстрыеОтборы.Добавить();
	НоваяСтрока.Параметр = "ПользовательскийОтбор";
	НоваяСтрока.ПредставлениеПараметра = НСтр("ru = 'Дополнительно'");
	НоваяСтрока.Тип = "Строка";
	НоваяСтрока.Значение = "";
	НоваяСтрока.Кнопка = "еще";

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьБыстрыеОтборы(Форма)

	Форма.Элементы.БыстрыеОтборы.Видимость = Форма.ПоказатьБыстрыеОтборы;
	Если Форма.ПоказатьБыстрыеОтборы Тогда
		Форма.Элементы.ДекорацияБыстрыеОтборыКартинка.Картинка = БиблиотекаКартинок.СтрелкаВверх;
	Иначе
		Форма.Элементы.ДекорацияБыстрыеОтборыКартинка.Картинка = БиблиотекаКартинок.СтрелкаВниз;
	КонецЕсли;
	
	Если Форма.БыстрыеОтборыУстановлены Тогда
		Форма.Элементы.ДекорацияБыстрыеОтборы.Шрифт = Форма.ЖирныйШрифтФормы;
	Иначе
		Форма.Элементы.ДекорацияБыстрыеОтборы.Шрифт = Форма.ОбычныйШрифтФормы;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОтборПоРазделу(Знач Раздел, Список)

	ГруппаОтборПоРазделам = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Список.Отбор.Элементы, "ОтборПоРазделам");
	Если ГруппаОтборПоРазделам = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Включаем использование группы отбора, соответствующей разделу.
	РазделНайден = Ложь;
	Для каждого ГруппаРаздела Из ГруппаОтборПоРазделам.Элементы Цикл

		Если ГруппаРаздела.Представление = "Раздел" + Раздел Тогда
			ГруппаРаздела.Использование = Истина;
			РазделНайден = Истина;
		Иначе
			ГруппаРаздела.Использование = Ложь;
		КонецЕсли;

	КонецЦикла;
	// Если не удалось найти группу раздела, то включаем все разделы.
	Если Не РазделНайден Тогда
		Для каждого ГруппаРаздела Из ГруппаОтборПоРазделам.Элементы Цикл
			ГруппаРаздела.Использование = Истина;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьБыстрыеОтборыПоРазделу(Знач Раздел, Список)

	Отбор = Список.Отбор;

	ПоляОтборов = Новый Соответствие;
	ПоляОтборов.Вставить("Организация", "Организация");
	ПоляОтборов.Вставить("Контрагент", "Контрагент");
	ПоляОтборов.Вставить("ВидДокумента", "ВидДокумента");
	ПоляОтборов.Вставить("Сумма_С", "СуммаДокумента");
	ПоляОтборов.Вставить("Сумма_По", "СуммаДокумента");
	ПоляОтборов.Вставить("Дата_С", "Дата");
	ПоляОтборов.Вставить("Дата_По", "Дата");
	ПоляОтборов.Вставить("Прочтен", "Прочтен");
	ПоляОтборов.Вставить("ДополнительнаяИнформация", "ДополнительнаяИнформация");

	ГруппаБыстрыйОтбор = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Отбор.Элементы, "БыстрыйОтбор",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);

	Режим = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ГруппаБыстрыйОтбор.РежимОтображения = Режим;

	Для каждого СтрокаОтбора Из БыстрыеОтборы Цикл

		Имя = СтрокаОтбора.Параметр;
		Значение = СтрокаОтбора.Значение;
		Поле = ПоляОтборов[Имя];

		Если Не ПолеДоступноДляОтбора(Отбор, Поле) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Значение) Тогда
			БыстрыеОтборыУстановлены = Истина;
		КонецЕсли;

		Если Имя = "Организация" Тогда

			Использование = ЗначениеЗаполнено(Значение);

			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, Поле, ВидСравненияКомпоновкиДанных.Равно, Значение, , Использование, Режим);

		ИначеЕсли Имя = "Контрагент" Тогда

			Использование = ЗначениеЗаполнено(Значение);

			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, Поле, ВидСравненияКомпоновкиДанных.Равно, Значение, , Использование, Режим);

		ИначеЕсли Имя = "ВидДокумента" Тогда

			Использование = ЗначениеЗаполнено(Значение);

			ТипДокумента = Неопределено;

			Если ТипДокумента = Неопределено Тогда
				ОбластьДобавления = ГруппаБыстрыйОтбор;
			Иначе
				ОбластьДобавления = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаБыстрыйОтбор, НСтр("ru = 'Вид документа'"), ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ);

				ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ОбластьДобавления, "ВидДокумента", ВидСравненияКомпоновкиДанных.Равно, ТипДокумента, , Использование, Режим);
			КонецЕсли;

			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ОбластьДобавления, Поле, ВидСравненияКомпоновкиДанных.Равно, Значение, , Использование, Режим);

		ИначеЕсли Имя = "ДополнительнаяИнформация" Тогда

			Использование = ЗначениеЗаполнено(Значение);

			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, "ДополнительнаяИнформация", ВидСравненияКомпоновкиДанных.Содержит, Значение, , Использование, Режим);

		ИначеЕсли Имя = "Дата_С" Тогда

			Использование = ЗначениеЗаполнено(Значение);

			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, Поле, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, НачалоДня(Значение), , Использование, Режим);

		ИначеЕсли Имя = "Дата_По" Тогда

			Использование = ЗначениеЗаполнено(Значение);

			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, Поле, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, КонецДня(Значение), , Использование, Режим);

		ИначеЕсли Имя = "Сумма_С" Тогда

			Использование = (ЗначениеЗаполнено(Значение) ИЛИ Значение = 0);

			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, Поле, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, Значение, , Использование, Режим);

		ИначеЕсли Имя = "Сумма_По" Тогда

			Использование = (ЗначениеЗаполнено(Значение) ИЛИ Значение = 0);

			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, Поле, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, Значение, , Использование, Режим);
		
		ИначеЕсли Имя = "Прочтен" Тогда

			Использование = ЗначениеЗаполнено(Значение);

			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, Поле, ВидСравненияКомпоновкиДанных.Равно, Значение, , Использование, Режим);

		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьПересечениеПользовательскихОтборовИОтбораПоРазделу(Знач Раздел,
		Список)

	ПользовательскийОтбор = ИнтерфейсДокументовЭДО.ПользовательскийОтборСписка(Список);
	ЭлементыПользовательскогоОтбора = ИнтерфейсДокументовЭДО.ЭлементыОтбора(ПользовательскийОтбор);

	ГруппаОтборПоРазделам = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Список.Отбор.Элементы, 
		"ОтборПоРазделам");
	Если ГруппаОтборПоРазделам = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементыОтбораПоРазделам = ИнтерфейсДокументовЭДО.ЭлементыОтбора(ГруппаОтборПоРазделам);

	Для Каждого ЭлементПользовательскогоОтбора Из ЭлементыПользовательскогоОтбора Цикл

		Если Не ЭлементПользовательскогоОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;

		Для каждого ЭлементОтбораПоРазделам Из ЭлементыОтбораПоРазделам Цикл

			Если ЭлементПользовательскогоОтбора.ЛевоеЗначение = ЭлементОтбораПоРазделам.ЛевоеЗначение Тогда

				ЭлементПользовательскогоОтбора.Использование = Ложь;

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьПересечениеПользовательскихОтборовИБыстрыхОтборов(Знач Раздел,
		Список)

	ПользовательскийОтбор = ИнтерфейсДокументовЭДО.ПользовательскийОтборСписка(Список);
	ЭлементыПользовательскогоОтбора = ИнтерфейсДокументовЭДО.ЭлементыОтбора(ПользовательскийОтбор);

	ГруппаБыстрыйОтбор = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Список.Отбор.Элементы, 
		"БыстрыйОтбор");
	Если ГруппаБыстрыйОтбор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементыБыстрогоОтбора = ИнтерфейсДокументовЭДО.ЭлементыОтбора(ГруппаБыстрыйОтбор);

	Для Каждого ЭлементПользовательскогоОтбора Из ЭлементыПользовательскогоОтбора Цикл

		Если Не ЭлементПользовательскогоОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;

		Для каждого ЭлементБыстрогоОтбора Из ЭлементыБыстрогоОтбора Цикл

			Если ЭлементПользовательскогоОтбора.ЛевоеЗначение = ЭлементБыстрогоОтбора.ЛевоеЗначение Тогда

				ЭлементБыстрогоОтбора.Использование = Ложь;

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьТекстКнопкиБыстрыхОтборов(Знач Раздел)

	ИмяСписка = СписокРаздела(Раздел);
	Список = ЭтотОбъект[ИмяСписка];

	ПользовательскийОтбор = ИнтерфейсДокументовЭДО.ПользовательскийОтборСписка(Список);
	ЭлементыПользовательскогоОтбора = ИнтерфейсДокументовЭДО.ЭлементыОтбора(ПользовательскийОтбор);

	// Определяем текст основной кнопки открытия настроек.
	КоличествоЭлементов = 0;
	Для Каждого ЭлементПользовательскогоОтбора Из ЭлементыПользовательскогоОтбора Цикл
		Если ЭлементПользовательскогоОтбора.Использование Тогда
			КоличествоЭлементов = КоличествоЭлементов + 1;
		КонецЕсли;
	КонецЦикла;

	ТекстКнопкиПользовательскогоОтбора = НСтр("ru = 'еще'");
	Если ЗначениеЗаполнено(КоличествоЭлементов) Тогда
		ТекстКнопкиПользовательскогоОтбора = НСтр("ru = 'и еще'") + " " + Строка(КоличествоЭлементов);
		БыстрыеОтборыУстановлены = Истина;
	КонецЕсли;

	// Устанавливаем текст кнопок быстрого поиска (при пересечении с пользовательскими отборами).
	ПараметрыОтборовПолей = Новый Соответствие;
	ПараметрыОтборовПолей.Вставить("Организация", "Организация");
	ПараметрыОтборовПолей.Вставить("Контрагент", "Контрагент");
	ПараметрыОтборовПолей.Вставить("ВидДокумента", "ВидДокумента");
	ПараметрыОтборовПолей.Вставить("СуммаДокумента", "Сумма_С,Сумма_По");
	ПараметрыОтборовПолей.Вставить("Дата", "Дата_С,Дата_По");
	ПараметрыОтборовПолей.Вставить("Прочтен", "Прочтен");
	ПараметрыОтборовПолей.Вставить("ДополнительнаяИнформация", "ДополнительнаяИнформация");
	ПараметрыОтборовПолей.Вставить("ПричинаОтклонения", "ДополнительнаяИнформация");

	Для каждого СтрокаОтбора Из БыстрыеОтборы Цикл

		Если СтрокаОтбора.Параметр = "ПользовательскийОтбор" Тогда
			Если СтрокаОтбора.Кнопка <> ТекстКнопкиПользовательскогоОтбора Тогда
				СтрокаОтбора.Кнопка = ТекстКнопкиПользовательскогоОтбора;
			КонецЕсли;
			Продолжить;
		КонецЕсли;

		ТекстКнопки = "";
		УстановленПользовательскийОтбор = Ложь;

		Для каждого ЭлементПользовательскогоОтбора Из ЭлементыПользовательскогоОтбора Цикл

			Если Не ЭлементПользовательскогоОтбора.Использование Тогда
				Продолжить;
			КонецЕсли;

			ИмяПоля = Строка(ЭлементПользовательскогоОтбора.ЛевоеЗначение);
			ПараметрыОтбора = ПараметрыОтборовПолей[ИмяПоля];

			Если Не ЗначениеЗаполнено(ПараметрыОтбора) Тогда
				Продолжить;
			КонецЕсли;

			Если СтрНайти(ПараметрыОтбора, СтрокаОтбора.Параметр) <> 0 Тогда

				Если ЭлементПользовательскогоОтбора.Родитель = Неопределено И Не УстановленПользовательскийОтбор Тогда

					ТекстКнопки = СтрокаОтбора.ПредставлениеПараметра + " "
						+ Строка(ЭлементПользовательскогоОтбора.ВидСравнения) + " "
						+ Строка(ЭлементПользовательскогоОтбора.ПравоеЗначение);

				Иначе

					ТекстКнопки = СтрокаОтбора.ПредставлениеПараметра + " "
						+ НСтр("ru = '(сложный фильтр)'");

				КонецЕсли;

				УстановленПользовательскийОтбор = Истина;

			КонецЕсли;

		КонецЦикла;

		Если СтрокаОтбора.Кнопка <> ТекстКнопки Тогда

			СтрокаОтбора.Кнопка = ТекстКнопки;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьСбросаОтбора(Знач Раздел)

	ЕстьОтборы = Ложь;
	Для Каждого Строка Из БыстрыеОтборы Цикл
		Если ЗначениеЗаполнено(Строка.Значение)
				ИЛИ ТипЗнч(Строка.Значение) = Тип("Число") Тогда
			ЕстьОтборы = Истина;
			Прервать;
		КонецЕсли
	КонецЦикла;

	Если Не ЕстьОтборы Тогда

		ИмяСписка = СписокРаздела(Раздел);
		Список = ЭтотОбъект[ИмяСписка];
		Отбор = ИнтерфейсДокументовЭДО.ПользовательскийОтборСписка(Список);
		ВсеЭлементыОтбора = ИнтерфейсДокументовЭДО.ЭлементыОтбора(Отбор);
		Для каждого ЭлементОтбора Из ВсеЭлементыОтбора Цикл
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборы = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СброситьОтбор", "Доступность", ЕстьОтборы);

КонецПроцедуры

&НаСервере
Процедура СинхронизироватьПользовательскиеОтборы(Знач ИмяСпискаИсточника)

	ТекущийСписок = ИмяСпискаИсточника;
	СписокИсточник = ЭтотОбъект[ТекущийСписок];
	ОтборИсточник = ИнтерфейсДокументовЭДО.ПользовательскийОтборСписка(СписокИсточник);

	ВсеСписки = Новый Массив;
	ВсеСписки.Добавить("ВходящиеЭД");
	ВсеСписки.Добавить("ИсходящиеЭД");

	Если ВсеСписки.Найти(ТекущийСписок) = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для каждого ИмяСписка Из ВсеСписки Цикл

		Если ИмяСписка = ТекущийСписок Тогда
			Продолжить;
		КонецЕсли;

		СписокПриемник = ЭтотОбъект[ИмяСписка];
		ОтборПриемник = ИнтерфейсДокументовЭДО.ПользовательскийОтборСписка(СписокПриемник);
		ОтборПриемник.Элементы.Очистить();

		СкопироватьЭлементыОтбораРекурсивно(ОтборПриемник, ОтборПриемник, ОтборИсточник);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЕстьПользовательскийОтборПоРазделу(Знач Раздел)

	ИмяСписка = СписокРаздела(Раздел);
	Список = ЭтотОбъект[ИмяСписка];

	Отбор = ИнтерфейсДокументовЭДО.ПользовательскийОтборСписка(Список);
	ЕстьПользовательскийОтбор = (Отбор.Элементы.Количество() > 0);

	ЕстьБыстрыйОтбор = Ложь;
	Для Каждого СтрокаОтбора Из БыстрыеОтборы Цикл

		Если ЗначениеЗаполнено(СтрокаОтбора.Значение)
			Или (СтрокаОтбора.Тип = "Число" И СтрокаОтбора.Значение <> Неопределено) Тогда

			ЕстьБыстрыйОтбор = Истина;
			Прервать;

		КонецЕсли;

	КонецЦикла;

	Возврат ЕстьПользовательскийОтбор Или ЕстьБыстрыйОтбор;

КонецФункции

&НаСервере
Процедура СброситьПользовательскиеОтборы()

	СпискиРазделов = Новый Массив;
	СпискиРазделов.Добавить(ВходящиеЭД);
	СпискиРазделов.Добавить(ИсходящиеЭД);
	СпискиРазделов.Добавить(Сформировать);
	СпискиРазделов.Добавить(КонтейнерыЭД);
	СпискиРазделов.Добавить(ОтправитьЭД);
	СпискиРазделов.Добавить(ПриглашенияЭД);

	Для каждого Список Из СпискиРазделов Цикл

		Отбор = ИнтерфейсДокументовЭДО.ПользовательскийОтборСписка(Список);
		Отбор.Элементы.Очистить();

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОтбора()

	ПриИзмененииОтбораНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОтбораНаСервере()

	ОбновитьКэшРасчетовОтбор = Истина;
	ПрименитьОтборыКРазделу(ТекущийРаздел);
	ОбновитьНавигациюПоРазделамНаСервере();

КонецПроцедуры

&НаСервере
Процедура СброситьОтборНаСервере()

	БыстрыеОтборыУстановлены = Ложь;
	
	НазваниеСправочникаКонтрагенты = ИмяПрикладногоСправочника("Контрагенты");
	Если Не ЗначениеЗаполнено(НазваниеСправочникаКонтрагенты) Тогда
		НазваниеСправочникаКонтрагенты = "Контрагенты";
	КонецЕсли;

	НазваниеСправочникаОрганизации = ИмяПрикладногоСправочника("Организации");
	Если Не ЗначениеЗаполнено(НазваниеСправочникаОрганизации) Тогда
		НазваниеСправочникаОрганизации = "Организации";
	КонецЕсли;

	Для Каждого Строка Из БыстрыеОтборы Цикл
		Если Строка.Тип = "Строка" Тогда
			Строка.Значение = "";
		ИначеЕсли Строка.Тип = "Дата" Тогда
			Строка.Значение = Дата(1, 1, 1);
		ИначеЕсли Строка.Тип = "Число" Тогда
			Строка.Значение = Неопределено;
		ИначеЕсли Строка.Тип = "Булево" Тогда
			Строка.Значение = Неопределено;
		ИначеЕсли Строка.Тип = "СправочникСсылка.ВидыДокументовЭДО" Тогда
			Строка.Значение = ПредопределенноеЗначение("Справочник.ВидыДокументовЭДО.ПустаяСсылка");
		ИначеЕсли Строка.Тип = "СправочникСсылка."
				+ НазваниеСправочникаКонтрагенты Тогда
			Строка.Значение = ПредопределенноеЗначение("Справочник."
				+ НазваниеСправочникаКонтрагенты + ".ПустаяСсылка");
		ИначеЕсли Строка.Тип = "СправочникСсылка."
				+ НазваниеСправочникаОрганизации Тогда
			Строка.Значение = ПредопределенноеЗначение("Справочник."
				+ НазваниеСправочникаОрганизации + ".ПустаяСсылка");
		ИначеЕсли Строка.Тип = "СправочникСсылка.Пользователи" Тогда
			Строка.Значение = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		ИначеЕсли Строка.Тип = "ПеречислениеСсылка.НаправленияЭДО" Тогда
			Строка.Значение = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.ПустаяСсылка");
		КонецЕсли;
	КонецЦикла;

	СброситьПользовательскиеОтборы();
	ПриИзмененииОтбораНаСервере();

	УстановитьДоступностьКомандыСбросаОтбора(Ложь);

	СохраняемыеВНастройкахДанныеМодифицированы = Истина;

КонецПроцедуры

&НаСервере
Функция ЕстьФиксированныйОтборПоРазделу(Знач ИмяРаздела)

	ИмяСписка = СписокРаздела(ИмяРаздела);
	Список = ЭтотОбъект[ИмяСписка];

	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Список.Отбор.Элементы, "ОтборУчетныхДокументов");
	Если ГруппаОтбора <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Список.Отбор.Элементы, "ОтборЭлектронныхДокументов");
	Если ГруппаОтбора <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

&НаСервере
Процедура УстановитьОтборУчетныхДокументов(Знач Отбор)

	Если ТипЗнч(Отбор) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Список = Сформировать;
	ИмяГруппыОтбора = "ОтборУчетныхДокументов";

	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Список.Отбор.Элементы, ИмяГруппыОтбора);
	Если ГруппаОтбора = Неопределено Тогда
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, ИмяГруппыОтбора, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	КонецЕсли;

	ГруппаОтбора.Элементы.Очистить();

	Для каждого ЭлементОтбора Из Отбор Цикл

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, ЭлементОтбора.Поле,
			ЭлементОтбора.ВидСравнения, ЭлементОтбора.Значение, , Истина);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборВходящихДокументов(Знач Отбор)

	Если ТипЗнч(Отбор) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Список = ВходящиеЭД;
	ИмяГруппыОтбора = "ОтборЭлектронныхДокументов";

	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Список.Отбор.Элементы, ИмяГруппыОтбора);
	Если ГруппаОтбора = Неопределено Тогда
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, ИмяГруппыОтбора, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	КонецЕсли;

	ГруппаОтбора.Элементы.Очистить();

	Для каждого ЭлементОтбора Из Отбор Цикл

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, 
			ЭлементОтбора.Поле, ЭлементОтбора.ВидСравнения, ЭлементОтбора.Значение, , Истина);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборИсходящихДокументов(Знач Отбор)

	Если ТипЗнч(Отбор) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Список = ИсходящиеЭД;
	ИмяГруппыОтбора = "ОтборЭлектронныхДокументов";

	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Список.Отбор.Элементы, ИмяГруппыОтбора);
	Если ГруппаОтбора = Неопределено Тогда
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, ИмяГруппыОтбора, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	КонецЕсли;

	ГруппаОтбора.Элементы.Очистить();

	Для каждого ЭлементОтбора Из Отбор Цикл

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
			ЭлементОтбора.Поле, ЭлементОтбора.ВидСравнения, ЭлементОтбора.Значение, , Истина);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти // РаботаСОтборами

#Область РаботаСПриглашениями

&НаКлиентеНаСервереБезКонтекста
Функция ОтветНаПриглашение_Принять()
	Возврат "Принять";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОтветНаПриглашение_Отклонить()
	Возврат "Отклонить";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОтветНаПриглашение_Отозвать()
	Возврат "Отозвать";
КонецФункции

#КонецОбласти // РаботаСПриглашениями

#Область СопоставлениеНоменклатуры

&НаКлиенте
Процедура ПоказатьСопоставлениеНоменклатуры()

	НоменклатураДляСопоставления = Новый Массив;
	НастройкиСопоставления = СопоставлениеНоменклатурыКонтрагентовКлиент.НовыеНастройкиСопоставленияНоменклатуры();

	Если ТекущийРаздел = РазделыФормы().НоменклатураКонтрагентов Тогда

		Владельцы = Новый Массив;
		Для Каждого СтрокаСписка Из Элементы.НоменклатураКонтрагентов.ПолучитьСтрокиДляОбработки() Цикл
			ДанныеСтроки = Элементы.НоменклатураКонтрагентов.ДанныеСтроки(СтрокаСписка);
			Владельцы.Добавить(ДанныеСтроки.Контрагент);
		КонецЦикла;
		НоменклатураДляСопоставления = НоменклатураПоВладельцам(Владельцы);

	Иначе

		ЭлектронныеДокументы = Новый Массив;
		Для Каждого СтрокаСписка Из Элементы.ВходящиеЭД.ПолучитьСтрокиДляОбработки() Цикл
			ДанныеСтроки = Элементы.ВходящиеЭД.ДанныеСтроки(СтрокаСписка);
			ЭлектронныеДокументы.Добавить(ДанныеСтроки.ЭлектронныйДокумент);
		КонецЦикла;
		НоменклатураИКонтекст = ИнтерфейсДокументовЭДОВызовСервера.НоменклатураИКонтекстСопоставленияПоЭД(
			ЭлектронныеДокументы);
		НоменклатураДляСопоставления = НоменклатураИКонтекст.НоменклатураДляСопоставления;
		НастройкиСопоставления.Организация = НоменклатураИКонтекст.Организация;
		НастройкиСопоставления.ДоговорКонтрагента = НоменклатураИКонтекст.ДоговорКонтрагента;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(НоменклатураДляСопоставления) Тогда
		ТекстСообщения = НСтр("ru = 'Сопоставление номенклатуры не требуется.'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура("НоменклатураДляСопоставления", НоменклатураДляСопоставления);
	ОбработкаЗавершения = Новый ОписаниеОповещения("ОбработатьСопоставлениеНоменклатуры", ЭтотОбъект, ДополнительныеПараметры);
	
	СопоставлениеНоменклатурыКонтрагентовКлиент.ОткрытьСопоставлениеНоменклатуры(НоменклатураДляСопоставления,
		НастройкиСопоставления,
		ОбработкаЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСопоставлениеНоменклатуры(Результат, ДополнительныеПараметры) Экспорт

	ОбновитьНавигациюПоРазделам();
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.2, Истина);

КонецПроцедуры

&НаСервереБезКонтекста
Функция НоменклатураПоВладельцам(Знач Владельцы)
	
	Отбор = ИнтеграцияЭДО.ОтборНоменклатурыКонтрагентовНаКонтроле(, Владельцы);
	Возврат ИнтеграцияЭДО.НоменклатураКонтрагентовНаКонтроле(Отбор);
	
КонецФункции

#КонецОбласти

#Область ОтражениеВУчете

&НаКлиенте
Процедура ПоказатьРасширенныйПодборДокументовУчета()

	ТекущийСписок = ПолучитьТекущийСписок();
	Если ТекущийСписок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ТекущийСписок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭлектронныйДокумент", ТекущиеДанные.ЭлектронныйДокумент);
	ПараметрыФормы.Вставить("ВидДокумента", ТекущиеДанные.ВидДокумента);
	
	ДокументРаспознан = РаспознатьДокумент(ТекущиеДанные.ЭлектронныйДокумент);
	ПараметрыФормы.Вставить("ДокументРаспознан", ДокументРаспознан);
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьПодборОбъектовУчетаЭлектронногоДокумента(ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РаспознатьДокумент(ЭлектронныйДокумент)
	
	ДокументРаспознан = Ложь;
	
	СообщениеОтправителя = ЭлектронныеДокументыЭДО.СообщениеОтправителя(ЭлектронныйДокумент);
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("СпособОбмена", "СпособОбмена");
	СтруктураРеквизитов.Вставить("ТипДокумента", "ВидДокумента.ТипДокумента");
	СвойстваДокумента = ЭлектронныеДокументыЭДО.СвойстваДокумента(ЭлектронныйДокумент, СтруктураРеквизитов);
	СпособОбмена = СвойстваДокумента.СпособОбмена;
	ТипДокумента = СвойстваДокумента.ТипДокумента;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС")
		И СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезСерверЕИС Тогда
		МодульЭлектронноеАктированиеЕИС = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеАктированиеЕИС");
		РезультатРаспознавания =
			МодульЭлектронноеАктированиеЕИС.РаспознатьСообщение(СообщениеОтправителя);
		ДокументРаспознан = ЗначениеЗаполнено(РезультатРаспознавания);
	КонецЕсли;
	
	Если Не ДокументРаспознан 
		И ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСГИСЭПД") Тогда
		МодульОбменСГИСЭПД = ОбщегоНазначения.ОбщийМодуль("ОбменСГИСЭПД");
		РезультатРаспознавания = МодульОбменСГИСЭПД.ПриРаспознаванииДокумента(ТипДокумента, ДокументРаспознан); 
	КонецЕсли;
	
	Если Не ДокументРаспознан Тогда
		ДокументРаспознан = ЗначениеЗаполнено(ЭлектронныеДокументыЭДО.РаспознатьСообщение(СообщениеОтправителя));
	КонецЕсли;
	
	Возврат ДокументРаспознан;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьУчетныйДокумент(Знач ИмяТаблицы = "ВходящиеЭД")

	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НаборУчетныхДокументов = ОбъектыУчетаЭлектронногоДокумента(ТекущиеДанные.ЭлектронныйДокумент);

	Если Не ЗначениеЗаполнено(НаборУчетныхДокументов) Тогда
		ОткрытьЭлектронныйДокументДляПросмотра(ТекущиеДанные);
		Возврат;
	КонецЕсли;

	Если НаборУчетныхДокументов.Количество() = 1 Тогда

		ПоказатьЗначение(, НаборУчетныхДокументов[0]);

	Иначе

		СписокУчетныхДокументов = Новый СписокЗначений;
		СписокУчетныхДокументов.ЗагрузитьЗначения(НаборУчетныхДокументов);
		Обработка = Новый ОписаниеОповещения("ОбработатьВыборУчетногоДокументаДляПоказа", ЭтотОбъект);
		СписокУчетныхДокументов.ПоказатьВыборЭлемента(Обработка);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборУчетногоДокументаДляПоказа(Знач ВыбранныйЭлемент, Знач ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(, ВыбранныйЭлемент.Значение);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбъектыУчетаЭлектронногоДокумента(Знач ЭлектронныйДокумент)

	Запрос = Новый Запрос;
	Запрос.Текст = ИнтеграцияЭДО.ТекстЗапросаОбъектовУчетаЭлектронныхДокументов();
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);

	УстановитьПривилегированныйРежим(Истина);
	Основания = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектУчета");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Основания;

КонецФункции

&НаСервереБезКонтекста
Функция УчетныеДокументыНаКонтролеПроведенияЭД(Знач ЭлектронныеДокументы)

	ОбъектыУчета = ИнтеграцияЭДО.ОбъектыУчетаНаКонтролеПроведения(ЭлектронныеДокументы);

	Возврат ОбъектыУчета;

КонецФункции

&НаКлиенте
Процедура ПоказатьВопросОПроведенииУчетныхДокументов(Знач НаборУчетныхДокументов)

	ШаблонВопроса = НСтр("ru = 'Провести учетные документы (%1)?'");
	ТекстВопроса = СтрШаблон(ШаблонВопроса, НаборУчетныхДокументов.Количество());

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НаборУчетныхДокументов", НаборУчетныхДокументов);

	ОбработкаОтвета = Новый ОписаниеОповещения("ОбработатьВопросОПроведенииУчетныхДокументов",
		ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОбработкаОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросОПроведенииУчетныхДокументов(Знач Ответ,
		Знач ДополнительныеПараметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	НаборУчетныхДокументов = ДополнительныеПараметры.НаборУчетныхДокументов;

	НепроведенныеДокументы = ПровестиДокументы(НаборУчетныхДокументов);
	ОбновитьНавигациюПоРазделам();

	ВсегоДокументов = НаборУчетныхДокументов.Количество();
	ПроведеноДокументов = ВсегоДокументов - НепроведенныеДокументы.Количество();

	ТекстОповещения = НСтр("ru = 'Проведение учетных документов'");
	ШаблонПояснения = НСтр("ru = 'Проведено %1 из %2.'");
	ТекстПояснения = СтрШаблон(ШаблонПояснения, ПроведеноДокументов, ВсегоДокументов);
	ПоказатьОповещениеПользователя(ТекстОповещения, , ТекстПояснения);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанныеВЗависимостиОтОтраженияВУчете(КонтрольОтраженияВУчете)
	
	Если КонтрольОтраженияВУчете = 0 Тогда
		ПоказатьСопоставлениеНоменклатуры();
	ИначеЕсли КонтрольОтраженияВУчете = 1 Тогда
		ПоказатьРасширенныйПодборДокументовУчета();
	Иначе
		ПоказатьУчетныйДокумент();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПровестиДокументы(Знач НаборДокументов)

	НепроведенныеДокументы = ОбщегоНазначения.ПровестиДокументы(НаборДокументов);

	Для Каждого Описание Из НепроведенныеДокументы Цикл

		ШаблонСообщения = НСтр("ru = 'Не удалось провести %1 по причине:'")
			+ Символы.ПС + Описание.ОписаниеОшибки;
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Описание.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

	КонецЦикла;

	Возврат НепроведенныеДокументы;

КонецФункции

#КонецОбласти // ОтражениеВУчете

#Область Прочее

&НаКлиенте
Процедура ОбновитьТекущиеДелаПоЭДО(Параметр)
	
	ОбновитьНавигациюПоРазделам();
	ОбновитьОтображениеДанных();
	РазблокироватьЗаблокированныеЭлементыФормы();
	
	ТекущийЭДСпискаСовпадаетСПараметромОповещения = Ложь;
	Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("ЭлектронныеДокументы") Тогда
		ТекущийЭДСпискаСовпадаетСПараметромОповещения = 
			Параметр.ЭлектронныеДокументы.Найти(ТекущийЭлектронныйДокумент) <> Неопределено;
	КонецЕсли;
	Если Параметр = Неопределено Или ТекущийЭДСпискаСовпадаетСПараметромОповещения Тогда
		ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииУтвержденияВходящихДокументов()

	ОтправлятьВходящиеДокументыНаУтверждение = НастройкиЭДО.ОтправлятьВходящиеДокументыНаУтверждение();
	Если Не ОтправлятьВходящиеДокументыНаУтверждение Тогда
		Элементы.ВходящиеЭДУтвердитьПодписатьИОтправить.Заголовок = НСтр("ru = 'Подписать и отправить'");
	КонецЕсли;
	ИнициализироватьДерево();
	ОбновитьВидимостьРазделовДерева(ДеревоДействий, РежимОтображения);
	НастроитьСпискиРазделов();
	ПоказатьРаздел(РазделыФормы().Входящие);

	ОбновитьНавигациюПоРазделамНаСервере(Истина, Ложь);

КонецПроцедуры

&НаКлиенте
Функция ДанныеВыделенныхСтрокРаздела(Знач Раздел, Знач ПутьКДанным,
		ПолучатьКлючСтроки = Ложь)

	МассивДанных = Новый Массив;
	ИспользоватьМассивРеквизитов = Ложь;

	ИмяТаблицы = ТаблицаРаздела(Раздел);
	Таблица = Элементы[ИмяТаблицы];

	Реквизиты = СтрЗаменить(ПутьКДанным, " ", "");
	МассивРеквизитов = СтрРазделить(Реквизиты, ",", Ложь);

	Если МассивРеквизитов.Количество() > 1 Или ПолучатьКлючСтроки Тогда
		ИспользоватьМассивРеквизитов = Истина;
	КонецЕсли;

	Для Каждого СтрокаТаблицы Из Таблица.ПолучитьСтрокиДляОбработки() Цикл

		Данные = Таблица.ДанныеСтроки(СтрокаТаблицы);
		Если Данные = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если ИспользоватьМассивРеквизитов Тогда

			Результат = Новый Структура;

			Для Каждого Реквизит Из МассивРеквизитов Цикл
				Результат.Вставить(Реквизит, Данные[Реквизит]);
			КонецЦикла;
			Результат.Вставить("КлючСтроки", СтрокаТаблицы);
			МассивДанных.Добавить(Результат);

		Иначе
			МассивДанных.Добавить(Данные[ПутьКДанным]);
		КонецЕсли;

	КонецЦикла;

	Возврат МассивДанных;

КонецФункции

&НаКлиенте
Функция ОбъектыДействий(СтрокиРаздела)

	Результат = ИнтерфейсДокументовЭДОКлиентСервер.НовыеОбъектыДействийПоЭДО();
	
	Для Каждого СтрокаРаздела Из СтрокиРаздела Цикл
		
		ИдентификаторПакета = СтрокаРаздела.ИдентификаторПакета;
		
		Если ЗначениеЗаполнено(ИдентификаторПакета) И ПакетноеОтображение
			И Результат.ПакетыДокументов.Найти(ИдентификаторПакета) = Неопределено Тогда
			
			Результат.ПакетыДокументов.Добавить(ИдентификаторПакета);
		
		Иначе
			Результат.ЭлектронныеДокументы.Добавить(СтрокаРаздела.ЭлектронныйДокумент);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьДинамическиеСписки(ПеречитыватьДанные = Истина)

	ИмяСписка = СтрЗаменить(Элементы.ПанельСписков.ТекущаяСтраница.Имя, "Страница", "");

	Если ПеречитыватьДанные Тогда
		Элементы[ИмяСписка].Обновить();
	Иначе
		Элементы[ИмяСписка].ТекущаяСтрока = Элементы[ИмяСписка].ТекущаяСтрока;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеЭлементовПоНастройкамПользователя()
	
	УстановитьВариантОтображенияДокументовСписка("ИсходящиеЭД");
	УстановитьВариантОтображенияДокументовСписка("ВходящиеЭД");
	УстановитьВариантОтображенияДокументовСписка("ОшибкиЭД");
	УстановитьВариантОтображенияДокументовСписка("ОтправитьЭД");
	УстановитьВариантОтображенияДокументовСписка("ОзнакомитьсяЭД");
	
	Элементы.ГруппаЛегенда.Видимость = ПоказыватьОбластьЛегенды;
	Элементы.ГруппаОбластьПросмотра.Видимость = ПоказыватьОбластьПросмотра;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВариантОтображенияДокументовСписка(ИмяСписка)
	
	ПоляОграничения = Новый Массив;
	
	СлужебныеПоляПорядка = Новый Массив;
	СлужебныеПоляПорядка.Добавить("КлючСортировкиПакета");
	СлужебныеПоляПорядка.Добавить("ДатаПакета");
	СлужебныеПоляПорядка.Добавить("ПорядокСортировкиВПакете");
	СлужебныеПоляПорядка.Добавить("НомерСлужебный");
	СлужебныеПоляПорядка.Добавить("ДатаПолучения");
	
	Для Каждого ПолеПорядка Из ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.ДоступныеПоляПорядка.Элементы Цикл
		ИмяПоля = Строка(ПолеПорядка.Поле);
		Если СлужебныеПоляПорядка.Найти(ИмяПоля) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		ПоляОграничения.Добавить(ИмяПоля);
	КонецЦикла;
	
	Если ПоляОграничения.Количество() > 0 Тогда
		ЭтотОбъект[ИмяСписка].УстановитьОграниченияИспользованияВПорядке(ПоляОграничения);
	КонецЕсли;
	
	Если Не ПакетноеОтображение Тогда
		Элементы[ИмяСписка].Обновить();
		Возврат;
	КонецЕсли;

	БазовыеНастройкиКомпоновки = Новый КомпоновщикНастроекКомпоновкиДанных;
	БазовыеНастройкиКомпоновки.ЗагрузитьНастройки(ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки);
	БазовыеНастройкиКомпоновки.Настройки.Порядок.Элементы.Очистить();
	
	ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(
		БазовыеНастройкиКомпоновки.ПользовательскиеНастройки);
	ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.Элементы.Очистить();
	ЭлементПорядка = ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(
		Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ДатаПакета");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование = Истина;
	
	ЭлементПорядка = ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(
		Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("КлючСортировкиПакета");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование = Истина;
	
	ЭлементПорядка = ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(
		Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ПорядокСортировкиВПакете");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование = Истина;
	
	ЭлементПорядка = ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(
		Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("НомерСлужебный");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование = Истина;
	
	Элементы[ИмяСписка].Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьРазделовДерева(Дерево, РежимОтображения)

	РазделыСПеременнойВидимостью = Новый Структура;
	Разделы = РазделыФормы();
	РежимыОтображенияФорм = РежимыОтображенияФормы();

	Скрыть = РежимОтображения = РежимыОтображенияФорм.КИсполнению;
	РазделыСПеременнойВидимостью.Вставить(Разделы.НаКонтроле, Скрыть);
	РазделыСПеременнойВидимостью.Вставить(Разделы.НаКонтролеИсх, Скрыть);

	Скрыть = РежимОтображения = РежимыОтображенияФорм.МоиДокументы;
	РазделыСПеременнойВидимостью.Вставить(Разделы.Сформировать, Скрыть);
	РазделыСПеременнойВидимостью.Вставить(Разделы.Приглашения, Скрыть);
	РазделыСПеременнойВидимостью.Вставить(Разделы.ТребуетсяПригласить, Скрыть);
	РазделыСПеременнойВидимостью.Вставить(Разделы.ТребуетсяСогласие, Скрыть);
	РазделыСПеременнойВидимостью.Вставить(Разделы.ПриглашенияОзнакомиться, Скрыть);

	Скрыть = РежимОтображения <> РежимыОтображенияФорм.ВсеДокументы;
	РазделыСПеременнойВидимостью.Вставить(Разделы.Отправить, Скрыть);
	РазделыСПеременнойВидимостью.Вставить(Разделы.Распаковать, Скрыть);
	РазделыСПеременнойВидимостью.Вставить(Разделы.ЖдемСогласия, Скрыть);

	Скрыть = Не ИспользоватьЭП;
	РазделыСПеременнойВидимостью.Вставить(Разделы.Подписать, Скрыть);

	Скрыть = Не НастройкиЭДО.ОзнакомлениеСЭлектроннымиДокументами();
	РазделыСПеременнойВидимостью.Вставить(Разделы.Ознакомиться, Скрыть);

	Для Каждого Раздел Из РазделыСПеременнойВидимостью Цикл
		УстановитьЗначениеРеквизитаДерева(Дерево, Раздел.Ключ, "Скрыть", Раздел.Значение);
	КонецЦикла;

	Для каждого Раздел Из ОписаниеРазделов Цикл

		Скрыть = Ложь;
		Если РазделыСПеременнойВидимостью.Свойство(Раздел.Имя, Скрыть) Тогда
			Раздел.Видимость = Не Скрыть;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеРеквизитаДерева(Дерево, ИмяДействия, ИмяРеквизита,
		Значение, Установлено = Ложь)

	Для Каждого ПодчиненнаяСтрока Из Дерево.ПолучитьЭлементы() Цикл
		Если ПодчиненнаяСтрока.Значение = ИмяДействия Тогда
			ПодчиненнаяСтрока[ИмяРеквизита] = Значение;
			Установлено = Ложь;
		Иначе
			УстановитьЗначениеРеквизитаДерева(ПодчиненнаяСтрока, ИмяДействия, ИмяРеквизита, Значение, Установлено);
		КонецЕсли;

		Если Установлено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяПрикладногоСправочника(Название)

	Возврат ИнтеграцияЭДО.ИмяПрикладногоСправочника(Название);

КонецФункции

&НаКлиенте
Процедура РазблокироватьЗаблокированныеЭлементыФормы()

	Для Каждого ЗаблокированныйЭлементыФормы Из ЗаблокированныеЭлементыФормы Цикл

		Элементы[ЗаблокированныйЭлементыФормы.Значение].Доступность = Истина;

	КонецЦикла;

	ЗаблокированныеЭлементыФормы.Очистить();

КонецПроцедуры

&НаКлиенте
Функция ЭлектронныеДокументыНаОзнакомление(Знач ИдентификаторыСтрок)

	ЭлектронныеДокументы = Новый Массив;

	Для каждого Идентификатор Из ИдентификаторыСтрок Цикл

		Строка = Элементы.ОзнакомитьсяЭД.ДанныеСтроки(Идентификатор);
		ЭлектронныеДокументы.Добавить(Строка.ЭлектронныйДокумент);

	КонецЦикла;

	Возврат ЭлектронныеДокументы;

КонецФункции

&НаСервере
Процедура УстановитьСвойстваПереопределяемыхЭлементовФормы()

	МетаданныеСопоставления = СопоставлениеНоменклатурыКонтрагентовСлужебный.МетаданныеСопоставленияНоменклатуры();
	
	Элементы.НоменклатураКонтрагентовКонтрагент.Заголовок =
		МетаданныеСопоставления.ВладелецНоменклатурыПредставлениеОбъекта;
	Элементы.НоменклатураКонтрагентовОткрытьНоменклатуруКонтрагентов.Заголовок =
		МетаданныеСопоставления.НоменклатураКонтрагентаПредставлениеСписка;

КонецПроцедуры

&НаСервере
Процедура УстановитьРежимОтображения(Знач НовыйРежимОтображения)

	РежимыОтображения = РежимыОтображенияФормы();
	
	ДопустимыеРежимы = Новый Массив;
	ДопустимыеРежимы.Добавить(РежимыОтображения.ВсеДокументы);
	ДопустимыеРежимы.Добавить(РежимыОтображения.МоиДокументы);
	ДопустимыеРежимы.Добавить(РежимыОтображения.КИсполнению);

	Если ДопустимыеРежимы.Найти(НовыйРежимОтображения) = Неопределено Тогда

		ШаблонИсключения = НСтр("ru = 'Недопустимый режим отображения текущих дел ЭДО: {%1}'");
		ВызватьИсключение СтрШаблон(ШаблонИсключения, НовыйРежимОтображения);

	Иначе
		РежимОтображения = НовыйРежимОтображения;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВывестиВерсиюБЭД()
	
	ШаблонТекстВерсии = НСтр("ru = 'Версия модуля ЭДО: %1'");
	ТекстВерсии = СтрШаблон(ШаблонТекстВерсии, ОбновлениеИнформационнойБазыБЭД.ВерсияБиблиотеки());
	Элементы.НадписьВерсияБЭД.Заголовок = ТекстВерсии;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыбранныеДанные()
	
	МассивВыбранныхСтрок = Новый Массив;
	МассивВыбранныхПакетов = Новый Массив;
	
	ВыбранныеДанные = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, "КлючДокумента, КлючПакета");
	
	Для Каждого Данные Из ВыбранныеДанные Цикл
		
		МассивВыбранныхСтрок.Добавить(Данные.КлючДокумента);
		
		Если ЗначениеЗаполнено(Данные.КлючПакета) И ПакетноеОтображение Тогда
			МассивВыбранныхПакетов.Добавить(Данные.КлючПакета);
		КонецЕсли;
		
	КонецЦикла;
	
	КлючиВыбранныхДокументов = СтрСоединить(МассивВыбранныхСтрок, ",");
	КлючиВыбранныхПакетов = СтрСоединить(МассивВыбранныхПакетов, ",");
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьУзлыДереваОтложенно()
	
	ОбщегоНазначенияБЭДКлиент.РазвернутьУзлыДерева(ЭтотОбъект, "ДеревоДействий");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыВалидацииОтборов()
	Подсистема = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами;
	ШаблонТекста = НСтр(
		"ru = 'В форме текущих дел ЭДО не установлен отбор ""[Параметр]"".
		|Тип значения параметра ""[ТипЗначения]"" не соответствует типу отбора ""[Тип]""'");
	ШаблонПредупреждения = Новый Структура;
	ШаблонПредупреждения.Вставить("ШаблонТекста", ШаблонТекста);
	ШаблонПредупреждения.Вставить("Подсистема", Подсистема);

	ПараметрыВалидацииОтборов = Новый Структура;
	ПараметрыВалидацииОтборов.Вставить("РегистрироватьПредупреждение", Истина);
	ПараметрыВалидацииОтборов.Вставить("ШаблонПредупреждения", ШаблонПредупреждения);
	Возврат ПараметрыВалидацииОтборов;
КонецФункции

&НаСервере
Процедура ПриИзмененииНастроек()
	
	ПоказыватьПомеченныеНаУдаление = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		ИнтерфейсДокументовЭДОКлиентСервер.КлючОбъектаНастроекИнтерфейсаЭДО(),
		"ОтображатьУдаленные", Ложь);
	НастройкиОтображения = НастройкиОтображенияРазделов();
	УстановитьПараметрыСписковРазделов(НастройкиОтображения);
	ОбновитьЗаголовкиЭлементов();
		
	ПоказыватьОбластьПросмотра = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы,
		"ПоказыватьОбластьПросмотра", Ложь);
	
	РежимОтображения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы,
		"РежимОтображения", РежимыОтображенияФормы().ВсеДокументы);
		
	ПакетноеОтображение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы,
		"ПакетноеОтображение", Истина);
		
	ПоказыватьОбластьЛегенды = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы,
		"ПоказыватьОбластьЛегенды", Ложь);
	
	УстановитьОтображениеЭлементовПоНастройкамПользователя();
	
	ОбновитьВидимостьРазделовДерева(ДеревоДействий, РежимОтображения);
	
	ОбновитьЗаголовокФормы();

	НастроитьСпискиРазделов();
	УстановитьУсловноеОформление();
	
	ПоказатьРаздел(ТекущийРаздел);
	ОбновитьНавигациюПоРазделамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьЭлементовКомандыОтправитьИПолучить(Доступность = Ложь)

	Элементы.ВходящиеЭДОтправитьИПолучить.Доступность = Доступность;
	Элементы.ИсходящиеЭДОтправитьИПолучить.Доступность = Доступность;
	Элементы.СформироватьЭДОтправитьИПолучить.Доступность = Доступность;
	Элементы.КонтейнерыЭДОтправитьИПолучить.Доступность = Доступность;
	Элементы.ПриглашенияЭДОтправитьИПолучить.Доступность = Доступность;
	Элементы.ОшибкиЭДОтправитьИПолучить.Доступность = Доступность;
	Элементы.ОзнакомитьсяЭДОтправитьИПолучить.Доступность = Доступность;
	Элементы.НоменклатураКонтрагентовОтправитьИПолучить.Доступность = Доступность;
	Элементы.ОтправитьЭДОтправитьИПолучить.Доступность = Доступность;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиИзФормыТакси()
	
	ЗагрузкаПользовательскихНастроекИзФормыТаксиВыполнена = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		ИмяФормы, "ЗагрузкаПользовательскихНастроекИзФормыТаксиВыполнена", Ложь);
	
	Если ЗагрузкаПользовательскихНастроекИзФормыТаксиВыполнена Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормыТаксиДляЗагрузкиПрежнихНастроек = "Обработка.ИнтерфейсДокументовЭДО.Форма.ТекущиеДелаПоЭДО";
	
	ПоказыватьОбластьПросмотра = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		ИмяФормыТаксиДляЗагрузкиПрежнихНастроек, "ПоказыватьОбластьПросмотра", Ложь);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормы, "ПоказыватьОбластьПросмотра",
		ПоказыватьОбластьПросмотра);
		
	РежимОтображения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормыТаксиДляЗагрузкиПрежнихНастроек,
		"РежимОтображения", РежимыОтображенияФормы().ВсеДокументы);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормы, "РежимОтображения", РежимОтображения);
		
	ПакетноеОтображение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормыТаксиДляЗагрузкиПрежнихНастроек,
		"ПакетноеОтображение", Истина);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормы, "ПакетноеОтображение", ПакетноеОтображение);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормы, "ЗагрузкаПользовательскихНастроекИзФормыТаксиВыполнена",
		Истина);
	
КонецПроцедуры

#Область РаботаСЗапросами

&НаСервере
Функция ДобавитьУничтожениеВременныхТаблицВЗапрос(ТекстЗапроса)

	ВременныеТаблицы = Новый Массив;
	КоличествоВременныхТаблиц = 0;

	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);

	Для каждого ТекущийЗапрос Из Схема.ПакетЗапросов Цикл
		Если ТипЗнч(ТекущийЗапрос) = Тип("ЗапросВыбораСхемыЗапроса") Тогда
		// Добавляем временную таблицу на уничтожение.
			Если ЗначениеЗаполнено(ТекущийЗапрос.ТаблицаДляПомещения) Тогда
				ВременныеТаблицы.Добавить(ТекущийЗапрос.ТаблицаДляПомещения);
				КоличествоВременныхТаблиц = КоличествоВременныхТаблиц + 1;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекущийЗапрос) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
			Индекс = ВременныеТаблицы.Найти(ТекущийЗапрос.ИмяТаблицы);
			// Уже есть уничтожение временной таблицы.
			Если Индекс <> Неопределено Тогда
				ВременныеТаблицы.Удалить(Индекс);
				КоличествоВременныхТаблиц = КоличествоВременныхТаблиц - 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Для каждого ИмяТаблицы Из ВременныеТаблицы Цикл

		ЗапросУничтоженияВТ = Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
		ЗапросУничтоженияВТ.ИмяТаблицы = ИмяТаблицы;

	КонецЦикла;

	ТекстЗапроса = Схема.ПолучитьТекстЗапроса();

	Возврат КоличествоВременныхТаблиц;

КонецФункции

#КонецОбласти // РаботаСЗапросами

#КонецОбласти // Прочее

#Область ОбластьПросмотра

&НаКлиенте
Процедура ОчиститьОбластьПросмотраЕслиСписокПуст()

	ТекущийСписок = ПолучитьТекущийСписок();
	Если ТекущийСписок = Неопределено Или ТекущийСписок.ТекущиеДанные = Неопределено Тогда
		ОчиститьОбластьПросмотра(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекущийСписок() 
		
	Если Элементы.ПанельСписков.ТекущаяСтраница = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		ИмяСписка = СтрЗаменить(Элементы.ПанельСписков.ТекущаяСтраница.Имя, "Страница", "");
		Возврат Элементы[ИмяСписка]; 
	КонецЕсли;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ДанныеОтраженияВУчете(Знач ТекущийЭлектронныйДокумент, 	Знач ДанныеВходящегоЭлектронногоДокумента)

	ДанныеОтражения = Новый Структура;
	ДанныеОтражения.Вставить("Ссылка", Неопределено);
	ДанныеОтражения.Вставить("Представление", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ИнтеграцияЭДО.ТекстЗапросаОбъектовУчетаЭлектронныхДокументов();
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ТекущийЭлектронныйДокумент);
	
	УстановитьПривилегированныйРежим(Истина);
	ОснованияЭД = Запрос.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗначениеЗаполнено(ОснованияЭД) Тогда

		КоличествоОснований = ОснованияЭД.Количество();
		Если КоличествоОснований = 1 Тогда
			ДанныеОтражения.Представление = Строка(ОснованияЭД[0].ОбъектУчета);
			ДанныеОтражения.Ссылка = ОснованияЭД[0].ОбъектУчета;
		Иначе
			ШаблонСтроки = НСтр("ru = ';%1 документ;;%1 документа;%1 документов;%1 документов'");
			ДанныеОтражения.Представление = СтрокаСЧислом(ШаблонСтроки, КоличествоОснований, ВидЧисловогоЗначения.Количественное);
		КонецЕсли;
		
	Иначе
		
		Если ТипЗнч(ТекущийЭлектронныйДокумент) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО") Тогда
	
			Если ДанныеВходящегоЭлектронногоДокумента = Неопределено Тогда
				Возврат ДанныеОтражения;
			КонецЕсли;
		
			Если ДанныеВходящегоЭлектронногоДокумента.КонтрольОтраженияВУчете = 0 Тогда
				ДанныеОтражения.Представление = НСтр("ru = 'Сопоставить номенклатуру'");
			ИначеЕсли ДанныеВходящегоЭлектронногоДокумента.КонтрольОтраженияВУчете = 1 Тогда
				Если ДанныеВходящегоЭлектронногоДокумента.ТипДокумента = Перечисления.ТипыДокументовЭДО.КонтрактЕИС Тогда
					ДанныеОтражения.Представление = НСтр("ru = 'Создать контракт'");
				Иначе
					ДанныеОтражения.Представление = НСтр("ru = 'Создать документы'");
				КонецЕсли;
			ИначеЕсли ДанныеВходящегоЭлектронногоДокумента.КонтрольОтраженияВУчете = 2 Тогда
				ДанныеОтражения.Представление = НСтр("ru = 'Провести документы'");
			Иначе
				ДанныеОтражения.Представление = НСтр("ru = '<Не требуется>'");
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	
	Возврат ДанныеОтражения;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьОбластьПросмотра(Форма)
	
	Форма.ТекущийЭлектронныйДокумент = Неопределено;
	Форма.ТекущееСообщениеЭДО = Неопределено;
	
	Форма.Элементы.ГруппаФайл.Видимость = Ложь;
	Форма.Элементы.ТекущийДокументУчетаПредставление.Видимость = Ложь;
	Форма.Элементы.ТекущееСостояниеЭДО.Видимость = Ложь;
	Форма.ТекущийДокументТабличныйДокумент = Новый ТабличныйДокумент;
	
	Если Не Форма.ЭтоМобильныйКлиент Тогда
		Если Форма.СведенияОPdfДокументе <> Неопределено Тогда
			Форма[Форма.СведенияОPdfДокументе.ИмяЭлемента] = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Форма.Элементы.ПоказатьКомментарийСостоянияЭДО.Видимость = Ложь;
	Форма.Элементы.СтраницыПредставленийДокумента.ТекущаяСтраница = Форма.Элементы.СтраницаПустая;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураЭлементаСхемыРегламента()
	ЭлементСхемыРегламента = Новый Структура;
	ЭлементСхемыРегламента.Вставить("АдресОписанияСообщения", "");
	ЭлементСхемыРегламента.Вставить("АдресФайла", "");
	ЭлементСхемыРегламента.Вставить("ВидДокумента", Справочники.ВидыДокументовЭДО.ПустаяСсылка());
	ЭлементСхемыРегламента.Вставить("ДатаИзмененияСтатуса", '00010101');
	ЭлементСхемыРегламента.Вставить("ДополнительнаяИнформация", "");
	ЭлементСхемыРегламента.Вставить("Доступность", Ложь);
	ЭлементСхемыРегламента.Вставить("Наименование", "");
	ЭлементСхемыРегламента.Вставить("Направление", Перечисления.НаправленияЭДО.ПустаяСсылка());
	ЭлементСхемыРегламента.Вставить("ПрисоединенныйФайл", Справочники.СообщениеЭДОПрисоединенныеФайлы.ПустаяСсылка());
	ЭлементСхемыРегламента.Вставить("Сообщение", Документы.СообщениеЭДО.ПустаяСсылка());
	ЭлементСхемыРегламента.Вставить("Статус", Перечисления.СтатусыСообщенийЭДО.ПустаяСсылка());
	ЭлементСхемыРегламента.Вставить("ТипДокумента", Перечисления.ТипыДокументовЭДО.ПустаяСсылка());
	ЭлементСхемыРегламента.Вставить("ТипЭлементаРегламента", Перечисления.ТипыЭлементовРегламентаЭДО.ПустаяСсылка());
	ЭлементСхемыРегламента.Вставить("Распознан", Ложь);
	Возврат ЭлементСхемыРегламента;
КонецФункции

&НаСервереБезКонтекста
Функция СтруктураЭлементаСхемыРегламентаСЗависимымЭлементом()
	ЭлементСхемыРегламента = СтруктураЭлементаСхемыРегламента();
	ЭлементСхемыРегламента.Вставить("ЗависимыйЭлементСхемыРегламента", СтруктураЭлементаСхемыРегламента());
	Возврат ЭлементСхемыРегламента;
КонецФункции

&НаСервереБезКонтекста
Функция СтруктураДанныхОбластиПросмотра()
	ДанныеОбластиПросмотра = Новый Структура;
	ДанныеОбластиПросмотра.Вставить("ФайлСсылка", Справочники.СообщениеЭДОПрисоединенныеФайлы.ПустаяСсылка());
	ДанныеОбластиПросмотра.Вставить("ФайлНомерИконки", 0);
	ДанныеОбластиПросмотра.Вставить("ФайлПредставление", "");
	ДанныеОбластиПросмотра.Вставить("ПредставлениеДокумента", Новый ТабличныйДокумент);
	ДанныеОбластиПросмотра.Вставить("ДокументУчетаПредставление", "");
	ДанныеОбластиПросмотра.Вставить("ДокументУчета", Неопределено);
	ДанныеОбластиПросмотра.Вставить("ТекущееСостояниеЭДО", "");
	ДанныеОбластиПросмотра.Вставить("КомментарийСостояния", "");
	ДанныеОбластиПросмотра.Вставить("Статус", "Выполнено");
	ДанныеОбластиПросмотра.Вставить("ПрочтениеДолжноБытьУстановлено", Ложь);
	ДанныеОбластиПросмотра.Вставить("ФормированиеПредставления", Неопределено);
	ДанныеОбластиПросмотра.Вставить("ЭлементСхемыРегламента", СтруктураЭлементаСхемыРегламентаСЗависимымЭлементом());
	ДанныеОбластиПросмотра.Вставить("ПроштампованныйФайл", Неопределено);
	ДанныеОбластиПросмотра.Вставить("Сообщение", Неопределено);
	ДанныеОбластиПросмотра.Вставить("ПовторноеСрабатывание", Ложь);
	Возврат ДанныеОбластиПросмотра;
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеОбластиПросмотраПоФайлу(СтруктураВозврата, ПараметрыФормирования)
	
	ЭлементСхемыРегламента = СтруктураВозврата.ЭлементСхемыРегламента;
	
	Если Не ЗначениеЗаполнено(ЭлементСхемыРегламента.ПрисоединенныйФайл) Тогда
		СтруктураВозврата.ФайлПредставление = ИнтерфейсДокументовЭДОКлиентСервер.ПредставлениеОтсутствующегоФайла();
		СтруктураВозврата.Статус = "ВыполненоПустая";
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата.ФайлСсылка = ЭлементСхемыРегламента.ПрисоединенныйФайл;
	ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ПараметрыДанныхФайла.ИдентификаторФормы = ПараметрыФормирования.УникальныйИдентификатор;
	ПараметрыДанныхФайла.ПолучатьСсылкуНаДвоичныеДанные = Ложь;
	
	ДанныеФайла = РаботаСФайлами.ДанныеФайла(ЭлементСхемыРегламента.ПрисоединенныйФайл, ПараметрыДанныхФайла);
	СтруктураВозврата.ФайлПредставление = ДанныеФайла.ИмяФайла;
	Расширение = ДанныеФайла.Расширение;
	СтруктураВозврата.ФайлНомерИконки = РаботаСФайламиБЭДКлиентСервер.ИндексКартинкиПоРасширениюФайла(Расширение);
		
	Если Не ПараметрыФормирования.ЕстьОтборПоНепрочтенным Тогда
		СвойствоПрочтен = РаботаСПрочтениямиВызовСервера.ПолучитьСвойствоПрочтен(
		ПараметрыФормирования.ТекущийЭлектронныйДокумент);
		Если СвойствоПрочтен <> Неопределено Тогда
			СтруктураВозврата.ПрочтениеДолжноБытьУстановлено = Не СвойствоПрочтен;
		Иначе
			СтруктураВозврата.ПрочтениеДолжноБытьУстановлено = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыФормирования.ТекущийЭлектронныйДокумент,
		"ДатаДокумента, Контрагент, Организация, НомерДокумента, СуммаДокумента, ВидДокумента");
	
	ИмяМакета = "ПросмотрПроизвольногоДокумента_%1";
	ИмяМакета = СтрШаблон(ИмяМакета, ОбщегоНазначения.КодОсновногоЯзыка());
	МакетПроизв = Обработки.ИнтерфейсДокументовЭДО.ПолучитьМакет(ИмяМакета);
	МакетПроизв.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
	
	ОбластьШапка = МакетПроизв.ПолучитьОбласть("ОбластьПараметры");
	
	ЗначенияПараметров = Новый Структура;
	ЗначенияПараметров.Вставить("Организация", ПараметрыДокумента.Организация);
	ЗначенияПараметров.Вставить("Контрагент", ПараметрыДокумента.Контрагент);
	ЗначенияПараметров.Вставить("Номер", ПараметрыДокумента.НомерДокумента);
	ЗначенияПараметров.Вставить("Дата", Формат(ПараметрыДокумента.ДатаДокумента, "ДЛФ=D"));
	ЗначенияПараметров.Вставить("Сумма", Формат(ПараметрыДокумента.СуммаДокумента, "ЧДЦ=2"));
	ЗначенияПараметров.Вставить("ВидДокумента", ПараметрыДокумента.ВидДокумента);
	
	ОбластьШапка.Параметры.Заполнить(ЗначенияПараметров);
	ПредставлениеПроизвольногоДокумента = Новый ТабличныйДокумент;
	ОбщегоНазначенияБЭД.ВывестиОбластьВТабличныйДокумент(ПредставлениеПроизвольногоДокумента, ОбластьШапка,
		"ОбластьПараметры");
	СтруктураВозврата.ПредставлениеДокумента = ПредставлениеПроизвольногоДокумента;
	ДанныеПроштамповки = ИнтерфейсДокументовЭДО.ПроштампованныйФайлPDF(
		ЭлементСхемыРегламента.Сообщение, ПараметрыФормирования.УникальныйИдентификатор);
	СтруктураВозврата.ФормированиеПредставления = ДанныеПроштамповки.ДлительнаяОперация;
	
	Если ДанныеПроштамповки.ИспользоватьПросмотрПроштампованногоФайла Тогда
		СтруктураВозврата.Статус = "";
		ОбновитьПредставлениеДокумента(ПараметрыФормирования.ТекущийЭлектронныйДокумент,
			СтруктураВозврата.ФормированиеПредставления, ЭлементСхемыРегламента, СтруктураВозврата.ПредставлениеДокумента,
			СтруктураВозврата.Статус, СтруктураВозврата.ПрочтениеДолжноБытьУстановлено,
			ПараметрыФормирования.ЕстьОтборПоНепрочтенным);
	Иначе
		СтруктураВозврата.Статус = "ВыполненоПустая";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбластиПросмотраПоДокументуУчета(СтруктураВозврата, ПараметрыФормирования)

	ЭлементСхемыРегламента = СтруктураВозврата.ЭлементСхемыРегламента;

	ПараметрыВизуализацииДокумента = ИнтерфейсДокументовЭДО.НовыеПараметрыВизуализацииДокумента();
	ПараметрыВизуализацииДокумента.ВыводитьБанковскиеРеквизиты = ЭлементСхемыРегламента.ТипДокумента
		= Перечисления.ТипыДокументовЭДО.СчетНаОплату;
	ПараметрыВизуализацииДокумента.ВыводитьДопДанные = Ложь;
	ПараметрыВизуализацииДокумента.ВыводитьКопияВерна = Ложь;
	СтруктураВозврата.ФормированиеПредставления = ИнтерфейсДокументовЭДО.ЗапуститьФормированиеПредставленияДанныхДокумента(
		ЭлементСхемыРегламента, ПараметрыФормирования.УникальныйИдентификатор, ПараметрыВизуализацииДокумента);

	ПредставлениеДокумента = Новый ТабличныйДокумент;
	СтруктураВозврата.Статус = "";
	ОбновитьПредставлениеДокумента(ПараметрыФормирования.ТекущийЭлектронныйДокумент,
		СтруктураВозврата.ФормированиеПредставления, ЭлементСхемыРегламента, ПредставлениеДокумента,
		СтруктураВозврата.Статус, СтруктураВозврата.ПрочтениеДолжноБытьУстановлено,
		ПараметрыФормирования.ЕстьОтборПоНепрочтенным);
	СтруктураВозврата.ПредставлениеДокумента = ПредставлениеДокумента;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПопыткаЗаполнитьЭлементСхемыРегламента(СтруктураВозврата, ПараметрыФормирования)
	ЭтоВходящийЭДО = ТипЗнч(ПараметрыФормирования.ТекущийЭлектронныйДокумент) = Тип(
		"ДокументСсылка.ЭлектронныйДокументВходящийЭДО");
	ДанныеЭлектронногоДокумента = ИнтерфейсДокументовЭДО.ДанныеФормыПросмотраЭлектронногоДокумента(
		ПараметрыФормирования.ТекущийЭлектронныйДокумент, ЭтоВходящийЭДО);

	Если Не ЗначениеЗаполнено(ДанныеЭлектронногоДокумента.ДанныеЭлементовСхемы) Тогда
		Возврат Ложь;
	КонецЕсли;

	ИнформацияОтправителя = Неопределено;
	ЭлементСхемыРегламента = СтруктураВозврата.ЭлементСхемыРегламента;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСГИСЭПД") Тогда
		МодульОбменСГИСЭПД = ОбщегоНазначения.ОбщийМодуль("ОбменСГИСЭПД");
		ТипРегламента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыФормирования.ТекущийЭлектронныйДокумент,
			"ТипРегламента");
		МодульОбменСГИСЭПД.ПриОпределенииИнформацииОтправителя(ТипРегламента,
			ДанныеЭлектронногоДокумента.ДанныеЭлементовСхемы, ИнформацияОтправителя);
	КонецЕсли;

	Если ИнформацияОтправителя = Неопределено Тогда
		ИнформацияОтправителя = ДанныеЭлектронногоДокумента.ДанныеЭлементовСхемы.Найти(
			Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя, "ТипЭлементаРегламента");
	КонецЕсли;

	Если ИнформацияОтправителя <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭлементСхемыРегламента, ИнформацияОтправителя);
	Иначе
		ЗаполнитьЗначенияСвойств(ЭлементСхемыРегламента, ДанныеЭлектронногоДокумента.ДанныеЭлементовСхемы[0]);
	КонецЕсли;
	
	ИнформацияПолучателя = ДанныеЭлектронногоДокумента.ДанныеЭлементовСхемы.Найти(
		Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя, "ТипЭлементаРегламента");
	
	Если ИнформацияПолучателя <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭлементСхемыРегламента.ЗависимыйЭлементСхемыРегламента, ИнформацияПолучателя);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеОтраженияВУчете(СтруктураВозврата, ПараметрыФормирования)
	ДанныеОтраженияВУчете = ДанныеОтраженияВУчете(ПараметрыФормирования.ТекущийЭлектронныйДокумент,
		ПараметрыФормирования.ДанныеВходящегоЭлектронногоДокумента);
	СтруктураВозврата.ДокументУчета = ДанныеОтраженияВУчете.Ссылка;
	СтруктураВозврата.ДокументУчетаПредставление = ДанныеОтраженияВУчете.Представление;
КонецПроцедуры

&НаСервере
Функция ДанныеОбластиПросмотра(Знач ПараметрыФормирования)

	ТекущийЭлектронныйДокумент = ПараметрыФормирования.ТекущийЭлектронныйДокумент;

	СтруктураВозврата = СтруктураДанныхОбластиПросмотра();
	ЗаполнитьДанныеПоСостоянию(СтруктураВозврата, ТекущийЭлектронныйДокумент);
	ЗаполнитьДанныеОтраженияВУчете(СтруктураВозврата, ПараметрыФормирования);
	ЭлементСхемыРегламентаЗаполнен = ПопыткаЗаполнитьЭлементСхемыРегламента(СтруктураВозврата, ПараметрыФормирования);
	Если ЭлементСхемыРегламентаЗаполнен Тогда
		ЭлементСхемыРегламента = СтруктураВозврата.ЭлементСхемыРегламента;
		
		Если ТекущееСообщениеЭДО = ЭлементСхемыРегламента.Сообщение Тогда
			СтруктураВозврата.ПовторноеСрабатывание = Истина;
			Возврат СтруктураВозврата;
		КонецЕсли;
		
		ТипДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийЭлектронныйДокумент, "ВидДокумента.ТипДокумента");
		
		Если ТипДокумента <> Перечисления.ТипыДокументовЭДО.ДоговорныйДокумент Тогда
 			ЭлементСхемыРегламента.Распознан = РаспознатьДокумент(ТекущийЭлектронныйДокумент);
 		Иначе
 			ЭлементСхемыРегламента.Распознан = Ложь;
		КонецЕсли;
		
		Если Не ЭлементСхемыРегламента.Распознан И ЭлементСхемыРегламента.Направление <> Перечисления.НаправленияЭДО.Внутренний
			И ЭлементСхемыРегламента.ТипДокумента <> Перечисления.ТипыДокументовЭДО.Прикладной Тогда
			ЗаполнитьДанныеОбластиПросмотраПоФайлу(СтруктураВозврата, ПараметрыФормирования);
		Иначе
			ЗаполнитьДанныеОбластиПросмотраПоДокументуУчета(СтруктураВозврата, ПараметрыФормирования);
		КонецЕсли;
		ТекущееСообщениеЭДО = ЭлементСхемыРегламента.Сообщение;
	КонецЕсли;
	Если СтруктураВозврата.ПредставлениеДокумента = Неопределено Тогда
		ЗаполнитьДанныеОбластиПросмотраПоФайлу(СтруктураВозврата, ПараметрыФормирования);
	КонецЕсли;
	Возврат СтруктураВозврата;

КонецФункции

&НаСервере
Процедура ОбновитьПредставлениеДокумента(ТекущийДокументЭДО, ФормированиеПредставления, 
	ЭлементСхемыРегламента, ПредставлениеДокумента, Статус, ПрочтениеДолжноБытьУстановлено,
	ЕстьОтборПоНепрочтенным)
	
	Если ФормированиеПредставления = Неопределено
		ИЛИ ФормированиеПредставления.Статус = "Ошибка" Тогда
		
		ФормированиеПредставления = Неопределено;
		Статус = "Ошибка";
		
	ИначеЕсли ФормированиеПредставления.Статус = "Выполнено" Тогда

		Статус = ФормированиеПредставления.Статус;
		ПодготовитьПредставлениеДокумента(ТекущийДокументЭДО, ФормированиеПредставления, 
			ЭлементСхемыРегламента, ПредставлениеДокумента, ПрочтениеДолжноБытьУстановлено,
			ЕстьОтборПоНепрочтенным, Статус);
		
	ИначеЕсли ФормированиеПредставления.Статус = "Выполняется" Тогда
		
		Статус = ФормированиеПредставления.Статус;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПредставлениеДокумента(ТекущийЭлектронныйДокумент, ФормированиеПредставления, 
	ЭлементСхемыРегламента, ПредставлениеДокумента, ПрочтениеДолжноБытьУстановлено,
	ЕстьОтборПоНепрочтенным, Статус)
	
	РезультатФормирования = ПолучитьИзВременногоХранилища(ФормированиеПредставления.АдресРезультата);
	Если РезультатФормирования = Неопределено Тогда
		ФормированиеПредставления = Неопределено;
		Возврат;
	ИначеЕсли РезультатФормирования.ПредставлениеДокумента = Неопределено Тогда
		Если Не ЭлементСхемыРегламента.Распознан Тогда
			Если ЗначениеЗаполнено(РезультатФормирования.ТекстОшибки) Тогда
				Статус = "";
			Иначе
				Статус = "ВыполненоПустая";
			КонецЕсли;
		КонецЕсли;
		ПредставлениеДокумента = РезультатФормирования.ПредставлениеДокумента;
		ФормированиеПредставления = Неопределено;
		Возврат;
	Иначе
		Если ТипЗнч(РезультатФормирования.ПредставлениеДокумента) = Тип("ДвоичныеДанные") Тогда
			
			Отказ = Ложь;
			
			Попытка
			
				Если ЭтоМобильныйКлиент Тогда
					Возврат;
				КонецЕсли;
			
				Если СведенияОPdfДокументе = Неопределено Тогда

					СведенияОPdfДокументе =
						ИнтерфейсДокументовЭДО.СведенияОPDFДокументеНаФормеПоУмолчанию();
					СведенияОPdfДокументе.ИмяРодителяЭлемента = "СтраницаТекущийДокументPDF";

				КонецЕсли;

				ИнтерфейсДокументовЭДО.НастроитьПанельДляВыводаPDFДокумента(ЭтотОбъект, СведенияОPdfДокументе);

			Исключение
				Отказ = Истина;
				ИнтерфейсДокументовЭДО.ЗаписатьОшибкуВизуализацииPDFВЖурналРегистрации(ИнформацияОбОшибке());
			КонецПопытки;
			
			Если Отказ Тогда
				Статус = "";
			Иначе
				Статус = "ВыполненоТекущийДокументPDF";
			КонецЕсли;
			
	Иначе
			Статус = "ВыполненоТабличныйДокумент";
			ПредставлениеДокумента = РезультатФормирования.ПредставлениеДокумента;
		КонецЕсли;
	КонецЕсли;
	
	ФормированиеПредставления = Неопределено;
	
	Если Не ЕстьОтборПоНепрочтенным Тогда
		СвойствоПрочтен = РаботаСПрочтениямиВызовСервера.ПолучитьСвойствоПрочтен(ТекущийЭлектронныйДокумент);
		Если СвойствоПрочтен <> Неопределено Тогда
			ПрочтениеДолжноБытьУстановлено = Не СвойствоПрочтен;
		Иначе
			ПрочтениеДолжноБытьУстановлено = Ложь;
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьФормированияПредставленияДокумента()
	
	Если ФормированиеПредставления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьПредставлениеДанныхДокументаПослеФормирования", ЭтотОбъект,
		Новый Структура("ЭлектронныйДокумент", ТекущийЭлектронныйДокумент));
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ВыводитьОкноОжидания", Ложь);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФормированиеПредставления, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредставлениеДанныхДокументаПослеФормирования(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Если электронные документы не совпадают, значит визуализация неактуальна.
	Если Контекст.ЭлектронныйДокумент <> ТекущийЭлектронныйДокумент Тогда
		Возврат;
	КонецЕсли;
	
	ФормированиеПредставления = Результат;
	ПредставлениеДокумента = Неопределено;
	Статус = "";
	ПрочтениеДолжноБытьУстановлено = Ложь;
	ОбновитьПредставлениеДокумента(ТекущийЭлектронныйДокумент, ФормированиеПредставления, 
		ЭлементСхемыРегламента, ПредставлениеДокумента, Статус, ПрочтениеДолжноБытьУстановлено,
		ЕстьОтборПоНепрочтенным);
		
	Если ПредставлениеДокумента <> Неопределено Тогда
		ТекущийДокументТабличныйДокумент = ПредставлениеДокумента;
	КонецЕсли;
	Если Статус = "ВыполненоТекущийДокументPDF" Тогда
		ДанныеРезультата = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если ЗначениеЗаполнено(ДанныеРезультата) Тогда
			ИнтерфейсДокументовЭДОКлиент.ВывестиPDFДокументНаФорму(ЭтотОбъект, 
				СведенияОPdfДокументе, ДанныеРезультата.ПредставлениеДокумента);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьСтраницуПредставления(Статус);
	Если ПрочтениеДолжноБытьУстановлено Тогда
		ПодключитьОбработчикОжидания("УстановитьПрочтенность", 3, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеПоСостоянию(ДанныеОбластиПросмотра, ТекущийЭлектронныйДокумент)

	СостояниеДокументаПодробное = ЭлектронныеДокументыЭДО.СостояниеДокументаПодробное(ТекущийЭлектронныйДокумент);

	Если ЗначениеЗаполнено(СостояниеДокументаПодробное.Комментарий) Тогда
		ШаблонПредставления = "%1 (%2)";
		СостояниеДокументаПодробное = ЭлектронныеДокументыЭДО.СостояниеДокументаПодробное(ТекущийЭлектронныйДокумент);
		ПредставлениеСостояния = СтрШаблон(ШаблонПредставления, СостояниеДокументаПодробное.Значение,
			СостояниеДокументаПодробное.Комментарий);
	ИначеЕсли ЗначениеЗаполнено(СостояниеДокументаПодробное.Значение) Тогда
		ПредставлениеСостояния = СостояниеДокументаПодробное.Значение;
	Иначе
		ПредставлениеСостояния = ЭлектронныеДокументыЭДО.НачальноеСостояниеДокумента();
	КонецЕсли;
	
	ДанныеОбластиПросмотра.ТекущееСостояниеЭДО = ПредставлениеСостояния;
	ДанныеОбластиПросмотра.КомментарийСостояния = СостояниеДокументаПодробное.Комментарий;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуПредставления(Статус)

	Если Статус = "Выполнено" Или Статус = "ВыполненоТабличныйДокумент" Тогда
		 Элементы.СтраницыПредставленийДокумента.ТекущаяСтраница = Элементы.СтраницаТабличныйДокумент;
	ИначеЕсли Статус = "ВыполненоТекущийДокументPDF" Тогда
		 Элементы.СтраницыПредставленийДокумента.ТекущаяСтраница = Элементы.СтраницаТекущийДокументPDF;
	ИначеЕсли Статус = "ВыполненоПустая" Тогда
		Элементы.СтраницыПредставленийДокумента.ТекущаяСтраница = Элементы.СтраницаПустая;	
	ИначеЕсли Статус = "Выполняется" Тогда
		Элементы.СтраницыПредставленийДокумента.ТекущаяСтраница = Элементы.СтраницаОжидание;
	Иначе
		Элементы.СтраницыПредставленийДокумента.ТекущаяСтраница = Элементы.СтраницаОшибка;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПараметрыФормированияДанныхОбластиПросмотра()
	ПараметрыФормирования = Новый Структура;
	ПараметрыФормирования.Вставить("ТекущийЭлектронныйДокумент", ТекущийЭлектронныйДокумент);
	ПараметрыФормирования.Вставить("ДанныеВходящегоЭлектронногоДокумента", Элементы.ВходящиеЭД.ТекущиеДанные);
	ПараметрыФормирования.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыФормирования.Вставить("ЕстьОтборПоНепрочтенным", ЕстьОтборПоНепрочтенным);
	ПараметрыФормирования.Вставить("ФормированиеПредставления", ФормированиеПредставления);
	Возврат ПараметрыФормирования;
КонецФункции

&НаКлиенте
Процедура ОбновитьОбластьПросмотра()

	Если Не ПоказыватьОбластьПросмотра Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекущийЭлектронныйДокумент) Тогда
		ОчиститьОбластьПросмотра(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормирования = ПараметрыФормированияДанныхОбластиПросмотра();
	ДанныеПросмотра = ДанныеОбластиПросмотра(ПараметрыФормирования);
	Если ДанныеПросмотра.ПовторноеСрабатывание Тогда
		Возврат;
	КонецЕсли;

	ФормированиеПредставления = ДанныеПросмотра.ФормированиеПредставления;
	ЭлементСхемыРегламента = ДанныеПросмотра.ЭлементСхемыРегламента;
	ТекущийДокументТабличныйДокумент = ДанныеПросмотра.ПредставлениеДокумента;
	ТекущийФайл = ДанныеПросмотра.ФайлСсылка;
	ТекущийФайлПредставление = ДанныеПросмотра.ФайлПредставление;
	ТекущаяКартинкаФайла = ДанныеПросмотра.ФайлНомерИконки;
	ТекущееСостояниеЭДО = ДанныеПросмотра.ТекущееСостояниеЭДО;
	ТекущийКомментарийСостояния = ДанныеПросмотра.КомментарийСостояния;
	ТекущийДокументУчета = ДанныеПросмотра.ДокументУчета;
	ТекущийДокументУчетаПредставление = ДанныеПросмотра.ДокументУчетаПредставление;

	ПоказатьФайл = ЗначениеЗаполнено(ДанныеПросмотра.ФайлПредставление);
	ПоказатьДокументУчета = ЗначениеЗаполнено(ТекущийДокументУчетаПредставление);
	ЕстьКомментарийСостояния = ЗначениеЗаполнено(ДанныеПросмотра.КомментарийСостояния);

	Элементы.ГруппаФайл.Видимость = ПоказатьФайл;

	Элементы.ТекущийДокументУчетаПредставление.Видимость = ПоказатьДокументУчета;
	Элементы.ТекущееСостояниеЭДО.Видимость = ЗначениеЗаполнено(ТекущееСостояниеЭДО);
	Элементы.ПоказатьКомментарийСостоянияЭДО.Видимость = ЕстьКомментарийСостояния;

	ОжидатьФормированияПредставленияДокумента();
	УстановитьСтраницуПредставления(ДанныеПросмотра.Статус);
		
	Если ДанныеПросмотра.ПрочтениеДолжноБытьУстановлено Тогда
		ПодключитьОбработчикОжидания("УстановитьПрочтенность", 3, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПрочтенность() 
	УстановитьПрочтенностьСервер(ТекущийЭлектронныйДокумент);
КонецПроцедуры

&НаСервере
Процедура УстановитьПрочтенностьСервер(ТекущийДокументЭДО)
	РаботаСПрочтениямиВызовСервера.УстановитьСвойствоПрочтен(ТекущийДокументЭДО, Истина);
	ОбновитьДинамическиеСписки();
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьОбластиПросмотра(Знач Раздел)
	
	РазделыФормы = РазделыФормы();
	
	Если Раздел = РазделыФормы.Сформировать
		Или Раздел = РазделыФормы.Распаковать
		Или Раздел = РазделыФормы.Приглашения
		Или Раздел = РазделыФормы.ТребуетсяПригласить
		Или Раздел = РазделыФормы.ЖдемСогласия
		Или Раздел = РазделыФормы.ТребуетсяСогласие
		Или Раздел = РазделыФормы.ПриглашенияОзнакомиться
		Или Раздел = РазделыФормы.НоменклатураКонтрагентов Тогда
		Элементы.ГруппаОбластьПросмотра.Видимость = Ложь;
	Иначе
		Элементы.ГруппаОбластьПросмотра.Видимость = ПоказыватьОбластьПросмотра;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбластьПросмотра

#Область СведенияОЗадолженности

&НаСервереБезКонтекста
Процедура ПоказатьУведомленияПоЗадолженности(Форма, Задолженность)
	
	Если Не Задолженность.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПредупреждения = НСтр("ru = '<a href=%1>У вас задолженность</a>'");
	
	ПараметрыБаннера = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыБаннера.Сообщение = СтроковыеФункции.ФорматированнаяСтрока(ТекстПредупреждения,
		"ПоказатьСведенияОЗадолженности");
	ПараметрыБаннера.Идентификатор = "ПредупреждениеОНаличииЗадолженности";
	ПараметрыБаннера.КраткоеПредставление = НСтр("ru = 'У вас задолженность'");;
	ПараметрыБаннера.Обработчик = "Подключаемый_ПоказатьСведенияОЗадолженности"; // См. Подключаемый_ПоказатьСведенияОЗадолженности
	ПараметрыБаннера.Скрываемый = Ложь;
		
	ОбщегоНазначения.ДобавитьВажноеСообщение(Форма, ПараметрыБаннера);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(Форма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СведенияОЗадолженности()
	
	Возврат ИнтерфейсДокументовЭДО.СведенияОЗадолженности();
	
КонецФункции

#КонецОбласти // СведенияОЗадолженности

#Область ПодменюКоманд

&НаКлиенте
Процедура ПодменюПомощьПоказатьВыборИзМеню(Элемент)
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПодменюПомощьПослеВыбораИзМеню", ЭтотОбъект);
	
	СоставКомандПодменю = СоставКомандПодменюПомощь();
	
	СписокКоманд = Новый СписокЗначений;
	СписокКоманд.Добавить(СоставКомандПодменю.ПолезныеСсылки, НСтр("ru = 'Полезные ссылки'"));
	СписокКоманд.Добавить(СоставКомандПодменю.Техподдержка, НСтр("ru = 'Техподдержка'"));
	СписокКоманд.Добавить(СоставКомандПодменю.ДиагностикаЭДО, НСтр("ru = 'Диагностика ЭДО'"));
	СписокКоманд.Добавить(СоставКомандПодменю.ЕстьИдея, НСтр("ru = 'Есть идея?'"));
	
	ПоказатьВыборИзМеню(ОбработчикЗавершения, СписокКоманд, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодменюПомощьПослеВыбораИзМеню(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяКоманда = Результат.Значение;
	
	СоставКомандПодменю = СоставКомандПодменюПомощь();
	
	Если ВыбраннаяКоманда = СоставКомандПодменю.ПолезныеСсылки Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ОткрытьФормуПолезныхСсылок();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.Техподдержка Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ОткрытьОбращениеВСлужбуТехническойПоддержки();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.ДиагностикаЭДО Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ЗапуститьДиагностикуЭДО();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.ЕстьИдея Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ОткрытьСтраницуОпроса();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СоставКомандПодменюПомощь()

	СоставКоманд = Новый Структура;
	СоставКоманд.Вставить("ПолезныеСсылки", "ПолезныеСсылки");
	СоставКоманд.Вставить("Техподдержка", "Техподдержка");
	СоставКоманд.Вставить("ДиагностикаЭДО", "ДиагностикаЭДО");
	СоставКоманд.Вставить("ЕстьИдея", "ЕстьИдея");
	Возврат СоставКоманд;

КонецФункции

&НаКлиенте
Процедура ПодменюСервисПоказатьВыборИзМеню(Элемент)
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПодменюСервисПослеВыбораИзМеню", ЭтотОбъект);
	
	СоставКомандПодменю = СоставКомандПодменюСервис();
	
	СписокКоманд = Новый СписокЗначений;
	Если ЕстьПравоОбработкиДокументов Тогда
		СписокКоманд.Добавить(СоставКомандПодменю.МассоваяОтправкаФайлов, НСтр("ru = 'Массовая отправка файлов'"),,
			БиблиотекаКартинок.МассоваяОтправкаБЭД);
	КонецЕсли;
	СписокКоманд.Добавить(СоставКомандПодменю.АрхивЭДО, НСтр("ru = 'Архив ЭДО'"),, БиблиотекаКартинок.Справочник);
	СписокКоманд.Добавить(СоставКомандПодменю.УчетныеЗаписиЭДО, НСтр("ru = 'Учетные записи ЭДО'"),,
		БиблиотекаКартинок.ПодключениеБЭДШаблонная);
	СписокКоманд.Добавить(СоставКомандПодменю.МашиночитаемыеДоверенности, НСтр("ru = 'Машиночитаемые доверенности'"),,
		БиблиотекаКартинок.МашиночитаемыеДоверенностиБЭД);
	Если ЕстьПравоАдминистрирования Тогда
		СписокКоманд.Добавить(СоставКомандПодменю.ПроверитьПодписи, НСтр("ru = 'Проверить подписи'"),,
			БиблиотекаКартинок.СинтаксическийКонтроль);
	КонецЕсли;
	СписокКоманд.Добавить(СоставКомандПодменю.ОбщееСостояниеЭДО, НСтр("ru = 'Общее состояние ЭДО'"),,
		БиблиотекаКартинок.Отчет);
	
	ПоказатьВыборИзМеню(ОбработчикЗавершения, СписокКоманд, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодменюСервисПослеВыбораИзМеню(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяКоманда = Результат.Значение;
	
	СоставКомандПодменю = СоставКомандПодменюСервис();
	
	Если ВыбраннаяКоманда = СоставКомандПодменю.МассоваяОтправкаФайлов Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ОткрытьФормуМассовойЗагрузкиФайлов();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.АрхивЭДО Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ОткрытьАрхивЭДО();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.УчетныеЗаписиЭДО Тогда
		
		СинхронизацияЭДОКлиент.ОткрытьСписокУчетныхЗаписей();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.МашиночитаемыеДоверенности Тогда
		
		МашиночитаемыеДоверенностиКлиент.ОткрытьОбщуюФормуСписковМЧД();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.ПроверитьПодписи Тогда
		
		ОбщегоНазначенияБЭДКлиент.ОткрытьФормуБЭД("Обработка.ИнтерфейсДокументовЭДО.Форма.ПроверкаПодписей");
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.ОбщееСостояниеЭДО Тогда
		
		ОбщегоНазначенияБЭДКлиент.ОткрытьФормуБЭД("Отчет.ДиаграммаСостоянияЭДО.Форма");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СоставКомандПодменюСервис()

	СоставКоманд = Новый Структура;
	СоставКоманд.Вставить("МассоваяОтправкаФайлов", "МассоваяОтправкаФайлов");
	СоставКоманд.Вставить("АрхивЭДО", "АрхивЭДО");
	СоставКоманд.Вставить("УчетныеЗаписиЭДО", "УчетныеЗаписиЭДО");
	СоставКоманд.Вставить("МашиночитаемыеДоверенности", "МашиночитаемыеДоверенности");
	СоставКоманд.Вставить("ПроверитьПодписи", "ПроверитьПодписи");
	СоставКоманд.Вставить("ОбщееСостояниеЭДО", "ОбщееСостояниеЭДО");
	Возврат СоставКоманд;

КонецФункции

&НаКлиенте
Процедура ПодменюНастройкиПоказатьВыборИзМеню(Элемент)
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПодменюНастройкиПослеВыбораИзМеню", ЭтотОбъект);
	
	СоставКомандПодменю = СоставКомандПодменюНастройки();
	
	СписокКоманд = Новый СписокЗначений;
	СписокКоманд.Добавить(СоставКомандПодменю.НастройкиЭДО, НСтр("ru = 'Настройки ЭДО'"),,
		БиблиотекаКартинок.НастройкиОтчета);
	СписокКоманд.Добавить(СоставКомандПодменю.ПерсональныеНастройки, НСтр("ru = 'Персональные настройки'"),,
		БиблиотекаКартинок.ПрочиеПользовательскиеНастройки);
	
	ПоказатьВыборИзМеню(ОбработчикЗавершения, СписокКоманд, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодменюНастройкиПослеВыбораИзМеню(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяКоманда = Результат.Значение;
	
	СоставКомандПодменю = СоставКомандПодменюНастройки();
	
	Если ВыбраннаяКоманда = СоставКомандПодменю.НастройкиЭДО Тогда
		
		НастройкиЭДОКлиент.ОткрытьФормуНастроекЭДО();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.ПерсональныеНастройки Тогда
		
		ОткрытьФорму("Обработка.ПанельАдминистрированияБЭД.Форма.ПерсональныеНастройки",, ЭтотОбъект,,,,,
			РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СоставКомандПодменюНастройки()

	СоставКоманд = Новый Структура;
	СоставКоманд.Вставить("НастройкиЭДО", "НастройкиЭДО");
	СоставКоманд.Вставить("ПерсональныеНастройки", "ПерсональныеНастройки");
	Возврат СоставКоманд;

КонецФункции

#КонецОбласти // ПодменюКоманд

#Область МассовыйВыборДокументов

&НаСервере
Процедура НастроитьМассовыйВыборДокументов()
	
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.ВходящиеЭД, Элементы.ВходящиеЭДВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
		
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.ИсходящиеЭД, Элементы.ИсходящиеЭДВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
		
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.СформироватьЭД, Элементы.СформироватьЭДВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
		
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.КонтейнерыЭД, Элементы.КонтейнерыЭДВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
		
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.ПриглашенияЭД, Элементы.ПриглашенияЭДВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
		
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.ОшибкиЭД, Элементы.ОшибкиЭДВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
		
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.ОзнакомитьсяЭД, Элементы.ОзнакомитьсяЭДВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
		
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.НоменклатураКонтрагентов, Элементы.НоменклатураКонтрагентовВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
		
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.ОтправитьЭД, Элементы.ОтправитьЭДВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);

КонецПроцедуры

#КонецОбласти // МассовыйВыборДокументов

#Область КонтекстныеПодсказки

&НаКлиенте
Процедура Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии()

	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";	
	КонтекстныеПодсказкиБЭДКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриОткрытии(ЭтотОбъект, ИдентификаторыСобытийПриОткрытии);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПанельКонтекстныхНовостейОбработкаНавигационнойСсылки(Элемент, ПараметрНавигационнаяСсылка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	КонтекстныеПодсказкиБЭДКлиент.ПанельКонтекстныхНовостей_ЭлементПанелиНовостейОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		ПараметрНавигационнаяСсылка,
		СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПанельКонтекстныхНовостей_ЭлементУправленияНажатие(Элемент)
	
	КонтекстныеПодсказкиБЭДКлиент.ЭлементУправленияНажатие(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКонтекст(КатегорииПересчета = Неопределено) 
	
	Если Не КонтекстныеПодсказкиБЭД.ФункционалКонтекстныхПодсказокДоступен() Тогда 
		Возврат;
	КонецЕсли;

	КонтекстныеПодсказкиБЭД.ОтобразитьАктуальныеДляКонтекстаНовости(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти // КонтекстныеПодсказки

#Область ОбработчикиБаннеров

&НаКлиенте
Процедура Подключаемый_ПоказатьСведенияОЗадолженности(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтерфейсДокументовЭДОКлиент.ПоказатьСведенияОЗадолженности(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПредупреждениеАвтоматическогоПолученияЭДООбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылка, СтандартнаяОбработка)
	
	АвтоматическоеПолучениеЭДОКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект, Элемент, НавигационнаяСсылка, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиБаннеров

#КонецОбласти // СлужебныеПроцедурыИФункции