
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Компания = Константы.УчетПоКомпании.Компания(Объект.Организация);
	
	Если ТипЗнч(КэшЗначений) <> Тип("Структура") Тогда
		КэшЗначений = Новый Структура;
	КонецЕсли;
	КэшЗначений.Вставить("ИспользоватьМинимальныеЦены", ЦенообразованиеСерверПовтИсп.МинимальныеЦеныИспользуются());
	
	УстановитьУсловноеОформление();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриСозданииПриЧтенииНаСервере();
		
	КонецЕсли;
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	ЦенообразованиеСервер.ДобавитьКолонкуИЗаполнитьМинимальныеЦеныВТЧ(ЭтотОбъект, "ТаблицаПланирования");

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
	МобильныйКлиентУНФ.НастроитьФормуОбъектаМобильныйКлиент(Элементы, "ТаблицаПланирования");

	ИспользоватьМногофирменныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Если Не ИспользоватьМногофирменныйУчет И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Организация.Гиперссылка = Истина;  
	КонецЕсли;
	
	АдаптацияФормыТакси();	
	
	УстановитьСвойстваСвернутогоПодвала();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодборПроизведен"
		И ЗначениеЗаполнено(Параметр)
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор Тогда
		
		ОбработатьПодбор(Параметр);
		
	КонецЕсли;
	Если ИмяСобытия = "ИзменитьВыделенные_Применить" И Параметр.Владелец = ЭтотОбъект Тогда
		ОбработатьИзменениеСтрок(Параметр.Действие, Параметр.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриСозданииПриЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьТаблицуИзКроссТаблицыПланирования(ТекущийОбъект.Запасы);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЦенообразованиеСервер.ДобавитьКолонкуИЗаполнитьМинимальныеЦеныВТЧ(ЭтотОбъект, "ТаблицаПланирования");

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Объект"));
	
	Для Каждого СтрокаТаблицы Из ТаблицаПланирования Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ОбъектПланирования) Тогда
			
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Заполнение",
				РеквизитыСценария.ПредставлениеИзмерения,
				СтрокаТаблицы.НомерСтроки,
				Элементы.СтраницаПлан.Заголовок);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаПланирования", СтрокаТаблицы.НомерСтроки, "ОбъектПланирования"),
				,
				Отказ);
			
		КонецЕсли;
		
		Если РеквизитыСценария.ПланироватьКоличество Тогда
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.ВсегоКоличество) Тогда
				
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Колонка",
					"Заполнение",
					НСтр("ru='Количество'"),
					СтрокаТаблицы.НомерСтроки,
					Элементы.СтраницаПлан.Заголовок);
				
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаПланирования", СтрокаТаблицы.НомерСтроки, "КолонкаКоличество_0"),
					,
					Отказ);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
				
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Колонка",
					"Заполнение",
					НСтр("ru='Единица измерения'"),
					СтрокаТаблицы.НомерСтроки,
					Элементы.СтраницаПлан.Заголовок);
				
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаПланирования", СтрокаТаблицы.НомерСтроки, "ЕдиницаИзмерения"),
					,
					Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДанныеДляИзмененияДаты = ДанныеДляИзмененияДаты(Объект.Дата, Объект.ВалютаДокумента);
	
	Если ДанныеДляИзмененияДаты.ВалютаКурсКратность.Курс <> Объект.Курс ИЛИ ДанныеДляИзмененияДаты.ВалютаКурсКратность.Кратность <> Объект.Кратность Тогда
		Объект.Курс = ДанныеДляИзмененияДаты.ВалютаКурсКратность.Курс;
		Объект.Кратность = ДанныеДляИзмененияДаты.ВалютаКурсКратность.Кратность;
		РассчитатьСуммуПоВсемСтрокамПоКоличествуИЦене(ЭтотОбъект);
		РассчитатьИтогиПоВсемСтрокам(ЭтотОбъект);
		РассчитатьИтогПоДокументу(ЭтотОбъект);
		СформироватьНадписьЦеныИВалюта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПланированияПриИзменении(Элемент)
	
	Если ТаблицаПланирования.Количество() > 0 И ЗначениеЗаполнено(РеквизитыДоИзменения.СценарийПланирования) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаданВопросОбИзмененииСценария", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='План содержит введенные данные.
			|При продолжении, состав колонок будет приведен в соответствие новому сценарию.
			|
			|Продолжить?'");
		ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
		ПараметрыВопроса.Заголовок = НСтр("ru='Подтверждение изменения сценария'");
		ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ПараметрыВопроса);
		
	Иначе
		
		ПриИзмененииСценарияСервер();
		УправлениеФормой();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПланированияПриИзменении(Элемент)
	
	ПриИзмененииПериодаПланированияКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПланированияПриИзменении(Элемент)
	
	ПриИзмененииПериодаПланированияКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныИВалютаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыЦеныИВалюта = ЦеныИВалютаКлиентСервер.НовыеПараметрыФормыЦеныИВалюта(Объект, ТолькоПросмотр,
		Компания, Ложь, Ложь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЦеныИВалютаФормаЗакрыта", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ЦеныИВалюта", ПараметрыФормыЦеныИВалюта, ЭтотОбъект, , , , ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийСвернутоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПланирования

&НаКлиенте
Процедура ТаблицаПланированияПриИзменении(Элемент)
	
	ЗаполнитьНомераСтрокТаблицы(ЭтотОбъект);
	РассчитатьКоличествоСтрок(ЭтотОбъект);
	РассчитатьИтогПоДокументу(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПланированияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьКоличествоСтрок(ЭтотОбъект);
	РассчитатьИтогПоДокументу(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПланированияПослеУдаления(Элемент)
	
	ЗаполнитьНомераСтрокТаблицы(ЭтотОбъект);
	РассчитатьКоличествоСтрок(ЭтотОбъект);
	РассчитатьИтогПоДокументу(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПланированияОбъектПланированияПриИзменении(Элемент)
	
	Если Не РеквизитыСценария.ИзмерениеПланирования = ПредопределенноеЗначение("Перечисление.ИзмеренияПланирования.Номенклатура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ТаблицаПланирования.ТекущиеДанные;
	
	ДействияНаСервере = Новый Структура;
	
	Если РеквизитыСценария.ПланироватьКоличество Тогда
		ДействияНаСервере.Вставить("ЕдиницаИзмерения", ТекущиеДанные.ОбъектПланирования);
		ДействияНаСервере.Вставить("Цена", ПолучитьСтруктуруПересчетаЦены(Объект, ТекущиеДанные));
	КонецЕсли;
	
	Если ЭтотОбъект.ИспользоватьХарактеристики Тогда
		ДействияНаСервере.Вставить("ИспользуютсяХарактеристики", ТекущиеДанные.ОбъектПланирования);
	КонецЕсли;
	
	Если ДействияНаСервере.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеСервер(ДействияНаСервере);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДействияНаСервере);
	
	Если РеквизитыСценария.ПланироватьКоличество Тогда
		РассчитатьСуммуВСтрокеПоКоличествуИЦене(ТекущиеДанные, Периоды);
		РассчитатьИтогиВСтроке(ТекущиеДанные, Периоды);
		РассчитатьИтогПоДокументу(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПланированияХарактеристикаПриИзменении(Элемент)
	
	Если Не РеквизитыСценария.ПланироватьКоличество Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ТаблицаПланирования.ТекущиеДанные;
	
	ДействияНаСервере = Новый Структура;
	ДействияНаСервере.Вставить("Цена", ПолучитьСтруктуруПересчетаЦены(Объект, ТекущиеДанные));
	
	ПолучитьДанныеСервер(ДействияНаСервере);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДействияНаСервере);
	
	РассчитатьСуммуВСтрокеПоКоличествуИЦене(ТекущиеДанные, Периоды);
	РассчитатьИтогиВСтроке(ТекущиеДанные, Периоды);
	РассчитатьИтогПоДокументу(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПланированияЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПланирования.ТекущиеДанные;
	
	Если ТекущиеДанные.ЕдиницаИзмерения = ВыбранноеЗначение
		Или ТекущиеДанные.Цена = 0
		Или (ТипЗнч(ТекущиеДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
			И ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")) Тогда
		
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Цена = ТекущиеДанные.Цена * ОтношениеКоэффициентовЕдиницИзмерения(ТекущиеДанные.ЕдиницаИзмерения, ВыбранноеЗначение);
	
	Если КэшЗначений.ИспользоватьМинимальныеЦены
		И ТекущиеДанные.Свойство("МинимальнаяЦена") Тогда
		
		ТекущиеДанные.МинимальнаяЦена = ТекущиеДанные.МинимальнаяЦена * ОтношениеКоэффициентовЕдиницИзмерения(ТекущиеДанные.ЕдиницаИзмерения, ВыбранноеЗначение);
		
	КонецЕсли;
	
	РассчитатьСуммуВСтрокеПоКоличествуИЦене(ТекущиеДанные, Периоды);
	РассчитатьИтогиВСтроке(ТекущиеДанные, Периоды);
	РассчитатьИтогПоДокументу(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПланированияЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПланирования.ТекущиеДанные;
	
	РассчитатьСуммуВСтрокеПоКоличествуИЦене(ТекущиеДанные, Периоды);
	РассчитатьИтогиВСтроке(ТекущиеДанные, Периоды);
	РассчитатьИтогПоДокументу(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КолонкаКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПланирования.ТекущиеДанные;
	
	Индекс = Сред(Элемент.Имя, СтрДлина("КолонкаКоличество_")+1);
	ТекущиеДанные["КолонкаСумма_" + Индекс] = ТекущиеДанные["КолонкаКоличество_" + Индекс] * ТекущиеДанные.Цена;
	
	РассчитатьИтогиВСтроке(ТекущиеДанные, Периоды);
	РассчитатьИтогПоДокументу(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КолонкаСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПланирования.ТекущиеДанные;
	
	РассчитатьИтогиВСтроке(ТекущиеДанные, Периоды);
	РассчитатьИтогПоДокументу(ЭтотОбъект);
	
	Если РеквизитыСценария.ПланироватьКоличество И ТекущиеДанные.ВсегоКоличество > 0 Тогда
		ТекущиеДанные.Цена = ТекущиеДанные.ВсегоСумма / ТекущиеДанные.ВсегоКоличество;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТаблицаПланированияДобавитьИзДокумента(Команда)
	
	ПланИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента");
	ОбработатьВыборДействия();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	ОбщегоНазначенияУНФКлиент.РедактироватьПериод(
		Объект, Новый Структура("ДатаНачала, ДатаОкончания", "НачалоПланирования", "ОкончаниеПланирования"),
		Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПодборНоменклатурыВДокументахКлиент.ОткрытьФормуПодбораНоменклатуры(ЭтотОбъект, "ТаблицаПланирования");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПланируемымПродажам(Команда)
	
	ОткрытьНастройкиЗаполненияПоСхеме("СКД_ПланПродаж", НСтр("ru='Настройки заполнения по запланированным продажам'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоФактическимПродажам(Команда)
	
	ОткрытьНастройкиЗаполненияПоСхеме("СКД_ФактПродаж", НСтр("ru='Настройки заполнения по фактическим продажам'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПланВыполнитьДействие(Команда)
	
	ОтборСтрок = Новый Структура("Пометка", Истина);
	ОтмеченныеСтроки = ТаблицаПланирования.НайтиСтроки(ОтборСтрок);
	
	Если ПланИзменениеСтрокДействие <> ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента")
		И ОтмеченныеСтроки.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru='Нет выбранных строк.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ПланИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
		
		ПриводитьКМинимальнымЦенам = КэшЗначений.ИспользоватьМинимальныеЦены;
	
		Для Каждого СтрокаТаблицы Из ОтмеченныеСтроки Цикл
			
			Для Индекс = 0 По Периоды.Количество()-1 Цикл
				
				СтрокаТаблицы["КолонкаСумма_" + Индекс] = СтрокаТаблицы["КолонкаСумма_" + Индекс] * (100 + ПланИзменениеСтрокЗначение) / 100;

				Если ПриводитьКМинимальнымЦенам 
					И СтрокаТаблицы.Свойство("МинимальнаяЦена") Тогда

					Если РеквизитыСценария.ПланироватьКоличество Тогда
						КоличествоПоСтроке = СтрокаТаблицы["КолонкаКоличество_" + Индекс];
					Иначе
						КоличествоПоСтроке = 1;
					КонецЕсли;

					МинимальнаяСумма = СтрокаТаблицы.МинимальнаяЦена * КоличествоПоСтроке;
					СуммаПоКолонке = СтрокаТаблицы["КолонкаСумма_" + Индекс];
					Если СуммаПоКолонке < МинимальнаяСумма Тогда
						
						СтрокаТаблицы["КолонкаСумма_" + Индекс] = МинимальнаяСумма;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			РассчитатьИтогиВСтроке(СтрокаТаблицы, Периоды);
			
			Если РеквизитыСценария.ПланироватьКоличество И СтрокаТаблицы.ВсегоКоличество > 0 Тогда
				СтрокаТаблицы.Цена = СтрокаТаблицы.ВсегоСумма / СтрокаТаблицы.ВсегоКоличество;
			КонецЕсли;
			
		КонецЦикла;
		
		РассчитатьИтогПоДокументу(ЭтотОбъект);
		
	ИначеЕсли ПланИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены") Тогда
		
		Для Каждого СтрокаТаблицы Из ОтмеченныеСтроки Цикл
			СтрокаТаблицы.Цена = ОкруглитьЦену(СтрокаТаблицы.Цена, ПланИзменениеСтрокЗначение, Ложь);
		КонецЦикла;
		
		РассчитатьСуммуПоВсемСтрокамПоКоличествуИЦене(ЭтотОбъект);
		РассчитатьИтогиПоВсемСтрокам(ЭтотОбъект);
		
	ИначеЕсли ПланИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦеныПоВиду") Тогда
		
		ПерезаполнитьЦены(ПланИзменениеСтрокЗначение, ОтборСтрок);
		
		РассчитатьСуммуПоВсемСтрокамПоКоличествуИЦене(ЭтотОбъект);
		РассчитатьИтогиПоВсемСтрокам(ЭтотОбъект);
		
	ИначеЕсли ПланИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
		// Установить количество для всех периодов
		
		Для Каждого СтрокаТаблицы Из ОтмеченныеСтроки Цикл
			Для Индекс = 0 По Периоды.Количество()-1 Цикл
				СтрокаТаблицы["КолонкаКоличество_" + Индекс] = ПланИзменениеСтрокЗначение;
			КонецЦикла;
		КонецЦикла;
		
		РассчитатьСуммуПоВсемСтрокамПоКоличествуИЦене(ЭтотОбъект);
		РассчитатьИтогиПоВсемСтрокам(ЭтотОбъект);
		
	ИначеЕсли ПланИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
		// Установить сумму для всех периодов
		
		ПриводитьКМинимальнымЦенам = КэшЗначений.ИспользоватьМинимальныеЦены;
		
		Для Каждого СтрокаТаблицы Из ОтмеченныеСтроки Цикл
			
			Для Индекс = 0 По Периоды.Количество()-1 Цикл
				СтрокаТаблицы["КолонкаСумма_" + Индекс] = ПланИзменениеСтрокЗначение;
				
				Если ПриводитьКМинимальнымЦенам 
					И СтрокаТаблицы.Свойство("МинимальнаяЦена") Тогда

					Если РеквизитыСценария.ПланироватьКоличество Тогда
						КоличествоПоСтроке = СтрокаТаблицы["КолонкаКоличество_" + Индекс];
					Иначе
						КоличествоПоСтроке = 1;
					КонецЕсли;

					МинимальнаяСумма = СтрокаТаблицы.МинимальнаяЦена * КоличествоПоСтроке;
					СуммаПоКолонке = СтрокаТаблицы["КолонкаСумма_" + Индекс];
					Если СуммаПоКолонке < МинимальнаяСумма 
						ИЛИ КоличествоПоСтроке = 0 Тогда
						
						СтрокаТаблицы["КолонкаСумма_" + Индекс] = МинимальнаяСумма;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			РассчитатьИтогиВСтроке(СтрокаТаблицы, Периоды);
			
			Если РеквизитыСценария.ПланироватьКоличество Тогда
				
				Если СтрокаТаблицы.ВсегоКоличество = 0 Тогда
					СтрокаТаблицы.Цена = 0;
					Продолжить
				КонецЕсли;
				
				СтрокаТаблицы.Цена = СтрокаТаблицы.ВсегоСумма / СтрокаТаблицы.ВсегоКоличество;
			КонецЕсли;
			
		КонецЦикла;
		
		РассчитатьИтогПоДокументу(ЭтотОбъект);
		
	ИначеЕсли ПланИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПокупателя") Тогда
		
		Для Каждого СтрокаТаблицы Из ОтмеченныеСтроки Цикл
			СтрокаТаблицы.ЗаказПокупателя = ПланИзменениеСтрокЗначение;
		КонецЦикла;
		
	ИначеЕсли ПланИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
		
		ДобавитьИзДокументаСервер();
		
		РассчитатьКоличествоСтрок(ЭтотОбъект);
		Если РеквизитыСценария.ПланироватьКоличество Тогда
			РассчитатьСуммуПоВсемСтрокамПоКоличествуИЦене(ЭтотОбъект);
			РассчитатьИтогиПоВсемСтрокам(ЭтотОбъект);
		КонецЕсли;
		
	ИначеЕсли ПланИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки") Тогда
		
		Для Каждого СтрокаТаблицы Из ОтмеченныеСтроки Цикл
			ТаблицаПланирования.Удалить(СтрокаТаблицы);
		КонецЦикла;
		
		ЗаполнитьНомераСтрокТаблицы(ЭтотОбъект);
		РассчитатьКоличествоСтрок(ЭтотОбъект);
		
	КонецЕсли;
	
	Если ПланИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
		УстановитьПометку(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьКомандуИзменитьВыделенные(Команда)
	
	ИмяКоманды = Команда.Имя;
	ИмяДействияКоманды = НРег(СтрЗаменить(ИмяКоманды, "ИзменитьВыделенные_", ""));
	
	Для каждого Действие Из ДействияИзменить Цикл
		ПредставлениеДействия = НРег(Действие.Представление);
		ПредставлениеДействия = СтрЗаменить(ПредставлениеДействия, " ", "");
		Если ИмяДействияКоманды = ПредставлениеДействия Тогда
			ПланИзменениеСтрокДействие = Действие.Значение;
			ОбработатьВыборДействия();
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПланированияПометкаПриИзменении(Элемент)
	
	ЗапасыПометкаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПланированияСнятьФлажки(Команда)
	УстановитьПометку(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПланированияУстановитьФлажки(Команда)
	УстановитьПометку(Истина);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьКомментарий(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗапасыПометкаПриИзмененииНаСервере()
	
	ГрупповоеИзменениеСтрокСервер.СтрокаПометкаПриИзменении(ТаблицаПланирования, Элементы.ТаблицаПланированияУстановитьФлажки,
		Элементы.ТаблицаПланированияСнятьФлажки, Элементы.ТаблицаПланированияИзменитьВыделенные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДействия()
	
	Действия = ДействияИзменить.ВыгрузитьЗначения();
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидДействия", ПланИзменениеСтрокДействие);
	ПараметрыФормы.Вставить("Действия", Действия);
	ПараметрыФормы.Вставить("Источник", ЭтотОбъект.УникальныйИдентификатор);
	ПараметрыФормы.Вставить("ИмяФормыИсточника", "ПланПродаж");
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборДействияЗавершение", ЭтотОбъект, ПараметрыФормы);
	УправлениеРезервнымиКопиямиТаблицы(1, Ложь, "ТаблицаПланирования");
	ОткрытьФорму("ОбщаяФорма.ИзменитьВыделенные", ПараметрыФормы, ЭтотОбъект, , , , Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеРезервнымиКопиямиТаблицы(СостояниеПерехода, ИзменяетДанные, ИмяТЧ)
	
	УстанавливатьПометки = Ложь;
	
	ГрупповоеИзменениеСтрокСервер.УправлениеРезервнымиКопиями(
		ЭтотОбъект,
		ЭтотОбъект[ИмяТЧ],
		ЭтотОбъект[ИмяТЧ + "РезервнаяКопияТаблицыАдрес"],
		СостояниеПерехода,
		ИзменяетДанные,
		УстанавливатьПометки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДействияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ОтменаИзменений Тогда
		ОбработатьВыборДействияЗавершениеНаСервереПриОтмене("ТаблицаПланирования");
		Возврат;
	КонецЕсли;
	
	ОбработатьИзменениеСтрок(Результат.Действие, Результат.Значение);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборДействияЗавершениеНаСервереПриОтмене(ИмяТЧ)
	
	УправлениеРезервнымиКопиямиТаблицы(0, Ложь, ИмяТЧ);
	РассчитатьИтогПоДокументу(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСтрок(Действие, Значение)
	
	Модифицированность = Истина;
	
	ПланИзменениеСтрокДействие = Действие;
	ПланИзменениеСтрокЗначение = Значение;
	
	Если Не ЭтоИнтерфейсТакси Тогда
		
		ОтмеченныеСтроки = ТаблицаПланирования.НайтиСтроки(Новый Структура("Пометка", Истина));
		Для Каждого СтрокаТЗ Из ОтмеченныеСтроки Цикл
			СтрокаТЗ.Пометка = Ложь;
		КонецЦикла;
		
		ВыделенныеСтроки = Элементы.ТаблицаПланирования.ПолучитьСтрокиДляОбработки();
		Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
			ТаблицаПланирования.НайтиПоИдентификатору(ВыделеннаяСтрока).Пометка = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	ПланВыполнитьДействие("");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДействияИзменить(Действия)
	
	ДействияИзменить.Очистить();
	
	ПрефиксКоманд = "ИзменитьВыделенные_";
	ПодменюИзменитьВыделенные = Элементы.ТаблицаПланированияИзменитьВыделенные;
	
	ЭлементыИзменитьВыделенные = ПодменюИзменитьВыделенные.ПодчиненныеЭлементы;
	Для Каждого ЭлементПодменю Из ЭлементыИзменитьВыделенные Цикл
		ЭлементПодменю.Видимость = Ложь;
	КонецЦикла;
	
	Для каждого Действие Из Действия Цикл
		
		Если Действие = Перечисления.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента Тогда
			Продолжить;
		КонецЕсли;
		
		ДействиеОписание = НестандартныйЗаголовокДействия(Действие);
		Если ДействиеОписание = Неопределено Тогда
			ДействиеОписание = ГрупповоеИзменениеСтрокСервер.ПредставлениеДействия(Действие);
		КонецЕсли;
		Если ПустаяСтрока(ДействиеОписание) Тогда
			ДействиеОписание = Действие;
		КонецЕсли;
		Если ПустаяСтрока(ДействиеОписание) Тогда
			Продолжить;
		КонецЕсли;
		
		ДействияИзменить.Добавить(Действие, ДействиеОписание);
		
		ИмяКоманды = ПрефиксКоманд + СтрЗаменить(ДействиеОписание, " ", "");
		КомандаСуществует = ЭтотОбъект.Команды.Найти(ИмяКоманды) <> Неопределено;
		Если Не КомандаСуществует Тогда
			НоваяКоманда = ЭтотОбъект.Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Заголовок = ДействиеОписание; 
			
			НоваяКоманда.Действие = "Подключаемый_ОбработатьКомандуИзменитьВыделенные";
			НоваяКоманда.ИспользуемаяТаблица = Элементы.ТаблицаПланирования;
			НоваяКоманда.ИспользованиеВыделенныхСтрок = ИспользованиеВыделенныхСтрок.Использует;
			НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
			
			НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ПодменюИзменитьВыделенные);
			НовыйЭлемент.ИмяКоманды = ИмяКоманды;
			НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		Иначе
			СуществующийЭлемент = Элементы.Найти(ИмяКоманды);
			Если СуществующийЭлемент <> Неопределено Тогда
				СуществующийЭлемент.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НестандартныйЗаголовокДействия(Действие)
	
	Если Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
		Возврат НСтр("ru='Изменить суммы на процент'");
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
		Возврат НСтр("ru='Установить количество для всех периодов'");
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
		Возврат НСтр("ru='Установить сумму для всех периодов'");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Если ЭтоИнтерфейсТакси Тогда
		
		Элементы.Комментарий.КнопкаВыбора = Истина;
		
		Элементы.ТаблицаПланированияИзменитьВыделенные.Видимость = Ложь;
		Элементы.ТаблицаПланированияПометка.Видимость = Истина;
		Элементы.ТаблицаПланированияПометка.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
		Элементы.ТаблицаПланированияУстановитьФлажки.Видимость = Истина;
		Элементы.ПодвалСвернут.Видимость = Ложь;
	Иначе
		Элементы.ШапкаЛево.Ширина = 48;
		Элементы.НачалоПланирования.Ширина = 0;
	КонецЕсли; 
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		Элементы.ГруппаНомерДата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		Элементы.ШапкаОбертка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		Элементы.Шапка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
     	Элементы.Группа1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно; 
		Элементы.УстановитьПериод.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		Элементы.ПодвалСвернут.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваСвернутогоПодвала()
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	ОпределяющиеЭлементы = "Итоги,ПланИтогСумма";
	РаботаСФормойДокумента.УстановитьСвойстваСвернутогоПодвала(ЭтотОбъект, ОпределяющиеЭлементы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект,
		"ТаблицаПланированияХарактеристика",
		"ТаблицаПланирования.ИспользуютсяХарактеристики");
	
	// Минимальные цены
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
		"ТаблицаПланирования.Цена", 
		Новый ПолеКомпоновкиДанных("ТаблицаПланирования.МинимальнаяЦена"), ВидСравненияКомпоновкиДанных.Меньше);
		
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ТаблицаПланированияЦена");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Красный);
	
	Использование = ?(КэшЗначений.Свойство("ИспользоватьМинимальныеЦены"), КэшЗначений.ИспользоватьМинимальныеЦены, Ложь);
	НовоеУсловноеОформление.Использование = Использование;

КонецПроцедуры

// Устанавливаем условное оформление для характеристик номенклатуры
//
// Параметры:
// 		Форма - Форма - Содержит данную форму 
// 		ИмяПоляВводаХарактеристики - Строка - Наименование элемента формы, содержащего характеристики номенклатуры,
//											   если оно отличается от "ТоварыХарактеристика"
// 		ПутьКПолюОтбора - Строка - Полный путь к реквизиту "характеристики используются",
//									если он отличается от "Объект.Товары.ХарактеристикиИспользуются"
// 
&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформлениеХарактеристикНоменклатуры(Форма,
	                                                            ИмяПоляВводаХарактеристики = "ТоварыХарактеристика",
																ПутьКПолюОтбора = "Объект.Товары.ХарактеристикиИспользуются") Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Возврат;
	КонецЕсли;
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаХарактеристики].Имя);
	
	ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПланирования.ИспользуютсяХарактеристики");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",				ЦветаПалитры.Серый60УНФ);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",	Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",					НСтр("ru='<характеристики не используются>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",			Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	
	ЦветФонаПоля = ЦветаПалитры.БелыйУНФ;
	ЦветФонаАктивногоПоля = ЦветаПалитры.Оранжевый40УНФ;
	Элементы.СценарийПланирования.ЦветФона = ЦветФонаАктивногоПоля;
	
	УчетВалютныхОпераций		= ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	ИспользоватьХарактеристики	= ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	ПрочитатьРеквизитыСценария(РеквизитыСценария, Объект.СценарийПланирования);
	СохранитьЗначенияРеквизитовОбъекта(ЭтотОбъект);
	
	ОбновитьСтруктуруТаблицыПланирования();
	ЗаполнитьКроссТаблицуПланированияИзТаблицы(Объект.Запасы);
	ЗаполнитьИспользованиеХарактеристикДляНоменклатуры();
	
	СформироватьНадписьЦеныИВалюта(ЭтотОбъект);
	
	// ГрупповоеИзменениеСтрок
	ЗаполнитьСписокДействийГрупповогоИзменения();
	// Конец ГрупповоеИзменениеСтрок
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьРеквизитыСценария(СтруктураРеквизитов, знач Сценарий)
	
	Реквизиты = "Периодичность, ИзмерениеПланирования, ДетализироватьДоЗаказа, ПланироватьКоличество";
	Если СтруктураРеквизитов = Неопределено Тогда
		СтруктураРеквизитов = Новый Структура(Реквизиты);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сценарий) Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сценарий, Реквизиты));
		СтруктураРеквизитов.Вставить("ПредставлениеИзмерения", Строка(СтруктураРеквизитов.ИзмерениеПланирования));
	Иначе
		СтруктураРеквизитов.Периодичность			= Перечисления.Периодичность.ПустаяСсылка();
		СтруктураРеквизитов.ИзмерениеПланирования	= Перечисления.ИзмеренияПланирования.ПустаяСсылка();
		СтруктураРеквизитов.ДетализироватьДоЗаказа	= Ложь;
		СтруктураРеквизитов.ПланироватьКоличество	= Ложь;
		СтруктураРеквизитов.Вставить("ПредставлениеИзмерения", "");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьЗначенияРеквизитовОбъекта(Форма)
	
	Реквизиты = "СценарийПланирования, НачалоПланирования, ОкончаниеПланирования";
	Если Форма.РеквизитыДоИзменения = Неопределено Тогда
		Форма.РеквизитыДоИзменения = Новый Структура(Реквизиты);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Форма.РеквизитыДоИзменения, Форма.Объект, Реквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтруктуруТаблицыПланирования()
	
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	
	// 1. Удаление ранее добавленных элементов формы
	Для Индекс = 0 По Периоды.Количество()-1 Цикл
		ИмяГруппыКолонокПериода = "ТаблицаПланированияПериод_" + Индекс;
		Элементы.Удалить(Элементы[ИмяГруппыКолонокПериода]);
	КонецЦикла;
	
	// 2. Удаление ранее добавленных реквизитов таблицы формы
	РеквизитыПланирования = ПолучитьРеквизиты("ТаблицаПланирования");
	
	Для Каждого РеквизитПланирования Из РеквизитыПланирования Цикл
		Если СтрНачинаетсяС(РеквизитПланирования.Имя, "КолонкаКоличество_")
			Или СтрНачинаетсяС(РеквизитПланирования.Имя, "КолонкаСумма_") Тогда
			
			УдаляемыеРеквизиты.Добавить("ТаблицаПланирования." + РеквизитПланирования.Имя);
			
		КонецЕсли;
	КонецЦикла;
	
	// 3. Разбивка по периодам
	ТаблицаПериодов = РеквизитФормыВЗначение("Периоды");
	ЗаполнитьТаблицуПериодов(ТаблицаПериодов, Объект.НачалоПланирования, Объект.ОкончаниеПланирования, РеквизитыСценария.Периодичность);
	ПроверитьКоличествоПериодов(ТаблицаПериодов);
	ЗначениеВРеквизитФормы(ТаблицаПериодов, "Периоды");
	
	// 4. Добавление реквизитов таблицы формы
	Число_15_2 = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2, ДопустимыйЗнак.Неотрицательный);
	Число_15_3 = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3, ДопустимыйЗнак.Неотрицательный);
	
	Для Индекс = 0 По Периоды.Количество()-1 Цикл
		
		Если РеквизитыСценария.ПланироватьКоличество Тогда
			
			РеквизитФормы = Новый РеквизитФормы("КолонкаКоличество_" + Индекс, Число_15_3, "ТаблицаПланирования", НСтр("ru='Количество'"), Истина);
			ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
			
		КонецЕсли;
		
		РеквизитФормы = Новый РеквизитФормы("КолонкаСумма_" + Индекс, Число_15_2, "ТаблицаПланирования", НСтр("ru='Сумма'"), Истина);
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	// 5. Добавление элементов формы
	Для Индекс = 0 По Периоды.Количество()-1 Цикл
		
		ГруппаКолонок = Элементы.Добавить("ТаблицаПланированияПериод_" + Индекс, Тип("ГруппаФормы"), Элементы.ТаблицаПланирования);
		ГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;
		ГруппаКолонок.Группировка = ГруппировкаКолонок.Горизонтальная;
		ГруппаКолонок.ОтображатьВШапке = Истина;
		ГруппаКолонок.Заголовок = Периоды.Получить(Индекс).ЗаголовокКолонки;
		
		Если РеквизитыСценария.ПланироватьКоличество Тогда
			
			НовыйЭлемент = Элементы.Добавить("КолонкаКоличество_" + Индекс, Тип("ПолеФормы"), ГруппаКолонок);
			НовыйЭлемент.ПутьКДанным = "ТаблицаПланирования." + "КолонкаКоличество_" + Индекс;
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Ширина = 10;
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_КолонкаКоличествоПриИзменении");
			
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить("КолонкаСумма_" + Индекс, Тип("ПолеФормы"), ГруппаКолонок);
		НовыйЭлемент.ПутьКДанным = "ТаблицаПланирования." + "КолонкаСумма_" + Индекс;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.ОтображатьВШапке = РеквизитыСценария.ПланироватьКоличество;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_КолонкаСуммаПриИзменении");
		
	КонецЦикла;
	
	// 6. Сдвиг итоговых показатели в конец таблицы
	Элементы.Переместить(Элементы.ТаблицаПланированияВсегоКоличество, Элементы.ТаблицаПланирования);
	Элементы.Переместить(Элементы.ТаблицаПланированияВсегоСумма, Элементы.ТаблицаПланирования);
	Элементы.Переместить(Элементы.ТаблицаПланированияРастяжение, Элементы.ТаблицаПланирования);
	
КонецПроцедуры

// Процедура заполняет таблицу периодов, последовательно датам с заданной периодичностью, для получения полей и их заголовков
//
// Параметры:
//  ТаблицаПериоды - ТаблицаЗначений - Таблица, которую заполняем отрезками заданной периодичности
//  ДатаНачала     - Дата - Дата начала периода
//  ДатаОкончания  - Дата - Дата окончания периода
//  Периодичность  - ПеречислениеСсылка.Периодичность - Периодичность с которой нужно заполнить таблицу
&НаСервереБезКонтекста
Процедура ЗаполнитьТаблицуПериодов(ТаблицаПериоды, Знач ДатаНачала, Знач ДатаОкончания, Знач Периодичность)
	
	ТаблицаПериоды.Очистить();
	
	Если Не ЗначениеЗаполнено(Периодичность)
		Или Не ЗначениеЗаполнено(ДатаНачала)
		Или НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		Возврат;
	КонецЕсли;
	
	ДобавлениеДатаНачала = ПланированиеКлиентСервер.РассчитатьДатуНачалаПериода(ДатаНачала, Периодичность);
	ДобавлениеДатаОкончания = ПланированиеКлиентСервер.РассчитатьДатуОкончанияПериода(ДатаНачала, Периодичность, 1);
	
	Пока ДобавлениеДатаНачала < КонецДня(ДатаОкончания) Цикл
		
		НоваяСтрока = ТаблицаПериоды.Добавить();
		НоваяСтрока.ДатаНачала = ДобавлениеДатаНачала;
		НоваяСтрока.ДатаОкончания = ДобавлениеДатаОкончания;
		НоваяСтрока.ЗаголовокКолонки = ПланированиеКлиентСервер.СформироватьЗаголовокПериода(ДобавлениеДатаНачала,
			ДобавлениеДатаОкончания, Периодичность);
		
		ДобавлениеДатаНачала = ПланированиеКлиентСервер.РассчитатьДатуНачалаПериода(ДобавлениеДатаОкончания + 1,
			Периодичность);
		ДобавлениеДатаОкончания = ПланированиеКлиентСервер.РассчитатьДатуОкончанияПериода(ДобавлениеДатаОкончания + 1,
			Периодичность, 1);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИспользованиеХарактеристикДляНоменклатуры()
	
	Если Не ИспользоватьХарактеристики
		Или Не РеквизитыСценария.ИзмерениеПланирования = Перечисления.ИзмеренияПланирования.Номенклатура Тогда
		
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНомераСтрокТаблицы(ЭтотОбъект);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Таблица.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Таблица.ОбъектПланирования КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ втТаблицаНоменклатуры
		|ИЗ
		|	&КоллекцияДанных КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки,
		|	втТаблицаНоменклатуры.Номенклатура.ИспользоватьХарактеристики КАК ИспользуютсяХарактеристики
		|ИЗ
		|	втТаблицаНоменклатуры КАК втТаблицаНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("КоллекцияДанных", ТаблицаПланирования.Выгрузить(,"НомерСтроки, ОбъектПланирования"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Для Индекс = 0 По ТаблицаПланирования.Количество()-1 Цикл
		Выборка.Следующий(); // Количество строк в выборке по запросу всегда равно количеству строк в коллекции
		ЗаполнитьЗначенияСвойств(ТаблицаПланирования[Индекс], Выборка, "ИспользуютсяХарактеристики");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСценарияСервер()
	
	СохранитьЗначенияРеквизитовОбъекта(ЭтотОбъект);
	ПрочитатьРеквизитыСценария(РеквизитыСценария, Объект.СценарийПланирования);
	ОбновитьСтруктуруТаблицыПланирования();
	СформироватьНадписьЦеныИВалюта(ЭтотОбъект);
	
	// ГрупповоеИзменениеСтрок
	ЗаполнитьСписокДействийГрупповогоИзменения();
	// Конец ГрупповоеИзменениеСтрок
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПериодаПланированияСервер()
	
	СохранитьЗначенияРеквизитовОбъекта(ЭтотОбъект);
	ОбновитьСтруктуруТаблицыПланирования();
	РассчитатьИтогиПоВсемСтрокам(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	ЭтоПланированиеПоНоменклатуре = РеквизитыСценария.ИзмерениеПланирования = ПредопределенноеЗначение("Перечисление.ИзмеренияПланирования.Номенклатура");
	
	Элементы.ЦеныИВалюта.Видимость = УчетВалютныхОпераций Или РеквизитыСценария.ПланироватьКоличество;
	Элементы.ТаблицаПланированияПодбор.Видимость = ЭтоПланированиеПоНоменклатуре;
	
	Элементы.ТаблицаПланированияОбъектПланирования.Заголовок	= РеквизитыСценария.ПредставлениеИзмерения;
	Элементы.ТаблицаПланированияХарактеристика.Видимость		= ЭтоПланированиеПоНоменклатуре;
	Элементы.ТаблицаПланированияЕдиницаИзмерения.Видимость		= РеквизитыСценария.ПланироватьКоличество;
	Элементы.ТаблицаПланированияЦена.Видимость					= РеквизитыСценария.ПланироватьКоличество;
	Элементы.ТаблицаПланированияВсегоКоличество.Видимость		= РеквизитыСценария.ПланироватьКоличество;
	Элементы.ТаблицаПланированияЗаказПокупателя.Видимость		= РеквизитыСценария.ДетализироватьДоЗаказа;
	
	Если ЗначениеЗаполнено(РеквизитыСценария.ИзмерениеПланирования) Тогда
		
		ОписаниеТипов = ПланированиеКлиентСервер.ОписаниеТипаПланированияПоИзмерению(РеквизитыСценария.ИзмерениеПланирования);
		
		Элементы.ТаблицаПланированияОбъектПланирования.ОграничениеТипа = ОписаниеТипов;
		Элементы.ТаблицаПланированияОбъектПланирования.ВыборГруппИЭлементов = ?(
			РеквизитыСценария.ИзмерениеПланирования = ПредопределенноеЗначение("Перечисление.ИзмеренияПланирования.ГруппаНоменклатуры"),
			ГруппыИЭлементы.Группы,
			ГруппыИЭлементы.Элементы);
		
		Для Каждого СтрокаТаблицы Из ТаблицаПланирования Цикл
			СтрокаТаблицы.ОбъектПланирования = ОписаниеТипов.ПривестиЗначение(СтрокаТаблицы.ОбъектПланирования);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИзКроссТаблицыПланирования(Таблица)
	
	Таблица.Очистить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаПланирования Цикл
		
		Для Индекс = 0 По Периоды.Количество()-1 Цикл
			
			НоваяСтрока = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(
				НоваяСтрока,
				СтрокаТаблицы,
				"ОбъектПланирования, Характеристика, ЕдиницаИзмерения, Цена, ЗаказПокупателя");
			
			НоваяСтрока.ДатаПланирования = Периоды.Получить(Индекс).ДатаНачала;
			НоваяСтрока.Сумма = СтрокаТаблицы["КолонкаСумма_" + Индекс];
			
			Если РеквизитыСценария.ПланироватьКоличество Тогда
				НоваяСтрока.Количество = СтрокаТаблицы["КолонкаКоличество_" + Индекс];
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКроссТаблицуПланированияИзТаблицы(Таблица, ОчищатьПередЗаполнением = Истина)
	
	Если ОчищатьПередЗаполнением Тогда
		ТаблицаПланирования.Очистить();
	КонецЕсли;
	
	Отбор = Новый Структура("ДатаНачала");
	НоваяСтрока = Неопределено;
	
	СвойстваЗаполнения = "ОбъектПланирования";
	Если РеквизитыСценария.ИзмерениеПланирования = Перечисления.ИзмеренияПланирования.Номенклатура Тогда
		СвойстваЗаполнения = СвойстваЗаполнения + ?(ИспользоватьХарактеристики, ",Характеристика", "") + ",ЕдиницаИзмерения";
	КонецЕсли;
	Если РеквизитыСценария.ДетализироватьДоЗаказа Тогда
		СвойстваЗаполнения = СвойстваЗаполнения + ",ЗаказПокупателя";
	КонецЕсли;
	ГруппировкиТаблицы = СтрРазделить(СвойстваЗаполнения, ",");
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		ДобавлятьНовуюСтрокуКроссТаблицы = Ложь;
		Если НоваяСтрока = Неопределено Тогда
			ДобавлятьНовуюСтрокуКроссТаблицы = Истина;
		Иначе
			Для Каждого ГруппировкаТаблицы Из ГруппировкиТаблицы Цикл
				Если СтрокаТаблицы[ГруппировкаТаблицы] <> НоваяСтрока[ГруппировкаТаблицы] Тогда
					ДобавлятьНовуюСтрокуКроссТаблицы = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ДобавлятьНовуюСтрокуКроссТаблицы Тогда
			
			НоваяСтрока = ТаблицаПланирования.Добавить();
			ЗаполнитьЗначенияСвойств(
				НоваяСтрока,
				СтрокаТаблицы,
				СвойстваЗаполнения);
			
		КонецЕсли;
		
		Отбор.ДатаНачала = СтрокаТаблицы.ДатаПланирования;
		НайденныеСтроки = Периоды.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Индекс = Периоды.Индекс(НайденныеСтроки[0]);
			НоваяСтрока["КолонкаСумма_" + Индекс] = СтрокаТаблицы.Сумма;
			
			Если РеквизитыСценария.ПланироватьКоличество Тогда
				НоваяСтрока["КолонкаКоличество_" + Индекс] = СтрокаТаблицы.Количество;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьНомераСтрокТаблицы(ЭтотОбъект);
	РассчитатьКоличествоСтрок(ЭтотОбъект);
	РассчитатьИтогиПоВсемСтрокам(ЭтотОбъект);
	
	Если РеквизитыСценария.ПланироватьКоличество Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаПланирования Цикл
			Если СтрокаТаблицы.ВсегоКоличество > 0 Тогда
				СтрокаТаблицы.Цена = СтрокаТаблицы.ВсегоСумма / СтрокаТаблицы.ВсегоКоличество;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьНадписьЦеныИВалюта(Форма)
	
	Объект = Форма.Объект;
	
	ТекстНадписи = "";
	
	// Валюта.
	Если Форма.УчетВалютныхОпераций Тогда
		Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
			ТекстНадписи = НСтр("ru = '%Валюта%'");
			Если Объект.ВалютаДокумента <> УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту() Тогда
				ТекстНадписи = ТекстНадписи + НСтр("ru = ' %Курс%'");
				ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(УправлениеНебольшойФирмойПовтИсп.ПолучитьСимвольноеПредставлениеВалюты(Объект.ВалютаДокумента)));
				ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Курс%", СокрЛП(Строка(Объект.Курс)));
			Иначе
				ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(Строка(Объект.ВалютаДокумента)));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Вид цен.
	Если Форма.РеквизитыСценария.ПланироватьКоличество И ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ru = '%ВидЦен%'");
		Иначе	
			ТекстНадписи = ТекстНадписи + НСтр("ru = ' • %ВидЦен%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидЦен%", СокрЛП(Строка(Объект.ВидЦен)));
	КонецЕсли;
	
	Форма.ЦеныИВалюта = ТекстНадписи;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтруктуруПересчетаЦены(Объект, СтрокаТЧ)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидЦен", Объект.ВидЦен);
	Результат.Вставить("ДатаОбработки", Объект.Дата);
	Результат.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	Результат.Вставить("Номенклатура", СтрокаТЧ.ОбъектПланирования);
	Результат.Вставить("Характеристика", СтрокаТЧ.Характеристика);
	Результат.Вставить("Коэффициент", 1);
	
	ЦенообразованиеКлиентСервер.ДополнитьСтруктуруДанныхНоменклатурыПолямиЦенообразования(Объект, Неопределено, Результат);
	
	Результат.Вставить("МинимальнаяЦена", ЦенообразованиеСервер.ПолучитьМинимальнуюЦенуНоменклатуры(Результат));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПолучитьДанныеСервер(Действия)
	
	Если Действия.Свойство("ЕдиницаИзмерения") Тогда
		Действия.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Действия.ЕдиницаИзмерения,
			"ЕдиницаИзмерения");
	КонецЕсли;
	
	Если Действия.Свойство("ИспользуютсяХарактеристики") Тогда
		Действия.ИспользуютсяХарактеристики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Действия.ИспользуютсяХарактеристики, "ИспользоватьХарактеристики");
	КонецЕсли;
	
	Если Действия.Свойство("Цена") Тогда
		
		Если Действия.Цена.Свойство("МинимальнаяЦена") Тогда
			Действия.Вставить("МинимальнаяЦена", Действия.Цена.МинимальнаяЦена);
		КонецЕсли;
		
		Действия.Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(Действия.Цена);
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтношениеКоэффициентовЕдиницИзмерения(ПредыдущаяЕдиницаИзмерения, НоваяЕдиницаИзмерения)
	
	КоэффициентПредыдущейЕдиницыИзмерения = ?(
		ТипЗнч(ПредыдущаяЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"),
		1,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредыдущаяЕдиницаИзмерения, "Коэффициент"));
	
	КоэффициентНовойЕдиницыИзмерения = ?(
		ТипЗнч(НоваяЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"),
		1,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяЕдиницаИзмерения, "Коэффициент"));
	
	Если КоэффициентПредыдущейЕдиницыИзмерения = 0 Тогда
		Возврат 1;
	КонецЕсли;
	
	Возврат КоэффициентНовойЕдиницыИзмерения / КоэффициентПредыдущейЕдиницыИзмерения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПланПродаж(РезультатРасчета)
	
	Если Не ЭтоАдресВременногоХранилища(РезультатРасчета.АдресВХранилище) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЗаполнения = ПолучитьИзВременногоХранилища(РезультатРасчета.АдресВХранилище);
	
	ЗаполнитьКроссТаблицуПланированияИзТаблицы(ТаблицаЗаполнения, РезультатРасчета.ОчищатьПередЗаполнением);
	ЗаполнитьИспользованиеХарактеристикДляНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЦены(ВидЦен = Неопределено, ПараметрыОтбора = Неопределено)
	
	Если Не РеквизитыСценария.ПланироватьКоличество
		Или Не РеквизитыСценария.ИзмерениеПланирования = Перечисления.ИзмеренияПланирования.Номенклатура Тогда
		
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНомераСтрокТаблицы(ЭтотОбъект);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Таблица.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Таблица.ОбъектПланирования КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Таблица.Характеристика,
		|	Таблица.ЕдиницаИзмерения
		|ПОМЕСТИТЬ втТаблицаНоменклатуры
		|ИЗ
		|	&КоллекцияДанных КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦен.ВалютаЦены КАК ВалютаЦены,
		|	МинимальныеЦеныНоменклатурыСрезПоследних.ВидЦен.ВалютаЦены КАК ВалютаМинимальнойЦены,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦен.ПорядокОкругления КАК ПорядокОкругления,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦен.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
		|			ТОГДА ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентЕдиницыИзмеренияВЦенах,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(МинимальныеЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
		|			ТОГДА ВЫРАЗИТЬ(МинимальныеЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентЕдиницыИзмеренияВМинимальныхЦенах,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(втТаблицаНоменклатуры.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаНоменклатуры.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентЕдиницыИзмеренияВДокументе,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(МинимальныеЦеныНоменклатурыСрезПоследних.Цена, 0) КАК МинимальнаяЦена
		|ПОМЕСТИТЬ втЦены
		|ИЗ
		|	втТаблицаНоменклатуры КАК втТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&ДатаСреза,
		|				(Номенклатура, Характеристика) В
		|						(ВЫБРАТЬ
		|							втТаблицаНоменклатуры.Номенклатура,
		|							втТаблицаНоменклатуры.Характеристика
		|						ИЗ
		|							втТаблицаНоменклатуры)
		|					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО втТаблицаНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И втТаблицаНоменклатуры.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|			И (ЦеныНоменклатурыСрезПоследних.Актуальность = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&ДатаСреза,
		|				(Номенклатура, Характеристика) В
		|						(ВЫБРАТЬ
		|							втТаблицаНоменклатуры.Номенклатура,
		|							втТаблицаНоменклатуры.Характеристика
		|						ИЗ
		|							втТаблицаНоменклатуры)
		|					И ВидЦен = &МинимальныйВидЦен) КАК МинимальныеЦеныНоменклатурыСрезПоследних
		|		ПО втТаблицаНоменклатуры.Номенклатура = МинимальныеЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И втТаблицаНоменклатуры.Характеристика = МинимальныеЦеныНоменклатурыСрезПоследних.Характеристика
		|			И (МинимальныеЦеныНоменклатурыСрезПоследних.Актуальность = ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЦены.НомерСтроки КАК НомерСтроки,
		|	втЦены.ПорядокОкругления КАК ПорядокОкругления,
		|	втЦены.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
		|	втЦены.Цена * ЕСТЬNULL(КурсыВалютыВидЦены.Курс, 1) * ЕСТЬNULL(КурсыВалютыДокумента.Кратность, 1) / (ЕСТЬNULL(КурсыВалютыДокумента.Курс, 1) * ЕСТЬNULL(КурсыВалютыВидЦены.Кратность, 1)) * втЦены.КоэффициентЕдиницыИзмеренияВДокументе / втЦены.КоэффициентЕдиницыИзмеренияВЦенах КАК Цена,
		|	втЦены.МинимальнаяЦена * ЕСТЬNULL(КурсыВалютыМинимальныйВидЦены.Курс, 1) * ЕСТЬNULL(КурсыВалютыДокумента.Кратность, 1) / (ЕСТЬNULL(КурсыВалютыДокумента.Курс, 1) * ЕСТЬNULL(КурсыВалютыМинимальныйВидЦены.Кратность, 1)) * втЦены.КоэффициентЕдиницыИзмеренияВДокументе / втЦены.КоэффициентЕдиницыИзмеренияВМинимальныхЦенах КАК МинимальнаяЦена
		|ИЗ
		|	втЦены КАК втЦены
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаСреза, Валюта = &ВалютаДокумента) КАК КурсыВалютыДокумента
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&ДатаСреза,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						втЦены.ВалютаЦены
		|					ИЗ
		|						втЦены)) КАК КурсыВалютыВидЦены
		|		ПО втЦены.ВалютаЦены = КурсыВалютыВидЦены.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&ДатаСреза,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						втЦены.ВалютаЦены
		|					ИЗ
		|						втЦены)) КАК КурсыВалютыМинимальныйВидЦены
		|		ПО втЦены.ВалютаЦены = КурсыВалютыМинимальныйВидЦены.Валюта
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("КоллекцияДанных", ТаблицаПланирования.Выгрузить(ПараметрыОтбора, "НомерСтроки, ОбъектПланирования, Характеристика, ЕдиницаИзмерения"));
	Запрос.УстановитьПараметр("ДатаСреза", Объект.Дата);
	Запрос.УстановитьПараметр("ВалютаДокумента", Объект.ВалютаДокумента);
	Запрос.УстановитьПараметр("ВидЦен", ?(ВидЦен = Неопределено, Объект.ВидЦен, ВидЦен));
	Запрос.УстановитьПараметр("МинимальныйВидЦен", ЦенообразованиеСерверПовтИсп.ПолучитьОбщийВидМинимальныхЦен());

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ПараметрыОтбора = Неопределено Тогда
		ЗаполняемаяКоллекция = ТаблицаПланирования;
	Иначе
		ЗаполняемаяКоллекция = ТаблицаПланирования.НайтиСтроки(ПараметрыОтбора);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ЗаполняемаяКоллекция Цикл
		Выборка.Следующий(); // Количество строк в выборке по запросу всегда равно количеству строк в коллекции
		Цена = Выборка.Цена;
		
		Если КэшЗначений.ИспользоватьМинимальныеЦены Тогда
			
			СтрокаТаблицы.МинимальнаяЦена = Выборка.МинимальнаяЦена;
			
			Если Выборка.Цена < Выборка.МинимальнаяЦена Тогда
				
				Цена = Выборка.МинимальнаяЦена;
				
			КонецЕсли;
			
		КонецЕсли;
		СтрокаТаблицы.Цена = ЦенообразованиеСервер.ОкруглитьЦену(
			Цена,
			Выборка.ПорядокОкругления,
			Выборка.ОкруглятьВБольшуюСторону);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодбор(АдресВХранилище)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	Для Каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		НоваяСтрока = ТаблицаПланирования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		НоваяСтрока.ОбъектПланирования	= СтрокаЗагрузки.Номенклатура;
		
		Если РеквизитыСценария.ПланироватьКоличество И Периоды.Количество() > 0 Тогда
			НоваяСтрока["КолонкаКоличество_0"]	= СтрокаЗагрузки.Количество;
			НоваяСтрока["КолонкаСумма_0"]		= СтрокаЗагрузки.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	ЦенообразованиеСервер.ДобавитьКолонкуИЗаполнитьМинимальныеЦеныВТЧ(ЭтотОбъект, "ТаблицаПланирования");

	РассчитатьКоличествоСтрок(ЭтотОбъект);
	РассчитатьИтогиПоВсемСтрокам(ЭтотОбъект);
	
	Если РеквизитыСценария.ПланироватьКоличество Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаПланирования Цикл
			Если СтрокаТаблицы.ВсегоКоличество > 0 Тогда
				СтрокаТаблицы.Цена = СтрокаТаблицы.ВсегоСумма / СтрокаТаблицы.ВсегоКоличество;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьИспользованиеХарактеристикДляНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКоличествоПериодов(ТаблицаПериодов)
	
	МаксКоличествоПериодов = 60; // Ограничение производительности формы
	
	Если ТаблицаПериодов.Количество() > МаксКоличествоПериодов Тогда
		
		Пока ТаблицаПериодов.Количество() > МаксКоличествоПериодов Цикл
			ТаблицаПериодов.Удалить(ТаблицаПериодов.Количество()-1);
		КонецЦикла;
		
		Объект.ОкончаниеПланирования = ТаблицаПериодов[ТаблицаПериодов.Количество()-1].ДатаОкончания;
		СохранитьЗначенияРеквизитовОбъекта(ЭтотОбъект);
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Выбран слишком большой период. Период окончания был изменен.
				|Для планирования на длительный срок, вы можете ввести несколько планов продаж или выбрать сценарий с большей периодичностью.'"), , , "Объект.ОкончаниеПланирования");
		
	КонецЕсли;
	
КонецПроцедуры

// Получает набор данных с сервера для процедуры ДатаПриИзменении.
//
&НаСервереБезКонтекста
Функция ДанныеДляИзмененияДаты(ДатаНовая, ВалютаРасчетов)
	
	ВалютаКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаНовая, Новый Структура("Валюта", ВалютаРасчетов));
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"ВалютаКурсКратность",
		ВалютаКурсКратность);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ДокументыУНФ.ОрганизацияПриИзменении(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКурсКратность()
	
	КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	Объект.Курс = КурсКратность.Курс;
	Объект.Кратность = КурсКратность.Кратность;
	
КонецПроцедуры

// Округляет число по заданному порядку.
// Требуется для использования на клиенте без серверного вызова.
// См. ЦенообразованиеСервер.ОкруглитьЦену
//
// Параметры:
//  Число        - Число - которое необходимо округлить
//  ПорядокОкругления - Перечисления.ПорядкиОкругления - порядок округления
//  ОкруглятьВБольшуюСторону - Булево - округления в большую сторону.
//
// Возвращаемое значение:
//  Число        - результат округления.
//
&НаКлиенте
Функция ОкруглитьЦену(Число, ПравилоОкругления, ОкруглятьВБольшуюСторону) 
	
	Перем Результат; // Возвращаемый результат.
	
	// Преобразуем порядок округления числа.
	// Если передали пустое значение порядка, то округлим до копеек. 
	Если НЕ ЗначениеЗаполнено(ПравилоОкругления) Тогда
		ПорядокОкругления = ПредопределенноеЗначение("Перечисление.ПорядкиОкругления.Окр0_01");
	Иначе
		ПорядокОкругления = ПравилоОкругления;
	КонецЕсли;
	Порядок = Число(Строка(ПорядокОкругления));
	
	// вычислим количество интервалов, входящих в число
	КоличествоИнтервал	= Число / Порядок;
	
	// вычислим целое количество интервалов.
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервал);
	
	Если КоличествоИнтервал = КоличествоЦелыхИнтервалов Тогда
		
		// Числа поделились нацело. Округлять не нужно.
		Результат	= Число;
	Иначе
		Если ОкруглятьВБольшуюСторону Тогда
			
			// При порядке округления "0.05" 0.371 должно округлиться до 0.4
			Результат = Порядок * (КоличествоЦелыхИнтервалов + 1);
		Иначе
			
			// При порядке округления "0.05" 0.371 должно округлиться до 0.35,
			// а 0.376 до 0.4
			Результат = Порядок * Окр(КоличествоИнтервал, 0, РежимОкругления.Окр15как20);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РасчетныеПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНомераСтрокТаблицы(Форма)
	
	НомерСтроки = 0;
	Для Каждого СтрокаТаблицы Из Форма.ТаблицаПланирования Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаТаблицы.НомерСтроки = НомерСтроки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьКоличествоСтрок(Форма)
	
	Форма.ПланКоличествоСтрок = Форма.ТаблицаПланирования.Количество();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтогиВСтроке(СтрокаТаблицы, Периоды)
	
	СтрокаТаблицы.ВсегоКоличество	= 0;
	СтрокаТаблицы.ВсегоСумма		= 0;
	
	Для Индекс = 0 По Периоды.Количество()-1 Цикл
		
		ЗначениеКолонки = 0;
		
		Если СтрокаТаблицы.Свойство("КолонкаКоличество_" + Индекс, ЗначениеКолонки) Тогда
			СтрокаТаблицы.ВсегоКоличество = СтрокаТаблицы.ВсегоКоличество + ЗначениеКолонки;
		КонецЕсли;
		
		Если СтрокаТаблицы.Свойство("КолонкаСумма_" + Индекс, ЗначениеКолонки) Тогда
			СтрокаТаблицы.ВсегоСумма = СтрокаТаблицы.ВсегоСумма + ЗначениеКолонки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтогиПоВсемСтрокам(Форма)
	
	Для Каждого СтрокаТаблицы Из Форма.ТаблицаПланирования Цикл
		РассчитатьИтогиВСтроке(СтрокаТаблицы, Форма.Периоды);
	КонецЦикла;
	
	РассчитатьИтогПоДокументу(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммуВСтрокеПоКоличествуИЦене(СтрокаТаблицы, Периоды)
	
	Для Индекс = 0 По Периоды.Количество()-1 Цикл
		СтрокаТаблицы["КолонкаСумма_" + Индекс] = СтрокаТаблицы["КолонкаКоличество_" + Индекс] * СтрокаТаблицы.Цена;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммуПоВсемСтрокамПоКоличествуИЦене(Форма)
	
	Для Каждого СтрокаТаблицы Из Форма.ТаблицаПланирования Цикл
		РассчитатьСуммуВСтрокеПоКоличествуИЦене(СтрокаТаблицы, Форма.Периоды);
	КонецЦикла;
	
	РассчитатьИтогПоДокументу(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтогПоДокументу(Форма)
	
	Форма.ПланИтогСумма = Форма.ТаблицаПланирования.Итог("ВсегоСумма");
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерактивныеДействия

&НаКлиенте
Процедура ЗаданВопросОбИзмененииСценария(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("Значение") И Результат.Значение = КодВозвратаДиалога.Да Тогда
		ПриИзмененииСценарияСервер();
		УправлениеФормой();
	Иначе
		Объект.СценарийПланирования = РеквизитыДоИзменения.СценарийПланирования;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериодаПланированияКлиент()
	
	ПланированиеКлиентСервер.УстановитьНачалоОкончаниеПериодаПланирования(РеквизитыСценария.Периодичность, Объект.НачалоПланирования, Объект.ОкончаниеПланирования);
	
	Если Объект.НачалоПланирования <> РеквизитыДоИзменения.НачалоПланирования
		Или Объект.ОкончаниеПланирования <> РеквизитыДоИзменения.ОкончаниеПланирования Тогда
		
		Если ТаблицаПланирования.Количество() > 0
			И (Объект.НачалоПланирования > РеквизитыДоИзменения.НачалоПланирования
				Или Объект.ОкончаниеПланирования < РеквизитыДоИзменения.ОкончаниеПланирования) Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗаданВопросОбИзмененииПериодаПланирования", ЭтотОбъект);
			ТекстВопроса = НСтр("ru='План содержит данные.
				|При продолжении будет изменен состав периодов.
				|
				|Продолжить?'");
			ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
			ПараметрыВопроса.Заголовок = НСтр("ru='Подтверждение изменения периода планирования'");
			ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
			СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ПараметрыВопроса);
			
		Иначе
			
			ПриИзмененииПериодаПланированияСервер();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданВопросОбИзмененииПериодаПланирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("Значение") И Результат.Значение = КодВозвратаДиалога.Да Тогда
		ПриИзмененииПериодаПланированияСервер();
	Иначе
		Объект.НачалоПланирования = РеквизитыДоИзменения.НачалоПланирования;
		Объект.ОкончаниеПланирования = РеквизитыДоИзменения.ОкончаниеПланирования; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	ПриИзмененииПериодаПланированияКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныИВалютаФормаЗакрыта(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		
		Модифицированность = Истина;
		ЗаблокироватьДанныеФормыДляРедактирования();
		
		ЗаполнитьЗначенияСвойств(Объект, Результат, "ВидЦен, ВалютаДокумента");
		ОбновитьКурсКратность();
		
		СформироватьНадписьЦеныИВалюта(ЭтотОбъект);
		
		Если РеквизитыСценария.ПланироватьКоличество
			И (Результат.ПерезаполнитьЦены Или Результат.ПересчитатьЦены) Тогда
			
			Если Результат.ПерезаполнитьЦены Тогда
				ПерезаполнитьЦены();
			КонецЕсли;
			
			РассчитатьСуммуПоВсемСтрокамПоКоличествуИЦене(ЭтотОбъект);
			РассчитатьИтогиПоВсемСтрокам(ЭтотОбъект);
			РассчитатьИтогПоДокументу(ЭтотОбъект);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиЗаполненияПоСхеме(ИмяСхемы, Заголовок = "")
	
	НачальныйОтбор = Новый Структура;
	НачальныйОтбор.Вставить("Организация",			Объект.Организация);
	НачальныйОтбор.Вставить("Подразделение",		Объект.СтруктурнаяЕдиница);
	НачальныйОтбор.Вставить("СценарийПланирования",	Объект.СценарийПланирования);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторВладельца",	УникальныйИдентификатор);
	ПараметрыФормы.Вставить("ИмяМакетаСКД",				ИмяСхемы);
	ПараметрыФормы.Вставить("Заголовок",				Заголовок);
	ПараметрыФормы.Вставить("Периодичность",			РеквизитыСценария.Периодичность);
	ПараметрыФормы.Вставить("ИзмерениеПланирования",	РеквизитыСценария.ИзмерениеПланирования);
	ПараметрыФормы.Вставить("ДетализироватьДоЗаказа",	РеквизитыСценария.ДетализироватьДоЗаказа);
	ПараметрыФормы.Вставить("КоличествоПериодов",		Периоды.Количество());
	ПараметрыФормы.Вставить("НачалоПланирования",		Объект.НачалоПланирования);
	ПараметрыФормы.Вставить("ТекущийДокумент",			Объект.Ссылка);
	ПараметрыФормы.Вставить("НачальныйОтбор",			НачальныйОтбор);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкиЗаполненияФормаЗакрыта", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ПланПродаж.Форма.НастройкиЗаполнения", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗаполненияФормаЗакрыта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ЗаполнитьПланПродаж(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ГрупповоеИзменениеСтрок

&НаСервере
Процедура УстановитьПометку(Пометка)
	
	Для каждого Строка Из ТаблицаПланирования Цикл
		Строка.Пометка = Пометка;
	КонецЦикла;
	
	ГрупповоеИзменениеСтрокСервер.СтрокаПометкаПриИзменении(ТаблицаПланирования, Элементы.ТаблицаПланированияУстановитьФлажки,
		Элементы.ТаблицаПланированияСнятьФлажки, Элементы.ТаблицаПланированияИзменитьВыделенные);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДействийГрупповогоИзменения()
	
	Действия = Новый Массив;
	Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент); 
	Если РеквизитыСценария.ПланироватьКоличество Тогда
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству);
	КонецЕсли;
	
	Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам);
	
	Если РеквизитыСценария.ДетализироватьДоЗаказа Тогда
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПокупателя);
	КонецЕсли;
	
	Если РеквизитыСценария.ИзмерениеПланирования = Перечисления.ИзмеренияПланирования.Номенклатура Тогда
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента);  
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьЦеныПоВиду);
	КонецЕсли;
	
	Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки);

	ЗаполнитьДействияИзменить(Действия);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяТабличнойЧастиПоТипуДокумента(ТипДокумента)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Тип("ДокументСсылка.АктВыполненныхРабот"),	"РаботыИУслуги");
	Соответствие.Вставить(Тип("ДокументСсылка.ЗаказНаПроизводство"),	"Продукция");
	Соответствие.Вставить(Тип("ДокументСсылка.ЗаказПокупателя"),		"Запасы");
	Соответствие.Вставить(Тип("ДокументСсылка.ЗаказПоставщику"),		"Запасы");
	Соответствие.Вставить(Тип("ДокументСсылка.ИнвентаризацияЗапасов"),	"Запасы");
	Соответствие.Вставить(Тип("ДокументСсылка.ОприходованиеЗапасов"),	"Запасы");
	Соответствие.Вставить(Тип("ДокументСсылка.ПеремещениеЗапасов"),		"Запасы");
	Соответствие.Вставить(Тип("ДокументСсылка.ПриходнаяНакладная"),		"Запасы");
	Соответствие.Вставить(Тип("ДокументСсылка.РасходнаяНакладная"),		"Запасы");
	Соответствие.Вставить(Тип("ДокументСсылка.СборкаЗапасов"),			"Продукция");
	Соответствие.Вставить(Тип("ДокументСсылка.СписаниеЗапасов"),		"Запасы");
	Соответствие.Вставить(Тип("ДокументСсылка.СчетНаОплату"),			"Запасы");
	Соответствие.Вставить(Тип("ДокументСсылка.СчетНаОплатуПоставщика"),	"Запасы");
	
	Возврат Соответствие[ТипДокумента];
	
КонецФункции

&НаСервере
Процедура ДобавитьИзДокументаСервер()
	
	Если Не РеквизитыСценария.ИзмерениеПланирования = Перечисления.ИзмеренияПланирования.Номенклатура Тогда
		Возврат;
	КонецЕсли;
	
	ДопустимыеТипыНоменклатуры = Новый Массив;
	ДопустимыеТипыНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Запас);
	ДопустимыеТипыНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	ДопустимыеТипыНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Работа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументТЧ.Номенклатура КАК Номенклатура,
		|	ДокументТЧ.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ДокументТЧ.Количество КАК Количество
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ДокументТЧ
		|ГДЕ
		|	ДокументТЧ.Ссылка = &Документ
		|	И ДокументТЧ.Номенклатура.ТипНоменклатуры В(&ТипыНоменклатуры)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументТЧ.НомерСтроки";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказПокупателя", ПланИзменениеСтрокЗначение.Метаданные().Имя);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Запасы", ИмяТабличнойЧастиПоТипуДокумента(ТипЗнч(ПланИзменениеСтрокЗначение)));
	
	Запрос.УстановитьПараметр("Документ", ПланИзменениеСтрокЗначение);
	Запрос.УстановитьПараметр("ТипыНоменклатуры", ДопустимыеТипыНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаПланирования.Добавить();
		НоваяСтрока.Пометка = Истина;
		НоваяСтрока.ОбъектПланирования = Выборка.Номенклатура;
		
		Если РеквизитыСценария.ПланироватьКоличество И Периоды.Количество() > 0 Тогда
			НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			НоваяСтрока["КолонкаКоличество_0"] = Выборка.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
	ПерезаполнитьЦены(,Новый Структура("Пометка", Истина));
	ЗаполнитьИспользованиеХарактеристикДляНоменклатуры();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
