#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сохраняет описание номенклатуры
//
// Параметры:
//   ДанныеОписания    - см. ОбщегоНазначенияИС.ИнициализироватьДанныеОписанияНоменклатуры.
//   СохраненныеДанные - см. ОбщегоНазначенияИС.ИнициализироватьДанныеОписанияНоменклатуры.
Процедура УстановитьОписание(ДанныеОписания, СохраненныеДанные = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(ДанныеОписания.Номенклатура, Истина);

	Если СохраненныеДанные = Неопределено Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли;
	
	ЕстьЗаписьВРегистре = НаборЗаписей.Выбран();
	
	Если ЕстьЗаписьВРегистре И СохраненныеДанные = Неопределено Тогда

		Если НаборЗаписей.Количество() Тогда
			ЗаписьНабора = НаборЗаписей[0];
		Иначе
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.Номенклатура = ДанныеОписания.Номенклатура;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ЕмкостьПотребительскойУпаковки")
			И ДанныеОписания.ЕмкостьПотребительскойУпаковки <> Неопределено Тогда
			ЗаписьНабора.ЕмкостьПотребительскойУпаковки = ДанныеОписания.ЕмкостьПотребительскойУпаковки;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "КоличествоВПотребительскойУпаковке")
			И ДанныеОписания.КоличествоВПотребительскойУпаковке <> Неопределено Тогда
			ЗаписьНабора.КоличествоВПотребительскойУпаковке = ДанныеОписания.КоличествоВПотребительскойУпаковке;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантЧастичногоВыбытия")
			И ДанныеОписания.ВариантЧастичногоВыбытия <> Неопределено Тогда
			ЗаписьНабора.ВариантЧастичногоВыбытия = ДанныеОписания.ВариантЧастичногоВыбытия;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантИспользованияЕдиницыХранения")
			И ДанныеОписания.ВариантИспользованияЕдиницыХранения <> Неопределено Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = ДанныеОписания.ВариантИспользованияЕдиницыХранения;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ПотребительскаяУпаковка")
			И ДанныеОписания.ПотребительскаяУпаковка <> Неопределено Тогда
			ЗаписьНабора.ПотребительскаяУпаковка = ДанныеОписания.ПотребительскаяУпаковка;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "УпаковкаЧастичногоВыбытия")
			И ДанныеОписания.УпаковкаЧастичногоВыбытия <> Неопределено Тогда
			ЗаписьНабора.УпаковкаЧастичногоВыбытия = ДанныеОписания.УпаковкаЧастичногоВыбытия;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "КлючВидовПродукции")
			И ДанныеОписания.КлючВидовПродукции <> Неопределено Тогда
			ЗаписьНабора.КлючВидовПродукции = ДанныеОписания.КлючВидовПродукции;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ИдентификаторыВидовПродукции")
			И ДанныеОписания.ИдентификаторыВидовПродукции <> Неопределено Тогда
			ЗаписьНабора.ИдентификаторыВидовПродукции = Новый ХранилищеЗначения(ДанныеОписания.ИдентификаторыВидовПродукции);
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ТребуетВзвешивания")
			И ДанныеОписания.ТребуетВзвешивания = Истина Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = Перечисления.ВариантыИспользованияЕдиницыХраненияИС.МернаяПродукцияТребуетУказанияЗначения;
			ЗаписьНабора.КоличествоВПотребительскойУпаковке  = 0;
		КонецЕсли;
		
	ИначеЕсли СохраненныеДанные <> Неопределено Тогда

		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ДанныеОписания);

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ЕмкостьПотребительскойУпаковки")
			И ДанныеОписания.ЕмкостьПотребительскойУпаковки = Неопределено Тогда
			ЗаписьНабора.ЕмкостьПотребительскойУпаковки = СохраненныеДанные.ЕмкостьПотребительскойУпаковки;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "КоличествоВПотребительскойУпаковке")
			И ДанныеОписания.КоличествоВПотребительскойУпаковке = Неопределено Тогда
			ЗаписьНабора.КоличествоВПотребительскойУпаковке = СохраненныеДанные.КоличествоВПотребительскойУпаковке;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантЧастичногоВыбытия")
			И ДанныеОписания.ВариантЧастичногоВыбытия = Неопределено Тогда
			ЗаписьНабора.ВариантЧастичногоВыбытия = СохраненныеДанные.ВариантЧастичногоВыбытия;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантИспользованияЕдиницыХранения")
			И ДанныеОписания.ВариантИспользованияЕдиницыХранения = Неопределено Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = СохраненныеДанные.ВариантИспользованияЕдиницыХранения;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ПотребительскаяУпаковка")
			И ДанныеОписания.ПотребительскаяУпаковка = Неопределено Тогда
			ЗаписьНабора.ПотребительскаяУпаковка = СохраненныеДанные.ПотребительскаяУпаковка;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "УпаковкаЧастичногоВыбытия")
			И ДанныеОписания.УпаковкаЧастичногоВыбытия = Неопределено Тогда
			ЗаписьНабора.УпаковкаЧастичногоВыбытия = СохраненныеДанные.УпаковкаЧастичногоВыбытия;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "КлючВидовПродукции")
			И ДанныеОписания.КлючВидовПродукции <> Неопределено Тогда
			ЗаписьНабора.КлючВидовПродукции = СохраненныеДанные.КлючВидовПродукции;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ИдентификаторыВидовПродукции")
			И ДанныеОписания.ИдентификаторыВидовПродукции <> Неопределено Тогда
			ЗаписьНабора.ИдентификаторыВидовПродукции = Новый ХранилищеЗначения(СохраненныеДанные.ИдентификаторыВидовПродукции);
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ТребуетВзвешивания")
			И ДанныеОписания.ТребуетВзвешивания = Истина Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = Перечисления.ВариантыИспользованияЕдиницыХраненияИС.МернаяПродукцияТребуетУказанияЗначения;
			ЗаписьНабора.КоличествоВПотребительскойУпаковке  = 0;
		КонецЕсли;
		
	Иначе
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ДанныеОписания,, "ИдентификаторыВидовПродукции");
		ЗаписьНабора.ИдентификаторыВидовПродукции = Новый ХранилищеЗначения(ДанныеОписания.ИдентификаторыВидовПродукции);
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ТребуетВзвешивания")
			И ДанныеОписания.ТребуетВзвешивания = Истина Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = Перечисления.ВариантыИспользованияЕдиницыХраненияИС.МернаяПродукцияТребуетУказанияЗначения;
			ЗаписьНабора.КоличествоВПотребительскойУпаковке  = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НаборЗаписей.Количество() = 0 И Не ЕстьЗаписьВРегистре Тогда
		Возврат;
	ИначеЕсли НаборЗаписей.Количество() = 1
		И Не ЗначениеЗаполнено(НаборЗаписей[0].КлючВидовПродукции)
		И Не Метаданные.ОпределяемыеТипы.НаборУпаковокНоменклатурыИС.Тип.СодержитТип(ТипЗнч(НаборЗаписей[0].Номенклатура))
		И НаборЗаписей[0].ИдентификаторыВидовПродукции.Получить() = Неопределено Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;
	
	НаборЗаписей.Записать();

КонецПроцедуры

// Данные идентификаторов видов продукции ключа.
// 
// Возвращаемое значение:
//  Структура - Данные ключа видов продукции:
// * ВидПродукцииГИСМТ - Неопределено, Строка - идентификатор вида продукции ГИС МТ
// * ВидПродукцииЕГАИС - Неопределено, Строка - идентификатор вида продукции ЕГАИС
// * ВидПродукцииВЕТИС - Неопределено, Строка - идентификатор вида продукции ВЕТИС
// * ВидПродукцииСАТУРН - Неопределено, Строка - идентификатор вида продукции САТУРН
// * ВидПродукцииЗЕРНО - Неопределено, Строка - идентификатор вида продукции ЗЕРНО
// * ВидПродукцииПеречисление - Неопределено, ПеречислениеСсылка.ВидыПродукцииИС - значение перечисления вид продукции
// * МаркируемаяПродукцияЕГАИС - Неопределено, Булево - признак подакцизной продукции ЕГАИС
// * ДанныеДляУточнения - см. ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ДанныеДляУточненияТоварнойГруппы
Функция ИдентикаторыВидовПродукцииКлюча() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ИменаПолейКлюча = КонструкторИСОбщегоНазначенияКлиентСервер.ИменаПолейКлючаВидовПродукции();
	Для Каждого ИмяПолеКлюча Из ИменаПолейКлюча Цикл
		ВозвращаемоеЗначение.Вставить(ИмяПолеКлюча,  Неопределено);
	КонецЦикла;
	
	ВозвращаемоеЗначение.Вставить("ВидПродукцииПеречисление",   Неопределено);
	ВозвращаемоеЗначение.Вставить("МаркируемаяПродукцияЕГАИС ", Неопределено);
	ВозвращаемоеЗначение.Вставить("ДанныеДляУточнения",         Неопределено);
	
	//@skip-check constructor-function-return-section
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Заполнить отсутствующие ключи видов продукции по данным идентификаторов видов продукции.
Процедура ЗаполнитьОтсутствующиеКлючиПоИдентификаторамВидовПродукции() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОписаниеНоменклатурыИС.Номенклатура                 КАК Номенклатура,
		|	ОписаниеНоменклатурыИС.ИдентификаторыВидовПродукции КАК ИдентификаторыВидовПродукции
		|ИЗ
		|	РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|ГДЕ
		|	ОписаниеНоменклатурыИС.КлючВидовПродукции = ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)";
	
	ТаблицаКОбработке = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаКОбработке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыВидовПродукции = Новый Массив;
	ТаблицаКОбработке.Колонки.Добавить("ДанныеИдентификаторов");
	ТаблицаКОбработке.Колонки.Добавить("ВидПродукциПеречисление", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПродукцииИС"));
	ТаблицаКОбработке.Колонки.Добавить("КлючВидовПродукции",      Новый ОписаниеТипов("СправочникСсылка.КлючиВидовПродукцииИС"));
	ТаблицаКОбработке.Колонки.Добавить("ИдентификаторыЗаполнены", Новый ОписаниеТипов("Булево"));
	
	ИменаПолейКлюча = КонструкторИСОбщегоНазначенияКлиентСервер.ИменаПолейКлючаВидовПродукции();
	ДанныеКеша      = Неопределено;
	
	// чтение данных идентификаторов
	Для Каждого СтрокаТаблицы Из ТаблицаКОбработке Цикл
		
		СохраненнныеДанныеКлюча = СтрокаТаблицы.ИдентификаторыВидовПродукции.Получить();
		Если СохраненнныеДанныеКлюча = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеИдентификаторов = ИдентикаторыВидовПродукцииКлюча();
		ЗаполнитьЗначенияСвойств(ДанныеИдентификаторов, СохраненнныеДанныеКлюча);
		Для Каждого ИмяПоляКлюча Из ИменаПолейКлюча Цикл
			ЗначениеИдентификатора = ДанныеИдентификаторов[ИмяПоляКлюча];
			Если ЗначениеЗаполнено(ЗначениеИдентификатора) Тогда
				Если ИдентификаторыВидовПродукции.Найти(ЗначениеИдентификатора) = Неопределено Тогда
					ИдентификаторыВидовПродукции.Добавить(ЗначениеИдентификатора);
				КонецЕсли;
				СтрокаТаблицы.ИдентификаторыЗаполнены = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Не СтрокаТаблицы.ИдентификаторыЗаполнены Тогда
			Если ЗначениеЗаполнено(ДанныеИдентификаторов.ВидПродукцииПеречисление) Тогда
				СтрокаТаблицы.КлючВидовПродукции = Справочники.КлючиВидовПродукцииИС.КлючПоЗначениюПеречисления(
					ДанныеИдентификаторов.ВидПродукцииПеречисление,
					ДанныеКеша,
					ДанныеИдентификаторов.МаркируемаяПродукцияЕГАИС,
					ДанныеИдентификаторов.ДанныеДляУточнения);
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.КлючВидовПродукции) Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТаблицы.ДанныеИдентификаторов = ДанныеИдентификаторов;
		
	КонецЦикла;
	
	// получение видов продукции по идентификаторам
	ВидыПродукцииПоИдентификаторам = Справочники.ВидыПродукцииИС.ВидыПродукцииПоИдентификаторам(
		ИдентификаторыВидовПродукции);
	
	ОписанияНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(ТаблицаКОбработке.ВыгрузитьКолонку("Номенклатура"));
	
	Для Каждого СтрокаТаблицы Из ТаблицаКОбработке Цикл
		
		Если СтрокаТаблицы.ДанныеИдентификаторов = Неопределено
			Или (Не СтрокаТаблицы.ИдентификаторыЗаполнены
				И Не ЗначениеЗаполнено(СтрокаТаблицы.КлючВидовПродукции)) Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			ОписаниеНоменклатуры = ОписанияНоменклатуры[СтрокаТаблицы.Номенклатура];
			
			Если СтрокаТаблицы.ИдентификаторыЗаполнены Тогда
				
				ПоляКлюча = Справочники.КлючиВидовПродукцииИС.ПоляКлюча();
				Для Каждого ИмяПоляКлюча Из ИменаПолейКлюча Цикл
					ИдентификаторВидаПродукции = СтрокаТаблицы.ДанныеИдентификаторов[ИмяПоляКлюча];
					Если ЗначениеЗаполнено(ИдентификаторВидаПродукции) Тогда
						ВидПродукции = ВидыПродукцииПоИдентификаторам[ИдентификаторВидаПродукции];
						Если ВидПродукции = Неопределено Тогда
							ВызватьИсключение СтрШаблон(
								НСтр("ru = 'Не найден вид продукции с идентификатором %1 для поля %2'"),
								ИдентификаторВидаПродукции,
								ИмяПоляКлюча);
						КонецЕсли;
						ПоляКлюча[ИмяПоляКлюча] = ВидПродукции;
					КонецЕсли;
				КонецЦикла;
			
				ОписаниеНоменклатуры.КлючВидовПродукции = Справочники.КлючиВидовПродукцииИС.ПолучитьКлюч(ПоляКлюча);
				
			Иначе
				
				ОписаниеНоменклатуры.КлючВидовПродукции = СтрокаТаблицы.КлючВидовПродукции;
				
			КонецЕсли;
			
			УстановитьОписание(ОписаниеНоменклатуры);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ТекстОшибкиПодробно = СтрШаблон(
				НСтр("ru = 'Ошибка при заполнении отсутствующих ключей по идентификаторам видов продукции:
					       |%'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
			ОбщегоНазначенияИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиПодробно);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли