#Область ОписаниеПеременных

// Структура, содержащая параметры закрытия смены при выполнении автоматической выемки.
&НаКлиенте
Перем ПараметрыЗакрытияСменыПриАвтоматическойВыемке;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияРМК.ЛокализоватьКартинки(ЭтотОбъект);
	НастроитьФормуПоВходнымПараметрам();
	НастроитьТиповыеГорячиеКлавиши();
	ПредставлениеВалюты = ОбщегоНазначенияРМК.ПредставлениеВалюты();
	ОбщегоНазначенияРМКПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыЗакрытияСменыПриАвтоматическойВыемке
		= ОбщегоНазначенияРМККлиент.ПараметрыЗакрытияСменыПриАвтоматическойВыемке();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ГорячаяКлавишаEnter(Команда)
	
	ОбработатьГорячуюКлавишуEnter();
	
КонецПроцедуры

&НаКлиенте
Процедура ГорячаяКлавишаESC(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
	
	Если СуммаВведенаКорректно() Тогда
		ВыполнитьОперациюКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОперацию(Команда)
	
	Закрыть(ШаблонОтвета());
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЦифраУниверсальнаяКлавиатура(Команда)
	ОбработатьЦифруЦифровойКлавиатуры(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДваНуляУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуДваНуляЦифровойКлавиатуры();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапятаяУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыЗвездочкаЗапятая();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыОчистить();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьПоследнееУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ШаблонОтвета()
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ОперацияПодтверждена", Ложь);
	РезультатФункции.Вставить("Ошибка", Ложь);
	РезультатФункции.Вставить("СуммаОперации", 0);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция СуммаВведенаКорректно()
	
	ТекстОшибки = "";
	Если СуммаОперации > 0 Тогда
		Если СуммаОперации > НаличныеВКассе И Не ЭтоВнесение Тогда
			Если ПравоПросмотраОстаткаНаличныхРМК Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'В кассе не хватает средств: %1 %2'"),
					СуммаОперации - НаличныеВКассе, ПредставлениеВалюты);
			Иначе
				ТекстСообщения = НСтр("ru = 'В кассе не хватает средств.'");
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстОшибки = НСтр("ru = 'Введите сумму.'");
	КонецЕсли;
	Если Не ТекстОшибки = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "СуммаОперации");
	КонецЕсли;
	Возврат (ТекстОшибки = "");
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОперациюКлиент()
	
	Если ЭтоВнесение Тогда
		
		ВыполнитьОперациюВнесениеКлиент();
		
	Иначе
		
		ВыполнитьОперациюВыемкаКлиент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьГорячуюКлавишуEnter()
	Если СуммаВведенаКорректно() Тогда
		ВыполнитьОперациюКлиент();
	КонецЕсли;
КонецПроцедуры

Процедура НастроитьТиповыеГорячиеКлавиши()
	
	СочетаниеКлавишESC = ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,{0,27,0}}");
	Если НЕ СочетаниеКлавишESC = Неопределено Тогда
		Команды.ГорячаяКлавишаESC.СочетаниеКлавиш = СочетаниеКлавишESC;
	КонецЕсли;
	
	СочетаниеКлавишиEnter = ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,{0,13,0}}");
	Если Не СочетаниеКлавишиEnter = Неопределено Тогда
		Элементы.ГорячаяКлавишаEnter.СочетаниеКлавиш = СочетаниеКлавишиEnter;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВходнымПараметрам()
	
	Если Параметры.ИспользоватьЦифровуюКлавиатуру Тогда
		
		ВидыКлавиатуры = ИнтерфейсРМКСлужебный.ВидыЦифровойКлавиатуры();
		ПараметрыПостроения = Новый Структура();
		ПараметрыПостроения.Вставить("ВидКлавиатуры", ВидыКлавиатуры.Стандартный);
		ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиГоризонтальный", ИнтервалМеждуЭлементамиФормы.Одинарный);
		ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиВертикальный", ИнтервалМеждуЭлементамиФормы.Половинный);
		ПараметрыПостроения.Вставить("РастягиватьПоШирине", Истина);
		ПараметрыПостроения.Вставить("ЦветКнопок", ИнтерфейсРМКСлужебный.ЦветУправляющейКнопки(Истина));
		ТекстОшибки = ИнтерфейсРМКСлужебный.ПостроитьПанельЦифровойКлавиатуры(ЭтотОбъект,
		Элементы.ГруппаЦифроваяПанель, ПараметрыПостроения);
		
		Если ТекстОшибки = "" Тогда
			Элементы.ПоискСтраницы.Видимость = Ложь;
		Иначе
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	ЭтоВнесение = Параметры.ЭтоВнесение;
	Элементы.ДекорацияВнесение.Видимость = ЭтоВнесение;
	Элементы.ДекорацияВыемка.Видимость = (Не ЭтоВнесение);
	НесколькоКасс = Параметры.НесколькоКасс;
	Заголовок = ?(ЭтоВнесение, НСтр("ru = 'Внесение'"), НСтр("ru = 'Выемка'"));
	СуммаОперации = Параметры.СуммаОперации;
	НаличныеВКассе = Параметры.НаличныеВКассе;
	ПравоПросмотраОстаткаНаличныхРМК = Параметры.ПравоПросмотраОстаткаНаличныхРМК;
	Элементы.СуммаОперации.Подсказка = Параметры.ТекстПодсказки;
	ТорговыйОбъект = Параметры.ТорговыйОбъект;
	Организация = Параметры.Организация;
	КассаККМ = Параметры.КассаККМ;
	Кассир = Параметры.Кассир;
	КассоваяСмена = Параметры.КассоваяСмена;
	ПользовательБД = Параметры.ПользовательБД;
	ПодключаемоеОборудование = Параметры.ПодключаемоеОборудование;
	СписокРолейПользователя.ЗагрузитьЗначения(Параметры.СписокРолейПользователя.ВыгрузитьЗначения());
	Если Параметры.ЭтоВыемкаПриЗакрытииСмены Тогда
		Элементы.ОтменитьОперацию.Заголовок = НСтр("ru='Без выемки'");
	КонецЕсли;
	Если Параметры.Свойство("Масштаб") Тогда
		Масштаб = Параметры.Масштаб;
	КонецЕсли;
	Элементы.Организация.Видимость = НесколькоКасс;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыОперации(ПараметрыОперации)
	
	ПараметрыОперации.КассаККМ = КассаККМ;
	ПараметрыОперации.Кассир = Кассир;
	ПараметрыОперации.ПользовательБД = ПользовательБД;
	ПараметрыОперации.ПодключаемоеОборудование = ПодключаемоеОборудование;
	ПараметрыОперации.Организация = Организация;
	ПараметрыОперации.СписокРолейПользователя = СписокРолейПользователя;
	ПараметрыОперации.УникальныйИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыОперации.ФормаИсточник = ЭтотОбъект;
	Если ЭтоВнесение Тогда
		ПараметрыОперации.СуммаВнесение = СуммаОперации;
	Иначе
		ПараметрыОперации.СуммаВыемка = СуммаОперации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюВнесениеКлиент()
	
	ПараметрыВнесения = ИнтерфейсРМКСлужебныйКлиент.ШаблонПараметровВнесенияВыемки(Истина);
	ЗаполнитьПараметрыОперации(ПараметрыВнесения);
	ОбщегоНазначенияРМККлиентПереопределяемый.ВыполнитьОперациюВнесение(ПараметрыВнесения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюВыемкаКлиент()
	
	ПараметрыВыемки = ИнтерфейсРМКСлужебныйКлиент.ШаблонПараметровВнесенияВыемки(Ложь);
	ЗаполнитьПараметрыОперации(ПараметрыВыемки);
	ПараметрыЗакрытияСменыПриАвтоматическойВыемке.ВыемкаПриЗакрытииСмены = Истина;
	ОбщегоНазначенияРМККлиентПереопределяемый.ВыполнитьОперациюВыемка(ПараметрыВыемки,
		ПараметрыЗакрытияСменыПриАвтоматическойВыемке);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВнесениеДСКлиент(Отказ, ТекстОшибки)
	
	ПараметрыДляОперации = ОбщегоНазначенияРМККлиент.ПодготовитьПараметрыСозданияВнесенияДенежныхСредств(ЭтотОбъект);
	СоздатьВнесениеДС(ПараметрыДляОперации, Отказ, ТекстОшибки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьВнесениеДС(ПараметрыДляОперации, Отказ, ТекстОшибки)
	
	ОбщегоНазначенияРМКПереопределяемый.СоздатьВнесениеДС(ПараметрыДляОперации, Отказ, ТекстОшибки);
	Если Не Отказ Тогда
		Сумма = ПараметрыДляОперации.НаличныеВКассе + ПараметрыДляОперации.СуммаВнесение;
		ОбщегоНазначенияРМКПереопределяемый.ОтразитьИзменениеНаличныхДенежныхСредств(ПараметрыДляОперации.Организация,
			ПараметрыДляОперации.КассаККМ, Сумма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВыемкуДСКлиент(Отказ, ТекстОшибки)
	
	ПараметрыДляОперации = ОбщегоНазначенияРМККлиент.ПодготовитьПараметрыСозданияВыемкиДенежныхСредств(ЭтотОбъект);
	СоздатьВыемкуДС(ПараметрыДляОперации, Отказ, ТекстОшибки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьВыемкуДС(ПараметрыДляОперации, Отказ, ТекстОшибки)
	
	ОбщегоНазначенияРМКПереопределяемый.СоздатьВыемкуДС(ПараметрыДляОперации, Отказ, ТекстОшибки);
	Если НЕ Отказ Тогда
		Сумма = ПараметрыДляОперации.НаличныеВКассе - ПараметрыДляОперации.СуммаВыемка;
		ОбщегоНазначенияРМКПереопределяемый.ОтразитьИзменениеНаличныхДенежныхСредств(ПараметрыДляОперации.Организация,
			ПараметрыДляОперации.КассаККМ, Сумма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСообщенияОбОшибке(ПараметрыДляОткрытия)
	
	ПараметрыДляОткрытия.Вставить("РежимКассыСамообслуживания", Ложь);
	ОбработкаОповещения = Новый ОписаниеОповещения("ЗакрытиеСообщенияОбОшибке", ЭтотОбъект);
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаСообщенияОбОшибке", ПараметрыДляОткрытия, ЭтотОбъект,,,,
		ОбработкаОповещения);
	
КонецПроцедуры

#Область РаботаСЦифровойКлавиатурой

&НаКлиенте
Процедура ПеревестиКурсорНаВводДробнойЧасти()
	
	ЭлементВводаСуммы = Элементы.СуммаОперации;
	ИмяЭлемента = ЭлементВводаСуммы.Имя;
	НачалоВыделения = 0;
	НачалоСтроки = 0;
	КонецВыделения = 0;
	КонецСтроки = 0;
	ЭлементВВодаСуммы.ПолучитьГраницыВыделения(НачалоСтроки, НачалоВыделения, КонецСтроки, КонецВыделения);
	СимволРазделителя = ИнтерфейсРМКСлужебныйКлиентСервер.РазделительДробнойЧасти();
	ПозицияРазделителя = СтрНайти(ЭлементВВодаСуммы.ТекстРедактирования, СимволРазделителя);
	ТекущийЭлемент = ЭлементВводаСуммы;
	Если ПозицияРазделителя > 0 И ПозицияРазделителя >= НачалоВыделения Тогда
		НоваяПозицияКурсора = ПозицияРазделителя + 1;
		ЭлементВВодаСуммы.УстановитьГраницыВыделения(НоваяПозицияКурсора, НоваяПозицияКурсора);
	Иначе
		ЭлементВВодаСуммы.УстановитьГраницыВыделения(НачалоВыделения, КонецВыделения);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЦифруЦифровойКлавиатуры(ИмяКомандыКлавиатуры)

	СимволКлавиатуры = ИнтерфейсРМКСлужебныйКлиент.ПолучитьСимволКоманды(ИмяКомандыКлавиатуры);
	ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, Элементы.СуммаОперации,
		СимволКлавиатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуДваНуляЦифровойКлавиатуры()
	
	Если СуммаОперации = 0 Тогда
		ТекущийЭлемент = Элементы.СуммаОперации;
	Иначе
		СимволыКлавиатуры = ИнтерфейсРМКСлужебныйКлиент.ПолучитьТекстКнопкиДваНуля();
		ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, Элементы.СуммаОперации,
			СимволыКлавиатуры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыЗвездочкаЗапятая()
	
	ПеревестиКурсорНаВводДробнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыОчистить()
	ИнтерфейсРМКСлужебныйКлиент.ОчиститьТекстРедактированияВПолеФормы(ЭтотОбъект, Элементы.СуммаОперации);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее()
	ИнтерфейсРМКСлужебныйКлиент.УдалитьСимволыВРедактируемомПоле(ЭтотОбъект, Элементы.СуммаОперации, Символы.НПП);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПрограммныйИнтерфейс
&НаКлиенте
Процедура ВыполнитьОперациюВнесениеЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	ТекстЗаголовка = НСтр("ru = 'Ошибка внесения.'");
	Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "Результат")
			И РезультатВыполнения.Результат Тогда
		
		Отказ = Ложь;
		ТекстОшибки = "";
		
		СоздатьВнесениеДСКлиент(Отказ, ТекстОшибки);
		
		Если Отказ Тогда
			
			Если ПустаяСтрока(ТекстОшибки) Тогда
				ТекстОшибки = НСтр("ru='Ошибка формирования документа внесения'");
			КонецЕсли;
			
			ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки, ТекстЗаголовка);
			ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
			
		Иначе
			
			Ответ = ШаблонОтвета();
			Ответ.ОперацияПодтверждена = Истина;
			Ответ.СуммаОперации = СуммаОперации;
	
			Закрыть(Ответ);
			
		КонецЕсли;
		
	Иначе
		
		ТекстОшибки = НСтр("ru='Ошибка внесения'");
		Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "ТекстСообщения") Тогда
			ТекстОшибки = РезультатВыполнения.ТекстСообщения;
		КонецЕсли;
		Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "ОписаниеОшибки") Тогда
			ТекстОшибки = РезультатВыполнения.ОписаниеОшибки;
		КонецЕсли;
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки, ТекстЗаголовка);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюВыемкаЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	ТекстЗаголовка = НСтр("ru = 'Ошибка выемки.'");
	Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "Результат")
			И РезультатВыполнения.Результат Тогда
		
		Отказ = Ложь;
		ТекстОшибки = "";
		
		СоздатьВыемкуДСКлиент(Отказ, ТекстОшибки);
		
		Если Отказ Тогда
			
			Если ПустаяСтрока(ТекстОшибки) Тогда
				ТекстОшибки = НСтр("ru='Ошибка формирования документа выемки'");
			КонецЕсли;
			ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки, ТекстЗаголовка);
			ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
			
		Иначе
			
			Ответ = ШаблонОтвета();
			Ответ.ОперацияПодтверждена = Истина;
			Ответ.СуммаОперации = СуммаОперации;
	
			Закрыть(Ответ);
			
		КонецЕсли;
		
	Иначе
		
		ТекстОшибки = НСтр("ru='Ошибка выемки'");
		Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "ТекстСообщения") Тогда
			ТекстОшибки = РезультатВыполнения.ТекстСообщения;
		КонецЕсли;
		Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "ОписаниеОшибки") Тогда
			ТекстОшибки = РезультатВыполнения.ОписаниеОшибки;
		КонецЕсли;
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки, ТекстЗаголовка);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗакрытиеСообщенияОбОшибке(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = ШаблонОтвета();
	Ответ.ОперацияПодтверждена = Истина;
	Ответ.Ошибка = Истина;
	
	Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветОбработкиАвтономнойККТ(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Команда = "Encash" И РезультатВыполнения = КодВозвратаДиалога.Да Тогда
		
		ПараметрыОперации = Неопределено;
		МенеджерОборудованияРМККлиент.ПараметрыВыполненияОперацииНаАвтономнойККТ(ПараметрыОперации);
		ПараметрыОперации.ПараметрыОперации = ДополнительныеПараметры.ОбщиеПараметры;
		ПараметрыОперации.Команда = ДополнительныеПараметры.Команда;
		Если ДополнительныеПараметры.ОбщиеПараметры.ТипИнкассации = 1 Тогда
			ПараметрыОперации.ОповещениеПриЗавершении = Новый ОписаниеОповещения("ВыполнитьОперациюВнесениеЗавершение", ЭтотОбъект);
		Иначе
			ПараметрыОперации.ОповещениеПриЗавершении = Новый ОписаниеОповещения("ВыполнитьОперациюВыемкаЗавершение", ЭтотОбъект);
		КонецЕсли;
		ПараметрыОперации.ИдентификаторКлиента = УникальныйИдентификатор;
		ПараметрыОперации.ИспользуетсяОчередьПробития = Ложь;
		МенеджерОборудованияРМККлиент.ВыполнитьКомандуЗавершениеАвтономнойККТ(КодВозвратаДиалога.Да, ПараметрыОперации);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
