
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДокументОснование", Объект.ДокументОснование);
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.ЗаполнитьНаОсновании(Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДокументРасчетов) Тогда
		Объект.НеприменениеККТ = Истина;
		ПричинаКоррекцииНеприменениеККТ = "Неприменение ККТ";
		ТипКоррекцииКарантин = 2; // Тип коррекции "Самостоятельно, чек не принят ФНС" недоступен при НеприменениеККТ.
		Элементы.ТипКоррекции.СписокВыбора.Удалить(ТипКоррекцииКарантин);
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			ТекстСообщения = НСтр("ru = 'У документа основания не найдена фискальная операция. Установлен режим ""Неприменение ККТ"".'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе
			ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьОрганизациюПоУмолчанию(Объект.Организация);
		КонецЕсли;
	КонецЕсли;
	
	СписокВсехСНО = ЗаполнитьСписокВсехСНО();
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	ОбщегоНазначенияРМКПереопределяемый.РазрешитьЧекиКоррекцииНаОблачнойККТ(РазрешитьОблачныеККТ);
	
	Если ЗначениеЗаполнено(Объект.ДокументРасчетов) Тогда
		ДокументОснованиеПробитНаОблачнойККТ = ТипКассыККМОблачнаяККТ(Объект.КассаККМ);
	КонецЕсли;
	
	ЗаполнитьСпискиВыбораЭлементов();
	
	ОбщегоНазначенияРМКПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидомостьюИДоступностью();
	
	Если ЗначениеЗаполнено(Объект.КассаККМ) И Не ДокументОснованиеПробитНаОблачнойККТ Тогда
		ЗаполнитьПоддерживаемыеСНОКассойККМ(Ложь, Истина);
	Иначе
		ПоддерживаемыеСНОКассойККМ = СписокВсехСНО;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СистемаНалогообложения) Тогда
		ОбновитьСтавкиНДСПозицийЧека();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаКоррекцииПриИзменении(Элемент)
	
	ТекДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецТекущегоДня = КонецДня(ТекДата);
	
	Если Объект.ДатаКоррекции > КонецТекущегоДня Тогда
		Объект.ДатаКоррекции = ТекДата;
		ТекстСообщения = НСтр("ru = 'Дата корректируемого расчета не может превышать текущую дату.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ОбновитьСтавкиНДСПозицийЧека();
	
КонецПроцедуры

&НаКлиенте
Процедура КассаККМНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Перем ТекстОшибки;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстОшибки = НСтр("ru = 'Не выбрана организация.'");
		ПолеОшибки = "Объект.Организация";
	ИначеЕсли Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		ТекстОшибки = НСтр("ru = 'Не выбрана розничная точка.'");
		ПолеОшибки = "Объект.СтруктурнаяЕдиница";
	Иначе
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , ПолеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	
	Перем ТекстОшибки;
	
	ВыбранаОблачнаяККТ = ТипКассыККМОблачнаяККТ(Объект.КассаККМ);
	Если ВыбранаОблачнаяККТ Тогда
		Если НЕ РазрешитьОблачныеККТ Тогда
			ТекстШаблона = НСтр("ru = 'Выбранная Касса ККМ ""%1"" недоступна для формирования чека коррекции.
										|Чек коррекции на облачной кассе запрещен.
										|Выберите другую Кассу ККМ.'");
			ТекстОшибки = СтрШаблон(ТекстШаблона, Строка(Объект.КассаККМ));
			
		ИначеЕсли ЗначениеЗаполнено(Объект.ДокументРасчетов) Тогда
			ТекстШаблона = НСтр("ru = 'Выбранная Касса ККМ ""%1"" недоступна для формирования чека коррекции.
										|Документ основание пробит на локальной кассе, чек коррекции на облачной кассе запрещен.
										|Выберите другую Кассу ККМ.'");
			ТекстОшибки = СтрШаблон(ТекстШаблона, Строка(Объект.КассаККМ));
		Иначе
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , "Объект.КассаККМ");
		Объект.КассаККМ = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КассаККМ) И Не ВыбранаОблачнаяККТ Тогда
		ЗаполнитьПоддерживаемыеСНОКассойККМ(Истина, Истина);
	Иначе
		ПоддерживаемыеСНОКассойККМ = СписокВсехСНО;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элементы.СистемаНалогообложения.РежимВыбораИзСписка = Истина;
	Элементы.СистемаНалогообложения.СписокВыбора.ЗагрузитьЗначения(ПоддерживаемыеСНОКассойККМ.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СистемаНалогообложенияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДокументРасчетов) Тогда
		
		Если Объект.СНОКорректируемогоДокумента <> Объект.СистемаНалогообложения Тогда
			
			ТекстСообщения = НСтр("ru = 'Выбранная система налогообложения не соответствует системе налогообложения ""%1"" корректируемого документа. Продолжить?'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения,
				Объект.СНОКорректируемогоДокумента);
			
			ОтветНаВопрос = ВопросАсинх(ТекстСообщения, РежимДиалогаВопрос.ДаНет);
			РезультатВопроса = Ждать ОтветНаВопрос;
			
			Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
				Объект.СистемаНалогообложения = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверитьКассуККМ(Истина);
	ОбновитьСтавкиНДСПозицийЧека();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКоррекцииПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовПоТипуКоррекции();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.КонтрагентИНН = "";
	ИначеЕсли ТипЗнч(Объект.Контрагент) <> Тип("Строка") Тогда
		Объект.КонтрагентИНН = ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ИНН");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
	"Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетВИнтернетеПриИзменении(Элемент)
	
	Элементы.АдресСайта.Доступность = Объект.РасчетВИнтернете;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииЧека

&НаКлиенте
Процедура ПозицииЧекаНаименованиеПредметаРасчетаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено 
		И ТипЗнч(ТекущаяСтрока.НаименованиеПредметаРасчета) = Тип("СправочникСсылка.Номенклатура")
		И ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеПредметаРасчета) Тогда
		
		ПараметрыНоменклатуры = РеквизитыПредметаРасчета(ТекущаяСтрока.НаименованиеПредметаРасчета, Объект.ДатаКоррекции);
		
		ТекущаяСтрока.ЕдиницаИзмерения = ПараметрыНоменклатуры.ЕдиницаИзмерения;
		ТекущаяСтрока.СтавкаНДС        = ПараметрыНоменклатуры.СтавкаНДС;
		
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыПредметаРасчета(Знач Номенклатура, Знач ДатаКоррекции)
	
	ЕдиницаИзмерения = ЗначениеРеквизитаОбъекта(Номенклатура, "ЕдиницаИзмерения");
	
	ПараметрыНоменклатуры = Новый Структура;
	ПараметрыНоменклатуры.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	ПараметрыНоменклатуры.Вставить("СтавкаНДС");
	
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьСтавкуНДСНоменклатуры(Номенклатура, ПараметрыНоменклатуры.СтавкаНДС, ДатаКоррекции);
	
	Возврат ПараметрыНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ПозицииЧекаКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуСтроки(ТекущаяСтрока);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаЦенаСоСкидкамиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуСтроки(ТекущаяСтрока);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаСуммаСоСкидкамиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.ЦенаСоСкидками = ?(ТекущаяСтрока.Количество = 0, ТекущаяСтрока.СуммаСоСкидками, ТекущаяСтрока.СуммаСоСкидками / ТекущаяСтрока.Количество);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаСуммаСкидокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.ЦенаСоСкидками = ?(ТекущаяСтрока.Количество = 0, ТекущаяСтрока.СуммаСоСкидками, ТекущаяСтрока.СуммаСоСкидками / ТекущаяСтрока.Количество);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаПризнакАгентаПоПредметуРасчетаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ПризнакАгентаПоПредметуРасчета) Тогда
		ТекущаяСтрока.ПлатежныйАгентОперация 			= "";
		ТекущаяСтрока.ПлатежныйАгентТелефон 			= "";
		ТекущаяСтрока.ОператорПоПриемуПлатежейТелефон 	= "";
		ТекущаяСтрока.ОператорПереводаНаименование 		= "";
		ТекущаяСтрока.ОператорПереводаИНН 				= "";
		ТекущаяСтрока.ОператорПереводаАдрес 			= "";
		ТекущаяСтрока.ОператорПереводаТелефон 			= "";
		ТекущаяСтрока.ДанныеПоставщикаНаименование 		= "";
		ТекущаяСтрока.ДанныеПоставщикаИНН 				= "";
		ТекущаяСтрока.ДанныеПоставщикаТелефон 			= "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаКодСтраныПроисхожденияТовараНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИдентификаторСтроки = Элементы.ПозицииЧека.ТекущиеДанные.ПолучитьИдентификатор();
	
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	ОбработчикОповещения 	= Новый ОписаниеОповещения("ВыборСтраныПроихождения", ЭтотОбъект, ДополнительныеПараметры);

	ПоказатьВводЗначения(ОбработчикОповещения,,"Выбор страны проихождения товара", Тип("СправочникСсылка.СтраныМира")); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОплата

&НаКлиенте
Процедура ОплатаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СуммаПродажи = Объект.ПозицииЧека.Итог("СуммаСоСкидками");
	СуммаОплат   = Объект.Оплата.Итог("Сумма");
	
	ТекущаяСтрока = Элементы.Оплата.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСумма  = ТекущаяСтрока.Сумма;
		ОплатаБезТекущейСтроки = СуммаОплат - ТекущаяСумма;
		ОстатокОплаты = СуммаПродажи - ОплатаБезТекущейСтроки;
	КонецЕсли;
	
	Элементы.ОплатаСумма.СписокВыбора.Очистить();
	
	Если ОстатокОплаты > 0 Тогда
		
		Элементы.ОплатаСумма.СписокВыбора.Добавить(ОстатокОплаты, Формат(ОстатокОплаты, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=; ЧГ=3,0"));
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЧеки(Команда)
	
	Результат = СоздатьЧекиСервер();
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаГлавное;
		
		Элементы.ФормаСоздатьЧеки.Доступность = Ложь;
		Элементы.Страницы.ТолькоПросмотр = Истина;
		Элементы.Подвал.ТолькоПросмотр = Истина;
		Модифицированность = Ложь;
		
		Если ЗначениеЗаполнено(Результат.ЧекКоррекцииСторно) Тогда
			Объект.ЧекСторно = Результат.ЧекКоррекцииСторно;
			ЧекСторноСтатус = НСтр("ru = 'Записан, не пробит'");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.ЧекСкорректированный) Тогда
			Объект.ЧекСкорректированный = Результат.ЧекСкорректированный;
			ЧекСкорректированныйСтатус = НСтр("ru = 'Записан, не пробит'");
		КонецЕсли;
		
		ПробитьЧек();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьКомментарий(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект,
	"Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовПоТипуКоррекции()
	
	Если Объект.ТипКоррекции = 1 Тогда
		
		Элементы.НомерПредписания.Видимость = Истина;
		
	Иначе
		
		Объект.НомерПредписания = "";
		Элементы.НомерПредписания.Видимость = Ложь;
		
		Если Объект.ТипКоррекции = 2 Тогда
			Объект.ОписаниеКоррекции = Нстр("ru = 'Корректировка тега 2108'");
		КонецЕсли;
		
	КонецЕсли;
	
	ФормироватьЧекСторно = ЗначениеЗаполнено(Объект.ДокументРасчетов)
		И Объект.ТипКоррекции <> 2; // Если попал в карантин "Самостоятельно, чек не принят ФНС" - сторно не делается.
	
	Если ФормироватьЧекСторно Тогда
		Элементы.ФормаСоздатьЧеки.Заголовок = НСтр("ru = 'Создать чеки'");
	Иначе
		Элементы.ФормаСоздатьЧеки.Заголовок = НСтр("ru = 'Создать чек'");
	КонецЕсли;
	Элементы.ГруппаЧекСторно.Видимость        = ФормироватьЧекСторно;
	Элементы.ДополнительныйРеквизит.Видимость = ФормироватьЧекСторно;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипКассыККМОблачнаяККТ(Знач КассаККМ)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		ТипОборудования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КассаККМ, "ПодключаемоеОборудование.ТипОборудования");
		Если ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ОблачнаяККТ Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтавкиНДСПозицийЧека()
	
	Элементы.ПозицииЧекаСтавкаНДС.РежимВыбораИзСписка = Ложь;
	Элементы.ПозицииЧекаСтавкаНДС.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.СистемаНалогообложения) Тогда
		
		СтавкиНДСПоСНО = Новый Соответствие;
		ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьСоответствиеСтавокНДСДляЧекаКоррекции(
			СтавкиНДСПоСНО,
			Объект.ДатаКоррекции);
		
		ДоступныеСтавкиНДС = СтавкиНДСПоСНО.Получить(Объект.СистемаНалогообложения);
		Если ТипЗнч(ДоступныеСтавкиНДС) = Тип("СписокЗначений") Тогда
			Элементы.ПозицииЧекаСтавкаНДС.РежимВыбораИзСписка = Истина;
			Элементы.ПозицииЧекаСтавкаНДС.СписокВыбора.ЗагрузитьЗначения(ДоступныеСтавкиНДС.ВыгрузитьЗначения());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧек()
	
	Если ЗначениеЗаполнено(Объект.ЧекСторно)
		И Не Объект.ЧекСторноПробит Тогда
		
		ЧекКПробитию = Объект.ЧекСторно;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ЧекСкорректированный)
		И Не Объект.ЧекСкорректированныйПробит Тогда
		
		ЧекКПробитию = Объект.ЧекСкорректированный;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторУстройства = ЗначениеРеквизитаОбъекта(Объект.КассаККМ, "ПодключаемоеОборудование");
	
	ОбщиеПараметры = ДанныеДляПробитияЧекаКоррекции(ЧекКПробитию, ИдентификаторУстройства);
	
	Если ТипЗнч(ОбщиеПараметры) = Тип("Структура") Тогда
		
		ОбщиеПараметры.Вставить("СформироватьЧекКоррекцииСторно", Ложь);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОбщиеПараметры",            ОбщиеПараметры);
		ДополнительныеПараметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
		
		Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеЧекаКоррекцииНаФискальномУстройстве(
			Оповещение,
			ЭтотОбъект.УникальныйИдентификатор,
			ИдентификаторУстройства,
			ОбщиеПараметры);
		
	Иначе
		
		Элементы.ФормаСоздатьЧеки.Доступность = Истина;
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось определить параметры для пробития чека коррекции ""%1""'"),
			Строка(ЧекКПробитию));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеДляПробитияЧекаКоррекции(Знач ЧекКоррекции, Знач ИдентификаторУстройства)
	
	ОбщиеПараметры = Неопределено;
	
	ОбщегоНазначенияРМКПереопределяемый.ПодготовитьДанныеДляПробитияЧекаКоррекции(ОбщиеПараметры, ЧекКоррекции, ИдентификаторУстройства);
	
	Возврат ОбщиеПараметры;
	
КонецФункции

&НаКлиенте
Процедура ПробитьЧекЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		Если РезультатВыполнения.Свойство("СтатусВОблачнойКассе")
			И РезультатВыполнения.СтатусВОблачнойКассе = ОблачныеКассыКлиентСервер.СтатусОперацииВыполняется() Тогда
			
			Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ОбщегоНазначенияРМККлиентПереопределяемый.ПроверитьСтатусЧекаВОблаке(
				ЭтотОбъект,
				ДополнительныеПараметры.ОбщиеПараметры,
				Оповещение,
				ДополнительныеПараметры.ИдентификаторУстройства);
			
		Иначе
			
			ЗаписатьЧекКоррекцииПослеПробития(РезультатВыполнения);
			
			// Если чек сторно пробился, то пробивается скорректированный чек
			ПробитыйДокумент = РезультатВыполнения.ПараметрыФискализации.ДокументОснование;
			
			Если ПробитыйДокумент = Объект.ЧекСторно  Тогда
				
				ЧекСторноСтатус = НСтр("ru = 'Записан и пробит'");
				Объект.ЧекСторноПробит = Истина;
				
			ИначеЕсли ПробитыйДокумент = Объект.ЧекСкорректированный Тогда
				
				ЧекСкорректированныйСтатус = НСтр("ru = 'Записан и пробит'");
				Объект.ЧекСкорректированныйПробит = Истина;
				
			КонецЕсли;
			
			ОповеститьОбИзменении(ТипЗнч(ПробитыйДокумент));
			
			ПробитьЧек();
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ФормаСоздатьЧеки.Доступность = Истина;
		
		ТекстСообщения = СтрШаблон(НСтр(
			"ru = 'При печати чека произошла ошибка.
			|Чек не напечатан на фискальном регистраторе.
			|Дополнительное описание:
			|%1'"), РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСтраныПроихождения (РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения <> Неопределено Тогда
		
		ТекущаяСтрока = Объект.ПозицииЧека.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
		
		Если ТекущаяСтрока <> Неопределено Тогда
			
			ТекущаяСтрока.КодСтраныПроисхожденияТовара = ЗначениеРеквизитаОбъекта(РезультатВыполнения, "Код");
			Элементы.ПозицииЧека.ЗакончитьРедактированиеСтроки(Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуСтроки(ТекущаяСтрока)
	
	ТекущаяСтрока.СуммаСоСкидками = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаСоСкидками;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуНДССтроки(ТекущаяСтрока)
	
	ТекПроцентНДС = 0;
	ОбщегоНазначенияРМККлиентПереопределяемый.ПроцентНДСПоСтавкеНДС(ТекПроцентНДС, ТекущаяСтрока.СтавкаНДС);
	ТекПроцентНДС = ТекПроцентНДС / 100;
	
	ТекущаяСтрока.СуммаНДС = ТекущаяСтрока.СуммаСоСкидками * ТекПроцентНДС / (ТекПроцентНДС + 1);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидомостьюИДоступностью()
	
	ЕстьФискальнаяОперация = ЗначениеЗаполнено(Объект.ДокументРасчетов);
	
	Элементы.Организация.ТолькоПросмотр   = ЕстьФискальнаяОперация;
	Элементы.ДатаКоррекции.ТолькоПросмотр = ЕстьФискальнаяОперация;
	Элементы.ТипРасчета.ТолькоПросмотр    = ЕстьФискальнаяОперация;
	
	Элементы.ПричинаКоррекцииНеприменениеККТ.Видимость = Объект.НеприменениеККТ;
	
	Элементы.ДокументОснование.Видимость  = ЗначениеЗаполнено(Объект.ДокументОснование);
	Элементы.ДокументРасчетов.Видимость   = ЗначениеЗаполнено(Объект.ДокументРасчетов);
	
	Элементы.АдресСайта.Доступность = Объект.РасчетВИнтернете;
	
	УстановитьВидимостьЭлементовПоТипуКоррекции();
	
	Если ДокументОснованиеПробитНаОблачнойККТ Тогда
		Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Истина;
		Элементы.КассаККМ.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьЧекиСервер()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	Иначе
		Возврат Обработки.СозданиеЧековКоррекции.СоздатьЧекиКоррекции(Объект);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьЧекКоррекцииПослеПробития(РезультатВыполнения)
	
	ОбщегоНазначенияРМКПереопределяемый.ЗаписатьЧекКоррекцииПослеПробития(РезультатВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоддерживаемыеСНОКассойККМ(ВыводитьПредупреждение, ВыполнитьПроверку)
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ВыводитьПредупреждение", ВыводитьПредупреждение);
	ПараметрыОповещения.Вставить("ВыполнитьПроверку",      ВыполнитьПроверку);
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьДанныеККМЗавершение", ЭтотОбъект, ПараметрыОповещения);
	ИдентификаторУстройства = ЗначениеРеквизитаОбъекта(Объект.КассаККМ, "ПодключаемоеОборудование");
	
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеПараметровФискальногоУстройства(
		Оповещение,
		УникальныйИдентификатор,
		ИдентификаторУстройства);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеККМЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		СтрокаСНО      = РезультатВыполнения.ПараметрыККТ.КодыСистемыНалогообложения;
		МассивКодовСНО = СтрРазделить(СтрокаСНО, ",");
		
		ПоддерживаемыеСНОКассойККМ.Очистить();
		Для Каждого КодСНО Из МассивКодовСНО Цикл
			
			Если КодСНО = "3" Тогда
				Продолжить;
			КонецЕсли;
			
			СНО = МенеджерОборудованияРМККлиентСервер.СистемаНалогообложенияККТПоКоду(Число(КодСНО));
			ПоддерживаемыеСНОКассойККМ.Добавить(СНО);
			
		КонецЦикла;
		
		Если ДополнительныеПараметры.ВыполнитьПроверку Тогда
		
			ПроверитьКассуККМ(ДополнительныеПараметры.ВыводитьПредупреждение);
		
		КонецЕсли;
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Не удалось получить список систем налогообложения поддерживаемых кассой ККМ:'");
		ТекстСообщения = ТекстСообщения + Символы.ПС + РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Объект.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКассуККМ(ВыводитьПредупреждение)
	
	Если ЗначениеЗаполнено(Объект.ДокументРасчетов)
		И ПоддерживаемыеСНОКассойККМ.Количество() > 0
		И ПоддерживаемыеСНОКассойККМ.НайтиПоЗначению(Объект.СНОКорректируемогоДокумента) = Неопределено Тогда
		
		Если ВыводитьПредупреждение Тогда
			
			ТекстСообщения = НСтр("ru = 'Выбранная касса ККМ не поддерживает систему налогообложения ""%1"" корректируемого документа. Выберите другую кассу ККМ.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Объект.СНОКорректируемогоДокумента);
			
			ПоказатьПредупреждение(, ТекстСообщения);
			
		КонецЕсли;
		
		Объект.КассаККМ = Неопределено;
		ПоддерживаемыеСНОКассойККМ.Очистить();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СистемаНалогообложения)
		И Объект.СистемаНалогообложения <> Объект.СНОКорректируемогоДокумента
		И ПоддерживаемыеСНОКассойККМ.НайтиПоЗначению(Объект.СистемаНалогообложения) = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Выбранная касса ККМ не поддерживает систему налогообложения ""%1"". Значение очищено.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Объект.СистемаНалогообложения);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , , "Объект.СистемаНалогообложения");
		
		Объект.СистемаНалогообложения = Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьСписокВсехСНО()
	
	ВсеСНО = Новый СписокЗначений;
	
	Для каждого ЭлементМетаданных Из Метаданные.Перечисления.ТипыСистемНалогообложенияККТ.ЗначенияПеречисления Цикл
		ВсеСНО.Добавить(Перечисления.ТипыСистемНалогообложенияККТ[ЭлементМетаданных.Имя])
	КонецЦикла;
	
	Возврат ВсеСНО;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции 

&НаСервереБезКонтекста
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьСпискиВыбораЭлементов()
	
	ОбновитьСтавкиНДСПозицийЧека();
	
	Если Не Объект.НеприменениеККТ Тогда
		Элементы.ОписаниеКоррекции.СписокВыбора.Добавить(НСтр("ru = 'Ошибка в указании ставки НДС при применении ККТ'"));
	КонецЕсли;
	
	МетаданныеПозицииЧека = Метаданные.Обработки.СозданиеЧековКоррекции.ТабличныеЧасти.ПозицииЧека;
	Если МетаданныеПозицииЧека.Реквизиты.ЕдиницаИзмерения.Тип.СодержитТип(Тип("Строка")) Тогда
		Элементы.ПозицииЧекаЕдиницаИзмерения.СписокВыбора.Добавить(НСтр("ru = 'Штука'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти