
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаНаИнструкцию = СервисВзаимодействияМПЭПД.СсылкаНаИнструкцию();
	
	ИспользуетсяИнтерфейс85 = КлиентскоеПриложение.ТекущийВариантИнтерфейса()
		= ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5;
	
	Элементы.ФормаЗакрыть.Видимость = Не ИспользуетсяИнтерфейс85;
	Элементы.Декорация6.Видимость = Не ИспользуетсяИнтерфейс85;
	Элементы.Декорация7.Видимость = Не ИспользуетсяИнтерфейс85;
	Элементы.ГруппаСсылкаДляУстановкиПриложения.Видимость = Не ИспользуетсяИнтерфейс85;
	Элементы.ГруппаСсылкаДляУстановкиПриложения85.Видимость = ИспользуетсяИнтерфейс85;
	
	Если ИспользуетсяИнтерфейс85 Тогда
		Элементы.ДекорацияОписаниеНачало.Заголовок = НСтр("ru='Для подключения пользователя:'");
	Иначе
		Элементы.ДекорацияОписаниеЧасть3.Шрифт = ШрифтыСтиля.ВажнаяНадписьШрифт;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		Элементы.СкопироватьСсылкуНаИнструкцию.Видимость = Ложь;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНаИнструкциюНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(СсылкаНаИнструкцию);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаИнструкцию1Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(СсылкаНаИнструкцию);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкопироватьСсылкуНаИнструкцию(Команда)
	
	ОбщегоНазначенияБЭДКлиент.СкопироватьВБуферОбмена(СсылкаНаИнструкцию,
		НСтр("ru = 'Ссылка на инструкцию скопирована в буфер обмена'"));
	
КонецПроцедуры

#КонецОбласти




