#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//// СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	//// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеДоступомУНФ.РазрешеноРедактированиеЦенДокументов();
	
	ИспользоватьУстановкуЦен = ПолучитьФункциональнуюОпцию("ИспользоватьУстановкуЦен");
	
	Элементы.Список.ТолькоПросмотр = НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.УстановитьЦены.Видимость = РазрешеноРедактированиеЦенДокументов И ИспользоватьУстановкуЦен;
	
	ЦенообразованиеСервер.УстановитьПараметрыДинамическогоСпискаВидовЦен(Список);
	Список.Параметры.УстановитьЗначениеПараметра("УстановитьЦены", НСтр("ru = 'Установить цены'"));
	
	Если НЕ ИспользоватьУстановкуЦен Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаУстановкаЦен", "Видимость", Ложь);

	КонецЕсли; 
	
	// Установить основной элемент списка
	ОсновнойВидЦен	= ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойВидЦенПродажи");
	Список.Параметры.УстановитьЗначениеПараметра("ОсновнойВидЦен", ОсновнойВидЦен);

	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("Статический",			Перечисления.ТипыВидовЦен.Статический);
	КэшЗначений.Вставить("ДинамическийПроцент", Перечисления.ТипыВидовЦен.ДинамическийПроцент);
	КэшЗначений.Вставить("ДинамическийФормула", Перечисления.ТипыВидовЦен.ДинамическийФормула);
	КэшЗначений.Вставить("ПроизвольныйЗапрос",	Перечисления.ТипыВидовЦен.ПроизвольныйЗапрос);
	КэшЗначений.Вставить("Расширение",	Перечисления.ТипыВидовЦен.Расширение);
	КэшЗначений.Вставить("ЭтоЗагрузкаИзВнешнегоИсточника", Неопределено);
	КэшЗначений.Вставить("ПараметрыДлительнойОперации", Новый Структура);
	КэшЗначений.ПараметрыДлительнойОперации.Вставить("РезультатЗагрузки",	Неопределено);
	КэшЗначений.ПараметрыДлительнойОперации.Вставить("ИдентификаторЗадания","");
	
	Параметры.Свойство("ЭтоЗагрузкаИзВнешнегоИсточника", КэшЗначений.ЭтоЗагрузкаИзВнешнегоИсточника);
	
	ПрочитатьПрайсЛисты();
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		ИндикаторКоличестваЦен();
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОчисткаЦен", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаКомандаУстановитьОсновнойЭлемент",
			"Видимость", УправлениеДоступомУНФ.РазрешеноРедактированиеЦенДокументов());
		
	КонецЕсли; 	
		
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.РегистрыСведений.ЦеныНоменклатуры,
		НастройкиЗагрузкиДанных, ЭтотОбъект, Ложь);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		Элементы.ОтборПрайсЛистыФлаг.Вид = ВидПоляФормы.ПолеНадписи;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборПрайсЛистыФлаг", "Формат",
			"БЛ=пропустить; БИ=рассчитывается;");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Группа1", "Группировка",
			ГруппировкаКолонок.Горизонтальная);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Недействителен", Ложь,,,
		Не Элементы.ПоказыватьНедействительных.Пометка);
		
	ПрочитатьИУстановитьНастройкиФормы();
	
	УстановитьУсловноеОформление();
	
	Если Параметры.ВыделитьКолонкуПорядок Тогда
		Элементы.ПорядокОтображения.ЦветФонаЗаголовка = ЦветаПалитры.ФонУправляющегоПоляУНФ;
	КонецЕсли;
	
	АдаптацияТакси();
	УстановитьОтображениеКомандыСброситьВсеОтборыНаСервере();
	ВывестиВажноеСообщениеБаннерНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если КэшЗначений.ЭтоЗагрузкаИзВнешнегоИсточника = Истина Тогда
		
		ПодключитьОбработчикОжидания("ПоказатьПомощникЗагрузкиДанныхИзВнешнегоИсточника", 0.2, Истина);
		
	КонецЕсли;
	
	ВремяЗадержкиОбработчиковОжидания = ДокументыУНФКлиент.ВремяЗадержкиОбработчиковОжидания(); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ОбработкаОповещения
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьРасчетныхЦен" Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗначокДеталиНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Детали;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ПраваяПанельСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница) 
	
	Если Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Детали Тогда
		ОбновитьДетали();
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов(); 
	
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	
	СвернутьРазвернутьПанельОтборов();  
	
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаКоличестваЦенНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеУдалениеУстаревшихЦен", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.УдалениеУстаревшихЦен.Форма", Неопределено, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаКоличестваЦенРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеУдалениеУстаревшихЦен", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.УдалениеУстаревшихЦен.Форма", Неопределено, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для каждого СтрокаСписка Из Строки Цикл
	
		СтрокаСписка.Значение.Данные.ПредставлениеРасчета = 
			Справочники.ВидыЦен.ПолучитьПредставлениеСпособаРасчетаВидаЦены(СтрокаСписка.Ключ);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОценкаПроизводительностиКлиент.ЗамерВремени("СозданиеФормы"
		+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормы"
		+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.УстановитьЦены Тогда
		
		СтандартнаяОбработка = Ложь;
		СформироватьЦены(ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьДетали = Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Детали
	И ТипЗнч(Элемент.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка");
	СписокПриАктивизацииСтрокиОбработчикНаСервере(ОбновитьДетали);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборПрайсЛисты

&НаКлиенте
Процедура ОтборПрайсЛистыФлагПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбораПрайсЛистов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПрайсЛистыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	#Если МобильныйКлиент Тогда
		
		СтандартнаяОбработка = Ложь;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПрайсЛистыПриАктивизацииСтроки(Элемент)
	
	#Если НЕ МобильныйКлиент Тогда
		
		Возврат;
		
	#КонецЕсли
	
	ДанныеТекущейСтроки = Элементы.ОтборПрайсЛисты.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеТекущейСтроки.Флаг = НЕ ДанныеТекущейСтроки.Флаг;
	ОбработатьИзменениеФлажкаОтбораПрайсЛистов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СброситьВсеОтборы(Команда) 
	
	СброситьВсеМеткиОтбораНаСервере(); 
	
КонецПроцедуры 

&НаКлиенте
Процедура НастройкиМинимальныхЦен(Команда)
	
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.Форма.ФормаУказанияМинимальныхЦен");
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)     
	 
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры 

// Процедура - обработчик выполнения команды УстановитьОсновнойЭлемент
//
&НаКлиенте
Процедура КомандаУстановитьОсновнойЭлемент(Команда)
		
	ВыбранныйЭлемент = Элементы.Список.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ВыбранныйЭлемент) Тогда
		УстановитьОсновнойЭлемент(ВыбранныйЭлемент);	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНедействительных(Команда)
	
	Элементы.ПоказыватьНедействительных.Пометка = Не Элементы.ПоказыватьНедействительных.Пометка;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Недействителен",
		Ложь,
		,
		,
		Не Элементы.ПоказыватьНедействительных.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЦеныИзВнешнегоИсточника(Команда)
	
	ДанныеТекущейСтроки = Элементы.Список.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru ='Необходимо выделить вид цен, для которого планируется загрузить цены'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;

	Если ДанныеТекущейСтроки.ТипВидаЦен <> КэшЗначений.Статический Тогда
		
		ТекстСообщения = НСтр("ru ='Загрузка предназначена только для статических видов цен.'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения, 15, НСтр("ru ='Загрузить цены из внешнего источника'"));
		Возврат;
		
	КонецЕсли;
	
	ПоказатьПомощникЗагрузкиДанныхИзВнешнегоИсточника();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	Интерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ИнтерфейсТакси = Не Интерфейс85;
	
	Элементы.ИндексФильтрыТакси.Видимость = ИнтерфейсТакси;
	Элементы.ИндексФильтры.Видимость = Интерфейс85;	
			
	Если ИнтерфейсТакси Тогда 
		
		Элементы.Переместить(Элементы.ФормаНастройкиМинимальныхЦен, Элементы.СписокКоманднаяПанель);
		Элементы.ФормаКоманднаяПанель.Видимость = Ложь;

	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ВывестиВажноеСообщениеБаннерНаСервере()
		
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.ТипСообщения			= "Информация";
	ПараметрыСообщения.Скрываемый			= Истина;  
	ПараметрыСообщения.Заголовок			= НСтр("ru = 'Варианты установки цен:'");
	
	Сообщение = СтроковыеФункции.ФорматированнаяСтрока(НСтр("ru = 'Для установки цены номенклатуры можно воспользоваться следующими инструментами:
	| • Продажи - Цены и скидки - документ ""Установка цен"" или вводом на основании документов: ""Приходная накладная"", ""Авансовый отчет"", ""Оприходование товаров""
	| • Главное - Товары и услуги - Номенклатура - Карточка товара'"));
	
	ПараметрыСообщения.Сообщение			= Сообщение; 
	
	ПараметрыСообщения.КраткоеПредставление	= НСтр("ru = 'Варианты установки цен'");
	ПараметрыСообщения.Идентификатор 		= "ВариантыУстановкиЦенВидыЦен"; 
	ПараметрыСообщения.ОбработчикЗакрытия	= "Подключаемый_ОбработчикЗакрытияОсновнойБанерФормы";
	
	Действие1 = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие1.ИмяКоманды	= "ПерейтиКДокументамУстановкаЦен";
	Действие1.Заголовок	= НСтр("ru = 'Документ ""Установка цен""'");
	Действие1.Обработчик	= "Подключаемый_ПерейтиКДокументУстановкаЦен";
	
	Действие2 = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие2.ИмяКоманды	= "ПерейтиКСпискуНоменклатуры";
	Действие2.Заголовок	= НСтр("ru = 'В карточке номенклатуры'");
	Действие2.Обработчик	= "Подключаемый_ПерейтиКСпискуНоменклатуры";
	
	МассивДействий = Новый Массив;   
	МассивДействий.Добавить(Действие1);
	МассивДействий.Добавить(Действие2);
	
	ПараметрыСообщения.ПараметрыДействия = МассивДействий;
	
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения, "ГруппаПанельИнформации");
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПерейтиКДокументУстановкаЦен()
		
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.ФормаСписка");
	
КонецПроцедуры  

&НаКлиенте
Процедура Подключаемый_ПерейтиКСпискуНоменклатуры()
		
	ОткрытьФорму("Справочник.Номенклатура.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикЗакрытияОсновнойБанерФормы()

	ДекорацияИнформацияОбработчикЗакрытьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДекорацияИнформацияОбработчикЗакрытьНаСервере()
	 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПанельИнформации", 
			"Видимость", Ложь); 
	
	КлючОбъекта		= ИмяФормы + "/НастройкиФормы";
	КлючНастройки		= "ОтображатьПанельИнформации";
	ТекущиеНастройки 	= ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастройки);
	
	Если ТекущиеНастройки = Неопределено Тогда
		ТекущиеНастройки = Новый ХранилищеЗначения(Новый Структура("Видимость", Ложь));
	КонецЕсли;
	
	ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта, КлючНастройки, ТекущиеНастройки);

КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеКомандыСброситьВсеОтборыНаСервере()
	
	Элементы.СброситьВсеОтборы.Видимость = КоличествоФильтров > 0;
	
КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере() 
	
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, Список); 
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Ссылка");
		
	СброситьВсеФлажкиДереаОтборовНаСервере();
	
	УстановитьОтображениеКомандыСброситьВсеОтборыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СброситьВсеФлажкиДереаОтборовНаСервере() 
	
	КоличествоФильтров = 0;
	КоличествоФильтровИндекс = 0;
	КоличествоДопФильтров = 0;
	
	ОтборПрайсЛистыОбъект = РеквизитФормыВЗначение("ОтборПрайсЛисты");	
    Для Каждого КорневаяСтрокаДерева Из ОтборПрайсЛистыОбъект.Строки Цикл
        
        КорневаяСтрокаДерева.Флаг = Ложь;
        
        Для Каждого ПодчиненнаяСтрока из КорневаяСтрокаДерева.Строки Цикл
            
            ПодчиненнаяСтрока.Флаг = Ложь;
            
        КонецЦикла;
        
    КонецЦикла;   
    ЗначениеВРеквизитФормы(ОтборПрайсЛистыОбъект, "ОтборПрайсЛисты");
	
КонецПроцедуры  

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов() 
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдалениеУстаревшихЦен(Результат, ДополнительныеПараметры) Экспорт
	
	ИндикаторКоличестваЦен();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Цвет текста ошибок расчета
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаПалитры.Красный30УНФ;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.Больше;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("КоличествоПопытокСлужебный");
	Отбор.ПравоеЗначение 	= 1;
	
	ОформляемоеПоле = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле			= Новый ПолеКомпоновкиДанных("Наименование");
	ОформляемоеПоле.Использование	= Истина;
	
	// Отображать сформировать цены для авторасчета
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("Отображать");
	Оформление.Значение 		= Ложь;
	Оформление.Использование 	= Истина;
	
	ГруппаИли = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Отбор = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Авто");
	Отбор.ПравоеЗначение 	= Истина;
	
	Отбор = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Недействителен");
	Отбор.ПравоеЗначение 	= Истина;
	
	ОформляемоеПоле = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле			= Новый ПолеКомпоновкиДанных("УстановкаЦен");
	ОформляемоеПоле.Использование	= Истина;
	
	// Пустой идентификатор формул
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаПалитры.Красный30УНФ;
	Оформление.Использование 	= Истина;
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("Текст");
	Оформление.Значение 		= НСтр("ru='Пустой идентификатор формул'");
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ИдентификаторФормул");
	
	ОформляемоеПоле = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле			= Новый ПолеКомпоновкиДанных("СформироватьЦены");
	ОформляемоеПоле.Использование	= Истина;
		
	// Недоступный текст для недействительных
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаПалитры.Серый10УНФ;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Недействителен");
	Отбор.ПравоеЗначение 	= Истина;
	
КонецПроцедуры


&НаСервере
Процедура ПрочитатьИУстановитьНастройкиФормы()
	
	КлючОбъекта			= ИмяФормы + "/НастройкиФормы";
	КлючНастройки = "ОтображатьПанельИнформации";
	ТекущиеНастройки 	= ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастройки);
	
	Если ТекущиеНастройки <> Неопределено 
		И ТипЗнч(ТекущиеНастройки) = Тип("ХранилищеЗначения") Тогда
		
		Элементы.ГруппаПанельИнформации.Видимость = ТекущиеНастройки.Получить().Видимость;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыполненияФоновогоЗадания(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗагрузки = Неопределено Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	КэшЗначений.ПараметрыДлительнойОперации.РезультатЗагрузки = РезультатЗагрузки;
	
	Заголовок = НСтр("ru ='Загрузка цен'");
	Если КэшЗначений.ПараметрыДлительнойОперации.РезультатЗагрузки.Статус = "Выполнено" Тогда 
		
		ТекстОповещения = НСтр("ru ='Цены номенклатуры.
			|Загрузка данных завершена.'");
		
		ПоказатьОповещениеПользователя(ТекстОповещения, , Заголовок);
		
	ИначеЕсли КэшЗначений.ПараметрыДлительнойОперации.РезультатЗагрузки.Статус = "Ошибка" Тогда
		
		ПоказатьОповещениеПользователя(РезультатЗагрузки.КраткоеПредставлениеОшибки, , Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбработкиПодготовленныхДанных()
	
	Если КэшЗначений.ПараметрыДлительнойОперации.РезультатЗагрузки = Неопределено Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Если КэшЗначений.ПараметрыДлительнойОперации.РезультатЗагрузки.Статус <> "Выполняется" Тогда 
		
		ОбработатьРезультатВыполненияФоновогоЗадания(КэшЗначений.ПараметрыДлительнойОперации.РезультатЗагрузки, Неопределено);
		Возврат;
		
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("ОбработатьРезультатВыполненияФоновогоЗадания", ЭтотОбъект, Неопределено);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения				= НСтр("ru ='Загрузка цен из внешнего источника'");
	ПараметрыОжидания.ВыводитьОкноОжидания			= Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения	= Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(КэшЗначений.ПараметрыДлительнойОперации.РезультатЗагрузки, Обработчик, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЦены(ВидЦен)
	
	Если НЕ ЗначениеЗаполнено(ВидЦен) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеВидаЦен = ПолучитьДанныеВидаЦен(ВидЦен);
	Если ДанныеВидаЦен.ТипВидаЦен = КэшЗначений.Статический
		ИЛИ ДанныеВидаЦен.ТипВидаЦен = КэшЗначений.ПроизвольныйЗапрос
		ИЛИ ДанныеВидаЦен.ТипВидаЦен = КэшЗначений.Расширение Тогда
		
		МассивВидовЦен = Новый Массив;
		МассивВидовЦен.Добавить(ВидЦен);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ВидЦен", ВидЦен);
		ПараметрыОткрытия.Вставить("РасчетИзВидаЦен", Истина);
		ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);

	ИначеЕсли НЕ ДанныеВидаЦен.РассчитыватьАвтоматически Тогда
		
		Если ДанныеВидаЦен.ЦеныАктуальны Тогда
			
			ТекстСообщения = НСтр("ru ='Цены по колонке прайс-листа актуальны. Расчет не требуется.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ВидЦен, "Список");
			
		Иначе
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ВидЦен", ВидЦен);
			ПараметрыОткрытия.Вставить("РасчетИзВидаЦен", Истина);
			ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


// Процедура сохраняет выбранный элемент в настройки
//
&НаСервере
Процедура УстановитьОсновнойЭлемент(ВыбранныйЭлемент)
	
	Если ВыбранныйЭлемент <> ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойВидЦенПродажи") Тогда
		
		ПерсональныеНастройкиРУНФ.Установить(ВыбранныйЭлемент, "ОсновнойВидЦенПродажи"); 
		
		ОсновнойВидЦен = ВыбранныйЭлемент;
		Список.Параметры.УстановитьЗначениеПараметра("ОсновнойВидЦен", ОсновнойВидЦен); 
		
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеВидаЦен(ВидЦен)
	
	ДанныеВидаЦен = Новый Структура;
	ДанныеВидаЦен.Вставить("ВыбранныйВидЦен",			ВидЦен);
	ДанныеВидаЦен.Вставить("ТипВидаЦен",				ВидЦен.ТипВидаЦен);
	ДанныеВидаЦен.Вставить("РассчитыватьАвтоматически", ВидЦен.РассчитыватьАвтоматически);
	ДанныеВидаЦен.Вставить("ЦеныАктуальны",				ВидЦен.ЦеныАктуальны);
	
	Возврат ДанныеВидаЦен;
	
КонецФункции

&НаСервере
Процедура ИндикаторКоличестваЦен()
	
	КоличествоЗаписейMax = 500000;
	КоличествоЗаписейMedium = 200000;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Количество(1) КАК КоличествоЗаписей ИЗ РегистрСведений.ЦеныНоменклатуры");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.КоличествоЗаписей > КоличествоЗаписейMax Тогда
			
			МассивФорматированныхСтрок = Новый Массив(3);
			МассивФорматированныхСтрок[0] = Новый ФорматированнаяСтрока(НСтр("ru ='Рекомендуем воспользоваться'"));
			МассивФорматированныхСтрок[1] = Новый ФорматированнаяСтрока(НСтр("ru =' очисткой цен номенклатуры'"), , , , "очистка");
			МассивФорматированныхСтрок[2] = Новый ФорматированнаяСтрока(НСтр("ru ='для ускорения работы.'"));
			
			Элементы.ДекорацияКартинкаКоличестваЦенРасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(МассивФорматированныхСтрок);
			Элементы.ДекорацияКартинкаКоличестваЦен.Картинка = БиблиотекаКартинок.УдалениеУстаревшихЦенMax;
			
		ИначеЕсли Выборка.КоличествоЗаписей > КоличествоЗаписейMedium Тогда
		
			Элементы.ДекорацияКартинкаКоличестваЦенРасширеннаяПодсказка.Заголовок = НСтр("ru ='Medium количество цен. Очистка для ускорения работы не требуется.'");
			Элементы.ДекорацияКартинкаКоличестваЦен.Картинка = БиблиотекаКартинок.УдалениеУстаревшихЦенMedium;
			
		Иначе
			
			Элементы.ДекорацияКартинкаКоличестваЦенРасширеннаяПодсказка.Заголовок = НСтр("ru ='Min количество цен. Очистка для ускорения работы не требуется.'");
			Элементы.ДекорацияКартинкаКоличестваЦен.Картинка = БиблиотекаКартинок.УдалениеУстаревшихЦенMin;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаОчисткаЦен.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#Область БыстрыйОтбор

&НаСервере
Процедура ПрочитатьПрайсЛисты()
	
	Запрос = Новый Запрос("ВЫБРАТЬ ЛОЖЬ КАК Флаг, ПЛ.Ссылка КАК ПрайсЛист ИЗ Справочник.ПрайсЛисты КАК ПЛ ГДЕ НЕ ПЛ.ПометкаУдаления");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Элементы.ОтборПрайсЛисты.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСверху;
		
	Иначе
		
		ЗначениеВРеквизитФормы(РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией), "ОтборПрайсЛисты");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагУПодчиненных(СписокЭлементов, Флаг)
	
	Для Каждого СтрокаДерева Из СписокЭлементов Цикл
		
		СтрокаДерева.Флаг = Флаг;
		
		ДочерниеСтроки = СтрокаДерева.ПолучитьЭлементы();
		Если ДочерниеСтроки.Количество() > 0 Тогда
			
			УстановитьФлагУПодчиненных(ДочерниеСтроки, Флаг);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиВыбранныеСтроки(СписокЭлементов)
	
	ПрайсЛисты = Новый Массив;
	Для Каждого СтрокаДерева Из СписокЭлементов Цикл
		
		Если СтрокаДерева.Флаг Тогда
			
			ПрайсЛисты.Добавить(СтрокаДерева.ПрайсЛист);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПрайсЛисты;
	
КонецФункции

&НаСервере
Функция ВидыЦенПрайсЛистов(ПрайсЛисты)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ВидыЦен.ВидЦен КАК ВидЦен ИЗ Справочник.ПрайсЛисты.ВидыЦен КАК ВидыЦен ГДЕ ВидыЦен.Ссылка В(&ПрайсЛисты)");
	Запрос.УстановитьПараметр("ПрайсЛисты", ПрайсЛисты);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидЦен");
	
КонецФункции

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла
&НаКлиенте
Процедура ПоказатьПомощникЗагрузкиДанныхИзВнешнегоИсточника()
	
	ДанныеТекущейСтроки = Элементы.Список.ТекущиеДанные;
	Если ЗначениеЗаполнено(ДанныеТекущейСтроки.Ссылка) Тогда
		
		НастройкиЗагрузкиДанных.Вставить("ОбщееЗначение", ДанныеТекущейСтроки.Ссылка);
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			ПослеОбработкиПодготовленныхДанных();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	Если ЗначениеЗаполнено(КэшЗначений.ПараметрыДлительнойОперации.ИдентификаторЗадания) Тогда
		
		ДлительныеОперации.ОтменитьВыполнениеЗадания(КэшЗначений.ПараметрыДлительнойОперации.ИдентификаторЗадания);
		КэшЗначений.ПараметрыДлительнойОперации.ИдентификаторЗадания = Неопределено;
		
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НастройкиЗагрузкиДанных", РезультатЗагрузки.НастройкиЗагрузкиДанных);
	//@skip-check using-form-data-to-value
	ПараметрыПроцедуры.Вставить("ТаблицаСопоставленияДанных", ДанныеФормыВЗначение(
		РезультатЗагрузки.ТаблицаСопоставленияДанных, Тип("ТаблицаЗначений")));
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка цен из внешнего источника'");
	ПараметрыВыполнения.ЗапуститьВФоне				= Истина;
	
	ИмяМетода = "РегистрыСведений.ЦеныНоменклатуры.ОбработатьПодготовленныеДанные";
	РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыПроцедуры, ПараметрыВыполнения);
	
	КэшЗначений.ПараметрыДлительнойОперации.РезультатЗагрузки		= РезультатФоновогоЗадания;
	КэшЗначений.ПараметрыДлительнойОперации.ИдентификаторЗадания	= РезультатФоновогоЗадания.ИдентификаторЗадания;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаСервере
Процедура СписокПриАктивизацииСтрокиОбработчикНаСервере(ОбновитьДетали)
		
	Если ОбновитьДетали Тогда
		ОбновитьДетали();
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьДетали()
	
	ЗаполнитьПанельДетали();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПанельДетали()
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОписаниеВидаЦен(ТекущаяСтрока);
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьОписаниеВидаЦен(ДанныеТекущейСтроки)
		
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеТекущейСтроки, "ПоказатьПредупреждение") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияПредупреждение",
			"Видимость", ДанныеТекущейСтроки.ПоказатьПредупреждение);
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеФлажкаОтбораПрайсЛистов()
	
	ТекущаяСтрокаДерева = ОтборПрайсЛисты.НайтиПоИдентификатору(
		Элементы.ОтборПрайсЛисты.ТекущиеДанные.ПолучитьИдентификатор());
	УстановитьФлагУПодчиненных(ТекущаяСтрокаДерева.ПолучитьЭлементы(), ТекущаяСтрокаДерева.Флаг);
	
	ПрайсЛисты	= НайтиВыбранныеСтроки(ОтборПрайсЛисты.ПолучитьЭлементы());
	ВидыЦен		= ВидыЦенПрайсЛистов(ПрайсЛисты);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", ВидыЦен,
		ВидСравненияКомпоновкиДанных.ВСписке, , (ВидыЦен.Количество() > 0));
	
	#Если МобильныйКлиент Тогда
		
		ТекстЗаголовка = СтрШаблон(НСтр("ru ='Фильтр по прайс-листам %1'"), ?(ВидыЦен.Количество() > 0, НСтр(
		"ru =' (установлен)'"), ""));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФильтрыНастройкиИДопИнфо", "Заголовок",
		ТекстЗаголовка);
		
	#КонецЕсли	
	
	КоличествоФильтров = ПрайсЛисты.Количество();
	КоличествоФильтровИндекс = Мин(ПрайсЛисты.Количество(), 10);
	КоличествоДопФильтров = КоличествоФильтров;
	
	УстановитьОтображениеКомандыСброситьВсеОтборыНаСервере();
	
КонецПроцедуры 

#КонецОбласти
