#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДанныеОтборов = ПолучитьИзВременногоХранилища(Параметры.АдресДанныеОтборов);
	ПредопределенныеОтборы = ПолучитьИзВременногоХранилища(Параметры.АдресПредопределенныеОтборы);
	ДоступныеОтборыТЗ = ПолучитьИзВременногоХранилища(Параметры.АдресДоступныеОтборы);

	ПредопределенныеОтборыПоУмолчанию = Параметры.АдресПредопределенныеОтборыПоУмолчанию;
	ТекущиеОтборы = Параметры.АдресДанныеОтборов;

	Если Параметры.ИмяРеквизитаСписка = "Список" Тогда
		ИмяРеквизитаСписка = "";
	Иначе
		ИмяРеквизитаСписка = Параметры.ИмяРеквизитаСписка + "_";
	КонецЕсли;

	Если ДанныеОтборов = Неопределено Или ДанныеОтборов.Количество() = 0 Тогда
		Для Каждого ПредопределенныйОтбор Из ПредопределенныеОтборы Цикл

			Если Не ПредопределенныйОтбор.Выбран Тогда
				Продолжить;
			КонецЕсли;

			НовыйОтбор = ВыбранныеОтборы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйОтбор, ПредопределенныйОтбор);
			Если НовыйОтбор.ДоступенРежимВыбораГрупп И НовыйОтбор.ВключенРежимВыбораГрупп Тогда
				НовыйОтбор.КартинкаПоля = 0;
				НовыйОтбор.КартинкаРежимаВыбораГруппы = 0;
			ИначеЕсли НовыйОтбор.ДоступенРежимВыбораГрупп Тогда
				НовыйОтбор.КартинкаПоля = 1;
				НовыйОтбор.КартинкаРежимаВыбораГруппы = 1;
			Иначе
				НовыйОтбор.КартинкаПоля = 1;
				НовыйОтбор.КартинкаРежимаВыбораГруппы = 2;
			КонецЕсли;
			НовыйОтбор.Выбран = Истина;

			Если НовыйОтбор.ЭтоПредопределенныйОтбор Тогда
				НовыйОтбор.ИмяЭлемента = НовыйОтбор.ИмяОтбора;
			Иначе
				// АПК:1036-выкл проверка орфографии не требуется
				НовыйОтбор.ИмяЭлемента = ИмяРеквизитаСписка + РаботаСОтборамиКлиентСервер.УбратьЗапрещенныеСимволы(
					НовыйОтбор.ИмяОтбора, "йцукенгшщзхъфывапролджэячсмитьбю_qwertyuiopasdfghjklzxcvbnm01234567890");
				// АПК:1036-вкл
			КонецЕсли;

		КонецЦикла;

	Иначе

		Для Каждого Отбор Из ДанныеОтборов Цикл

			Если Не Отбор.Выбран Тогда
				Продолжить;
			КонецЕсли;

			НовыйОтбор = ВыбранныеОтборы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйОтбор, Отбор);

			Если НовыйОтбор.ДоступенРежимВыбораГрупп И НовыйОтбор.ВключенРежимВыбораГрупп Тогда
				НовыйОтбор.КартинкаПоля = 0;
				НовыйОтбор.КартинкаРежимаВыбораГруппы = 0;
			ИначеЕсли НовыйОтбор.ДоступенРежимВыбораГрупп Тогда
				НовыйОтбор.КартинкаПоля = 1;
				НовыйОтбор.КартинкаРежимаВыбораГруппы = 1;
			Иначе
				НовыйОтбор.КартинкаПоля = 1;
				НовыйОтбор.КартинкаРежимаВыбораГруппы = 2;
			КонецЕсли;
			НовыйОтбор.Выбран = Истина;

			Если НовыйОтбор.ЭтоПредопределенныйОтбор Тогда
				НовыйОтбор.ИмяЭлемента = НовыйОтбор.ИмяОтбора;
			Иначе
				// АПК:1036-выкл проверка орфографии не требуется
				НовыйОтбор.ИмяЭлемента = ИмяРеквизитаСписка + РаботаСОтборамиКлиентСервер.УбратьЗапрещенныеСимволы(
					НовыйОтбор.ИмяОтбора, "йцукенгшщзхъфывапролджэячсмитьбю_qwertyuiopasdfghjklzxcvbnm01234567890");
				// АПК:1036-вкл
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	ДоступныеОтборыДерево = РеквизитФормыВЗначение("ДоступныеОтборы");
	ПреобразоватьВДеревоРекурсия(ДоступныеОтборыДерево, ДоступныеОтборыТЗ);
	ЗначениеВРеквизитФормы(ДоступныеОтборыДерево, "ДоступныеОтборы");

	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ГруппаКнопкиДобавленияИУдаленияФильтров.Видимость = Ложь;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;

	Элементы.ВыбранныеОтборыРежимОтбораПоГруппам.Видимость = Ложь;
	Элементы.ВыбранныеОтборыКартинкаРежимаВыбораГруппы.Видимость = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеОтборы

&НаКлиенте
Процедура ДоступныеОтборыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Элемент.ТекущиеДанные.Выбран Или Элемент.ТекущиеДанные.Таблица Тогда
		Возврат;
	КонецЕсли;

	Элемент.ТекущиеДанные.Выбран = Истина;
	Элемент.ТекущиеДанные.Доступен = Ложь;

	НовыйОтбор = ВыбранныеОтборы.Добавить();
	ЗаполнитьЗначенияСвойств(НовыйОтбор, Элемент.ТекущиеДанные);

	Если НовыйОтбор.ДоступенРежимВыбораГрупп И НовыйОтбор.ВключенРежимВыбораГрупп Тогда
		НовыйОтбор.КартинкаПоля = 0;
		НовыйОтбор.КартинкаРежимаВыбораГруппы = 0;
	ИначеЕсли НовыйОтбор.ДоступенРежимВыбораГрупп Тогда
		НовыйОтбор.КартинкаПоля = 1;
		НовыйОтбор.КартинкаРежимаВыбораГруппы = 1;
	Иначе
		НовыйОтбор.КартинкаПоля = 1;
		НовыйОтбор.КартинкаРежимаВыбораГруппы = 2;
	КонецЕсли;

	Если НовыйОтбор.ЭтоПредопределенныйОтбор Тогда
		НовыйОтбор.ИмяЭлемента = НовыйОтбор.ИмяОтбора;
	Иначе
		// АПК:1036-выкл проверка орфографии не требуется
		НовыйОтбор.ИмяЭлемента = ИмяРеквизитаСписка + РаботаСОтборамиКлиентСервер.УбратьЗапрещенныеСимволы(
			НовыйОтбор.ИмяОтбора, "йцукенгшщзхъфывапролджэячсмитьбю_qwertyuiopasdfghjklzxcvbnm01234567890");
		// АПК:1036-вкл
	КонецЕсли;

	НовыйОтбор.Выбран = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыбранныеОтборы

&НаКлиенте
Процедура ВыбранныеОтборыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Поле.Имя = "ВыбранныеОтборыКартинкаПоля" Или Поле.Имя = "ВыбранныеОтборыКартинкаРежимаВыбораГруппы" Тогда
		ИзменитьРежимОтбораПоГруппам(Элемент.ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеОтборыПередУдалением(Элемент, Отказ)

	СтрокиДляУдаления = Элемент.ПолучитьСтрокиДляОбработки();
	УдалитьВыбранныеОтборы(СтрокиДляУдаления);

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеОтборыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	Если ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("Число") Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	Для Каждого Отбор Из ПараметрыПеретаскивания.Значение Цикл

		Если Отбор.Выбран Или Отбор.Таблица Тогда
			Продолжить;
		КонецЕсли;

		Отбор.Выбран = Истина;
		Отбор.Доступен = Ложь;

		Если Строка = Неопределено Тогда
			Строка = ВыбранныеОтборы.Количество();
			НовыйОтбор = ВыбранныеОтборы.Вставить(Строка);
		Иначе
			СтрокаВыбранныеОтборы = ВыбранныеОтборы.НайтиПоИдентификатору(Строка);
			НовыйОтбор = ВыбранныеОтборы.Вставить(ВыбранныеОтборы.Индекс(СтрокаВыбранныеОтборы) + 1);
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(НовыйОтбор, Отбор);

		Если НовыйОтбор.ДоступенРежимВыбораГрупп И НовыйОтбор.ВключенРежимВыбораГрупп Тогда
			НовыйОтбор.КартинкаПоля = 0;
			НовыйОтбор.КартинкаРежимаВыбораГруппы = 0;
		ИначеЕсли НовыйОтбор.ДоступенРежимВыбораГрупп Тогда
			НовыйОтбор.КартинкаПоля = 1;
			НовыйОтбор.КартинкаРежимаВыбораГруппы = 1;
		Иначе
			НовыйОтбор.КартинкаПоля = 1;
			НовыйОтбор.КартинкаРежимаВыбораГруппы = 2;
		КонецЕсли;

		Если НовыйОтбор.ЭтоПредопределенныйОтбор Тогда
			НовыйОтбор.ИмяЭлемента = НовыйОтбор.ИмяОтбора;
		Иначе
			// АПК:1036-выкл проверка орфографии не требуется
			НовыйОтбор.ИмяЭлемента = ИмяРеквизитаСписка + РаботаСОтборамиКлиентСервер.УбратьЗапрещенныеСимволы(
				НовыйОтбор.ИмяОтбора, "йцукенгшщзхъфывапролджэячсмитьбю_qwertyuiopasdfghjklzxcvbnm01234567890");
			// АПК:1036-вкл
		КонецЕсли;

		НовыйОтбор.Выбран = Истина;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеОтборыПриИзменении(Элемент)

	Если ВыбранныеОтборы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПоследняяСтрока = ВыбранныеОтборы[ВыбранныеОтборы.Количество() - 1];

	Если ПоследняяСтрока <> Неопределено И ПоследняяСтрока.Заголовок = "" Тогда
		ВыбранныеОтборы.Удалить(ВыбранныеОтборы.Количество() - 1);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеОтборыПриНаведении(Элемент, Строка, Поле)
	ДанныеСтроки = Элемент.ДанныеСтроки(Строка);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ВыбранныеОтборыРежимОтбораПоГруппам.Видимость = ДанныеСтроки.ДоступенРежимВыбораГрупп;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)

	Закрыть(ПараметрыЗакрытия());

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОтбор(Команда)

	МассивВыделенныеСтроки = Элементы.ДоступныеОтборы.ПолучитьСтрокиДляОбработки();

	Для Каждого ВыделеннаяСтрокаИД Из МассивВыделенныеСтроки Цикл

		Строка = ДоступныеОтборы.НайтиПоИдентификатору(ВыделеннаяСтрокаИД);

		Если Строка.Выбран Или Строка.Таблица Тогда
			Продолжить;
		КонецЕсли;

		Строка.Доступен = Ложь;
		Строка.Выбран = Истина;

		НовыйОтбор = ВыбранныеОтборы.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйОтбор, Строка);

		Если НовыйОтбор.ДоступенРежимВыбораГрупп И НовыйОтбор.ВключенРежимВыбораГрупп Тогда
			НовыйОтбор.КартинкаПоля = 0;
			НовыйОтбор.КартинкаРежимаВыбораГруппы = 0;
		ИначеЕсли НовыйОтбор.ДоступенРежимВыбораГрупп Тогда
			НовыйОтбор.КартинкаПоля = 1;
			НовыйОтбор.КартинкаРежимаВыбораГруппы = 1;
		Иначе
			НовыйОтбор.КартинкаПоля = 1;
			НовыйОтбор.КартинкаРежимаВыбораГруппы = 2;
		КонецЕсли;

		Если НовыйОтбор.ЭтоПредопределенныйОтбор Тогда
			НовыйОтбор.ИмяЭлемента = НовыйОтбор.ИмяОтбора;
		Иначе
			// АПК:1036-выкл проверка орфографии не требуется
			НовыйОтбор.ИмяЭлемента = ИмяРеквизитаСписка + РаботаСОтборамиКлиентСервер.УбратьЗапрещенныеСимволы(
				НовыйОтбор.ИмяОтбора, "йцукенгшщзхъфывапролджэячсмитьбю_qwertyuiopasdfghjklzxcvbnm01234567890");
			// АПК:1036-вкл
		КонецЕсли;

		НовыйОтбор.Выбран = Истина;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтбор(Команда)

	МассивВыделенныеСтроки = Элементы.ВыбранныеОтборы.ПолучитьСтрокиДляОбработки();

	Для Каждого ВыделеннаяСтрокаИД Из МассивВыделенныеСтроки Цикл
		Строка = ВыбранныеОтборы.НайтиПоИдентификатору(ВыделеннаяСтрокаИД);
		ВыбранныеОтборы.Удалить(Строка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартныеНастройки(Команда)

	УстановитьПредопределенныеОтборы();

КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПоГруппам(Команда)
	ИзменитьРежимОтбораПоГруппам(Элементы.ВыбранныеОтборы.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПреобразоватьВДеревоРекурсия(Дерево, ПараметрТаблица, Идентификатор = "", ИдентификаторПоля = 0)

	ПараметрыОтбора = Новый Структура("РодительИдентификатор", Идентификатор);
	НайденныеСтроки = ПараметрТаблица.НайтиСтроки(ПараметрыОтбора);

	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		новаяСтрока = Дерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока, НайденнаяСтрока);

		НайденныйОтборМассив = ВыбранныеОтборы.НайтиСтроки(Новый Структура("ИмяОтбора", новаяСтрока.ИмяОтбора));
		Если НайденныйОтборМассив.Количество() > 0 Тогда
			НайденныйОтборМассив[0].ИдентификаторПоля = ИдентификаторПоля;
		КонецЕсли;
		новаяСтрока.ИдентификаторПоля = ИдентификаторПоля;

		ИдентификаторПоля = ИдентификаторПоля + 1;

		ПреобразоватьВДеревоРекурсия(новаяСтрока, ПараметрТаблица, НайденнаяСтрока.Идентификатор, ИдентификаторПоля);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПараметрыЗакрытия()

	СтруктураПараметров = Новый Структура;

	ВыбранныеОтборыТЗ = РеквизитФормыВЗначение("ВыбранныеОтборы");

	УдаленныеОтборыМассив = ПолучитьУдаленныеОтборы(ВыбранныеОтборыТЗ);

	АдресВыбранныеОтборы = ПоместитьВоВременноеХранилище(ВыбранныеОтборыТЗ, Новый УникальныйИдентификатор);
	АдресУдаленныеОтборы = ПоместитьВоВременноеХранилище(УдаленныеОтборыМассив, Новый УникальныйИдентификатор);

	СтруктураПараметров.Вставить("АдресВыбранныеОтборы", АдресВыбранныеОтборы);
	СтруктураПараметров.Вставить("АдресУдаленныеОтборы", АдресУдаленныеОтборы);

	Возврат СтруктураПараметров

КонецФункции

&НаСервере
Процедура УдалитьВыбранныеОтборы(Строки)

	Для Каждого СтрокаИД Из Строки Цикл
		Строка = ВыбранныеОтборы.НайтиПоИдентификатору(СтрокаИД);

		СтрокаДерева = ДоступныеОтборы.НайтиПоИдентификатору(Строка.ИдентификаторПоля);

		Если СтрокаДерева <> Неопределено Тогда
			СтрокаДерева.Доступен = Истина;
			СтрокаДерева.Выбран = Ложь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьПредопределенныеОтборы()

	ДоступныеОтборыДерево = РеквизитФормыВЗначение("ДоступныеОтборы");

	Для Каждого ВыбранныйОтбор Из ВыбранныеОтборы Цикл
		СтрокаДерева = ДоступныеОтборы.НайтиПоИдентификатору(ВыбранныйОтбор.ИдентификаторПоля);
		Если СтрокаДерева <> Неопределено Тогда
			СтрокаДерева.Доступен = Истина;
			СтрокаДерева.Выбран = Ложь;
		КонецЕсли;
	КонецЦикла;

	ВыбранныеОтборы.Очистить();

	ПредопределенныеОтборы = ПолучитьИзВременногоХранилища(ПредопределенныеОтборыПоУмолчанию);

	Для Каждого ПредопределенныйОтбор Из ПредопределенныеОтборы Цикл

		ВыбраннаяСтрока = ДоступныеОтборыДерево.Строки.НайтиСтроки(
			Новый Структура("ИмяОтбора, ЭтоПредопределенныйОтбор", ПредопределенныйОтбор.ИмяОтбора, Истина));

		Если ВыбраннаяСтрока.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		НовыйОтбор = ВыбранныеОтборы.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйОтбор, ВыбраннаяСтрока[0]);

		Если НовыйОтбор.ДоступенРежимВыбораГрупп И НовыйОтбор.ВключенРежимВыбораГрупп Тогда
			НовыйОтбор.КартинкаПоля = 0;
			НовыйОтбор.КартинкаРежимаВыбораГруппы = 0;
		ИначеЕсли НовыйОтбор.ДоступенРежимВыбораГрупп Тогда
			НовыйОтбор.КартинкаПоля = 1;
			НовыйОтбор.КартинкаРежимаВыбораГруппы = 1;
		Иначе
			НовыйОтбор.КартинкаПоля = 1;
			НовыйОтбор.КартинкаРежимаВыбораГруппы = 2;
		КонецЕсли;

		НовыйОтбор.КартинкаПоля = 1;
		НовыйОтбор.Выбран = Истина;
		Если НовыйОтбор.ЭтоПредопределенныйОтбор Тогда
			НовыйОтбор.ИмяЭлемента = НовыйОтбор.ИмяОтбора;
		Иначе
				// АПК:1036-выкл проверка орфографии не требуется
			НовыйОтбор.ИмяЭлемента = ИмяРеквизитаСписка + РаботаСОтборамиКлиентСервер.УбратьЗапрещенныеСимволы(
				НовыйОтбор.ИмяОтбора, "йцукенгшщзхъфывапролджэячсмитьбю_qwertyuiopasdfghjklzxcvbnm01234567890");
				// АПК:1036-вкл
		КонецЕсли;

		СтрокаДерева = ДоступныеОтборы.НайтиПоИдентификатору(НовыйОтбор.ИдентификаторПоля);
		Если СтрокаДерева <> Неопределено Тогда
			СтрокаДерева.Доступен = Ложь;
			СтрокаДерева.Выбран = Истина;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьУдаленныеОтборы(ВыбранныеОтборыТЗ)

	УдаленныеОтборыМассив = Новый Массив;
	ТекущиеОтборыТЗ = ПолучитьИзВременногоХранилища(ТекущиеОтборы);

	Для Каждого ТекущийОтбор Из ТекущиеОтборыТЗ Цикл
		НайденныйОтборМассив = ВыбранныеОтборыТЗ.НайтиСтроки(Новый Структура("ИмяОтбора", ТекущийОтбор.ИмяОтбора));
		Если НайденныйОтборМассив.Количество() = 0 Тогда
			УдаленныеОтборыМассив.Добавить(ТекущийОтбор.ИмяОтбора);
		КонецЕсли;
	КонецЦикла;

	Возврат УдаленныеОтборыМассив

КонецФункции

&НаКлиенте
Процедура ИзменитьРежимОтбораПоГруппам(ДанныеСтроки)

	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ДанныеСтроки.ДоступенРежимВыбораГрупп Тогда
		Возврат;
	КонецЕсли;

	ПостфиксГруппа = СтрШаблон("%1(%2)", " ", НСтр("ru = 'Группа'"));

	Если ДанныеСтроки.ВключенРежимВыбораГрупп Тогда

		ДанныеСтроки.ВключенРежимВыбораГрупп = Ложь;
		ДанныеСтроки.КартинкаПоля = 1;
		ДанныеСтроки.КартинкаРежимаВыбораГруппы = 1;
		ДанныеСтроки.Заголовок = СтрЗаменить(ДанныеСтроки.Заголовок, ПостфиксГруппа, "");
		ДанныеСтроки.Поле = СтрЗаменить(ДанныеСтроки.Поле, ".Родитель", "");

	Иначе

		ДанныеСтроки.ВключенРежимВыбораГрупп = Истина;
		ДанныеСтроки.КартинкаПоля = 0;
		ДанныеСтроки.КартинкаРежимаВыбораГруппы = 0;
		ДанныеСтроки.Заголовок = СтрШаблон("%1%2", ДанныеСтроки.Заголовок, ПостфиксГруппа);
		ДанныеСтроки.Поле = СтрШаблон("%1.Родитель", ДанныеСтроки.Поле);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти