
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Область БиблиотекаСтандартныхПодсистем
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#КонецОбласти
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	АдаптацияФормыТакси();
	АдаптацияФормыМК();
	
	УстановитьСвойстваСвернутогоПодвала();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства 
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДанныеДляИзмененияДаты = ДокументыУНФКлиент.ДанныеДляИзмененияДаты(ЭтотОбъект, Объект);
	Если ДанныеДляИзмененияДаты.ДатаНеМенялась Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура УсловиеПриИзменении(Элемент)
	Для Каждого СтрокаПромокода Из Объект.Промокоды Цикл
		СтрокаПромокода.УсловиеПредоставленияСкидки = Объект.УсловиеПредоставленияСкидки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомментарийСвернутоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПромокоды

&НаКлиенте
Процедура ПромокодыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.Промокоды.ТекущиеДанные.УсловиеПредоставленияСкидки = Объект.УсловиеПредоставленияСкидки;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект)
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ГенерацияПромокодов(Команда)
	Если Не ЗначениеЗаполнено(Объект.УсловиеПредоставленияСкидки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Для добавления промокодов, необходимо указать скидку (наценку).'");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "СкидкаНаценка";
		Сообщение.Сообщить();
	Иначе
		ОткрытьФормуГенерацииПромокодов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКомментарий(Команда)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСвойстваСвернутогоПодвала()
	
	Если ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	ОпределяющиеЭлементы = "ПодвалПраво,Итоги,ИтогоКоличество";
	РаботаСФормойДокумента.УстановитьСвойстваСвернутогоПодвала(ЭтотОбъект, ОпределяющиеЭлементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуГенерацииПромокодов()
	ПараметрыОткрытия = СтруктураПараметровОткрытияФормыГенерацииПромокодов(Объект.УсловиеПредоставленияСкидки);
	ПараметрыОткрытия.Вставить("Документ", Объект.Ссылка);
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОповещениеГенерацииПромокодов", ЭтотОбъект);
	ОткрытьФорму("Обработка.ГенерацияПромокодов.Форма.Форма", ПараметрыОткрытия, ЭтотОбъект,,,,
		ОповещениеПриЗавершении, 
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураПараметровОткрытияФормыГенерацииПромокодов(УсловиеПредоставленияСкидки)
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("УсловиеПредоставленияСкидки", УсловиеПредоставленияСкидки);
	ПараметрыОткрытия.Вставить("ШаблонПромокода", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УсловиеПредоставленияСкидки, "ШаблонПромокода"));
	Возврат ПараметрыОткрытия;
КонецФункции

&НаКлиенте
Процедура ОповещениеГенерацииПромокодов(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено И НЕ Результат = КодВозвратаДиалога.Отмена Тогда		
		АдресТаблицыПромокодов = "";
		Если Результат.Свойство("АдресТаблицыПромокодов", АдресТаблицыПромокодов) И ЗначениеЗаполнено(АдресТаблицыПромокодов) Тогда
			ЗагрузитьСгенерированныеПромокоды(АдресТаблицыПромокодов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСгенерированныеПромокоды(АдресТаблицы)
	
	ТаблицаПромокодов = ПолучитьИзВременногоХранилища(АдресТаблицы);
	Для Каждого СтрокаДобавить Из ТаблицаПромокодов Цикл
		ЗаполнитьЗначенияСвойств(объект.Промокоды.Добавить(), СтрокаДобавить);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыМК()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Номер.АвтоМаксимальнаяШирина = Истина;
	Элементы.Дата.АвтоМаксимальнаяШирина = Истина;
	Элементы.КолонкаСсылки.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Авто;
	Элементы.ПодвалПраво.РастягиватьПоГоризонтали = Ложь;
	Элементы.ПодвалПраво.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	Элементы.ПодвалПраво.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Лево;
	
	МобильныйКлиентУНФ.НастроитьПодвалФормы(Элементы);

КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыТакси()

	Если ЭтоИнтерфейсТакси Тогда
		Элементы.Комментарий.КнопкаВыбора = Истина;
		Элементы.ПодвалСвернут.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты)
	
	ДокументыУНФ.ДатаПриИзменении(ДанныеДляИзмененияДаты, ЭтотОбъект, Объект);
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКоманду(Результат.Команда);
			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

#КонецОбласти