
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ИнтерфейсПользователяБЭДКлиентСервер.ЭтоИнтерфейсВерсия8_5() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	ОтложеннаяОтправкаЭлектронныхДокументов = 
		ИнтерфейсДокументовЭДОВызовСервера.ОтложеннаяОтправкаЭлектронныхДокументов();

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(
		"РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам", ЭтотОбъект);
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(
		"РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами", ЭтотОбъект);
	
	НавигационнаяСсылка = "e1cib/app/" + ИмяФормы;
	
	ТекущийРаздел = РазделыПанелиНавигации().ВходящиеЭлектронныеДокументы;
		
	ЕстьОтборПоНепрочитанным = Ложь;
	
	ПакетноеОтображение = Истина;
	
	ВыполненПереходНаУниверсальныеСообщения = РегламентыЭДО.ВыполненПереходНаУниверсальныеСообщения();

	ПустойКонтрагент = Метаданные.ОпределяемыеТипы.КонтрагентБЭД.Тип.ПривестиЗначение();
	ТипыДоговорСКонтрагентомЭДО.ЗагрузитьЗначения(Метаданные.ОпределяемыеТипы.ДоговорСКонтрагентомЭДО.Тип.Типы());
	
	ОтображатьУдаленные = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		ИнтерфейсДокументовЭДОКлиентСервер.КлючОбъектаНастроекИнтерфейсаЭДО(),
		"ОтображатьУдаленные", Ложь);
	
	ОтображатьОбластьПредпросмотра = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы, 
		"ПоказыватьОбластьПросмотра", Истина);
	ВключенОбменЭлектроннымиДокументами = НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами();
	Элементы.ГруппаОбластьПросмотра.Видимость = ВключенОбменЭлектроннымиДокументами И ОтображатьОбластьПредпросмотра;
	
	ВидыДокументовПроизвольногоФормата.ЗагрузитьЗначения(ЭлектронныеДокументыЭДО.ВидыДокументовДляПроизвольногоФормата());
	
	ОтображениеОрганизации();
	
	УстановитьПараметрыСписков();
	
	КоличествоДокументов();
	
	УстановитьВидимостьКомандФормыПоПравам();
	
	ЗаполнитьКэшФильтровВСписках();
	ЗаполнитьКоличествоДополнительныхФильтров(ЭтотОбъект);
	УстановитьФильтрыСписков();
	Задолженность = СведенияОЗадолженности();
	ПоказатьУведомленияПоЗадолженности(ЭтотОбъект, Задолженность);
	
	ЗаполнитьДанныеПоИспользованиюПоказаТрафикаЭлектронныхДокументов();
	
	ИзменитьВидимостьКолонкиВУчете();
   	ИзменитьВидимостьКолонкиКоличестваСообщений();
	
	ОбновитьЗаголовкиЭлементов();    
		
	Если ЭтоМобильныйКлиент Тогда
		ИнтерфейсМобильногоЭДО.НастроитьЭлементыФормыТекущиеДелаЭДОЛегкийИнтерфейс(ЭтотОбъект);
	КонецЕсли;
	
	ИнтерфейсДокументовЭДО.ДобавитьПараметрыОбменаСКонтрагентами(ЭтотОбъект);
	ЛегкийИнтерфейсДокументовЭДО.УстановитьПризнакОтсутствияУчетныхЗаписейЭДОВФорме(ЭтотОбъект);
	
	ПараметрыПриСозданииНаСервере = АвтоматическоеПолучениеЭДО.НовыеПараметрыФормыСпискаПриСозданииНаСервере();
	ПараметрыПриСозданииНаСервере.ГруппаПредупреждение = Элементы.ГруппаПредупреждениеАвтоматическогоПолученияЭДО;
	АвтоматическоеПолучениеЭДО.ФормаСпискаПриСозданииНаСервере(ЭтотОбъект, ПараметрыПриСозданииНаСервере);
	
	УчетныеЗаписиЭДО.НастроитьГруппуПредупреждениеОЗавершенииДокументовТакском(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОтображениеОбластиПросмотра" Тогда
		
		ОтображатьОбластьПредпросмотра = Параметр;
		Элементы.ГруппаОбластьПросмотра.Видимость = ОтображатьОбластьПредпросмотра;
		
	ИначеЕсли СобытиеОбновитьСписки(ИмяСобытия) Тогда
		
		ОбновитьДинамическийСписокТекущегоРаздела();
	
	ИначеЕсли ИмяСобытия = "ВыполнитьСинхронизацию" Тогда
		
		Активизировать();
		ПолучитьОтправитьОбновить();
	
	ИначеЕсли ИмяСобытия = ЛегкийИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияОбъектовУчетаДокумента()
		И Параметр = ТекущийЭлектронныйДокумент Тогда

		ОбновитьДанныеПослеИзмененияОбъектовУчета();
		
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант" И Источник = "ИспользоватьРазделениеДокументовПоОтветственнымЭДО" Тогда
	
		ОбновитьОбластьПросмотра();
		
	ИначеЕсли ИмяСобытия = ИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияНастроекТекущихДелЭДО() Тогда
		
		ПриИзмененииНастроек();
		
	КонецЕсли;
	
	ЛегкийИнтерфейсДокументовЭДОКлиент.ОбработкаОповещенияДляПризнакаОтсутствияУчетныхЗаписейЭДО(ЭтотОбъект, ИмяСобытия);
	
	АвтоматическоеПолучениеЭДОКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнтерфейсДокументовЭДОКлиент.ПрерватьВыполнениеОперацииДляПодключенияКЭДО(ЭтотОбъект);
	
	ТекущиеДанные = Элементы.ВходящиеЭлектронныеДокументы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		ТекущийЭлектронныйДокумент = Элементы.ВходящиеЭлектронныеДокументы.ТекущиеДанные.ЭлектронныйДокумент;
	Иначе
		ТекущийЭлектронныйДокумент = Неопределено;	
	КонецЕсли;
	
	Если Не ДанныеВосстановленыИзНастроек Тогда
		ЗаполнитьКоличествоДополнительныхФильтров(ЭтотОбъект);
		НастроитьМассовыйВыборДокументов();
	КонецЕсли;
	
	ОбновитьФильтры();
	ВидимостьЭлементовИКоманд();
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормы, "Отборы", КэшФильтровВСписках);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ДанныеВосстановленыИзНастроек = Истина;
	ЗаполнитьКоличествоДополнительныхФильтров(ЭтотОбъект);
	НастроитьМассовыйВыборДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекущийДокументТабличныйДокументПередПечатью(Элемент, ДиалогПечати, Отказ)
	
	ВывестиНаПечать();
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументИнформацияОтправителяВыбор(Элемент, Область, СтандартнаяОбработка)
	
	РазделыПанелиНавигации = РазделыПанелиНавигации();
	
	Если Область.Имя = "ДокументУчета" Тогда
		
		ДанныеСтроки = Элементы[ТекущийРаздел].ТекущиеДанные;
		
		Если ТекущийРаздел = РазделыПанелиНавигации.ИсходящиеЭлектронныеДокументы Тогда
			
			ПоказатьУчетныйДокумент(ТекущийРаздел);
			Возврат;	
			
		КонецЕсли;
		
		Если ДанныеСтроки.КонтрольОтраженияВУчете = 0 Тогда
			
			ПоказатьСопоставлениеНоменклатуры();
			
		ИначеЕсли ДанныеСтроки.КонтрольОтраженияВУчете = 1 Тогда
			
			ПоказатьРасширенныйПодборДокументовУчета();
			
		Иначе
			
			ПоказатьУчетныйДокумент(ТекущийРаздел);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПредупреждениеАвтоматическогоПолученияЭДООбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	АвтоматическоеПолучениеЭДОКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект, Элемент, НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыВходящиеИсходящиеПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если ЭтоМобильныйКлиент Тогда
		СведенияОбЭлементахФормы = ЭтотОбъект["МК_СведенияОбЭлементахФормы"];
		Если СведенияОбЭлементахФормы = Неопределено Тогда
			Возврат;
		КонецЕсли;

		МК_АктивироватьТекущуюСтраницу(СведенияОбЭлементахФормы.СведенияОРазделах[ТекущаяСтраница.Имя]);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НадписьПредупреждениеОЗавершенииДокументовТакскомОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УчетныеЗаписиЭДОКлиент.ОбработкаНавигационнойСсылкиЗавершенияДокументовТакском(Элемент, 
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
		
КонецПроцедуры

#Область ПанельНавигации

&НаКлиенте
Процедура ДекорацияУВасЗадолженностьНажатие(Элемент)
	
	ИнтерфейсДокументовЭДОКлиент.ПоказатьСведенияОЗадолженности(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПоказатьСведенияОЗадолженностиНажатие(Элемент)
	
	ИнтерфейсДокументовЭДОКлиент.ПоказатьСведенияОЗадолженности(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПоказатьСведенияПоТекущемуТрафикуНажатие(Элемент)
	
	ОткрытьФорму("Отчет.СведенияПоТекущемуТрафикуЭДО.Форма",,,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПомощьНажатие(Элемент)
	
	ДекорацияПомощьНажатиеПоказатьВыборИзМеню(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкиНажатие(Элемент)
	
	ДекорацияНастройкиНажатиеПоказатьВыборИзМеню(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкиКартинкаНажатие(Элемент)
	
	ДекорацияНастройкиНажатиеПоказатьВыборИзМеню(Элемент);
	
КонецПроцедуры

#КонецОбласти // ПанельНавигации

#Область ПанельИтогов

&НаКлиенте
Процедура РеквизитыДокументаИОтражениеВУчетеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	УстановитьТекущимЭлементомСписокТекущегоРаздела();
	
	ВыбраннаяСсылка = ДанныеСобытия.Href;
	Если Не ЗначениеЗаполнено(ВыбраннаяСсылка) Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	Если СтрНайти(ВыбраннаяСсылка, ИдентификаторКомандыСменитьОтветственного()) Тогда
		СменитьОтветственного();
	ИначеЕсли СтрНайти(ВыбраннаяСсылка, ИдентификаторКомандыСоздатьДокументУчета()) Тогда
		СоздатьДокументУчета();
	ИначеЕсли СтрНайти(ВыбраннаяСсылка, ИдентификаторКомандыПодобратьДокументУчета1()) Тогда
		ПодобратьДокументУчета1();
	ИначеЕсли СтрНайти(ВыбраннаяСсылка, ИдентификаторКомандыПодобратьДокументУчета2()) Тогда
		ПодобратьДокументУчета2();
	ИначеЕсли СтрНайти(ВыбраннаяСсылка, ИдентификаторКомандыОткрытьДокументУчета1()) Тогда
		ОткрытьДокументУчета1();
	ИначеЕсли СтрНайти(ВыбраннаяСсылка, ИдентификаторКомандыОткрытьДокументУчета2()) Тогда
		ОткрытьДокументУчета2();
	ИначеЕсли СтрНайти(ВыбраннаяСсылка, ИдентификаторКомандыПоказатьВсеДокументыУчета()) Тогда
		ПоказатьВсеДокументыУчета();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПанельИтогов

#Область ПанельСодержимого

&НаКлиенте
Процедура ТекущийФайлПредставлениеБезВизуализацииНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЛегкийИнтерфейсДокументовЭДОКлиент.ОткрытьФайлИнформацииОтправителяДокумента(ТекущийЭлектронныйДокумент,
		ТекущийДокументОблачногоЭДО, УникальныйИдентификатор);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ТекущийФайлПредставлениеСВизуализациейНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЛегкийИнтерфейсДокументовЭДОКлиент.ОткрытьФайлИнформацииОтправителяДокумента(ТекущийЭлектронныйДокумент,
		ТекущийДокументОблачногоЭДО, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти // ПанельСодержимого

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПанельНавигации

&НаКлиенте
Процедура ПанельНавигацииПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РазделыПанелиНавигации = РазделыПанелиНавигации();
	
	Если ТекущиеДанные.ИмяСписка = РазделыПанелиНавигации.ВходящиеЭлектронныеДокументы Тогда
		
		ТекущийЭлемент = Элементы.ВходящиеЭлектронныеДокументы;
		
		Заголовок = НСтр("ru = 'ЭДО: Входящие документы'");
		ТекущийРаздел = РазделыПанелиНавигации.ВходящиеЭлектронныеДокументы;
					
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВходящиеИсходящие; 
		Элементы.СтраницыВходящиеИсходящие.ТекущаяСтраница = Элементы.СтраницаВходящиеЭлектронныеДокументы;
			 
	ИначеЕсли ТекущиеДанные.ИмяСписка = РазделыПанелиНавигации.ИсходящиеЭлектронныеДокументы Тогда 
		
		ТекущийЭлемент = Элементы.ИсходящиеЭлектронныеДокументы;
		
		Заголовок = НСтр("ru = 'ЭДО: Исходящие документы'");
		ТекущийРаздел = РазделыПанелиНавигации.ИсходящиеЭлектронныеДокументы; 
			
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВходящиеИсходящие; 
		Элементы.СтраницыВходящиеИсходящие.ТекущаяСтраница = Элементы.СтраницаИсходящиеЭлектронныеДокументы;
						
	ИначеЕсли ТекущиеДанные.ИмяСписка = РазделыПанелиНавигации.Сформировать Тогда
		
		ТекущийЭлемент = Элементы.Сформировать;
		
		Заголовок = НСтр("ru = 'ЭДО: Отправить'");
		ТекущийРаздел = РазделыПанелиНавигации.Сформировать;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСформировать;
				
	ИначеЕсли ТекущиеДанные.ИмяСписка = РазделыПанелиНавигации.Приглашения Тогда
		
		ТекущийЭлемент = Элементы.Приглашения;
		
		Заголовок = НСтр("ru = 'ЭДО: Приглашения'");
		ТекущийРаздел = РазделыПанелиНавигации.Приглашения;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПриглашения;
		
	ИначеЕсли ТекущиеДанные.ИмяСписка = РазделыПанелиНавигации.Ошибки Тогда
		
		ТекущийЭлемент = Элементы.Ошибки;
		
		Заголовок = НСтр("ru = 'ЭДО: Ошибки'");
		ТекущийРаздел = РазделыПанелиНавигации.Ошибки;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибки;
	
	КонецЕсли;
	
	ПредставлениеТекущегоРаздела = ПредставлениеРазделаПанелиНавигации(ТекущийРаздел);
	
	Если ПредыдущийРаздел = ТекущийРаздел Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущийРаздел = ТекущийРаздел;
	
	УстановитьСтраницуОжиданияПредпросмотра(ПредыдущийРаздел);
	УстановитьПараметрыПредпросмотра();
	ОбновитьФильтры();
	ВидимостьЭлементовИКоманд();
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.1, Истина);
	ТребуетсяОбновитьСчетчикиКоличестваДокументов = Истина;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыПанельНавигации

#Область ОбработчикиСобытийЭлементовТаблицыФормыВходящиеЭлектронныеДокументы

&НаКлиенте
Процедура ВходящиеЭлектронныеДокументыПриАктивизацииСтроки(Элемент)
	
	ТекущийРаздел = РазделыПанелиНавигации().ВходящиеЭлектронныеДокументы;
	
	ТекущиеДанные = ТекущиеДанныеСписка(Элемент);
	
	Если ТекущиеДанные = Неопределено
		Или ВключенаГруппировкаСтрок(ТекущиеДанные) Тогда 
		ТекущийИдентификаторПакета = "";
		ТекущийЭлектронныйДокумент = Неопределено;
		ТекущийИдентификаторДокумента = "";
	ИначеЕсли ТекущиеДанные.ЭлектронныйДокумент = ТекущийЭлектронныйДокумент Тогда
		Возврат;
	Иначе
		ТекущийИдентификаторПакета = ТекущиеДанные.КлючСортировкиПакета;
		ТекущийЭлектронныйДокумент = ТекущиеДанные.ЭлектронныйДокумент;
		ТекущийИдентификаторДокумента = ТекущиеДанные.КлючДокумента;
	КонецЕсли;
		
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭлектронныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено
		Или ВключенаГруппировкаСтрок(ТекущиеДанные) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ВходящиеЭлектронныеДокументыОтражениеВУчете Тогда
		
		ДанныеСтроки = Элементы.ВходящиеЭлектронныеДокументы.ТекущиеДанные;
				
		Если ДанныеСтроки.КонтрольОтраженияВУчете = 0 Тогда
			
			ПоказатьСопоставлениеНоменклатуры();
			
		ИначеЕсли ДанныеСтроки.КонтрольОтраженияВУчете = 1 Тогда
			
			ПоказатьРасширенныйПодборДокументовУчета();
			
		Иначе
			
			ПоказатьУчетныйДокумент(ТекущийРаздел);
			
		КонецЕсли;
		
	Иначе
		
		ОткрытьЭлектронныйДокументДляПросмотра(ТекущиеДанные.ЭлектронныйДокумент);
		
	КонецЕсли;	
 	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВходящиеЭлектронныеДокументыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ПриПолученииДанныхСписков(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭлектронныеДокументыПриИзменении(Элемент)
	
	КоличествоДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭлектронныеДокументыОбработкаЗапросаОбновления(Элемент)

	МК_ОбновитьСпискиВходящихИИсходящихДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЭлектронныеДокументыПриНаведении(Элемент, Строка, Поле)
	
	ТекущиеДанныеСписка = ТекущиеДанныеСписка(Элемент, Строка);
	
	НастроитьВидимостьКомандТекущейСтроки(ТекущиеДанныеСписка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсходящиеЭлектронныеДокументы

&НаКлиенте
Процедура ИсходящиеЭлектронныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или ВключенаГруппировкаСтрок(ТекущиеДанные) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ИсходящиеЭлектронныеДокументыОтражениеВУчете Тогда		
		ПоказатьУчетныйДокумент(ТекущийРаздел);
	Иначе	
		ОткрытьЭлектронныйДокументДляПросмотра(ТекущиеДанные.ЭлектронныйДокумент);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭлектронныеДокументыПриАктивизацииСтроки(Элемент)
	
	ТекущийРаздел = РазделыПанелиНавигации().ИсходящиеЭлектронныеДокументы;
	
	ТекущиеДанные = ТекущиеДанныеСписка(Элемент);
	
	Если ТекущиеДанные = Неопределено
		Или ВключенаГруппировкаСтрок(ТекущиеДанные) Тогда 
		ТекущийИдентификаторПакета = "";
		ТекущийЭлектронныйДокумент = Неопределено;
		ТекущийИдентификаторДокумента = "";
	ИначеЕсли ТекущиеДанные.ЭлектронныйДокумент = ТекущийЭлектронныйДокумент Тогда
		Возврат;
	Иначе
		ТекущийИдентификаторПакета = ТекущиеДанные.КлючСортировкиПакета;
		ТекущийЭлектронныйДокумент = ТекущиеДанные.ЭлектронныйДокумент;
		ТекущийИдентификаторДокумента = ТекущиеДанные.КлючДокумента;
	КонецЕсли;
		
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.2, Истина);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсходящиеЭлектронныеДокументыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
		
	ПриПолученииДанныхСписков(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭлектронныеДокументыПриИзменении(Элемент)
	
	КоличествоДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭлектронныеДокументыОбработкаЗапросаОбновления(Элемент)

	МК_ОбновитьСпискиВходящихИИсходящихДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеЭлектронныеДокументыПриНаведении(Элемент, Строка, Поле)
	
	ТекущиеДанныеСписка = ТекущиеДанныеСписка(Элемент, Строка);
	
	НастроитьВидимостьКомандТекущейСтроки(ТекущиеДанныеСписка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСформировать

&НаКлиенте
Процедура СформироватьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
	
КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиСобытийЭлементовТаблицыФормыПриглашения

&НаКлиенте
Процедура ПриглашенияПриАктивизацииСтроки(Элемент)
	УстановитьСтраницуДействийСПриглашением();
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ПриглашенияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	КартинкиСостояний = СоответствиеИндексовКартинокСостоянийЭДО();
	
	Для Каждого ТекущаяСтрока Из Строки Цикл
		
		ДанныеСтроки = ТекущаяСтрока.Значение.Данные;
		Если ДанныеСтроки.СтатусПодключения = Перечисления.СтатусыПриглашений.ТребуетсяСогласие
			Или ДанныеСтроки.СтатусПодключения = Перечисления.СтатусыПриглашений.ТребуетсяОтправить Тогда
			ДанныеСтроки.ИндексКартинкиСостояния = КартинкиСостояний.Получить("ТребуетВнимания");
		Иначе
			ДанныеСтроки.ИндексКартинкиСостояния = КартинкиСостояний.Получить("НеТребуетВнимания");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеСтроки.Контрагент) Тогда
			ДанныеСтроки.Контрагент = СтрШаблон(НСтр("ru='%1 (ИНН: %2)'", "ru"), 
				ДанныеСтроки.Наименование, ДанныеСтроки.ИНН);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриглашенияПриНаведении(Элемент, Строка, Поле)
	
	ТекущиеДанныеСписка = ТекущиеДанныеСписка(Элемент, Строка);
	
	НастроитьВидимостьКомандТекущейСтрокиРазделаПриглашения(ТекущиеДанныеСписка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОшибки

&НаКлиенте
Процедура ОшибкиПриИзменении(Элемент)
	
	КоличествоДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ВыполнениеДействийПоЭДО

&НаКлиенте
Асинх Процедура Аннулировать(Команда)
	
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);

	ЭтоПакетнаяОбработка = ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов);
	Если ЭтоПакетнаяОбработка И Не ВыполнениеДействийПоЭДОДоступноДляПакетов(ОбъектыДействий.ПакетыДокументов) Тогда
		ЭтоПакетнаяОбработка = Ложь;
		ВидДействия = ЛегкийИнтерфейсДокументовЭДОКлиент.ВидыВыполняемыхДействийСДокументом().Аннулировать;
		ТекстВопроса = ЛегкийИнтерфейсДокументовЭДОКлиент.ТекстВопросаОВыполненииДействияДляДокументаПакета(ВидДействия);
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОставитьДляОбработкиТолькоТекущийДокумент(ОбъектыДействий);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоПакетнаяОбработка Тогда
		РезультатПроверкиВозможностиАннулирования = АннулированиеДоступноДляПакетов(ОбъектыДействий.ПакетыДокументов);
		Если Не РезультатПроверкиВозможностиАннулирования.Результат Тогда
			ПоказатьПредупреждение(, РезультатПроверкиВозможностиАннулирования.ТекстОшибки);
			Возврат;
		КонецЕсли;
	Иначе
		РезультатПроверкиВозможностиАннулирования = АннулированиеДоступноДляДокументов(
			ОбъектыДействий.ЭлектронныеДокументы);
		Если Не РезультатПроверкиВозможностиАннулирования.Результат Тогда
			ПоказатьПредупреждение(, РезультатПроверкиВозможностиАннулирования.ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбъектыДействий.ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбъектыДействий.ПакетыДокументов);
	
	НаборДействий = Новый Соответствие;	
	ДействияПоЭДОАннулировать = ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.Аннулировать");
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДОАннулировать);
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать"));
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить"));
		
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));	
		
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ДействияПоЭДОАннулировать);
				
	Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки", ИнтерфейсДокументовЭДОКлиент, 
		ДополнительныеПараметры);
	
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причины аннулирования документа'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Аннулировать'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для аннулирования документа необходимо указать причину.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Утвердить(Команда)  
	
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"ЭлектронныйДокумент, ИдентификаторПакета");
	
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда		
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	
	ЭтоПакетнаяОбработка = ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов);
	Если ЭтоПакетнаяОбработка И Не ВыполнениеДействийПоЭДОДоступноДляПакетов(ОбъектыДействий.ПакетыДокументов) Тогда
		ВидДействия = ЛегкийИнтерфейсДокументовЭДОКлиент.ВидыВыполняемыхДействийСДокументом().Утвердить;
		ТекстВопроса = ЛегкийИнтерфейсДокументовЭДОКлиент.ТекстВопросаОВыполненииДействияДляДокументаПакета(ВидДействия);
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОставитьДляОбработкиТолькоТекущийДокумент(ОбъектыДействий);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НаборДействий = Новый Соответствие;	
	ДействияПоЭДОУтвердить = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Утвердить");
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДОУтвердить);
	ДействияПоЭДОСформироватьОтвет = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.СформироватьОтвет");
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДОСформироватьОтвет);
	ДействияПоЭДОПодготовитьКОтправке = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке");
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДОПодготовитьКОтправке);
	ДействияПоЭДООтправить = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить");
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДООтправить);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов;
	
	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗакрытьПринудительно(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	
	Если ТекущийРаздел = РазделыПанелиНавигации().Сформировать Тогда
		
		ОбъектыУчета = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, "Документ");
		
		Если Не ЗначениеЗаполнено(ОбъектыУчета) Тогда
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры.Вставить("ОбъектыУчета", ОбъектыУчета);
		Обработчик = Новый ОписаниеОповещения("ВыполнитьОтменуФормированияДокументовПослеВводаСтроки", 
			ЭтотОбъект, ДополнительныеПараметры);
		
	Иначе
		
		Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки", 
			ИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);
		
		ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
			"ЭлектронныйДокумент, ИдентификаторПакета");
		ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
		
		ЭтоПакетнаяОбработка = ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов);
		Если ЭтоПакетнаяОбработка И Не ВыполнениеДействийПоЭДОДоступноДляПакетов(ОбъектыДействий.ПакетыДокументов) Тогда
			ВидДействия = ЛегкийИнтерфейсДокументовЭДОКлиент.ВидыВыполняемыхДействийСДокументом().ЗакрытьПринудительно;
			ТекстВопроса = ЛегкийИнтерфейсДокументовЭДОКлиент.ТекстВопросаОВыполненииДействияДляДокументаПакета(ВидДействия);
			Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				ОставитьДляОбработкиТолькоТекущийДокумент(ОбъектыДействий);
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбъектыДействий.ЭлектронныеДокументы);
		ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбъектыДействий.ПакетыДокументов);
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения", ОписаниеОповещения);
	
	НаборДействий = Новый Соответствие;	
	ДействияПоЭДОЗакрытьПринудительно = ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ЗакрытьПринудительно");
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДОЗакрытьПринудительно);
	
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);	
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ДействияПоЭДОЗакрытьПринудительно);
	
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причину закрытия документооборота'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Закрыть электронный документ'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для закрытия документооборота по выбранным ЭД необходимо указать причину закрытия.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗапроситьУточнение(Команда)

	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);

	ЭтоПакетнаяОбработка = ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов);
	Если ЭтоПакетнаяОбработка И Не ВыполнениеДействийПоЭДОДоступноДляПакетов(ОбъектыДействий.ПакетыДокументов) Тогда
		ВидДействия = ЛегкийИнтерфейсДокументовЭДОКлиент.ВидыВыполняемыхДействийСДокументом().ЗапроситьУточнение;
		ТекстВопроса = ЛегкийИнтерфейсДокументовЭДОКлиент.ТекстВопросаОВыполненииДействияДляДокументаПакета(ВидДействия);
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОставитьДляОбработкиТолькоТекущийДокумент(ОбъектыДействий);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбъектыДействий.ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбъектыДействий.ПакетыДокументов);
	
	НаборДействий = Новый Соответствие;	
	ОсновноеДействие = ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ЗапроситьУточнение");
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ОсновноеДействие);
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, 
		ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, 
		ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Отправить"));
		
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));	
		
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ОсновноеДействие);
				
	Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки", ИнтерфейсДокументовЭДОКлиент, 
		ДополнительныеПараметры);
	
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причины запроса уточнения'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Запросить уточнение'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.Строка = НСтр("ru = 'Причина уточнения: '");;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для уточнения необходимо указать причину.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьПодписаниеИсходящегоДокумента(ОбъектыДействий, ОписаниеОповещения)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбъектыДействий.ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбъектыДействий.ПакетыДокументов);
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения", 
		ОписаниеОповещения);
	
	НаборДействий = Новый Соответствие;	
	
	ДействияПоЭДООтклонитьПодписание = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтклонитьПодписание");
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДООтклонитьПодписание);
	
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);	
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ДействияПоЭДООтклонитьПодписание);
	
	Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки", 
		ИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);
	
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причину отклонения документа'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Отклонить'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
	НСтр("ru = 'Для отказа от подписания по выбранным ЭД необходимо указать причину.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтказатьсяОтПодписания(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда
		Возврат;
	КонецЕсли;
		
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);	
	
	ЭтоПакетнаяОбработка = ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов);
	Если ЭтоПакетнаяОбработка И Не ВыполнениеДействийПоЭДОДоступноДляПакетов(ОбъектыДействий.ПакетыДокументов) Тогда
		ВидДействия = ЛегкийИнтерфейсДокументовЭДОКлиент.ВидыВыполняемыхДействийСДокументом().Отклонить;
		ТекстВопроса = ЛегкийИнтерфейсДокументовЭДОКлиент.ТекстВопросаОВыполненииДействияДляДокументаПакета(ВидДействия);
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОставитьДляОбработкиТолькоТекущийДокумент(ОбъектыДействий);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.СтраницыВходящиеИсходящие.ТекущаяСтраница = Элементы.СтраницаВходящиеЭлектронныеДокументы Тогда
		
		Если ВыполненПереходНаУниверсальныеСообщения Тогда
			
			ЭлектронныеДокументыЭДОКлиент.ОтказатьсяОтПодписания(ОбъектыДействий, ОписаниеОповещения);
		Иначе
		    ИнтерфейсДокументовЭДОКлиент.ОтклонитьОбъекты(ОбъектыДействий, ОписаниеОповещения);

		КонецЕсли;
		
	Иначе
		
		ОтклонитьПодписаниеИсходящегоДокумента(ОбъектыДействий, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подписать(Команда)
	
	Если Элементы.СтраницыВходящиеИсходящие.ТекущаяСтраница = Элементы.СтраницаВходящиеЭлектронныеДокументы Тогда
		
		Если Элементы.ВходящиеЭлектронныеДокументы.ПолучитьСтрокиДляОбработки().Количество() Тогда
			ПодключитьОбработчикОжидания("ВыполнитьКомандаПодписать", 0.1, Истина);
		КонецЕсли;	
		
	Иначе
		
		Если Элементы.ИсходящиеЭлектронныеДокументы.ПолучитьСтрокиДляОбработки().Количество() Тогда
			
			ПодключитьОбработчикОжидания("ВыполнитьКомандаПодписать", 0.1, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПринятьАннулирование(Команда)

	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда		
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	
	ЭтоПакетнаяОбработка = ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов);
	Если ЭтоПакетнаяОбработка И Не ВыполнениеДействийПоЭДОДоступноДляПакетов(ОбъектыДействий.ПакетыДокументов) Тогда
		ВидДействия = ЛегкийИнтерфейсДокументовЭДОКлиент.ВидыВыполняемыхДействийСДокументом().ПринятьАннулирование;
		ТекстВопроса = ЛегкийИнтерфейсДокументовЭДОКлиент.ТекстВопросаОВыполненииДействияДляДокументаПакета(ВидДействия);
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОставитьДляОбработкиТолькоТекущийДокумент(ОбъектыДействий);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НаборДействий = Новый Соответствие;	
	
	ДействияПоЭДОПринятьАннулирование = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПринятьАннулирование");
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДОПринятьАннулирование);
	
	ДействияПоЭДОПодписать = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать");
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДОПодписать);
	
	ДействияПоЭДОПодготовитьКОтправке = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке");
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДОПодготовитьКОтправке);
	
	ДействияПоЭДООтправить = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить");
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДООтправить);
				
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения", 
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияДействийПоЭДО", ПараметрыВыполненияДействийПоЭДО);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ДополнительныеПараметры);

	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтклонитьАннулирование(Команда)

	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда		
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);

	ЭтоПакетнаяОбработка = ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов);
	Если ЭтоПакетнаяОбработка И Не ВыполнениеДействийПоЭДОДоступноДляПакетов(ОбъектыДействий.ПакетыДокументов) Тогда
		ВидДействия = ЛегкийИнтерфейсДокументовЭДОКлиент.ВидыВыполняемыхДействийСДокументом().ОтклонитьАннулирование;
		ТекстВопроса = ЛегкийИнтерфейсДокументовЭДОКлиент.ТекстВопросаОВыполненииДействияДляДокументаПакета(ВидДействия);
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОставитьДляОбработкиТолькоТекущийДокумент(ОбъектыДействий);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;
	
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбъектыДействий.ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбъектыДействий.ПакетыДокументов);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения", 
		ОписаниеОповещения);
	
	НаборДействий = Новый Соответствие;
		
	ДействияПоЭДООтклонитьАннулирование = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтклонитьАннулирование");
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДООтклонитьАннулирование);
	
	ДействияПоЭДОПодписать = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать");
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДОПодписать);
	
	ДействияПоЭДОПодготовитьКОтправке = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке");
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДОПодготовитьКОтправке);
	
	ДействияПоЭДООтправить = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить");
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДООтправить);
		
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);	
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ДействияПоЭДООтклонитьАннулирование);
					
	Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки", 
		ИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);
	
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причины отклонения аннулирования документа'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Отклонить аннулирование'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для отклонения аннулирования документа необходимо указать причину.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Асинх Процедура Отправить(Команда)
	
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда		
		Возврат;
	КонецЕсли;
		
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	
	ЭтоПакетнаяОбработка = ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов);
	Если ЭтоПакетнаяОбработка И Не ВыполнениеДействийПоЭДОДоступноДляПакетов(ОбъектыДействий.ПакетыДокументов) Тогда
		ВидДействия = ЛегкийИнтерфейсДокументовЭДОКлиент.ВидыВыполняемыхДействийСДокументом().Отправить;
		ТекстВопроса = ЛегкийИнтерфейсДокументовЭДОКлиент.ТекстВопросаОВыполненииДействияДляДокументаПакета(ВидДействия);
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОставитьДляОбработкиТолькоТекущийДокумент(ОбъектыДействий);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;

	НаборДействий = Новый Соответствие;	
	ДействияПоЭДОПодготовитьКОтправке = ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ПодготовитьКОтправке");
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДОПодготовитьКОтправке);
	ДействияПоЭДООтправить = ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Отправить");
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДООтправить);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	
	ПараметрыВыполненияДействийПоЭДО = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов;

	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВернутьНаПодготовкуКОтправке(Команда)
	
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"ЭлектронныйДокумент, ИдентификаторПакета");
		
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда		
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	
	ЭтоПакетнаяОбработка = ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов);
	Если ЭтоПакетнаяОбработка И Не ВыполнениеДействийПоЭДОДоступноДляПакетов(ОбъектыДействий.ПакетыДокументов) Тогда
		ВидДействия = ЛегкийИнтерфейсДокументовЭДОКлиент.ВидыВыполняемыхДействийСДокументом().ВернутьНаПодготовкуКОтправке;
		ТекстВопроса = ЛегкийИнтерфейсДокументовЭДОКлиент.ТекстВопросаОВыполненииДействияДляДокументаПакета(ВидДействия);
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОставитьДляОбработкиТолькоТекущийДокумент(ОбъектыДействий);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НаборДействий = Новый Соответствие;	
	ДействияПоЭДООтменитьОтправку = ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтменитьОтправку");
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ДействияПоЭДООтменитьОтправку);
		
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект);
	
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов;

	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтправитьОбновитьКоманда(Команда)
	
	ПолучитьОтправитьОбновить();
	
КонецПроцедуры

#КонецОбласти // ВыполнениеДействийПоЭДО

&НаКлиенте
Процедура ЗагрузитьНовыйДокументСДиска(Команда)
	
	Шаблон = НСтр("ru = 'Для создания документа на основании файла необходимо подключиться к ЭДО и повторить действие.'");
	Операция = НСтр("ru = 'Создание документа на основании файла'");
	Если ИнтерфейсДокументовЭДОКлиент.ПрерватьВыполнениеОперацииДляПодключенияКЭДО(ЭтотОбъект, Шаблон, Операция) Тогда
		Возврат;
	КонецЕсли;

	ЛегкийИнтерфейсДокументовЭДОКлиент.СоздатьДокументыПоФайламКоманда(УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	Шаблон = НСтр("ru = 'Для продолжения отправки документа необходимо подключиться к ЭДО и повторить действие.'");
	Операция = НСтр("ru = 'Подписание и отправка документа'");
	Если ИнтерфейсДокументовЭДОКлиент.ПрерватьВыполнениеОперацииДляПодключенияКЭДО(ЭтотОбъект, Шаблон, Операция) Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Сформировать.ПолучитьСтрокиДляОбработки().Количество() Тогда
		ПодключитьОбработчикОжидания("ВыполнитьСформироватьПодписатьИОтправить", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура РаспаковатьКонтейнеры(Команда)

	СинхронизацияЭДОКлиент.РаспаковатьТранспортныеКонтейнеры(Элементы.Ошибки.ПолучитьСтрокиДляОбработки());
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтмененКонтейнера(Команда)
	
	УстановитьСтатусОтменен(Элементы.Ошибки.ПолучитьСтрокиДляОбработки());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПриглашение(Команда)
	
	ОчиститьСообщения();
	ДанныеПриглашений = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"КлючПриглашения, ИдентификаторОрганизации, ИдентификаторКонтрагента, Контрагент, Организация");

	ИсходящиеПриглашения = Новый Массив;

	Для Каждого ДанныеПриглашения Из ДанныеПриглашений Цикл	
		ИсходящееПриглашение = СинхронизацияЭДОКлиент.НовоеПриглашениеНаИдентификатор();
		ЗаполнитьЗначенияСвойств(ИсходящееПриглашение, ДанныеПриглашения);	
		ИсходящиеПриглашения.Добавить(ИсходящееПриглашение);
	КонецЦикла;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОтправкаПриглашенийОповещениеОЗавершении", ЭтотОбъект);
		
	СинхронизацияЭДОКлиент.ОтправитьПриглашения(ИсходящиеПриглашения, ЭтотОбъект, ОбработчикОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПринятьПриглашения(Команда)
	
	Если Элементы.Приглашения.ПолучитьСтрокиДляОбработки().Количество() Тогда
		БлокируемыеЭлементы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Элементы.ПриглашенияПринятьПриглашения.Имя);
		УстановитьБлокировкуЭлементов(БлокируемыеЭлементы);
		ПодключитьОбработчикОжидания("НачатьПринятиеПриглашений", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтклонитьПриглашения(Команда)
	
	Если Элементы.Приглашения.ПолучитьСтрокиДляОбработки().Количество() Тогда
		БлокируемыеЭлементы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Элементы.ПриглашенияОтклонитьПриглашения.Имя);
		УстановитьБлокировкуЭлементов(БлокируемыеЭлементы);
		ПодключитьОбработчикОжидания("НачатьОтклонениеПриглашений", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПометитьКакПрочитанное(Команда)
	
	ТекущийСписок = Элементы[ТекущийРаздел];
	
	Если ТекущийСписок <> Неопределено Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ПометитьКакПрочтенные(ТекущийСписок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЭДО(Команда)
	
	НастройкиЭДОКлиент.ОткрытьФормуНастроекЭДО();
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЭлектронныеДокументы(Команда)
		
	ВывестиНаПечать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДокументооборотЦеликом(Команда)
	
	ЭлектронныеДокументы = Элементы[ТекущийРаздел].ПолучитьСтрокиДляОбработки();
	
	Если Не ЗначениеЗаполнено(ЭлектронныеДокументы) Тогда
		ТекстСообщения = НСтр("ru = 'Для выгрузки необходимо выбрать электронный документ'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОКлиент.ВыгрузитьДокументооборотЦеликом(ЭлектронныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЭлектронныеДокументыВФорматеПДФ(Команда)
	
	ЭлектронныеДокументы = Элементы[ТекущийРаздел].ПолучитьСтрокиДляОбработки();
	
	Если Не ЗначениеЗаполнено(ЭлектронныеДокументы) Тогда
		ТекстСообщения = НСтр("ru = 'Для выгрузки необходимо выбрать электронный документ'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОКлиент.ВыгрузитьЭлектронныеДокументыВФорматеPDF(ЭлектронныеДокументы, 
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЭлектронныеДокументыДляФНС(Команда)
	
	ЭлектронныеДокументы = Элементы[ТекущийРаздел].ПолучитьСтрокиДляОбработки();
	
	Если Не ЗначениеЗаполнено(ЭлектронныеДокументы) Тогда
		ТекстСообщения = НСтр("ru = 'Для выгрузки необходимо выбрать электронный документ'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОКлиент.ВыгрузитьЭлектронныеДокументыДляФНС(ЭлектронныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМашиночитаемыеДоверенности(Команда)

	МашиночитаемыеДоверенностиКлиент.ОткрытьОбщуюФормуСписковМЧД();
	
КонецПроцедуры

&НаКлиенте
Процедура НовоеПриглашение(Команда)
	
	Шаблон = НСтр("ru = 'Для продолжения отправки приглашений необходимо подключиться к ЭДО и повторить действие.'");
	Операция = НСтр("ru = 'Отправка приглашений'");
	Если ИнтерфейсДокументовЭДОКлиент.ПрерватьВыполнениеОперацииДляПодключенияКЭДО(ЭтотОбъект, Шаблон, Операция) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПриглашения = СинхронизацияЭДОКлиент.НовыеПараметрыОткрытияПомощникаОтправкиПриглашения();
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ПараметрыПриглашения.Контрагент = Контрагент;
	КонецЕсли;
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыПриглашения.Организация = Организация;
	КонецЕсли;
	
	СинхронизацияЭДОКлиент.ОткрытьПомощникОтправкиПриглашения(ПараметрыПриглашения);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодписи(Команда)
	ОбщегоНазначенияБЭДКлиент.ОткрытьФормуБЭД(
		"Обработка.ИнтерфейсДокументовЭДО.Форма.ПроверкаПодписей");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПользовательскиеОтборы(Команда)
	
	ТекущийСписок = ЭтотОбъект[ТекущийРаздел];
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НастройкаОтборовСпискаЗавершение", ЭтотОбъект);
	ИнтерфейсДокументовЭДОКлиент.ОткрытьНастройкиОтборовСписка(ОповещениеОЗавершении, ЭтотОбъект, 
		ТекущийСписок.КомпоновщикНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлы(Команда)
	
	Шаблон = НСтр("ru = 'Для выполнения массовой отправки файлов необходимо подключиться к ЭДО и повторить действие.'");
	Операция = НСтр("ru = 'Массовая отправка файлов'");
	Если ИнтерфейсДокументовЭДОКлиент.ПрерватьВыполнениеОперацииДляПодключенияКЭДО(ЭтотОбъект, Шаблон, Операция) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьФормуМассовойЗагрузкиФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ЛегкийИнтерфейсДокументовЭДОКлиент.ОткрытьФайлИнформацииОтправителяДокумента(ТекущийЭлектронныйДокумент,
		ТекущийДокументОблачногоЭДО, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьОтветственного()
	
	ЭлектронныеДокументы = Элементы[ТекущийРаздел].ПолучитьСтрокиДляОбработки();
	ДополнитьДокументамиПакетов(ЭлектронныеДокументы);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеСменыОтветственного", ЭтотОбъект);

	ИнтерфейсДокументовЭДОКлиент.ПеренаправитьЭлектронныеДокументы(ЭлектронныеДокументы, ОповещениеОЗавершении);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФильтры(Команда)
	
	РазделыПанелиНавигации = РазделыПанелиНавигации();
	ДоступенФильтрОтветственный = (ТекущийРаздел = РазделыПанелиНавигации.ВходящиеЭлектронныеДокументы
		Или ТекущийРаздел = РазделыПанелиНавигации.ИсходящиеЭлектронныеДокументы);
	ДоступенФильтрСостояние = (ТекущийРаздел = РазделыПанелиНавигации.ВходящиеЭлектронныеДокументы
		Или ТекущийРаздел = РазделыПанелиНавигации.ИсходящиеЭлектронныеДокументы);
	ДоступенФильтрТипДокумента = (ТекущийРаздел = РазделыПанелиНавигации.ВходящиеЭлектронныеДокументы
		Или ТекущийРаздел = РазделыПанелиНавигации.ИсходящиеЭлектронныеДокументы);
	ДоступенФильтрТипРегламента = (ТекущийРаздел = РазделыПанелиНавигации.ВходящиеЭлектронныеДокументы
		Или ТекущийРаздел = РазделыПанелиНавигации.ИсходящиеЭлектронныеДокументы);
	ДоступенФильтрСтатусПриглашения = (ТекущийРаздел = РазделыПанелиНавигации.Приглашения);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Организация", Организация);
	ПараметрыОткрытия.Вставить("Контрагент", Контрагент);
	ПараметрыОткрытия.Вставить("Период", Период);
	ПараметрыОткрытия.Вставить("Ответственный", Ответственный);
	ПараметрыОткрытия.Вставить("Договор", Договор);
	ПараметрыОткрытия.Вставить("Состояние", Состояние);
	ПараметрыОткрытия.Вставить("ТипДокумента", ТипДокумента);
	ПараметрыОткрытия.Вставить("ТипРегламента", ТипРегламента);
	ПараметрыОткрытия.Вставить("СтатусПриглашения", СтатусПриглашения);
	ПараметрыОткрытия.Вставить("КоличествоДополнительныхОтборов", КоличествоДополнительныхОтборовСписков[ТекущийРаздел]);
	ПараметрыОткрытия.Вставить("ДоступенФильтрОтветственный", ДоступенФильтрОтветственный);
	ПараметрыОткрытия.Вставить("ДоступенФильтрСостояние", ДоступенФильтрСостояние);
	ПараметрыОткрытия.Вставить("ДоступенФильтрТипДокумента", ДоступенФильтрТипДокумента);
	ПараметрыОткрытия.Вставить("ДоступенФильтрТипРегламента", ДоступенФильтрТипРегламента); 
	ПараметрыОткрытия.Вставить("ДоступенФильтрСтатусПриглашения", ДоступенФильтрСтатусПриглашения);
	
	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ФильтрыТекущихДелЭДОЛегкийИнтерфейс", ПараметрыОткрытия, ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ПослеЗакрытияФормыФильтров", ЭтотОбъект));
		
КонецПроцедуры
	
&НаКлиенте
Процедура ОчиститьФильтры(Команда)
	
	ОчиститьПользовательскиеОтборы();
	ВидимостьЭлементовИКоманд();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьМассовыйВыборДокументов(Команда)

	ИспользоватьРежимМножественногоВыделенияВСписках = Не ИспользоватьРежимМножественногоВыделенияВСписках;
	
	НастроитьМассовыйВыборДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСоСписками

&НаСервере
Процедура ОтображениеОрганизации()

	НесколькоОрганизаций = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	УчетныеЗаписиЭДО.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.УчетныеЗаписиЭДО КАК УчетныеЗаписиЭДО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
		
		НесколькоОрганизаций = Истина;	
	
	КонецЕсли;
	
	Элементы.ВходящиеЭлектронныеДокументыОрганизация.Видимость = НесколькоОрганизаций;
	Элементы.ИсходящиеЭлектронныеДокументыОрганизация.Видимость = НесколькоОрганизаций;
	Элементы.СформироватьОрганизация.Видимость = НесколькоОрганизаций;
	Элементы.ПриглашенияОрганизация.Видимость = НесколькоОрганизаций;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСписков()
		
	РежимОтображения = "ВсеДокументы";
	
	СписокПользователей = Новый Массив;
	СписокПользователей.Добавить(Пользователи.АвторизованныйПользователь());
	Если РежимОтображения <> "МоиДокументы" Тогда
		СписокПользователей.Добавить(ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	КонецЕсли;
	
	НастройкиОтображения = Новый Структура;
	НастройкиОтображения.Вставить("РежимОтображения", РежимОтображения);
	НастройкиОтображения.Вставить("СписокПользователей", СписокПользователей);
	НастройкиОтображения.Вставить("ОтправлятьВходящиеДокументыНаУтверждение", Истина);
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ДатаПереходаНаВерсиюСПрочтенностью = РаботаСПрочтениямиВызовСервера.ПолучитьДатуПереходаНаВерсиюСПрочтенностью();
	
	СостоянияЭДОЗакрыт = Новый Массив;
	СостоянияЭДОЗакрыт.Добавить(Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно);	
	СостоянияЭДОЗакрыт.Добавить(Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением);	
	СостоянияЭДОЗакрыт.Добавить(Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонениемПриглашения);	
	СостоянияЭДОЗакрыт.Добавить(Перечисления.СостоянияДокументовЭДО.ЗакрытСОшибкойПередачи);
	
	СостоянияЭДООжидается = Новый Массив;
	СостоянияЭДООжидается.Добавить(Перечисления.СостоянияДокументовЭДО.ОжидаетсяИзвещениеОПолучении);	
	СостоянияЭДООжидается.Добавить(Перечисления.СостоянияДокументовЭДО.ОжидаетсяИзвещениеПоОтклонению);	
	СостоянияЭДООжидается.Добавить(Перечисления.СостоянияДокументовЭДО.ОжидаетсяИсправление);	
	СостоянияЭДООжидается.Добавить(Перечисления.СостоянияДокументовЭДО.ОжидаетсяОтветНаПриглашение);
	СостоянияЭДООжидается.Добавить(Перечисления.СостоянияДокументовЭДО.ОжидаетсяПередачаОператору);	
	СостоянияЭДООжидается.Добавить(Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждение);
	СостоянияЭДООжидается.Добавить(Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеАннулирования);	
	СостоянияЭДООжидается.Добавить(Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеОператора);
	
	СостоянияЭДОТребуетсяДействие = Новый Массив;
	СостоянияЭДОТребуетсяДействие.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание);	
	СостоянияЭДОТребуетсяДействие.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяУтверждение);	
	СостоянияЭДОТребуетсяДействие.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования);	
	СостоянияЭДОТребуетсяДействие.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяУточнение);
	
	Для каждого ИмяСписка Из ИменаСписковФормы() Цикл
		
		Если ИмяСписка = "Сформировать" Тогда
			
			УстановитьУсловноеОформлениеСписков(ИмяСписка, "Дата");	
			Продолжить;
			
		ИначеЕсли ИмяСписка = "Приглашения" Тогда
			
			УстановитьУсловноеОформлениеСписков(ИмяСписка, "ДатаИзмененияСтатуса");	
			Продолжить;
			
		ИначеЕсли ИмяСписка = "Ошибки" Тогда
			
			Продолжить;
			
		Иначе
			
			УстановитьУсловноеОформлениеСписков(ИмяСписка, "ДатаПолучения");	
			
		КонецЕсли;
		
		Список = ЭтотОбъект[ИмяСписка];
		
		Список.Параметры.УстановитьЗначениеПараметра("ОтображатьУдаленные", ОтображатьУдаленные);
		Список.Параметры.УстановитьЗначениеПараметра("РежимОтображения", НастройкиОтображения.РежимОтображения);
		Список.Параметры.УстановитьЗначениеПараметра("СписокПользователей", НастройкиОтображения.СписокПользователей);
		Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ТекущийПользователь);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаПереходаНаВерсиюСПрочтенностью",
			ДатаПереходаНаВерсиюСПрочтенностью); 
		
		УстановитьВариантОтображенияДокументовСписка(ИмяСписка);
	
	КонецЦикла;
	
	Сформировать.Параметры.УстановитьЗначениеПараметра("ПустойКонтрагент", 
		ПустойКонтрагент);
	Сформировать.Параметры.УстановитьЗначениеПараметра("ТипыДоговорСКонтрагентомЭДО", 
		ТипыДоговорСКонтрагентомЭДО);
	
	Приглашения.Параметры.УстановитьЗначениеПараметра("ПустойКонтрагент", 
		ПустойКонтрагент);
	
	СтатусыНеРаспакованныхТранспортныхСообщенийБЭД = СтатусыНеРаспакованныхТранспортныхСообщенийБЭД();
	Ошибки.Параметры.УстановитьЗначениеПараметра("СтатусыНеРаспакованныхТранспортныхСообщенийБЭД",
		СтатусыНеРаспакованныхТранспортныхСообщенийБЭД);
	
	НаправлениеВходящий = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Входящий");
	Ошибки.Параметры.УстановитьЗначениеПараметра("Направление",
		НаправлениеВходящий);
		
	Ошибки.Параметры.УстановитьЗначениеПараметра("ОтображатьУдаленные", ОтображатьУдаленные);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВариантОтображенияДокументовСписка(ИмяСписка, НаправлениеСортировки = Неопределено)
		
	ПоляОграничения = Новый Массив;
	
	БазовыеНастройкиКомпоновки = Новый КомпоновщикНастроекКомпоновкиДанных;
	БазовыеНастройкиКомпоновки.ЗагрузитьНастройки(ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки);
	БазовыеНастройкиКомпоновки.Настройки.Порядок.Элементы.Очистить();
	
	ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(
		БазовыеНастройкиКомпоновки.ПользовательскиеНастройки);
	ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.Элементы.Очистить();
	
	ЭлементПорядка = ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(
		Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ДатаПолучения");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	ЭлементПорядка.Использование = Истина;
	
	ЭлементПорядка = ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(
		Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ВремяПолучения");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование = Истина;
	
	ЭлементПорядка = ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(
		Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("КлючСортировкиПакета");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование = Истина;
	
	ЭлементПорядка = ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(
		Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ПорядокСортировкиВПакете");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование = Истина;
	
	ЭлементПорядка = ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(
		Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("НомерСлужебный");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование = Истина; 
	
	СлужебныеПоляПорядка = ДоступныеДляУпорядочиванияПоляСписков();
	
	Для Каждого ПолеПорядка Из 
		ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Порядок.ДоступныеПоляПорядка.Элементы Цикл
		ИмяПоля = Строка(ПолеПорядка.Поле);
		Если СлужебныеПоляПорядка.Найти(ИмяПоля) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПоляОграничения.Добавить(ИмяПоля);
	КонецЦикла;	
	
	Если ПоляОграничения.Количество() > 0 Тогда
		ЭтотОбъект[ИмяСписка].УстановитьОграниченияИспользованияВПорядке(ПоляОграничения);
	КонецЕсли;
		
	СлужебныеПоляОтбора = ДоступныеДляОтбораПоляСписков();
		
	ПоляОграничения = Новый Массив;
	
	Для Каждого ПолеПорядка Из 
		ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы Цикл
		ИмяПоля = Строка(ПолеПорядка.Поле);
		Если СлужебныеПоляОтбора.Найти(ИмяПоля) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		ПоляОграничения.Добавить(ИмяПоля);
	КонецЦикла;	
	
	Если ПоляОграничения.Количество() > 0 Тогда
		ЭтотОбъект[ИмяСписка].УстановитьОграниченияИспользованияВОтборе(ПоляОграничения);
	КонецЕсли;
			
	Элементы[ИмяСписка].Обновить();
		
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ДоступныеДляУпорядочиванияПоляСписков()

	СлужебныеПоляПорядка = Новый Массив;
	СлужебныеПоляПорядка.Добавить("ДатаДокумента");
	СлужебныеПоляПорядка.Добавить("ДатаПолучения");
	СлужебныеПоляПорядка.Добавить("ВремяПолучения");
	СлужебныеПоляПорядка.Добавить("КлючСортировкиПакета");
	СлужебныеПоляПорядка.Добавить("ПорядокСортировкиВПакете");
	СлужебныеПоляПорядка.Добавить("НомерСлужебный");
	Возврат СлужебныеПоляПорядка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеДляОтбораПоляСписков()

	СлужебныеПоляОтбора = Новый Массив;
	СлужебныеПоляОтбора.Добавить("Контрагент"); 
	СлужебныеПоляОтбора.Добавить("Организация"); 
	СлужебныеПоляОтбора.Добавить("ДатаПолучения");
	СлужебныеПоляОтбора.Добавить("СуммаДокумента");
	СлужебныеПоляОтбора.Добавить("СостояниеЭДО");
	СлужебныеПоляОтбора.Добавить("ТипДокумента");
	СлужебныеПоляОтбора.Добавить("Ответственный");
	СлужебныеПоляОтбора.Добавить("ВидДокумента");
	СлужебныеПоляОтбора.Добавить("ИдентификаторПакета");
	СлужебныеПоляОтбора.Добавить("ТипРегламента");
	СлужебныеПоляОтбора.Добавить("ЭлектронныйДокумент");
	Возврат СлужебныеПоляОтбора;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеСписков(ИмяСписка, ИмяПоляДаты)
	
	Если ИмяСписка <> "Сформировать" И ИмяСписка <> "Приглашения" Тогда
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПрочтениеДокументовЭДО") Тогда
			
			Элемент = УсловноеОформление.Элементы.Добавить();
			
			Элемент.Представление = НСтр("ru = 'Отображение непрочитанных документов'");
			
			ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + "Контрагент"].Имя);
			ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + "ЭлектронныйДокумент"].Имя);
			ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + "СуммаДокумента"].Имя);
			ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + "ДатаПолучения"].Имя);
			
			Если НесколькоОрганизаций Тогда
				ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
				ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + "Организация"].Имя);
			КонецЕсли;
			
			ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + ".Прочтен");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = Ложь;
			
			Шрифт = ШрифтыСтиля.ЗаголовокЧетвертогоУровня;
			Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Шрифт);
			
			Если ЕстьДублирующийсяЭлемент(УсловноеОформление.Элементы, Элемент) Тогда
				УсловноеОформление.Элементы.Удалить(Элемент);
			КонецЕсли;
			
		КонецЕсли;
		
		Элемент = УсловноеОформление.Элементы.Добавить();				
		Элемент.Представление = НСтр("ru = 'Отображение помеченных на удаление электронных документов'");
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + "Контрагент"].Имя);
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + "СуммаДокумента"].Имя);
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + "ЭлектронныйДокумент"].Имя);
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + "ДатаПолучения"].Имя); 
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + "Состояние"].Имя);
		
		Если НесколькоОрганизаций Тогда
			ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + "Организация"].Имя);
		КонецЕсли;
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + ".ПометкаУдаления");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		Шрифт = ШрифтыСтиля.ЗачеркнутыйШрифт85БЭД;
		Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Шрифт);
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.Серый);
		
		ИнтерфейсДокументовЭДО.УстановитьУсловноеОформлениеСпискаДляПодсветкиНевалидныхПодписейПоМЧД(ЭтотОбъект,
			ИмяСписка);
			
		УстановитьУсловноеОформлениеДляВыделенияДокументовПакета(ИмяСписка);
			
	КонецЕсли;
	
	Если ИмяСписка <> "Приглашения" Тогда
			
		Элемент = УсловноеОформление.Элементы.Добавить();
	
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + ИмяПоляДаты].Имя);

		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
		ОтборЭлемента.Использование = Истина;
	
		Элемент.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ=ЧЧ:мм");
			
		Элемент.Представление = 
			НСтр("ru = 'Отображать дату сегодняшних писем только в виде времени ""09:46"" (стандартная настройка)'");

		Если ЕстьДублирующийсяЭлемент(УсловноеОформление.Элементы, Элемент) Тогда
			УсловноеОформление.Элементы.Удалить(Элемент);
		КонецЕсли;
		
	КонецЕсли;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + ИмяПоляДаты].Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
	ОтборЭлемента.Использование = Истина;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца);
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ='dd MMMM'");
			
	Элемент.Представление = 
		НСтр("ru = 'Отображать дату писем за эту неделю в виде ""Вт 10.06"" (стандартная настройка)'");
	
	Если ЕстьДублирующийсяЭлемент(УсловноеОформление.Элементы, Элемент) Тогда
		УсловноеОформление.Элементы.Удалить(Элемент);
	КонецЕсли;

	Элемент = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + ИмяПоляДаты].Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца);
	ОтборЭлемента.Использование = Истина;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоГода);
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ='dd.MM'");
	
	Элемент.Представление = НСтр("ru = 'Отображать дату писем за этот год в виде ""10.06"" (стандартная настройка)'");
	
	Если ЕстьДублирующийсяЭлемент(УсловноеОформление.Элементы, Элемент) Тогда
		УсловноеОформление.Элементы.Удалить(Элемент);
	КонецЕсли;
		
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяСписка + ИмяПоляДаты].Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + "." + ИмяПоляДаты);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоГода);
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ='dd.MM.yy'");
			
	Элемент.Представление = НСтр("ru = 'Отображать дату писем за период более ранний, чем этот год в виде ""10.06.2022"" 
		|(стандартная настройка)'");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДляВыделенияДокументовПакета(ИмяСписка)
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяСписка);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + ".КлючДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТекущийИдентификаторДокумента");
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + ".КлючСортировкиПакета");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТекущийИдентификаторПакета");
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСписка + ".КлючСортировкиПакета");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаПалитры.СветлоСерыйБЭД);
	
	Если ЕстьДублирующийсяЭлемент(УсловноеОформление.Элементы, Элемент) Тогда
		УсловноеОформление.Элементы.Удалить(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИменаСписковФормы()
	
	ИменаСписковФормы = Новый Массив;
	
	ИменаСписковФормы.Добавить("ВходящиеЭлектронныеДокументы");
	ИменаСписковФормы.Добавить("ИсходящиеЭлектронныеДокументы");
	ИменаСписковФормы.Добавить("Сформировать");
	ИменаСписковФормы.Добавить("Приглашения");
	ИменаСписковФормы.Добавить("Ошибки");
	
	Возврат ИменаСписковФормы; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РазделыПанелиНавигации()
	
	РазделыПанелиНавигации = Новый Структура;
	РазделыПанелиНавигации.Вставить("Сформировать", "Сформировать");
	РазделыПанелиНавигации.Вставить("ВходящиеЭлектронныеДокументы", "ВходящиеЭлектронныеДокументы");
	РазделыПанелиНавигации.Вставить("ИсходящиеЭлектронныеДокументы", "ИсходящиеЭлектронныеДокументы");
	РазделыПанелиНавигации.Вставить("Приглашения", "Приглашения");
	РазделыПанелиНавигации.Вставить("Ошибки", "Ошибки");
	Возврат РазделыПанелиНавигации;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеРазделаПанелиНавигации(Раздел)
	
	РазделыПанелиНавигации = Новый Соответствие;
	РазделыПанелиНавигации.Вставить(РазделыПанелиНавигации().Сформировать, НСтр("ru = 'Создать новый'"));
	РазделыПанелиНавигации.Вставить(РазделыПанелиНавигации().ВходящиеЭлектронныеДокументы, НСтр("ru = 'Входящие'"));
	РазделыПанелиНавигации.Вставить(РазделыПанелиНавигации().ИсходящиеЭлектронныеДокументы, НСтр("ru = 'Исходящие'"));
	РазделыПанелиНавигации.Вставить(РазделыПанелиНавигации().Приглашения, НСтр("ru = 'Приглашения'"));
	РазделыПанелиНавигации.Вставить(РазделыПанелиНавигации().Ошибки, НСтр("ru = 'Ошибки распаковки'"));
	Возврат РазделыПанелиНавигации[Раздел];
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоляФильтров()
	
	ПоляФильтров = Новый Массив;
	ПоляФильтров.Добавить("Организация");
	ПоляФильтров.Добавить("Контрагент"); 
	ПоляФильтров.Добавить("Состояние");
	ПоляФильтров.Добавить("Период");
	ПоляФильтров.Добавить("ТипДокумента");
	ПоляФильтров.Добавить("Ответственный");
	ПоляФильтров.Добавить("ТипРегламента");
	ПоляФильтров.Добавить("СтатусПриглашения");
	
	Возврат ПоляФильтров; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборы(Форма, Раздел = Неопределено, ПолеОтбора = Неопределено, ПроверятьПересечениеОтборов = Истина)
	
	Форма.СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
	Если Раздел = Неопределено Тогда
		Раздел = Форма.ТекущийРаздел;
	КонецЕсли;
	Если ПолеОтбора = Неопределено Тогда
		ПолеОтбора = Форма.ТекущийЭлемент.Имя;
	КонецЕсли;
	Значение = Форма[ПолеОтбора];
	Форма.КэшФильтровВСписках[Раздел].Вставить(ПолеОтбора, Значение);
	
	Отбор = Форма[Раздел].Отбор;
	
	ИмяГруппыОтбора = ИмяГруппыФильтров();
	ГруппаБыстрыйОтбор = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Отбор.Элементы, ИмяГруппыОтбора);
	Если ГруппаБыстрыйОтбор = Неопределено Тогда
		ГруппаБыстрыйОтбор = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			Отбор.Элементы, ИмяГруппыОтбора, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	КонецЕсли;
	
	Режим = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ГруппаБыстрыйОтбор.РежимОтображения = Режим;
	
	Если ПолеОтбора = "Организация" 
		Или ПолеОтбора = "Контрагент" 
		Или (ПолеОтбора = "Ответственный" 
			И ЭтоВходящиеИсходящие(Раздел)) Тогда
		
		Использование = ЗначениеЗаполнено(Значение);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаБыстрыйОтбор, ПолеОтбора, Значение,
			ВидСравненияКомпоновкиДанных.Равно, ПолеОтбора, Использование, Режим);
				
	ИначеЕсли ПолеОтбора = "Состояние" 
		И ЭтоВходящиеИсходящие(Раздел) Тогда
			
		Если Значение = "Все" Тогда
			
			Значение = "";
			Форма[ПолеОтбора] = Значение;
					
		КонецЕсли;
		
		УстановитьОтборПоСостоянию(Форма, Значение, ГруппаБыстрыйОтбор, Режим);
		
	ИначеЕсли ПолеОтбора = "Период" Тогда
		
		Использование = ЗначениеЗаполнено(Значение);
		ДатаНачала = НачалоДня(Форма.Период.ДатаНачала);
		ДатаОкончания = КонецДня(?(ЗначениеЗаполнено(Форма.Период.ДатаОкончания), Форма.Период.ДатаОкончания, Дата(3999, 12, 31)));
		
		Если Раздел <> "Сформировать" Тогда
			Поле = "ДатаПолучения";
		Иначе
			Поле = "Дата";
		КонецЕсли;
		
		ЭлементыУжеДобавлены = 
			ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(ГруппаБыстрыйОтбор, Поле).Количество() <> 0;
		Если Не ЭлементыУжеДобавлены Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, Поле,
				ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ДатаНачала, "ОтборПериодДатаНачала");
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, Поле,
				ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ДатаОкончания, "ОтборПериодДатаОкончания");
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаБыстрыйОтбор, Неопределено, ДатаНачала,
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно, "ОтборПериодДатаНачала", Использование, Режим);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаБыстрыйОтбор, Неопределено, ДатаОкончания,
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, "ОтборПериодДатаОкончания", Использование, Режим);
		
	ИначеЕсли ПолеОтбора = "ТипДокумента" 
		И Раздел <> "Сформировать"
		И Раздел <> "Приглашения" Тогда
		
		Использование = ЗначениеЗаполнено(Значение);
		
		Если Раздел = "Сформировать" Тогда
			Использование = Ложь;
		КонецЕсли;
		
		Поле = "ВидДокумента";
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаБыстрыйОтбор, Поле, Значение,
			ВидСравненияКомпоновкиДанных.Равно, ПолеОтбора, Использование, Режим);
		
	ИначеЕсли ПолеОтбора = "ВидДокумента" И Раздел = "Сформировать" Тогда
		
		Использование = ЗначениеЗаполнено(Значение);
		Поле = "Документ.ВидДокумента";
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаБыстрыйОтбор, Поле, Значение,
			ВидСравненияКомпоновкиДанных.Равно, ПолеОтбора, Использование, Режим);
			
	ИначеЕсли ПолеОтбора = "СтатусПриглашения" И Раздел = "Приглашения" Тогда
		
		ЗначенияОтбора = Новый СписокЗначений;
		
		Если Значение = "Все" Тогда
			
			Значение = "";
			Форма[ПолеОтбора] = Значение;
		
		ИначеЕсли Значение = "ТребуетсяОтправить" Тогда
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ТребуетсяОтправить"));
		ИначеЕсли Значение = "Принято" Тогда
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.Принято"));
		ИначеЕсли Значение = "Отклонено" Тогда
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.Отклонено"));
		ИначеЕсли Значение = "ОжидаемСогласия" Тогда
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ОжидаемСогласия"));
		ИначеЕсли Значение = "ТребуетсяСогласие" Тогда
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ТребуетсяСогласие"));
		ИначеЕсли Значение = "НастройкаРоуминга" Тогда
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.НастройкаРоуминга"));
		ИначеЕсли Значение = "Ошибка" Тогда
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.Ошибка"));
		ИначеЕсли Значение = "НеТребуется" Тогда
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.НеТребуется"));
		ИначеЕсли Значение = "ТребуетВнимания" Тогда
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ТребуетсяОтправить"));
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ТребуетсяСогласие"));
		КонецЕсли;

		Поле = "СтатусПодключения";
		Использование = ЗначенияОтбора.Количество() > 0;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаБыстрыйОтбор, Поле, ЗначенияОтбора,
			ВидСравненияКомпоновкиДанных.ВСписке, ПолеОтбора, Использование, Режим);
	
	ИначеЕсли ПолеОтбора = "ТипРегламента" И ЭтоВходящиеИсходящие(Раздел) Тогда
		
		Если Значение = "Все" Тогда
			
			Значение = "";
			Форма[ПолеОтбора] = Значение;
			
		КонецЕсли; 
		
		Использование = ЗначениеЗаполнено(Значение); 
		
		Если Значение = "Только произвольные документы" Тогда // АПК:1297 Не проверять на локализацию
			ЗначениеОтбора = ПредопределенноеЗначение("Перечисление.ТипыРегламентовЭДО.Неформализованный");	
		КонецЕсли;
						
		Поле = "ТипРегламента";
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаБыстрыйОтбор, Поле, ЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.Равно, ПолеОтбора, Использование, Режим);
								
		СписокВидовДокументов = Форма.ВидыДокументовПроизвольногоФормата;

		Поле = "ВидДокумента";
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаБыстрыйОтбор, Поле, СписокВидовДокументов,
			ВидСравненияКомпоновкиДанных.ВСписке, ПолеОтбора, Использование, Режим);

	КонецЕсли;
	
	Если ПроверятьПересечениеОтборов Тогда
		ОбработатьПересечениеОтборов(Форма, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоСостоянию(Форма, Знач Значение, ГруппаБыстрыйОтбор, Знач Режим)

	СписокСостояний = Новый СписокЗначений;
	
	Поле = "СостояниеЭДО";
	Если Значение = "Утвердить" Тогда
		
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяУтверждение"));
		
	ИначеЕсли Значение = "Подписать" Тогда
		
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписание"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещенияПоОтклонению"));
	
	ИначеЕсли Значение = "ОтказаноВПодписиКонтрагенту" Тогда
		
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОтказаноВПодписиКонтрагенту"));
		
	ИначеЕсли Значение = "КонтрагентОтказалВПодписи" Тогда
		
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.КонтрагентОтказалВПодписи"));
		
	ИначеЕсли Значение = "Аннулировать" Тогда
		
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования"));
		
	ИначеЕсли Значение = "Исправить" Тогда
		
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяУточнение"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования"));
		
	ИначеЕсли Значение = "Завершен" Тогда
		
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ЗакрытПринудительно"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ЗакрытСОтклонением")); 
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ЗакрытСОтклонениемПриглашения"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ЗакрытСОшибкойПередачи"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОбменЗавершен"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением"));
		
	ИначеЕсли Значение = "Отправлен" Тогда
		
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяИзвещениеОПолучении"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяИзвещениеПоОтклонению")); 
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяИсправление"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяОтветНаПриглашение"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПередачаОператору"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждение"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеАннулирования"));
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеОператора")); 
		
	ИначеЕсли Значение = "Отправить" Тогда
		
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправке"));
		
	ИначеЕсли Значение = "ТребуетВнимания" Тогда
		
		СписокСостояний = СостоянияДокументовТребующиеВнимания();
		
	КонецЕсли;
	
	Использование = СписокСостояний.Количество();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаБыстрыйОтбор, Поле, СписокСостояний,
		ВидСравненияКомпоновкиДанных.ВСписке, "Состояние", Использование, Режим);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДляИзмененныхФильтров(Знач ИзмененныеФильтры)
	
	Для Каждого Фильтр Из ИзмененныеФильтры Цикл
		УстановитьОтборы(ЭтотОбъект, ТекущийРаздел, Фильтр);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоВходящиеИсходящие(Знач Список)
	
	Возврат Список <> "Сформировать" И Список <> "Приглашения" И Список <> "Ошибки";
				
КонецФункции

&НаСервереБезКонтекста
Процедура ПредставлениеСостояния(ДанныеСтроки)
	
	Если ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяУтверждение Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Утвердить'");
		
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Подписать аннулирование'");
		
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения
		Или ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещенияПоОтклонению Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Подписать отклонение'");
		
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяУточнение Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Исправить'");
				
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Аннулировать'");
		
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправке
		Или ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправка Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Отправить'");
		
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание
		Или ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Подписать'");
		
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеАннулирования Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Отправлен на аннулирование'");
		
	ИначеЕсли СтрНайти(ДанныеСтроки.СостояниеЭДО, "Ожидается") <> 0 Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Отправлен'");
		
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.НеСформирован Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Не сформирован'");
		
	ИначеЕсли ДокументВСостоянииЗавершен(ДанныеСтроки) Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Завершен'");
		
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.Аннулирован Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Аннулирован'");
			
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Завершен с отклонением'");
	
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОтказаноВПодписиКонтрагенту Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Отказано контрагенту'");
	
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.КонтрагентОтказалВПодписи Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Контрагент отказал'");
		
	ИначеЕсли ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонениемПриглашения Тогда
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Контрагент отклонил приглашение'");
		
	Иначе
		
		ДанныеСтроки.Состояние = НСтр("ru = 'Завершен'");
		
	КонецЕсли;
	
	КартинкиСостояний = СоответствиеИндексовКартинокСостоянийЭДО();
	
	Если ДанныеСтроки.Свойство("КартинкаСтатуса") Тогда 
		
		ДанныеСтроки.КартинкаСтатуса = 0;
		
		Если ДанныеСтроки.Свойство("Контрагент") И ЗначениеЗаполнено(ДанныеСтроки.Контрагент) Тогда
			
			Если ДокументТребуетВнимания(ДанныеСтроки) Тогда
				
				ДанныеСтроки.КартинкаСтатуса = КартинкиСостояний.Получить("ТребуетВнимания");
							
			Иначе
				
				ДанныеСтроки.КартинкаСтатуса = КартинкиСостояний.Получить("НеТребуетВнимания");
			
			КонецЕсли;			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоответствиеИндексовКартинокСостоянийЭДО()
	
	КартинкиСостояний = Новый Соответствие;
	КартинкиСостояний.Вставить("ТребуетВнимания", 1);
	КартинкиСостояний.Вставить("НеТребуетВнимания", 0);
	
	Возврат КартинкиСостояний;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДокументТребуетВнимания(Знач ДанныеСтроки)
	
	Возврат ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяУтверждение 
		Или ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание
		Или ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования
		Или ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяУточнение 
		Или ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования
		Или ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения
		Или ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправке
		Или ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения
		Или ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещенияПоОтклонению;
		
КонецФункции

&НаСервереБезКонтекста
Функция ДокументВСостоянииЗавершен(Знач ДанныеСтроки)
	
	Возврат ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно 
		ИЛИ ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением
		ИЛИ ДанныеСтроки.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ЗакрытСОшибкойПередачи;
		
КонецФункции

&НаСервере
Процедура ОбновитьДинамическийСписокТекущегоРаздела(Знач ПеречитыватьДанные = Истина)
		
	Если ПеречитыватьДанные Тогда
		Элементы[ТекущийРаздел].Обновить();
	КонецЕсли;
	
	КоличествоДокументов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПриПолученииДанныхСписков(ИмяЭлемента, Настройки, Строки)
			
	ИдентификаторыДокументовПакетов = Новый Соответствие;
	ИспользоватьКолонкуОтражениеВУчете = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольОтраженияВУчетеЭДО");
	
	Если ИспользоватьКолонкуОтражениеВУчете Тогда
		МассивДокументов = Строки.ПолучитьКлючи();
		ВсеОснования = ИнтеграцияЭДО.ОбъектыУчетаЭлектронныхДокументов(МассивДокументов);
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Строки Цикл
		
		ДанныеСтроки = ТекущаяСтрока.Значение.Данные; 
				
		СписокДокументов = ИдентификаторыДокументовПакетов[ДанныеСтроки.КлючСортировкиПакета];
		
		Если СписокДокументов = Неопределено Тогда
			
			СписокДокументов = Новый ТаблицаЗначений;
			СписокДокументов.Колонки.Добавить("ПорядокСортировкиВПакете");
			СписокДокументов.Колонки.Добавить("НомерСлужебный");
			
		КонецЕсли;		
		
		Документ = СписокДокументов.Добавить();
		Документ.ПорядокСортировкиВПакете = ДанныеСтроки.ПорядокСортировкиВПакете;
		Документ.НомерСлужебный = ДанныеСтроки.НомерСлужебный;
		
		ИдентификаторыДокументовПакетов.Вставить(ДанныеСтроки.КлючСортировкиПакета, СписокДокументов);	
		
	КонецЦикла;	
	
	ВыводитьКоличествоНовыхСообщений = Ложь;
	Для Каждого ТекущаяСтрока Из Строки Цикл
		
		ДанныеСтроки = ТекущаяСтрока.Значение.Данные;
		
		Если ДанныеСтроки.Свойство("КоличествоНепрочитанныхСообщений") Тогда
			ВыводитьКоличествоНовыхСообщений = Истина;
		КонецЕсли;
		
		Если ИспользоватьКолонкуОтражениеВУчете Тогда
			
			ОтборОснований = Новый Структура("ЭлектронныйДокумент", ДанныеСтроки.ЭлектронныйДокумент);
			Основания = ВсеОснования.НайтиСтроки(ОтборОснований);
			КоличествоОснований = Основания.Количество();
			
			Если КоличествоОснований > 0 Тогда

				ШаблонСтроки = НСтр("ru = 'Учтен (%1)'");
				ДанныеСтроки.ОтражениеВУчете = СтрШаблон(ШаблонСтроки, КоличествоОснований);

			Иначе

				ДанныеСтроки.ОтражениеВУчете = "";

			КонецЕсли;
			
		КонецЕсли;
					
		ПредставлениеСостояния(ДанныеСтроки);
							
		ДанныеСтроки.КлючДокумента = Строка(ДанныеСтроки.ЭлектронныйДокумент.УникальныйИдентификатор());
		Если ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторПакета) Тогда
			ДанныеСтроки.КлючПакета = Строка(ДанныеСтроки.ИдентификаторПакета);
		Иначе
			ДанныеСтроки.КлючПакета = "";
		КонецЕсли;
		
		ТекущиеИдентификаторы = ИдентификаторыДокументовПакетов[ДанныеСтроки.КлючСортировкиПакета]; 
		
		Если ТекущиеИдентификаторы <> Неопределено И ДанныеСтроки.КлючСортировкиПакета <> "" Тогда
			
			НачалоДня = НачалоДня(ДанныеСтроки.ВремяПолучения);
			ДатаПолученияСоВременем = ДанныеСтроки.ДатаПолучения + (ДанныеСтроки.ВремяПолучения - НачалоДня);
			ДанныеСтроки.ДатаПолучения = ДатаПолученияСоВременем;
			
			ТекущиеИдентификаторыСвернута = Новый ТаблицаЗначений;
			ТекущиеИдентификаторыСвернута.Колонки.Добавить("ПорядокСортировкиВПакете");
			
			Для Индекс = 0 По ТекущиеИдентификаторы.Количество() - 1 Цикл 
				ТекущиеИдентификаторыСвернута.Добавить();	
			КонецЦикла;
			
			ЗначениеКолонки = ТекущиеИдентификаторы.ВыгрузитьКолонку("ПорядокСортировкиВПакете");
			ТекущиеИдентификаторыСвернута.ЗагрузитьКолонку(ЗначениеКолонки, "ПорядокСортировкиВПакете");
			
			ТекущиеИдентификаторыСвернута.Свернуть("ПорядокСортировкиВПакете");
			
			Если ТекущиеИдентификаторыСвернута.Количество() = 1 Тогда 
				ТекущиеИдентификаторы.Сортировать("НомерСлужебный Убыв");
			Иначе
				ТекущиеИдентификаторы.Сортировать("ПорядокСортировкиВПакете Возр, НомерСлужебный Убыв");
			КонецЕсли;
			
			ДанныеСтроки.ПервыйДокументПакета = ДанныеСтроки.НомерСлужебный = ТекущиеИдентификаторы[0].НомерСлужебный;
			
			Если Не ДанныеСтроки.ПервыйДокументПакета И ЗначениеЗаполнено(ДанныеСтроки.КлючСортировкиПакета) Тогда
				
				Если ДанныеСтроки.Свойство("ДатаПолучения") Тогда
					ДанныеСтроки.ДатаПолучения = "";
				КонецЕсли;
				Если ДанныеСтроки.Свойство("Контрагент") Тогда
					ДанныеСтроки.Контрагент = " ";
				КонецЕсли;
				Если ДанныеСтроки.Свойство("Организация") Тогда
					ДанныеСтроки.Организация = "";
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ДанныеСтроки.ПервыйДокументПакета = Истина;
			
		КонецЕсли;

	КонецЦикла;
	
	Если ВыводитьКоличествоНовыхСообщений Тогда
		УстановитьКоличествоНепрочитанныхСообщений(Строки, Строки.ПолучитьКлючи());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДинамическиеСпискиФормы()
	
	Если Не НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИмяСписка Из ИменаСписковФормы() Цикл

		Элементы[ИмяСписка].Обновить();

	КонецЦикла;
	Элементы.Ошибки.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеФильтров()
	
	Если ИменаСписковФормы().Найти(ТекущийРаздел) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоФильтров = 0;
	КоличествоДополнительныхОтборов = КоличествоДополнительныхОтборовСписков[ТекущийРаздел];

	ЗаголовокКоманды = НСтр("ru='Фильтры'");
	ЕстьДокументыКОбработкеСкрытьПанель = Ложь;
	
	Для Каждого Отбор Из ПоляФильтров() Цикл
		Если ЗначениеЗаполнено(ЭтотОбъект[Отбор]) И Отбор <> "Новые" Тогда
			КоличествоФильтров = КоличествоФильтров + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоФильтров > 0 Или КоличествоДополнительныхОтборов > 0 Тогда
		КнопкаОчисткиБыстрыхОтборовВидна = Истина;
		ЗаголовокКоманды = СтрШаблон(НСтр("ru='Фильтры (%1)'"), КоличествоФильтров + КоличествоДополнительныхОтборов);
	Иначе
		КнопкаОчисткиБыстрыхОтборовВидна = Ложь;
	КонецЕсли;
	
	РазделыПанелиНавигации = РазделыПанелиНавигации();
	Если ТекущийРаздел = РазделыПанелиНавигации.Сформировать Тогда
		Элементы.СформироватьОткрытьФильтры.Заголовок = ЗаголовокКоманды;
		Элементы.СформироватьОчиститьФильтры.Видимость = КнопкаОчисткиБыстрыхОтборовВидна;
	ИначеЕсли ТекущийРаздел = РазделыПанелиНавигации.ВходящиеЭлектронныеДокументы Тогда
		Элементы.ВходящиеЭлектронныеДокументыОткрытьФильтры.Заголовок = ЗаголовокКоманды;
		Элементы.ВходящиеЭлектронныеДокументыОчиститьФильтры.Видимость = КнопкаОчисткиБыстрыхОтборовВидна;
	ИначеЕсли ТекущийРаздел = РазделыПанелиНавигации.ИсходящиеЭлектронныеДокументы Тогда
		Элементы.ИсходящиеЭлектронныеДокументыОткрытьФильтры.Заголовок = ЗаголовокКоманды;
		Элементы.ИсходящиеЭлектронныеДокументыОчиститьФильтры.Видимость = КнопкаОчисткиБыстрыхОтборовВидна;
	ИначеЕсли ТекущийРаздел = РазделыПанелиНавигации.Приглашения Тогда
		Элементы.ПриглашенияОткрытьФильтры.Заголовок = ЗаголовокКоманды;
		Элементы.ПриглашенияОчиститьФильтры.Видимость = КнопкаОчисткиБыстрыхОтборовВидна;
	ИначеЕсли ТекущийРаздел = РазделыПанелиНавигации.Ошибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоМобильныйКлиент Тогда
		МК_ОформитьКнопкуПоказатьСкрытьФильтры();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФильтры()
	
	Для Каждого Фильтр Из ПоляФильтров() Цикл
		ЭтотОбъект[Фильтр] = Неопределено;
	КонецЦикла;
	
	СпискиСФильтрами = ИменаСписковФормы();
	Если СпискиСФильтрами.Найти(ТекущийРаздел) = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ФильтрыСписка = КэшФильтровВСписках.Получить(ТекущийРаздел);
	Если ФильтрыСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеПоляФильтров = ПоляФильтров();
	Для Каждого Фильтр Из ФильтрыСписка Цикл
		Если ДоступныеПоляФильтров.Найти(Фильтр.Ключ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтотОбъект[Фильтр.Ключ] = Фильтр.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПользовательскиеОтборы()
	
	ФильтрыСписка = КэшФильтровВСписках.Получить(ТекущийРаздел);
	Если ФильтрыСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеПоляФильтров = ПоляФильтров();
	Для Каждого Фильтр Из ФильтрыСписка Цикл
		Если ДоступныеПоляФильтров.Найти(Фильтр.Ключ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтотОбъект[Фильтр.Ключ] = Неопределено; 
		УстановитьОтборы(ЭтотОбъект,, Фильтр.Ключ);
	КонецЦикла;
	
	Для Каждого Список Из ИменаСписковФормы() Цикл
		Отбор = ПользовательскийОтборСписка(ЭтотОбъект[Список]);
		Отбор.Элементы.Очистить();
	КонецЦикла;
	
	ЗаполнитьКоличествоДополнительныхФильтров(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтрыСписков()
	
	ДоступныеПоляФильтров = ПоляФильтров();
	ВКэшеЕстьНедоступныеФильтры = Ложь;
	ИсправленныйКэшФильтров = Новый Соответствие;
	
	Для Каждого Раздел Из ИменаСписковФормы() Цикл
		
		НедоступныеФильтры = Новый Массив;
		
		Фильтры = КэшФильтровВСписках.Получить(Раздел);
		Если Фильтры = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Фильтр Из Фильтры Цикл
			Если ДоступныеПоляФильтров.Найти(Фильтр.Ключ) = Неопределено Тогда
				ВКэшеЕстьНедоступныеФильтры = Истина;
				НедоступныеФильтры.Добавить(Фильтр.Ключ);
				Продолжить;
			КонецЕсли;
			
			ЭтотОбъект[Фильтр.Ключ] = Фильтр.Значение;
			УстановитьОтборы(ЭтотОбъект, Раздел, Фильтр.Ключ);
		КонецЦикла;
		
		Для Каждого НедоступныйФильтр Из НедоступныеФильтры Цикл
			Фильтры.Удалить(НедоступныйФильтр);
		КонецЦикла;
		
		ИсправленныйКэшФильтров.Вставить(Раздел, Фильтры);
		
	КонецЦикла;
	
	Если ВКэшеЕстьНедоступныеФильтры Тогда
		КэшФильтровВСписках = Новый ФиксированноеСоответствие(ИсправленныйКэшФильтров);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшФильтровВСписках()
	
	КэшФильтров = Новый Соответствие;
	Для Каждого ИмяСписка Из ИменаСписковФормы() Цикл
		КэшФильтров.Вставить(ИмяСписка, Новый Соответствие);
	КонецЦикла;
	КэшФильтровВСписках = Новый ФиксированноеСоответствие(КэшФильтров);
	КэшФильтровВВХранилищеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы, "Отборы",
		КэшФильтровВСписках);
	Если ТипЗнч(КэшФильтровВВХранилищеНастроек) = Тип("ФиксированноеСоответствие") Тогда
		КэшФильтровВСписках = КэшФильтровВВХранилищеНастроек;
	Иначе
		КэшФильтровВСписках = Новый ФиксированноеСоответствие(КэшФильтровВВХранилищеНастроек);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьПересечениеОтборов(Форма, ЭтоУстановкаФильтров = Ложь)
	
	ТекущийСписок = Форма[Форма.ТекущийРаздел];
	
	ГруппаБыстрыхФильтров = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(ТекущийСписок.Отбор.Элементы,
		ИмяГруппыФильтров());
	Если ГруппаБыстрыхФильтров = Неопределено Тогда
		ЗаполнитьКоличествоДополнительныхФильтров(Форма);
		Возврат;
	КонецЕсли;
	ЭлементыБыстрыхФильтров = ЭлементыОтбора(ГруппаБыстрыхФильтров);
		
	ПользовательскийОтбор = ПользовательскийОтборСписка(ТекущийСписок);
	ЭлементыПользовательскогоОтбора = ЭлементыОтбора(ПользовательскийОтбор);
	
	Для Каждого ЭлементПользовательскогоОтбора Из ЭлементыПользовательскогоОтбора Цикл
	
		Если Не ЭлементПользовательскогоОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементБыстрогоФильтра Из ЭлементыБыстрыхФильтров Цикл
			
			Если ЭлементПользовательскогоОтбора.ЛевоеЗначение <> ЭлементБыстрогоФильтра.ЛевоеЗначение 
				Или Не ЭлементБыстрогоФильтра.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭтоУстановкаФильтров Тогда
				ЭлементПользовательскогоОтбора.Использование = Ложь;
			Иначе
				
				ЭлементБыстрогоФильтра.Использование = Ложь;
				РеквизитФормы = РеквизитФормыПоПредставлениюФильтра(ЭлементБыстрогоФильтра.Представление);
				Если ЗначениеЗаполнено(РеквизитФормы) Тогда
					Форма[РеквизитФормы] = Неопределено;
					УстановитьОтборы(Форма, Форма.ТекущийРаздел, РеквизитФормы, Ложь);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаполнитьКоличествоДополнительныхФильтров(Форма);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяГруппыФильтров()
	Возврат "БыстрыйОтбор";
КонецФункции

// Возвращает массив элементов отбора.
// 
// Параметры:
//  Отбор - ГруппаЭлементовОтбораКомпоновкиДанных,Неопределено
// 
// Возвращаемое значение:
//  Массив Из ЭлементОтбораКомпоновкиДанных
&НаКлиентеНаСервереБезКонтекста
Функция ЭлементыОтбора(Отбор)

	НайденныеЭлементы = Новый Массив;

	Если Отбор = Неопределено Тогда
		Возврат НайденныеЭлементы;
	КонецЕсли;

	Для Каждого Элемент Из Отбор.Элементы Цикл

		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда

			НайденныеЭлементыГруппы = ЭлементыОтбора(Элемент);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеЭлементы, НайденныеЭлементыГруппы);

		Иначе

			НайденныеЭлементы.Добавить(Элемент);

		КонецЕсли;

	КонецЦикла;

	Возврат НайденныеЭлементы;

КонецФункции

// Возвращает отборы списка.
// 
// Параметры:
//  Список - ДинамическийСписок
// 
// Возвращаемое значение:
//  ОтборКомпоновкиДанных
&НаКлиентеНаСервереБезКонтекста
Функция ПользовательскийОтборСписка(Список)

	ИдентификаторНастройки = Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
	ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторНастройки);

	Если ПользовательскийОтбор = Неопределено Тогда
		ПользовательскийОтбор = Новый ОтборКомпоновкиДанных();
	КонецЕсли;

	Возврат ПользовательскийОтбор;

КонецФункции
	
&НаКлиенте
Процедура НастройкаОтборовСпискаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
		
	ТекущийСписок = ЭтотОбъект[ТекущийРаздел];
	ТекущийСписок.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Результат);
	
	ОбработатьПересечениеОтборов(ЭтотОбъект);
	ВидимостьЭлементовИКоманд();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитФормыПоПредставлениюФильтра(ПредставлениеФильтра)

	РеквизитыФормыПоПредставлениямФильтров = Новый Соответствие();
	РеквизитыФормыПоПредставлениямФильтров.Вставить("Организация", "Организация");
	РеквизитыФормыПоПредставлениямФильтров.Вставить("Контрагент", "Контрагент");
	РеквизитыФормыПоПредставлениямФильтров.Вставить("ОтборПериодДатаНачала", "Период");
	РеквизитыФормыПоПредставлениямФильтров.Вставить("ОтборПериодДатаОкончания", "Период");
	РеквизитыФормыПоПредставлениямФильтров.Вставить("Ответственный", "Ответственный");
	РеквизитыФормыПоПредставлениямФильтров.Вставить("Состояние", "Состояние");
	РеквизитыФормыПоПредставлениямФильтров.Вставить("ВидДокумента", "ТипДокумента");
	РеквизитыФормыПоПредставлениямФильтров.Вставить("ТипДокумента", "ТипДокумента");
	РеквизитыФормыПоПредставлениямФильтров.Вставить("ТипРегламента", "ТипРегламента");
	РеквизитыФормыПоПредставлениямФильтров.Вставить("СтатусПриглашения", "СтатусПриглашения");
	
	Возврат РеквизитыФормыПоПредставлениямФильтров[ПредставлениеФильтра];

КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыФильтров(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатЗакрытия.ТребуетсяОткрытиеДополнительныхОтборов Тогда
		ОткрытьПользовательскиеОтборы(Неопределено);
	КонецЕсли;
	
	ИзмененныеФильтры = Новый Массив;
	Если Организация <> РезультатЗакрытия.Организация Тогда
		Организация = РезультатЗакрытия.Организация;
		ИзмененныеФильтры.Добавить("Организация");
	КонецЕсли;
	
	Если Контрагент <> РезультатЗакрытия.Контрагент Тогда
		Контрагент = РезультатЗакрытия.Контрагент;
		ИзмененныеФильтры.Добавить("Контрагент");
	КонецЕсли;
	
	Если Период <> РезультатЗакрытия.Период Тогда
		Период = РезультатЗакрытия.Период;
		ИзмененныеФильтры.Добавить("Период");
	КонецЕсли;
	
	Если Ответственный <> РезультатЗакрытия.Ответственный Тогда
		Ответственный = РезультатЗакрытия.Ответственный;
		ИзмененныеФильтры.Добавить("Ответственный");
	КонецЕсли;
	
	Если Договор <> РезультатЗакрытия.Договор Тогда
		Договор = РезультатЗакрытия.Договор;
		ИзмененныеФильтры.Добавить("Договор");
	КонецЕсли;
	
	Если Состояние <> РезультатЗакрытия.Состояние Тогда
		Состояние = РезультатЗакрытия.Состояние;
		ИзмененныеФильтры.Добавить("Состояние");
	КонецЕсли;
		
	Если ТипДокумента <> РезультатЗакрытия.ТипДокумента Тогда
		ТипДокумента = РезультатЗакрытия.ТипДокумента;
		ИзмененныеФильтры.Добавить("ТипДокумента");
	КонецЕсли;
	
	Если ТипРегламента <> РезультатЗакрытия.ТипРегламента Тогда
		ТипРегламента = РезультатЗакрытия.ТипРегламента;
		ИзмененныеФильтры.Добавить("ТипРегламента");
	КонецЕсли;
	
	Если СтатусПриглашения <> РезультатЗакрытия.СтатусПриглашения Тогда
		СтатусПриглашения = РезультатЗакрытия.СтатусПриглашения;
		ИзмененныеФильтры.Добавить("СтатусПриглашения");
	КонецЕсли;
	
	УстановитьОтборыДляИзмененныхФильтров(ИзмененныеФильтры);
	УстановитьПараметрыПредпросмотра();
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.1, Истина);
	ВидимостьЭлементовИКоманд();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостоянияДокументовТребующиеВнимания()
	
	СписокСостояний = Новый СписокЗначений;
	
	СписокСостояний.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправке);
	СписокСостояний.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяУтверждение);
	СписокСостояний.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание);
	СписокСостояний.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования);
	СписокСостояний.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения);
	СписокСостояний.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправка);
	СписокСостояний.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования);
	СписокСостояний.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяУточнение);
	СписокСостояний.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения);
	СписокСостояний.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещенияПоОтклонению);
	
	Возврат СписокСостояний;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКоличествоДополнительныхФильтров(Форма)
	
	КоличествоДополнительныхОтборов = Новый Соответствие;
	
	Для Каждого ИмяСписка Из ИменаСписковФормы() Цикл
	
		ТекущийСписок = Форма[ИмяСписка];
		ПользовательскийОтбор = ПользовательскийОтборСписка(ТекущийСписок);
		ЭлементыПользовательскогоОтбора = ЭлементыОтбора(ПользовательскийОтбор);
		
		КоличествоЭлементов = 0;
	
		Для Каждого ЭлементПользовательскогоОтбора Из ЭлементыПользовательскогоОтбора Цикл
	
			Если ЭлементПользовательскогоОтбора.Использование Тогда
				КоличествоЭлементов = КоличествоЭлементов + 1;
			КонецЕсли;
		
		КонецЦикла;
		
		КоличествоДополнительныхОтборов.Вставить(ИмяСписка, КоличествоЭлементов);
		
	КонецЦикла;
		
	Форма.КоличествоДополнительныхОтборовСписков = Новый ФиксированноеСоответствие(КоличествоДополнительныхОтборов);
	
КонецПроцедуры

&НаКлиенте
Функция ТекущиеДанныеТаблицыЭлектронныхДокументов()

	Если Элементы.Страницы.ТекущаяСтраница <> Элементы.СтраницаВходящиеИсходящие Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	Если Элементы.СтраницыВходящиеИсходящие.ТекущаяСтраница = Элементы.СтраницаВходящиеЭлектронныеДокументы Тогда
		Результат = ТекущиеДанныеСписка(Элементы.ВходящиеЭлектронныеДокументы);
	ИначеЕсли Элементы.СтраницыВходящиеИсходящие.ТекущаяСтраница = Элементы.СтраницаИсходящиеЭлектронныеДокументы Тогда
		Результат = ТекущиеДанныеСписка(Элементы.ИсходящиеЭлектронныеДокументы);
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ИзменитьВидимостьКолонкиВУчете()
	ОтображатьКУчету = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольОтраженияВУчетеЭДО");
	Элементы.ВходящиеЭлектронныеДокументыОтражениеВУчете.Видимость = ОтображатьКУчету;
	Элементы.ИсходящиеЭлектронныеДокументыОтражениеВУчете.Видимость = ОтображатьКУчету;
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьКолонкиКоличестваСообщений()
	ВыводитьКолонкиСообщений = ИнтерфейсДокументовЭДО.ВыводитьЧатУниверсальныхСообщений();
	Элементы.ВходящиеЭлектронныеДокументыКоличествоНепрочитанныхСообщений.Видимость = ВыводитьКолонкиСообщений;
	Элементы.ИсходящиеЭлектронныеДокументыКоличествоНепрочитанныхСообщений.Видимость = ВыводитьКолонкиСообщений;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовкиЭлементов()
	
	Если ОтложеннаяОтправкаЭлектронныхДокументов Тогда
		Элементы.СформироватьПодписатьОтправить.Заголовок = НСтр("ru = 'Создать и подписать'");
	Иначе
		Элементы.СформироватьПодписатьОтправить.Заголовок = НСтр("ru = 'Создать, подписать и отправить'");
	КонецЕсли;
	
	Элементы.СформироватьКонтекстноеМенюПодписатьОтправить.Заголовок = Элементы.СформироватьПодписатьОтправить.Заголовок;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущимЭлементомСписокТекущегоРаздела()

	ТекущийЭлемент = Элементы[ТекущийРаздел];
	
КонецПроцедуры

&НаКлиенте
Функция ТекущиеДанныеСписка(Список, НаведеннаяСтрока = Неопределено)

	СтрокиДляОбработки = ОбщегоНазначенияБЭДКлиент.СтрокиТаблицыДляОбработки(Список, НаведеннаяСтрока);

	Для Каждого СтрокаДляОбработки Из СтрокиДляОбработки Цикл
		ДанныеСтроки = Список.ДанныеСтроки(СтрокаДляОбработки);
	КонецЦикла;
	
	Возврат ДанныеСтроки;

КонецФункции

&НаСервере
Процедура НастроитьМассовыйВыборДокументов()
	
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.ВходящиеЭлектронныеДокументы, Элементы.ВходящиеЭлектронныеДокументыВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.ИсходящиеЭлектронныеДокументы, Элементы.ИсходящиеЭлектронныеДокументыВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.Сформировать, Элементы.СформироватьВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.Приглашения, Элементы.ПриглашенияВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);
	ИнтерфейсДокументовЭДО.НастроитьРежимМножественногоВыделенияВСпискеФормы(ЭтотОбъект,
		Элементы.Ошибки, Элементы.ОшибкиВключитьМассовыйВыборДокументов,
		ИспользоватьРежимМножественногоВыделенияВСписках);

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНастроек()
	
	ОтображатьУдаленные = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		ИнтерфейсДокументовЭДОКлиентСервер.КлючОбъектаНастроекИнтерфейсаЭДО(),
		"ОтображатьУдаленные", Ложь);
		
	Для Каждого ИмяСписка Из ИменаСписковФормы() Цикл
		Если ИмяСписка = "Сформировать" Или ИмяСписка = "Приглашения" Или ИмяСписка = "Ошибки" Тогда
			Продолжить;
		КонецЕсли;
		ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтображатьУдаленные", ОтображатьУдаленные);
	КонецЦикла;
		
	ОтображатьОбластьПредпросмотра = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы, 
		"ПоказыватьОбластьПросмотра", Истина);
	ВключенОбменЭлектроннымиДокументами = НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами();
	Элементы.ГруппаОбластьПросмотра.Видимость = ВключенОбменЭлектроннымиДокументами И ОтображатьОбластьПредпросмотра;
	
	ЗаполнитьДанныеПоИспользованиюПоказаТрафикаЭлектронныхДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПриглашениями

&НаКлиенте
Процедура ОтправкаПриглашенийОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КонтекстДиагностики = Результат.КонтекстДиагностики;

	Если Результат.Успех Тогда
	
		ТекстЗаголовка = НСтр("ru = 'Отправка приглашений получателям'");
		
		ОтправленоПриглашений = Результат.КоличествоОтправленных;
		ШаблонСообщения = НСтр("ru = 'Отправлено приглашений: %1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения, ОтправленоПриглашений);

		ПоказатьОповещениеПользователя(ТекстЗаголовка, , ТекстСообщения);

		ОбновитьДинамическийСписокТекущегоРаздела();
		
	КонецЕсли;

	Если ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(КонтекстДиагностики) Тогда
			ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПринятиеПриглашений()

	ОтправитьОтветНаПриглашения(ОтветНаПриглашение_Принять());

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтветНаПриглашения(Действие)

	ОчиститьСообщения();
	ДанныеПриглашений = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
	"КлючПриглашения, ИдентификаторОрганизации, Организация, ИдентификаторКонтрагента, СпособОбменаЭД, Контрагент, НовыйКонтрагент");
	
	ВходящиеПриглашения = Новый Массив;

	Для Каждого ДанныеПриглашения Из ДанныеПриглашений Цикл
		ВходящееПриглашение = СинхронизацияЭДОКлиент.НовоеВходящееПриглашение();
		ЗаполнитьЗначенияСвойств(ВходящееПриглашение, ДанныеПриглашения, , "Контрагент");
		Если ТипЗнч(ДанныеПриглашения.Контрагент) = ТипЗнч(ПустойКонтрагент) Тогда
			ВходящееПриглашение.Контрагент = ДанныеПриглашения.Контрагент;
		Иначе
			ВходящееПриглашение.Контрагент = ПустойКонтрагент;
		КонецЕсли;
		ВходящееПриглашение.СпособОбмена = ДанныеПриглашения.СпособОбменаЭД;
		ВходящиеПриглашения.Добавить(ВходящееПриглашение);
	КонецЦикла;
	
	ДополнительныеПараметрыОповещения = Новый Структура("ОтветНаПриглашение", Действие);
	Оповещение = Новый ОписаниеОповещения("ПослеОтправкиОтветовНаПриглашения", ЭтотОбъект, 
		ДополнительныеПараметрыОповещения);

	Если Действие = ОтветНаПриглашение_Принять() Тогда
		СинхронизацияЭДОКлиент.ПринятьПриглашения(ВходящиеПриглашения, ЭтотОбъект, Оповещение);
	ИначеЕсли Действие = ОтветНаПриглашение_Отклонить() Тогда
		СинхронизацияЭДОКлиент.ОтклонитьПриглашения(ВходящиеПриглашения, ЭтотОбъект, Оповещение);
	ИначеЕсли Действие = ОтветНаПриглашение_Отозвать() Тогда
		СинхронизацияЭДОКлиент.ОтозватьПриглашения(ВходящиеПриглашения, ЭтотОбъект, Оповещение);
	Иначе
		Возврат;
	КонецЕсли; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОтветНаПриглашение_Принять()
	Возврат "Принять";
КонецФункции  

&НаКлиентеНаСервереБезКонтекста
Функция ОтветНаПриглашение_Отклонить()
	Возврат "Отклонить";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОтветНаПриглашение_Отозвать()
	Возврат "Отозвать";
КонецФункции

&НаКлиенте
Процедура ПослеОтправкиОтветовНаПриглашения(Результат, Контекст) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КонтекстДиагностики = Результат.КонтекстДиагностики;

	Если Результат.Успех Тогда
		
		КоличествоОбработанныхПриглашений = Результат.КоличествоОбработанных;
		
		Если Контекст.ОтветНаПриглашение = ОтветНаПриглашение_Принять() Тогда
			ТекстЗаголовка = НСтр("ru = 'Принимаются приглашения'");
			ШаблонСообщения = НСтр("ru = 'Принято приглашений: %1'");
			СнятьБлокировкуЭлементов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Элементы.ПриглашенияПринятьПриглашения.Имя));
		ИначеЕсли Контекст.ОтветНаПриглашение = ОтветНаПриглашение_Отклонить() Тогда
			ТекстЗаголовка = НСтр("ru = 'Отклоняются приглашения'");
			ШаблонСообщения = НСтр("ru = 'Отклонено приглашений: %1'");
			СнятьБлокировкуЭлементов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Элементы.ПриглашенияОтклонитьПриглашения.Имя));
		ИначеЕсли Контекст.ОтветНаПриглашение = ОтветНаПриглашение_Отозвать() Тогда
			ТекстЗаголовка = НСтр("ru = 'Отзываются приглашения'");
			ШаблонСообщения = НСтр("ru = 'Отозвано приглашений: %1'");
		Иначе
			Возврат;
		КонецЕсли;

		ТекстСообщения = СтрШаблон(ШаблонСообщения, КоличествоОбработанныхПриглашений);

		ПоказатьОповещениеПользователя(ТекстЗаголовка, , ТекстСообщения);

		ОбновитьДинамическийСписокТекущегоРаздела();
		УстановитьСтраницуДействийСПриглашением();
	КонецЕсли;

	Если ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(КонтекстДиагностики) Тогда
		ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуДействийСПриглашением()
	
	Если ТекущийРаздел <> РазделыПанелиНавигации().Приглашения Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийСписок = Элементы[ТекущийРаздел];
	ТекущиеДанные = ТекущийСписок.ТекущиеДанные;
	НастроитьВидимостьКомандТекущейСтрокиРазделаПриглашения(ТекущиеДанные);	
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКомандТекущейСтрокиРазделаПриглашения(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПриглашенияПринятьПриглашения.Видимость = Ложь;
	Элементы.ПриглашенияКонтекстноеМенюПринятьПриглашения.Видимость = Ложь;
	Элементы.ПриглашенияОтклонитьПриглашения.Видимость = Ложь;
	Элементы.ПриглашенияКонтекстноеМенюОтклонитьПриглашения.Видимость = Ложь;
	Элементы.ПриглашенияОтправитьПриглашение.Видимость = Ложь;
	Элементы.ПриглашенияКонтекстноеМенюОтправитьПриглашение.Видимость = Ложь;
		
	Если ТекущиеДанные.СтатусПодключения =
		ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ТребуетсяСогласие") Тогда
		
		Элементы.ПриглашенияПринятьПриглашения.Видимость = Истина;
		Элементы.ПриглашенияКонтекстноеМенюПринятьПриглашения.Видимость = Истина;
		Элементы.ПриглашенияОтклонитьПриглашения.Видимость = Истина;
		Элементы.ПриглашенияКонтекстноеМенюОтклонитьПриглашения.Видимость = Истина;

	ИначеЕсли ТекущиеДанные.СтатусПодключения = 
		ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ТребуетсяОтправить") Тогда
		
		Элементы.ПриглашенияОтправитьПриглашение.Видимость = Истина;
		Элементы.ПриглашенияКонтекстноеМенюОтправитьПриглашение.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтклонениеПриглашений()

	ОтправитьОтветНаПриглашения(ОтветНаПриглашение_Отклонить());

КонецПроцедуры

#КонецОбласти

#Область ПредпросмотрЭлектронногоДокумента

&НаКлиенте
Процедура ОбновитьОбластьПросмотра()
	
	ТекущиеДанные = ТекущиеДанныеТаблицыЭлектронныхДокументов();
	
	ОчиститьКэшРеквизитовТекущегоФайла();
	
	Если ТекущиеДанные = Неопределено Или Не ОтображатьОбластьПредпросмотра
		Или ВключенаГруппировкаСтрок(ТекущиеДанные) Тогда
			
		Если ОперацияПолученияДанных <> Неопределено Тогда
			ЛегкийИнтерфейсДокументовЭДОВызовСервера.ПрекратитьОжиданиеПолученияДанныхКомпонентовПросмотраДокумента(
				ОперацияПолученияДанных);
		КонецЕсли;
			
		УстановитьСтраницуПредпросмотраДокументНеВыбран(ЭтотОбъект);
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML,  ИдентификаторПанелиИтогов());
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML,  ИдентификаторПанелиОтраженияВУчете());
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML,  ИдентификаторПанелиОтветственного());
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML,  ИдентификаторКомандыСменитьОтветственного());
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML,  ИдентификаторПанелиОтраженияВУчете());
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML,  ИдентификаторКомандыСоздатьДокументУчета());
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML,  ИдентификаторКомандыПодобратьДокументУчета1());
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML,  ИдентификаторКомандыПодобратьДокументУчета2());
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML,  ИдентификаторКомандыОткрытьДокументУчета1());
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML,  ИдентификаторКомандыОткрытьДокументУчета2());
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML,  ИдентификаторКомандыПоказатьВсеДокументыУчета());
		Возврат;
	КонецЕсли;
	
	НастроитьВидимостьКомандТекущейСтроки(ТекущиеДанные);
	
	ОбновитьОбластьПросмотраНаСервере(ТекущиеДанные);
	
	НастроитьПанелиПросмотра();

	ОжидатьПолученияАсинхронныхДанных();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РаспознатьДокумент(Знач ЭлектронныйДокумент)
		
	Результат = Ложь;
	СообщениеОтправителя = ЭлектронныеДокументыЭДО.СообщениеОтправителя(ЭлектронныйДокумент);
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС")
		И ЭлектронныйДокумент.СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезСерверЕИС Тогда
		МодульЭлектронноеАктированиеЕИС = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеАктированиеЕИС");
		РезультатРаспознавания =
		МодульЭлектронноеАктированиеЕИС.РаспознатьСообщение(СообщениеОтправителя);
		Результат = ЗначениеЗаполнено(РезультатРаспознавания);
	Иначе 
		Попытка
			Результат = ЗначениеЗаполнено(ЭлектронныеДокументыЭДО.РаспознатьСообщение(СообщениеОтправителя));
		Исключение
			Результат = Ложь;	
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрыПредпросмотра()
	
	ТекущиеДанные = ТекущиеДанныеТаблицыЭлектронныхДокументов();
	
	Если ТекущиеДанные <> Неопределено И Не ВключенаГруппировкаСтрок(ТекущиеДанные) Тогда
		ТекущийЭлектронныйДокумент = ТекущиеДанные.ЭлектронныйДокумент;
	Иначе
		ТекущийЭлектронныйДокумент = Неопределено;
		Предпросмотр = Неопределено; 
		ТекущийДокументУчетаПредставление = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуОжиданияПредпросмотра(ПредыдущийРаздел)
	
	ТекущиеДанные = ТекущиеДанныеТаблицыЭлектронныхДокументов();
	
	Если ТекущиеДанные <> Неопределено И Не ВключенаГруппировкаСтрок(ТекущиеДанные) Тогда
		Если ТекущийЭлектронныйДокумент <> ТекущиеДанные.ЭлектронныйДокумент 
			И (ПредыдущийРаздел = "Сформировать" Или ПредыдущийРаздел = "Приглашения") Тогда
			Элементы.СтраницыПредпросмотр.ТекущаяСтраница = Элементы.СтраницаОжидание;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСтраницуПредпросмотраДокументНеВыбран(Форма)
	Форма.Элементы.СтраницыПредпросмотр.ТекущаяСтраница = Форма.Элементы.СтраницаНеВыбранДокумент;
КонецПроцедуры

#Область ОбновлениеДанных

&НаСервере
Процедура ОбновитьОбластьПросмотраНаСервере(Знач ТекущиеДанные)
	
	Если ТребуетсяОбновитьСчетчикиКоличестваДокументов Тогда
		КоличествоДокументов();
	КонецЕсли;
	
	Если ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	ЛегкийИнтерфейсДокументовЭДО.ПрекратитьОжиданиеПолученияДанныхКомпонентовПросмотраДокумента(ОперацияПолученияДанных);
	
	ЗаполнитьРеквизитыФормыНаОснованииТекущихДанных(ТекущиеДанные);
	
	ДанныеКомпонентов = ЛегкийИнтерфейсДокументовЭДО.НовыеДанныеКомпонентовПросмотраДокумента(
		"ПанельИтогов, ПанельОтветственного, ПанельОтраженияВУчете, ПанельВизуализацииТекущихДел, 
		|ПанельПредставленияФайла");
	
	ОбновитьДанныеКомпонентов(ДанныеКомпонентов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПослеСменыОтветственного(ТекущиеДанные)

	ОбновитьДанныеПослеСменыОтветственногоНаСервере(ТекущиеДанные);
	
	НастроитьПанелиПросмотра();
	
	ОжидатьПолученияАсинхронныхДанных();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПослеСменыОтветственногоНаСервере(Знач ТекущиеДанные)
	
	ЗаполнитьРеквизитыФормыНаОснованииТекущихДанных(ТекущиеДанные);
	
	ДанныеКомпонентов = ЛегкийИнтерфейсДокументовЭДО.НовыеДанныеКомпонентовПросмотраДокумента("ПанельОтветственного");
	
	ОбновитьДанныеКомпонентов(ДанныеКомпонентов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПослеИзмененияОбъектовУчета()
	
	ОбновитьДанныеПослеИзмененияОбъектовУчетаНаСервере();
	
	НастроитьПанелиПросмотра();
	
	ОжидатьПолученияАсинхронныхДанных();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПослеИзмененияОбъектовУчетаНаСервере()

	ДанныеКомпонентов = ЛегкийИнтерфейсДокументовЭДО.НовыеДанныеКомпонентовПросмотраДокумента("ПанельОтраженияВУчете");
	
	ОбновитьДанныеКомпонентов(ДанныеКомпонентов);

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКомпонентов(ДанныеКомпонентов)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияДанныхКомпонентовПросмотра();
	
	ОперацияПолученияДанных = ЛегкийИнтерфейсДокументовЭДО.ЗаполнитьДанныеКомпонентовПросмотраДокумента(
		ДанныеКомпонентов, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормыНаОснованииТекущихДанных(ТекущиеДанные)
	
	СостояниеЭДОТекущегоДокумента = ТекущиеДанные.СостояниеЭДО;
	ТипТекущегоДокумента = ТекущиеДанные.ТипДокумента;
	ВидТекущегоДокумента = ТекущиеДанные.ВидДокумента;
	ТекущийДокументОблачногоЭДО = ТекущиеДанные.ЭтоОблачныйЭДО;
	ОтветственныйТекущегоДокумента = ТекущиеДанные.Ответственный;
	ОрганизацияТекущегоДокумента = ТекущиеДанные.Организация;
	СуммаТекущегоДокумента = ТекущиеДанные.СуммаДокумента;
	ТекущийДокументПомеченНаУдаление = ТекущиеДанные.ПометкаУдаления;
	ФорматОсновногоТитулаТекущегоДокумента = ТекущиеДанные.ФорматОсновногоТитула;
	ИдентификаторОрганизацииТекущегоДокумента = ТекущиеДанные.ИдентификаторОрганизации;
	ИдентификаторТекущегоДокумента = ТекущиеДанные.ИдентификаторДокумента;
	КонтрагентТекущегоДокумента = ТекущиеДанные.Контрагент;
	
	НаКонтроле = ИнтеграцияЭДО.НоменклатураКонтрагентовНаКонтроле(
		Новый Структура("ЭлектронныйДокумент", ТекущийЭлектронныйДокумент));
	ЕстьНоменклатураНаКонтролеТекущегоДокумента = ЗначениеЗаполнено(НаКонтроле);
	
	ЭлектронныеДокументыПакета = Новый Массив;
	ЭлектронныеДокументыПакета.Добавить(ТекущийЭлектронныйДокумент);
	ПакетыДокументовЭДО.ДополнитьДокументамиПакетов(ЭлектронныеДокументыПакета);
	СоставПакетаТекущегоДокумента.Очистить();
	Для Каждого ЭлектронныйДокумент Из ЭлектронныеДокументыПакета Цикл
		НовыйДокументПакета = СоставПакетаТекущегоДокумента.Добавить();
		НовыйДокументПакета.ЭлектронныйДокумент = ЭлектронныйДокумент;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКэшРеквизитовТекущегоФайла()
	
	ТекущийФайлАдресВХранилище = Неопределено;
	ТекущийФайлНомерИконки = Неопределено;
	ТекущийФайлПредставление = Неопределено;
	
КонецПроцедуры

#Область АсинхронноеОбновлениеДанных

&НаКлиенте
Процедура ОжидатьПолученияАсинхронныхДанных()

	ДлительнаяОперация = ОперацияПолученияДанных; // См. ДлительныеОперации.ВыполнитьФункцию

	Если ДлительнаяОперация = Неопределено Тогда
		Если ДанныеКомпонентов <> Неопределено
			И ЗначениеЗаполнено(ДанныеКомпонентов.ПанельПредставленияФайла) Тогда
			ВывестиPDFДокумент(ДанныеКомпонентов.ПанельПредставленияФайла.Данные);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьАсинхронныеДанныеПослеОжидания", ЭтотОбъект);

	Оповещение = Новый ОписаниеОповещения(
		"ОжидатьПолученияДанныхКомпонентовПросмотраПослеДлительнойОперации",
		ЛегкийИнтерфейсДокументовЭДОКлиент, ОповещениеОЗавершении);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАсинхронныеДанныеПослеОжидания(Результат, ДополнительныеПараметры) Экспорт

	Если ОперацияПолученияДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Успех Тогда
		// Для случаев, когда отмена предыдущей операции получения пройти не успела, но результат уже неактуален.
		Если Результат.ОперацияПолученияДанных.Свойство("ИдентификаторЗадания")
			И Не Результат.ОперацияПолученияДанных.ИдентификаторЗадания = ОперацияПолученияДанных.ИдентификаторЗадания Тогда
			Возврат;
		КонецЕсли;
		ОперацияПолученияДанных = Результат.ОперацияПолученияДанных;
		ОбновитьДанныеПослеЗаполненияАсинхронныхДанных();
		НастроитьПанелиПросмотра();
	Иначе
		Элементы.СтраницыПредпросмотр.ТекущаяСтраница = Элементы.СтраницаОшибка;
		ОперацияПолученияДанных = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПослеЗаполненияАсинхронныхДанных()

	ДанныеКомпонентов = ЛегкийИнтерфейсДокументовЭДО.РезультатЗаполненияДанныхКомпонентовПросмотраДокументаАсинхронноВФоне(
		ОперацияПолученияДанных);
		
	ОперацияПолученияДанных = Неопределено;
	
	Если ДанныеКомпонентов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКомпонентов.ПанельПредставленияФайла) Тогда
		ВывестиPDFДокумент(ДанныеКомпонентов.ПанельПредставленияФайла.Данные);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти // АсинхронноеОбновлениеДанных

#КонецОбласти // ОбновлениеДанных

#Область ПолучениеДанных

&НаСервере
Функция ПараметрыЗаполненияДанныхКомпонентовПросмотра()

	ПараметрыЗаполнения = ЛегкийИнтерфейсДокументовЭДО.НовыеПараметрыПолученияДанныхКомпонентов();

	ПараметрыЗаполнения.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗаполнения.СвойстваДокумента = СвойстваТекущегоДокументаДляПолученияДанныхКомпонентовПросмотра();
	НастройкиФормы = ПараметрыЗаполнения.НастройкиФормы;
	НастройкиФормы.ВыводитьБанковскиеРеквизиты = Ложь;
	НастройкиФормы.ОтключитьВыводДопДанных = Истина;
	НастройкиФормы.ОтключитьВыводКопияВерна = Истина;
	Возврат ПараметрыЗаполнения;

КонецФункции

&НаСервере
Функция СвойстваТекущегоДокументаДляПолученияДанныхКомпонентовПросмотра()
	
	СвойстваДокумента = ЛегкийИнтерфейсДокументовЭДО.НовыеСвойстваДокументаДляПолученияДанныхКомпонентовПросмотра();
	СвойстваДокумента.Ссылка = ТекущийЭлектронныйДокумент;
	СвойстваДокумента.ВидДокумента = ВидТекущегоДокумента;
	СвойстваДокумента.ТипДокумента = ТипТекущегоДокумента;
	СвойстваДокумента.СуммаДокумента = СуммаТекущегоДокумента;
	СвойстваДокумента.Организация = ОрганизацияТекущегоДокумента;
	СвойстваДокумента.Контрагент = КонтрагентТекущегоДокумента;
	СвойстваДокумента.Ответственный = ОтветственныйТекущегоДокумента;
	СвойстваДокумента.ЭтоОблачныйЭДО = ТекущийДокументОблачногоЭДО;
	СвойстваДокумента.ПометкаУдаления = ТекущийДокументПомеченНаУдаление;
	СвойстваДокумента.ФорматОсновногоТитула = ФорматОсновногоТитулаТекущегоДокумента;
	СвойстваДокумента.ИдентификаторОрганизации = ИдентификаторОрганизацииТекущегоДокумента;
	СвойстваДокумента.ИдентификаторДокумента = ИдентификаторТекущегоДокумента;
	Возврат СвойстваДокумента;
	
КонецФункции

#КонецОбласти // ПолучениеДанных

#Область ПредставлениеДанных

&НаКлиенте
Процедура НастроитьПанелиПросмотра()
	
	Если ДанныеКомпонентов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКомпонентов.ПанельИтогов) Тогда
		НастроитьПанельИтогов(ДанныеКомпонентов.ПанельИтогов);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКомпонентов.ПанельОтветственного) Тогда
		НастроитьПанельОтветственного(ДанныеКомпонентов.ПанельОтветственного);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКомпонентов.ПанельОтраженияВУчете) Тогда
		НастроитьПанельОтраженияВУчете(ДанныеКомпонентов.ПанельОтраженияВУчете);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКомпонентов.ПанельВизуализацииТекущихДел) Тогда
		НастроитьПанельВизуализации(ДанныеКомпонентов.ПанельВизуализацииТекущихДел);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКомпонентов.ПанельПредставленияФайла) Тогда
		НастроитьПанельПредставленияФайла(ДанныеКомпонентов.ПанельПредставленияФайла);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ДанныеКомпонента - См. ЛегкийИнтерфейсДокументовЭДО.НовыеДанныеКомпонентаПанельВизуализацииТекущихДел
&НаКлиенте
Процедура НастроитьПанельВизуализации(ДанныеКомпонента)
	
	Если ДанныеКомпонента.АсинхронноеПолучение Тогда
		Элементы.СтраницыПредпросмотр.ТекущаяСтраница = Элементы.СтраницаОжидание;
		Возврат;
	КонецЕсли;
	
	Если ДанныеКомпонента.ФайлПомеченНаУдаление Тогда
		Элементы.СтраницыПредпросмотр.ТекущаяСтраница = Элементы.СтраницаПредставлениеПомеченногоНаУдаление;
		Возврат;
	КонецЕсли;
	
	Если ДанныеКомпонента.ЕстьОшибка Тогда
		Элементы.СтраницыПредпросмотр.ТекущаяСтраница = Элементы.СтраницаОшибка;
		Возврат;
	КонецЕсли;
	
	Если ДанныеКомпонента.ТипДанных = 
		ПредопределенноеЗначение("Перечисление.ТипыДанныхВизуализацииДокументаЭДО.PdfДокумент") Тогда
		
		ТекущийФайлПредставление = ?(ЗначениеЗаполнено(ДанныеКомпонента.НаименованиеФайла),
			ДанныеКомпонента.НаименованиеФайла,
			ИнтерфейсДокументовЭДОКлиентСервер.ПредставлениеОтсутствующегоФайла());
		ТекущийФайлНомерИконки = РаботаСФайламиБЭДКлиентСервер.ИндексКартинкиПоРасширениюФайла(
			ДанныеКомпонента.РасширениеФайла);
		
		Элементы.СтраницыПредпросмотр.ТекущаяСтраница = Элементы.СтраницаФайл;
		
		Если ДанныеКомпонента.ФайлМожноПроштамповать Тогда
			Элементы.СтраницыПредпросмотраФайла.ТекущаяСтраница = Элементы.СтраницаФайлСВизуализацией;
			Элементы.СтраницыПредставленияФайла.ТекущаяСтраница = Элементы.СтраницаПредставлениеФайлаОжидание;
		Иначе
			Элементы.СтраницыПредпросмотраФайла.ТекущаяСтраница = Элементы.СтраницаФайлБезВизуализации;
		КонецЕсли;
	
	ИначеЕсли ДанныеКомпонента.ТипДанных = 
		ПредопределенноеЗначение("Перечисление.ТипыДанныхВизуализацииДокументаЭДО.HTMLДокумент") Тогда
		
		ПредпросмотрHTML = ДанныеКомпонента.Данные;
		
		Элементы.СтраницыПредпросмотр.ТекущаяСтраница = Элементы.СтраницаHTMLДокумент;
	
	ИначеЕсли ДанныеКомпонента.ТипДанных = 
		ПредопределенноеЗначение("Перечисление.ТипыДанныхВизуализацииДокументаЭДО.ТабличныйДокумент") Тогда
		
		Предпросмотр = ДанныеКомпонента.Данные;
		
		Элементы.СтраницыПредпросмотр.ТекущаяСтраница = Элементы.СтраницаТабличныйДокументИнформацияОтправителя;
	
	Иначе
		
		УстановитьСтраницуПредпросмотраДокументНеВыбран(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ДанныеКомпонента - См. ЛегкийИнтерфейсДокументовЭДО.НовыеДанныеКомпонентаПанельПредставленияФайла
&НаКлиенте
Процедура НастроитьПанельПредставленияФайла(ДанныеКомпонента)
		
	Если ЭтоМобильныйКлиент Тогда
		Элементы.ГруппаПанельПредставленияФайла.Видимость = Ложь;
		Возврат;
	КонецЕсли;
		
	Если ДанныеКомпонента.АсинхронноеПолучение Тогда
		Элементы.СтраницыПредставленияФайла.ТекущаяСтраница = Элементы.СтраницаПредставлениеФайлаОжидание;
		Возврат;
	КонецЕсли;
	
	Если ДанныеКомпонента.ЕстьОшибка Тогда
		Элементы.СтраницыПредставленияФайла.ТекущаяСтраница = Элементы.СтраницаПредставлениеФайлаОшибка;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеКомпонента.Данные) Тогда
		Элементы.ГруппаПанельПредставленияФайла.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаПанельПредставленияФайла.Видимость = Истина;
	
	Элементы.СтраницыПредставленияФайла.ТекущаяСтраница = Элементы.СтраницаПредставлениеФайлаЗагружено;
	ТекущийФайлАдресВХранилище = ПоместитьВоВременноеХранилище(ДанныеКомпонента.Данные, УникальныйИдентификатор);
	ИнтерфейсДокументовЭДОКлиент.ВывестиPDFДокументНаФорму(ЭтотОбъект, СведенияОPDFДокументе, ДанныеКомпонента.Данные);

КонецПроцедуры
	
&НаСервере
Процедура ВывестиPDFДокумент(Знач ДанныеФайла)
	
	Если Не ЗначениеЗаполнено(ДанныеФайла) Тогда
		Возврат;
	КонецЕсли;

	Если СведенияОPDFДокументе = Неопределено Тогда
	
		СведенияОPdfДокументе =
			ИнтерфейсДокументовЭДО.СведенияОPDFДокументеНаФормеПоУмолчанию();
		СведенияОPdfДокументе.ИмяРодителяЭлемента = "СтраницаПредставлениеФайлаЗагружено";
	
	КонецЕсли;
	
	ИнтерфейсДокументовЭДО.НастроитьПанельДляВыводаPDFДокумента(ЭтотОбъект, СведенияОPdfДокументе);
	
КонецПроцедуры
	
#КонецОбласти // ПредставлениеДанных

#Область ПредставлениеДанныхВHTML

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонТекстаДляПоляРеквизитыДокументаИОтражениеВУчетеHTML()
	
	Возврат СтрШаблон(
		"<html>
		|<head>
		|<meta charset=""UTF-8"">
		|<meta name=""viewport"" content=""width=device-width, initial-scale=1.0"">
		|<style type=""text/css"">
		|	body {
		|		margin-top:     0px;
		|		margin-left:    0px;
		|		margin-right:   0px;
		|		}
		|	div {
		|		white-space:    nowrap; /* Отключаем перенос текста */
		|		padding:        0px;
		|		margin-right:   5px;
		|		}
		|	.container {
		|		display:        inline-grid;   /* Устанавливаем контейнер как grid-контейнер */
		|		grid-auto-flow: column;        /* Элементы располагаются в одну строку */
		|		}
		|	.block {
		|		flex:           1;    /* Занимает равное пространство */
		|		box-sizing:     border-box;
		|		}
		|</style>
		|<body>
		|<div class=""container"">
		|%1
		|</div>
		|</body>
		|</html>",
		ШаблонТекстаДляУстановкиСодержимогоКонтейнера());
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонТекстаДляУстановкиСодержимогоКонтейнера()
	Возврат "%СодержимоеКонтейнера";
КонецФункции

#Область ОбщиеМетоды

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьПанельВПолеHTML(ТекстHTML, ИдентификаторПанели, ШаблонТекстаПанели,
	ДобавлятьВКонец = Ложь)
	
	Если ЗначениеЗаполнено(ТекстHTML) И СтрНайти(ТекстHTML, ИдентификаторПанели) Тогда
		ЗаменитьБлочныйЭлементВHTMLПоИдентификаторуЭлемента(ТекстHTML, ИдентификаторПанели, ШаблонТекстаПанели);
	ИначеЕсли ЗначениеЗаполнено(ТекстHTML) Тогда
		ДобавитьБлочныйЭлементВКонтейнерHTML(ТекстHTML, ШаблонТекстаПанели, ДобавлятьВКонец);
	Иначе
		ТекстHTML = ШаблонТекстаДляПоляРеквизитыДокументаИОтражениеВУчетеHTML();
		ТекстHTML = СтрЗаменить(ТекстHTML, ШаблонТекстаДляУстановкиСодержимогоКонтейнера(), ШаблонТекстаПанели);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаменитьБлочныйЭлементВHTMLПоИдентификаторуЭлемента(ТекстHTML, ИдентификаторЭлемента, СтрокаЗамены)
	
	ПреобразованныйИдентификатор = СтрШаблон("<div id=%1", ИдентификаторЭлемента);
	НаборСтрок = СтрРазделить(ТекстHTML, Символы.ПС);
	
	Для Индекс = 0 По НаборСтрок.ВГраница() Цикл
		Если СтрНайти(НаборСтрок[Индекс], ПреобразованныйИдентификатор) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НаборСтрок[Индекс] = СтрокаЗамены;
	КонецЦикла;
	
	ТекстHTML = СтрСоединить(НаборСтрок, Символы.ПС);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьБлочныйЭлементВКонтейнерHTML(ТекстHTML, ТекстЭлемента, ДобавлятьВКонец = Ложь)
	
	Если ДобавлятьВКонец Тогда
		КонецКонтейнера = "</div>
		|</body>";
		ТекстHTML = СтрЗаменить(ТекстHTML, КонецКонтейнера, ТекстЭлемента + Символы.ПС + КонецКонтейнера);
	Иначе
		НачалоКонтейнера = "<div class=""container"">";
		ТекстHTML = СтрЗаменить(ТекстHTML, НачалоКонтейнера, НачалоКонтейнера + Символы.ПС + ТекстЭлемента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьПанельИзПоляHTML(ТекстHTML, ИдентификаторПанели)
	
	НаборСтрок = СтрРазделить(ТекстHTML, Символы.ПС);
	
	ИндексПоследнейСтроки = НаборСтрок.ВГраница();
	Для Индекс = - ИндексПоследнейСтроки По 0 Цикл
		ТекущееЗначение = НаборСтрок[ - Индекс];
		Если СтрНайти(ТекущееЗначение, ИдентификаторПанели) = 0 Тогда
			Продолжить;
		КонецЕсли;
		НаборСтрок.Удалить(- Индекс);
	КонецЦикла;
	
	ТекстHTML = СтрСоединить(НаборСтрок, Символы.ПС);
	
	УдалитьОтступПанелиИзПоляHTML(ТекстHTML, ИдентификаторПанели);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьОтступПанелиИзПоляHTML(ТекстHTML, ИдентификаторПанели)
	
	ИдентификаторОтступа = ИдентификаторОтступаМеждуПанелями(ИдентификаторПанели);
	
	НаборСтрок = СтрРазделить(ТекстHTML, Символы.ПС);
	
	ИндексПоследнейСтроки = НаборСтрок.ВГраница();
	Для Индекс = - ИндексПоследнейСтроки По 0 Цикл
		ТекущееЗначение = НаборСтрок[ - Индекс];
		Если СтрНайти(ТекущееЗначение, ИдентификаторОтступа) = 0 Тогда
			Продолжить;
		КонецЕсли;
		НаборСтрок.Удалить(- Индекс);
	КонецЦикла;
	
	ТекстHTML = СтрСоединить(НаборСтрок, Символы.ПС);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьОтступПослеПанелиВПолеHTML(ТекстHTML, ИдентификаторПанели)
	
	Если СтрНайти(ТекстHTML, ИдентификаторОтступаМеждуПанелями(ИдентификаторПанели)) <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборСтрок = СтрРазделить(ТекстHTML, Символы.ПС);
	
	Для Индекс = 0 По НаборСтрок.ВГраница() Цикл
		Если СтрНайти(НаборСтрок[Индекс], ИдентификаторПанели) <> 0 Тогда
			НаборСтрок.Вставить(Индекс + 1, ШаблонТекстаОтступМеждуПанелями(ИдентификаторПанели));
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ТекстHTML = СтрСоединить(НаборСтрок, Символы.ПС);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонТекстаОтступМеждуПанелями(ИдентификаторПанели)
	
	Возврат СтрШаблон("<div id=%1><span style=""color: #808080;""> | </span></div>",
		ИдентификаторОтступаМеждуПанелями(ИдентификаторПанели));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторОтступаМеждуПанелями(ИдентификаторПанели)
	
	Возврат СтрШаблон("ОтступМеждуПанелями%1", ИдентификаторПанели);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстСсылкиДляПоляHTML(Ссылка, ПредставлениеСсылки)
	
	Возврат СтрШаблон("<A href=%1>%2</A>", Ссылка, ПредставлениеСсылки);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстВБлочномЭлементеСОтступомДляПоляHTML(Текст)
	
	Возврат СтрШаблон("<div style=""margin-right: 5px;"">%1</div>", Текст);

КонецФункции

#КонецОбласти // ОбщиеМетоды

#Область ПанельИтогов

// Параметры:
//  ДанныеКомпонента - См. ЛегкийИнтерфейсДокументовЭДО.НовыеДанныеКомпонентаПанельИтогов
&НаКлиенте
Процедура НастроитьПанельИтогов(ДанныеКомпонента)

	ИдентификаторПанелиИтогов = ИдентификаторПанелиИтогов();
	
	ДобавитьПанельВПолеHTML(РеквизитыДокументаИОтражениеВУчетеHTML,
		ИдентификаторПанелиИтогов, ШаблонТекстаПанелиИтогов());
	
	Если ДанныеКомпонента.АсинхронноеПолучение Тогда
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML, ИдентификаторПанелиИтогов);
		Возврат;
	КонецЕсли;
	
	ПредставлениеДанныхКомпонента = 
		ЛегкийИнтерфейсДокументовЭДОКлиентСервер.ПредставлениеДанныхПоДаннымКомпонентаПанельИтогов(ДанныеКомпонента);
		
	Если Не ЗначениеЗаполнено(ПредставлениеДанныхКомпонента.СуммаДокументаСтрокой)
		И Не ЗначениеЗаполнено(ПредставлениеДанныхКомпонента.НДСДокументаСтрокой) Тогда
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML, ИдентификаторПанелиИтогов);
		Возврат;
	КонецЕсли;

	РеквизитыДокументаИОтражениеВУчетеHTML = СтрЗаменить(РеквизитыДокументаИОтражениеВУчетеHTML,
		"%СуммаДокумента", ПредставлениеДанныхКомпонента.СуммаДокументаСтрокой);
	РеквизитыДокументаИОтражениеВУчетеHTML = СтрЗаменить(РеквизитыДокументаИОтражениеВУчетеHTML,
		"%СуммаНДС", ПредставлениеДанныхКомпонента.НДСДокументаСтрокой);
		
	ДобавитьОтступПослеПанелиВПолеHTML(РеквизитыДокументаИОтражениеВУчетеHTML, ИдентификаторПанелиИтогов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонТекстаПанелиИтогов()
	
	Возврат СтрШаблон("<div id=%1>%2</div><div><span style=""color: #808080;"">%3</span></div>",
		ИдентификаторПанелиИтогов(), "%СуммаДокумента", "%СуммаНДС");
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторПанелиИтогов()
	Возврат "ПанельИтогов";
КонецФункции

#КонецОбласти // ПанельИтогов

#Область ПанельОтветственного

// Параметры:
//  ДанныеКомпонента - См. ЛегкийИнтерфейсДокументовЭДО.НовыеДанныеКомпонентаПанельОтветственного
&НаКлиенте
Процедура НастроитьПанельОтветственного(ДанныеКомпонента)
	
	ИдентификаторПанелиОтветственного = ИдентификаторПанелиОтветственного();
	
	Если Не ДанныеКомпонента.ИспользуетсяРазделениеДокументовПоОтветственным Тогда
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML, ИдентификаторПанелиОтветственного);
		Возврат;
	КонецЕсли;
	
	ДобавитьПанельВПолеHTML(РеквизитыДокументаИОтражениеВУчетеHTML,
		ИдентификаторПанелиОтветственного, ШаблонТекстаПанелиОтветственного(), Истина);
	
	ЗаголовокОтветственный = ?(ЗначениеЗаполнено(ДанныеКомпонента.ОтветственныйПоДокументу),
		Строка(ДанныеКомпонента.ОтветственныйПоДокументу), НСтр("ru='Не указан'"));
	РеквизитыДокументаИОтражениеВУчетеHTML = СтрЗаменить(РеквизитыДокументаИОтражениеВУчетеHTML,
		"%Содержимое", ТекстСсылкиДляПоляHTML(ИдентификаторКомандыСменитьОтветственного(), ЗаголовокОтветственный));
		
	ДобавитьОтступПослеПанелиВПолеHTML(РеквизитыДокументаИОтражениеВУчетеHTML, ИдентификаторПанелиОтветственного);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонТекстаПанелиОтветственного()
	
	Возврат СтрШаблон("<div id=%1>Ответственный: %2</div>",
		ИдентификаторПанелиОтветственного(),
		"%Содержимое");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторПанелиОтветственного()
	Возврат "ПанельОтветственного";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторКомандыСменитьОтветственного()
	Возврат "СменитьОтветственного";
КонецФункции

#КонецОбласти // ПанельОтветственного

#Область ПанельОтраженияВУчете

// Параметры:
//  ДанныеКомпонента - См. ЛегкийИнтерфейсДокументовЭДО.НовыеДанныеКомпонентаПанельОтраженияВУчете
&НаКлиенте
Процедура НастроитьПанельОтраженияВУчете(ДанныеКомпонента)

	ИдентификаторПанелиОтраженияВУчете = ИдентификаторПанелиОтраженияВУчете();

	ОбъектыУчетаТекущегоДокумента.Очистить();
	Для Каждого ОбъектУчета Из ДанныеКомпонента.ОбъектыУчетаДокумента Цикл
		НоваяСтрока = ОбъектыУчетаТекущегоДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбъектУчета);
	КонецЦикла;
	ЕстьВозможностьОтраженияВУчетеТекущегоДокумента = ДанныеКомпонента.ЕстьВозможностьОтраженияВУчете;
	ЕстьНоменклатураНаКонтролеТекущегоДокумента = ДанныеКомпонента.ЕстьНоменклатураНаКонтроле;
	ЕстьПравоОбработкиДокументов = ДанныеКомпонента.ЕстьПравоОбработкиДокументов;
	
	ПредставлениеДанныхКомпонента = 
		ЛегкийИнтерфейсДокументовЭДОКлиентСервер.ПредставлениеДанныхПоДаннымКомпонентаПанельОтраженияВУчете(
		ДанныеКомпонента);
	
	СпособыОбработкиОсновные = ПредставлениеДанныхКомпонента.СпособыОбработкиОсновные;
	СпособыОбработкиДополнительные = ПредставлениеДанныхКомпонента.СпособыОбработкиДополнительные;
	СписокСоздания = ПредставлениеДанныхКомпонента.СписокСоздания;
	СписокПодбора = ПредставлениеДанныхКомпонента.СписокПодбора;
	
	ДобавитьПанельВПолеHTML(РеквизитыДокументаИОтражениеВУчетеHTML,
		ИдентификаторПанелиОтраженияВУчете, ШаблонТекстаПанелиОтраженияВУчете(), Истина);
		
	ЭтоВходящийЭДО = (ТипЗнч(ТекущийЭлектронныйДокумент) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО"));
	
	КоличествоОбъектовУчета = ОбъектыУчетаТекущегоДокумента.Количество();
	ИспользуетсяДополнительныйДокумент = СпособыОбработкиДополнительные.Количество() > 0;

	НетОбъектовУчета = (КоличествоОбъектовУчета = 0);
	ОдинОбъектУчета = (КоличествоОбъектовУчета = 1);
	МногоОбъектовУчета = (КоличествоОбъектовУчета >= 2);

	Если (НетОбъектовУчета И Не ЭтоВходящийЭДО)
		Или (Не ЕстьПравоОбработкиДокументов И НетОбъектовУчета) Тогда
		УдалитьПанельИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML, ИдентификаторПанелиОтраженияВУчете);
		УдалитьОтступПанелиИзПоляHTML(РеквизитыДокументаИОтражениеВУчетеHTML, ИдентификаторПанелиОтветственного());
		Возврат;
	КонецЕсли;
	
	ЗаголовокПанели = ?(МногоОбъектовУчета, НСтр("ru = 'Документы учета:'"), НСтр("ru = 'Документ учета:'"));
		
	ТекстПанелиОтраженияВУчете = "";
	ЗаголовокПодобрать = НСтр("ru = 'Подобрать'");
	
	Если ЕстьПравоОбработкиДокументов И НетОбъектовУчета И ЕстьВозможностьОтраженияВУчетеТекущегоДокумента Тогда
		ТекстПанелиОтраженияВУчете = ТекстПанелиОтраженияВУчете
			+ ТекстСсылкиВПанелиОтраженияВУчете(ИдентификаторКомандыСоздатьДокументУчета(), НСтр("ru = 'Создать'"))
			+ ТекстВБлочномЭлементеСОтступомДляПоляHTML(НСтр("ru = 'или'"))
			+ ТекстСсылкиВПанелиОтраженияВУчете(ИдентификаторКомандыПодобратьДокументУчета1(), ЗаголовокПодобрать);
	КонецЕсли;

	Если ОдинОбъектУчета Или МногоОбъектовУчета Тогда
		ТекстПанелиОтраженияВУчете = ТекстПанелиОтраженияВУчете + ТекстСсылкиВПанелиОтраженияВУчете(
			"ОткрытьДокументУчета1", Строка(ОбъектыУчетаТекущегоДокумента[0].ОбъектУчета));
	КонецЕсли;

	Если ОдинОбъектУчета И ИспользуетсяДополнительныйДокумент И ЕстьПравоОбработкиДокументов Тогда

		ЕстьОсновнойДокумент = ЛегкийИнтерфейсДокументовЭДОКлиентСервер.ЕстьОтражениеВОбъектУчетаКарточкиДокумента(
			ОбъектыУчетаТекущегоДокумента, СпособыОбработкиОсновные);

		ТекстВторогоДокумента = ЗаголовокПодобрать;

		Если ОдинОбъектУчета Тогда

			Если ЕстьОсновнойДокумент И СпособыОбработкиДополнительные.Количество() = 1 Тогда

				ТекстВторогоДокумента = СтрШаблон(НСтр("ru = 'Подобрать ""%1""'"),
					СпособыОбработкиДополнительные[0].Представление);

			ИначеЕсли Не ЕстьОсновнойДокумент И СпособыОбработкиОсновные.Количество() = 1 Тогда

				ТекстВторогоДокумента = СтрШаблон(НСтр("ru = 'Подобрать ""%1""'"),
					СпособыОбработкиОсновные[0].Представление);

			КонецЕсли;

		КонецЕсли;

		ТекстПанелиОтраженияВУчете = ТекстПанелиОтраженияВУчете + ТекстСсылкиВПанелиОтраженияВУчете(
			ИдентификаторКомандыПодобратьДокументУчета2(), ТекстВторогоДокумента);

	КонецЕсли;

	Если Не ЕстьВозможностьОтраженияВУчетеТекущегоДокумента И Не МногоОбъектовУчета
		Или (ОдинОбъектУчета И Не ИспользуетсяДополнительныйДокумент) Тогда
		ЗаголовокКомандыПоказатьВсеДокументыУчета = ЗаголовокПодобрать;
	ИначеЕсли МногоОбъектовУчета Тогда
		ЗаголовокКомандыПоказатьВсеДокументыУчета =
			СтрШаблон(НСтр("ru = 'и еще (%1)'"), КоличествоОбъектовУчета - 1);
	Иначе
		ЗаголовокКомандыПоказатьВсеДокументыУчета = НСтр("ru = 'Все документы'");
	КонецЕсли;
	
	Если МногоОбъектовУчета
		Или Не ЕстьВозможностьОтраженияВУчетеТекущегоДокумента И НетОбъектовУчета
		Или ДанныеКомпонента.ЭтоПрикладнойВидДокумента
		Или ДанныеКомпонента.ЭтоВнутреннийВидДокумента И МногоОбъектовУчета Тогда
		ТекстПанелиОтраженияВУчете = ТекстПанелиОтраженияВУчете
			+ ТекстСсылкиВПанелиОтраженияВУчете(ИдентификаторКомандыПоказатьВсеДокументыУчета(),
				ЗаголовокКомандыПоказатьВсеДокументыУчета);
	КонецЕсли;

	РеквизитыДокументаИОтражениеВУчетеHTML = СтрЗаменить(РеквизитыДокументаИОтражениеВУчетеHTML,
		"%Заголовок", ЗаголовокПанели);
	РеквизитыДокументаИОтражениеВУчетеHTML = СтрЗаменить(РеквизитыДокументаИОтражениеВУчетеHTML,	
		"%Содержимое", ТекстПанелиОтраженияВУчете);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонТекстаПанелиОтраженияВУчете()
	
	Возврат СтрШаблон("<div id=%1>%2</div>%3",
		ИдентификаторПанелиОтраженияВУчете(),
		"%Заголовок",
		"%Содержимое");
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторПанелиОтраженияВУчете()
	Возврат "ПанельОтраженияВУчете";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстСсылкиВПанелиОтраженияВУчете(Ссылка, ПредставлениеСсылки)
	
	Возврат СтрШаблон("<div>%1</div>", ТекстСсылкиДляПоляHTML(Ссылка, ПредставлениеСсылки));
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторКомандыСоздатьДокументУчета()
	Возврат "СоздатьДокументУчета";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторКомандыПодобратьДокументУчета1()
	Возврат "ПодобратьДокументУчета1";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторКомандыПодобратьДокументУчета2()
	Возврат "ПодобратьДокументУчета2";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторКомандыОткрытьДокументУчета1()
	Возврат "ОткрытьДокументУчета1";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторКомандыОткрытьДокументУчета2()
	Возврат "ОткрытьДокументУчета2";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторКомандыПоказатьВсеДокументыУчета()
	Возврат "ПоказатьВсеДокументыУчета";
КонецФункции

#КонецОбласти // ПанельОтраженияВУчете

#КонецОбласти // ПредставлениеДанныхВHTML

#КонецОбласти 

 #Область ВидимостьЭлементовФормы
 
&НаСервере
Процедура КоличествоДокументов()
	
	КоличествоНовыхВходящие 	= 0;
	КоличествоНовыхИсходящие 	= 0;
	КоличествоПриглашений		= 0;
	КоличествоСоздать 			= 0;
	
	СостоянияЭДО = СостоянияДокументовТребующиеВнимания();

	Запрос = Новый Запрос;
	ТекстЗапросаВходящиеТребуютВнимания(Запрос);
	Запрос.УстановитьПараметр("Состояние", СостоянияЭДО);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоНовыхВходящие = ВыборкаДетальныеЗаписи.Количество();
	
	Запрос = Новый Запрос;
	ТекстЗапросаИсходящиеТребуютВнимания(Запрос);
	Запрос.УстановитьПараметр("Состояние", СостоянияЭДО);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоНовыхИсходящие = ВыборкаДетальныеЗаписи.Количество();
	
	Если ЭтоМобильныйКлиент Тогда
		
		МК_ОбновитьЗаголовкиПереключателейСтраниц();
		
		Задолженность = СведенияОЗадолженности();
		ПоказатьУведомленияПоЗадолженности(ЭтотОбъект, Задолженность);
		ПоказатьУведомлениеПоТекущемуТрафику();
		Возврат;
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапросаСоздатьНовый(Запрос);
	
	Запрос.УстановитьПараметр("ТипыДоговорСКонтрагентомЭДО", ТипыДоговорСКонтрагентомЭДО);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоСоздать = ВыборкаДетальныеЗаписи.Количество();
	
	СтатусыПриглашений = Новый СписокЗначений; 
	СтатусыПриглашений.Добавить(Перечисления.СтатусыПриглашений.ТребуетсяСогласие);
	СтатусыПриглашений.Добавить(Перечисления.СтатусыПриглашений.ТребуетсяОтправить);
	ПустойКонтрагент = Метаданные.ОпределяемыеТипы.КонтрагентБЭД.Тип.ПривестиЗначение();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОсновнаяТаблица.Ключ КАК КлючПриглашения,
		|	ОсновнаяТаблица.Статус КАК СтатусПодключения,
		|	ВЫБОР
		|		КОГДА ОсновнаяТаблица.Контрагент = &ПустойКонтрагент
		|				ИЛИ ОсновнаяТаблица.Контрагент = НЕОПРЕДЕЛЕНО
		|			ТОГДА ОсновнаяТаблица.Наименование + "" ("" + &ИНН + "": "" + ОсновнаяТаблица.ИНН + "")""
		|		ИНАЧЕ ОсновнаяТаблица.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	УчетныеЗаписиЭДО.Организация КАК Организация,
		|	ОсновнаяТаблица.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
		|	ОсновнаяТаблица.Ознакомиться КАК Ознакомиться,
		|	ОсновнаяТаблица.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ВЫБОР
		|		КОГДА ОсновнаяТаблица.Контрагент = &ПустойКонтрагент
		|				ИЛИ ОсновнаяТаблица.Контрагент = НЕОПРЕДЕЛЕНО
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НовыйКонтрагент
		|ИЗ
		|	РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами КАК ОсновнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетныеЗаписиЭДО КАК УчетныеЗаписиЭДО
		|		ПО ОсновнаяТаблица.ИдентификаторОрганизации = УчетныеЗаписиЭДО.ИдентификаторЭДО
		|ГДЕ
		|	ОсновнаяТаблица.Контрагент <> &ПустойКонтрагент
		|	И ОсновнаяТаблица.ДатаИзмененияСтатуса <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ОсновнаяТаблица.Статус В (&СтатусыПриглашений)";
	
	Запрос.УстановитьПараметр("ПустойКонтрагент", ПустойКонтрагент); 
	Запрос.УстановитьПараметр("СтатусыПриглашений", СтатусыПриглашений);
	Запрос.УстановитьПараметр("ИНН", НСтр("ru = 'ИНН'"));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоПриглашений = ВыборкаДетальныеЗаписи.Количество();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТранспортныйКонтейнерЭДО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТранспортныйКонтейнерЭДО КАК ТранспортныйКонтейнерЭДО
		|ГДЕ
		|	(&ОтображатьУдаленные ИЛИ НЕ ТранспортныйКонтейнерЭДО.ПометкаУдаления)
		|	И НЕ ТранспортныйКонтейнерЭДО.СпособОбменаЭД = ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.УдалитьЧерезВебРесурсБанка)
		|	И ТранспортныйКонтейнерЭДО.Статус В(&СтатусыНеРаспакованныхТранспортныхСообщенийБЭД)
		|	И ТранспортныйКонтейнерЭДО.Направление = &Направление
		|{ГДЕ
		|	ТранспортныйКонтейнерЭДО.Направление}";
	
	СтатусыНеРаспакованныхТранспортныхСообщений = СтатусыНеРаспакованныхТранспортныхСообщенийБЭД();
	Запрос.УстановитьПараметр("СтатусыНеРаспакованныхТранспортныхСообщенийБЭД",
		СтатусыНеРаспакованныхТранспортныхСообщений); 
	
	ВходящееНаправление = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Входящий");
	Запрос.УстановитьПараметр("Направление",  
		ВходящееНаправление);
		
	Запрос.УстановитьПараметр("ОтображатьУдаленные", ОтображатьУдаленные);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	КоличествоНераспакованныхКонтейнеров = ВыборкаДетальныеЗаписи.Количество();
	
	ПанельНавигации.Очистить();
	РазделыПанелиНавигации = РазделыПанелиНавигации();
	ИдентификаторТекущейСтроки = 0;
	Для Каждого Раздел Из РазделыПанелиНавигации Цикл
		ИмяРаздела = Раздел.Значение;
		
		Если Раздел.Ключ = РазделыПанелиНавигации().Ошибки
			И КоличествоНераспакованныхКонтейнеров = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ПанельНавигации.Добавить();
		НоваяСтрока.ИмяСписка = ИмяРаздела; 
		НоваяСтрока.Представление = ПредставлениеРазделаПанелиНавигации(ИмяРаздела);
		
		Если ИмяРаздела = РазделыПанелиНавигации().ВходящиеЭлектронныеДокументы Тогда
			КоличествоДокументов = КоличествоНовыхВходящие;
		ИначеЕсли ИмяРаздела = РазделыПанелиНавигации().ИсходящиеЭлектронныеДокументы Тогда
			КоличествоДокументов = КоличествоНовыхИсходящие
		ИначеЕсли ИмяРаздела = РазделыПанелиНавигации().Ошибки Тогда
			КоличествоДокументов = КоличествоНераспакованныхКонтейнеров;
		ИначеЕсли ИмяРаздела = РазделыПанелиНавигации().Приглашения Тогда
			КоличествоДокументов = КоличествоПриглашений;
		ИначеЕсли ИмяРаздела = РазделыПанелиНавигации().Сформировать Тогда
			КоличествоДокументов = КоличествоСоздать;
		Иначе
			КоличествоДокументов = 0;
		КонецЕсли;
		Если КоличествоДокументов = 0 Тогда
			НоваяСтрока.КоличествоДокументов = "";
		Иначе
			НоваяСтрока.КоличествоДокументов = Строка(КоличествоДокументов);
		КонецЕсли;
		
		Если ТекущийРаздел = ИмяРаздела Тогда
			ИдентификаторТекущейСтроки = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ПанельНавигации.ТекущаяСтрока = ИдентификаторТекущейСтроки;
	
	Задолженность = СведенияОЗадолженности();
	ПоказатьУведомленияПоЗадолженности(ЭтотОбъект, Задолженность);
	ПоказатьУведомлениеПоТекущемуТрафику();
	
	ТребуетсяОбновитьСчетчикиКоличестваДокументов = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ТекстЗапросаСоздатьНовый(Запрос)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияЭД.СсылкаНаОбъект КАК Документ
		|ИЗ
		|	РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
		|ГДЕ
		|	СостоянияЭД.СостояниеЭДО = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.НеСформирован)
		|	И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Документ.УдалитьПроизвольныйЭД
		|	И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Документ.ТранспортныйКонтейнерЭДО
		|	И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Справочник.НастройкиЭДО
		|	И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Справочник.УдалитьСоглашенияОбИспользованииЭД
		|	И НЕ ТИПЗНАЧЕНИЯ(СостоянияЭД.СсылкаНаОбъект) В (&ТипыДоговорСКонтрагентомЭДО)
		|	И СостоянияЭД.Вид <> """"";
		
КонецПроцедуры

&НаСервере
Процедура ТекстЗапросаИсходящиеТребуютВнимания(Запрос)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭлектронныеДокументыПереопределяемый.Ссылка КАК ЭлектронныйДокумент,
		|	ЭлектронныеДокументыПереопределяемый.Ответственный КАК Ответственный,
		|	СостоянияЭДОПереопределяемый.Состояние КАК СостояниеЭДО
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныеДокументыПереопределяемый
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияЭДОПереопределяемый
		|		ПО (СостоянияЭДОПереопределяемый.ЭлектронныйДокумент = ЭлектронныеДокументыПереопределяемый.Ссылка)
		|ГДЕ
		|	НЕ ЭлектронныеДокументыПереопределяемый.ПометкаУдаления
		|	И СостоянияЭДОПереопределяемый.Состояние В(&Состояние)";
		
КонецПроцедуры

&НаСервере
Процедура ТекстЗапросаВходящиеТребуютВнимания(Запрос)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭлектронныеДокументыПереопределяемый.Ссылка КАК ЭлектронныйДокумент,
		|	ЭлектронныеДокументыПереопределяемый.Ответственный КАК Ответственный,
		|	СостоянияЭДОПереопределяемый.Состояние КАК СостояниеЭДО
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныеДокументыПереопределяемый
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияЭДОПереопределяемый
		|		ПО (СостоянияЭДОПереопределяемый.ЭлектронныйДокумент = ЭлектронныеДокументыПереопределяемый.Ссылка)
		|ГДЕ
		|	НЕ ЭлектронныеДокументыПереопределяемый.ПометкаУдаления
		|	И СостоянияЭДОПереопределяемый.Состояние В(&Состояние)";

КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКомандТекущейСтроки(ТекущиеДанные)
	
	Элементы.ВходящиеЭлектронныеДокументыВходящиеУтвердить.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеУтвердитьПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеПодписать.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеПодписатьПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеОтказатьсяОтПодписания.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеОтказатьсяОтПодписанияПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеУтвердить.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеУтвердитьПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеПодписать.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеПодписатьПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтказатьсяОтПодписания.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтказатьсяОтПодписанияПакет.Видимость = Ложь; 
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеЗапроситьУточнение.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеЗапроситьУточнениеПакет.Видимость = Ложь;
	
	Элементы.ВходящиеЭлектронныеДокументыВходящиеЗапроситьУточнение.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеЗапроситьУточнениеПакет.Видимость = Ложь;
	               
	ЗаголовокОтказа = ?(ВыполненПереходНаУниверсальныеСообщения, НСтр("ru = 'Отказаться от подписания'") ,НСтр("ru = 'Отклонить'"));
	ЗаголовокОтказаПакета = ?(ВыполненПереходНаУниверсальныеСообщения, НСтр("ru = 'Отказаться от подписания пакета'") ,НСтр("ru = 'Отклонить пакет'"));
	
	Элементы.ВходящиеЭлектронныеДокументыВходящиеОтказатьсяОтПодписания.Заголовок = ЗаголовокОтказа;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеОтказатьсяОтПодписанияПакет.Заголовок = ЗаголовокОтказаПакета;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтказатьсяОтПодписания.Заголовок = ЗаголовокОтказа;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтказатьсяОтПодписанияПакет.Заголовок = ЗаголовокОтказаПакета;
	
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеУтвердить.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеУтвердитьПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеПодписать.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеПодписатьПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтказатьсяОтПодписания.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтказатьсяОтПодписанияПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеУтвердить.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеУтвердитьПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеПодписать.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеПодписатьПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтказатьсяОтПодписания.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтказатьсяОтПодписанияПакет.Видимость = Ложь;
	
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтказатьсяОтПодписания.Заголовок = ЗаголовокОтказа;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтказатьсяОтПодписанияПакет.Заголовок = ЗаголовокОтказаПакета;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтказатьсяОтПодписания.Заголовок = ЗаголовокОтказа;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтказатьсяОтПодписанияПакет.Заголовок = ЗаголовокОтказаПакета;

	Элементы.ВходящиеЭлектронныеДокументыВходящиеПринятьАннулирование.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеПринятьАннулированиеПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеОтклонитьАннулирование.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеОтклонитьАннулированиеПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеПринятьАннулирование.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеПринятьАннулированиеПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтклонитьАннулирование.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтклонитьАннулированиеПакет.Видимость = Ложь;
	
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеПринятьАннулирование.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеПринятьАннулированиеПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтклонитьАннулирование.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтклонитьАннулированиеПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеПринятьАннулирование.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеПринятьАннулированиеПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтклонитьАннулирование.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтклонитьАннулированиеПакет.Видимость = Ложь;
	
	Элементы.ВходящиеЭлектронныеДокументыВходящиеОтправить.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеОтправитьПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеВернутьНаПодготовкуКОтправке.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтправить.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтправитьПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеВернутьНаПодготовкуКОтправке.Видимость = Ложь;
	
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтправить.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтправитьПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеВернутьНаПодготовкуКОтправке.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтправить.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтправитьПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеВернутьНаПодготовкуКОтправке.Видимость = Ложь;
	
	Элементы.ВходящиеЭлектронныеДокументыВходящиеАннулировать.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеАннулироватьПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеАннулироватьВнутреннийДокумент.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеАннулировать.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеАннулироватьПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеАннулироватьВнутреннийДокумент.Видимость = Ложь;
	
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеАннулировать.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеАннулироватьПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеАннулироватьВнутреннийДокумент.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеАннулировать.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеАннулироватьПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеАннулироватьВнутреннийДокумент.Видимость = Ложь;

	Элементы.ВходящиеЭлектронныеДокументыВходящиеЗакрытьПринудительно.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыВходящиеЗакрытьПринудительноПакет.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеЗакрытьПринудительно.Видимость = Ложь;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеЗакрытьПринудительноПакет.Видимость = Ложь;
	
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеЗакрытьПринудительно.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыИсходящиеЗакрытьПринудительноПакет.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеЗакрытьПринудительно.Видимость = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеЗакрытьПринудительноПакет.Видимость = Ложь;
	
	Если ТекущиеДанные = Неопределено
		Или Не ТекущиеДанные.Свойство("СостояниеЭДО") Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеЭДО = ТекущиеДанные.СостояниеЭДО;
	СпособОбмена = ТекущиеДанные.СпособОбмена;
	ТипТекущегоДокумента = ТекущиеДанные.ТипДокумента;
	ЭтоПакетДокументов = ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторПакета);
	ЭтоВнутреннийДокумент = 
		ТипТекущегоДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.Внутренний");
	
	Если СпособОбмена <> ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.Внутренний") Тогда
		
		Элементы.ВходящиеЭлектронныеДокументыВходящиеЗакрытьПринудительно.Видимость = Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеЗакрытьПринудительно.Видимость =
			Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеЗакрытьПринудительноПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеЗакрытьПринудительноПакет.Видимость =
			ЭтоПакетДокументов;
		
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеЗакрытьПринудительно.Видимость = Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеЗакрытьПринудительно.Видимость =
			Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеЗакрытьПринудительноПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеЗакрытьПринудительноПакет.Видимость =
			ЭтоПакетДокументов;
						
		Элементы.ВходящиеЭлектронныеДокументыВходящиеЗапроситьУточнение.Видимость = Не ЭтоПакетДокументов И ВыполненПереходНаУниверсальныеСообщения;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеЗапроситьУточнениеПакет.Видимость = ЭтоПакетДокументов И ВыполненПереходНаУниверсальныеСообщения;
		
	КонецЕсли;
	
	Если СостояниеЭДО = ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписание") 
		И ТипТекущегоДокумента <> 
		ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.МашиночитаемаяДоверенность")
		Тогда
		
		Элементы.ВходящиеЭлектронныеДокументыВходящиеАннулировать.Видимость = Не ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеАннулировать.Видимость = Не ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеАннулировать.Видимость = Не ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеАннулировать.Видимость = Не ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		
	ИначеЕсли ТипТекущегоДокумента <> 
		ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.МашиночитаемаяДоверенность")
		И СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяУтверждение")
		Или СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяИзвещениеОПолучении")
		Или СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения")
		Или СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеИзвещения")
		Или СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяОтправкаИзвещения")
		Или СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеОператора")
		Или СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяИзвещениеОПолучении")
		Или СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждение")
		Или СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОбменЗавершен")
		Тогда
		
		Элементы.ВходящиеЭлектронныеДокументыВходящиеАннулировать.Видимость = Не ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеАннулировать.Видимость = Не ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеАннулироватьПакет.Видимость = ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеАннулироватьПакет.Видимость = ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеАннулироватьВнутреннийДокумент.Видимость = ЭтоВнутреннийДокумент;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеАннулироватьВнутреннийДокумент.Видимость =
			ЭтоВнутреннийДокумент;
		
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеАннулировать.Видимость = Не ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеАннулировать.Видимость = Не ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеАннулироватьПакет.Видимость = ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеАннулироватьПакет.Видимость = ЭтоПакетДокументов
			И Не ЭтоВнутреннийДокумент;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеАннулироватьВнутреннийДокумент.Видимость = ЭтоВнутреннийДокумент;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеАннулироватьВнутреннийДокумент.Видимость =
			ЭтоВнутреннийДокумент;
		
	КонецЕсли;
	
	Если СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяУтверждение") Тогда
		
		Элементы.ВходящиеЭлектронныеДокументыВходящиеУтвердить.Видимость = Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеУтвердитьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеУтвердить.Видимость = Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеУтвердитьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеОтказатьсяОтПодписания.Видимость = Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеОтказатьсяОтПодписанияПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтказатьсяОтПодписания.Видимость = 
			Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтказатьсяОтПодписанияПакет.Видимость = 
			ЭтоПакетДокументов;
		
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеУтвердить.Видимость = Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеУтвердитьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеУтвердить.Видимость = Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеУтвердитьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтказатьсяОтПодписания.Видимость = Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтказатьсяОтПодписанияПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтказатьсяОтПодписания.Видимость =
			Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтказатьсяОтПодписанияПакет.Видимость =
			ЭтоПакетДокументов;  
			
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеЗапроситьУточнение.Видимость = Не ЭтоПакетДокументов И ВыполненПереходНаУниверсальныеСообщения;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеЗапроситьУточнениеПакет.Видимость = ЭтоПакетДокументов И ВыполненПереходНаУниверсальныеСообщения;
		
	ИначеЕсли СостояниеЭДО = 
			ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписание") 
		Или СостояниеЭДО = 
			ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования")
		Или СостояниеЭДО = 
			ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения") Тогда
			
		Элементы.ВходящиеЭлектронныеДокументыВходящиеПодписать.Видимость = Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеПодписатьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеПодписать.Видимость = Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеПодписатьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеОтказатьсяОтПодписания.Видимость = Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтказатьсяОтПодписания.Видимость =
			Не ЭтоПакетДокументов;
		
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеПодписать.Видимость = Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеПодписатьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеПодписать.Видимость = Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеПодписатьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтказатьсяОтПодписания.Видимость = Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтказатьсяОтПодписания.Видимость =
			Не ЭтоПакетДокументов;
			
		Элементы.ВходящиеЭлектронныеДокументыВходящиеОтказатьсяОтПодписанияПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтказатьсяОтПодписанияПакет.Видимость = 
			ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтказатьсяОтПодписанияПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтказатьсяОтПодписанияПакет.Видимость = 
			ЭтоПакетДокументов;
			
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеЗапроситьУточнение.Видимость = Не ЭтоПакетДокументов И ВыполненПереходНаУниверсальныеСообщения;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеЗапроситьУточнениеПакет.Видимость = ЭтоПакетДокументов И ВыполненПереходНаУниверсальныеСообщения;
	
	ИначеЕсли СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования") Тогда
		
		Элементы.ВходящиеЭлектронныеДокументыВходящиеПринятьАннулирование.Видимость = Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеПринятьАннулированиеПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеПринятьАннулирование.Видимость =
			Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеПринятьАннулированиеПакет.Видимость =
			ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеОтклонитьАннулирование.Видимость = Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеОтклонитьАннулированиеПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтклонитьАннулирование.Видимость =
			Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтклонитьАннулированиеПакет.Видимость =
			ЭтоПакетДокументов;
		
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеПринятьАннулирование.Видимость = Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеПринятьАннулированиеПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеПринятьАннулирование.Видимость =
			Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеПринятьАннулированиеПакет.Видимость =
			ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтклонитьАннулирование.Видимость = Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтклонитьАннулированиеПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтклонитьАннулирование.Видимость =
			Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтклонитьАннулированиеПакет.Видимость =
			ЭтоПакетДокументов;
		
	ИначеЕсли СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправке")
		Или СостояниеЭДО = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяОтправка") Тогда
		
		Элементы.ВходящиеЭлектронныеДокументыВходящиеОтправить.Видимость = Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеОтправитьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтправить.Видимость = Не ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеОтправитьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ВходящиеЭлектронныеДокументыВходящиеВернутьНаПодготовкуКОтправке.Видимость = Истина;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеВернутьНаПодготовкуКОтправке.Видимость = Истина;
		
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтправить.Видимость = Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеОтправитьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтправить.Видимость = Не ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеОтправитьПакет.Видимость = ЭтоПакетДокументов;
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеВернутьНаПодготовкуКОтправке.Видимость = Истина;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеВернутьНаПодготовкуКОтправке.Видимость = Истина;
		
	ИначеЕсли СостояниеЭДО = 
			ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения") 
		Или СостояниеЭДО = 
			ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещенияПоОтклонению")
			Тогда
		
		Элементы.ВходящиеЭлектронныеДокументыВходящиеПодписать.Видимость = Истина;
		Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюВходящиеПодписать.Видимость = Истина;
		
		Элементы.ИсходящиеЭлектронныеДокументыИсходящиеПодписать.Видимость = Истина;
		Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюИсходящиеПодписать.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовИКоманд()
	
	ТекущиеДанные = Неопределено;
		
	Если ТекущийРаздел = РазделыПанелиНавигации().ВходящиеЭлектронныеДокументы Тогда
		
		ТекущиеДанные = Элементы.ВходящиеЭлектронныеДокументы.ТекущиеДанные;
		
	ИначеЕсли ТекущийРаздел = РазделыПанелиНавигации().ИсходящиеЭлектронныеДокументы Тогда
		
		ТекущиеДанные = Элементы.ИсходящиеЭлектронныеДокументы.ТекущиеДанные;
		
	ИначеЕсли ТекущийРаздел = РазделыПанелиНавигации().Сформировать Тогда
		
		ТекущиеДанные = Элементы.Сформировать.ТекущиеДанные;
		
	ИначеЕсли ТекущийРаздел = РазделыПанелиНавигации().Приглашения Тогда
		
		ТекущиеДанные = Неопределено;
		
	ИначеЕсли ТекущийРаздел = РазделыПанелиНавигации().Ошибки Тогда
		
		ТекущиеДанные = Неопределено;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	НастроитьВидимостьКомандТекущейСтроки(ТекущиеДанные);
	ОбновитьОтображениеФильтров();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКомандФормыПоПравам()
	
	ЕстьПравоОбработкиДокументов = ЭлектронныеДокументыЭДО.ЕстьПравоОбработкиДокументов();
	ЕстьПравоНастройкиОбмена = НастройкиЭДО.ЕстьПравоНастройкиОбмена();
	ЕстьПравоАдминистрирования = ОбщегоНазначенияБЭД.ЕстьПравоАдминистрирования();
	ЕстьПравоВыполненияОбмена = СинхронизацияЭДО.ЕстьПравоВыполненияОбмена();

	Элементы.ИсходящиеЭлектронныеДокументыЗагрузитьНовыйДокументСДиска.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.СформироватьЗагрузитьНовыйДокументСДиска.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ПриглашенияНовоеПриглашение.Видимость = ЕстьПравоНастройкиОбмена;
	
	Элементы.ВходящиеЭлектронныеДокументыОбновить.Видимость = ЕстьПравоВыполненияОбмена;
	Элементы.ИсходящиеЭлектронныеДокументыОбновить.Видимость = ЕстьПравоВыполненияОбмена;
	Элементы.СформироватьОбновить.Видимость = ЕстьПравоВыполненияОбмена;
	Элементы.ПриглашенияОбновить.Видимость = ЕстьПравоВыполненияОбмена;
	Элементы.ОшибкиОбновить.Видимость = ЕстьПравоВыполненияОбмена;
	
	Элементы.ВходящиеЭлектронныеДокументыГруппаУтвердитьПодписатьОтклонить.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюУтвердитьПодписатьОтклонить.Видимость =
		ЕстьПравоОбработкиДокументов;
	Элементы.ВходящиеЭлектронныеДокументыГруппаАннулировать.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ВходящиеЭлектронныеДокументыГруппаОтправить.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ВходящиеЭлектронныеДокументыГруппаПредложитьАннулировать.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ВходящиеЭлектронныеДокументыГруппаЗакрытьПринудительно.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюАннулировать.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюОтправить.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюПредложитьАннулировать.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ВходящиеЭлектронныеДокументыКонтекстноеМенюЗакрытьПринудительно.Видимость = ЕстьПравоОбработкиДокументов;   
	
	Элементы.ВходящиеЭлектронныеДокументыГруппаВходящиеЗапроситьУточнение.Видимость = ЕстьПравоОбработкиДокументов И ВыполненПереходНаУниверсальныеСообщения;   
	
	Элементы.ИсходящиеЭлектронныеДокументыГруппаУтвердитьПодписатьОтклонить.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюУтвердитьПодписатьОтклонить.Видимость =
		ЕстьПравоОбработкиДокументов;
	Элементы.ИсходящиеЭлектронныеДокументыГруппаУтвердитьПодписатьОтклонить.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ИсходящиеЭлектронныеДокументыГруппаАннулировать.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ИсходящиеЭлектронныеДокументыГруппаОтправить.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ИсходящиеЭлектронныеДокументыГруппаПредложитьАннулировать.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ИсходящиеЭлектронныеДокументыГруппаЗакрытьПринудительно.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюАннулировать.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюОтправить.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюПредложитьАннулировать.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ИсходящиеЭлектронныеДокументыКонтекстноеМенюЗакрытьПринудительно.Видимость = ЕстьПравоОбработкиДокументов;
	
	Элементы.СформироватьПодписатьОтправить.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.СформироватьСформироватьЗакрытьПринудительно.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.СформироватьКонтекстноеМенюГруппаДействияЭДО.Видимость = ЕстьПравоОбработкиДокументов;
	
	Элементы.ПриглашенияПринятьПриглашения.Видимость = ЕстьПравоНастройкиОбмена;
	Элементы.ПриглашенияОтклонитьПриглашения.Видимость = ЕстьПравоНастройкиОбмена;
	Элементы.ПриглашенияОтправитьПриглашение.Видимость = ЕстьПравоНастройкиОбмена;
	Элементы.ПриглашенияКонтекстноеМенюГруппаДействияЭДО.Видимость = ЕстьПравоНастройкиОбмена;

	Элементы.ОшибкиГруппаДействияЭДО.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ОшибкиКонтекстноеМенюГруппаДействияЭДО.Видимость = ЕстьПравоОбработкиДокументов;

	Элементы.ФормаЗагрузитьФайлы.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ФормаПроверитьПодписи.Видимость = ЕстьПравоАдминистрирования;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКоличествоНепрочитанныхСообщений(Строки, ЭлектронныеДокументы)
	
	Если Не ЗначениеЗаполнено(ЭлектронныеДокументы) Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоНепрочитанныхСообщенийПоДокументам = РегистрыСведений.ТекстовыеСообщенияДокументовЭДО.КоличествоНепрочитанныхСообщенийПоДокументам(
		ЭлектронныеДокументы);

	Для Каждого ТекущаяСтрока Из Строки Цикл

		Данные = ТекущаяСтрока.Значение.Данные;
		Данные.КоличествоНепрочитанныхСообщений = КоличествоНепрочитанныхСообщенийПоДокументам[Данные.ЭлектронныйДокумент];

	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОтражениеВУчете

&НаКлиенте
Процедура ОткрытьДокументУчетаПоНомеру(НомерОбъектаУчета)

	Если ОбъектыУчетаТекущегоДокумента.Количество() >= НомерОбъектаУчета Тогда
		ПоказатьЗначение(, ОбъектыУчетаТекущегоДокумента[НомерОбъектаУчета - 1].ОбъектУчета);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасширенныйПодборОбъектовУчета()

	ДополнительныеПараметры = Новый Структура("ЭлектронныйДокумент", ТекущийЭлектронныйДокумент);
	ОбработкаРасширенногоПодбора = Новый ОписаниеОповещения(
		"ОбработатьРасширенныйПодборОбъектовУчета",
		ЛегкийИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);

	ПараметрыФормы = Новый Структура("ЭлектронныйДокумент, ВидДокумента, ДокументРаспознан",
		ТекущийЭлектронныйДокумент, 
		ВидТекущегоДокумента, 
		ЕстьВозможностьОтраженияВУчетеТекущегоДокумента);
		
	ИнтерфейсДокументовЭДОКлиент.ОткрытьПодборОбъектовУчетаЭлектронногоДокумента(ПараметрыФормы,
		ОбработкаРасширенногоПодбора);

КонецПроцедуры

#КонецОбласти // ОтражениеВУчете

#Область СопоставлениеНоменклатуры

&НаКлиенте
Процедура ПоказатьСопоставлениеНоменклатуры()

	НоменклатураДляСопоставления = Новый Массив;

	ЭлектронныеДокументы = Новый Массив;
	Для Каждого СтрокаСписка Из Элементы.ВходящиеЭлектронныеДокументы.ПолучитьСтрокиДляОбработки() Цикл
		ДанныеСтроки = Элементы.ВходящиеЭлектронныеДокументы.ДанныеСтроки(СтрокаСписка);
		ЭлектронныеДокументы.Добавить(ДанныеСтроки.ЭлектронныйДокумент);
	КонецЦикла;
	НоменклатураДляСопоставления = НоменклатураПоЭД(ЭлектронныеДокументы);

	Если Не ЗначениеЗаполнено(НоменклатураДляСопоставления) Тогда
		ТекстСообщения = НСтр("ru = 'Сопоставление номенклатуры не требуется.'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура("НоменклатураДляСопоставления", 
		НоменклатураДляСопоставления);
	ОбработкаЗавершения = Новый ОписаниеОповещения("ОбработатьСопоставлениеНоменклатуры", 
		ЭтотОбъект, ДополнительныеПараметры);
	
	СопоставлениеНоменклатурыКонтрагентовКлиент.ОткрытьСопоставлениеНоменклатуры(НоменклатураДляСопоставления, , 
		ОбработкаЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСопоставлениеНоменклатуры(Результат,
		ДополнительныеПараметры) Экспорт

	ОбновитьДинамическийСписокТекущегоРаздела();

КонецПроцедуры

&НаСервереБезКонтекста
Функция НоменклатураПоЭД(Знач ЭлектронныеДокументы)

	Отбор = ИнтеграцияЭДО.ОтборНоменклатурыКонтрагентовНаКонтроле(ЭлектронныеДокументы);
	Возврат ИнтеграцияЭДО.НоменклатураКонтрагентовНаКонтроле(Отбор);

КонецФункции

#КонецОбласти

#Область ДействияСДокументами

 &НаКлиенте
Процедура ОткрытьЭлектронныйДокументДляПросмотра(ДанныеСтроки)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокумент(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаПолучениеЭДЗавершение(Результат, Контекст) Экспорт
	
	ОбновитьДинамическиеСпискиФормы();
	
	Элементы.ВходящиеЭлектронныеДокументыОбновить.Доступность = Истина;
	Элементы.ИсходящиеЭлектронныеДокументыОбновить.Доступность = Истина;
	Элементы.СформироватьОбновить.Доступность = Истина;
	Элементы.ПриглашенияОбновить.Доступность = Истина;
	Элементы.ОшибкиОбновить.Доступность = Истина;
	
	КоличествоДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСформироватьПодписатьИОтправить()
	
	ВыделенныеСтроки = Элементы.Сформировать.ПолучитьСтрокиДляОбработки();
	НаборОбъектовУчета = Новый Массив(ВыделенныеСтроки.Количество());
	
	Для Индекс = 0 По НаборОбъектовУчета.ВГраница() Цикл
		НаборОбъектовУчета[Индекс] = Элементы.Сформировать.ДанныеСтроки(ВыделенныеСтроки[Индекс]).Документ;
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("ОбъектыУчета", НаборОбъектовУчета);
	ДополнительныеПараметры.Вставить("РежимПодписатьОтправить", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ДополнительныеПараметры);
	ДополнительныеПараметры.Вставить("Оповещение", Оповещение);
	
	Если ОтложеннаяОтправкаЭлектронныхДокументов Тогда
		ЭлектронныеДокументыЭДОКлиент.СформироватьПодписатьПодготовитьКОтправкеЭД(НаборОбъектовУчета,
			ДополнительныеПараметры);
	Иначе
		ЭлектронныеДокументыЭДОКлиент.СформироватьПодписатьОтправитьЭД(НаборОбъектовУчета, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьКомандаПодписать()
	
	ДанныеВыделенныхСтрокРаздела = ДанныеВыделенныхСтрокРаздела(ТекущийРаздел, 
		"ЭлектронныйДокумент, ИдентификаторПакета");
	
	Если Не ЗначениеЗаполнено(ДанныеВыделенныхСтрокРаздела) Тогда		
		Возврат;
	КонецЕсли;
	
	ОбъектыДействий = ОбъектыДействий(ДанныеВыделенныхСтрокРаздела);
	
	ЭтоПакетнаяОбработка = ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов);
	Если ЭтоПакетнаяОбработка И Не ВыполнениеДействийПоЭДОДоступноДляПакетов(ОбъектыДействий.ПакетыДокументов) Тогда
		ВидДействия = ЛегкийИнтерфейсДокументовЭДОКлиент.ВидыВыполняемыхДействийСДокументом().Подписать;
		ТекстВопроса = ЛегкийИнтерфейсДокументовЭДОКлиент.ТекстВопросаОВыполненииДействияДляДокументаПакета(ВидДействия);
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОставитьДляОбработкиТолькоТекущийДокумент(ОбъектыДействий);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НаборДействий = Новый Соответствие;	
	Если ТекущийРаздел <> РазделыПанелиНавигации().ИсходящиеЭлектронныеДокументы Тогда
		ДействияПоЭДОУтвердить = ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Утвердить");
		ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, 
			ДействияПоЭДОУтвердить);
		ДействияПоЭДОСформироватьОтвет = ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.СформироватьОтвет");
		ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, 
			ДействияПоЭДОСформироватьОтвет);
	КонецЕсли;
	ДействияПоЭДОПодписать = ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Подписать");
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, 
		ДействияПоЭДОПодписать);
	ДействияПоЭДОПодготовитьКОтправке = ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ПодготовитьКОтправке");
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, 
		ДействияПоЭДОПодготовитьКОтправке);
	Если Не ОтложеннаяОтправкаЭлектронныхДокументов Или ТекущийРаздел = РазделыПанелиНавигации().ВходящиеЭлектронныеДокументы Тогда
		ДействияПоЭДООтправить = ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Отправить");
		ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, 
			ДействияПоЭДООтправить);
	КонецЕсли;
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ОбъектыДействий.ЭлектронныеДокументы;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ОбъектыДействий.ПакетыДокументов;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения", 
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияДействийПоЭДО", ПараметрыВыполненияДействийПоЭДО);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ДополнительныеПараметры);
	
	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияДействийПоЭДО(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда

		Если Результат.Свойство("КонтекстДиагностики")
			И ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(Результат.КонтекстДиагностики) Тогда

			ПрочиеОшибки = Результат.КонтекстДиагностики.Диагностика.Ошибки;
			Если ПрочиеОшибки.Количество() = 1
				И ОбработкаНеисправностейБЭДКлиентСервер.ЭтоОшибкаДанногоВида(ПрочиеОшибки[0],
					МашиночитаемыеДоверенностиКлиентСервер.ВидОшибкиЕстьПодписиСМЧДДоверенностьНеНайдена()) Тогда
						МашиночитаемыеДоверенностиКлиент.ОткрытьДиалогРучногоПодтвержденияПроверкиПодписиПоМЧД(
							Результат.КонтекстДиагностики, ДополнительныеПараметры);
			Иначе
				ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(Результат.КонтекстДиагностики);
			КонецЕсли;

		ИначеЕсли Результат.Свойство("ОшибкиФормирования") И Результат.ОшибкиФормирования.Количество() Тогда

			ПараметрыОбработки = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыПроблемПриОбработкеДокументов();
			ПараметрыОбработки.АдресСведенийОбОшибках = ПоместитьВоВременноеХранилище(Результат.ОшибкиФормирования,
				Новый УникальныйИдентификатор());
			Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
				И ДополнительныеПараметры.Свойство("ОбъектыУчета") Тогда
				ПараметрыОбработки.СписокДокументовКОтправке = ДополнительныеПараметры.ОбъектыУчета;
			КонецЕсли;
			Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
				И ДополнительныеПараметры.Свойство("РежимПодписатьОтправить") Тогда
				ПараметрыОбработки.РежимПодписатьОтправить = ДополнительныеПараметры.РежимПодписатьОтправить;
			КонецЕсли;
			Если Результат.ОшибкиФормирования.Количество() = 1
				И Результат.ОшибкиФормирования[0].Свойство("ОшибкаФормированияВПрикладнойЧасти") 
				И Результат.ОшибкиФормирования[0].ОшибкаФормированияВПрикладнойЧасти <> Неопределено Тогда
				ПараметрыОбработки.Вставить("ОткрытьФормуРучногоФормированияОтветногоТитула", Истина);
			КонецЕсли;
			Оповещение = Новый ОписаниеОповещения("ПослеЗавершенияРаботыПомощникаФормирования", 
				ЭтотОбъект, ДополнительныеПараметры);
			ИнтерфейсДокументовЭДОКлиент.ПоказатьПроблемыПриОбработкеДокументов(Оповещение, ПараметрыОбработки);
	
		КонецЕсли;

	КонецЕсли; 
	
	ОбновитьДинамическийСписокТекущегоРаздела();
	
	НастроитьВидимостьКомандТекущейСтроки(Элементы[ТекущийРаздел].ТекущиеДанные);
	
	ПодключитьОбработчикОжидания("ОбновитьОбластьПросмотра", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияРаботыПомощникаФормирования(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат <> Неопределено Тогда
		ОповещениеЗавершения = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, 
			ДополнительныеПараметры);
		ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(ОповещениеЗавершения, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтменуФормированияДокументовПослеВводаСтроки(Комментарий, ДополнительныеПараметры) Экспорт
	
	Если Комментарий = Неопределено Тогда
		Возврат; 
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОВызовСервера.ОтменитьФормированиеДокументовПоОбъектамУчета(
		ДополнительныеПараметры.ОбъектыУчета, Комментарий);	
	
	Оповестить(ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияТекущихДелЭДО());
			
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьДокументамиПакетов(Знач ЭлектронныеДокументы)
	
	ПакетыДокументовЭДО.ДополнитьДокументамиПакетов(ЭлектронныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСменыОтветственного(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Или Не Результат.Успех Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ТекущиеДанныеТаблицыЭлектронныхДокументов();
	
	ОбновитьДанныеПослеСменыОтветственного(ТекущиеДанные);

КонецПроцедуры

#КонецОбласти

#Область РаботаСНераспакованнымиКонтейнерами

&НаКлиенте
Процедура УстановитьСтатусОтменен(МассивЭД)

	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	Количество = 0;
	СтатусыТранспортныхСообщенийБЭДОтменен = 
		ПредопределенноеЗначение("Перечисление.СтатусыТранспортныхСообщенийБЭД.Отменен");
	УстановитьСтатусТранспортныхКонтейнеров(МассивЭД, СтатусыТранспортныхСообщенийБЭДОтменен, Количество, 
		КонтекстДиагностики);
	ТекстОповещения = НСтр("ru = 'Изменен статус транспортного контейнера на ""Отменен"": (%1)'");
	ТекстОповещения = СтрЗаменить(ТекстОповещения, "%1", Количество);
	Текст = НСтр("ru = 'Обмен электронными документами'");
	ПоказатьОповещениеПользователя(Текст, , ТекстОповещения);
	ОбновитьДинамическийСписокТекущегоРаздела();
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСтатусТранспортныхКонтейнеров(Знач МассивКонтейнеров, Знач СтатусКонтейнера,
		КоличествоИзмененных, КонтекстДиагностики)

	КоличествоИзмененных = 0;
	Для Каждого СтрокаТаблицы Из МассивКонтейнеров Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Если СинхронизацияЭДО.ИзменитьСтатусТранспортногоКонтейнера(СтрокаТаблицы.Ссылка, СтатусКонтейнера) Тогда
				КоличествоИзмененных = КоличествоИзмененных + 1;
			КонецЕсли;
			КоличествоИзмененных = КоличествоИзмененных + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ТекстОперации = НСтр("ru = 'Изменение статуса транспортных контейнеров ЭД'");
			ДополнительныеПараметрыОшибки = Новый Структура;
			ДополнительныеПараметрыОшибки.Вставить("СсылкаНаОбъект", СтрокаТаблицы.Ссылка);
			ВидОшибкиНеизвестнаяОшибка = ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка();
			ИнформацияОшибки = ИнформацияОбОшибке();
			ПодробноеОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(
				ИнформацияОшибки);
			КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОшибки);
			Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ТекстОперации, ВидОшибкиНеизвестнаяОшибка, 
				ПодробноеОписаниеОшибки, КраткоеПредставлениеОшибки, ДополнительныеПараметрыОшибки);
			ПодсистемаБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
			ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка,
				ПодсистемаБЭД.ОбменСКонтрагентами);
				
		КонецПопытки;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Функция ДанныеВыделенныхСтрокРаздела(Знач Раздел, Знач ПутьКДанным, ПолучатьКлючСтроки = Ложь)
	
	МассивДанных = Новый Массив;
	ИспользоватьМассивРеквизитов = Ложь;
	
	Таблица = Элементы[Раздел];
	
	Реквизиты = СтрЗаменить(ПутьКДанным, " ", "");
	МассивРеквизитов = СтрРазделить(Реквизиты, ",", Ложь);
	
	Если МассивРеквизитов.Количество() > 1 Или ПолучатьКлючСтроки Тогда
		ИспользоватьМассивРеквизитов = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Таблица.ПолучитьСтрокиДляОбработки() Цикл
		
		Данные = Таблица.ДанныеСтроки(СтрокаТаблицы);
		Если Данные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИспользоватьМассивРеквизитов Тогда
			
			Результат = Новый Структура;
			
			Для Каждого Реквизит Из МассивРеквизитов Цикл
				Результат.Вставить(Реквизит, Данные[Реквизит]);
			КонецЦикла;
			Результат.Вставить("КлючСтроки", СтрокаТаблицы);
			МассивДанных.Добавить(Результат);
			
		Иначе
			МассивДанных.Добавить(Данные[ПутьКДанным]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции
 
&НаКлиенте
Функция ОбъектыДействий(СтрокиРаздела)
	
	Результат = ИнтерфейсДокументовЭДОКлиентСервер.НовыеОбъектыДействийПоЭДО();
	
	Для Каждого СтрокаРаздела Из СтрокиРаздела Цикл
		
		ИдентификаторПакета = СтрокаРаздела.ИдентификаторПакета;
		
		Если ЗначениеЗаполнено(ИдентификаторПакета) И ПакетноеОтображение
			И Результат.ПакетыДокументов.Найти(ИдентификаторПакета) = Неопределено Тогда
			
			Результат.ПакетыДокументов.Добавить(ИдентификаторПакета);
			
		Иначе
			Результат.ЭлектронныеДокументы.Добавить(СтрокаРаздела.ЭлектронныйДокумент);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЕстьДублирующийсяЭлемент(Элементы, ЭлементПоиска)
	
	Для Каждого Элемент Из Элементы Цикл
		Если Элемент <> ЭлементПоиска Тогда
			
			Если Элемент.Оформление.Элементы.Количество() <> ЭлементПоиска.Оформление.Элементы.Количество() Тогда
				Продолжить;
			КонецЕсли;
			
			НайденОтличающийсяЭлемент = Ложь;
			
			ЧислоЭлементов = Элемент.Оформление.Элементы.Количество();
			Для Индекс = 0 По ЧислоЭлементов - 1 Цикл
				Элемент1 = Элемент.Оформление.Элементы[Индекс];
				Элемент2 = ЭлементПоиска.Оформление.Элементы[Индекс];
				
				Если Элемент1.Использование И Элемент2.Использование Тогда
					Если Элемент1.Параметр <> Элемент2.Параметр ИЛИ Элемент1.Значение <> Элемент2.Значение Тогда
						НайденОтличающийсяЭлемент = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если НайденОтличающийсяЭлемент Тогда
				Продолжить;
			КонецЕсли;
			
			Если Элемент.Отбор.Элементы.Количество() <> ЭлементПоиска.Отбор.Элементы.Количество() Тогда
				Продолжить;
			КонецЕсли;
			
			ЧислоЭлементов = Элемент.Отбор.Элементы.Количество();
			Для Индекс = 0 По ЧислоЭлементов - 1 Цикл
				Элемент1 = Элемент.Отбор.Элементы[Индекс];
				Элемент2 = ЭлементПоиска.Отбор.Элементы[Индекс];
				
				ЭлементыРавны = СравнитьЭлементыОтбора(Элемент1, Элемент2);
				Если Не ЭлементыРавны Тогда
					НайденОтличающийсяЭлемент = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НайденОтличающийсяЭлемент Тогда
				Продолжить;
			КонецЕсли;
			
			Возврат Истина;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция СравнитьЭлементыОтбора(Элемент1, Элемент2)
	
	Если Элемент1.Использование = Элемент2.Использование
		И ТипЗнч(Элемент1) = ТипЗнч(Элемент2) Тогда
		
		Если ТипЗнч(Элемент1) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если Элемент1.ВидСравнения <> Элемент2.ВидСравнения
				ИЛИ Элемент1.ЛевоеЗначение <> Элемент2.ЛевоеЗначение
				ИЛИ Элемент1.ПравоеЗначение <> Элемент2.ПравоеЗначение Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе
			
			ЧислоЭлементов = Элемент1.Элементы.Количество();
			Если Элемент1.ТипГруппы <> Элемент2.ТипГруппы
				ИЛИ ЧислоЭлементов <> Элемент2.Элементы.Количество() Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Индекс = 0 По ЧислоЭлементов - 1 Цикл
				ПодчиненныйЭлемент1 = Элемент1.Элементы[Индекс];
				ПодчиненныйЭлемент2 = Элемент2.Элементы[Индекс];
				ЭлементыРавны = СравнитьЭлементыОтбора(ПодчиненныйЭлемент1, ПодчиненныйЭлемент2);
				
				Если Не ЭлементыРавны Тогда
					Возврат ЭлементыРавны;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьРасширенныйПодборДокументовУчета()

	ТекущиеДанные = Элементы[ТекущийРаздел].ТекущиеДанные;
		
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭлектронныйДокумент", ТекущиеДанные.ЭлектронныйДокумент);
	ПараметрыФормы.Вставить("ВидДокумента", ТекущиеДанные.ВидДокумента);
	
	ДокументРаспознан = РаспознатьДокумент(ТекущиеДанные.ЭлектронныйДокумент);
	ПараметрыФормы.Вставить("ДокументРаспознан", ДокументРаспознан);
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьПодборОбъектовУчетаЭлектронногоДокумента(ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьУчетныйДокумент(Знач ИмяТаблицы = "ВходящиеЭлектронныеДокументы")

	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НаборУчетныхДокументов = ОбъектыУчетаЭлектронногоДокумента(ТекущиеДанные.ЭлектронныйДокумент);

	Если Не ЗначениеЗаполнено(НаборУчетныхДокументов) Тогда
		ПоказатьРасширенныйПодборДокументовУчета();
		Возврат;
	КонецЕсли;

	Если НаборУчетныхДокументов.Количество() = 1 Тогда

		ПоказатьЗначение(, НаборУчетныхДокументов[0]);

	Иначе

		СписокУчетныхДокументов = Новый СписокЗначений;
		СписокУчетныхДокументов.ЗагрузитьЗначения(НаборУчетныхДокументов);
		Обработка = Новый ОписаниеОповещения("ОбработатьВыборУчетногоДокументаДляПоказа", ЭтотОбъект);
		СписокУчетныхДокументов.ПоказатьВыборЭлемента(Обработка);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборУчетногоДокументаДляПоказа(Знач ВыбранныйЭлемент,
		Знач ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(, ВыбранныйЭлемент.Значение);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбъектыУчетаЭлектронногоДокумента(Знач ЭлектронныйДокумент)

	Запрос = Новый Запрос;
	Запрос.Текст = ИнтеграцияЭДО.ТекстЗапросаОбъектовУчетаЭлектронныхДокументов();
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);

	УстановитьПривилегированныйРежим(Истина);
	Основания = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектУчета");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Основания;

КонецФункции  

&НаСервере
Функция СтатусыНеРаспакованныхТранспортныхСообщенийБЭД()
	
	СтатусыТранспортныхКонтейнеров = Новый Массив;
	СтатусыТранспортныхКонтейнеров.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыТранспортныхСообщенийБЭД.Неизвестный"));
	СтатусыТранспортныхКонтейнеров.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыТранспортныхСообщенийБЭД.КРаспаковке"));
	Возврат СтатусыТранспортныхКонтейнеров;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьОтправитьОбновить()
	
	Перем Оповещение;
	
	Элементы.ВходящиеЭлектронныеДокументыОбновить.Доступность = Ложь;
	Элементы.ИсходящиеЭлектронныеДокументыОбновить.Доступность = Ложь;
	Элементы.СформироватьОбновить.Доступность = Ложь;
	Элементы.ПриглашенияОбновить.Доступность = Ложь;
	Элементы.ОшибкиОбновить.Доступность = Ложь;

	Оповещение = Новый ОписаниеОповещения("ОтправкаПолучениеЭДЗавершение", ЭтотОбъект);
	ИнтерфейсДокументовЭДОКлиент.ОтправитьПолучитьДокументыЭДО(ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиНаПечать()
	
	ЭлектронныеДокументы = Элементы[ТекущийРаздел].ПолучитьСтрокиДляОбработки();
	
	Если Не ЗначениеЗаполнено(ЭлектронныеДокументы) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для печати необходимо выбрать электронный документ'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыВизуализации = ИнтерфейсДокументовЭДОВызовСервера.НовыеПараметрыВизуализацииДокумента();
	ПараметрыВизуализации.ВыводитьБанковскиеРеквизиты = Ложь;
	ПараметрыВизуализации.ВыводитьДопДанные = Ложь;
	ПараметрыВизуализации.ВыводитьКопияВерна = Ложь;
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьФормуПечатиЭлектронныхДокументов(ЭлектронныеДокументы, ПараметрыВизуализации);
	
КонецПроцедуры

&НаКлиенте
Функция СобытиеОбновитьСписки(Знач ИмяСобытия)
	
	Возврат ИмяСобытия = ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияСостоянияЭДО()
		Или ИмяСобытия = "ОбновитьСостояниеПриглашений"
		Или ИмяСобытия = ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияТекущихДелЭДО()
		Или ИмяСобытия = "ПрочтениеОбновитьСписок";
		
КонецФункции

&НаКлиенте
Процедура УстановитьБлокировкуЭлементов(СписокНаименованийЭлементов)
	Для Каждого НаименованиеЭлемента Из СписокНаименованийЭлементов Цикл
		Элементы[НаименованиеЭлемента].Доступность = Ложь;
		ЗаблокированныеЭлементыФормы.Добавить(НаименованиеЭлемента);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьБлокировкуЭлементов(СписокНаименованийЭлементов)
	Для Каждого НаименованиеЭлемента Из СписокНаименованийЭлементов Цикл
		Элементы[НаименованиеЭлемента].Доступность = Истина;
		ЗаблокированныйЭлемент = ЗаблокированныеЭлементыФормы.НайтиПоЗначению(НаименованиеЭлемента);
		Если ЗаблокированныйЭлемент <> Неопределено Тогда
			ЗаблокированныеЭлементыФормы.Удалить(ЗаблокированныйЭлемент);	
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ВыполнениеДействийПоЭДОДоступноДляПакетов(Знач ПакетыДокументов)

	Результат = Истина;
	
	Для Каждого ИдентификаторПакета Из ПакетыДокументов Цикл
		СостоянияДокументовПакета = ПакетыДокументовЭДО.СостоянияДокументовПакета(ИдентификаторПакета);
		СостояниеПакета = ПакетыДокументовЭДО.СостояниеПакета(СостоянияДокументовПакета);
		Если Не ЗначениеЗаполнено(СостояниеПакета) Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция АннулированиеДоступноДляПакетов(ПакетыДокументов)

	Результат = Новый Структура("Результат, ТекстОшибки", Истина, "");
	
	ТекстыОшибок = Новый Массив;
	
	Для Каждого ИдентификаторПакета Из ПакетыДокументов Цикл
		СостоянияДокументовПакета = ПакетыДокументовЭДО.СостоянияДокументовПакета(ИдентификаторПакета);
		СостояниеПакета = ПакетыДокументовЭДО.СостояниеПакета(СостоянияДокументовПакета);
		Если Не АннулированиеДоступно(Неопределено, СостояниеПакета) Тогда
			Результат.Результат = Ложь;
			ТекстыОшибок.Добавить(СтрШаблон(
				НСтр("ru = 'Аннулирование пакета ""%1"" недоступно при состоянии ЭДО ""%2""'") + Символы.ПС,
				Строка(ИдентификаторПакета), Строка(СостояниеПакета)));
		КонецЕсли;
	КонецЦикла;
	
	Результат.ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция АннулированиеДоступноДляДокументов(Документы)

	Результат = Новый Структура("Результат, ТекстОшибки", Истина, "");
	
	ТекстыОшибок = Новый Массив;
	
	СостоянияДокументов = ЭлектронныеДокументыЭДО.СостоянияДокументов(Документы);
	ВидыДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Документы, "ВидДокумента");
	ТипыДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		ОбщегоНазначения.ВыгрузитьКолонку(ВидыДокументов, "Значение"), "ТипДокумента");
	
	Для Каждого СостояниеПоДокументу Из СостоянияДокументов Цикл
		Документ = СостояниеПоДокументу.Ключ;
		СостояниеДокумента = СостояниеПоДокументу.Значение;
		ВидДокумента = ВидыДокументов[Документ];
		ТипДокумента = ТипыДокументов[ВидДокумента];
		Если Не АннулированиеДоступно(ТипДокумента, СостояниеДокумента) Тогда
			Результат.Результат = Ложь;
			ТекстыОшибок.Добавить(СтрШаблон(
				НСтр("ru = 'Аннулирование документа ""%1"" недоступно при состоянии ЭДО ""%2""'") + Символы.ПС,
				Строка(Документ), Строка(СостояниеДокумента)));
		КонецЕсли;
	КонецЦикла;
	
	Результат.ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция АннулированиеДоступно(ТипДокумента, СостоянияДокумента)
	
	Если ТипДокумента <> ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.МашиночитаемаяДоверенность")
		И СостоянияДокумента = ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяУтверждение")
		Или СостоянияДокумента = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяИзвещениеОПолучении")
		Или СостоянияДокумента = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения")
		Или СостоянияДокумента = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеИзвещения")
		Или СостоянияДокумента = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяОтправкаИзвещения")
		Или СостоянияДокумента = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеОператора")
		Или СостоянияДокумента = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяИзвещениеОПолучении")
		Или СостоянияДокумента = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОжидаетсяПодтверждение")
		Или СостоянияДокумента = 
		ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ОбменЗавершен")
		Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОставитьДляОбработкиТолькоТекущийДокумент(ОбъектыДействий)
	
	ОбъектыДействий.ПакетыДокументов.Очистить();
	ОбъектыДействий.ЭлектронныеДокументы.Добавить(ТекущийЭлектронныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Функция ВключенаГруппировкаСтрок(ТекущиеДанные)
	Возврат ТекущиеДанные.Свойство("ГруппировкаСтроки") 
		И ЗначениеЗаполнено(ТекущиеДанные.ГруппировкаСтроки);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьУведомленияПоЗадолженности(Форма, Задолженность)
	
	Форма.Элементы.ПоказатьСведенияОЗадолженности.Видимость = Задолженность.Количество() > 0;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СведенияОЗадолженности()
	
	Возврат ИнтерфейсДокументовЭДО.СведенияОЗадолженности();
	
КонецФункции

&НаСервере
Процедура ПоказатьУведомлениеПоТекущемуТрафику()
	
	Элементы.ГруппаОтправленоЗаМесяц.Видимость = ИспользуетсяПоказТрафикаЭлектронныхДокументов;
	
	Если Не ИспользуетсяПоказТрафикаЭлектронныхДокументов Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийТрафик = ИнтерфейсДокументовЭДО.ТекущийТрафик();
	Итог = ТекущийТрафик.Итог("РасчетныйТрафикОтправленныхЗаМесяц");
	
	Элементы.ДекорацияПоказатьСведенияПоТекущемуТрафику.Заголовок = СтрШаблон(НСтр("ru = 'Отправлено за месяц: %1'"), Итог);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоИспользованиюПоказаТрафикаЭлектронныхДокументов()
	
	ИспользуетсяПоказТрафикаЭлектронныхДокументов = ИнтерфейсДокументовЭДО.ИспользуетсяПоказТрафикаЭлектронныхДокументов();
	ПоказатьУведомлениеПоТекущемуТрафику();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПомощьНажатиеПоказатьВыборИзМеню(Элемент)
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ДекорацияПомощьНажатиеПослеВыбораИзМеню", ЭтотОбъект);
	
	СоставКомандПодменю = СоставКомандПодменюПомощь();
	
	СписокКоманд = Новый СписокЗначений;
	СписокКоманд.Добавить(СоставКомандПодменю.ОМодулеЭДО, НСтр("ru = 'О модуле ЭДО'"),, БиблиотекаКартинок.Информация);
	СписокКоманд.Добавить(СоставКомандПодменю.ПолезныеСсылки, НСтр("ru = 'Полезные ссылки'"));
	СписокКоманд.Добавить(СоставКомандПодменю.Техподдержка, НСтр("ru = 'Техподдержка'"));
	СписокКоманд.Добавить(СоставКомандПодменю.ДиагностикаЭДО, НСтр("ru = 'Диагностика ЭДО'"));
	СписокКоманд.Добавить(СоставКомандПодменю.ЕстьИдея, НСтр("ru = 'Есть идея?'"));
	
	ПоказатьВыборИзМеню(ОбработчикЗавершения, СписокКоманд, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПомощьНажатиеПослеВыбораИзМеню(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяКоманда = Результат.Значение;
	
	СоставКомандПодменю = СоставКомандПодменюПомощь();
	
	Если ВыбраннаяКоманда = СоставКомандПодменю.ОМодулеЭДО Тогда
		
		ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ОМодулеЭДО");
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.ПолезныеСсылки Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ОткрытьФормуПолезныхСсылок();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.Техподдержка Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ОткрытьОбращениеВСлужбуТехническойПоддержки();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.ДиагностикаЭДО Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ЗапуститьДиагностикуЭДО();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.ЕстьИдея Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ОткрытьСтраницуОпроса();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СоставКомандПодменюПомощь()

	СоставКоманд = Новый Структура;
	СоставКоманд.Вставить("ОМодулеЭДО", "ОМодулеЭДО");
	СоставКоманд.Вставить("ПолезныеСсылки", "ПолезныеСсылки");
	СоставКоманд.Вставить("Техподдержка", "Техподдержка");
	СоставКоманд.Вставить("ДиагностикаЭДО", "ДиагностикаЭДО");
	СоставКоманд.Вставить("ЕстьИдея", "ЕстьИдея");
	Возврат СоставКоманд;

КонецФункции

&НаКлиенте
Процедура ДекорацияНастройкиНажатиеПоказатьВыборИзМеню(Элемент)
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ДекорацияНастройкиНажатиеПослеВыбораИзМеню", ЭтотОбъект);
	
	СоставКомандПодменю = СоставКомандПодменюНастройки();
	
	СписокКоманд = Новый СписокЗначений;
	СписокКоманд.Добавить(СоставКомандПодменю.ПерсональныеНастройки, НСтр("ru = 'Персональные настройки'"),, БиблиотекаКартинок.БыстрыеНастройкиОтчета);
	СписокКоманд.Добавить(СоставКомандПодменю.НастройкиЭДО, НСтр("ru = 'Настройки ЭДО'"),, БиблиотекаКартинок.ПрочиеПользовательскиеНастройки);
	СписокКоманд.Добавить(СоставКомандПодменю.ОткрытьМашиночитаемыеДоверенности, НСтр("ru = 'Машиночитаемые доверенности'"),, БиблиотекаКартинок.МашиночитаемыеДоверенностиБЭД);
	Если ЕстьПравоАдминистрирования Тогда
		СписокКоманд.Добавить(СоставКомандПодменю.ПроверитьПодписи, НСтр("ru = 'Проверить подписи'"),, БиблиотекаКартинок.СинтаксическийКонтроль);
	КонецЕсли;
	Если ЕстьПравоОбработкиДокументов Тогда
		СписокКоманд.Добавить(СоставКомандПодменю.ЗагрузитьФайлы, НСтр("ru = 'Массовая отправка файлов'"),, БиблиотекаКартинок.МассоваяОтправкаБЭД);
	КонецЕсли;
	
	ПоказатьВыборИзМеню(ОбработчикЗавершения, СписокКоманд, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкиНажатиеПослеВыбораИзМеню(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяКоманда = Результат.Значение;
	
	СоставКомандПодменю = СоставКомандПодменюНастройки();
	
	Если ВыбраннаяКоманда = СоставКомандПодменю.ЗагрузитьФайлы Тогда
		
		ЗагрузитьФайлы(Неопределено);
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.ПроверитьПодписи Тогда
		
		ОбщегоНазначенияБЭДКлиент.ОткрытьФормуБЭД("Обработка.ИнтерфейсДокументовЭДО.Форма.ПроверкаПодписей");
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.ОткрытьМашиночитаемыеДоверенности Тогда
		
		МашиночитаемыеДоверенностиКлиент.ОткрытьОбщуюФормуСписковМЧД();
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.ПерсональныеНастройки Тогда
		
		ОткрытьФорму("Обработка.ПанельАдминистрированияБЭД.Форма.ПерсональныеНастройки");
		
	ИначеЕсли ВыбраннаяКоманда = СоставКомандПодменю.НастройкиЭДО Тогда
		
		НастройкиЭДОКлиент.ОткрытьФормуНастроекЭДО();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СоставКомандПодменюНастройки()

	СоставКоманд = Новый Структура;
	СоставКоманд.Вставить("ЗагрузитьФайлы", "ЗагрузитьФайлы");
	СоставКоманд.Вставить("ПроверитьПодписи", "ПроверитьПодписи");
	СоставКоманд.Вставить("ОткрытьМашиночитаемыеДоверенности", "ОткрытьМашиночитаемыеДоверенности");
	СоставКоманд.Вставить("ПерсональныеНастройки", "ПерсональныеНастройки");
	СоставКоманд.Вставить("НастройкиЭДО", "НастройкиЭДО");
	СоставКоманд.Вставить("ИзменитьФорму", "ИзменитьФорму");
	Возврат СоставКоманд;

КонецФункции

#КонецОбласти

#Область ОтражениеВУчете

&НаКлиенте
Процедура СоздатьДокументУчета()
	ЛегкийИнтерфейсДокументовЭДОКлиент.ПоказатьВыборСпособаОбработкиСозданияОбъектовУчетаИзСпискаТекущихДел(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьДокументУчета1()
	ЛегкийИнтерфейсДокументовЭДОКлиент.ПоказатьВыборСпособаОбработкиПодбораОбъектаУчетаИзСпискаТекущихДел(ЭтотОбъект, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьДокументУчета2()
	ЛегкийИнтерфейсДокументовЭДОКлиент.ПоказатьВыборСпособаОбработкиПодбораОбъектаУчетаИзСпискаТекущихДел(ЭтотОбъект, 2);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументУчета1()
	ОткрытьДокументУчетаПоНомеру(1);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументУчета2()
	ОткрытьДокументУчетаПоНомеру(2);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеДокументыУчета()
	ПоказатьРасширенныйПодборОбъектовУчета();
КонецПроцедуры

#КонецОбласти // ОтражениеВУчете

#Область МобильныйКлиент

&НаКлиенте
Процедура Подключаемый_МК_АктивироватьСтраницуВходящие(Команда)

	СведенияОбЭлементахФормы = ЭтотОбъект["МК_СведенияОбЭлементахФормы"];
	Если СведенияОбЭлементахФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МК_АктивироватьТекущуюСтраницу(
		СведенияОбЭлементахФормы.СведенияОРазделах.СтраницаВходящиеЭлектронныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МК_АктивироватьСтраницуИсходящие(Команда)
	
	СведенияОбЭлементахФормы = ЭтотОбъект["МК_СведенияОбЭлементахФормы"];
	Если СведенияОбЭлементахФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МК_АктивироватьТекущуюСтраницу(
		СведенияОбЭлементахФормы.СведенияОРазделах.СтраницаИсходящиеЭлектронныеДокументы);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МК_ПоказатьСкрытьФильтры(Команда)

	СведенияОбЭлементахФормы = ЭтотОбъект["МК_СведенияОбЭлементахФормы"];
	Если СведенияОбЭлементахФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы[СведенияОбЭлементахФормы.ИмяГруппыФильтры].Видимость =
		Не Элементы[СведенияОбЭлементахФормы.ИмяГруппыФильтры].Видимость;
	
	КнопкаПоказатьСкрытьФильтры =
		Элементы[СведенияОбЭлементахФормы.ИмяКомандыПоказатьСкрытьФильтры];

	СведенияОбЭлементахФормы = ЭтотОбъект["МК_СведенияОбЭлементахФормы"];
	
	МК_ОформитьКнопкуПоказатьСкрытьФильтры(КнопкаПоказатьСкрытьФильтры);
	
КонецПроцедуры

&НаКлиенте
Процедура МК_ОформитьКнопкуПоказатьСкрытьФильтры(КнопкаПоказатьСкрытьФильтры = Неопределено)
	
	СведенияОбЭлементахФормы = ЭтотОбъект["МК_СведенияОбЭлементахФормы"];
	Если СведенияОбЭлементахФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если КнопкаПоказатьСкрытьФильтры = Неопределено Тогда
		КнопкаПоказатьСкрытьФильтры =
			Элементы[СведенияОбЭлементахФормы.ИмяКомандыПоказатьСкрытьФильтры];
	КонецЕсли;
	
	ИнтерфейсМобильногоЭДОКлиентСервер.НастроитьКнопкуФильтры(ЭтотОбъект,
		КнопкаПоказатьСкрытьФильтры,
		СведенияОбЭлементахФормы.ИмяГруппыФильтры);
	
КонецПроцедуры

&НаКлиенте
Процедура МК_ОбновитьСпискиВходящихИИсходящихДокументов()
	
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ВходящиеЭлектронныеДокументы.Обновить();
	Элементы.ИсходящиеЭлектронныеДокументы.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура МК_АктивироватьТекущуюСтраницу(СведенияОСтранице)

	ИнтерфейсМобильногоЭДОКлиентСервер.АктивироватьСтраницуФормыТекущиеДелаПоЭДОЛегкийИнтерфейс(
		ЭтотОбъект, СведенияОСтранице);

	ОбновитьФильтры();
	ВидимостьЭлементовИКоманд();

КонецПроцедуры

&НаСервере
Процедура МК_ОбновитьЗаголовкиПереключателейСтраниц()

	СведенияОбЭлементахФормы = ЭтотОбъект["МК_СведенияОбЭлементахФормы"];
	Если СведенияОбЭлементахФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнтерфейсМобильногоЭДО.ОбновитьЗаголовкиПереключателейСтраницФормыТекущиеДелаЭДОЛегкийИнтерфейс(
		ЭтотОбъект, СведенияОбЭлементахФормы);

КонецПроцедуры

#КонецОбласти

#КонецОбласти