
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПараметры(Параметры);
	
	ДобавитьКомандыНапоминания();
	ОбновитьИнтерфейсФормы();
	
	АдаптацияТакси();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ОбновитьИнтерфейсКоманда(Команда)
	
	Если ЕстьОткрытыеОкна() Тогда
		
		ОтветПользователя = Ждать ВопросАсинх(
		НСтр("ru = 'Для обновления будут закрыты все открытые формы. Продолжить?'"),
		РежимДиалогаВопрос.ОКОтмена);
		
		Если ОтветПользователя <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьИнтерфейсНаСервере();
	ОбновитьИнтерфейс();
	ЗакрытьВсеОкна();
	
	ПоказатьОповещениеПользователя(, , НСтр("ru = 'Приложение успешно обновлено'"), БиблиотекаКартинок.ИнформацияБаннерЦветной);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НапомнитьЧерез(Команда)
	
	ОписаниеТипа = Новый ОписаниеТипов("Число");
	ИндексКоманды = ОписаниеТипа.ПривестиЗначение(Сред(Команда.Имя, СтрНайти(Команда.Имя, "_") + 1));
	
	ДанныеНапоминания = ДанныеНапоминаний()[ИндексКоманды];
	НапомнитьНаСервере(ДанныеПриложения.Синоним, ДанныеНапоминания.Время);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаСобытийФормы

&НаСервере
Процедура ОбработатьПараметры(Параметры)
	
	ОписаниеПриложения = Параметры.ОписаниеПриложения;
	ДополнительнаяИнформация = ТарификацияБизнесКлиентСервер.ДополнительныеДанныеПриложения(ОписаниеПриложения.Имя);
	
	ДанныеПриложения = Новый Структура("Синоним,Описание,НазваниеКартинки,СсылкаНаСайт");
	ЗаполнитьЗначенияСвойств(ДанныеПриложения, ОписаниеПриложения, "Синоним");
	ЗаполнитьЗначенияСвойств(ДанныеПриложения, ДополнительнаяИнформация, "Описание,НазваниеКартинки,СсылкаНаСайт");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандыНапоминания()
	
	ДанныеНапоминаний = ДанныеНапоминаний();
	Для Индекс = 0 По ДанныеНапоминаний.ВГраница() Цикл
		
		ДанныеНапоминания = ДанныеНапоминаний[Индекс];
		НазваниеКоманды = СтрШаблон("НапомнитьЧерез_%1", Индекс);
		
		КомандаНапомнить = Команды.Добавить(НазваниеКоманды);
		КомандаНапомнить.Действие = "Подключаемый_НапомнитьЧерез";
		КомандаНапомнить.Заголовок = ДанныеНапоминания.Представление;
		КомандаНапомнить.НазначениеДействия = НазначениеДействияКомандыФормы.Завершение;
		
		КнопкаНапомнить = Элементы.Добавить(НазваниеКоманды, Тип("КнопкаФормы"), Элементы.НапомнитьЧерез);
		КнопкаНапомнить.ИмяКоманды = НазваниеКоманды;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеНапоминаний()
	
	ДанныеНапоминаний = Новый Массив;
	ДанныеНапоминаний.Добавить(Новый Структура("Время,Представление", 60 * 5, НСтр("ru = '5 минут'")));
	ДанныеНапоминаний.Добавить(Новый Структура("Время,Представление", 60 * 15, НСтр("ru = '15 минут'")));
	ДанныеНапоминаний.Добавить(Новый Структура("Время,Представление", 60 * 30, НСтр("ru = '30 минут'")));
	ДанныеНапоминаний.Добавить(Новый Структура("Время,Представление", 60 * 60, НСтр("ru = '1 час'")));
	ДанныеНапоминаний.Добавить(Новый Структура("Время,Представление", 60 * 60 * 2, НСтр("ru = '2 часа'")));
	ДанныеНапоминаний.Добавить(Новый Структура("Время,Представление", 60 * 60 * 4, НСтр("ru = '4 часа'")));
	
	Возврат ДанныеНапоминаний;
	
КонецФункции

#КонецОбласти

#Область Интерфейс

&НаСервере
Процедура ОбновитьИнтерфейсФормы()
	
	Элементы.КартинкаПриложения.Картинка = БиблиотекаКартинок[ДанныеПриложения.НазваниеКартинки];
	Элементы.НазваниеПриложения.Заголовок = ДанныеПриложения.Синоним;
	
	Если ЗначениеЗаполнено(ДанныеПриложения.СсылкаНаСайт) Тогда
		Описание = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = '%1. <a href=""%2"">Подробнее</a>'"), ДанныеПриложения.Описание, ДанныеПриложения.СсылкаНаСайт);
	Иначе
		Описание = ДанныеПриложения.Описание;
	КонецЕсли;
	
	Элементы.ОписаниеПриложения.Заголовок = Описание;
	
КонецПроцедуры

#КонецОбласти

#Область ЗавершениеРаботыНаФорме

&НаКлиенте
Функция ЕстьОткрытыеОкна()
	
	Окна = ПолучитьОкна();
	Для Каждого ОкноПриложения Из Окна Цикл
		Форма = ОкноПриложения.ПолучитьСодержимое();
		Если Форма <> Неопределено И Форма <> ЭтотОбъект Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьВсеОкна()
	
	Окна = ПолучитьОкна();
	Для Каждого ОкноПриложения Из Окна Цикл
		Форма = ОкноПриложения.ПолучитьСодержимое();
		Если Форма <> Неопределено Тогда
			Форма.Модифицированность = Ложь;
			Форма.Закрыть();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьИнтерфейсНаСервере()
	
	РабочийСтолУНФ.УстановитьНачальнуюСтраницуИИнтерфейс(, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НапомнитьНаСервере(Знач СинонимПриложения, Знач ЧерезСколькоНапомнить)
	
	ВремяНапоминания = ТекущаяДатаСеанса() + ЧерезСколькоНапомнить;
	ТекстНапоминания = СтрШаблон(
	НСтр("ru = 'Подключено новое приложение ""%1"". Перезапустите программу для обновления.'"),
	СинонимПриложения);
	
	НапоминанияПользователя.УстановитьНапоминание(ТекстНапоминания, ВремяНапоминания);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура АдаптацияТакси()
	
	Это85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ЭтоТакси = Не Это85;
	
	Если ЭтоТакси Тогда
		
		Элементы.ПодсказкаПоДействиям.Ширина = 0;
		Элементы.КартинкаПриложения.Ширина = 0;
		Элементы.КартинкаПриложения.Высота = 0;
		
	КонецЕсли;
	
	ИспользоватьПолувыставлятор = ПолучитьФункциональнуюОпцию("ИспользоватьПолувыставлятор");
	Если ИспользоватьПолувыставлятор = Истина Тогда
		Элементы.ДекорацияПолувыставлятор.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти