
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;

	АдаптацияТакси();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Текст = НСтр("ru = 'Предусмотрена возможность подобрать должность из классификатора.
                  |Подобрать?'");
	Оповещение = Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	Отказ = Истина;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПодобратьИзКлассификатора(Команда)
	
	ПодобратьИзКлассификатора();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ЭтоВариантИнтерфейса85 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.ФормаКомандаПодобратьИзКлассификатора, КоманднаяПанель);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПодобратьИзКлассификатора();
	Иначе 
		ОткрытьФорму("Справочник.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспеченияУНФ.ФормаОбъекта");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИзКлассификатора()
	
	СоответствиеПолей = Новый Соответствие;
	СоответствиеПолей.Вставить("Name", "НаименованиеПрофессии");
	
	ОткрытьФормуПодбораИзКлассификатора(
		"СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспеченияУНФ",
		"Справочник.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспеченияУНФ.КлассификаторПрофессийДолжностейЛьготногоПенсионногоОбеспечения",
		НСтр("ru='Списки производств, работ, профессий, должностей и показателей, дающих право на льготное пенсионное обеспечение'"),
		ЭтотОбъект,
		СоответствиеПолей);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораИзКлассификатора(ИмяСправочника, ПолныйПутьКМакету, Заголовок, Форма,
	СоответствиеПолей = Неопределено, ОповещениеЗавершения = Неопределено, ЗаполнятьДополнительныеСведения = Ложь)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяСправочника", ИмяСправочника);
	СтруктураПараметров.Вставить("ПолныйПутьКМакету", ПолныйПутьКМакету);
	СтруктураПараметров.Вставить("Заголовок", Заголовок);
	СтруктураПараметров.Вставить("ЗаполнятьДополнительныеСведения", ЗаполнятьДополнительныеСведения);
		
	Если СоответствиеПолей <> Неопределено Тогда
		СтруктураПараметров.Вставить("СоответствиеПолей", СоответствиеПолей);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Форма, ОповещениеЗавершения", Форма, ОповещениеЗавершения);
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуПодбораИзКлассификатораЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	ОткрытьФорму("Справочник.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспеченияУНФ.Форма.ЗаполнениеСправочниковИзКлассификаторов",
		СтруктураПараметров, Форма, , , , Оповещение, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораИзКлассификатораЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	ДополнительныеПараметры.Форма.Элементы.Список.Обновить();
	
	Если ДополнительныеПараметры.ОповещениеЗавершения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗавершения, Результат);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
