
#Область СлужебныйПрограммныйИнтерфейс

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
// Добавлена новая переопределяемая процедура ЭтоДокументРеализации, используется в форме проверки
// и подбора для управления режимом добавления кодов маркировки в группы объемно-сортового учета,
// который можно изменять в документах реализации: Все отсканированные коды добавляются в группу ОСУ,
// добавляются в зависимости от владельца или все коды добавляются для поштучно.
// 
// Параметры:
//  Контекст      - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоРеализация - Булево - исходящий признак соответствия документа типу «Реализация товаров и услуг».
Процедура ЭтоДокументРеализации(Контекст, ЭтоРеализация) Экспорт
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.РасходнаяНакладная") Тогда
		ЭтоРеализация = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоЧек   - Булево - исходящий признак соответствия документа типу «Чек ККМ».
Процедура ЭтоЧекККМ(Контекст, ЭтоЧек) Экспорт
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ЧекККМ") Тогда
		ЭтоЧек = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст      - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоЧекВозврат - Булево - исходящий признак соответствия документа типу «Чек ККМ возврат».
Процедура ЭтоЧекККМВозврат(Контекст, ЭтоЧекВозврат) Экспорт
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ЧекККМВозврат") Тогда
		ЭтоЧекВозврат = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти