#Область СлужебныйПрограммныйИнтерфейс

// См. МашиночитаемыеДоверенности.ПолучитьСведенияДоверенностиНаСервереМЧД
Функция ПолучитьСведенияДоверенностиНаСервереМЧД(НомерДоверенности, ИННДоверителя, ИННПредставителя) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьСведенияДоверенностиНаСервереМЧД(
		НомерДоверенности, ИННДоверителя, ИННПредставителя);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД
Функция ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД(НомерДоверенности, РезультатАвторизации = Неопределено, 
	ПоказыватьСлужебныеСообщения = Истина) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД(
		НомерДоверенности, РезультатАвторизации, ПоказыватьСлужебныеСообщения);
	
КонецФункции

// См. МашиночитаемыеДоверенности.АвторизоватьсяНаСервереМЧД
Функция АвторизоватьсяНаСервереМЧД(ПоказыватьСлужебныеСообщения = Истина) Экспорт
	
	Возврат МашиночитаемыеДоверенности.АвторизоватьсяНаСервереМЧД(ПоказыватьСлужебныеСообщения);
	
КонецФункции

// Используется режим тестирования.
// 
// Возвращаемое значение:
//  Булево
//  
Функция ИспользуетсяРежимТестирования() Экспорт
	
	Возврат Константы.РежимТестированияМЧД.Получить();
	
КонецФункции

// Возвращаемое значение:
//  Булево
//  
Функция ОтключенПодборМЧДПоКПППриПодписанииИПроверке() Экспорт
	ОтключенПодборМЧДПоКПППриПодписанииИПроверке = Константы.ОтключитьПодборМЧДПоКПППриПодписанииИПроверке.Получить();
	
	Возврат ОтключенПодборМЧДПоКПППриПодписанииИПроверке;
	
КонецФункции

#КонецОбласти
