#Область ОписаниеПеременных
&НаКлиенте
Перем НомерСтраницыНастройкиРМК;
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если МобильныйКлиентУНФ.ФункциональностьВременноНедоступна(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Элементы.ПанельНавигацииТакси.Видимость = ИнтерфейсТакси;
    Элементы.ПанельНавигации.Видимость = Не ИнтерфейсТакси;
	
	ИнициализироватьРеквизитыФормы();
	
	ИнициализироватьСвойстваФормы();
	
	ВывестиБаннеры();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьФорму();
	
	УстановитьПорядковыйНомерПерехода(1);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьОтборДинамическихСписков", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы
		И ЗначениеЗаполнено(АдресРезультата) Тогда
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными")
			И ИспользоватьСинхронизациюДанных Тогда                
			ОткрытьФорму("ОбщаяФорма.НастройкиСинхронизацииДанных");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КаталогОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КаталогОбменаНачалоВыбораЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ВыбратьКаталог(ОписаниеОповещения, НСтр("ru = 'Выберите каталог'"));
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогОбменаНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = "" Тогда
		Возврат;
	КонецЕсли;
	
	КаталогОбмена = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура КаналыСвязиВидКаналаПриИзменении(Элемент)
	
	НастроитьФорму();

КонецПроцедуры

&НаКлиенте
Процедура КаталогНастроекПодключенияДляВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КаталогНастроекПодключенияДляВыгрузкиЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ВыбратьКаталог(ОписаниеОповещения, НСтр("ru = 'Выберите каталог'"));

КонецПроцедуры

&НаКлиенте
Процедура КаталогНастроекПодключенияДляВыгрузкиЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = "" Тогда
		Возврат;
	КонецЕсли;
	
	КаталогНастроекПодключенияДляВыгрузки = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ТорговыйОбъектПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ТорговыйОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборДинамическихСписков("ТорговыйОбъект");
	ЗаполнитьНастройкиПоОбщимПараметрам("ТорговыйОбъект");

КонецПроцедуры

&НаКлиенте
Процедура УРМКПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ИспользоватьРасширенныйРежимНастройкиУРМК Тогда
		
		Отказ 				= Истина;
		СтруктураПараметров = Новый Структура;
		
		Если Копирование Тогда
			СтруктураПараметров.Вставить("ОбъектКопирования", Элемент.ТекущаяСтрока);
		КонецЕсли;
		
		ЗначенияЗаполнения = ПараметрыЗаполненияУРМКНаСервере(СтруктураПараметров);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму(ИмяМенеджераКассаККМНаСервере() + ".ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИмяМенеджераКассаККМНаСервере()
	
	Возврат ИнтеграцияУРМКСлужебный.МетаданныеПоОпределяемомуТипу("КассаККМУРМК").ПолноеИмя();
	
КонецФункции

&НаСервере
Функция ПараметрыЗаполненияУРМКНаСервере(СтруктураПараметров)
	
	Возврат ИнтеграцияУРМКПереопределяемый.ПараметрыЗаполненияПередНачаломДобавленияУРМК(ЭтотОбъект, СтруктураПараметров);
	
КонецФункции

&НаКлиенте
Процедура ВыгружатьЗаказыПриИзменении(Элемент)
	
	Если ВыгружатьЗаказы Тогда
		ВыгружатьТолькоТоварыПалитры = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьШаблоныЧековПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаШаблоныЧекаККТ",
		"Доступность",
		ВыгружатьШаблоныЧеков);
		
	Если НЕ ВыгружатьШаблоныЧеков Тогда
		
		ШаблонЧекаПродажи  = Неопределено;
		ШаблонЧекаВозврата = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДалее(Команда)
	
	ИзменитьПорядковыйНомерПерехода(+1);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	
	ИзменитьПорядковыйНомерПерехода(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	Оповестить("ЗакрытаФормаПомощникаСозданияОбменаДанными");
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПереходов

////////////////////////////////////////////////////////////////////////////////
// Переопределяемая часть - Обработчики событий переходов.

&НаКлиенте
Функция Подключаемый_СтраницаСпособНастройкиПодключения_ПриОткрытии(Отказ, ПропуститьСтраницу, ЭтоПереходДалее)
	
	Если МодельСервиса Тогда
		ВидПодключения = "ПассивныйРежим";
		ПропуститьСтраницу = Истина;
		Возврат Неопределено;
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаСпособНастройкиПодключения_ПриПереходеДалее(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВидПодключения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Выберите вариант настройки подключения УРМК'"), ,
			"ВидПодключения", ,
			Отказ);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаПараметрыПодключенияОбычныеКаналыСвязи_ПриОткрытии(Отказ, ПропуститьСтраницу, ЭтоПереходДалее)
	
	Если ВидПодключения = "ПассивныйРежим" Тогда
		ПропуститьСтраницу = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаПараметрыПодключенияОбычныеКаналыСвязи_ПриПереходеДалее(Отказ)
	
	Если ВидПодключения = "ПассивныйРежим" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если АрхивироватьФайлы Тогда
		ИспользоватьПарольАрхива = Не ПустаяСтрока(ПарольАрхива);
	КонецЕсли;
	
	Если КаналыСвязиВидКанала = "ЛокальныйСетевойКаталог" Тогда
		
		Если НЕ ЗначениеЗаполнено(КаталогОбмена) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не заполнен ""Каталог обмена""'"),,
				"КаталогОбмена",, Отказ);
		Иначе
			КаталогОбменаИспользуется(Отказ);
			
			Если Отказ Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Каталог обмена уже используется'"),,
				"КаталогОбмена",, Отказ);
			КонецЕсли;	
				
		КонецЕсли;
	
	КонецЕсли;
	
	Если КаналыСвязиВидКанала = "КаталогFTP" Тогда
		
		Если ПустаяСтрока(FTPКаталог) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Укажите адрес каталога для передачи файлов с данными.'"),,
				"FTPКаталог",, Отказ);
		КонецЕсли;
		
		Если ПустаяСтрока(КаталогНастроекПодключенияДляВыгрузки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не заполнен ""Каталог сохранения настроек обмена""'"),
				, "КаталогНастроекПодключенияДляВыгрузки",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаОжидание_ДлительнаяОперация(Отказ, ПерейтиДалее)
	
	ПерейтиДалее = Ложь;
	
	ПодготовитьНастройкиОбмена();
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаСписокНастроекОтправки_ПриОткрытии(Отказ, ПропуститьСтраницу, ЭтоПереходДалее)
	
	УстановитьОтборДинамическихСписков("ТорговыйОбъект");
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаСписокНастроекОтправки_ПриПереходеДалее(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ТорговыйОбъект) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не заполнен ""Торговый объект""'"), ,
			"ТорговыйОбъект", ,
			Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидЦен) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не заполнен ""Вид цен""'"), ,
			"ВидЦен", ,
			Отказ);
	КонецЕсли;
	
	Результат = ПроверитьИспользованиеНДССверху();
	Если ЗначениеЗаполнено(Результат) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			Результат, ,
			"ВидЦен", ,
			Отказ);
	КонецЕсли;
	
	Если СписокУРМКПуст() Тогда
		Если ИспользоватьРасширенныйРежимНастройкиУРМК Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Отсутствуют рабочие места для создания настроек синхронизации'"), ,
				"УРМКСписок", ,
				Отказ);
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Отсутствуют кассы ККМ для создания настроек синхронизации'"), ,
				"УРМКСписок", ,
				Отказ);
		КонецЕсли;
	КонецЕсли;
	
	НомерСтраницыНастройкиРМК = 1;
	
	ЗаполнитьТаблицуНастроекОбмена();
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаПалитраТоваров_ПриОткрытии(Отказ, ПропуститьСтраницу, ЭтоПереходДалее)
	
	УстановитьДоступностьВыгрузкиТоваровПалитры();
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаПалитраТоваров_ПриПереходеДалее(Отказ)

	КоличествоСтрок = ПалитрыТоваровДляВыгрузки.Количество();
	ЕстьПустаяСтрока = Ложь;
	ИндексТекущейСтроки = 0;
	Пока ИндексТекущейСтроки < КоличествоСтрок И Не ЕстьПустаяСтрока Цикл
		СтрокаПалитры = ПалитрыТоваровДляВыгрузки.Получить(ИндексТекущейСтроки);
		Если Не ЗначениеЗаполнено(СтрокаПалитры.ПалитраТоваровРМК) Тогда
			ЕстьПустаяСтрока = Истина;
		КонецЕсли;
		
		ИндексТекущейСтроки = ИндексТекущейСтроки + 1;
	КонецЦикла;
	Если ЕстьПустаяСтрока Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не заполнена палитра товаров в строке.'"), , , , Отказ);
		ТекущийЭлемент = Элементы.ПалитрыТоваровДляВыгрузки;
		Элементы.ПалитрыТоваровДляВыгрузки.ТекущаяСтрока = СтрокаПалитры.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаПалитраТоваров_ПриПереходеНазад(Отказ)
	
	НомерСтраницыНастройкиРМК = 1;

КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаНастройкиКассовогоМеста_ПриОткрытии(Отказ, ПропуститьСтраницу, ЭтоПереходДалее)
	
	ПропуститьСтраницу = СписокРабочихМестКОбмену.Количество() = 0;

	ЗаполнитьДанныеПоТаблицеНастройкеПользователей();
	УстановитьДоступностьКоманды();
	СформироватьЗаголовокКомандыПодбора();
	УстановитьВидимостьЭлементовНастроекПользователей();

	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаНастройкиКассовогоМеста_ПриПереходеДалее(Отказ)
	
	СтрокиНастроек = СписокРабочихМестКОбмену.НайтиСтроки(Новый Структура("ПорядковыйНомер", НомерСтраницыНастройкиРМК));
	Если СтрокиНастроек.Количество() > 0 Тогда
		СтрокаНастройки = СтрокиНастроек[0];
		АдресНастроекПользователей = "";
		АдресФизическихЛиц = "";
		ЗапомнитьНастройкиУРМК(АдресНастроекПользователей, АдресФизическихЛиц);
		СтрокаНастройки.АдресХранилищаТаблицаПользователей = АдресНастроекПользователей;
		СтрокаНастройки.АдресХранилищаФизЛиц = АдресФизическихЛиц;
		СтрокаНастройки.ВыгружатьФизическихЛиц = ВыгружатьФизическихЛиц;
		СтрокаНастройки.ВыгружатьФизическихЛицЧастично = ВыгружатьФизическихЛицЧастично;
	КонецЕсли;
	

	КоличествоСтрок = СписокРабочихМестКОбмену.Количество();
	Если НомерСтраницыНастройкиРМК < КоличествоСтрок Тогда
		НомерСтраницыНастройкиРМК = НомерСтраницыНастройкиРМК + 1;
		Отказ = Истина;
	КонецЕсли;
	
	ЗаполнитьДанныеПоТаблицеНастройкеПользователей();
	УстановитьДоступностьКоманды();
	СформироватьЗаголовокКомандыПодбора();
	УстановитьВидимостьЭлементовНастроекПользователей();

КонецФункции

#КонецОбласти

#Область ПодготовкаДанных

&НаКлиенте
Процедура ПодготовитьНастройкиОбмена()
	
	Элементы.ДекорацияОжиданиеНадпись.Заголовок = НСтр("ru = 'Подготовка данных.
		|Пожалуйста, подождите...'");
	
	ДлительнаяОперация = НачатьПодготовкуНастроекОбменаНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодготовитьНастройкиОбменаЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция СтруктураДанныеНастроекОбмена()
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("ТорговыйОбъект", ТорговыйОбъект);
	СтруктураНастроек.Вставить("ВидЦен", ВидЦен);
	СтруктураНастроек.Вставить("ХранитьКартыЛояльностиВРМК", ХранитьКартыЛояльностиВРМК);
	СтруктураНастроек.Вставить("ВыгружатьОстаткиНоменклатуры", ВыгружатьОстаткиНоменклатуры);
	СтруктураНастроек.Вставить("ВыгружатьПоставщиков", ВыгружатьПоставщиков);
	СтруктураНастроек.Вставить("ВыгружатьЗаказы", ВыгружатьЗаказы);
	СтруктураНастроек.Вставить("ВыгружатьФизическихЛиц", ВыгружатьФизическихЛиц);
	СтруктураНастроек.Вставить("ВыгружатьФизическихЛицЧастично", ВыгружатьФизическихЛицЧастично);
	СтруктураНастроек.Вставить("ВыгружатьСерии", ВыгружатьСерии);
	СтруктураНастроек.Вставить("ВыгружатьПартииКомиссионныхТоваров", ВыгружатьПартииКомиссионныхТоваров);
	СтруктураНастроек.Вставить("ВыгружатьТолькоТоварыПалитры", ВыгружатьТолькоТоварыПалитры);
	СтруктураНастроек.Вставить("ВыгружатьШаблоныЧеков", ВыгружатьШаблоныЧеков);
	СтруктураНастроек.Вставить("ШаблонЧекаПродажи", ШаблонЧекаПродажи);
	СтруктураНастроек.Вставить("ШаблонЧекаВозврата", ШаблонЧекаВозврата);

	СтруктураНастроек.Вставить("ИмяПланаОбмена", ИмяПланаОбмена);
	СтруктураНастроек.Вставить("ИмяПланаОбменаКорреспондента", ИмяПланаОбмена);
	СтруктураНастроек.Вставить("ВариантНастройкиОбмена", ИдентификаторВариантаНастройкиОбмена);
	СтруктураНастроек.Вставить("ФорматОбмена", "http://v8.1c.ru/edi/edi_stnd/EnterpriseData");
	СтруктураНастроек.Вставить("ВариантРаботыМастера", "НастроитьНовыйОбменДанными");
	СтруктураНастроек.Вставить("СсылкаНового", Неопределено);
	
	Если МодельСервиса Тогда
		СформироватьНаименованиеПредопределенногоУзла();
	Иначе
		// Представление этой информационной базы.
		НаименованиеЭтойБазы = ИнтеграцияУРМКСлужебный.НаименованиеПредопределенногоУзлаПланаОбмена(ИмяПланаОбмена);
		Если ПустаяСтрока(НаименованиеЭтойБазы) Тогда
			НаименованиеЭтойБазы = ИмяЭтойИнформационнойБазы();
		КонецЕсли;
	КонецЕсли;
	
	Префикс = ПолучитьФункциональнуюОпцию("ПрефиксИнформационнойБазы");
	Если ПустаяСтрока(Префикс) Тогда
		ОбменДаннымиПереопределяемый.ПриОпределенииПрефиксаИнформационнойБазыПоУмолчанию(Префикс);
	КонецЕсли;

	СтруктураНастроек.Вставить("КодУзла", Префикс);
	СтруктураНастроек.Вставить("КодПредопределенногоУзла", Префикс);
	СтруктураНастроек.Вставить("НаименованиеЭтойБазы",   НаименованиеЭтойБазы);
	СтруктураНастроек.Вставить("ПрефиксИнформационнойБазыИсточника", Префикс);
	СтруктураНастроек.Вставить("УзелИнформационнойБазы", УзелОбмена);
	СтруктураНастроек.Вставить("ИспользоватьПрефиксыДляНастройкиОбмена", Истина);
	СтруктураНастроек.Вставить("ИспользоватьПрефиксыДляНастройкиОбменаКорреспондента", Истина);
	СтруктураНастроек.Вставить("ИдентификаторИнформационнойБазыИсточника", Префикс);
	СтруктураНастроек.Вставить("ВерсияФорматаФайлаНастроекОбменаДанными",
		ИнтеграцияУРМКСлужебный.МодульПомощникСозданияОбменаДанными().ВерсияФорматаНастроекОбменаДанными());
	СтруктураНастроек.Вставить("ВерсияФорматаОбмена", "1.20");
	СтруктураНастроек.Вставить("ПоддерживаемыеОбъектыФормата", Неопределено);
	
	СтруктураНастроек.Вставить("ИспользоватьПараметрыТранспортаCOM",   Ложь);
	СтруктураНастроек.Вставить("ИспользоватьПараметрыТранспортаEMAIL", Ложь);
	СтруктураНастроек.Вставить("ИспользоватьПараметрыТранспортаFILE",  Ложь);
	СтруктураНастроек.Вставить("ИспользоватьПараметрыТранспортаFTP",   Ложь);
	
	СтруктураНастроек.Вставить("КаталогОбменаИнформацией",	КаталогОбмена);
	СтруктураНастроек.Вставить("МаксимальныйДопустимыйРазмерСообщения", ОграничениеРазмераФайлаFTP);
	СтруктураНастроек.Вставить("Пароль", FTPПароль);
	СтруктураНастроек.Вставить("ПассивноеСоединение", FTPПассивныйРежим);
	СтруктураНастроек.Вставить("Пользователь", FTPПользователь);
	СтруктураНастроек.Вставить("Порт", FTPПорт);
	СтруктураНастроек.Вставить("Путь", FTPКаталог);
		
	Если ВидПодключения = "ПассивныйРежим" Тогда
		СтруктураНастроек.Вставить("ВидТранспортаСообщенийОбмена", Перечисления.ВидыТранспортаСообщенийОбмена.WSПассивныйРежим);
		
		ИдентификаторТранспорта = "ПассивныйРежим";
		
	ИначеЕсли ВидПодключения = "ОбычныеКаналыСвязи" Тогда
		Если КаналыСвязиВидКанала = "ЛокальныйСетевойКаталог" Тогда
			СтруктураНастроек.Вставить("ИспользоватьПараметрыТранспортаFILE",  Истина);
			СтруктураНастроек.Вставить("ВидТранспортаСообщенийОбмена", Перечисления.ВидыТранспортаСообщенийОбмена.FILE);

			ИдентификаторТранспорта = "FILE";

		ИначеЕсли КаналыСвязиВидКанала = "КаталогFTP" Тогда
			СтруктураНастроек.Вставить("ИспользоватьПараметрыТранспортаFTP",   Истина);
			СтруктураНастроек.Вставить("ВидТранспортаСообщенийОбмена", Перечисления.ВидыТранспортаСообщенийОбмена.FTP);
			СтруктураНастроек.Вставить("КаталогНастроекПодключенияДляВыгрузки", КаталогНастроекПодключенияДляВыгрузки);
			
			ИдентификаторТранспорта = "FTP";

		КонецЕсли;
	КонецЕсли;
	
	СтруктураНастроек.Вставить("ПарольАрхиваСообщенияОбмена", ПарольАрхива);
	СтруктураНастроек.Вставить("СжиматьФайлИсходящегоСообщения", АрхивироватьФайлы);
	СтруктураНастроек.Вставить("Транслитерация", ТранслитерироватьИменаФайлов);
	
	СтруктураНастроек.Вставить("ИсправитьДублированиеНастроекСинхронизации",	Ложь);
	СтруктураНастроек.Вставить("УзелКорреспондентаЕстьВЭтойБазе",				Ложь);
	СтруктураНастроек.Вставить("ЭтотУзелЕстьВКорреспонденте",					Ложь);
	СтруктураНастроек.Вставить("ВосстановлениеНастроекОбмена", 					  "");
	
	Менеджер = ТранспортСообщенийОбмена.МенеджерТранспортаПоИдентификатору(ИдентификаторТранспорта);
	РеквизитыТранспорта = Менеджер.Создать().Метаданные().Реквизиты;
	
	НастройкиТранспорта = Новый Структура;
	
	Для Каждого РеквизитТранспорта Из РеквизитыТранспорта Цикл
		НастройкиТранспорта.Вставить(РеквизитТранспорта.Имя, РеквизитТранспорта.Тип.ПривестиЗначение());
	КонецЦикла;
		
	ЗаполнитьЗначенияСвойств(НастройкиТранспорта, СтруктураНастроек);

	СтруктураНастроек.Вставить("ИдентификаторТранспорта", ИдентификаторТранспорта);
	СтруктураНастроек.Вставить("НастройкиТранспорта", НастройкиТранспорта);

	Возврат СтруктураНастроек;
	
КонецФункции

&НаСервере
Функция НачатьПодготовкуНастроекОбменаНаСервере()
	
	ПараметрыПроцедуры = СтруктураДанныеНастроекОбмена();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.ПомощникНастройкиОбменаУРМК.ПодготовитьДанныеНастроекОбмена", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции

&НаКлиенте
Процедура ПодготовитьНастройкиОбменаЗавершение(РезультатФоновогоЗадания, ДополнительныеПараметры) Экспорт
	
	Если РезультатФоновогоЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
		АдресРезультата = РезультатФоновогоЗадания.АдресРезультата;
		
		Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
		
		Если Результат.НастройкиПодготовлены Тогда
			
			ФоновоеЗадание = СохранениеНастроекПодключенияНачало();
	
			НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
				
			Обработчик = Новый ОписаниеОповещения("СохранениеНастроекПодключенияЗавершение", ЭтотОбъект);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, Обработчик, НастройкиОжидания);
			
		Иначе
			
			Если Результат.Свойство("НумерацияЗакончилась") Тогда
				ИзменитьПорядковыйНомерПерехода(-1);
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					НСтр("ru = 'Закончился диапазон префиксов узлов УРМК'"));
			ИначеЕсли Результат.Свойство("ОшибкаСозданияКаталога") Тогда
				ИзменитьПорядковыйНомерПерехода(-1);
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					НСтр("ru = 'Ошибка создания подкаталога по префиксу в каталоге обмена.'"));
					
			Иначе
				ИзменитьПорядковыйНомерПерехода(+1);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		ИзменитьПорядковыйНомерПерехода(-1);
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатФоновогоЗадания.ПодробноеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаименованиеПредопределенногоУзла()
	
	ИмяПриложенияПоУмолчанию = НСтр("ru = 'Приложение в Интернете'");
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса") Тогда
		Возврат ИмяПриложенияПоУмолчанию;
	КонецЕсли;
		
	МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
	
	ИмяПриложения = МодульРаботаВМоделиСервиса.ПолучитьИмяПриложения();
	
	Возврат ?(ПустаяСтрока(ИмяПриложения), ИмяПриложенияПоУмолчанию, ИмяПриложения);
КонецФункции

&НаСервере
Функция ИмяЭтойИнформационнойБазы()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Константы.ЗаголовокСистемы.Получить();
	
	Если ПустаяСтрока(Результат) Тогда
		
		Результат = Метаданные.Синоним;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СохранениеНастройкиПодключения

&НаСервере
Функция СохранениеНастроекПодключенияНачало()
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ПараметрыПроцедуры = Результат.НастройкиОбмена;

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Настройка обмена с 1С:РМК'", ОбщегоНазначения.КодОсновногоЯзыка());
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	КлючФоновогоЗадания = ОбменДаннымиСервер.КлючФоновогоЗадания(ИмяПланаОбмена,
		НСтр("ru = 'Сохранение настроек подключения'"));
		
	Если ОбменДаннымиСервер.ЕстьАктивныеФоновыеЗадания(КлючФоновогоЗадания) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сохранение настроек подключения для ""%1"" уже выполняется.'"), ИмяПланаОбмена);
	КонецЕсли; 
		
	ПараметрыВыполнения.КлючФоновогоЗадания = КлючФоновогоЗадания;
		
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ПомощникНастройкиОбменаУРМК.СохранитьНастройкиПодключения",
		ПараметрыПроцедуры);
	
КонецФункции

&НаКлиенте
Процедура СохранениеНастроекПодключенияЗавершение(ФоновоеЗадание, ДополнительныеПараметры) Экспорт
	
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ФоновоеЗадание.Статус = "Ошибка" Тогда 
		
		ИзменитьПорядковыйНомерПерехода(-1);
		
	КонецЕсли;
	
	СохранениеНастроекПодключенияЗавершениеНаСервере(ФоновоеЗадание.АдресРезультата);
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СохранитьФайлыНастроекПодключенияЗавершение", ЭтотОбъект);
	
	Если НастройкиПодключенияСохранены Тогда
		Если ВидПодключения = "ОбычныеКаналыСвязи"
			И ЗначениеЗаполнено(АдресНастроекПодключенияXML) Тогда
		
			СохранитьФайлыНастроекПодключения();
		Иначе
			ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Новый Массив);
		КонецЕсли;
	Иначе
		
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Неопределено);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранениеНастроекПодключенияЗавершениеНаСервере(Знач АдресРезультата)
		
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	НастройкиПодключенияСохранены = Результат.НастройкиПодключенияСохранены;
		
	Если НастройкиПодключенияСохранены Тогда
		
		УзелОбмена = Результат.УзелОбмена;
		
		АдресНастроекПодключенияXML = "";
		
		Если ЗначениеЗаполнено(Результат.СтрокаНастроекПодключенияXML)
			И ВидПодключения = "ОбычныеКаналыСвязи" Тогда
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
			
			Запись = Новый ЗаписьТекста;
			Запись.Открыть(ИмяВременногоФайла, "UTF-8");
			Запись.Записать(Результат.СтрокаНастроекПодключенияXML);
			Запись.Закрыть();
			
			АдресНастроекПодключенияXML = ПоместитьВоВременноеХранилище(
				Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
				
			УдалитьФайлы(ИмяВременногоФайла);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыНастроекПодключения()
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Настройки = Результат.НастройкиОбмена;

	ПолучаемыеФайлы = Новый Массив;
	
	Если ЗначениеЗаполнено(АдресНастроекПодключенияXML) Тогда
		
		ИмяФайлаНастроекПриемника = НСтр("ru = 'Настройки синхронизации данных'");
		
		Если КаналыСвязиВидКанала = "ЛокальныйСетевойКаталог" Тогда
			КаталогНастроекПодключения = Настройки.КаталогОбменаИнформацией;
		ИначеЕсли КаналыСвязиВидКанала = "КаталогFTP" Тогда
			КаталогНастроекПодключения = Настройки.КаталогНастроекПодключенияДляВыгрузки;
		КонецЕсли;
		
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(
			КаталогНастроекПодключения,
			ИмяФайлаНастроекПриемника + ".xml");

		ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайла, АдресНастроекПодключенияXML));
	Иначе
		ИзменитьПорядковыйНомерПерехода(-1);
		Возврат;
	КонецЕсли;
	
	Если ПолучаемыеФайлы.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("СохранитьФайлыНастроекПодключенияЗавершение", ЭтотОбъект);

		ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайлов();
		ПараметрыСохранения.Интерактивно = Ложь;
			
		ФайловаяСистемаКлиент.СохранитьФайлы(Оповещение, ПолучаемыеФайлы, ПараметрыСохранения);
		
	Иначе
		ИзменитьПорядковыйНомерПерехода(-1);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыНастроекПодключенияЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		ИзменитьПорядковыйНомерПерехода(+1);
		Элементы.ГруппаОтказ.Видимость = Истина;
		
		Элементы.ГруппаУспешно.Видимость = Ложь;
		Элементы.ГруппаНиз.Видимость = Ложь;
	Иначе	
		
		Оповестить("Запись_УзелПланаОбмена");
		
		ПриНачалеСохраненияНастройки();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеНастройкиСинхронизации

&НаКлиенте
Процедура ПриНачалеСохраненияНастройки()
	
	ПродолжитьОжидание = Истина;
	ПриНачалеСохраненияНастройкиСинхронизацииНаСервере(ПродолжитьОжидание);
	
	Если ПродолжитьОжидание Тогда
		ИнициализироватьПараметрыОбработчикаОжидания(
			ПараметрыОбработчикаОжиданияСохраненияНастроек);
			
		ПодключитьОбработчикОжидания("ПриОжиданииСохраненияНастройки",
			ПараметрыОбработчикаОжиданияСохраненияНастроек.ТекущийИнтервал, Истина);
	Иначе
		ПриЗавершенииСохраненияНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриНачалеСохраненияНастройкиСинхронизацииНаСервере(ПродолжитьОжидание)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Настройки = Результат.НастройкиОбмена;

	НастройкиСинхронизации = Новый Структура;
	НастройкиСинхронизации.Вставить("УзелОбмена",       УзелОбмена);
	НастройкиСинхронизации.Вставить("ДанныеЗаполнения", Новый Структура);
	
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ДатаНачалаВыгрузкиДокументов", ДатаНачалаВыгрузкиДокументов);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ИспользоватьОтборПоОрганизациям", Истина);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ТорговыйОбъект", Настройки.ТорговыйОбъект);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВидЦен", Настройки.ВидЦен);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ХранитьКартыЛояльностиВРМК", Настройки.ХранитьКартыЛояльностиВРМК);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьОстаткиНоменклатуры", Настройки.ВыгружатьОстаткиНоменклатуры);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьПоставщиков", Настройки.ВыгружатьПоставщиков);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьЗаказы", Настройки.ВыгружатьЗаказы);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьСерии", Настройки.ВыгружатьСерии);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьПартииКомиссионныхТоваров", Настройки.ВыгружатьПартииКомиссионныхТоваров);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьТолькоТоварыПалитры", Настройки.ВыгружатьТолькоТоварыПалитры);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьФизическихЛиц", Настройки.ВыгружатьФизическихЛиц);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьФизическихЛицЧастично", Настройки.ВыгружатьФизическихЛицЧастично);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьШаблоныЧеков", Настройки.ВыгружатьШаблоныЧеков);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ШаблонЧекаПродажи", Настройки.ШаблонЧекаПродажи);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ШаблонЧекаВозврата", Настройки.ШаблонЧекаВозврата);
	
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("УРМК", Настройки.УРМК);
	
	тчКассыККМ = Настройки.УРМК.КассыККМ;
	
	ТаблицаКассыККМ = ПланыОбмена.ОбменСУРМК.ПустаяСсылка().КассыККМ.Выгрузить();
	ТаблицаОрганизации = ПланыОбмена.ОбменСУРМК.ПустаяСсылка().Организации.Выгрузить();
	
	Если ИспользоватьРасширенныйРежимНастройкиУРМК Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(тчКассыККМ, ТаблицаКассыККМ);
		ТаблицаОрганизации = ИнтеграцияУРМКСлужебный.ОрганизацииУРМК(ТаблицаКассыККМ);
		НастройкаРМК = Настройки.УРМК;
	Иначе
		СтрокаКассыККМ = ТаблицаКассыККМ.Добавить();
		СтрокаКассыККМ.КассаККМ = Настройки.КассаККМ;
		
		СтрокаОрганизации = ТаблицаОрганизации.Добавить();
		СтрокаОрганизации.Организация = Настройки.Организация;
		НастройкаРМК = Настройки.КассаККМ;
	КонецЕсли;
	
	ПустаяТаблицаФизЛиц = СписокФизическихЛицДляВыгрузки.Выгрузить().СкопироватьКолонки();
	ПустаяТаблицаНастроек = ТаблицаНастройкиПользователей.Выгрузить().СкопироватьКолонки();
	СтрокиПоиска = СписокРабочихМестКОбмену.НайтиСтроки(Новый Структура("УРМК", НастройкаРМК));
	Если СтрокиПоиска.Количество() > 0 Тогда
		СтрокаНастройки = СтрокиПоиска[0];
		НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьФизическихЛиц", СтрокаНастройки.ВыгружатьФизическихЛиц);
		НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьФизическихЛицЧастично", СтрокаНастройки.ВыгружатьФизическихЛицЧастично);
		Если ЗначениеЗаполнено(СтрокаНастройки.АдресХранилищаТаблицаПользователей) Тогда
			ТаблицаНастроек = ПолучитьИзВременногоХранилища(СтрокаНастройки.АдресХранилищаТаблицаПользователей);
			НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ТаблицаНастройкиПользователей", ТаблицаНастроек);
		Иначе
			НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ТаблицаНастройкиПользователей", ПустаяТаблицаНастроек);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаНастройки.АдресХранилищаФизЛиц) Тогда
			ТаблицаФизическихЛиц = ПолучитьИзВременногоХранилища(СтрокаНастройки.АдресХранилищаФизЛиц);
			НастройкиСинхронизации.ДанныеЗаполнения.Вставить("СписокФизическихЛицДляВыгрузки", ТаблицаФизическихЛиц);
		Иначе
			НастройкиСинхронизации.ДанныеЗаполнения.Вставить("СписокФизическихЛицДляВыгрузки", ПустаяТаблицаФизЛиц);
		КонецЕсли;
	Иначе
		НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьФизическихЛиц", Ложь);
		НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ВыгружатьФизическихЛицЧастично", Ложь);
		НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ТаблицаНастройкиПользователей", ПустаяТаблицаНастроек);
		НастройкиСинхронизации.ДанныеЗаполнения.Вставить("СписокФизическихЛицДляВыгрузки", ПустаяТаблицаФизЛиц);
	КонецЕсли;
	
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("КассыККМ", ТаблицаКассыККМ);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("Организации", ТаблицаОрганизации);
	НастройкиСинхронизации.ДанныеЗаполнения.Вставить("ПалитрыТоваровДляВыгрузки",
		ПалитрыТоваровДляВыгрузки.Выгрузить());
	
	ПараметрыОбработчикаСохраненияНастроек = Неопределено;
	ОбменДаннымиСервер.ПриНачалеСохраненияНастроекСинхронизации(
		НастройкиСинхронизации, ПараметрыОбработчикаСохраненияНастроек, ПродолжитьОжидание);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОжиданииСохраненияНастройки()
	
	ПродолжитьОжидание = Ложь;
	ПриОжиданииСохраненияНастройкиНаСервере(ПараметрыОбработчикаСохраненияНастроек, ПродолжитьОжидание);
	
	Если ПродолжитьОжидание Тогда
		ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжиданияСохраненияНастроек);
		
		ПодключитьОбработчикОжидания("ПриОжиданииСохраненияНастройки",
			ПараметрыОбработчикаОжиданияСохраненияНастроек.ТекущийИнтервал, Истина);
	Иначе
		ПриЗавершенииСохраненияНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПриОжиданииСохраненияНастройкиНаСервере(ПараметрыОбработчика, ПродолжитьОжидание)
	
	ОбменДаннымиСервер.ПриОжиданииСохраненияНастроекСинхронизации(
		ПараметрыОбработчика, ПродолжитьОжидание);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииСохраненияНастройки()
	
	ПараметрыОбработчикаОжиданияСохраненияНастроек = Неопределено;
	
	Отказ = Ложь;
	СообщениеОбОшибке = "";
	ПриЗавершенииСохраненияНастройкиНаСервере(Отказ, СообщениеОбОшибке);
	
	Если Отказ Тогда
		ИзменитьПорядковыйНомерПерехода(-1);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке);
	Иначе
		
		Если Не ВидПодключения = "ОбычныеКаналыСвязи" Тогда
			УдалитьИзВременногоХранилища(АдресРезультата);
		КонецЕсли;

		ЗарегистрироватьДанныеКВыгрузке();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗавершенииСохраненияНастройкиНаСервере(Отказ, СообщениеОбОшибке)
	
	СтатусЗавершения = Неопределено;
	ОбменДаннымиСервер.ПриЗавершенииСохраненияНастроекСинхронизации(
		ПараметрыОбработчикаСохраненияНастроек, СтатусЗавершения);
	ПараметрыОбработчикаСохраненияНастроек = Неопределено;
		
	Если СтатусЗавершения.Отказ Тогда
		Отказ = Истина;
		СообщениеОбОшибке = СтатусЗавершения.СообщениеОбОшибке;
		Возврат;
	Иначе
		
		Если Не СтатусЗавершения.Результат.НастройкиСохранены Тогда
			Отказ = Истина;
			СообщениеОбОшибке = СтатусЗавершения.Результат.СообщениеОбОшибке;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания)
	
	ПараметрыОбработчикаОжидания = Новый Структура;
	ПараметрыОбработчикаОжидания.Вставить("МинимальныйИнтервал", 1);
	ПараметрыОбработчикаОжидания.Вставить("МаксимальныйИнтервал", 15);
	ПараметрыОбработчикаОжидания.Вставить("ТекущийИнтервал", 1);
	ПараметрыОбработчикаОжидания.Вставить("КоэффициентУвеличенияИнтервала", 1.4);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания)
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = Мин(ПараметрыОбработчикаОжидания.МаксимальныйИнтервал,
		Окр(ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала, 1));
		
КонецПроцедуры

#КонецОбласти

#Область РегистрацияИзменений

&НаКлиенте
Процедура ЗарегистрироватьДанныеКВыгрузке()
	
	Элементы.ДекорацияОжиданиеНадпись.Заголовок = НСтр("ru = 'Выполняется регистрация данных.
		|Пожалуйста, подождите...'");
	
	ДлительнаяОперация = НачатьРегистрациюДанныхКВыгрузкеНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗарегистрироватьДанныеКВыгрузкеЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьРегистрациюДанныхКВыгрузкеНаСервере()
	
	КодУзла  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелОбмена, "Код");
	Магазины = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТорговыйОбъект);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("УзелОбмена",                   УзелОбмена);
	ПараметрыПроцедуры.Вставить("КодУзла",                      КодУзла);
	ПараметрыПроцедуры.Вставить("ДатаНачалаВыгрузкиДокументов", ДатаНачалаВыгрузкиДокументов);
	ПараметрыПроцедуры.Вставить("Магазины",                     Магазины);
	ПараметрыПроцедуры.Вставить("Комментарий",                  "");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.ПомощникНастройкиОбменаУРМК.ЗарегистрироватьДанныеДляНачальнойВыгрузки", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьДанныеКВыгрузкеЗавершение(РезультатФоновогоЗадания, ДополнительныеПараметры) Экспорт
	
	Если РезультатФоновогоЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
		
		ПодготовитьНастройкиОбмена();
		
	Иначе
		ИзменитьПорядковыйНомерПерехода(-1);
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатФоновогоЗадания.ПодробноеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаДанных

&НаКлиенте
Процедура Подключаемый_ВыгрузитьДанные()
	Элементы.ДекорацияОжиданиеНадпись.Заголовок = НСтр("ru = 'Выполняется выгрузка данных.
		|Пожалуйста, подождите...'");
	
	ДлительнаяОперация = НачатьВыгрузкуДанныхНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьДанныеЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
КонецПроцедуры

&НаСервере
Функция НачатьВыгрузкуДанныхНаСервере()
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Настройки = Результат.НастройкиОбмена;

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("УзелОбмена", УзелОбмена);
	ПараметрыПроцедуры.Вставить("КаталогОбмена", Настройки.FILEКаталогОбменаИнформацией);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.ПомощникНастройкиОбменаУРМК.ВыгрузитьДанные", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции

&НаКлиенте
Процедура ВыгрузитьДанныеЗавершение(РезультатФоновогоЗадания, ДополнительныеПараметры) Экспорт
	
	Если РезультатФоновогоЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
		
		УдалитьИзВременногоХранилища(АдресРезультата);

		ПодготовитьНастройкиОбмена();
		
	Иначе
		ИзменитьПорядковыйНомерПерехода(-1);
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатФоновогоЗадания.ПодробноеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияФормыПриСоздании

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	
	ИспользоватьСинхронизациюДанных = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");

	МодельСервиса = ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();
		
	ИспользоватьРасширенныйРежимНастройкиУРМК = ИнтеграцияУРМКСлужебный.ИспользоватьРасширенныйРежимНастройкиУРМК();
	
	ЗапретКомиссионныхПартийБезВладельца = Константы.ЗапретКомиссионныхПартийБезВладельца.Получить();
	
	Если Не ИспользоватьРасширенныйРежимНастройкиУРМК Тогда
		Константы.ИспользоватьРасширенныйРежимНастройкиУРМК.Установить(ИспользоватьРасширенныйРежимНастройкиУРМК);
		НастроитьДинамическийСписок(Элементы.УРМК);
		ИнтеграцияУРМКПереопределяемый.УстановитьОтборПоТипуКассыККМ(УРМКСписок);
		МассивТип = Новый Массив;
		МассивТип.Добавить(Тип("СправочникСсылка.КассыККМ"));
		ОписаниеТипа = Новый ОписаниеТипов(МассивТип);
		Элементы.НастройкаУРМК.Заголовок = НСтр("ru = 'Касса ККМ'");
	Иначе
		МассивТип = Новый Массив;
		МассивТип.Добавить(Тип("СправочникСсылка.УниверсальныеРабочиеМестаКассиров"));
		ОписаниеТипа = Новый ОписаниеТипов(МассивТип);
		Элементы.НастройкаУРМК.Заголовок = НСтр("ru = 'Рабочее место'");
	КонецЕсли;
	
	Элементы.НастройкаУРМК.ОграничениеТипа = ОписаниеТипа;

	ВидПодключения = Элементы.ВидПодключенияИнтернет.СписокВыбора[0].Значение;
	КаналыСвязиВидКанала = Элементы.КаналыСвязиВидКанала.СписокВыбора[0].Значение;
	
	ИнтеграцияУРМКПереопределяемый.УстановитьПараметрыВыбораТорговыйОбъект(ЭтотОбъект, "ТорговыйОбъект");
	ИнтеграцияУРМКПереопределяемый.ТорговыйОбъектУРМКПоУмолчанию(ТорговыйОбъект);

	ЗаполнитьНастройкиПоОбщимПараметрам("ТорговыйОбъект");
	
	ИмяПланаОбмена = "ОбменСУРМК";
	ИдентификаторВариантаНастройкиОбмена = "ОбменУРМК";
	ИдентификаторКорреспондента = Строка(Новый УникальныйИдентификатор);
	ДатаНачалаВыгрузкиДокументов = ТекущаяДатаСеанса();

	ЗаполнитьТаблицуПереходов();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСвойстваФормы()
	
	Заголовок = НСтр("ru = 'Помощник настройки обмена данными с 1С:РМК, 1С:Касса, 1С:Мобильная касса'");
	
КонецПроцедуры

&НаСервере
Процедура ВывестиБаннеры()

	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Доступность опций'");
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Включение опции недоступно, потому что активна опция Выгружать заказы.'");
	
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.ГруппаБаннерКомментарийДоступности.Имя);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СценарииРаботыПомощника

&НаСервере
Функция ДобавитьСтрокуТаблицыПереходов(ИмяОсновнойСтраницы, ИмяСтраницыНавигации, ИмяСтраницыДекорации = "")
	
	СтрокаПереходов = ТаблицаПереходов.Добавить();
	СтрокаПереходов.ПорядковыйНомерПерехода = ТаблицаПереходов.Количество();
	СтрокаПереходов.ИмяОсновнойСтраницы = ИмяОсновнойСтраницы;
	СтрокаПереходов.ИмяСтраницыНавигации = ИмяСтраницыНавигации;
	СтрокаПереходов.ИмяСтраницыДекорации = ИмяСтраницыДекорации;
	
	Возврат СтрокаПереходов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуПереходов()
	
	ТаблицаПереходов.Очистить();
	
	Если МодельСервиса Тогда
		
		НовыйПереход = ДобавитьСтрокуТаблицыПереходов("СтраницаСписокНастроекОтправки", "СтраницаНавигацияНачало");
		НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаСписокНастроекОтправки_ПриОткрытии";
		НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаСписокНастроекОтправки_ПриПереходеДалее";
		
		НовыйПереход = ДобавитьСтрокуТаблицыПереходов("СтраницаНастройкиКассовогоМеста", "СтраницаНавигацияПродолжение");
		НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаНастройкиКассовогоМеста_ПриОткрытии";
		НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаНастройкиКассовогоМеста_ПриПереходеДалее";
		
		НовыйПереход = ДобавитьСтрокуТаблицыПереходов("СтраницаПалитраТоваров", "СтраницаНавигацияПродолжение");
		НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаПалитраТоваров_ПриОткрытии";
		НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаПалитраТоваров_ПриПереходеДалее";
		НовыйПереход.ИмяОбработчикаПриПереходеНазад = "СтраницаПалитраТоваров_ПриПереходеНазад";
		
	ИначеЕсли ИспользоватьСинхронизациюДанных Тогда
		
		НовыйПереход = ДобавитьСтрокуТаблицыПереходов("СтраницаСпособНастройкиПодключения", "СтраницаНавигацияНачало");
		НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаСпособНастройкиПодключения_ПриОткрытии";
		НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаСпособНастройкиПодключения_ПриПереходеДалее";

		НовыйПереход = ДобавитьСтрокуТаблицыПереходов("СтраницаПараметрыПодключенияОбычныеКаналыСвязи", "СтраницаНавигацияПродолжение");
		НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаПараметрыПодключенияОбычныеКаналыСвязи_ПриОткрытии";
		НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаПараметрыПодключенияОбычныеКаналыСвязи_ПриПереходеДалее";
		
		НовыйПереход = ДобавитьСтрокуТаблицыПереходов("СтраницаСписокНастроекОтправки", "СтраницаНавигацияПродолжение");
		НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаСписокНастроекОтправки_ПриОткрытии";
		НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаСписокНастроекОтправки_ПриПереходеДалее";
		
		НовыйПереход = ДобавитьСтрокуТаблицыПереходов("СтраницаНастройкиКассовогоМеста", "СтраницаНавигацияПродолжение");
		НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаНастройкиКассовогоМеста_ПриОткрытии";
		НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаНастройкиКассовогоМеста_ПриПереходеДалее";
		
		НовыйПереход = ДобавитьСтрокуТаблицыПереходов("СтраницаПалитраТоваров", "СтраницаНавигацияПродолжение");
		НовыйПереход.ИмяОбработчикаПриОткрытии = "СтраницаПалитраТоваров_ПриОткрытии";
		НовыйПереход.ИмяОбработчикаПриПереходеДалее = "СтраницаПалитраТоваров_ПриПереходеДалее";
		НовыйПереход.ИмяОбработчикаПриПереходеНазад = "СтраницаПалитраТоваров_ПриПереходеНазад";
		
	Иначе
		НовыйПереход = ДобавитьСтрокуТаблицыПереходов("СтраницаОбменЗапрещен", "СтраницаНавигацияОкончание");
	КонецЕсли;
	
	НовыйПереход = ДобавитьСтрокуТаблицыПереходов("СтраницаОжидание", "СтраницаНавигацияПродолжение");
	НовыйПереход.ДлительнаяОперация = Истина;
	НовыйПереход.ИмяОбработчикаДлительнойОперации = "СтраницаОжидание_ДлительнаяОперация";
	
	НовыйПереход = ДобавитьСтрокуТаблицыПереходов("СтраницаЗавершение", "СтраницаНавигацияОкончание");
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеОбработчикиПереходов

////////////////////////////////////////////////////////////////////////////////
// Поставляемая часть

&НаКлиенте
Процедура ИзменитьПорядковыйНомерПерехода(Итератор)
	
	ОчиститьСообщения();
	
	УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + Итератор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПорядковыйНомерПерехода(Знач Значение)
	
	ЭтоПереходДалее = (Значение > ПорядковыйНомерПерехода);
	
	ПорядковыйНомерПерехода = Значение;
	
	Если ПорядковыйНомерПерехода < 0 Тогда
		
		ПорядковыйНомерПерехода = 0;
		
	КонецЕсли;
	
	ПорядковыйНомерПереходаПриИзменении(ЭтоПереходДалее);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядковыйНомерПереходаПриИзменении(Знач ЭтоПереходДалее)
	
	// Выполняем обработчики событий перехода.
	ВыполнитьОбработчикиСобытийПерехода(ЭтоПереходДалее);
	
	// Устанавливаем отображение страниц.
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	Элементы.ПанельОсновная.ТекущаяСтраница  = Элементы[СтрокаПереходаТекущая.ИмяОсновнойСтраницы];
	
	Для Каждого Элемент Из Элементы.ПанельНавигации.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			Элемент.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если ИнтерфейсТакси Тогда
		Элементы.ПанельНавигацииТакси.ТекущаяСтраница = Элементы[СтрокаПереходаТекущая.ИмяСтраницыНавигации + "Такси"];
		Элементы.ПанельНавигацииТакси.ТекущаяСтраница.Доступность = Не (ЭтоПереходДалее И СтрокаПереходаТекущая.ДлительнаяОперация);
		СтраницаНавигации = Элементы.ПанельНавигацииТакси.ТекущаяСтраница;
	Иначе
		СтраницаНавигации = Элементы[СтрокаПереходаТекущая.ИмяСтраницыНавигации];
		СтраницаНавигации.Видимость = Истина;
		СтраницаНавигации.Доступность = Не (ЭтоПереходДалее И СтрокаПереходаТекущая.ДлительнаяОперация);
	КонецЕсли;
	
	// Устанавливаем текущую кнопку по умолчанию.
	КнопкаДалее = ПолучитьКнопкуФормыПоИмениКоманды(СтраницаНавигации, "КомандаДалее");
	
	Если КнопкаДалее <> Неопределено Тогда
		
		КнопкаДалее.КнопкаПоУмолчанию = Истина;
		КнопкаДалее.Важность = ВажностьКнопки.Главная;
		
	Иначе
		
		КнопкаГотово = ПолучитьКнопкуФормыПоИмениКоманды(СтраницаНавигации, "КомандаГотово");
		
		Если КнопкаГотово <> Неопределено Тогда
			
			КнопкаГотово.КнопкаПоУмолчанию = Истина;
			КнопкаГотово.Важность = ВажностьКнопки.Главная;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоПереходДалее И СтрокаПереходаТекущая.ДлительнаяОперация Тогда
		
		ПодключитьОбработчикОжидания("ВыполнитьОбработчикДлительнойОперации", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработчикиСобытийПерехода(Знач ЭтоПереходДалее)
	
	// Обработчики событий переходов.
	Если ЭтоПереходДалее Тогда
		
		СтрокиПерехода = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода - 1));
		
		Если СтрокиПерехода.Количество() > 0 Тогда
			
			СтрокаПерехода = СтрокиПерехода[0];
			
			// Обработчик ПриПереходеДалее.
			Если Не ПустаяСтрока(СтрокаПерехода.ИмяОбработчикаПриПереходеДалее)
				И Не СтрокаПерехода.ДлительнаяОперация Тогда
				
				ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ)";
				ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПерехода.ИмяОбработчикаПриПереходеДалее);
				
				Отказ = Ложь;
				
				Результат = Вычислить(ИмяПроцедуры);
				
				Если Отказ Тогда
					
					ПорядковыйНомерПерехода = ПорядковыйНомерПерехода - 1;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		СтрокиПерехода = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода + 1));
		
		Если СтрокиПерехода.Количество() > 0 Тогда
			
			СтрокаПерехода = СтрокиПерехода[0];
			
			// Обработчик ПриПереходеНазад.
			Если Не ПустаяСтрока(СтрокаПерехода.ИмяОбработчикаПриПереходеНазад)
				И Не СтрокаПерехода.ДлительнаяОперация Тогда
				
				ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ)";
				ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПерехода.ИмяОбработчикаПриПереходеНазад);
				
				Отказ = Ложь;
				
				Результат = Вычислить(ИмяПроцедуры);
				
				Если Отказ Тогда
					
					ПорядковыйНомерПерехода = ПорядковыйНомерПерехода + 1;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	Если СтрокаПереходаТекущая.ДлительнаяОперация И Не ЭтоПереходДалее Тогда
		УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
		Возврат;
	КонецЕсли;
	
	// обработчик ПриОткрытии
	Если Не ПустаяСтрока(СтрокаПереходаТекущая.ИмяОбработчикаПриОткрытии) Тогда
		
		ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ, ПропуститьСтраницу, ЭтоПереходДалее)";
		ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПереходаТекущая.ИмяОбработчикаПриОткрытии);
		
		Отказ = Ложь;
		ПропуститьСтраницу = Ложь;
		
		Результат = Вычислить(ИмяПроцедуры);
		
		Если Отказ Тогда
			
			ПорядковыйНомерПерехода = ПорядковыйНомерПерехода - 1;
			Возврат;
			
		ИначеЕсли ПропуститьСтраницу Тогда
			
			Если ЭтоПереходДалее Тогда
				
				УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
				Возврат;
				
			Иначе
				
				УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработчикДлительнойОперации()
	
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	// Обработчик ОбработкаДлительнойОперации.
	Если Не ПустаяСтрока(СтрокаПереходаТекущая.ИмяОбработчикаДлительнойОперации) Тогда
		
		ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ, ПерейтиДалее)";
		ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПереходаТекущая.ИмяОбработчикаДлительнойОперации);
		
		Отказ = Ложь;
		ПерейтиДалее = Истина;
		
		Результат = Вычислить(ИмяПроцедуры);
		
		Если Отказ Тогда
			
			ПорядковыйНомерПерехода = ПорядковыйНомерПерехода - 1;
			Возврат;
			
		ИначеЕсли ПерейтиДалее Тогда
			
			УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКнопкуФормыПоИмениКоманды(ЭлементФормы, ИмяКоманды)
	
	Для Каждого Элемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			
			ЭлементФормыПоИмениКоманды = ПолучитьКнопкуФормыПоИмениКоманды(Элемент, ИмяКоманды);
			
			Если ЭлементФормыПоИмениКоманды <> Неопределено Тогда
				
				Возврат ЭлементФормыПоИмениКоманды;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("КнопкаФормы")
			И СтрНайти(Элемент.ИмяКоманды, ИмяКоманды) > 0 Тогда
			
			Возврат Элемент;
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПоОбщимПараметрам(ИмяПараметра = "")
	
	Если Не ПустаяСтрока(ИмяПараметра) Тогда
		ОбщиеПараметры = ОбщиеПараметры();
		
		ИнтеграцияУРМКПереопределяемый.ПриИзмененииОбщихПараметров(ОбщиеПараметры, ИмяПараметра);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОбщиеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбщиеПараметры()
	
	Результат = ИнтеграцияУРМКСлужебный.СтруктураОбщихПараметров();
	ЗаполнитьЗначенияСвойств(Результат, ЭтотОбъект);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастроитьДинамическийСписок(Список)
	
	МетаданныеКассыККМ = ИнтеграцияУРМКСлужебный.МетаданныеПоОпределяемомуТипу("КассаККМУРМК");
	
	ПустаяСсылкаКассаККМ = Метаданные.ОпределяемыеТипы.КассаККМУРМК.Тип.ПривестиЗначение();
	ПустаяСсылкаТорговыйОбъект = Метаданные.ОпределяемыеТипы.ТорговыйОбъектУРМК.Тип.ПривестиЗначение();
	ПустаяСсылкаОрганизация = Метаданные.ОпределяемыеТипы.ОрганизацияУРМК.Тип.ПривестиЗначение();
	
	ТорговыйОбъектТипРеквизитаСтрокой = ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗнч(ПустаяСсылкаТорговыйОбъект));
	ИмяРеквизитаТорговыйОбъект = ИнтеграцияУРМКСлужебный.ИменаРеквизитовПоТипу(ПустаяСсылкаКассаККМ, Тип(ТорговыйОбъектТипРеквизитаСтрокой), "Подразделение");
	
	ОрганизацияТипРеквизитаСтрокой = ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗнч(ПустаяСсылкаОрганизация));
	ИмяРеквизитаОрганизация = ИнтеграцияУРМКСлужебный.ИменаРеквизитовПоТипу(ПустаяСсылкаКассаККМ, Тип(ОрганизацияТипРеквизитаСтрокой));
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КассыККМ.Ссылка КАК Ссылка,
		|	КассыККМ.Наименование КАК Наименование,
		|	[ТорговыйОбъект]
		|	[Организация]
		|	ВЫБОР
		|		КОГДА УзлыНастроены.Ссылка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК УзелНастроен
		|ИЗ
		|	[КассаККМУРМК] КАК КассыККМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.ОбменСУРМК.КассыККМ  КАК УзлыНастроены
		|		ПО КассыККМ.Ссылка = УзлыНастроены.КассаККМ
		|ГДЕ
		|	НЕ КассыККМ.ПометкаУдаления
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[КассаККМУРМК]", МетаданныеКассыККМ.ПолноеИмя());
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ТорговыйОбъект]",
		?(ИмяРеквизитаТорговыйОбъект = "","", "КассыККМ." +ИмяРеквизитаТорговыйОбъект+ " КАК ТорговыйОбъект,"));

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[Организация]",
		?(ИмяРеквизитаОрганизация = "","", "КассыККМ." +ИмяРеквизитаОрганизация+ ".Наименование КАК Организация,"));

	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица              = МетаданныеКассыККМ.ПолноеИмя();
	СвойстваСписка.ТекстЗапроса                 = ТекстЗапроса;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Список, СвойстваСписка);

КонецПроцедуры
	
&НаСервере
Процедура НастроитьФорму()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаСинхронизацияЧерезКаталог",
		"Видимость",
		КаналыСвязиВидКанала = "ЛокальныйСетевойКаталог");
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"КаталогОбменаНадпись",
		"Видимость",
		КаналыСвязиВидКанала = "ЛокальныйСетевойКаталог");
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаСинхронизацияЧерезFTP",
		"Видимость",
		КаналыСвязиВидКанала = "КаталогFTP");
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"FTPКаталогНастроекПодключенияДляВыгрузки",
		"Видимость",
		КаналыСвязиВидКанала = "КаталогFTP");
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаФайлНастроекПодключенияДляКорреспондента",
		"Видимость",
		КаналыСвязиВидКанала = "КаталогFTP");
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаВидПодключенияОбычныеКаналыСвязиРеквизиты",
		"Доступность",
		ВидПодключения = "ОбычныеКаналыСвязи");
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаКодыПодключения",
		"Видимость",
		ВидПодключения = "ПассивныйРежим");
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаФайлыНастроек",
		"Видимость",
		ВидПодключения = "ОбычныеКаналыСвязи");
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаПарольАрхива",
		"Доступность",
		АрхивироватьФайлы);
	
	Если ИспользоватьРасширенныйРежимНастройкиУРМК Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"УРМКНаименование",
			"Заголовок",
			НСтр("ru = 'РМК'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГруппаСписокНастроек",
			"Заголовок",
			НСтр("ru = 'Список рабочих мест кассиров'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"УРМКОрганизация",
			"Видимость",
			Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КаталогОбменаИспользуется(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Настройки.Настройка КАК Настройка,
		|	Настройки.Значение КАК Значение
		|ИЗ
		|	Справочник.НастройкиТранспортаСообщенийОбмена.Настройки КАК Настройки
		|ГДЕ
		|	Настройки.Ссылка.ИдентификаторТранспорта = &ИдентификаторТранспорта
		|	И Настройки.Значение ПОДОБНО &КаталогОбмена
		|";
	
	Запрос.УстановитьПараметр("ИдентификаторТранспорта", ИдентификаторТранспорта);
	Запрос.УстановитьПараметр("КаталогОбмена", КаталогОбмена);
	
	Результат = Запрос.Выполнить();
	
	Отказ = Не Результат.Пустой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПодключенияПриИзменении(Элемент)
	НастроитьФорму();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическихСписков(ИмяРеквизита)
	
	ИмяПоля = ИмяРеквизита;
	ЗначениеРеквизита = ЭтотОбъект[ИмяРеквизита];
	
	Если ТипЗнч(ЗначениеРеквизита) = Тип("СправочникСсылка.СтруктурныеЕдиницы")
		И Не ИспользоватьРасширенныйРежимНастройкиУРМК Тогда
		
		Если ЗначениеРеквизита.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов Тогда
			ИмяПоля = "ТорговыйОбъект.Родитель";
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля = "ТорговыйОбъект.Родитель" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			УРМКСписок,
			"ТорговыйОбъект",
			,,,
			Ложь);
	ИначеЕсли ИмяПоля = "ТорговыйОбъект" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			УРМКСписок,
			"ТорговыйОбъект.Родитель",
			,,,
			Ложь);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		УРМКСписок,
		ИмяПоля,
		ЗначениеРеквизита,,,
		ЗначениеЗаполнено(ЗначениеРеквизита));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКодыПодключения(Команда)
	
	АдресФайла = ПолучитьФайлКодовПодключения();
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьКодыПодключенияЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("АдресФайла", АдресФайла);
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Диалог.Заголовок = НСтр("ru = 'Сохранить коды подключения 1С:РМК'");
	ПараметрыСохранения.Диалог.Фильтр = "Документ PDF (*.pdf)|*.pdf";
	
	ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, АдресФайла, НСтр("ru = 'Коды подключения.pdf'"), ПараметрыСохранения);

КонецПроцедуры

&НаСервере
Функция ПолучитьФайлКодовПодключения()
	
	ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
	
	КодыПодключения = Обработки.ПомощникНастройкиОбменаУРМК.СформироватьПечатнуюФормуКодыПодключения(НастройкиПечати());
	КодыПодключения.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	
	АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла), УникальныйИдентификатор);
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось удалить файл:" + ИмяФайла+ "'"));
	КонецПопытки;
	
	Возврат АдресФайла;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьКодыПодключенияЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресФайла);
	
	Если ПолученныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОткрытияФайла = Новый ОписаниеОповещения(
		"ФайлКодыПодключенияСохраненЗавершение",
		ЭтотОбъект,
		Новый Структура("ПутьКФайлу",  ПолученныеФайлы[0].ПолноеИмя));
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Файл успешно сохранен'"),
		ОповещениеОткрытияФайла,
		ПолученныеФайлы[0].ПолноеИмя,
		БиблиотекаКартинок["Информация32"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлКодыПодключенияСохраненЗавершение(ДополнительныеПараметры) Экспорт
	
	ФайловаяСистемаКлиент.ОткрытьФайл(ДополнительныеПараметры.ПутьКФайлу);
	
КонецПроцедуры

&НаСервере
Функция НастройкиПечати()
	
	ТаблицаНастройкиПечати = Новый ТаблицаЗначений;
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ОбменСУРМК.УРМК КАК УРМК,
		|	ОбменСУРМК.Код КАК КодУзла
		|ИЗ
		|	ПланОбмена.ОбменСУРМК КАК ОбменСУРМК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиТранспортаСообщенийОбмена КАК НастройкиТранспорта
		|		ПО (ОбменСУРМК.Ссылка = НастройкиТранспорта.Корреспондент)
		|ГДЕ
		|	НастройкиТранспорта.ИдентификаторТранспорта = &ВидТранспорта
		|	И НастройкиТранспорта.НастройкаПоУмолчанию
		|	И ОбменСУРМК.НомерОтправленного = 0
		|	И НЕ ОбменСУРМК.ЭтотУзел
		|";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВидТранспорта", "ПассивныйРежим");

	ТаблицаНастройкиПечати = Запрос.Выполнить().Выгрузить();

	АдресПубликации = Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить();
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		СеансЗапущенБезРазделителей = МодульРаботаВМоделиСервиса.СеансЗапущенБезРазделителей();
		Если НЕ СеансЗапущенБезРазделителей Тогда
			ТекущаяОбласть = МодульРаботаВМоделиСервиса.ЗначениеРазделителяСеанса();
			Попытка
				МодульПрограммныйИнтерфейсСервиса = ОбщегоНазначения.ОбщийМодуль("ПрограммныйИнтерфейсСервиса");
				СвойстваПриложения = МодульПрограммныйИнтерфейсСервиса.СвойстваПриложения(ТекущаяОбласть);
				АдресПубликации = СвойстваПриложения.АдресПриложения;
			Исключение
				АдресПубликации = "";
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаНастройкиПечати.Колонки.Добавить("АдресПубликации");
	ТаблицаНастройкиПечати.ЗаполнитьЗначения(АдресПубликации, "АдресПубликации");

	Возврат ТаблицаНастройкиПечати;

КонецФункции

&НаКлиенте
Процедура АрхивироватьФайлыПриИзменении(Элемент)
	
	Если Не АрхивироватьФайлы Тогда
		ПарольАрхива = "";
	КонецЕсли;
	
	НастроитьФорму();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокУРМКПуст()
	
	Схема = Элементы.УРМК.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.УРМК.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки,,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	СписокКассДляНастройки = Результат.НайтиСтроки(Новый Структура("УзелНастроен", Ложь));
	
	Если СписокКассДляНастройки.Количество() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Подключаемый_УстановитьОтборДинамическихСписков()
	
	УстановитьОтборДинамическихСписков("ТорговыйОбъект");

КонецПроцедуры

&НаСервере
Функция ПроверитьИспользованиеНДССверху()
	
	Результат = Неопределено;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УниверсальныеРабочиеМестаКассировКассыККМ.КассаККМ.Владелец КАК Организация
	|ИЗ
	|	Справочник.УниверсальныеРабочиеМестаКассиров.КассыККМ КАК УниверсальныеРабочиеМестаКассировКассыККМ
	|ГДЕ
	|	НЕ УниверсальныеРабочиеМестаКассировКассыККМ.КассаККМ.ПометкаУдаления
	|	И НЕ УниверсальныеРабочиеМестаКассировКассыККМ.Ссылка.ПометкаУдаления
	|	И УниверсальныеРабочиеМестаКассировКассыККМ.Ссылка.ТорговыйОбъект = &ТорговыйОбъект
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	УниверсальныеРабочиеМестаКассировРаспределениеНоменклатуры.КассаККМ.Владелец
	|ИЗ
	|	Справочник.УниверсальныеРабочиеМестаКассиров.РаспределениеНоменклатуры КАК УниверсальныеРабочиеМестаКассировРаспределениеНоменклатуры
	|ГДЕ
	|	НЕ УниверсальныеРабочиеМестаКассировРаспределениеНоменклатуры.КассаККМ.ПометкаУдаления
	|	И НЕ УниверсальныеРабочиеМестаКассировРаспределениеНоменклатуры.Ссылка.ПометкаУдаления
	|	И УниверсальныеРабочиеМестаКассировРаспределениеНоменклатуры.Ссылка.ТорговыйОбъект = &ТорговыйОбъект";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТорговыйОбъект", ТорговыйОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НалогообложениеНДС = НалогиУНФ.НалогообложениеНДС(Выборка.Организация);
		ОрганизацияПлательщикНДС = НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		
		Если ОрганизацияПлательщикНДС И НЕ ВидЦен.ЦенаВключаетНДС Тогда
			
			Результат = СтрШаблон(НСтр("ru = 'Организация ""%1"" является плательщиком НДС.
				|В выбранном виде цен ""%2"" установлен признак учета НДС ""Сверх цены""
				|Измените или укажите вид цен с признаком учета НДС ""Включен в цену"".'"), Выборка.Организация, ВидЦен);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСФизическимиЛицами

&НаКлиенте
Процедура ПодобратьФизическихЛиц(Команда)
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ВыборСпискаФизическихЛиц", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("АдресТаблицыФизическихЛиц", ВернутьАдресВременногоХранилищаТаблицыФизическихЛиц());
	
	ОткрытьФорму("ПланОбмена.ОбменСУРМК.Форма.ФормаПодбораФизическихЛиц", ПараметрыОткрытияФормы, ЭтотОбъект, Новый УникальныйИдентификатор,
		,,ОбработкаОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаСервере
Функция ВернутьАдресВременногоХранилищаТаблицыФизическихЛиц()
	
	Возврат ПоместитьВоВременноеХранилище(СписокФизическихЛицДляВыгрузки.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ВыборСпискаФизическихЛиц(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоЗаписейДо = СписокФизическихЛицДляВыгрузки.Количество();
	ЗагрузитьТаблицуФизическихЛиц(Результат);
	КоличествоЗаписейПосле = СписокФизическихЛицДляВыгрузки.Количество();
	
	Если КоличествоЗаписейДо <> КоличествоЗаписейПосле Тогда
		Модифицированность = Истина;
		СформироватьЗаголовокКомандыПодбора();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуФизическихЛиц(АдресВременногоХранилища)
	
	ТаблицаФизЛиц = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Если ТаблицаФизЛиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписокФизическихЛицДляВыгрузки.Загрузить(ТаблицаФизЛиц);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКоманды()
	
	Элементы.ПодобратьФизическихЛиц.Доступность = ВыгружатьФизическихЛицЧастично;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовокКомандыПодбора()
	КоличествоЗаписей = СписокФизическихЛицДляВыгрузки.Количество();
	Если КоличествоЗаписей = 0 ИЛИ НЕ ВыгружатьФизическихЛицЧастично Тогда
		ЗаголовокКоманды = НСтр("ru = 'Подобрать'");
	Иначе
		ЗаголовокКоманды = СтрШаблон(НСтр("ru = 'Список физических лиц (количество: %1)'"), КоличествоЗаписей);
	КонецЕсли;
	
	Элементы.ПодобратьФизическихЛиц.Заголовок = ЗаголовокКоманды;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьВыгрузкиТоваровПалитры()
	
	Элементы.ВыгружатьТолькоТоварыПалитры.Доступность = Не ВыгружатьЗаказы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаБаннерКомментарийДоступности",
		"Видимость",
		ВыгружатьЗаказы);

КонецПроцедуры

&НаКлиенте
Процедура ПереключательВыгружатьФизЛицПриИзменении(Элемент)
	
	Если ЗначениеПереключателяВыгружатьФизЛиц = 0 Тогда
		ВыгружатьФизическихЛиц = Ложь;
		ВыгружатьФизическихЛицЧастично = Ложь;
		КомментарийПереключателя =
			НСтр("ru = 'Физические лица не выгружаются.
			|Учетные записи кассиров для входа необходимо настроить в 1С:РМК.
			|Выбор продавцов в 1С:РМК возможен только при использовании сервера лояльности.'");
	ИначеЕсли ЗначениеПереключателяВыгружатьФизЛиц = 1 Тогда
		ВыгружатьФизическихЛиц = Истина;
		ВыгружатьФизическихЛицЧастично = Ложь;
		КомментарийПереключателя =
			НСтр("ru = 'Выгружаются все физические лица как кассиры и продавцы.'");
	ИначеЕсли ЗначениеПереключателяВыгружатьФизЛиц = 2 Тогда
		ВыгружатьФизическихЛиц = Ложь;
		ВыгружатьФизическихЛицЧастично = Истина;
		КомментарийПереключателя =
			НСтр("ru = 'Выгружаются только указанные физические лица как кассиры и продавцы.'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаВыгрузкаФизЛиц",
		"Подсказка",
		КомментарийПереключателя);
		
	УстановитьДоступностьКоманды();
	СформироватьЗаголовокКомандыПодбора();
	УстановитьВидимостьЭлементовНастроекПользователей();
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиРабочегоМестаКассира

&НаКлиенте
Процедура УстановитьВидимостьЭлементовНастроекПользователей()
	УстановленаНастройкаВыгрузкиФизЛиц = ВыгружатьФизическихЛиц Или ВыгружатьФизическихЛицЧастично;
	Элементы.ТаблицаНастройкиПользователейФизическоеЛицо.Видимость = УстановленаНастройкаВыгрузкиФизЛиц;
	Если УстановленаНастройкаВыгрузкиФизЛиц Тогда
		МассивТип = Новый Массив;
		МассивТип.Добавить(Тип("СправочникСсылка.Сотрудники"));
		ОписаниеТипа = Новый ОписаниеТипов(МассивТип);
		Элементы.ТаблицаНастройкиПользователейСотрудник.ОграничениеТипа = ОписаниеТипа;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиПоВыбранномуСотруднику(СтруктураСтроки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА Сотрудники.ШтрихКод = """"
	|			ТОГДА Сотрудники.МагнитныйКод
	|		ИНАЧЕ Сотрудники.ШтрихКод
	|	КОНЕЦ КАК КодСотрудника,
	|	ЕСТЬNULL(Пользователи.Ссылка, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОсновнойПользователь
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО Сотрудники.Физлицо = Пользователи.ФизическоеЛицо
	|ГДЕ
	|	Сотрудники.Ссылка = &ВыбранныйСотрудник";
	Запрос.УстановитьПараметр("ВыбранныйСотрудник", СтруктураСтроки.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, Выборка);
			Если Пользователи.РолиДоступны("ПолныеПрава", Выборка.ОсновнойПользователь) Тогда
				СтруктураСтроки.Роль = "Администратор";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастройкиПользователейСотрудникПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаНастройкиПользователей.ТекущиеДанные;
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Сотрудник", ТекущаяСтрока.Сотрудник);
	СтруктураСтроки.Вставить("ФизическоеЛицо", ТекущаяСтрока.ФизическоеЛицо);
	СтруктураСтроки.Вставить("КодСотрудника", ТекущаяСтрока.КодСотрудника);
	СтруктураСтроки.Вставить("ОсновнойПользователь", ТекущаяСтрока.ОсновнойПользователь);
	СтруктураСтроки.Вставить("Роль", "");
	УстановитьНастройкиПоВыбранномуСотруднику(СтруктураСтроки);
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСтроки);
	Если НЕ ТекущаяСтрока.ФизическоеЛицо.Пустая()
		И ВыгружатьФизическихЛицЧастично Тогда
		ДобавитьФизическоеЛицоВСписокКВыгрузке(ТекущаяСтрока.ФизическоеЛицо);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьНастройкиУРМК(АдресХранилищаТаблицаПользователей, АдресФизическихЛиц)
	Если ТаблицаНастройкиПользователей.Количество() > 0 Тогда
		УИДПользователи = Новый УникальныйИдентификатор;
		АдресХранилищаТаблицаПользователей = ПоместитьВоВременноеХранилище(ТаблицаНастройкиПользователей.Выгрузить(), УИДПользователи);
	КонецЕсли;
	Если СписокФизическихЛицДляВыгрузки.Количество() > 0 Тогда
		УИДФизическиеЛица = Новый УникальныйИдентификатор;
		АдресФизическихЛиц = ПоместитьВоВременноеХранилище(СписокФизическихЛицДляВыгрузки.Выгрузить(), УИДФизическиеЛица);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтраницуНастроекПользователей()
	ТаблицаНастройкиПользователей.Очистить();
	СписокФизическихЛицДляВыгрузки.Очистить();
	ВыгружатьФизическихЛиц = Ложь;
	ВыгружатьФизическихЛицЧастично = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоТаблицеНастройкеПользователей()
	
	ОчиститьСтраницуНастроекПользователей();
	СтрокиНастроек = СписокРабочихМестКОбмену.НайтиСтроки(Новый Структура("ПорядковыйНомер", НомерСтраницыНастройкиРМК));
	
	Если СтрокиНастроек.Количество() > 0 Тогда
		
		СтрокаНастройки = СтрокиНастроек[0];
		НастройкаУРМК = СтрокаНастройки.УРМК;
		ЗаполнитьДанныеПоНастройкеПользователей(СтрокаНастройки.АдресХранилищаТаблицаПользователей, СтрокаНастройки.АдресХранилищаФизЛиц);
		ВыгружатьФизическихЛиц = СтрокаНастройки.ВыгружатьФизическихЛиц;
		ВыгружатьФизическихЛицЧастично = СтрокаНастройки.ВыгружатьФизическихЛицЧастично;
		УстановитьВидимостьЭлементовНастроекПользователей();
		СформироватьЗаголовокКомандыПодбора();
		
		ЗначениеПереключателяВыгружатьФизЛиц = 0;
		Если ВыгружатьФизическихЛиц Тогда
			ЗначениеПереключателяВыгружатьФизЛиц = 1;
		ИначеЕсли ВыгружатьФизическихЛицЧастично Тогда
			ЗначениеПереключателяВыгружатьФизЛиц = 2;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоНастройкеПользователей(АдресХранилищаТаблицаПользователей, АдресХранилищаФизЛиц)
	Если НЕ ПустаяСтрока(АдресХранилищаТаблицаПользователей) Тогда
		ТаблицаПользователей = ПолучитьИзВременногоХранилища(АдресХранилищаТаблицаПользователей);
		Если ТаблицаПользователей <> Неопределено Тогда
			ТаблицаНастройкиПользователей.Загрузить(ТаблицаПользователей);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(АдресХранилищаФизЛиц) Тогда
		ТаблицаФизЛиц = ПолучитьИзВременногоХранилища(АдресХранилищаФизЛиц);
		Если ТаблицаФизЛиц <> Неопределено Тогда
			СписокФизическихЛицДляВыгрузки.Загрузить(ТаблицаФизЛиц);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНастроекОбмена()
	
	Схема = Элементы.УРМК.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.УРМК.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки,,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	СтрокиОтбора = Результат.НайтиСтроки(Новый Структура("УзелНастроен", Ложь));
	СписокРабочихМестКОбмену.Очистить();
	НомерСтраницыПП = 0;
	Если НЕ СтрокиОтбора.Количество() = 0 Тогда
		Для Каждого СтрокаМассива Из СтрокиОтбора Цикл
			НомерСтраницыПП = НомерСтраницыПП + 1;
			НоваяСтрока = СписокРабочихМестКОбмену.Добавить();
			НоваяСтрока.УРМК = СтрокаМассива.Ссылка;
			НоваяСтрока.ПорядковыйНомер = НомерСтраницыПП;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФизическоеЛицоВСписокКВыгрузке(ФизическоеЛицо)
	СтрокиПоиска = СписокФизическихЛицДляВыгрузки.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	Если СтрокиПоиска.Количество() = 0 Тогда
		НоваяСтрока = СписокФизическихЛицДляВыгрузки.Добавить();
		НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
		СформироватьЗаголовокКомандыПодбора();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастройкиПользователейФизическоеЛицоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаНастройкиПользователей.ТекущиеДанные;
	Если НЕ ТекущаяСтрока.ФизическоеЛицо.Пустая()
		И ВыгружатьФизическихЛицЧастично Тогда
		ДобавитьФизическоеЛицоВСписокКВыгрузке(ТекущаяСтрока.ФизическоеЛицо);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьПартииКомиссионныхТоваровПриИзменении(Элемент)
	
	Если Не ЗапретКомиссионныхПартийБезВладельца Тогда
		ВыгружатьПартииКомиссионныхТоваров = Ложь;
		ТекстПредупреждения = НСтр("ru = 'Опция настроек программы ""Запрет комиссионных партий без владельца"" не включена. Нельзя выгружать партии номенклатуры без указания комитента.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПредупреждения, , , "ВыгружатьПартииКомиссионныхТоваров");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура FTPПарольНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПолеПароляНачалоВыбора(Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПарольАрхиваНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ПолеПароляНачалоВыбора(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПароляНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Элемент.РежимПароля = Не Элемент.РежимПароля;
	
	Если Элемент.РежимПароля Тогда
		Элемент.КартинкаКнопкиВыбора = БиблиотекаКартинок.ПоказатьПароль;
	Иначе
		Элемент.КартинкаКнопкиВыбора = БиблиотекаКартинок.СкрытьПароль;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

