#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИсторическиеУпаковки = Параметры.ИсторическиеУпаковки;
	Если ЗначениеЗаполнено(Параметры.ИсторическаяУпаковка) Тогда
		ЭлементСписка = ИсторическиеУпаковки.НайтиПоЗначению(Параметры.ИсторическаяУпаковка);
		Если ЭлементСписка <> Неопределено Тогда
			Элементы.ИсторическиеУпаковки.ТекущаяСтрока = ЭлементСписка.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсторическиеУпаковки
 
&НаКлиенте
Процедура ИсторическиеУпаковкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ОбработкаВыбораЗначенияСписка(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.ИсторическиеУпаковки.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбработкаВыбораЗначенияСписка(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаВыбораЗначенияСписка(ВыбраннаяСтрока)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("ДанныеФормыСтруктура")
		Или ТипЗнч(ВыбраннаяСтрока) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		ДанныеСтроки = ВыбраннаяСтрока;
	Иначе
		ДанныеСтроки = Элементы.ИсторическиеУпаковки.ДанныеСтроки(ВыбраннаяСтрока);
	КонецЕсли;
	
	ОповеститьОВыборе(ДанныеСтроки.Значение);
	
КонецПроцедуры

#КонецОбласти