#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЭтоАдресВременногоХранилища(Параметры.Результат) Тогда
		Результат.Вывести(ПолучитьИзВременногоХранилища(Параметры.Результат));
	КонецЕсли;
	Заголовок = Параметры.Заголовок;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

КонецПроцедуры

#КонецОбласти