
#Область ПрограммныйИнтерфейс

#Область СобытияФормы

Процедура ПриСозданииНаСервере(Форма, ИмяГруппыРазмещения = "", СписокКонтекстноеМеню = Неопределено, ДобавлятьОтдельнуюКолонкуТипаКИ = Ложь) Экспорт
	
	ПроверитьСоздатьРеквизитыПанели(Форма, ИмяГруппыРазмещения, СписокКонтекстноеМеню, ДобавлятьОтдельнуюКолонкуТипаКИ);
	УстановитьУсловноеОформление(Форма);
	Форма.ИспользуетсяРаботаССобытиями = ПолучитьФункциональнуюОпцию("ИспользоватьСобытия");
	
	Если Форма.ЕстьТаблицаДанныеПанелиКонтактнойИнформации
		И Форма.ДанныеПанелиКонтактнойИнформации.Количество() = 0 Тогда
		ДанныеПанели = ДанныеПанелиКонтактнойИнформации(Неопределено);
		ЗаполнитьДанныеПанелиКИ(Форма, ДанныеПанели);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЧтенииНаСервере(Форма, Контрагент, ИмяГруппыРазмещения = "", СписокКонтекстноеМеню = Неопределено) Экспорт
	
	ПроверитьСоздатьРеквизитыПанели(Форма, ИмяГруппыРазмещения, СписокКонтекстноеМеню);
	ОбновитьДанныеПанели(Форма, Контрагент);
	
КонецПроцедуры

#КонецОбласти

Процедура ОбновитьДанныеПанели(Форма, ВладелецКИ) Экспорт
	
	Если НЕ Форма.ЕстьТаблицаДанныеПанелиКонтактнойИнформации Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПанели = ДанныеПанелиКонтактнойИнформации(ВладелецКИ);
	ЗаполнитьДанныеПанелиКИ(Форма, ДанныеПанели);
	
КонецПроцедуры

// Данные владельца контактной информации для дальнейшего заполнения панели.
// См. КонтактнаяИнформацияПанельУНФКлиент.ЗаполнитьДанныеПанелиКИ()
//
// Параметры:
//  ВладелецКИ - ОпределяемыйТип.ВладелецКонтактнойИнформации
// 
// Возвращаемое значение:
//   - Массив
//
Функция ДанныеПанелиКонтактнойИнформации(ВладелецКИ) Экспорт
	
	ДанныеПанелиКонтактнойИнформации = Новый Массив;
	
	Если ВладелецКИ = Неопределено Тогда
		ДобавитьСообщениеОбОтсутствииДанных(ДанныеПанелиКонтактнойИнформации);
		Возврат ДанныеПанелиКонтактнойИнформации;
	КонецЕсли;
	
	МодульМенеджераВладельцаКИ = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ВладелецКИ);
	МодульМенеджераВладельцаКИ.ЗаполнитьДанныеПанелиКонтактнаяИнформация(ВладелецКИ, ДанныеПанелиКонтактнойИнформации);
	
	Если ДанныеПанелиКонтактнойИнформации.Количество() = 0 Тогда
		ДобавитьСообщениеОбОтсутствииДанных(ДанныеПанелиКонтактнойИнформации);
	КонецЕсли;
	
	Возврат ДанныеПанелиКонтактнойИнформации;
	
КонецФункции

Функция ИндексПиктограммыПоТипу(ТипКИ) Экспорт
	
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		ИндексКартинки = 5;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		ИндексКартинки = 1;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
		ИндексКартинки = 3;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Skype Тогда
		ИндексКартинки = 5;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
		ИндексКартинки = 4;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ИндексКартинки = 5;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
		ИндексКартинки = 0;
	Иначе
		ИндексКартинки = 4;
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьРеквизитФормы(Реквизиты, Имя)
	
	Для каждого Реквизит Из Реквизиты Цикл
		Если Реквизит.Имя = Имя Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьКомандаФормы(Команды, Имя)
	
	Для каждого Команда Из Команды Цикл
		Если Команда.Имя = Имя Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПроверитьСоздатьРеквизитыПанели(Форма, ИмяГруппыРазмещения, СписокКонтекстноеМеню, ДобавлятьОтдельнуюКолонкуТипаКИ = Ложь)
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент()
		И СписокКонтекстноеМеню <> Неопределено
		И НЕ ЕстьКомандаФормы(Форма.Команды, "СписокПоказатьКонтактнуюИнформациюТекущегоОбъекта") Тогда
		
		СоздатьКонтекстнуюКомандуПросмотраКИ(Форма, СписокКонтекстноеМеню);
	КонецЕсли;
	
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	
	Если ЕстьРеквизитФормы(РеквизитыФормы, "ЕстьТаблицаДанныеПанелиКонтактнойИнформации") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЕстьТаблицаДанныеПанелиКонтактнойИнформации", Новый ОписаниеТипов("Булево")));
	Если НЕ ЕстьРеквизитФормы(РеквизитыФормы, "ИспользуетсяРаботаССобытиями") Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользуетсяРаботаССобытиями", Новый ОписаниеТипов("Булево")));
	КонецЕсли;
	Если НЕ ЕстьРеквизитФормы(РеквизитыФормы, "КИ_НужноИзменитьДанныеПриАктивизацииСтрокиТаблицы") Тогда
		ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("КИ_НужноИзменитьДанныеПриАктивизацииСтрокиТаблицы", Новый ОписаниеТипов("Булево")));
	КонецЕсли;
 	Если НЕ ЕстьРеквизитФормы(РеквизитыФормы, "ПараметрыКИ") Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПараметрыКИ", Новый ОписаниеТипов()));
	КонецЕсли;
	
	НужноСоздатьТаблицуФормы = НЕ (ОбщегоНазначения.ЭтоМобильныйКлиент() И СписокКонтекстноеМеню <> Неопределено);
	
	Если НужноСоздатьТаблицуФормы Тогда
		// Создадим таблицу значений
		ИмяТаблицы = "ДанныеПанелиКонтактнойИнформации";
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Отображение", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИндексПиктограммы", Новый ОписаниеТипов("Число"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТипОтображаемыхДанных", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВладелецКИ", Новый ОписаниеТипов("СправочникСсылка.Контрагенты, СправочникСсылка.КонтактныеЛица, СправочникСсылка.Лиды,СправочникСсылка.КонтактыЛидов, Строка"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Родитель", Новый ОписаниеТипов("СправочникСсылка.Контрагенты, СправочникСсылка.КонтактныеЛица, СправочникСсылка.Лиды,СправочникСсылка.КонтактыЛидов"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПредставлениеКИ", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500)), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТипКИ", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СписокПодразделенийГоловногоКонтрагента", Новый ОписаниеТипов("СписокЗначений"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПолеСортировки", Новый ОписаниеТипов("Число"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЭтоСсылка", Новый ОписаниеТипов("Булево"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОтображениеТипаКИ", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)), ИмяТаблицы));				
	КонецЕсли;
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если НужноСоздатьТаблицуФормы Тогда
		СоздатьЭлементТаблицаФормы(Форма, ИмяТаблицы, ИмяГруппыРазмещения,, ДобавлятьОтдельнуюКолонкуТипаКИ)
 	КонецЕсли;
	
	Попытка
    	Форма.ПараметрыКИ = КонтактнаяИнформацияУНФВызовСервера.ПолучитьПараметрыКонтактнойИнформацииНаСервере();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(НСтр("ru='Ошибка получения параметров контактной информации'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказПокупателя, , ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьЭлементТаблицаФормы(Форма, ИмяТаблицы, ИмяГруппыРазмещения, ПутьКДанным = "", ДобавлятьОтдельнуюКолонкуТипаКИ = Ложь) Экспорт
	
	// Создадим элементы
	ТаблицаФормы = Форма.Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), Форма.Элементы[ИмяГруппыРазмещения]);
	Если ПутьКДанным = "" Тогда
		ТаблицаФормы.ПутьКДанным = ИмяТаблицы;
	Иначе     
		ТаблицаФормы.ПутьКДанным = ПутьКДанным;  
	КонецЕсли;
	ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ТаблицаФормы.ИзменятьСоставСтрок = Ложь;
	ТаблицаФормы.ИзменятьПорядокСтрок = Ложь;
	ТаблицаФормы.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
	ТаблицаФормы.ТолькоПросмотр = Истина;
	ТаблицаФормы.РежимВыделенияСтроки = РежимВыделенияСтрокиТаблицы.Строка;
	ТаблицаФормы.Шапка = Ложь;
	ТаблицаФормы.АвтоВводНовойСтроки = Ложь;
	ТаблицаФормы.РазрешитьНачалоПеретаскивания = Ложь;
	ТаблицаФормы.РазрешитьПеретаскивание = Ложь;
	ТаблицаФормы.ГоризонтальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
	ТаблицаФормы.ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
	ТаблицаФормы.ГоризонтальныеЛинии = Ложь;
	ТаблицаФормы.ВертикальныеЛинии = Ложь;
	ТаблицаФормы.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
	ТаблицаФормы.РастягиватьПоГоризонтали = Истина;
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() И ПутьКДанным = "" Тогда
		ТаблицаФормы.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтрокиТаблицы.ОтображениеВыделения;
	КонецЕсли;
	ТаблицаФормы.УстановитьДействие("Выбор",				"Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор");
	ТаблицаФормы.УстановитьДействие("ПриАктивизацииСтроки",	"Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки");
	
	Если ДобавлятьОтдельнуюКолонкуТипаКИ = Истина Тогда      	
		ОтображениеТипаКИ = Форма.Элементы.Добавить(ИмяТаблицы + "ОтображениеТипаКИ", Тип("ПолеФормы"), ТаблицаФормы);
		Если ПутьКДанным = "" Тогда
			ОтображениеТипаКИ.ПутьКДанным = ИмяТаблицы + ".ОтображениеТипаКИ";
		Иначе
			ОтображениеТипаКИ.ПутьКДанным = ПутьКДанным + ".ОтображениеТипаКИ";  
		КонецЕсли;
		ОтображениеТипаКИ.Вид = ВидПоляФормы.ПолеНадписи;
		ОтображениеТипаКИ.РежимРедактирования = РежимРедактированияКолонки.Вход;
		ОтображениеТипаКИ.АвтоВысотаЯчейки = Истина;
		ОтображениеТипаКИ.АвтоШиринаВТаблице = АвтоширинаВТаблице.Нет;
		Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
			ОтображениеТипаКИ.Ширина = 9;
		Иначе
			ОтображениеТипаКИ.Ширина = 8;
		КонецЕсли; 
		ТаблицаФормы.РежимВыделенияСтроки = РежимВыделенияСтрокиТаблицы.Ячейка;
	КонецЕсли;
	
	Отображение = Форма.Элементы.Добавить(ИмяТаблицы + "Отображение", Тип("ПолеФормы"), ТаблицаФормы);
	Если ПутьКДанным = "" Тогда
		Отображение.ПутьКДанным = ИмяТаблицы + ".Отображение";
	Иначе
		Отображение.ПутьКДанным = ПутьКДанным + ".Отображение";  
	КонецЕсли;
	Отображение.Вид = ВидПоляФормы.ПолеНадписи;
	Отображение.РежимРедактирования = РежимРедактированияКолонки.Вход;
	Отображение.АвтоВысотаЯчейки = Истина;
	Отображение.АвтоШиринаВТаблице = АвтоширинаВТаблице.Нет;
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Отображение.Ширина = 34;
	Иначе
		Отображение.Ширина = 32;
	КонецЕсли; 
	
	Если ДобавлятьОтдельнуюКолонкуТипаКИ = Истина Тогда      	
		Отображение.Ширина = 25;
	КонецЕсли; 
	
	Пиктограмма = Форма.Элементы.Добавить(ИмяТаблицы + "Пиктограмма", Тип("ПолеФормы"), ТаблицаФормы);
	Если ПутьКДанным = "" Тогда
		Пиктограмма.ПутьКДанным = ИмяТаблицы + ".ИндексПиктограммы";
	Иначе
		Пиктограмма.ПутьКДанным = ПутьКДанным + ".ИндексПиктограммы";
	КонецЕсли;
	Пиктограмма.Вид = ВидПоляФормы.ПолеКартинки;
	Пиктограмма.КартинкаЗначений = БиблиотекаКартинок.КоллекцияДействияКонтактнаяИнформация;
	Пиктограмма.АвтоВысотаЯчейки = Истина;
	Пиктограмма.ГиперссылкаЯчейки = Истина;
	Пиктограмма.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	Пиктограмма.АвтоширинаВТаблице = АвтоширинаВТаблице.Нет;
	Пиктограмма.РастягиватьПоГоризонтали = Ложь;
	Пиктограмма.РастягиватьПоВертикали = Ложь;
	
	КартинкаГоловного = Форма.Элементы.Добавить(ИмяТаблицы + "КартинкаГоловного", Тип("ПолеФормы"), ТаблицаФормы);
	Если ПутьКДанным = "" Тогда
		КартинкаГоловного.ПутьКДанным = ИмяТаблицы + ".ИндексПиктограммы";      
	Иначе
		КартинкаГоловного.ПутьКДанным = ПутьКДанным + ".ИндексПиктограммы";
	КонецЕсли;
	КартинкаГоловного.Вид = ВидПоляФормы.ПолеКартинки;
	КартинкаГоловного.КартинкаЗначений = БиблиотекаКартинок.ИерархияГоловнойСписок;
	КартинкаГоловного.АвтоВысотаЯчейки = Истина;
	КартинкаГоловного.ГиперссылкаЯчейки = Истина;
	КартинкаГоловного.АвтоширинаВТаблице = АвтоширинаВТаблице.Нет;
	КартинкаГоловного.РастягиватьПоГоризонтали = Ложь;
	КартинкаГоловного.РастягиватьПоВертикали = Ложь;
	Если ПутьКДанным = "" Тогда
		ДобавитьКомандуКонтекстногоМеню(
		Форма,
		"КонтекстноеМенюПанелиКартаЯндекс",
		НСтр("ru = 'Адрес на Яндекс.Картах'"),
		НСтр("ru = 'Показывает адрес на картах Яндекс.Карты'"),
		ТаблицаФормы.КонтекстноеМеню,
		БиблиотекаКартинок.ЯндексКарты);
		
		ДобавитьКомандуКонтекстногоМеню(
		Форма,
		"КонтекстноеМенюПанелиКартаGoogle",
		НСтр("ru = 'Адрес на Google Maps'"),
		НСтр("ru = 'Показывает адрес на карте Google Maps'"),
		ТаблицаФормы.КонтекстноеМеню,
		БиблиотекаКартинок.GoogleMaps);
	КонецЕсли;
	
	Форма.ЕстьТаблицаДанныеПанелиКонтактнойИнформации = Истина;
	
КонецПроцедуры     

Процедура СоздатьКонтекстнуюКомандуПросмотраКИ(Форма, СписокКонтекстноеМеню)
	
	ДобавитьКомандуКонтекстногоМеню(
		Форма,
		"СписокПоказатьКонтактнуюИнформациюТекущегоОбъекта",
		НСтр("ru = 'Показать контактную информацию'"),
		"",
		Форма.Элементы[СписокКонтекстноеМеню]);
	
КонецПроцедуры

Процедура  УстановитьУсловноеОформление(Форма, Индекс = "", ВыделятьКонтакты = Ложь) Экспорт
	
	Если НЕ Форма.ЕстьТаблицаДанныеПанелиКонтактнойИнформации Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Значение контактной информации - обычный стиль, контактные лица - выделяем
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	//Оформление.Значение 		= ЦветаСтиля.ЦветТекстаПравойПанелиОтборов;
	Оформление.Значение 		= ЦветаПалитры.Серый100УНФ;
	Оформление.Использование 	= Истина;
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("Шрифт");
	Оформление.Значение 		= ШрифтыСтиля.ШрифтПравойПанелиОтборов;
	Оформление.Использование 	= Истина;
	
	// Выделение фона приводит к некорректному цвету шрифта
	//Если ВыделятьКонтакты = Истина Тогда
	//	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветФона");
	//	Оформление.Значение 		= ЦветаПалитры.ЦветФонаКарточкиАссистентаТаксиУНФ;
	//	Оформление.Использование 	= Истина;
	//КонецЕсли;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДанныеПанелиКонтактнойИнформации.ТипОтображаемыхДанных");
	ЗначенияОтбора = Новый СписокЗначений;
	ЗначенияОтбора.Добавить("КонтактноеЛицо","КонтактноеЛицо");
	ЗначенияОтбора.Добавить("ГоловнойКонтрагент","ГоловнойКонтрагент");
	Отбор.ПравоеЗначение 	= ЗначенияОтбора;
	
	ОформляемоеПоле = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле			= Новый ПолеКомпоновкиДанных("ДанныеПанелиКонтактнойИнформации" + Индекс + "Отображение");
	ОформляемоеПоле.Использование	= Истина;
	Если ВыделятьКонтакты = Истина Тогда
		ОформляемоеПоле = НовоеУсловноеОформление.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле			= Новый ПолеКомпоновкиДанных("ДанныеПанелиКонтактнойИнформации" + Индекс + "Пиктограмма");
		ОформляемоеПоле.Использование	= Истина;
	КонецЕсли;
	
	// 2. Не отображать картинку головного контрагента для строк
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("Видимость");
	Оформление.Значение 		= Ложь;
	Оформление.Использование 	= Истина;
		
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.НеРавно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДанныеПанелиКонтактнойИнформации.ТипОтображаемыхДанных");
	Отбор.ПравоеЗначение 	= "ГоловнойКонтрагент";
	
	ОформляемоеПоле = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле			= Новый ПолеКомпоновкиДанных("ДанныеПанелиКонтактнойИнформации" + Индекс + "КартинкаГоловного");
	ОформляемоеПоле.Использование	= Истина;
	
	// 3. Не отображать иконку КИ для головного контрагента
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("Видимость");
	Оформление.Значение 		= Ложь;
	Оформление.Использование 	= Истина;
		
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДанныеПанелиКонтактнойИнформации.ТипОтображаемыхДанных");
	Отбор.ПравоеЗначение 	= "ГоловнойКонтрагент";
	
	ОформляемоеПоле = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле			= Новый ПолеКомпоновкиДанных("ДанныеПанелиКонтактнойИнформации" + Индекс + "Пиктограмма"); 
	ОформляемоеПоле.Использование	= Истина;
		
КонецПроцедуры

Процедура ДобавитьСообщениеОбОтсутствииДанных(ДанныеПанелиКонтактнойИнформации)
	
	НоваяСтрока = Новый Структура;
	НоваяСтрока.Вставить("Отображение", НСтр("ru='<Нет контактных данных>'"));
	НоваяСтрока.Вставить("ИндексПиктограммы", -1);
	НоваяСтрока.Вставить("ТипОтображаемыхДанных", "НетДанных");
	НоваяСтрока.Вставить("ВладелецКИ", Неопределено);
	ДанныеПанелиКонтактнойИнформации.Добавить(НоваяСтрока);
	
КонецПроцедуры

Процедура ДобавитьКомандуКонтекстногоМеню(Форма, ИмяКоманды, Заголовок, Подсказка, Родитель, Картинка = Неопределено)
	
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		Команда = Форма.Команды.Добавить(ИмяКоманды);
		Команда.Заголовок = Заголовок;
		Команда.Подсказка = Подсказка;
		Команда.Действие = "Подключаемый_ДанныеПанелиКонтактнойИнформацииВыполнитьКоманду";
		Если Картинка <> Неопределено Тогда
			Команда.Картинка = Картинка;
		КонецЕсли;
	КонецЕсли;
	
	Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Родитель);
	Кнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПанелиКИ(Форма, ДанныеПанели) Экспорт
	
	Форма.ДанныеПанелиКонтактнойИнформации.Очистить();
	
	Для каждого Строка Из ДанныеПанели Цикл
		НоваяСтрока = Форма.ДанныеПанелиКонтактнойИнформации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
