
#Область ПрограммныйИнтерфейс

// Обработчик события ПослеЗаписи формы документа.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа
//  РежимЗаписи - РежимЗаписиДокумента - режим записи документа
//
Процедура ПослеЗаписиФормаОбъекта(Форма, РежимЗаписи) Экспорт
	
	ИспользуетсяОбратнаяСвязь = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,
		"ОбратнаяСвязь_ЭтоНовыйОбъект");
		
	Если Не ИспользуетсяОбратнаяСвязь Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	Если Форма.ОбратнаяСвязь_ЭтоНовыйОбъект И РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Форма.ОбратнаяСвязь_ПроведеноДокументовПользователем >= Форма.ОбратнаяСвязь_ПроведенийНовыхДляОпроса Тогда
		Оповестить("ОбратнаяСвязь_Проведение_ПриходнаяНакладная", , Объект.Ссылка);
		Форма.ОбратнаяСвязь_ЭтоНовыйОбъект = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет, разрешена ли отправка обратной связи для формы и события
//
// Параметры:
//  ИмяФормы - Строка - имя формы, для которой проверяется разрешение отправки обратной связи
//  ИмяСобытия - Строка - имя события, для которого проверяется разрешение отправки обратной связи
//  ПолучатьРазрешениеОтСервиса - Булево - обращаться в сервис за разрешением на вывод опроса
//
// Возвращаемое значение:
//  Булево - Истина, если отправка обратной связи разрешена, Ложь в противном случае
//
Функция ОтправкаОбратнойСвязиРазрешена(ИмяФормы, ИмяСобытия, ПолучатьРазрешениеОтСервиса = Ложь) Экспорт
	
	Результат = ОбратнаяСвязьВызовСервера.ОтправкаОбратнойСвязиРазрешена(ИмяФормы, ИмяСобытия,
		ПолучатьРазрешениеОтСервиса);
	Возврат Результат;
	
КонецФункции

// Обрабатывает оповещение о показе панели обратной связи
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, для которой обрабатывается оповещение
//  ИмяСобытия - Строка - имя события, для которого обрабатывается оповещение
//
Процедура ОбработатьОповещениеПоказатьПанельОбратнойСвязи(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	ОбратнаяСвязьДоступна = ОтправкаОбратнойСвязиРазрешена(Имяформы, "Проведение", Истина);
	
	Если Не ОбратнаяСвязьДоступна Тогда
		Возврат;
	КонецЕсли;
	
	ОбратнаяСвязьКлиентСервер.УстановитьВидимостьПанелиОбратнойСвязи(Форма);
	
КонецПроцедуры

// Оповещает пользователя об отправке обратной связи
//
// Параметры:
//  ЗаголовокСообщения - Строка - заголовок сообщения
//  ТекстСообщения - Строка - текст сообщения
//
Процедура ОповеститьПользователяОбОтправке(ЗаголовокСообщения = "", ТекстСообщения = "") Экспорт
	
	Если ПустаяСтрока(ЗаголовокСообщения) Тогда
		СтрокаЗаголовка = НСтр("ru = 'Отправка обратной связи'");
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		СтрокаТекста = НСтр("ru = 'Сообщение отправлено. Спасибо за обратную связь!'");
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(СтрокаЗаголовка, , СтрокаТекста, ,
		СтатусОповещенияПользователя.Информация);
		
КонецПроцедуры

// Отправляет обратную связь
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, из которой отправляется обратная связь
//  Событие - Строка - событие, по которому отправляется обратная связь
//
Процедура ОтправитьОбратнуюСвязь(Форма, Событие) Экспорт
	
	Элементы = Форма.Элементы;
	ИмяФормы = Форма.ИмяФормы;
	
	ИдентификаторОпроса = Форма.ОбратнаяСвязь_ИдентификаторОпроса;
	
	ДанныеДляОтправки = ДанныеДляОтправки();
	ДанныеДляОтправки.ПолноеИмяформы = ИмяФормы;
	ДанныеДляОтправки.Событие = Событие;
	ДанныеДляОтправки.Вопрос = Форма.ОбратнаяСвязь_ТекстВопроса;
	ДанныеДляОтправки.Оценка = Форма.ОбратнаяСвязь_Оценка;
	ДанныеДляОтправки.Пояснение = Форма.ОбратнаяСвязь_Пояснение;
	ДанныеДляОтправки.ИдентификаторОпроса = ИдентификаторОпроса;
	
	ОбратнаяСвязьВызовСервера.ОтправитьОбратнуюСвязь(ДанныеДляОтправки);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбратнаяСвязь", "Видимость", Ложь);
	ОповеститьПользователяОбОтправке();
	
КонецПроцедуры

// Конструктор параметров отправки обратной связи
// 
// Возвращаемое значение:
//  Структура - параметры отправки обратной связи:
//   * ПолноеИмяФормы - Строка - полное имя формы
//   * Событие - Строка - событие, по которому отправляется обратная связь
//   * Вопрос - Строка - текст вопроса
//   * Оценка - Число - оценка
//   * Пояснение - Строка - пояснение
//   * ИдентификаторОпроса - Строка - идентификатор опроса
//
Функция ДанныеДляОтправки() Экспорт
	
	ДанныеДляОтправки = Новый Структура;
	ДанныеДляОтправки.Вставить("ПолноеИмяФормы", "");
	ДанныеДляОтправки.Вставить("Событие", "");
	ДанныеДляОтправки.Вставить("Вопрос", "");
	ДанныеДляОтправки.Вставить("Оценка", 0);
	ДанныеДляОтправки.Вставить("Пояснение", "");
	ДанныеДляОтправки.Вставить("ИдентификаторОпроса", "");
	
	Возврат ДанныеДляОтправки;
	
КонецФункции

// Сохраняет настройку опроса
//
// Параметры:
//  ИмяФормы - Строка - имя формы, из которой сохраняется настройка
//  Событие - Строка - событие, по которому сохраняется настройка
//  Значение - Булево - значение настройки
//  ИдентификаторОпроса - Строка - идентификатор опроса
//
Процедура СохранитьНастройкуОпроса(ИмяФормы, Событие, Значение, ИдентификаторОпроса) Экспорт
	
	ОбратнаяСвязьВызовСервера.СохранитьНастройкуОпроса(ИмяФормы, Событие, Значение, ИдентификаторОпроса);
	
КонецПроцедуры

// Обновляет доступность кнопки отправки обратной связи
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой находится обратная связь
//  ТекстПояснения - Строка - текст в поле пояснения оценки
//
Процедура ОбновитьДоступностьОтправить(Форма, Знач ТекстПояснения = "") Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Не ПустаяСтрока(ТекстПояснения) Тогда
		Пояснение = ТекстПояснения;
	Иначе
		Пояснение = Форма.ОбратнаяСвязь_Пояснение;
	КонецЕсли;
	
	ОтправитьДоступность = Форма.ОбратнаяСвязь_Оценка <> 0 Или Не ПустаяСтрока(Пояснение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбратнаяСвязь_Отправить", "Доступность",
		ОтправитьДоступность);
	
КонецПроцедуры

// Снимает флаг выполнения условий опроса. Флаг будет взведен снова при следующем выполнении регламентного задания
// Параметры:
//  ИмяПользователя - Строка
//
Процедура ОпросНачалоРаботыОтложить(ИмяПользователя = "") Экспорт

	ОбратнаяСвязьВызовСервера.ОпросНачалоРаботыОтложить(ИмяПользователя);

КонецПроцедуры

#Область ОпытНачалоРаботы

// Выполняет общие действия при вызове команды БольшеНеПоказывать
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ОбратнаяСвязьБольшеНеПоказывать(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	ИмяГруппыОбратнойСвязи = ОбратнаяСвязьКлиентСервер.ИмяГруппыОбратнойСвязи();
	ИмяРеквизитаИдентификаторОпроса = "ОбратнаяСвязь_ИдентификаторОпроса";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяГруппыОбратнойСвязи, "Видимость", Ложь);
	СохранитьНастройкуОпроса("ВсеФормы", "НачалоРаботы", Истина, Форма[ИмяРеквизитаИдентификаторОпроса]);
	
КонецПроцедуры

// Выполняет общие действия при вызове команды Отложить
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ОбратнаяСвязьОтложить(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	ОпросНачалоРаботыОтложить();
	ИмяГруппыОбратнойСвязи = ОбратнаяСвязьКлиентСервер.ИмяГруппыОбратнойСвязи();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяГруппыОбратнойСвязи, "Видимость", Ложь);
		
КонецПроцедуры

#КонецОбласти


#КонецОбласти
