
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("КонтактнаяИнформация") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.КонтактнаяИнформация);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	Email = ЭлектроннаяПочтаКонтактногоЛица(КонтактноеЛицо);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОчиститьСообщения();
	Отказ = Ложь;
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Email) 
		И Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Email) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес электронной почты введен неверно'"),, "Email");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(КонтактнаяИнформация());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция КонтактнаяИнформация()
	КонтактнаяИнформация = Новый Структура;
	КонтактнаяИнформация.Вставить("КонтактноеЛицо", "");
	КонтактнаяИнформация.Вставить("Должность", "");
	КонтактнаяИнформация.Вставить("Email", "");
	ЗаполнитьЗначенияСвойств(КонтактнаяИнформация, ЭтотОбъект);
	Возврат КонтактнаяИнформация;
КонецФункции

&НаСервереБезКонтекста
Функция ЭлектроннаяПочтаКонтактногоЛица(Знач КонтактноеЛицо)
	Контакты = РаботаСНоменклатуройСлужебный.ОписаниеКонтактнойИнформацииПользователя();
	РаботаСНоменклатуройПереопределяемый.ПолучитьКонтактнуюИнформациюПользователя(КонтактноеЛицо, Контакты);
	Возврат Контакты.ЭлектроннаяПочта;
КонецФункции

#КонецОбласти