
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	ВывестиБаннеры();
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкаПроцессов") Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПроцессы;
	КонецЕсли;
	
	Если Параметры.Свойство("Страница")
		И НЕ ПустаяСтрока(Параметры.Страница)
		И НЕ Элементы.Найти(Параметры.Страница) = Неопределено Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы[Параметры.Страница];
	КонецЕсли;
	
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	ПриСозданииПриЧтенииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбработкаОповещенияНаСервере(ИмяСобытия, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОбновитьСостояния();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ВидыЗаказовПокупателей", Объект.Ссылка, ЭтотОбъект);
	ОбновитьПроцессы();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьДанныеПроцессов(ТекущийОбъект);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокСостояний.Ссылка КАК Ссылка,
	|	ПорядокСостояний.НомерСтроки КАК НомерСтроки,
	|	ПорядокСостояний.Состояние КАК Состояние,
	|	СостоянияЗаказовПокупателей.ПометкаУдаления КАК ПометкаУдаления,
	|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
	|	СостоянияЗаказовПокупателей.Цвет КАК Цвет,
	|	СостоянияЗаказовПокупателей.Предопределенный КАК Предопределенный,
	|	СостоянияЗаказовПокупателей.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ПорядокСостояний
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
	|		ПО ПорядокСостояний.Состояние = СостоянияЗаказовПокупателей.Ссылка
	|ГДЕ ПорядокСостояний.Ссылка = &ВидЗаказа";
	
	Запрос.УстановитьПараметр("ВидЗаказа", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Состояние Из Результат Цикл
		
		СостояниеВТаблице = Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", Состояние.Состояние));
		
		Для Каждого НайденноеСостояние Из СостояниеВТаблице Цикл
			
			Если Состояние.Цвет.Получить() <> Неопределено Тогда
				НайденноеСостояние.Цвет = Состояние.Цвет.Получить();
			КонецЕсли;
			
			НайденноеСостояние.ПометкаУдаления = Состояние.ПометкаУдаления;
			НайденноеСостояние.НаименованиеСостояния = Состояние.Наименование;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьДоставкуПриИзменении(Элемент)
	
	Объект.НеИспользоватьДоставку = Не ВключитьДоставку;
	Модифицированность = Истина;
	
	Если Объект.НеИспользоватьДоставку Тогда
		Объект.СостояниеОжидаетОтгрузки = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка");
		Объект.СостояниеОтгружен = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка");
		Объект.СостояниеДоставлен = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка");
	КонецЕсли;
	
	УстановитьФлагиМаршрутныеЛисты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПорядокСостояний

&НаКлиенте
Процедура ПорядокСостоянийПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьКоманд(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПриНаведении(Элемент, Строка, Поле)
	
	Если Строка = Неопределено Тогда
		Если ТипЗнч(Элемент.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Возврат;
		КонецЕсли;
		ДанныеСтроки = Элемент.ТекущиеДанные;
	ИначеЕсли ТипЗнч(Строка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	Иначе
		ДанныеСтроки = Объект.ПорядокСостояний.НайтиПоИдентификатору(Строка);
	КонецЕсли;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьКоманд(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элемент.ТекущиеДанные <> Неопределено
		И Элемент.ТекущиеДанные.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен")
		И Копирование Тогда
		Отказ = Истина;
		Возврат
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Или Не ЗначениеЗаполнено(ТекДанные.Состояние) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыделенныхСостояний = ДанныеВыделенныхСостояний();
	Для Каждого ДанныеСостояния Из ДанныеВыделенныхСостояний Цикл
		
		Если ДанныеСостояния.Состояние = Объект.СостояниеЗаявки Тогда
			ПредупреждениеОбИспользованииЗаявокДляСостояния(ДанныеСостояния.НаименованиеСостояния);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	ОтветОтСервера = ПорядокСостоянийПередУдалениемНаСервере();
	Если ОтветОтСервера.ЕстьЗаявки Тогда
		ПредупреждениеОбИспользованииЗаявокДляСостояния(ОтветОтСервера.ПредставлениеСостояния);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ЗапрещеноИзменениеПорядка = Ложь;
	
	СтрокаПорядкаСостояний = Объект.ПорядокСостояний.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
	Если СтрокаПорядкаСостояний <> Неопределено
		И СтрокаПорядкаСостояний.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен") Тогда
		
		ЗапрещеноИзменениеПорядка = Истина;
	КонецЕсли;
	
	Если Не ЗапрещеноИзменениеПорядка И Строка <> Неопределено Тогда
		СтрокаПорядкаСостояний = Объект.ПорядокСостояний.НайтиПоИдентификатору(Строка);
		Если СтрокаПорядкаСостояний <> Неопределено
			И СтрокаПорядкаСостояний.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен") Тогда
			
			ЗапрещеноИзменениеПорядка = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗапрещеноИзменениеПорядка Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийСостояниеОткрытие(Элемент, СтандартнаяОбработка)
	ТекущееСостояние = Элементы.ПорядокСостояний.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущееСостояние.Состояние) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,ТекущееСостояние.Состояние);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПослеУдаления(Элемент)
	
	ДобавитьСостояниеЗавершен();
	ОбновитьПроцессы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийСостояниеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ПорядокСостояний.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Состояние) Тогда
		ПараметрыПолученияДанных.Вставить("ТекущееНаименование", ТекущаяСтрока.НаименованиеСостояния);
	КонецЕсли;
	
	ПараметрыПолученияДанных.Вставить("ОбъектПолученияДанных", "СостоянияЗаказовПокупателей");
	РаботаСВидамиЗаказовКлиент.СостояниеАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПорядокСостоянийСостояниеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ОбработатьИзменениеСостоянияВТаблице(ВыбранноеЗначение, Элемент.ТекстРедактирования, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийСостояниеОчистка(Элемент, СтандартнаяОбработка)
	
	ОбработатьИзменениеСостоянияВТаблице("", "", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийЦветСостояниеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	РаботаСВидамиЗаказовКлиент.НачалоВыбораЦветаИзПорядкаСостояний(ЭтаФорма, "Цвет", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокСостоянийПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийСостояниеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ОтображатьСостоянияЗаявок");
	ОткрытьФорму("Справочник.СостоянияЗаказовПокупателей.Форма.ФормаСписка",ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		
		ТекущаяСтрокаСостояния = Элементы.ПорядокСостояний.ТекущиеДанные;
		ИндексТекущейСтроки = Объект.ПорядокСостояний.Индекс(ТекущаяСтрокаСостояния);
		
		Если ИндексТекущейСтроки = Объект.ПорядокСостояний.Количество() - 1 Тогда
			Объект.ПорядокСостояний.Сдвинуть(ИндексТекущейСтроки, -1);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийСостояниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПорядокСостояний.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка") Тогда
		ТекущиеДанные.Изменено = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПроцессы

&НаКлиенте
Процедура ПроцессыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент <> Элементы.ПроцессыНастройкаАссистента Или ТолькоПросмотрЗадач Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Процессы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗадачи", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторГруппы", ДанныеСтроки.ИдентификаторГруппыАссистента);
	ОткрытьФорму(ДанныеСтроки.ИмяФормыЗадачиАссистента, ПараметрыФормы, , , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцессыПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущаяСтрока = Элемент.ТекущаяСтрока;
	Если ТекущиеДанные = Неопределено Или ТекущаяКолонка = Неопределено Или ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлемента = ТекущаяКолонка.Имя;
	Если Не СтрНачинаетсяС(ИмяЭлемента, "ПроцессыИспользуетсяДляСостояния_") Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = Сред(ИмяЭлемента, СтрДлина("ПроцессыИспользуетсяДляСостояния_") + 1);
	Если ИмяЭлемента = Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно.Имя Тогда
		ЗначениеФлага = ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенУспешно;
	ИначеЕсли ИмяЭлемента = Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенОтменен.Имя Тогда
		ЗначениеФлага = ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенОтменен;
	Иначе
		ЗначениеФлага = ТекущиеДанные[ИмяРеквизитаКолонкиСостояния(, ИдентификаторСтроки, ЭтотОбъект)];
	КонецЕсли;
	
	Если ТекущиеДанные.ТипНастройки = "СостояниеОжидаетОтгрузки"
		Или ТекущиеДанные.ТипНастройки = "СостояниеОтгружен"
		Или ТекущиеДанные.ТипНастройки = "СостояниеДоставлен" Тогда
		
		ОбработатьИзменениеФлагаМаршрутныхЛистов(ТекущиеДанные, ИдентификаторСтроки, ЗначениеФлага);
		
	ИначеЕсли ТекущиеДанные.ТипНастройки = "ОбязательноЗаполнятьПолеПричинаОтменыТовара" Тогда
		
		ОбработатьИзменениеФлагаОбязательноЗаполнитьПричинуОтмены(ИмяЭлемента, ТекущаяСтрока, ЗначениеФлага);
		
	ИначеЕсли ТекущиеДанные.ТипНастройки = "ХранитьИсториюИзменений" Тогда
		
		ОбработатьИзменениеФлагаИсторияИзменений(ТекущиеДанные, ЗначениеФлага);
		
	ИначеЕсли ТекущиеДанные.ТипНастройки = "ЗапрещатьИзменениеДанныхПрошлыхПериодов" Тогда
		
		ОбработатьИзменениеФлагаДатыЗапретаИзменений(ИмяЭлемента, ТекущиеДанные);
		
	ИначеЕсли ТекущиеДанные.ТипНастройки = "ЗапрещатьЗавершениеНеотгруженныхЗаказов" Тогда
		
		ОбработатьИзменениеФлагаЗапретЗавершения();
		
	ИначеЕсли ТекущиеДанные.ТипНастройки = "Заявка" Тогда
		
		ОбработатьИзменениеФлагаЗаявки(ИмяЭлемента, ИдентификаторСтроки, ТекущаяСтрока, ЗначениеФлага);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВсе(Команда)
	
	ДобавитьВсеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	ПереместитьСтрокуТЧ(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	ПереместитьСтрокуТЧ(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеСостояние(Команда)
	
	РаботаСВидамиЗаказовКлиент.ПометитьНаУдалениеСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийИзменить(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
	Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПорядокСостояний

&НаСервере
Процедура ПорядокСостоянийПриИзмененииНаСервере()
	
	СдвинутьСостояниеЗавершен();
	ОбновитьПроцессы();
	УстановитьЦветНовыхСостоянийПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветНовыхСостоянийПоУмолчанию()
	
	ЦветаИзменены = Ложь;
	Для Каждого ДанныеСостояния Из Объект.ПорядокСостояний Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеСостояния.Состояние) И ДанныеСостояния.Цвет = ЧерныйЦвет Тогда
			
			ДанныеСостояния.Цвет = ЦветаПалитры.Серый;
			ЦветаИзменены = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЦветаИзменены Тогда
		УстановитьУсловноеОформлениеСостоянийВЦвет();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СдвинутьСостояниеЗавершен()
	
	СтрокиТЧ = Объект.ПорядокСостояний.НайтиСтроки(
	Новый Структура("Состояние", Справочники.СостоянияЗаказовПокупателей.Завершен));
	Если СтрокиТЧ.Количество() = 0 Тогда
		
		ДанныеСостояния = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Справочники.СостоянияЗаказовПокупателей.Завершен, "Представление,Цвет");
		
		СтрокаТЧ = Объект.ПорядокСостояний.Добавить();
		СтрокаТЧ.Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен;
		СтрокаТЧ.НаименованиеСостояния = ДанныеСостояния.Представление;
		СтрокаТЧ.Цвет = ДанныеСостояния.Цвет;
		Возврат;
		
	КонецЕсли;
	
	ИндексСтроки = Объект.ПорядокСостояний.Индекс(СтрокиТЧ[0]);
	Объект.ПорядокСостояний.Сдвинуть(ИндексСтроки, Объект.ПорядокСостояний.Количество() - ИндексСтроки - 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСостоянияВТаблице(ВыбранноеЗначение, ТекстРедактирования, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПорядокСостояний.ТекущиеДанные;
	ИндексСостояния = Объект.ПорядокСостояний.Индекс(ТекущиеДанные);
	
	Если Не Объект.Ссылка.Пустая() И ЗначениеЗаполнено(ТекущиеДанные.Состояние) Тогда
		
		Если ТекущиеДанные.Состояние = Объект.СостояниеЗаявки Тогда
			
			ПредупреждениеОбИспользованииЗаявокДляСостояния(ТекущиеДанные.НаименованиеСостояния);
			СтандартнаяОбработка = Ложь;
			Возврат;
			
		КонецЕсли;
		
		НомерСостоянияЗаявки = НомерСостояния(Объект.ПорядокСостояний, Объект.СостояниеЗаявки);
		Если ИндексСостояния + 1 <= НомерСостоянияЗаявки Тогда
			
			ЕстьЗаявки = ЕстьЗаявкиВСостоянии(Объект.Ссылка, ТекущиеДанные.Состояние);
			Если ЕстьЗаявки Тогда
				
				ПредупреждениеОбИспользованииЗаявокДляСостояния(ТекущиеДанные.НаименованиеСостояния);
				СтандартнаяОбработка = Ложь;
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьДанныеСостояния(ВыбранноеЗначение, ТекстРедактирования, ИндексСостояния, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		Элементы.ПорядокСостояний.ЗакончитьРедактированиеСтроки(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НомерСостояния(ПорядокСостояний, Состояние)
	
	Если Не ЗначениеЗаполнено(Состояние) Тогда
		Возврат 0;
	КонецЕсли;
	
	Список = ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", Состояние));
	Если Список.Количество() Тогда
		Возврат Список[0].НомерСтроки;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ПорядокСостоянийПередУдалениемНаСервере()
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьЗаявки", Ложь);
	Результат.Вставить("ПредставлениеСостояния", "");
	
	Состояния = Новый Массив;
	ДанныеВыделенныхСостояний = ДанныеВыделенныхСостоянийНаСервере();
	Для Каждого ДанныеСостояния Из ДанныеВыделенныхСостояний Цикл
		Состояния.Добавить(ДанныеСостояния.Состояние);
	КонецЦикла;
	
	НаличиеЗаявок = РаботаСЗаявками.НаличиеЗаказовПоСостояниям(Объект.Ссылка, Состояния, Истина);
	Для Каждого КлючЗначение Из НаличиеЗаявок Цикл
		Если КлючЗначение.Значение.ЕстьЗаказ Тогда
			Результат.ЕстьЗаявки = Истина;
			Результат.ПредставлениеСостояния = КлючЗначение.Значение.Представление;
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДанныеВыделенныхСостояний()
	
	Результат = Новый Массив;
	
	Для Каждого Идентификатор Из Элементы.ПорядокСостояний.ПолучитьСтрокиДляОбработки() Цикл
		ДанныеСостояния = Объект.ПорядокСостояний.НайтиПоИдентификатору(Идентификатор);
		Результат.Добавить(ДанныеСостояния);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДанныеВыделенныхСостоянийНаСервере()
	
	Результат = Новый Массив;
	
	Для Каждого Идентификатор Из Элементы.ПорядокСостояний.ПолучитьСтрокиДляОбработки() Цикл
		ДанныеСостояния = Объект.ПорядокСостояний.НайтиПоИдентификатору(Идентификатор);
		Результат.Добавить(ДанныеСостояния);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ДобавитьСостояниеЗавершен()
	
	Если Объект.ПорядокСостояний.Количество() = 0 Тогда
		НоваяСтрока = Объект.ПорядокСостояний.Добавить();
		ОбновитьДанныеСостояния(Справочники.СостоянияЗаказовПокупателей.Завершен, "", 0, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВсеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
		|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА СостоянияЗаказовПокупателей.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Порядок,
		|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
		|ИЗ
		|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
		|ГДЕ
		|	СостоянияЗаказовПокупателей.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	СостоянияЗаказовПокупателей.Наименование";
	
	Состояния = Запрос.Выполнить().Выгрузить();
	
	ИндексСостояния = 0;
	Для Каждого ДанныеСостояния Из Состояния Цикл
		
		СостояниеУжеВТаблице = Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", ДанныеСостояния.Состояние));
		Если СостояниеУжеВТаблице.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовоеСостояние = Объект.ПорядокСостояний.Вставить(ИндексСостояния);
		ИндексСостояния = ИндексСостояния + 1;
		НовоеСостояние.Состояние = ДанныеСостояния.Состояние;
		НовоеСостояние.НаименованиеСостояния = ДанныеСостояния.Наименование;
		НовоеСостояние.Цвет = ДанныеСостояния.Цвет.Получить();
		
	КонецЦикла;
	
	УстановитьУсловноеОформлениеСостоянийВЦвет();
	ОбновитьПроцессы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьСтрокуТЧ(Смещение)
	
	ТекущиеДанные = Элементы.ПорядокСостояний.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПорядка = Объект.ПорядокСостояний.НайтиПоИдентификатору(Элементы.ПорядокСостояний.ТекущаяСтрока);
	Если СтрокаПорядка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаПорядка.НомерСтроки + Смещение = 0
		Или СтрокаПорядка.НомерСтроки + Смещение > Объект.ПорядокСостояний.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если Смещение > 0
		И Объект.ПорядокСостояний[СтрокаПорядка.НомерСтроки+Смещение-1].Состояние = 
		ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен")Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПорядокСостояний.Сдвинуть(СтрокаПорядка.НомерСтроки-1, Смещение);
	УстановитьДоступностьКоманд(ТекущиеДанные);
	ОбновитьПроцессы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКоманд(ДанныеСтроки)
	
	ЭтоПоследнееСостояние = Объект.ПорядокСостояний.Индекс(ДанныеСтроки) = Объект.ПорядокСостояний.Количество() - 1;
	СостояниеЗаполнено = ЗначениеЗаполнено(ДанныеСтроки.Состояние);
	ЭтоЗавершен = (ДанныеСтроки.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен"));
	
	Элементы.ПорядокСостоянийПереместитьВниз.Доступность = Не ЭтоПоследнееСостояние;
	Элементы.ПорядокСостоянийПереместитьВверх.Доступность = Не ЭтоЗавершен;
	Элементы.ПорядокСостоянийКонтекстноеМенюПометитьНаУдаление.Доступность = Не ЭтоЗавершен И СостояниеЗаполнено;
	Элементы.ПорядокСостоянийКонтекстноеМенюУдалить.Доступность = Не (ЭтоЗавершен И ЭтоПоследнееСостояние);
	Элементы.ПорядокСостоянийПометитьНаУдаление.Доступность = Не ЭтоЗавершен И СостояниеЗаполнено;
	Элементы.ПорядокСостоянийУдалить.Доступность = Не (ЭтоЗавершен И ЭтоПоследнееСостояние);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеСостояния(Ссылка, ТекстРедактирования, ИндексСостояния, СтандартнаяОбработка) 
	
	Если Ссылка = Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка() Тогда
		Объект.ПорядокСостояний[ИндексСостояния].НаименованиеСостояния = ТекстРедактирования;
		Объект.ПорядокСостояний[ИндексСостояния].Изменено = Истина;
		Объект.ПорядокСостояний[ИндексСостояния].Состояние = Ссылка;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
		
	ДанныеСостояния = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Ссылка, Наименование, ПометкаУдаления, Цвет");
	
	Если ДанныеСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПорядокСостояний[ИндексСостояния].Состояние = ДанныеСостояния.Ссылка;
	Объект.ПорядокСостояний[ИндексСостояния].ПометкаУдаления = ДанныеСостояния.ПометкаУдаления;
	Если ДанныеСостояния.Цвет <> Неопределено Тогда
		Объект.ПорядокСостояний[ИндексСостояния].Цвет = ДанныеСостояния.Цвет.Получить();
	КонецЕсли;
	
	Объект.ПорядокСостояний[ИндексСостояния].НаименованиеСостояния = ДанныеСостояния.Наименование;
	УстановитьУсловноеОформлениеСостоянийВЦвет();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСостоянийВЦвет()
	
	УдаляемыеЭлементы = Новый Массив;
	
	Для Каждого ЭлементУсловногоОформления Из УсловноеОформление.Элементы Цикл
		Если ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "ЦветСостояния" Тогда
			УдаляемыеЭлементы.Добавить(ЭлементУсловногоОформления);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементУсловногоОформления Из УдаляемыеЭлементы Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементУсловногоОформления);
	КонецЦикла;
	
	Если ЭтоИнтерфейсТакси Тогда
		СтильОформления = "ЦветТекста";
	Иначе
		СтильОформления = "ЦветОтметки";
	КонецЕсли;
	
	Для Каждого Состояние Из Объект.ПорядокСостояний Цикл
		
		ЦветСостояния = Состояние.Цвет;
		Если ТипЗнч(ЦветСостояния) <> Тип("Цвет") Тогда
			Если ЭтоИнтерфейсТакси Тогда
				Продолжить;
			Иначе
				ЦветСостояния = ЦветаПалитры.Серый;
			КонецЕсли;
		КонецЕсли;
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(СтильОформления, ЦветСостояния);
		ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "ЦветСостояния";
		ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементУсловногоОформления.Представление = НСтр("ru='Оформление в цвет состояния'");
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПорядокСостояний.НаименованиеСостояния");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Состояние.НаименованиеСостояния;
		
		Если ЭтоИнтерфейсТакси Тогда
			ОформляемоеПолеКД = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПолеКД.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПорядокСостоянийНомерСтроки.Имя);
			ОформляемоеПолеКД.Использование = Истина;
			ОформляемоеПолеКД = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПолеКД.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПорядокСостоянийСостояние.Имя);
			ОформляемоеПолеКД.Использование = Истина;
		КонецЕсли;
		ОформляемоеПолеКД = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПолеКД.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПорядокСостоянийЦветСостояния.Имя);
		ОформляемоеПолеКД.Использование = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораЦветаИзПорядкаСостоянийФрагмент(Цвет, СвойствоЦвета) Экспорт
	
	Если Цвет <> Неопределено И Цвет <> КодВозвратаДиалога.Отмена Тогда
		
		ДанныеТекущейСтроки = Элементы.ПорядокСостояний.ТекущиеДанные;
		Если ДанныеТекущейСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИндексСостояния = Объект.ПорядокСостояний.Индекс(ДанныеТекущейСтроки);
		ДанныеТекущейСтроки[СвойствоЦвета] = Цвет;
		ДанныеТекущейСтроки.Изменено = Истина;
		Модифицированность = Истина;
		УстановитьУсловноеОформлениеСостоянийВЦвет();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Процессы

#Область ОбновлениеПроцессов

&НаСервере
Процедура ОбновитьПроцессы()
	
	ОбновитьРеквизитыСостоянийПроцессов();
	ОбновитьЭлементыСостоянийПроцессов();
	ЗаполнитьСтатическийКонтентПроцессов();
	УстановитьУсловноеОформлениеНаПроцессы();
	УстановитьФлагиПроцессов();
	
	Элементы.Процессы.ТекущаяСтрока = Процессы[1].ПолучитьИдентификатор();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыСостоянийПроцессов()
	
	ПоляТаблицы = ПолучитьРеквизиты("Процессы");
	
	ПутиУдаляемыхРеквизитов = Новый Массив;
	Для Каждого ПолеТаблицы Из ПоляТаблицы Цикл
		
		Имя = ПолеТаблицы.Имя;
		
		Если Имя <> "ЗаголовокНастройки"
			И Имя <> "ЭтоГруппа"
			И Имя <> "ИспользуетсяДляСостояния_ЗавершенУспешно"
			И Имя <> "ИспользуетсяДляСостояния_ЗавершенОтменен"
			И Имя <> "ТипНастройки"
			И Имя <> "НастройкаАссистента"
			И Имя <> "ИдентификаторГруппыАссистента"
			И Имя <> "ИмяФормыЗадачиАссистента" Тогда
			
			ПутиУдаляемыхРеквизитов.Добавить(СтрШаблон("%1.%2", ПолеТаблицы.Путь, Имя));
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого ДанныеСостояния Из Объект.ПорядокСостояний Цикл
		
		Если ДанныеСостояния.Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен Тогда
			Продолжить;
		КонецЕсли;
		
		НовоеПоле = Новый РеквизитФормы(
		"ИспользуетсяДляСостояния_" + ДанныеСостояния.НомерСтроки,
		Новый ОписаниеТипов("Булево"),
		"Процессы",
		ДанныеСостояния.НаименованиеСостояния);
		
		ДобавляемыеРеквизиты.Добавить(НовоеПоле);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, ПутиУдаляемыхРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыСостоянийПроцессов()
	
	ЭлементыНаУдаление = Новый Массив;
	Для Каждого КолонкаТаблицы Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		
		Имя = КолонкаТаблицы.Имя;
		
		Если Имя <> Элементы.ГруппаЗаголовков.Имя
			И Имя <> Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно.Имя
			И Имя <> Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенОтменен.Имя Тогда
			
			ЭлементыНаУдаление.Добавить(КолонкаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	Для Каждого КолонкаТаблицы Из ЭлементыНаУдаление Цикл
		Элементы.Удалить(КолонкаТаблицы);
	КонецЦикла;
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого ДанныеСостояния Из Объект.ПорядокСостояний Цикл
		
		Если ДанныеСостояния.Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = "ИспользуетсяДляСостояния_" + ДанныеСостояния.НомерСтроки;
		
		КолонкаТаблицы = Элементы.Добавить("Процессы" + ПутьКДанным, Тип("ПолеФормы"), Элементы.Процессы);
		КолонкаТаблицы.Вид = ВидПоляФормы.ПолеФлажка;
		КолонкаТаблицы.ПутьКДанным = СтрШаблон("Процессы.%1", ПутьКДанным);
		
		Элементы.Переместить(КолонкаТаблицы, Элементы.Процессы, Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатическийКонтентПроцессов()
	
	Процессы.Очистить();
	
	Если ЗаявкиДоступны Тогда
		
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ЭтоГруппа = Истина;
		СтрокаТЗ.ТипНастройки = "РежимЗаказа";
		СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Режим заказа'");
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ТипНастройки = "Заявка";
		СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Заявка'");
		
	КонецЕсли;
	
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ЭтоГруппа = Истина;
	СтрокаТЗ.ТипНастройки = "КорректировкаЗаказа";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Корректировка заказа'");
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ОбязательноЗаполнятьПолеПричинаОтменыТовара";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Обязательно заполнять поле ""Причина отмены товара""'");
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ЗапрещатьЗавершениеНеотгруженныхЗаказов";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Запрещать завершение неотгруженных заказов'");
	
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ЭтоГруппа = Истина;
	СтрокаТЗ.ТипНастройки = "ОбщиеНастройкиДляВсехВидовЗаказа";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Общие настройки (для всех видов заказа)'");
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ЗапрещатьИзменениеДанныхПрошлыхПериодов";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Запрещать изменение данных прошлых периодов'");
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ХранитьИсториюИзменений";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Хранить историю изменений (заказ покупателя, заказ-наряд)'");
	
	Если ИспользоватьМаршрутныеЛисты Тогда
		
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ЭтоГруппа = Истина;
		СтрокаТЗ.ТипНастройки = "МаршрутныеЛисты";
		СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Маршрутные листы'");
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ТипНастройки = "СостояниеОжидаетОтгрузки";
		СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Состояние ожидает отгрузки'");
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ТипНастройки = "СостояниеОтгружен";
		СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Состояние отгружен'");
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ТипНастройки = "СостояниеДоставлен";
		СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Состояние доставлен'");
		
	КонецЕсли;
	
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ЭтоГруппа = Истина;
	СтрокаТЗ.ТипНастройки = "ДашаОтправьОповещение";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Даша, отправь оповещение'");
	Если ОтображатьЗадачиCRM Тогда
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ТипНастройки = "ДашаОповестиКлиента";
		СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'Оповести клиента'");
		СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ОповещениеКлиентаОбИзмененииСостоянияЗаказа";
		СтрокаТЗ.ИдентификаторГруппыАссистента = "ОповещениеКлиентаОбИзмененииСостоянияЗаказа";
	КонецЕсли;
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ДашаОповестиСотрудника";
	СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'Оповести сотрудника'");
	СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ОповещениеПользователяОбИзмененииСостоянияЗП";
	СтрокаТЗ.ИдентификаторГруппыАссистента = "ОповещениеПользователяОбИзмененииСостоянияЗаказаПокупателя";
	
	Если ОтображатьЗадачиПоставщиков Или ОтображатьЗадачиПроизводства Тогда
		
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ЭтоГруппа = Истина;
		СтрокаТЗ.ТипНастройки = "ДашаИзмениСостояниеЗаказов";
		СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Даша, измени состояние связанных заказов'");
		
		Если ОтображатьЗадачиПоставщиков Тогда
			
			СтрокаТЗ = Процессы.Добавить();
			СтрокаТЗ.ТипНастройки = "ДашаИзмениСостояниеЗаказаПоставщику";
			СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'Измени состояние заказа поставщику'");
			СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПоСостояниюСвязанныхЗаказов";
			СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПоставщикуПоСостояниюЗаказовПокупателей";
			
		КонецЕсли;
		
		Если ОтображатьЗадачиПроизводства Тогда
			
			СтрокаТЗ = Процессы.Добавить();
			СтрокаТЗ.ТипНастройки = "ДашаИзмениСостояниеЗаказаНаПроизводство";
			СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'Измени состояние заказа на производство'");
			СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ДействияСЗаказомНаПроизводствоПоСостояниюСвязанныхЗаказов";
			СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаНаПроизводствоПоСостояниюЗаказовПокупателей";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОтображатьЗадачиCRM Тогда
		
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ЭтоГруппа = Истина;
		СтрокаТЗ.ТипНастройки = "ДашаПереведиЗаказВСостояние";
		СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Даша, переведи заказ в состояние'");
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ТипНастройки = "ДашаПриИзмененииСтатусаОплаты";
		СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'При изменении статуса оплаты'");
		СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ИзменениеСостоянияЗаказаПриОплате";
		СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПриОплате";
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ТипНастройки = "ДашаПриИзмененииСтатусаОтгрузки";
		СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'При изменении статуса отгрузки'");
		СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ИзменениеСостоянияЗаказаПриОтгрузке";
		СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПриОтгрузке";
		СтрокаТЗ = Процессы.Добавить();
		СтрокаТЗ.ТипНастройки = "ДашаПриИзмененииСтатусаОплатыИОтгрузки";
		СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'При изменении статуса оплаты и отгрузки'");
		СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ИзменениеСостоянияЗаказаПриОплатеИОтгрузке";
		СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПриОплатеИОтгрузке";
		
		Если ОтображатьЗадачиПоставщиков Тогда
			
			СтрокаТЗ = Процессы.Добавить();
			СтрокаТЗ.ТипНастройки = "ДашаПриИзмененииСостоянияЗаказаПоставщику";
			СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'При изменении состояния заказа поставщику'");
			СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов";
			СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовПоставщикам";
			
		КонецЕсли;
		
		Если ОтображатьЗадачиПроизводства Тогда
			
			СтрокаТЗ = Процессы.Добавить();
			СтрокаТЗ.ТипНастройки = "ДашаПриИзмененииСостоянияЗаказаНаПроизводство";
			СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'При изменении состояния заказа на производство'");
			СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов";
			СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовНаПроизводство";
			
		КонецЕсли;
		
		Если ОтображатьЗадачиПоставщиков И ОтображатьЗадачиПроизводства Тогда
			
			СтрокаТЗ = Процессы.Добавить();
			СтрокаТЗ.ТипНастройки = "ДашаПриИзмененииСостоянияЗаказаПоставщикаИЗаказаНаПроизводство";
			СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'При изменении состояния заказа поставщика и заказа на производство'");
			СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов";
			СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовПоставщикамИНаПроизводство";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНаПроцессы()
	
	УстановитьУсловноеОформлениеГруппПроцессов();
	УстановитьУсловноеОформлениеНастроекАссистента();
	УстановитьУсловноеОформлениеКорректировкиЗаказов();
	УстановитьУсловноеОбщихНастроекЗаказов();
	УстановитьУсловноеОформлениеМаршрутныхЛистов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеГруппПроцессов()
	
	Если ЭтоИнтерфейсТакси Тогда
		ШрифтГруппы = Новый Шрифт(,,Истина);
	Иначе
		ШрифтГруппы = ШрифтыСтиля.ЗаголовокТретьегоУровня;
	КонецЕсли;
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.ЭтоГруппа", Истина, ВидСравненияКомпоновкиДанных.Равно);
	ОформляемыеПоля = Новый Массив;
	Для Каждого ПолеТаблицы Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		ОформляемыеПоля.Добавить(ПолеТаблицы.Имя);
	КонецЦикла;
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.ЭтоГруппа", Истина, ВидСравненияКомпоновкиДанных.Равно);
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ПроцессыЗаголовокНастройки.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Шрифт", ШрифтГруппы);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветФона", ЦветаПалитры.Серый);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНастроекАссистента()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.НастройкаАссистента", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ПроцессыНастройкаАссистента.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.НастройкаАссистента", , ВидСравненияКомпоновкиДанных.Заполнено);
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ПроцессыЗаголовокНастройки.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.НастройкаАссистента", , ВидСравненияКомпоновкиДанных.Заполнено);
	ОформляемыеПоля = Новый Массив;
	Для Каждого ПолеТаблицы Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		ОформляемыеПоля.Добавить(ПолеТаблицы.Имя);
	КонецЦикла;
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеКорректировкиЗаказов()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.ТипНастройки", "ЗапрещатьЗавершениеНеотгруженныхЗаказов", ВидСравненияКомпоновкиДанных.Равно);
	ОформляемыеПоля = Новый Массив;
	Для Каждого ПолеТаблицы Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		Если ПолеТаблицы.Имя <> Элементы.ПроцессыЗаголовокНастройки.Имя
			И ПолеТаблицы.Имя <> Элементы.ПроцессыНастройкаАссистента.Имя
			И ПолеТаблицы.Имя <> Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно.Имя
			И ПолеТаблицы.Имя <> Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенОтменен.Имя Тогда
			ОформляемыеПоля.Добавить(ПолеТаблицы.Имя);
		КонецЕсли;
	КонецЦикла;
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОбщихНастроекЗаказов()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.ТипНастройки", "ХранитьИсториюИзменений", ВидСравненияКомпоновкиДанных.Равно);
	ОформляемыеПоля = Новый Массив;
	ИндексПоля = 0;
	Для Каждого ПолеТаблицы Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		Если ПолеТаблицы.Имя <> Элементы.ПроцессыЗаголовокНастройки.Имя
			И ПолеТаблицы.Имя <> Элементы.ПроцессыНастройкаАссистента.Имя
			И ИндексПоля <> 1 Тогда
			ОформляемыеПоля.Добавить(ПолеТаблицы.Имя);
		КонецЕсли;
		ИндексПоля = ИндексПоля + 1;
	КонецЦикла;
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеМаршрутныхЛистов()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "ВключитьДоставку", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	
	ГруппаОтбора = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	ГруппаОтбора, "Процессы.ТипНастройки", "СостояниеОжидаетОтгрузки", ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	ГруппаОтбора, "Процессы.ТипНастройки", "СостояниеОтгружен", ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	ГруппаОтбора, "Процессы.ТипНастройки", "СостояниеДоставлен", ВидСравненияКомпоновкиДанных.Равно);
	
	ОформляемыеПоля = Новый Массив;
	Для Каждого ПолеТаблицы Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		Если ПолеТаблицы.Имя <> Элементы.ПроцессыЗаголовокНастройки.Имя
			И ПолеТаблицы.Имя <> Элементы.ПроцессыНастройкаАссистента.Имя Тогда
			ОформляемыеПоля.Добавить(ПолеТаблицы.Имя);
		КонецЕсли;
	КонецЦикла;
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "ВключитьДоставку", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	
	ГруппаОтбора = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	ГруппаОтбора, "Процессы.ТипНастройки", "СостояниеОжидаетОтгрузки", ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	ГруппаОтбора, "Процессы.ТипНастройки", "СостояниеОтгружен", ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	ГруппаОтбора, "Процессы.ТипНастройки", "СостояниеДоставлен", ВидСравненияКомпоновкиДанных.Равно);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ПроцессыЗаголовокНастройки.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Серый);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеФлаговПроцессов

Процедура УстановитьФлагиПроцессов()
	
	Если НЕ ИспользоватьПроцессы Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПорядокСостояний.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьФлагиАссистентУправления();
	УстановитьФлагиМаршрутныеЛисты();
	УстановитьФлагиВерсионирования();
	УстановитьФлагиДатыЗапретаИзменений();
	УстановитьФлагиОбязательноеЗаполнениеПричины();
	УстановитьФлагиЗапретЗавершения();
	УстановитьФлагиСостояниеЗаявки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиАссистентУправления(ИдентификаторГруппы = Неопределено)
	
	ОтборПоГруппе = Ложь;
	Если ИдентификаторГруппы = Неопределено Тогда
		ОтборПоГруппе = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачиАссистента.Ссылка КАК Ссылка,
	|	ЗадачиАссистента.Родитель.ИдентификаторГруппы КАК ИдентификаторГруппы,
	|	ЗадачиАссистента.Используется КАК Используется
	|ПОМЕСТИТЬ ИспользуемыеЗадачиАссистента
	|ИЗ
	|	Справочник.ЗадачиАссистентаУправления КАК ЗадачиАссистента
	|ГДЕ
	|	(&ОтборПоГруппе
	|			ИЛИ ЗадачиАссистента.Родитель.ИдентификаторГруппы = &ИдентификаторГруппы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИспользуемыеЗадачиАссистента.ИдентификаторГруппы КАК ИдентификаторГруппы,
	|	ИспользуемыеЗадачиАссистента.Используется КАК Используется,
	|	ЗначениеЗаполнения.Ссылка КАК Ссылка,
	|	ЗначениеЗаполнения.Параметр КАК Параметр,
	|	ЗначениеЗаполнения.Значение КАК Значение
	|ИЗ
	|	ИспользуемыеЗадачиАссистента КАК ИспользуемыеЗадачиАссистента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиАссистентаУправления.ЗначенияЗаполнения КАК ЗначениеЗаполнения
	|		ПО (ЗначениеЗаполнения.Ссылка = ИспользуемыеЗадачиАссистента.Ссылка)
	|ГДЕ
	|	(ЗначениеЗаполнения.Параметр = ""СостояниеЗаказа""
	|			ИЛИ ЗначениеЗаполнения.Параметр = ""СостояниеЗаказаПокупателя""
	|			ИЛИ ЗначениеЗаполнения.Параметр = ""ВариантЗавершения""
	|			ИЛИ ЗначениеЗаполнения.Параметр = ""ВариантЗавершенияЗаказаПокупателя"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИспользуемыеЗадачиАссистента.ИдентификаторГруппы,
	|	ИспользуемыеЗадачиАссистента.Используется,
	|	ПараметрыУсловияЗадач.Ссылка,
	|	ПараметрыУсловияЗадач.Параметр,
	|	ПараметрыУсловияЗадач.Значение
	|ИЗ
	|	ИспользуемыеЗадачиАссистента КАК ИспользуемыеЗадачиАссистента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиАссистентаУправления.ПараметрыУсловия КАК ПараметрыУсловияЗадач
	|		ПО (ПараметрыУсловияЗадач.Ссылка = ИспользуемыеЗадачиАссистента.Ссылка)
	|ГДЕ
	|	(ПараметрыУсловияЗадач.Параметр = ""СостояниеЗаказа""
	|			ИЛИ ПараметрыУсловияЗадач.Параметр = ""СостояниеЗаказаПокупателя""
	|			ИЛИ ПараметрыУсловияЗадач.Параметр = ""ВариантЗавершения""
	|			ИЛИ ПараметрыУсловияЗадач.Параметр = ""ВариантЗавершенияЗаказаПокупателя"")";
	Запрос.УстановитьПараметр("ОтборПоГруппе", ОтборПоГруппе);
	Запрос.УстановитьПараметр("ИдентификаторГруппы", ИдентификаторГруппы);
	
	ТаблицаЗадач = Запрос.Выполнить().Выгрузить();
	ТаблицаЗадач.Колонки.Добавить("Состояние", Новый ОписаниеТипов("СправочникСсылка.СостоянияЗаказовПокупателей, ПеречислениеСсылка.ВариантыЗавершенияЗаказа"));
	
	Для Каждого Строка Из ТаблицаЗадач Цикл
		
		СостояниеЗаказа = Строка.Значение.Получить();
		Строка.Состояние = СостояниеЗаказа;
		
		ДействияЗадачи = Процессы.НайтиСтроки(Новый Структура("ИдентификаторГруппыАссистента", Строка.ИдентификаторГруппы));
		Если ДействияЗадачи.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьФлагиДействий(ДействияЗадачи, Ложь, ЭтотОбъект);
		
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаЗадач Цикл
		
		ДействияЗадачи = Процессы.НайтиСтроки(Новый Структура("ИдентификаторГруппыАссистента", Строка.ИдентификаторГруппы));
		Если ДействияЗадачи.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДействиеЗадачи = ДействияЗадачи[0];
		
		Если СтрНайти(Строка.Параметр, "СостояниеЗаказа") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен Тогда
			
			ВариантЗавершенияУспешно = ТаблицаЗадач.НайтиСтроки(Новый Структура("Ссылка, Состояние", Строка.Ссылка, Перечисления.ВариантыЗавершенияЗаказа.Успешно));
			ВариантЗавершенияОтменен = ТаблицаЗадач.НайтиСтроки(Новый Структура("Ссылка, Состояние", Строка.Ссылка, Перечисления.ВариантыЗавершенияЗаказа.Отменен));
			
			Если ВариантЗавершенияУспешно.Количество() = 0 И ВариантЗавершенияОтменен.Количество() = 0 Тогда
				ДействиеЗадачи.ИспользуетсяДляСостояния_ЗавершенУспешно = Строка.Используется;
				Продолжить;
			КонецЕсли;
			
			Если ВариантЗавершенияУспешно.Количество() <> 0 Тогда
				ДействиеЗадачи.ИспользуетсяДляСостояния_ЗавершенУспешно = Строка.Используется;
			КонецЕсли;
			
			Если ВариантЗавершенияОтменен.Количество() <> 0 Тогда
				ДействиеЗадачи.ИспользуетсяДляСостояния_ЗавершенОтменен = Строка.Используется;
			КонецЕсли;
			
		Иначе
			
			УстановитьФлагПоСостоянию(ДействиеЗадачи, Строка.Используется, Строка.Состояние, ЭтотОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиМаршрутныеЛисты()
	
	Если Не ИспользоватьМаршрутныеЛисты Тогда
		Возврат;
	КонецЕсли;
	
	ДействиеОжидаетОтгрузки = ДействиеПоТипуНастройки("СостояниеОжидаетОтгрузки", ЭтотОбъект);
	ДействиеОтгружен = ДействиеПоТипуНастройки("СостояниеОтгружен", ЭтотОбъект);
	ДействиеДоставлен = ДействиеПоТипуНастройки("СостояниеДоставлен", ЭтотОбъект);
	
	ВсеДействия = Новый Массив;
	ВсеДействия.Добавить(ДействиеОжидаетОтгрузки);
	ВсеДействия.Добавить(ДействиеОтгружен);
	ВсеДействия.Добавить(ДействиеДоставлен);
	УстановитьФлагиДействий(ВсеДействия, Ложь, ЭтотОбъект);
	
	Если НЕ ИспользоватьМаршрутныеЛисты Тогда
		Возврат;
	КонецЕсли;
	
	ВключитьДоставку = Не Объект.НеИспользоватьДоставку;
	
	Если Объект.НеИспользоватьДоставку Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеСостояния ИЗ Объект.ПорядокСостояний Цикл
		
		ЗначениеФлага = (ДанныеСостояния.Состояние = Объект.СостояниеОжидаетОтгрузки);
		УстановитьФлагПоДаннымСостояния(ДействиеОжидаетОтгрузки, ЗначениеФлага, ДанныеСостояния, ЭтотОбъект);
		
		ЗначениеФлага = (ДанныеСостояния.Состояние = Объект.СостояниеОтгружен);
		УстановитьФлагПоДаннымСостояния(ДействиеОтгружен, ЗначениеФлага, ДанныеСостояния, ЭтотОбъект);
		
		ЗначениеФлага = (ДанныеСостояния.Состояние = Объект.СостояниеДоставлен);
		УстановитьФлагПоДаннымСостояния(ДействиеДоставлен, ЗначениеФлага, ДанныеСостояния, ЭтотОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиВерсионирования()
	
	Действие = ДействиеПоТипуНастройки("ХранитьИсториюИзменений", ЭтотОбъект);
	УстановитьФлагиДействий(Действие, Ложь, ЭтотОбъект);
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьВерсионированиеОбъектов = Константы.ИспользоватьВерсионированиеОбъектов.Получить();
	
	Если ИспользоватьВерсионированиеОбъектов Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиВерсионированияОбъектов.ТипОбъекта КАК ТипОбъекта,
		|	НастройкиВерсионированияОбъектов.Вариант КАК ВариантВерсионирования,
		|	НастройкиВерсионированияОбъектов.СрокХраненияВерсий КАК СрокХраненияВерсий
		|ИЗ
		|	РегистрСведений.НастройкиВерсионированияОбъектов КАК НастройкиВерсионированияОбъектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|		ПО (ИдентификаторыОбъектовМетаданных.Ссылка = НастройкиВерсионированияОбъектов.ТипОбъекта)
		|ГДЕ
		|	ИдентификаторыОбъектовМетаданных.ПолноеИмя = ""Документ.ЗаказПокупателя""";
		
		Таблица = Запрос.Выполнить().Выгрузить();
		ИспользоватьВерсионированиеОбъектов = Таблица.Количество() <> 0
		И Таблица[0].ВариантВерсионирования <> Перечисления.ВариантыВерсионированияОбъектов.НеВерсионировать;
		
	КонецЕсли;
	
	Действие = ДействиеПоТипуНастройки("ХранитьИсториюИзменений", ЭтотОбъект);
	УстановитьФлагиДействий(Действие, ИспользоватьВерсионированиеОбъектов, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиДатыЗапретаИзменений()
	
	Действие = ДействиеПоТипуНастройки("ЗапрещатьИзменениеДанныхПрошлыхПериодов", ЭтотОбъект);
	УстановитьФлагиДействий(Действие, Ложь, ЭтотОбъект);
	
	УстановитьПривилегированныйРежим(Истина);
	ДатыЗапретаВключены = Константы.ИспользоватьДатыЗапретаИзменения.Получить();
	
	Если Не ДатыЗапретаВключены Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	ДатыЗапретаИзменения.Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапрета,
	|	ДатыЗапретаИзменения.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел.Наименование = ""Заказы покупателей""";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ДанныеСостояния Из Объект.ПорядокСостояний Цикл
		ЕстьНастройкаСостояния = Таблица.НайтиСтроки(Новый Структура("Объект", ДанныеСостояния.Состояние)).Количество();
		УстановитьФлагПоДаннымСостояния(Действие, ЕстьНастройкаСостояния, ДанныеСостояния, ЭтотОбъект);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиОбязательноеЗаполнениеПричины()
	
	Действие = ДействиеПоТипуНастройки("ОбязательноЗаполнятьПолеПричинаОтменыТовара", ЭтотОбъект);
	УстановитьФлагиДействий(Действие, Ложь, ЭтотОбъект);
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроверкиЗаполнения");
	Для Каждого ДанныеПроцесса Из ПроцессыВида Цикл
		
		Если ДанныеПроцесса.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Успешно Тогда
			Действие.ИспользуетсяДляСостояния_ЗавершенУспешно = Истина;
		ИначеЕсли ДанныеПроцесса.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Отменен Тогда
			Действие.ИспользуетсяДляСостояния_ЗавершенОтменен = Истина;
		Иначе
			
			Для Каждого ДанныеСостояния Из Объект.ПорядокСостояний Цикл
				Если ДанныеПроцесса.Состояние = ДанныеСостояния.Состояние Тогда
					УстановитьФлагПоДаннымСостояния(Действие, Истина, ДанныеСостояния, ЭтотОбъект);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиЗапретЗавершения()
	
	Действие = ДействиеПоТипуНастройки("ЗапрещатьЗавершениеНеотгруженныхЗаказов", ЭтотОбъект);
	УстановитьФлагиДействий(Действие, Ложь, ЭтотОбъект);
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроведения");
	
	Отбор = Новый Структура("Состояние, ВариантЗавершения",
	Справочники.СостоянияЗаказовПокупателей.Завершен, Перечисления.ВариантыЗавершенияЗаказа.Успешно);
	ЕстьНастройка = ПроцессыВида.НайтиСтроки(Отбор).Количество();
	Действие.ИспользуетсяДляСостояния_ЗавершенУспешно = ЕстьНастройка;
	
	Отбор = Новый Структура("Состояние, ВариантЗавершения",
	Справочники.СостоянияЗаказовПокупателей.Завершен, Перечисления.ВариантыЗавершенияЗаказа.Отменен);
	ЕстьНастройка = ПроцессыВида.НайтиСтроки(Отбор).Количество();
	Действие.ИспользуетсяДляСостояния_ЗавершенОтменен = ЕстьНастройка;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиСостояниеЗаявки()
	
	Если Не ЗаявкиДоступны Тогда
		Возврат;
	КонецЕсли;
	
	Действие = ДействиеПоТипуНастройки("Заявка", ЭтотОбъект);
	УстановитьФлагиДействий(Действие, Ложь, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.СостояниеЗаявки) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВсеПредыдущиеФлаги(Действие, Истина, ЭтотОбъект, , Объект.СостояниеЗаявки);
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеФлаговПроцессов

&НаКлиенте
Процедура ОбработатьИзменениеФлагаМаршрутныхЛистов(ТекущиеДанные, ИдентификаторСтроки, ЗначениеФлага)
	
	УстановитьФлагиДействий(ТекущиеДанные, Ложь, ЭтотОбъект);
	
	Если Не ЗначениеФлага Тогда
		Объект[ТекущиеДанные.ТипНастройки] = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторСтроки = "ЗавершенУспешно" Или ИдентификаторСтроки = "ЗавершенОтменен" Тогда
		
		Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен");
		ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенУспешно = Истина;
		ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенОтменен = Истина;
		
	Иначе
		
		Строки = Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("НомерСтроки", Число(ИдентификаторСтроки)));
		Если Строки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Состояние = Строки[0].Состояние;
		УстановитьФлагПоНомеруСтроки(ТекущиеДанные, Истина, ИдентификаторСтроки, ЭтотОбъект);
		
	КонецЕсли;
	
	Объект[ТекущиеДанные.ТипНастройки] = Состояние;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеФлагаОбязательноЗаполнитьПричинуОтмены(ИмяТекущейКолонки, ТекущаяСтрока, ЗначениеФлага)
	
	ИзмененыНастройкиОбязательностиЗаполнения = Истина;
	
	Если Не ЗначениеФлага Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьИзменениеФлагаОбязательноЗаполнитьПричинуОтменыНаСервере(ИмяТекущейКолонки, ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеФлагаОбязательноЗаполнитьПричинуОтменыНаСервере(ИмяТекущейКолонки, ТекущаяСтрока)
	
	Действие = Процессы.НайтиПоИдентификатору(ТекущаяСтрока);
	УстановитьВсеПоследующиеФлаги(Действие, Истина, ЭтотОбъект, ИмяТекущейКолонки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеФлагаИсторияИзменений(ТекущиеДанные, ЗначениеФлага)
	
	ИзмененыНастройкиВерсионирования = Истина;
	УстановитьФлагиДействий(ТекущиеДанные, ЗначениеФлага, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеФлагаДатыЗапретаИзменений(ИмяЭлемента, ТекущиеДанные)
	
	ИзмененыНастройкиДатыЗапретаИзменений = Истина;
	
	Если ИмяЭлемента = Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно.Имя Тогда
		ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенОтменен = ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенУспешно;
	ИначеЕсли ИмяЭлемента = Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенОтменен.Имя Тогда
		ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенУспешно = ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенОтменен;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеФлагаЗапретЗавершения()
	
	ИзмененыНастройкиЗапретаЗавершения = Истина;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработатьИзменениеФлагаЗаявки(ИмяТекущейКолонки, ИдентификаторСтроки, ТекущаяСтрока, ЗначениеФлага)
	
	ИндексСостояния = Элементы.Процессы.ПодчиненныеЭлементы.Индекс(Элементы[ИмяТекущейКолонки]) - 1;
	
	ОтветОтСервера = НажатиеФлагСостояниеЗаявкиНаСервере(Не ЗначениеФлага, ИндексСостояния);
	Если ОтветОтСервера.ИзменениеВозможно Тогда
		Возврат;
	КонецЕсли;
	
	Действие = Процессы.НайтиПоИдентификатору(ТекущаяСтрока);
	Действие["ИспользуетсяДляСостояния_" + ИдентификаторСтроки] = Не ЗначениеФлага;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("РезультатПроверки", ОтветОтСервера.РезультатПроверки);
	ПараметрыМетода.Вставить("ИспользоватьВидыЗаказов", НесколькоВидовЗаказов);
	ПараметрыМетода.Вставить("НаименованиеВидаЗаказа", Объект.Наименование);
	ПараметрыМетода.Вставить("ЗаявкиИспользуютсяДляВида", ЗначениеЗаполнено(Объект.СостояниеЗаявки));
	Ответ = РаботаСЗаявкамиКлиентСервер.ОбработатьРезультатПроверкиВозможностиИзмененияИспользованияЗаявокДляСостояния(
	ПараметрыМетода);
	
	Если ЗначениеЗаполнено(Ответ.ДанныеПредупреждения.Текст) Тогда
		ПредупреждениеАсинх(Ответ.ДанныеПредупреждения.Текст);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответ.ДанныеВопроса.Текст) Тогда
		Возврат;
	КонецЕсли;
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить("СоздатьСостояние", НСтр("ru = 'Создать состояние'"));
	Если ЗначениеЗаполнено(Ответ.ДанныеВопроса.ТекстКнопкиПереходаКОбъекту) Тогда
		КнопкиВопроса.Добавить("ПерейтиКОбъекту", Ответ.ДанныеВопроса.ТекстКнопкиПереходаКОбъекту);
	КонецЕсли;
	КнопкиВопроса.Добавить("Отмена", НСтр("ru = 'Отмена'"));
	
	ОтветОтПользователя = Ждать ВопросАсинх(Ответ.ДанныеВопроса.Текст, КнопкиВопроса, , "СоздатьСостояние");
	Если ОтветОтПользователя = "ПерейтиКОбъекту" Тогда
		
		ПерейтиПоНавигационнойСсылке(Ответ.ДанныеВопроса.НавигационнаяСсылкаОбъекта);
		
	ИначеЕсли ОтветОтПользователя = "СоздатьСостояние" Тогда
		
		ПараметрыФормы = Новый Структура("ЭтоСостояниеДляЗаявок", Истина);
		ОткрытьФорму("Справочник.СостоянияЗаказовПокупателей.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеДанныхПроцессов

&НаСервере
Процедура СохранитьДанныеПроцессов(ТекущийОбъект)
	
	ЗаписатьНастройкиВерсионирования();
	ЗаписатьНастройкиДатыЗапрета();
	ЗаполнитьДанныеОбязательностиЗаполнения(ТекущийОбъект);
	ЗаполнитьДанныеЗапретаЗавершения(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиВерсионирования()
	
	Если НЕ ИзмененыНастройкиВерсионирования Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьВерсионированиеОбъектов = Константы.ИспользоватьВерсионированиеОбъектов.Получить();
	Если НЕ ИспользоватьВерсионированиеОбъектов Тогда
		Константы.ИспользоватьВерсионированиеОбъектов.Установить(Истина);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипОбъектаВерсионирования) Тогда
		ТипОбъектаВерсионирования = ТипОбъектаВерсионирования();
	КонецЕсли;
	
	Действие = ДействиеПоТипуНастройки("ХранитьИсториюИзменений", ЭтотОбъект);
	Если Действие.ИспользуетсяДляСостояния_ЗавершенУспешно Тогда
		ВариантВерсионирования = Перечисления.ВариантыВерсионированияОбъектов.ВерсионироватьПриПроведении;
	Иначе
		ВариантВерсионирования = Перечисления.ВариантыВерсионированияОбъектов.НеВерсионировать;
	КонецЕсли;
	
	ВерсионированиеОбъектов.ЗаписатьНастройкуВерсионированияПоОбъекту(
	ТипОбъектаВерсионирования, ВариантВерсионирования, Перечисления.СрокиХраненияВерсий.Бессрочно);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиДатыЗапрета()
	
	Если НЕ ИзмененыНастройкиДатыЗапретаИзменений Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьДатыЗапретаИзменения = Константы.ИспользоватьДатыЗапретаИзменения.Получить();
	Если НЕ ИспользоватьДатыЗапретаИзменения Тогда
		Константы.ИспользоватьДатыЗапретаИзменения.Установить(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	ДатыЗапретаИзменения.Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапрета,
	|	ДатыЗапретаИзменения.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел.Наименование = ""Заказы покупателей""";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	РазделДатыЗапрета = РазделДатыЗапрета();
	Действие = ДействиеПоТипуНастройки("ЗапрещатьИзменениеДанныхПрошлыхПериодов", ЭтотОбъект);
	
	Для Каждого ДанныеСостояния Из Объект.ПорядокСостояний Цикл
		
		Отбор = Новый Структура("Объект, Пользователь, ДатаЗапрета",
		ДанныеСостояния.Состояние, Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей, Дата('39991231'));
		ЗаписиВРегистре = Таблица.НайтиСтроки(Отбор);
		
		ЗначениеФлага = ЗначениеФлагаДействия(Действие, ДанныеСостояния, ЭтотОбъект);
		
		Если ЗаписиВРегистре.Количество() = 0 И ЗначениеФлага Тогда
			ЗаписатьДатуЗапретаСОписанием(
			РазделДатыЗапрета, ДанныеСостояния.Состояние, Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей, Дата('39991231'), , );
		КонецЕсли;
		
		Если ЗаписиВРегистре.Количество() <> 0 И Не ЗначениеФлага Тогда
			Запись = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ЗаписиВРегистре[0]);
			Запись.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДатуЗапретаСОписанием(Знач Раздел, Знач Объект, Знач Пользователь, Знач ДатаЗапрета, Знач ВнутреннееОписаниеДатыЗапрета, Знач Комментарий)
	
	Если Не ЗначениеЗаполнено(ДатаЗапрета) Тогда
		ДатаЗапрета = '39991231';
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Раздел = Раздел;
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.ДатаЗапрета = ДатаЗапрета;
	МенеджерЗаписи.ОписаниеДатыЗапрета = ВнутреннееОписаниеДатыЗапрета;
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбязательностиЗаполнения(ТекущийОбъект)
	
	Если НЕ ИзмененыНастройкиОбязательностиЗаполнения Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроверкиЗаполнения");
	Если ПроцессыВида.Количество() = 0 Тогда
		ПроцессыВидаОбъект = Справочники.ПроцессыСостоянийЗаказов.СоздатьЭлемент();
		ПроцессыВидаОбъект.Предмет = "ЗаказПокупателя";
		ПроцессыВидаОбъект.ВидЗаказа = ТекущийОбъект.Ссылка;
	Иначе
		ПроцессыВидаОбъект = ПроцессыВида[0].Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	СтрокиПричиныОтмены = ПроцессыВидаОбъект.ОбработкаПроверкиЗаполнения.НайтиСтроки(Новый Структура("ИмяРеквизита", "ОтмененныеЗапасы.ПричинаОтмены"));
	Для Каждого Строка Из СтрокиПричиныОтмены Цикл
		ПроцессыВидаОбъект.ОбработкаПроверкиЗаполнения.Удалить(Строка);
	КонецЦикла;
	
	Действие = ДействиеПоТипуНастройки("ОбязательноЗаполнятьПолеПричинаОтменыТовара", ЭтотОбъект);
	
	Для Каждого ДанныеСостояния Из Объект.ПорядокСостояний Цикл
		
		Если ДанныеСостояния.Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не Действие[ИмяРеквизитаКолонкиСостояния(, ДанныеСостояния.НомерСтроки, ЭтотОбъект)] Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьНастройкуОбязательностиЗаполнения(ПроцессыВидаОбъект, ДанныеСостояния.Состояние);
		
	КонецЦикла;
	
	Если Действие.ИспользуетсяДляСостояния_ЗавершенУспешно Тогда
		ДобавитьНастройкуОбязательностиЗаполнения(
		ПроцессыВидаОбъект, Справочники.СостоянияЗаказовПокупателей.Завершен, Перечисления.ВариантыЗавершенияЗаказа.Успешно);
	КонецЕсли;
	Если Действие.ИспользуетсяДляСостояния_ЗавершенОтменен Тогда
		ДобавитьНастройкуОбязательностиЗаполнения(
		ПроцессыВидаОбъект, Справочники.СостоянияЗаказовПокупателей.Завершен, Перечисления.ВариантыЗавершенияЗаказа.Отменен);
	КонецЕсли;
	
	ПроцессыВидаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройкуОбязательностиЗаполнения(ПроцессыВидаОбъект, Состояние, ВариантЗавершения = Неопределено)
	
	НоваяПроверка = ПроцессыВидаОбъект.ОбработкаПроверкиЗаполнения.Добавить();
	НоваяПроверка.ИмяРеквизита = "ОтмененныеЗапасы.ПричинаОтмены";
	НоваяПроверка.Состояние = Состояние;
	
	Если ВариантЗавершения <> Неопределено Тогда
		НоваяПроверка.ВариантЗавершения = ВариантЗавершения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеЗапретаЗавершения(ТекущийОбъект)
	
	Если НЕ ИзмененыНастройкиЗапретаЗавершения Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроведения");
	Если ПроцессыВида.Количество() = 0 Тогда
		ПроцессыВидаОбъект = Справочники.ПроцессыСостоянийЗаказов.СоздатьЭлемент();
		ПроцессыВидаОбъект.Предмет = "ЗаказПокупателя";
		ПроцессыВидаОбъект.ВидЗаказа = ТекущийОбъект.Ссылка;
	Иначе
		ПроцессыВидаОбъект = ПроцессыВида[0].Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	СтрокиПричиныОтмены = ПроцессыВидаОбъект.ОбработкаПроведения.НайтиСтроки(Новый Структура("Свойство", "ПолностьюОтгружен"));
	Для Каждого Строка Из СтрокиПричиныОтмены Цикл
		ПроцессыВидаОбъект.ОбработкаПроведения.Удалить(Строка);
	КонецЦикла;
	
	Действие = ДействиеПоТипуНастройки("ЗапрещатьЗавершениеНеотгруженныхЗаказов", ЭтотОбъект);
	
	Если Действие.ИспользуетсяДляСостояния_ЗавершенУспешно Тогда
		ДобавитьНастройкуЗапретаЗавершения(
		ПроцессыВидаОбъект, Перечисления.ВариантыЗавершенияЗаказа.Успешно);
	КонецЕсли;
	Если Действие.ИспользуетсяДляСостояния_ЗавершенОтменен Тогда
		ДобавитьНастройкуЗапретаЗавершения(
		ПроцессыВидаОбъект, Перечисления.ВариантыЗавершенияЗаказа.Отменен);
	КонецЕсли;
	
	ПроцессыВидаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройкуЗапретаЗавершения(ПроцессыВидаОбъект, ВариантЗавершения)
	
	НоваяПроверка = ПроцессыВидаОбъект.ОбработкаПроведения.Добавить();
	НоваяПроверка.Свойство = "ПолностьюОтгружен";
	НоваяПроверка.Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен;
	НоваяПроверка.ВариантЗавершения = ВариантЗавершения;
	
КонецПроцедуры

&НаСервере
Функция ТипОбъектаВерсионирования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК ТипОбъекта
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя = ""Документ.ЗаказПокупателя""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ТипОбъекта;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция РазделДатыЗапрета()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазделыДатыЗапретаИзменений.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.РазделыДатЗапретаИзменения КАК РазделыДатыЗапретаИзменений
	|ГДЕ
	|	РазделыДатыЗапретаИзменений.Наименование = ""Заказы покупателей""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область АссистентУправления

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗадачи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьЗакрытиеФормыЗадачиСервер(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗакрытиеФормыЗадачиСервер(Результат)
	
	ИнформационнаяБазаПодключена = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	АссистентПодключен = АссистентУправления.Подключен();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьФлагиАссистентУправления(Результат.ГруппаЗадач);
	
	Если НЕ ИнформационнаяБазаПодключена Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ АссистентПодключен Тогда
		Возврат;
	КонецЕсли;
	
	ОбсуждениеСоздано = АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено;
	
	Если НЕ ОбсуждениеСоздано Тогда
		Попытка
			СоздатьОбсуждение();
		Исключение
		КонецПопытки;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Результат.АвторИзменений) И Результат.НужноДобавитьВОбсуждение Тогда
		Попытка
			АссистентУправления.ОбновитьУчастниковЖурналРаботыАссистента(Результат.АвторИзменений);
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоздатьОбсуждение()
	
	Если АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АссистентУправления.СоздатьОбсуждениеЖурналРаботыАссистента();
	
КонецПроцедуры

#КонецОбласти

#Область РежимЗаказа

&НаКлиенте
Процедура ПредупреждениеОбИспользованииЗаявокДляСостояния(НаименованиеСостояния)
	
	РаботаСЗаявкамиКлиент.ПредупреждениеОбИспользованииЗаявокДляСостояния(НаименованиеСостояния, ЭтоМобильныйКлиент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьЗаявкиВСостоянии(ВидЗаказа, Состояние)
	
	Возврат РаботаСЗаявками.ЕстьЗаказыВСостоянии(ВидЗаказа, Состояние, Истина);
	
КонецФункции

&НаСервере
Функция НажатиеФлагСостояниеЗаявкиНаСервере(Знач ЗаявкиБылиВключены, Знач ИндексСостояния)
	
	Результат = Новый Структура;
	Результат.Вставить("ИзменениеВозможно", Истина);
	Результат.Вставить("РезультатПроверки", Новый Структура);
	
	Ответ = РаботаСЗаявками.ПроверкаВозможностиИзмененияИспользованияЗаявокДляСостояния(
	ЗаявкиБылиВключены, Объект, ИндексСостояния);
	
	Если Не Ответ.ИзменениеВозможно Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Результат.РезультатПроверки, Ответ, Ложь);
		Результат.Вставить("ИзменениеВозможно", Ложь);
		Возврат Результат;
	КонецЕсли;
	
	Если ЗаявкиБылиВключены Тогда
		ИндексСостояния = ИндексСостояния - 1;
	КонецЕсли;
	
	КоличествоСостояний = Объект.ПорядокСостояний.Количество();
	КоличествоСостоянийЗавершения = 2;
	Если ИндексСостояния >= КоличествоСостояний - 1 Тогда
		ИндексСостояния = КоличествоСостояний - КоличествоСостоянийЗавершения;
	КонецЕсли;
	
	Если ИндексСостояния < 0 Тогда
		Состояние = Неопределено;
	Иначе
		Состояние = Объект.ПорядокСостояний[ИндексСостояния].Состояние;
	КонецЕсли;
	
	Объект.СостояниеЗаявки = Состояние;
	УстановитьФлагиСостояниеЗаявки();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеМетодыДляБыстройРаботы

&НаКлиентеНаСервереБезКонтекста
Функция ДействиеПоТипуНастройки(ТипНастройки, Форма)
	
	Возврат Форма.Процессы.НайтиСтроки(Новый Структура("ТипНастройки", ТипНастройки))[0];
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НомерСтрокиСостояния(Состояние, Форма)
	
	Состояния = Форма.Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", Состояние));
	Если Состояния.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Состояния[0].НомерСтроки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРеквизитаКолонкиСостояния(Состояние = Неопределено, НомерСтроки = Неопределено, Форма)
	
	Если НомерСтроки = Неопределено Тогда
		
		НомерСтроки = НомерСтрокиСостояния(Состояние, Форма);
		Если НомерСтроки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрШаблон("ИспользуетсяДляСостояния_%1", НомерСтроки);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагПоДаннымСостояния(Действие, ЗначениеФлага, ДанныеСостояния, Форма)
	
	Если ДанныеСостояния.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен") Тогда
		Действие.ИспользуетсяДляСостояния_ЗавершенУспешно = ЗначениеФлага;
		Действие.ИспользуетсяДляСостояния_ЗавершенОтменен = ЗначениеФлага;
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаКолонкиСостояния = ИмяРеквизитаКолонкиСостояния(ДанныеСостояния.Состояние, ДанныеСостояния.НомерСтроки, Форма);
	Если ИмяРеквизитаКолонкиСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Действие[ИмяРеквизитаКолонкиСостояния] = ЗначениеФлага;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагПоСостоянию(Действие, ЗначениеФлага, Состояние, Форма)
	
	Если Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен") Тогда
		Действие.ИспользуетсяДляСостояния_ЗавершенУспешно = ЗначениеФлага;
		Действие.ИспользуетсяДляСостояния_ЗавершенОтменен = ЗначениеФлага;
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаКолонкиСостояния = ИмяРеквизитаКолонкиСостояния(Состояние, , Форма);
	Если ИмяРеквизитаКолонкиСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Действие[ИмяРеквизитаКолонкиСостояния] = ЗначениеФлага;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагПоНомеруСтроки(Действие, ЗначениеФлага, НомерСтроки, Форма)
	
	ИмяРеквизитаКолонкиСостояния = ИмяРеквизитаКолонкиСостояния(, НомерСтроки, Форма);
	Если ИмяРеквизитаКолонкиСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Действие[ИмяРеквизитаКолонкиСостояния] = ЗначениеФлага;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВсеПредыдущиеФлаги(Действие, ЗначениеФлага, Форма, ИмяКолонки = Неопределено, Состояние = Неопределено, Включая = Истина)
	
	Если ИмяКолонки = Неопределено Тогда
		
		Если Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен Тогда
			ИмяКолонки = Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно.Имя;
		Иначе
			
			НомерСтроки = НомерСтрокиСостояния(Состояние, ЭтотОбъект);
			Если НомерСтроки = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			ИмяКолонки = "ПроцессыИспользуетсяДляСостояния_" + НомерСтроки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого Колонка Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		
		Если Колонка = Элементы.ГруппаЗаголовков Тогда
			Продолжить;
		КонецЕсли;
		
		Если Колонка.Имя <> ИмяКолонки Или Колонка.Имя = ИмяКолонки И Включая Тогда
			
			НаименованиеПоля = Сред(Колонка.ПутьКДанным, СтрДлина("Процессы.") + 1);
			Действие[НаименованиеПоля] = ЗначениеФлага;
			
		КонецЕсли;
		
		Если Колонка.Имя = ИмяКолонки Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВсеПоследующиеФлаги(Действие, ЗначениеФлага, Форма, ИмяКолонки = Неопределено, Состояние = Неопределено, Включая = Истина)
	
	Если ИмяКолонки = Неопределено Тогда
		
		Если Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен Тогда
			ИмяКолонки = Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно.Имя;
		Иначе
			
			НомерСтроки = НомерСтрокиСостояния(Состояние, ЭтотОбъект);
			Если НомерСтроки = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			ИмяКолонки = "ПроцессыИспользуетсяДляСостояния_" + НомерСтроки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НайденаТекущаяКолонка = Ложь;
	Для Каждого Колонка Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		
		Если Колонка.Имя = ИмяКолонки Тогда
			НайденаТекущаяКолонка = Истина;
		КонецЕсли;
		
		Если Не НайденаТекущаяКолонка Тогда
			Продолжить;
		КонецЕсли;
		
		Если Колонка.Имя <> ИмяКолонки Или Колонка.Имя = ИмяКолонки И Включая Тогда
			
			НаименованиеПоля = Сред(Колонка.ПутьКДанным, СтрДлина("Процессы.") + 1);
			Действие[НаименованиеПоля] = ЗначениеФлага;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеФлагаДействия(Действие, ДанныеСостояния, Форма)
	
	Если ДанныеСостояния.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен") Тогда
		Возврат Действие.ИспользуетсяДляСостояния_ЗавершенУспешно;
	КонецЕсли;
	
	ИмяРеквизитаКолонкиСостояния = ИмяРеквизитаКолонкиСостояния(, ДанныеСостояния.НомерСтроки, Форма);
	Если ИмяРеквизитаКолонкиСостояния = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Действие[ИмяРеквизитаКолонкиСостояния];
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагиДействий(Действия, ЗначениеФлага, Форма)
	
	Если ТипЗнч(Действия) = Тип("Массив") Тогда
		ДействияСписок = Действия;
	Иначе
		ДействияСписок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Действия);
	КонецЕсли;
	
	Для Каждого Действие Из ДействияСписок Цикл
		Для Каждого ДанныеСостояния Из Форма.Объект.ПорядокСостояний Цикл
			УстановитьФлагПоДаннымСостояния(Действие, ЗначениеФлага, ДанныеСостояния, Форма);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПроцессыВида(ИмяТаблицы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроцессов(ИмяТаблицы);
	Запрос.УстановитьПараметр("ВидЗаказа", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаПроцессов(ИмяТаблицы)
	
	Если ИмяТаблицы = "ОбработкаПроверкиЗаполнения" Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПроцессыСостоянийЗаказов.Ссылка КАК Ссылка,
		|	ПроцессыОбработкаПроверкиЗаполнения.НомерСтроки КАК НомерСтроки,
		|	ПроцессыОбработкаПроверкиЗаполнения.Состояние КАК Состояние,
		|	ПроцессыОбработкаПроверкиЗаполнения.ИмяРеквизита КАК ИмяРеквизита,
		|	ПроцессыОбработкаПроверкиЗаполнения.ВариантЗавершения КАК ВариантЗавершения
		|ИЗ
		|	Справочник.ПроцессыСостоянийЗаказов КАК ПроцессыСостоянийЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроцессыСостоянийЗаказов.ОбработкаПроверкиЗаполнения КАК ПроцессыОбработкаПроверкиЗаполнения
		|		ПО (ПроцессыСостоянийЗаказов.Ссылка = ПроцессыОбработкаПроверкиЗаполнения.Ссылка)
		|ГДЕ
		|	ПроцессыСостоянийЗаказов.ВидЗаказа = &ВидЗаказа
		|	И ПроцессыСостоянийЗаказов.Предмет = ""ЗаказПокупателя""";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПроцессыСостоянийЗаказов.Ссылка КАК Ссылка,
		|	ПроцессыОбработкаПроведения.НомерСтроки КАК НомерСтроки,
		|	ПроцессыОбработкаПроведения.Состояние КАК Состояние,
		|	ПроцессыОбработкаПроведения.ВариантЗавершения КАК ВариантЗавершения,
		|	ПроцессыОбработкаПроведения.Свойство КАК Свойство
		|ИЗ
		|	Справочник.ПроцессыСостоянийЗаказов КАК ПроцессыСостоянийЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроцессыСостоянийЗаказов.ОбработкаПроведения КАК ПроцессыОбработкаПроведения
		|		ПО ПроцессыСостоянийЗаказов.Ссылка = ПроцессыОбработкаПроведения.Ссылка
		|ГДЕ
		|	ПроцессыСостоянийЗаказов.ВидЗаказа = &ВидЗаказа
		|	И ПроцессыСостоянийЗаказов.Предмет = ""ЗаказПокупателя""";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	Элементы.СтраницаПроцессы.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Объект.СостояниеЗаявки) Тогда
		
		Элементы.Баннер.Видимость = Истина;
		Элементы.ПорядокСостояний.ТолькоПросмотр = Истина;
		
		Элементы.ПорядокСостоянийДобавитьВсе.Доступность = Ложь;
		Элементы.КнопкиВверхВниз.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьГлобальныеНастройки()
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	НесколькоВидовЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей");
	ИспользоватьМаршрутныеЛисты = ПолучитьФункциональнуюОпцию("ИспользоватьМаршрутныеЛисты");
	ОтображатьЗадачиПроизводства = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуПроизводство");
	ОтображатьЗадачиПоставщиков = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки");
	ОтображатьЗадачиCRM = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуCRM");
	ИспользоватьПодсистемуРаботы =  ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуРаботы");
	ИспользоватьПроцессы = ПолучитьФункциональнуюОпцию("ИспользоватьПроцессыСостояний");
	ЗаявкиДоступны = РаботаСЗаявками.ЗаявкиДоступны();
	ТолькоПросмотрЗадач = НЕ Пользователи.ЭтоПолноправныйПользователь();
	
	РазрешеноИзменениеСостояния = ПравоДоступа("Изменение", Метаданные.Справочники.СостоянияЗаказовПокупателей);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	
	СохранитьГлобальныеНастройки();
	
	Если Не НесколькоВидовЗаказов И Объект.НеИспользоватьДоставку Тогда
		Объект.НеИспользоватьДоставку = Ложь;
	КонецЕсли;
	
	РаботаСВидамиЗаказов.ФормаЭлементаВидаЗаказаПриСозданииНаСервере(ЭтотОбъект);
	
	ОбновитьПроцессы();
	
	УправлениеФормой();
	
	УстановитьУсловноеОформлениеСостоянийВЦвет();
	СостоянияЗаказов.УстановитьУсловноеОформлениеСостоянияЗавершен(
	УсловноеОформление,
	Справочники.СостоянияЗаказовПокупателей.Завершен,
	"Объект.ПорядокСостояний.Состояние",
	"ПорядокСостояний");
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ПорядокСостоянийКонтекстноеМенюПометитьНаУдаление.Видимость = РазрешеноИзменениеСостояния;
	Элементы.ПорядокСостоянийПометитьНаУдаление.Видимость = РазрешеноИзменениеСостояния;
	Элементы.ПорядокСостоянийСостояние.КнопкаВыбора = НесколькоВидовЗаказов;
	
	Элементы.ВключитьДоставку.Видимость = ИспользоватьМаршрутныеЛисты;
	Элементы.СтраницаПроцессы.Видимость = ИспользоватьПроцессы;
	
	Элементы.ПроцессыНастройкаАссистента.Гиперссылка = Не ТолькоПросмотрЗадач;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиБаннеры()
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Изменение списка состояний недоступно на мобильном устройстве. Для изменения состояний войдите через браузер или настольное приложение'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Недоступно в мобильном клиенте'");
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.Баннер);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере(Знач ИмяСобытия, Знач Параметр)
	
	Если ИмяСобытия = "Запись_СостоянияЗаказовПокупателей" Тогда
		
		ЭтоСостояниеДляЗаявок = ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("ЭтоСостояниеДляЗаявок");
		
		Если ЭтоСостояниеДляЗаявок Тогда
			
			Объект.СостояниеЗаявки = Параметр.Ссылка;
			СтрокаТЗ = Объект.ПорядокСостояний.Вставить(0);
			СтрокаТЗ.Состояние = Объект.СостояниеЗаявки;
			
			Модифицированность = Ложь;
			Записать();
			
		КонецЕсли;
		
		ОбработатьЗаписьСостояния(Параметр);
		УстановитьУсловноеОформлениеСостоянийВЦвет();
		
		Если ЭтоСостояниеДляЗаявок Тогда
			ОбновитьПроцессы();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаписьСостояния(ПараметрЗаписи)
	
	Если ТипЗнч(ПараметрЗаписи) = Тип("Структура") И Не ПараметрЗаписи.Свойство("Ссылка") Тогда
		Возврат;
	КонецЕсли;
	
	Состояние = ПараметрЗаписи.Ссылка;
	ДанныеСостояния = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Состояние, "Ссылка, Наименование, ПометкаУдаления, Цвет");
	
	Если ДанныеСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСостояния = Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", ДанныеСостояния.Ссылка));
	Для Каждого НайденноеСостояние Из НайденныеСостояния Цикл
		
		НайденноеСостояние.Состояние = ДанныеСостояния.Ссылка;
		НайденноеСостояние.ПометкаУдаления = ДанныеСостояния.ПометкаУдаления;
		
		Если ДанныеСостояния.Цвет <> Неопределено Тогда
			НайденноеСостояние.Цвет = ДанныеСостояния.Цвет.Получить();
		КонецЕсли;
		
		НайденноеСостояние.НаименованиеСостояния = ДанныеСостояния.Наименование;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояния()
	
	УдаляемыеСостояния = Новый Массив;
	Для Каждого Состояние Из Объект.ПорядокСостояний Цикл
		Если НЕ ЗначениеЗаполнено(Состояние.НаименованиеСостояния) Тогда
			УдаляемыеСостояния.Добавить(Состояние);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Состояние Из УдаляемыеСостояния Цикл
		Объект.ПорядокСостояний.Удалить(Состояние);
	КонецЦикла;
	
	Для Каждого Состояние Из Объект.ПорядокСостояний Цикл
		
		Если НЕ Состояние.Изменено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(Состояние.Состояние) Тогда
				СостояниеОбъект = Состояние.Состояние.ПолучитьОбъект();
				СостояниеОбъект.Заблокировать();
			Иначе
				СостояниеОбъект = Справочники.СостоянияЗаказовПокупателей.СоздатьЭлемент();
				СостояниеОбъект.Наименование = Состояние.НаименованиеСостояния;
			КонецЕсли;
		Исключение
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), СостояниеОбъект);
		КонецПопытки;
		
		СостояниеОбъект.ПометкаУдаления = Состояние.ПометкаУдаления;
		СостояниеОбъект.Цвет = Новый ХранилищеЗначения(Состояние.Цвет);
		Попытка
			СостояниеОбъект.Записать();
		Исключение
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), СостояниеОбъект);
		КонецПопытки;
		
		СостояниеОбъект.Разблокировать();
		Состояние.Состояние = СостояниеОбъект.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти