
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		Элементы.ДобавитьБезМарки.Высота = 4;
	КонецЕсли;
	
	ПредставлениеТовара = Параметры.ПредставлениеТовара;
	ВозможностьДобавитьБезМарки = Параметры.ВозможностьДобавитьБезМарки;
	ВозможностьВыбратьКодМаркировки = Параметры.ВозможностьВыбратьКодМаркировки;
	КодыМаркировкиДляВыбора = Параметры.КодыМаркировкиДляВыбора;
	УдалитьТоварПриЗакрытии = Параметры.УдалитьТоварПриЗакрытии;
	ПредставлениеЕдиницыИзмерения = Параметры.ПредставлениеЕдиницыИзмерения;
	
	Элементы.ГруппаДобавитьБезМарки.Видимость = ВозможностьДобавитьБезМарки;
	Элементы.ГруппаВыборКодаМаркировки.Видимость = ВозможностьВыбратьКодМаркировки;
	
	КодыМаркировкиПоДаннымИБ = КодыМаркировкиДляВыбора.КодМаркировкиПоДаннымИБ;
	
	ВыводитьОстатокВПредставлении = Истина;
	ОбщегоНазначенияРМККлиентСерверПереопределяемый.ВыводитьОстатокВПредставлении(ВыводитьОстатокВПредставлении);
	
	НомПП = 0;
	Для Каждого КодМаркировки Из КодыМаркировкиПоДаннымИБ Цикл
		
		ПредставлениеКодаМаркировки = КодМаркировки.КодМаркировкиПредставление;
		ПредставлениеОстатка = "";
		Если ВыводитьОстатокВПредставлении Тогда
			ПредставлениеОстатка = СтрШаблон(НСтр("ru = 'Остаток %1 %2'"),
				КодМаркировки.ОстатокПоКодуМаркировки, ПредставлениеЕдиницыИзмерения);
		КонецЕсли;
		
		Если НомПП%2 = 0 Тогда
			КонтейнерЭлемента = Элементы.ГруппаВыборКодаМаркировкиКолонка1;
		Иначе
			КонтейнерЭлемента = Элементы.ГруппаВыборКодаМаркировкиКолонка2;
		КонецЕсли;
		
		ИмяДействия = "Подключаемый_КодМаркировкиВыбор";
		
		ПлиткаКарточка = Элементы.Добавить("Карточка" + НомПП, Тип("ГруппаФормы"), КонтейнерЭлемента);
		ПлиткаКарточка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ПлиткаКарточка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ПлиткаКарточка.Отображение = ОтображениеОбычнойГруппы.Нет;
		ПлиткаКарточка.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ПлиткаКарточка.ОтображатьЗаголовок = Ложь;
		ПлиткаКарточка.ОтображатьКакКарточку = Истина;
		ПлиткаКарточка.Гиперссылка = Истина;
		ПлиткаКарточка.ЦветФона = ЦветаПалитры.Серый;
		ПлиткаКарточка.УстановитьДействие("Нажатие", ИмяДействия);
		
		ПлиткаКарточка.РастягиватьПоГоризонтали = Истина;
		ПлиткаКарточка.РастягиватьПоВертикали = Ложь;
		ПлиткаКарточка.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		ПлиткаКарточка.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		
		Декорация = Элементы.Добавить("ПредставлениеКодаМаркировки" + НомПП, Тип("ДекорацияФормы"), ПлиткаКарточка);
		Декорация.Вид = ВидДекорацииФормы.Надпись;
		Декорация.Заголовок = ПредставлениеКодаМаркировки;
		Декорация.Высота = 1;
		Декорация.Ширина = 1;
		Декорация.РастягиватьПоГоризонтали = Истина;
		Декорация.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		
		Если ВыводитьОстатокВПредставлении Тогда
			Декорация = Элементы.Добавить("ПредставлениеОстатка" + НомПП, Тип("ДекорацияФормы"), ПлиткаКарточка);
			Декорация.Вид = ВидДекорацииФормы.Надпись;
			Декорация.Заголовок = ПредставлениеОстатка;
			Декорация.Высота = 1;
			Декорация.Ширина = 1;
			Декорация.РастягиватьПоГоризонтали = Истина;
			Декорация.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		КонецЕсли;
		
		НомПП = НомПП + 1;
	КонецЦикла;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ИмяРеквизита  = "ИспользоватьОчередьСканера";
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Булево")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И (АктивноеОкно() = Окно Или ВводДоступен()) Тогда
		
		Штрихкод = "";
		Если ИмяСобытия = "ScanData" Тогда
			
			Штрихкод = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			
		ИначеЕсли ИмяСобытия = "ScanDataBase64" Тогда
			
			Штрихкод = "";
			ШтрихкодBase64 = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			МенеджерОборудованияРМККлиентСервер.Base64ВШтрихкод(ШтрихкодBase64, Штрихкод);
			
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			
			Штрихкод = Параметр[0];
			
		КонецЕсли;
		
		ВернутьРезультатНаФормуРМК(Штрихкод);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗакрыватьФорму Тогда
		Возврат;
	ИначеЕсли УдалитьТоварПриЗакрытии Тогда
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьТоварЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Не вводить марку и удалить товар?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_КодМаркировкиВыбор(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомерНажатой = Число(СтрЗаменить(Элемент.Имя, "Карточка", ""));
	
	КодыМаркировкиПоДаннымИБ = КодыМаркировкиДляВыбора.КодМаркировкиПоДаннымИБ;
	
	СтрокаКодаМаркировки = КодыМаркировкиПоДаннымИБ[НомерНажатой];
	
	ЗакрыватьФорму = Истина;
	ПараметрыЗакрытия = ПараметрыЗакрытияФормы();
	ПараметрыЗакрытия.КодМаркировки = СтрокаКодаМаркировки.ПолныйКодМаркировки;
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаДобавитьБезМаркиНажатие(Элемент)
	
	ЗакрытьИДобавитьБезМарки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВвестиМарку(Команда)
	
	ПараметрыОткрытия = ОбщегоНазначенияРМККлиент.ПараметрыФормыВводаШтрихкода();
	ПараметрыОткрытия.СкрытьКомандуНайтиВЧеке = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ФормаВводаШтрихкодаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаВводаШтрихкода", ПараметрыОткрытия ,ЭтотОбъект , , , ,
		ОписаниеОповещения, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТовар(Команда)
	
	ЗакрыватьФорму = Истина;
	ПараметрыЗакрытия = ПараметрыЗакрытияФормы();
	ПараметрыЗакрытия.УдалитьТовар = Истина;
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБезМарки(Команда)
	
	ЗакрытьИДобавитьБезМарки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьСобытиеСканера(Результат, ДополнительныеПараметры) Экспорт
	
	ОбработкаОповещения(Результат.Событие, Результат.Данные, "ПодключаемоеОборудование");
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьРезультатНаФормуРМК(Штрихкод)
	
	Результат = Новый Структура();
	Результат.Вставить("Штрихкод", Штрихкод);
	Результат.Вставить("ИскатьВЧеке", Ложь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ФормаВводаШтрихкодаЗавершение", ВладелецФормы);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаВводаШтрихкодаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ФормаВводаШтрихкодаЗавершение", ВладелецФормы);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИДобавитьБезМарки()
	
	ЗакрыватьФорму = Истина;
	ПараметрыЗакрытия = ПараметрыЗакрытияФормы();
	ПараметрыЗакрытия.ДобавитьБезМарки = Истина;
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыЗакрытияФормы()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДобавитьБезМарки", Ложь);
	СтруктураПараметров.Вставить("УдалитьТовар", Ложь);
	СтруктураПараметров.Вставить("КодМаркировки", "");
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура УдалитьТоварЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрыватьФорму = Истина;
		ПараметрыЗакрытия = ПараметрыЗакрытияФормы();
		ПараметрыЗакрытия.УдалитьТовар = Истина;
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти





