#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСкидкиТорговыхПредложений(Параметры) Экспорт
	
	Если Параметры.ТорговоеПредложение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТорговоеПредложение = Параметры.ТорговоеПредложение;
	Опт = Параметры.Опт;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкидкиТорговыхПредложенийВидыЦен.ТорговоеПредложение КАК ТорговоеПредложение,
	|	СкидкиТорговыхПредложенийВидыЦен.Количество КАК Количество,
	|	СкидкиТорговыхПредложенийВидыЦен.ВидыЦен КАК ВидыЦен
	|ИЗ
	|	РегистрСведений.СкидкиТорговыхПредложенийВидыЦен КАК СкидкиТорговыхПредложенийВидыЦен
	|ГДЕ
	|	СкидкиТорговыхПредложенийВидыЦен.ТорговоеПредложение = &ТорговоеПредложение
	|	И СкидкиТорговыхПредложенийВидыЦен.Количество = 1";
	Запрос.УстановитьПараметр("ТорговоеПредложение", ТорговоеПредложение);
	
	Если Опт Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"И СкидкиТорговыхПредложенийВидыЦен.Количество = 1", 
			"И СкидкиТорговыхПредложенийВидыЦен.Количество <> 1");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Добавляет скидку торгового предложения. Ни в коем случае не использовать внутри явно открытой транзакции!
// 
// Параметры:
//  ТорговоеПредложение - ОпределяемыйТип.ТорговоеПредложение
//  ВидыЦен - ОпределяемыйТип.ВидыЦен
//  Отказ - Булево
Процедура ДобавитьСкидкуТорговогоПредложения(ТорговоеПредложение, ВидыЦен, Отказ) Экспорт
	
	ТаблицаСкидкиТорговыхПредложенийВидыЦенДляСохранения = НоваяТаблицаСкидкиТорговыхПредложенийВидыЦенДляСохранения();
	
	НоваяСтрокаТаблицыСкидок = ТаблицаСкидкиТорговыхПредложенийВидыЦенДляСохранения.Добавить();
	НоваяСтрокаТаблицыСкидок.ТорговоеПредложение = ТорговоеПредложение;
	НоваяСтрокаТаблицыСкидок.ВидыЦен = ВидыЦен;
	НоваяСтрокаТаблицыСкидок.Количество = 1;
	
	Попытка 
		
		ДобавитьНовыеЗаписи(ТаблицаСкидкиТорговыхПредложенийВидыЦенДляСохранения);
		
	Исключение
		
		Отказ = Истина;
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Добавление скидки торгового предложения виды цен'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.СкидкиТорговыхПредложенийВидыЦен, 
			"СкидкиТорговыхПредложенийВидыЦен.ДобавитьСкидкуТорговогоПредложения", 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
	КонецПопытки;
		
КонецПроцедуры

// Удаляет скидку торгового предложения. Ни в коем случае не использовать внутри явно открытой транзакции!
// 
// Параметры:
//  ТорговоеПредложение - ОпределяемыйТип.ТорговоеПредложение
//  ВидыЦен - ОпределяемыйТип.ВидыЦен
//  Отказ - булево
Процедура УдалитьСкидкуТорговогоПредложения(ТорговоеПредложение, ВидыЦен, Отказ) Экспорт
	
	ТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления = НоваяТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления();
	
	НоваяСтрокаТаблицыСкидокДляУдаления = ТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления.Добавить();
	НоваяСтрокаТаблицыСкидокДляУдаления.ТорговоеПредложение = ТорговоеПредложение;
	НоваяСтрокаТаблицыСкидокДляУдаления.ВидыЦен = ВидыЦен;

	Попытка 

		УдалитьЗаписи(ТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления);

	Исключение
		
		Отказ = Истина;
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Удаление скидки торгового предложения виды цен'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.СкидкиТорговыхПредложенийВидыЦен, 
			"СкидкиТорговыхПредложенийВидыЦен.УдалитьСкидкуТорговогоПредложения", 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Конструкторы

// Конструктор. Новая таблица скидки торговых предложений виды цен для сохранения.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. НоваяТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления:
// * Количество - Число
Функция НоваяТаблицаСкидкиТорговыхПредложенийВидыЦенДляСохранения() 
	
	ОписаниеТиповЧисло10 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10));

	Результат = НоваяТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления();
	Результат.Колонки.Добавить("Количество", ОписаниеТиповЧисло10);
	
	Возврат Результат;
	
КонецФункции

// Конструктор. Новая таблица скидки торговых предложений виды цен для удаления.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
// * ТорговоеПредложение - ОпределяемыйТип.ТорговоеПредложение
// * ВидСкидки - ОпределяемыйТип.ВидыЦен
Функция НоваяТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления() 
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("ТорговоеПредложение", Метаданные.ОпределяемыеТипы.ТорговоеПредложение.Тип);
	Результат.Колонки.Добавить("ВидыЦен", Метаданные.ОпределяемыеТипы.ВидыЦен.Тип);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Добавляет новые записи в регистр в режиме замещения Добавление. Если записи из набора уже присутствуют в регистре,
// будет вызвано исключение.
// 
// Параметры:
//  ТаблицаСкидкиТорговыхПредложенийВидыЦен - см. НоваяТаблицаСкидкиТорговыхПредложенийВидыЦенДляСохранения
Процедура ДобавитьНовыеЗаписи(ТаблицаСкидкиТорговыхПредложенийВидыЦен)
	
	ИмяСобытия = НСтр("ru = 'Добавить новые записи скидок торговых предложений виды цен'",
		 ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписатьНаборы(ТаблицаСкидкиТорговыхПредложенийВидыЦен, РежимЗамещения.Добавление, ИмяСобытия);
	
КонецПроцедуры

// Удаляет переданные записи из регистра.
// 
// Параметры:
//  ТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления - см. НоваяТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления
Процедура УдалитьЗаписи(ТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления) Экспорт
	
	ИмяСобытия = НСтр("ru = 'Удалить записи скидок торговых предложений виды цен'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписатьНаборы(ТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления, РежимЗамещения.Удаление, ИмяСобытия);
	
КонецПроцедуры

// Записывает наборы из переданной таблицы с переданным режимом замещения
// 
// Параметры:
//  ТаблицаСкидкиТорговыхПредложенийВидыЦен - см. НоваяТаблицаСкидкиТорговыхПредложенийВидыЦенДляСохранения,
//                                            см. НоваяТаблицаСкидкиТорговыхПредложенийВидыЦенДляУдаления
//  РежимЗамещенияЗаписей - ПеречислениеРежимЗамещения
//  ИмяСобытия - Строка
Процедура ЗаписатьНаборы(ТаблицаСкидкиТорговыхПредложенийВидыЦен, РежимЗамещенияЗаписей, ИмяСобытия)
	
	ТорговыеПредложенияСлужебный.ЗаписатьНаборыРегистраСведений(
		РегистрыСведений.СкидкиТорговыхПредложенийВидыЦен,
		ТаблицаСкидкиТорговыхПредложенийВидыЦен,
		РежимЗамещенияЗаписей, 
		ИмяСобытия);

КонецПроцедуры

#КонецОбласти

#КонецЕсли