#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиУНФ.ЗаполнитьДополнительныеПараметры(Объект,
		"ГруппаДополнительныеРеквизиты", , , , ПоложениеЗаголовкаЭлементаФормы.Лево);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	НаборСвойств_Документ_НачислениеСписаниеБонусныхБаллов = УправлениеСвойствами.НаборСвойствПоИмени("Документ_НачислениеСписаниеБонусныхБаллов");
	
	Если Объект.СлужебныйДокумент Тогда
		ТолькоПросмотр = Истина;
		Элементы.БонусыЗаполнитьПоПрограмме.Доступность = Ложь;
		
	КонецЕсли;
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	АдаптацияФормыТакси();
	АдаптацияФормыМК();

	УстановитьСвойстваСвернутогоПодвала();
		
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);		
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьОтсрочкуСписания();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность", Модифицированность);
	// Конец Обсуждения
	
	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Обработчик механизма "Свойства"	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура БонуснаяПрограммаПриИзменении(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОЗаполненииПоБонуснойПрограммеЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Заполнить табличную часть картами бонусной программы?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	ОбновитьОтсрочкуСписания();
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	ДанныеДляИзмененияДаты = ДокументыУНФКлиент.ДанныеДляИзмененияДаты(ЭтотОбъект, Объект);
	Если ДанныеДляИзмененияДаты.ДатаНеМенялась Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты);

КонецПроцедуры

&НаКлиенте
Процедура КомментарийСвернутоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБонусы

&НаКлиенте
Процедура БонусыДатаНачисленияПриИзменении(Элемент)
	ИдентификаторСтроки = Элементы.Бонусы.ТекущаяСтрока;
	ТекущаяСтрока = Объект.НачисленияБонусов.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если НЕ ТекущаяСтрока = Неопределено Тогда	
		ТекущаяСтрока.ДатаСгорания = ПрибавитьКДатеПериод(ТекущаяСтрока.ДатаНачисления, ОтсрочкаСписания, ПериодичностьОтсрочкиСписания);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БонусыБонуснаяКартаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачалоВыбораБонуснойКарты(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписанияБонусов


&НаКлиенте
Процедура СписанияБонусовБонуснаяКартаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачалоВыбораБонуснойКарты(Элемент);
	
КонецПроцедуры



#КонецОБласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьКомментарий(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПрограмме(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.БонуснаяПрограмма) Тогда
		ТекстСообщения = НСтр("ru = 'Укажите бонусную программу'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "БонуснаяПрограмма", "Объект.БонуснаяПрограмма");
		Возврат;
	КонецЕсли;
	
	Если Объект.НачисленияБонусов.Количество() = 0 Тогда
		ЗаполнитьПоПрограммеНаСервере();
	Иначе
		ВопросОПерезаполнении();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоБаллов(Команда)
	
	УстановитьКоличество(Команда.Имя, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличество(ИмяКоманды, ИспользоватьВыделенныеСтроки)
	КоличествоБаллов = 0;
	ДополнительныеПараметры = Новый Структура("ВыделенныеСтроки, ИмяКоманды", ИспользоватьВыделенныеСтроки, ИмяКоманды);
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьКоличествоБалловЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВводЧисла(ОписаниеОповещения, КоличествоБаллов, НСтр("ru = 'Введите количество баллов для начисления'"), 15, 0);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуНачисления(Команда)
	УстановитьДатуНачисленияСгорания(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуСгорания(Команда)
	УстановитьДатуНачисленияСгорания(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДополнительныйРеквизит(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", НаборСвойств_Документ_НачислениеСписаниеБонусныхБаллов);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта", ПараметрыФормы, , , , , ,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСвойстваСвернутогоПодвала()
	
	Если ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	ОпределяющиеЭлементы = "ПодвалПраво,Итоги,ИтогоНачислено,ИтогоСписано";
	РаботаСФормойДокумента.УстановитьСвойстваСвернутогоПодвала(ЭтотОбъект, ОпределяющиеЭлементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОПерезаполнении()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОПерезаполненииЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Табличная часть будет очищена. Продолжить?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОПерезаполненииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьПоПрограммеНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыМК()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Номер.АвтоМаксимальнаяШирина = Истина;
	Элементы.Дата.АвтоМаксимальнаяШирина = Истина;
	Элементы.КолонкаСсылки.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Авто;
	Элементы.ПодвалПраво.РастягиватьПоГоризонтали = Ложь;
	Элементы.ПодвалПраво.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	Элементы.ПодвалПраво.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Лево;
	
	МобильныйКлиентУНФ.НастроитьПодвалФормы(Элементы);
		
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыТакси()

	Если ЭтоИнтерфейсТакси Тогда
		Элементы.Комментарий.КнопкаВыбора = Истина;
		Элементы.ПодвалСвернут.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте 
Процедура ОбновитьОтсрочкуСписания()
	ПараметрыОтсрочки = ПараметрыОтсрочкиСписания(Объект.БонуснаяПрограмма);
	СписаниеНеиспользованных = ПараметрыОтсрочки.СписаниеНеиспользованных;
	ОтсрочкаСписания = ПараметрыОтсрочки.КоличествоПериодовСписания;
	ПериодичностьОтсрочкиСписания = ПараметрыОтсрочки.ПериодичностьСписания;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыОтсрочкиСписания(БонуснаяПрограмма)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БонуснаяПрограмма,"СписаниеНеиспользованных, КоличествоПериодовСписания, ПериодичностьСписания");
КонецФункции



&НаСервере
Процедура ЗаполнитьПоПрограммеНаСервере()
	
	Объект.НачисленияБонусов.Очистить();
	
	Карты = РаботаСБонусами.ПолучитьКартыБонуснойПрограммы(Объект.БонуснаяПрограмма);
	
	Для Каждого Карта Из Карты Цикл
		
		НоваяСтрока = Объект.НачисленияБонусов.Добавить();
		НоваяСтрока.БонуснаяКарта = Карта;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуНачисленияСгоранияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиДляОбработки = Объект.НачисленияБонусов;
	ВыделенныеСтроки = Элементы.Бонусы.ПолучитьСтрокиДляОбработки();
	Если ВыделенныеСтроки.Количество() Тогда
		СтрокиДляОбработки = Новый Массив;
		Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
			СтрокиДляОбработки.Добавить(Объект.НачисленияБонусов.НайтиПоИдентификатору(ИдентификаторСтроки));
		КонецЦикла;
	КонецЕсли;
	ИмяКоманды = "";
	Если ДополнительныеПараметры.Свойство("ИмяКоманды") Тогда
		ИмяКоманды = ДополнительныеПараметры.ИмяКоманды;
	КонецЕсли;
	
	Для Каждого СтрокаБонусов Из СтрокиДляОбработки Цикл
		
		Если ИмяКоманды = "УстановитьДатуНачисления" 
			ИЛИ ИмяКоманды = "БонусыУстановитьДатуНачисления" Тогда
			СтрокаБонусов.ДатаНачисления = Результат;
			СтрокаБонусов.ДатаСгорания = ПрибавитьКДатеПериод(СтрокаБонусов.ДатаНачисления, ОтсрочкаСписания, ПериодичностьОтсрочкиСписания)
		ИначеЕсли ИмяКоманды = "УстановитьДатуСгорания" 
			ИЛИ ИмяКоманды = "БонусыУстановитьДатуСгорания" Тогда
			СтрокаБонусов.ДатаСгорания = Результат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоБалловЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиДляОбработки = Объект.НачисленияБонусов;
	ВыделенныеСтроки = Элементы.Бонусы.ПолучитьСтрокиДляОбработки();
	Если ВыделенныеСтроки.Количество() Тогда
			СтрокиДляОбработки = Новый Массив;
		Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
			СтрокиДляОбработки.Добавить(Объект.НачисленияБонусов.НайтиПоИдентификатору(ИдентификаторСтроки));
		КонецЦикла;
	КонецЕсли;
	Для Каждого СтрокаБонусов Из СтрокиДляОбработки Цикл
		
		СтрокаБонусов.Количество = Результат;
		
	КонецЦикла;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ВопросОЗаполненииПоБонуснойПрограммеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если Объект.НачисленияБонусов.Количество() = 0 Тогда
			ЗаполнитьПоПрограммеНаСервере();
		Иначе
			ВопросОПерезаполнении();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПрибавитьКДатеПериод(ИсходнаяДата, КоличествоПериодов, Периодичность)
	Результат = Неопределено;
	Если НЕ СписаниеНеиспользованных Тогда
		Результат = Дата(1,1,1);			
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда 
		Результат = ИсходнаяДата + (3600 * 24) * КоличествоПериодов;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда 
		Результат = ИсходнаяДата + (3600 * 24 * 7) * КоличествоПериодов;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда 
		Результат = ИсходнаяДата + (3600 * 24 * 10) * КоличествоПериодов;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда 
		Результат = ДобавитьМесяц(ИсходнаяДата, 1 * КоличествоПериодов);
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда 
		Результат = ДобавитьМесяц(ИсходнаяДата, 3 * КоличествоПериодов);
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда 
		Результат = ДобавитьМесяц(ИсходнаяДата, 6 * КоличествоПериодов);
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда 
		Результат = ДобавитьМесяц(ИсходнаяДата, 12 * КоличествоПериодов);
	КонецЕсли;
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура БонусыБонуснаяКартаЗавершениеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Элементы.Бонусы.ТекущиеДанные.БонуснаяКарта = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписанияБонусовБонуснаяКартаЗавершениеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Элементы.СписанияБонусов.ТекущиеДанные.БонуснаяКарта = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКоманду(Результат.Команда);
			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораБонуснойКарты(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(Элемент.Родитель.Имя + "БонуснаяКартаЗавершениеВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("БонуснаяПрограмма", Объект.БонуснаяПрограмма);
	ОткрытьФорму("Справочник.ДисконтныеКарты.ФормаВыбора",
		ПараметрыФормы,
		Элемент.Родитель.ТекущиеДанные.БонуснаяКарта,
		УникальныйИдентификатор,,,
		ОписаниеОповещения,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуНачисленияСгорания(ИмяКоманды, ИспользоватьВыделенныеСтроки = Ложь)
	
	ДатаСгорания = ОбщегоНазначенияКлиент.ДатаСеанса();
	ДополнительныеПараметры = Новый Структура("ИспользоватьВыделенныеСтроки, ИмяКоманды", ИспользоватьВыделенныеСтроки, ИмяКоманды);
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьДатуНачисленияСгоранияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВводДаты(ОписаниеОповещения, ДатаСгорания, НСтр("ru = 'Укажите дату'"));
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты)
	
	ДокументыУНФ.ДатаПриИзменении(ДанныеДляИзмененияДаты, ЭтотОбъект, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

//@skip-check module-unused-method
&НаКлиенте	
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти
