
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму плиточного интерфейса подбора
//
// Параметры:
//  ПараметрыОткрытияИнтерфейсаПодбора - Структура:
//  	*СтруктураПлиточногоИнтерфейса - СправочникСсылка.ПалитраТоваровРМК.
//  	*ЗакрыватьПриВыбореТовара - Булево.
//  Владелец - форма или элемент управления другой формы.
//
Процедура ОткрытьПлиточныйИнтерфейсПодбора(ПараметрыОткрытияИнтерфейсаПодбора, Владелец) Экспорт
	
	ОткрытьФорму("Справочник.ПалитраТоваровРМК.Форма.ПлиточныйИнтерфейсВыбораТоваров",
		ПараметрыОткрытияИнтерфейсаПодбора,
		Владелец,
		Новый УникальныйИдентификатор,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Настраивает доступность перехода в режим оплаты на форме РМК
//
// Параметры:
//  Форма - форма РМК.
//  ДоступенРежимОплаты - Булево - предварительно рассчитанное значение доступности режима оплаты.
//
Процедура НастроитьДоступностьРежимаОплаты(Форма, ДоступенРежимОплаты = Неопределено) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;

	Если Форма.ПриемАванса Тогда
		
		ДоступенРежимОплаты = Истина;
		
	ИначеЕсли ДоступенРежимОплаты = Неопределено Тогда
		
		ДоступенРежимОплаты = (Объект.Товары.Количество() > 0) И (Элементы.ОбластьОперативногоУправленияЧеком
		= ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьТекущийСлойГруппы(Элементы.ГруппаСлоевСлужебнаяИнформацияЧека)); 
		
		ЭтоОперацияВозврат = ОбщегоНазначенияРМККлиент.ЭтоВидОперацииВозврат(Объект.ВидОперации);
		ЭтоВозвратТовара = ЭтоОперацияВозврат Или Форма.ЭтоВозвратБезОснования;
		
		КоличествоТоваров = Объект.Товары.Количество();
		ИндексТовара = 0;
		Пока ИндексТовара < КоличествоТоваров И ДоступенРежимОплаты Цикл
			Строка = Объект.Товары.Получить(ИндексТовара);
			
			Если Строка.НеобходимостьВводаКодаМаркировки И Не (ЗначениеЗаполнено(Строка.КодМаркировки))
				Или (Строка.ПроверятьЗаполнениеСерий И Не ЗначениеЗаполнено(Строка.СерияПредставление))
				Или (Строка.ПроверятьЗаполнениеПартий И Не ЗначениеЗаполнено(Строка.Партия))
				Или (Строка.ПроверятьЗаполнениеХарактеристики И Не ЗначениеЗаполнено(Строка.Характеристика))
				Или Строка.Количество = 0
				Или Строка.Цена = 0 Тогда
				
					ДоступенРежимОплаты = Ложь;
				
			КонецЕсли;
			ИндексТовара = ИндексТовара + 1;
		КонецЦикла;
		
	КонецЕсли;
	Элементы.ПлиткаГруппаОплатить.Доступность = ДоступенРежимОплаты;
	Элементы.КонтейнерКнопокПереходаКОплате.Доступность = ДоступенРежимОплаты;
	
КонецПроцедуры

// Устанавливает текст и цвет декорации персональных данных
//
// Параметры:
//  ДекорацияПерсональныеДанные - элемент формы декорация.
//  ТекстДекорации - Строка - устанавливаемый текст.
//
Процедура УстановитьТекстДекорацииОПерсональныхДанных(ДекорацияПерсональныеДанные, ТекстДекорации = "") Экспорт
	Перем ЦветТекста;
	
	Если ТекстДекорации = "" Тогда
		ЦветТекста = WebЦвета.Черный;
		ТекстДекорации = НСтр("ru = 'Подпишите заявление
		|о хранении персональных 
		|данных.'");
	Иначе
		ЦветТекста = WebЦвета.ТемноКрасный;
	КонецЕсли;
	ДекорацияПерсональныеДанные.Заголовок = ТекстДекорации;
	ДекорацияПерсональныеДанные.ЦветТекста = ЦветТекста;
	
КонецПроцедуры

Процедура ПодготовитьДанныеДляПлитки(Форма, ТоварыКВыбору = Неопределено) Экспорт

	Форма.ДанныеДляПлитки.Очистить();
	Если Форма.ДанныеКнопокПлиток.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ТипПостроенияПлитки = Форма.ТипыПостроенияПлитки.ПоПалитре Тогда
		ПодготовитьДанныеДляПлиткиПоПалитре(Форма);
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "РаспознаваниеБыло") Тогда
			Форма.РаспознаваниеБыло = Ложь;
			Форма.ТекущиеЭлектронныеВесы = Неопределено;
		КонецЕсли;
	ИначеЕсли Форма.ТипПостроенияПлитки = Форма.ТипыПостроенияПлитки.ВесовойТовар Тогда
		ПодготовитьДанныеВесовыхТоваровДляПлитки(Форма);
	ИначеЕсли Форма.ТипПостроенияПлитки = Форма.ТипыПостроенияПлитки.РаспознанныйВесовойТовар Тогда
		ПодготовитьДанныеРаспознанныхТоваровДляПлитки(Форма, ТоварыКВыбору);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКнопкиИзбранныхПозиций(Форма) Экспорт
	
	ОпорныеДанные = Форма.ОпорныеДанные;
	ДанныеКнопок = Форма.ДанныеКнопок;
	ТекущийПервыйИндекс = Форма.ТекущийПервыйИндексИзбранного;
	ТекущийВторойИндекс = Форма.ТекущийВторойИндексИзбранного;
	
	Если ДанныеКнопок.Количество() = 0 Или ТекущийПервыйИндекс = -1 Тогда
		Возврат;
	КонецЕсли;
	
	СкрыватьЦену = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СкрыватьЦенуИзбранных") Тогда
		СкрыватьЦену = Форма.СкрыватьЦенуИзбранных;
	КонецЕсли;
	
	ОтображатьОстаток = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОтображатьОстаток") Тогда
		ОтображатьОстаток = Форма.ОтображатьОстаток;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура();
	ИсточникиПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	
	Элементы = Форма.Элементы;
	ПараметрыЗаполнения.Вставить("ЕстьСледующаяСтраница", Ложь);
	ПараметрыЗаполнения.Вставить("ЕстьПредыдущаяСтраница", Ложь);
	МаксимальноеКоличествоНаСтранице = ИнтерфейсРМКСлужебныйКлиентСервер.КоличествоКарточекИзбранногоНаСтранице();
	ПараметрыЗаполнения.Вставить("НесколькоСтраниц", Ложь);
	ПараметрыЗаполнения.Вставить("ДанныеДляЗаполнения", Новый Массив);
	ПараметрыЗаполнения.Вставить("ТекущаяКатегорияРазмещения", 0);
	ПараметрыЗаполнения.Вставить("ОтображатьОстаток", ОтображатьОстаток);
	ПараметрыЗаполнения.Вставить("СкрыватьЦену", СкрыватьЦену);
	
	СтрокаПервогоЭлемента = ПолучитьЭлементМассиваПоИндексу(ОпорныеДанные, ТекущийПервыйИндекс);
	Если Не СтрокаПервогоЭлемента = Неопределено Тогда
		ПараметрыЗаполнения.ТекущаяКатегорияРазмещения = СтрокаПервогоЭлемента.НомерКатегорииРазмещенияЭлемента;
		Если СтрокаПервогоЭлемента.ИндексПозицииВКатегории > 1 Тогда
			ПараметрыЗаполнения.ЕстьПредыдущаяСтраница = Истина;
		КонецЕсли;
		ПараметрыЗаполнения.ДанныеДляЗаполнения.Добавить(СтрокаПервогоЭлемента);
		ФильтрКатегорииРазмещения = Новый Структура();
		ФильтрКатегорииРазмещения.Вставить("ИсточникПлитки", ИсточникиПлитки.Избранное);
		ФильтрКатегорииРазмещения.Вставить("НомерКатегорииРазмещенияЭлемента",
			ПараметрыЗаполнения.ТекущаяКатегорияРазмещения);
		СтрокиКатегории = ОпорныеДанные.НайтиСтроки(ФильтрКатегорииРазмещения);
		ПараметрыЗаполнения.НесколькоСтраниц = (СтрокиКатегории.Количество() > МаксимальноеКоличествоНаСтранице);
		ПараметрыЗаполнения.Вставить("КоличествоЭлементовНаСтранице",
			МаксимальноеКоличествоНаСтранице - ?(ПараметрыЗаполнения.НесколькоСтраниц, 2, 1));
		ПараметрыЗаполнения.Вставить("ИндексПлитки", ?(ТекущийВторойИндекс > 0,
			ТекущийВторойИндекс, ТекущийПервыйИндекс + 1));
		
		ЗаполнитьКнопкиИзбранныхПозицийПродолжение(Форма, ПараметрыЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКнопкиПлиток(Форма) Экспорт
	
	Перем СтрокаДанныхЭлементаПлитки;
	Перем ИзбраннаяПозиция;
	
	ДанныеКнопокПлиток = Форма.ДанныеКнопокПлиток;
	ДанныеДляПлитки = Форма.ДанныеДляПлитки;
	
	Если ДанныеКнопокПлиток.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СкрыватьЦену = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СкрыватьЦену") Тогда
		СкрыватьЦену = Форма.СкрыватьЦену;
	КонецЕсли;
	ОтображатьОстаток = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОтображатьОстаток") Тогда
		ОтображатьОстаток = Форма.ОтображатьОстаток;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	ПредставлениеВалюты = "";
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПредставлениеВалюты") Тогда
		ПредставлениеВалюты = Форма.ПредставлениеВалюты;
	КонецЕсли;
	КоличествоПлитокНаСтранице = Форма.КоличествоЭлементовВРяду * Форма.КоличествоРядовНаСтранице;
	КоличествоИндексов = КоличествоПлитокНаСтранице - 1;
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("ЕстьСледующаяСтраница", Ложь);
	ПараметрыЗаполнения.Вставить("ЕстьПредыдущаяСтраница", Ложь);
	ПараметрыЗаполнения.Вставить("НесколькоСтраниц", Ложь);
	ПараметрыЗаполнения.Вставить("ДанныеПлитокДляЗаполнения", Новый Массив);
	ПараметрыЗаполнения.Вставить("ПредставлениеВалюты", ПредставлениеВалюты);
	ПараметрыЗаполнения.Вставить("ОтображатьОстаток", ОтображатьОстаток);
	ПараметрыЗаполнения.Вставить("СкрыватьЦену", СкрыватьЦену);
	ПараметрыЗаполнения.Вставить("ТекущаяКатегорияРазмещения", 0);
	ПараметрыЗаполнения.Вставить("КоличествоЭлементовНаСтранице", КоличествоПлитокНаСтранице - 1);
	ПараметрыЗаполнения.Вставить("ИндексПлитки", 0);
	
	ПервыйИндексПлитки = Форма.ТекущийПервыйИндексПлитки;
	ВторойИндексПлитки = Форма.ТекущийВторойИндексПлитки;
	
	СтрокаПервогоЭлемента = ПолучитьЭлементМассиваПоИндексу(ДанныеДляПлитки, ПервыйИндексПлитки);
	Если Не СтрокаПервогоЭлемента = Неопределено Тогда
		ПараметрыЗаполнения.Вставить("ТекущаяКатегорияРазмещения", СтрокаПервогоЭлемента.НомерКатегорииРазмещенияЭлемента);
		Если СтрокаПервогоЭлемента.ИндексПозицииВКатегории > 1 Тогда
			ПараметрыЗаполнения.ЕстьПредыдущаяСтраница = Истина;
		КонецЕсли;
		ПараметрыЗаполнения.ДанныеПлитокДляЗаполнения.Добавить(СтрокаПервогоЭлемента);
		ФильтрКатегорииРазмещения = Новый Структура();
		ФильтрКатегорииРазмещения.Вставить("НомерКатегорииРазмещенияЭлемента",
			ПараметрыЗаполнения.ТекущаяКатегорияРазмещения);
		СтрокиКатегории = ОбщегоНазначенияРМККлиентСервер.НайтиСтрокиМассиваСтруктур(ДанныеДляПлитки,
			ФильтрКатегорииРазмещения);
		ПараметрыЗаполнения.НесколькоСтраниц = (СтрокиКатегории.Количество() > КоличествоПлитокНаСтранице);
		ПараметрыЗаполнения.Вставить("КоличествоЭлементовНаСтранице",
			КоличествоПлитокНаСтранице - ?(ПараметрыЗаполнения.НесколькоСтраниц, 2, 1));
		ПараметрыЗаполнения.Вставить("ИндексПлитки", ?(ВторойИндексПлитки > 0,
			ВторойИндексПлитки, ПервыйИндексПлитки + 1));
		
	КонецЕсли;
	ЗаполнитьКнопкиПлитокПродолжение(Форма, ПараметрыЗаполнения);
	
КонецПроцедуры

Функция ПолучитьНомерНажатойПлитки(ЭлементФормы) Экспорт
	
	РезультатФункции = Неопределено;
	
	ИмяПлиткиГруппы = "ПлиткаКарточкаГруппы";
	ИмяПлиткиЭлемента = "ПлиткаКарточкаЭлемента";
	ДлинаИмениГруппы = 22;
	ДлинаИмениЭлемента = 24;
	Если СтрНайти(ЭлементФормы.Имя, ИмяПлиткиГруппы) > 0 Тогда
		РезультатФункции = Сред(ЭлементФормы.Имя, ДлинаИмениГруппы);
	Иначе
		РезультатФункции = Сред(ЭлементФормы.Имя, ДлинаИмениЭлемента);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьНомерНажатогоИзбранного(ОбъектИнтерфейса) Экспорт
	
	РезультатФункции = Неопределено;
	
	ИмяКонтейнера = "КарточкаИзбранного_";
	ИмяКоманды = "ИзбранноеВыбор_";
	ДлинаИмениКонтейнера = 20;
	ДлинаИмениКоманды = 16;
	Если СтрНайти(ОбъектИнтерфейса.Имя, ИмяКонтейнера) > 0 Тогда
		РезультатФункции = Сред(ОбъектИнтерфейса.Имя, ДлинаИмениКонтейнера);
	ИначеЕсли СтрНайти(ОбъектИнтерфейса.Имя, ИмяКоманды) > 0 Тогда
		РезультатФункции = Сред(ОбъектИнтерфейса.Имя, ДлинаИмениКоманды);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьИменаЭлементовИзбранного() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("Контейнер", "КонтейнерИзбранное_");
	РезультатФункции.Вставить("СтраницаИзбранное", "СтраницаСодержимоеИзбранного_");
	РезультатФункции.Вставить("ВидПустой", "СтраницаИзбранноеПустоеМесто_");
	РезультатФункции.Вставить("СтраницыИзбранного", "СтраницыДанныхИзбранного_");
	РезультатФункции.Вставить("СтраницаЭлемента", "СтраницаИзбранногоЭлемент_");
	РезультатФункции.Вставить("СтраницаЭлементаСКартинкой", "СтраницаИзбранногоЭлементКартинка_");
	РезультатФункции.Вставить("СтраницаГруппы", "СтраницаИзбранногоГруппа_");
	РезультатФункции.Вставить("СтраницаГруппыСКартинкой", "СтраницаИзбранногоГруппаКартинка_");
	РезультатФункции.Вставить("КарточкаИзбранного", "КарточкаИзбранного_");
	РезультатФункции.Вставить("СтатусГруппы", "ИзбранноеСтатусаГруппы_");
	РезультатФункции.Вставить("СтатусГруппыСКартинкой", "ИзбранноеСтатусаГруппыКартинка_");
	РезультатФункции.Вставить("ТекстЭлемент", "НаименованиеЭлементаИзбранного_");
	РезультатФункции.Вставить("ТекстГруппа", "НаименованиеГруппыИзбранного_");
	РезультатФункции.Вставить("ТекстОстаток", "ОстатокВИзбранном_");
	РезультатФункции.Вставить("ТекстЦена", "ЦенаВИзбранном_");
	РезультатФункции.Вставить("Картинка", "ИзображениеИзбранногоЭлемент_");
	Возврат РезультатФункции;
	
КонецФункции

Функция НекорректноВведеныЦифрыДаты(МассивЦифрДаты) Экспорт

	РезультатФункции = Ложь;
	МассивОписанияОграничений = МассивОграниченийЦифрДаты();
	
	КопияМассиваСЦифрами = Новый Массив;
	КоличествоЭлементов = МассивЦифрДаты.Количество();
	ИндексЭлемента = 0;
	Пока ИндексЭлемента < КоличествоЭлементов Цикл
		КопируемоеЗначение = МассивЦифрДаты[ИндексЭлемента];
		Если КопируемоеЗначение = Неопределено Тогда
			КопируемоеЗначение = 0;
		КонецЕсли;
		КопияМассиваСЦифрами.Добавить(КопируемоеЗначение);
		ИндексЭлемента = ИндексЭлемента + 1;
	КонецЦикла;
	
	ИндексЭлементаОписания = 0;
	Пока ИндексЭлементаОписания < МассивОписанияОграничений.Количество() И Не РезультатФункции Цикл
		ОписаниеОграничения = МассивОписанияОграничений[ИндексЭлементаОписания];
		ПроверяемоеЗначение = КопияМассиваСЦифрами[ОписаниеОграничения.НомерПозиции];
		Если Не ПроверяемоеЗначение = Неопределено Тогда
			Если ЗначениеЗаполнено(ОписаниеОграничения.ТекстУсловия) Тогда
				ТекстВычисления = "КопияМассиваСЦифрами" + ОписаниеОграничения.ТекстУсловия;
				ЗначениеВычисления = Вычислить(ТекстВычисления);
				Если ЗначениеВычисления И ПроверяемоеЗначение > ОписаниеОграничения.МаксимальноеЗначение Тогда
					РезультатФункции = Истина;
				КонецЕсли;
			Иначе
				Если ПроверяемоеЗначение > ОписаниеОграничения.МаксимальноеЗначение Тогда
					РезультатФункции = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ИндексЭлементаОписания = ИндексЭлементаОписания + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

// Очищает поля ввода новой карты на форме РМК
//
// Параметры:
//  Форма - форма РМК.
//
Процедура ОчиститьПоляВводаНовойКарты(Форма) Экспорт
	
	СтрокаПустая = НСтр("ru = ''");
	Форма.НоваяКартаНомер = СтрокаПустая;
	Форма.НоваяКартаТелефон = СтрокаПустая;
	Форма.НоваяКартаПочта = СтрокаПустая;
	Форма.НоваяКартаФИО = СтрокаПустая;
	Форма.НоваяКартаДатаРождения = СтрокаПустая;
	
КонецПроцедуры

// Очищает поля ввода новой карты на форме РМК, если соответствующие данные не заполнены
//
// Параметры:
//  Форма - форма РМК.
//
Процедура ОчиститьПоляВводаНовойКартыПриНеобходимости(Форма) Экспорт
	
	СтрокаПустая = НСтр("ru = ''");
	Если Не ИнтерфейсРМКСлужебныйКлиентСервер.ДанныеДисконтнойКартыЗаполнены(Форма) Тогда
		Форма.НоваяКартаНомер = СтрокаПустая;
		Если Не ЗначениеЗаполнено(Форма.Объект.Контрагент) Тогда
			Форма.НоваяКартаТелефон = СтрокаПустая;
			Форма.НоваяКартаПочта = СтрокаПустая;
			Форма.НоваяКартаФИО = СтрокаПустая;
			Форма.НоваяКартаДатаРождения = СтрокаПустая;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыСозданнойКартыНаСервереЛояльности(Форма, ДанныеОтвета) Экспорт

	СтрокаXMLТолькоЧастьДата = Лев(ДанныеОтвета.DateOfBirth, 10);
	СтрокаДатыДляПреобразования = СтрЗаменить(СтрокаXMLТолькоЧастьДата, "-", "");
	ДатаРожденияКлиента = Дата(СтрокаДатыДляПреобразования);
	ДатаРожденияСтрокой = ?(ЗначениеЗаполнено(ДатаРожденияКлиента),
							Формат(ДатаРожденияКлиента, "ДЛФ=D"), "");
	
	Форма.НайденнаяКартаНомер = ДанныеОтвета.CardID;
	Форма.НайденнаяКартаФИО = ДанныеОтвета.Client;
	Форма.НайденнаяКартаДатаРождения = ДатаРожденияСтрокой;
	Форма.НайденнаяКартаТелефон = ДанныеОтвета.PhoneNumber;
	Форма.НайденнаяКартаПочта = ДанныеОтвета.Email;
	
	Форма.НоваяКартаНомер = ДанныеОтвета.CardID;
	Форма.НоваяКартаФИО = ДанныеОтвета.Client;
	Форма.НоваяКартаПочта = ДанныеОтвета.Email;
	Форма.НоваяКартаДатаРождения = ДатаРожденияСтрокой;
	
	МаскаТелефона = ИнтерфейсРМКСлужебныйКлиентСервер.МаскаВводаТелефона();
	Форма.ОтправкаЧекаПочта = ДанныеОтвета.Email;
	Форма.ОтправкаЧекаТелефон
		= ИнтерфейсРМКСлужебныйКлиентСервер.ПривестиЗначениеКМаскеТелефона(ДанныеОтвета.PhoneNumber, МаскаТелефона);
	
	Форма.ПараметрыКартыЛояльности = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыКартыЛояльности();
	Форма.ПараметрыКартыЛояльности.ИдентификаторКарты = ДанныеОтвета.CardRef;
	Форма.ПараметрыКартыЛояльности.КодКарты = ДанныеОтвета.CardID;
	Форма.ПараметрыКартыЛояльности.ФИО = ДанныеОтвета.Client;
	Форма.ПараметрыКартыЛояльности.НомерТелефонаВладельцаКарты = ДанныеОтвета.PhoneNumber;
	Форма.ПараметрыКартыЛояльности.АдресЭПВладельцаКарты = ДанныеОтвета.Email;
	Форма.ПараметрыКартыЛояльности.ДатаРождения = ДатаРожденияКлиента;
	
КонецПроцедуры

Функция ЗаполненаКонтактнаяИнформацияДляОтправкиЧека(Форма, РедактированиеПочты = Ложь,
		РедактированиеТелефона = Ложь) Экспорт
	
	РезультатФункции = Ложь;
	
	Элементы = Форма.Элементы;
	СтрокаТелефона = ?(РедактированиеТелефона, Элементы.ОтправкаЧекаТелефон.ТекстРедактирования,
		Форма.ОтправкаЧекаТелефон);
	СтрокаПочты = ?(РедактированиеПочты, Элементы.ОтправкаЧекаПочта.ТекстРедактирования, Форма.ОтправкаЧекаПочта);
	
	НомерТелефонаДляОтправки = ОбщегоНазначенияРМККлиентСервер.ПодготовитьНомерТелефона(СтрокаТелефона);
	НомерТелефонаВведенКорректно = ЗначениеЗаполнено(НомерТелефонаДляОтправки);
	
	АдресЭлектроннойПочтыВведенКорректно = Ложь;
	Если Не Форма.РежимКассыСамообслуживания Тогда
		АдресЭлектроннойПочтыВведенКорректно =
			ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(СокрЛП(СтрокаПочты));
	КонецЕсли;
		
	Если НомерТелефонаВведенКорректно Или АдресЭлектроннойПочтыВведенКорректно Тогда
		РезультатФункции = Истина;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ИнициализироватьТипыПостроенияПлитки(Форма) Экспорт
	
	Форма.ТипыПостроенияПлитки = Новый Структура;
	Форма.ТипыПостроенияПлитки.Вставить("ПоПалитре", 0);
	Форма.ТипыПостроенияПлитки.Вставить("ВесовойТовар", 1);
	Форма.ТипыПостроенияПлитки.Вставить("РаспознанныйВесовойТовар", 2);
	
КонецПроцедуры

Функция ОбщаяЧастьИмениГруппВидовОплат() Экспорт
	
	Возврат "ГруппаВидОплаты";
	
КонецФункции

Процедура ОпределитьИспользуемыеВидыОплат(Форма) Экспорт
	
	ГруппыИсключения = Новый Массив;
	ГруппыИсключения.Добавить("ГруппаВидОплатыНаличными");
	ГруппыИсключения.Добавить("ГруппаВидОплатыКартой");
	ГруппыИсключения.Добавить("ГруппаВидОплатыСертификатом");
	ГруппыИсключения.Добавить("ГруппаВидОплатыНСПК");
	ГруппыИсключения.Добавить("ГруппаВидОплатыСБП");
	ГруппыИсключения.Добавить("ГруппаВидОплатыЮКасса");
	ГруппыИсключения.Добавить("ГруппаВидОплатыВыдачаНаличных");
	
	Форма.ИспользуемыеВидыОплат = Новый Массив;
	НачалоИмениГруппы = ОбщаяЧастьИмениГруппВидовОплат();
	ДлинаОбщейЧасти = СтрДлина(НачалоИмениГруппы);
	Элементы = Форма.Элементы;
	ГруппаВидовОплат = Элементы.ГруппаВидовОплат;
	Для Каждого ГруппаВидаОплаты Из ГруппаВидовОплат.ПодчиненныеЭлементы Цикл
		
		Если ЭтоГруппаВидаОплаты(ГруппаВидаОплаты)
				И ГруппыИсключения.Найти(ГруппаВидаОплаты.Имя) = Неопределено И ГруппаВидаОплаты.Видимость Тогда
			ИмяВидаОплаты = Сред(ГруппаВидаОплаты.Имя, ДлинаОбщейЧасти + 1);
			Форма.ИспользуемыеВидыОплат.Добавить(ИмяВидаОплаты);
		КонецЕсли;
		
	КонецЦикла;
	Если Форма.ИспользоватьОплатуНаличными Тогда
		Форма.ИспользуемыеВидыОплат.Добавить("Наличными");
	КонецЕсли;
	Если Форма.ВыдаватьНаличныеНаКассе Тогда
		Форма.ИспользуемыеВидыОплат.Добавить("ВыдачаНаличных");
	КонецЕсли;
	Если Форма.ИспользоватьОплатуПлатежнымиКартами Тогда
		Форма.ИспользуемыеВидыОплат.Добавить("Картой");
	КонецЕсли;
	Если Форма.ИспользоватьОплатуСертификатами Тогда
		Форма.ИспользуемыеВидыОплат.Добавить("Сертификатом");
	КонецЕсли;
	Если Форма.ИспользоватьОплатуСертификатамиНСПК Тогда
		Форма.ИспользуемыеВидыОплат.Добавить("НСПК");
	КонецЕсли;
	ТипыПлатежныхСистем = МенеджерОборудованияРМККлиент.ТипыПлатежнойСистемыККТ();
	ОтборСБП = Новый Структура("ПлатежнаяСистема", ТипыПлатежныхСистем.Получить("СистемаБыстрыхПлатежей"));
	ОтборЮКасса = Новый Структура("ПлатежнаяСистема", ТипыПлатежныхСистем.Получить("ЮКасса"));
	ОплатыСБП = Форма.ПлатежнаяСистема_ВидыОплат.НайтиСтроки(ОтборСБП);
	ОплатыЮКасса = Форма.ПлатежнаяСистема_ВидыОплат.НайтиСтроки(ОтборЮКасса);
	Если ОплатыСБП.Количество() > 0 Тогда
		Форма.ИспользуемыеВидыОплат.Добавить("СБП");
	КонецЕсли;
	Если ОплатыЮКасса.Количество() > 0 Тогда
		Форма.ИспользуемыеВидыОплат.Добавить("ЮКасса");
	КонецЕсли;
	
	РасширитьИнтервалМеждуВидамиОплатПриНеобходимости(Форма);
	
КонецПроцедуры

// Получает максимально возможную сумму оплаты бонусами чека, в котором еще не выбрана оплата бонусами
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - Форма рабочего места кассира.
// 
// Возвращаемое значение:
// Число - Максимальная сумма оплаты бонусами
//
Функция ПолучитьМаксимальноВозможнуюСуммуОплатыБонусами(Форма) Экспорт
	
	МаксимальноВозможнаяСуммаБонусов = 0;
	КурсБонусов = ?(Форма.КурсБонусов = 0, 1, Форма.КурсБонусов);
	Если Форма.СуммаОплаченоБонусами = 0 Тогда
		ОсталосьОплатитьЗаТовар = ИнтерфейсРМКСлужебныйКлиент.ПолучитьОставшуюсяСуммуОплатыПоЧеку(Форма);
		ОстатокБонусовВДенежномВыражении = Окр(Форма.КоличествоБонусов * КурсБонусов, 2);
		ОграничениеПрограммы = Форма.ТаблицаСуммМаксимальнойОплатыбонусами.Итог("Сумма");
		Если НЕ ЗначениеЗаполнено(ОграничениеПрограммы) Тогда
			ОграничениеПрограммы = Окр(ОсталосьОплатитьЗаТовар * Форма.ПроцентОплатыБонусами / 100, 2);
		КонецЕсли;
		Если Форма.КоличествоБонусовОграничение > 0
			И Форма.КоличествоБонусовОграничение > Форма.КоличествоБонусов Тогда
			ОстатокБонусовВДенежномВыражении = 0;
		КонецЕсли;
		МаксимальноВозможнаяСуммаБонусов = Мин(ОсталосьОплатитьЗаТовар, ОграничениеПрограммы, ОстатокБонусовВДенежномВыражении);
	КонецЕсли;
	Возврат Окр(МаксимальноВозможнаяСуммаБонусов / КурсБонусов, 2);
	
КонецФункции

// Получает итоговую сумму чека, за вычетом введенных сумм по видам оплат
//
// Параметры:
//  Форма - форма РМК.
//
Функция ПолучитьОставшуюсяСуммуОплатыПоЧеку(Форма) Экспорт
	
	Возврат Форма.СуммаИтого - Форма.СуммаОплаченоНал - Форма.СуммаОплаченоБН - Форма.СуммаОплаченоБезнал
		- Форма.СуммаОплаченоВРассрочку - Форма.СуммаОплаченоЗачетАванса - Форма.СуммаОплаченоСертификатами;
	
КонецФункции
	
Процедура СкорректироватьДатуРожденияПриНеобходимости(Форма, ИмяРеквизитаДатыРождения) Экспорт
	
	ДлинаЧастиДатыМесяца = 2;
	ДлинаГода = 4;
	ДлинаГодаСокращенная = 2;
	НачальнаяПозицияЧастиМесяца = 4;
	НачальнаяПозицияЧастиГода = 7;
	СтоЛетВМесяцах = 1200;
	ЗначениеДатыСтрокой = Форма[ИмяРеквизитаДатыРождения];
	СтрокаДня = Лев(ЗначениеДатыСтрокой, ДлинаЧастиДатыМесяца);
	СтрокаМесяца = Сред(ЗначениеДатыСтрокой, НачальнаяПозицияЧастиМесяца, ДлинаЧастиДатыМесяца);
	СтрокаГода = Сред(ЗначениеДатыСтрокой, НачальнаяПозицияЧастиГода);
	ДеньИМесяцЗаполнены = Ложь;
	ТекущаяДатаКлиента = ОбщегоНазначенияКлиент.ДатаСеанса();
	Если СтрДлина(СокрЛП(СтрокаДня)) = ДлинаЧастиДатыМесяца
			И СтрДлина(СокрЛП(СтрокаМесяца)) = ДлинаЧастиДатыМесяца Тогда
		ДеньИМесяцЗаполнены = Истина;
	КонецЕсли;
	Если СтрДлина(СокрЛП(СтрокаГода)) = ДлинаГодаСокращенная И ДеньИМесяцЗаполнены Тогда
		ТекущийГодСтрокой = Формат(Год(ТекущаяДатаКлиента), "ЧГ=");
		ПерваяЧастьГода = Лев(ТекущийГодСтрокой, ДлинаГода - ДлинаГодаСокращенная);
		ОписаниеТипаДата = Новый ОписаниеТипов("Дата");
		ДатаКаноническаяСтрока = СтрШаблон("%1%2%3%4", ПерваяЧастьГода, СокрЛП(СтрокаГода), СтрокаМесяца, СтрокаДня);
		ПредварительнаяДата = ОписаниеТипаДата.ПривестиЗначение(ДатаКаноническаяСтрока);
		Если ЗначениеЗаполнено(ПредварительнаяДата) Тогда
			Если ПредварительнаяДата >= НачалоДня(ТекущаяДатаКлиента) Тогда
				ПредварительнаяДата = ДобавитьМесяц(ПредварительнаяДата, - СтоЛетВМесяцах);
			КонецЕсли;
			Форма[ИмяРеквизитаДатыРождения] = Формат(ПредварительнаяДата, "ДЛФ=D");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ВозможныеОперацииСотрудникаВКСО() Экспорт
	
	ВозможныеОперации = Новый Структура();
	ВозможныеОперации.Вставить("ПродолжитьРаботу", 0);
	ВозможныеОперации.Вставить("ЗавершитьРаботу", 1);
	ВозможныеОперации.Вставить("ПроверитьЧек", 2);
	ВозможныеОперации.Вставить("ОбучитьУстройстваРаспознавания", 3);
	ВозможныеОперации.Вставить("ЗакрытьОткрытьКассовуюСмену", 4);
	ВозможныеОперации.Вставить("ЗаблокироватьКСО", 5);
	
	Возврат ВозможныеОперации;
	
КонецФункции

Процедура НастроитьОтображениеОтбораВесовогоТовара(Форма, ВключитьОтбор) Экспорт
	
	Если Не Форма.ВключитьОтборВесовогоТовара = ВключитьОтбор Тогда
		Форма.ВключитьОтборВесовогоТовара = ВключитьОтбор;
	КонецЕсли;
	Если Форма.РежимКассыСамообслуживания Тогда
		Элементы = Форма.Элементы;
		ЦветаФормы = Форма.ЦветаФормы;
		Элементы.КнопкаВесовойОтборКСО.ЦветФона = ?(ВключитьОтбор, ЦветаФормы.АктивнаяКнопка, Форма.ЦветФонаОтборВеса);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОтображениеЗаголовкаФормы(Форма) Экспорт
	
	Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
		Если КлиентскоеПриложение.ПолучитьРежимОсновногоОкна() = РежимОсновногоОкнаКлиентскогоПриложения.Обычный Тогда
			Форма.ОтображатьЗаголовок = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОбработкеРасшифровки(ФормаОтчета, Расшифровка, СтандартнаяОбработка) Экспорт
	
	Если Расшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ФормаОтчета.НастройкиОтчета.ПолноеИмя = "Отчет.НезавершенныеДействияСЧекомРМК" Тогда
		ОбработкаРасшифровкиНезавершенныеДействияСЧекомРМК(ФормаОтчета.ОтчетДанныеРасшифровки, Расшифровка,
			СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаРасшифровкиНезавершенныеДействияСЧекомРМК(ДанныеРасшифровки,
		Расшифровка, СтандартнаяОбработка) Экспорт
	
	ПоляОтбора = ОбщегоНазначенияРМКВызовСервера.ПолучитьДанныеРасшифровкиНезавершенныхДействийСЧеком(Расшифровка,
		ДанныеРасшифровки);
		
	Если Не ПоляОтбора = Неопределено Тогда
		
		СобытиеОповещения = "УстановитьСтроку";
		ФормаСпискаРегистра = ОткрытьФорму("РегистрСведений.ЖурналДействийКассира.ФормаСписка", ПоляОтбора, ЭтотОбъект);
		Оповестить(СобытиеОповещения, ПоляОтбора, ФормаСпискаРегистра);
		
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ПронумероватьИерархиюПалитрыТоваров(СтрокаРодитель, НомерСтроки = Неопределено) Экспорт
	
	ПодчиненныеСтроки = СтрокаРодитель.ПолучитьЭлементы();
	Если ПодчиненныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПорядковыйНомер = 0;
	Для Каждого СтрокаДерева Из ПодчиненныеСтроки Цикл
		
		Если Не НомерСтроки = Неопределено Тогда
			НомерСтроки = НомерСтроки + 1;
			СтрокаДерева.НомерСтроки = НомерСтроки;
		КонецЕсли;
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
		СтрокаДерева.ИндексПозиции = ПорядковыйНомер;
		ПронумероватьИерархиюПалитрыТоваров(СтрокаДерева, НомерСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПанельОперацийПриСменеРежимаПлитки(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	НастройкиЭлементов = Форма.СвойстваНастроекЭлементов;
	ГруппаОтбора = ?(Форма.РежимПлитки, ЗаголовкиОбластей.ПлиточныйИнтерфейс, ЗаголовкиОбластей.ОбластьПанельОпераций);
	НаборСвойств = НастройкиЭлементов.Получить(ГруппаОтбора);
	
	ИнтерфейсРМКСлужебныйКлиентСервер.ОпределитьПрименитьВыравниваниеГруппыОперации(Форма, НаборСвойств);
	НастройкиЧасов = ПолучитьНастройкиЧасовРМК(Форма);
	ЗапуститьЧасы(Форма, НастройкиЧасов);
	
	ПоказатьСтатусСмены = (Не Форма.РежимКассыСамообслуживания)
		И ИнтерфейсРМКСлужебныйКлиентСервер.ПоказыватьСтатусКассовыхСмен(НастройкиЭлементов);
	ИмяСвойстваШирины = "ШиринаСтатусаСмены";
	ПоложениеЛево = НСтр("ru = 'Лево'");
	ШиринаСтатусаОбычныйРежим = Форма.СвойстваНастроекЭлементов.Получить(ИмяСвойстваШирины);
	ШиринаСтатусаСмены = ?(Форма.РежимПлитки, 4, ШиринаСтатусаОбычныйРежим);
	ЭлементСтатусСмены = Форма.Элементы.ДекорацияСтатусСмены;
	ЭлементСтатусСмены.Видимость = ПоказатьСтатусСмены;
	//ПоложениеСтатусаСмены = Новый Структура();
	//Если ПоказатьСтатусСмены Тогда
	//	ЭлементСтатусСмены.Ширина = ШиринаСтатусаСмены;
	//	ГруппаРодитель = "ГруппаОперации";
	//	ЭлементСправа = "ПодгруппаОтложитьЧек";
	//	Если НастройкиЧасов.Использование Тогда
	//		ГруппаРодитель = "ПодгруппаЧасыСтатусСмены";
	//		Если НастройкиЧасов.ПоложениеЧасов = ПоложениеЛево Тогда
	//			ЭлементСправа = "КартинкаЧасы";
	//		Иначе
	//			ЭлементСправа = "";
	//		КонецЕсли;
	//	КонецЕсли;
	//	ПоложениеСтатусаСмены.Вставить("ГруппаРодитель", ГруппаРодитель);
	//	ПоложениеСтатусаСмены.Вставить("ЭлементСправа", ЭлементСправа);
	//КонецЕсли;
	//ДополнительныеПараметры.Вставить("ПоложениеСтатусаСмены", ПоложениеСтатусаСмены);
	
КонецПроцедуры

Процедура НастроитьПерсонализированнуюПанельОпераций(Форма) Экспорт
	
	Если Форма.РежимКассыСамообслуживания Или Не Форма.ОсновнойПодборПлиточный Тогда
		НастройкиЧасов = ПолучитьНастройкиЧасовРМК(Форма);
		ЗапуститьЧасы(Форма, НастройкиЧасов);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСодержимоеИменнойОбластиСхемыФормыРМК(Форма, ДанныеБлока, ДополнительныеПараметры) Экспорт
	
	РезультатФункции = "";
	ИмяОбластиРабочаяОбласть = "Страницы_";
	ИмяОбластиСпискаТоваров = "ПанельТаблицыТоваров_";
	ИмяОбластиГлавнойКоманды = "ОсновнаяКоманднаяПанельУправленияЧеком_";
	ИмяОбластиПлиткиГоризонтально = "ГруппаПанельИнформацииГор_Горизонтальная";
	ИмяОбластиПлиткиВертикально = "ГруппаПанельИнформацииВер_Вертикальная";
	
	Если СтрНайти(ДанныеБлока.ИмяОбласти, ИмяОбластиСпискаТоваров) = 1 Тогда
		РезультатФункции = СодержимоеОбластиСпискаТоваров(ДанныеБлока);
	ИначеЕсли СтрНайти(ДанныеБлока.ИмяОбласти, ИмяОбластиГлавнойКоманды) = 1 Тогда
		РезультатФункции = СодержимоеОбластиГлавнойКоманды(ДанныеБлока);
	ИначеЕсли СтрНайти(ДанныеБлока.ИмяОбласти, ИмяОбластиРабочаяОбласть) = 1 Тогда
		РезультатФункции = СодержимоеОбластиДомашнейСтраницы(Форма.ЗаставкаСтрокой);
	ИначеЕсли ДанныеБлока.ИмяОбласти = ИмяОбластиПлиткиГоризонтально
			Или ДанныеБлока.ИмяОбласти = ИмяОбластиПлиткиВертикально Тогда
		РезультатФункции = СодержимоеОбластиПлитки(ДополнительныеПараметры.РеквизитыПалитры);
	Иначе
		РезультатФункции = СодержимоеТиповойОбласти(ДанныеБлока);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ЭтоУвеличенныйВариантМасштаба(Форма, СценарийИспользования)
	
	РезультатФункции = Ложь;
	СценарийСамообслуживания = ПредопределенноеЗначение("Перечисление.СценарииИспользованияРМК.ТерминалСамообслуживания");
	Если СценарийИспользования = СценарийСамообслуживания Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "УвеличенныйВариантМасштаба") Тогда
			РезультатФункции = Форма.УвеличенныйВариантМасштаба;
		Иначе
			РезультатФункции = Форма.НастройкиРМК.УвеличенныйВариантМасштаба;
		КонецЕсли;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьЗначениеНастройкиФормы(Форма, ИмяНастройки)
	
	РезультатФункции = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяНастройки) Тогда
		РезультатФункции = Форма[ИмяНастройки];
	Иначе
		РезультатФункции = Форма.НастройкиРМК[ИмяНастройки];
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция СформироватьДокументСхемыФормыРМК(Форма) Экспорт
	
	Интерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	
	Элементы = Форма.Элементы;
	СценарийИспользования = ПолучитьЗначениеНастройкиФормы(Форма, "СценарийИспользования");
	ВидОтображения = ПолучитьЗначениеНастройкиФормы(Форма, "ВидОтображения");
	УвеличенныйВариантМасштаба = ЭтоУвеличенныйВариантМасштаба(Форма, СценарийИспользования);
	
	ИмяТекущейОбласти = "";
	ЭлементДеревоОбластей = Элементы.Найти("ДеревоОбластейФормыРМК");
	Если Не ЭлементДеревоОбластей = Неопределено Тогда
		ТекущиеДанныеОбласти = ЭлементДеревоОбластей.ТекущиеДанные;
		Если Не ТекущиеДанныеОбласти = Неопределено Тогда
			ИмяТекущейОбласти = ТекущиеДанныеОбласти.ИмяОбласти;
		КонецЕсли;
	КонецЕсли;
	ТипыГруппировок = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыГруппировок();
	
	КоэффициентМасштаба = 0;
	Если УвеличенныйВариантМасштаба И Интерфейс85 Тогда
		КоэффициентМасштаба = 1;
	ИначеЕсли ВидОтображения = ПредопределенноеЗначение("Перечисление.ВидыОтображения.Увеличенный") И Не Интерфейс85 Тогда
		КоэффициентМасштаба = 1;
	ИначеЕсли ВидОтображения = ПредопределенноеЗначение("Перечисление.ВидыОтображения.Уменьшенный") И Не Интерфейс85 Тогда
		КоэффициентМасштаба = -1;
	КонецЕсли;
	РазмерТекстаОбластей = 20;
	СмещениеРазмераТекста = 4;
	РазмерТекстаОбластей = РазмерТекстаОбластей + КоэффициентМасштаба * СмещениеРазмераТекста;
	
	РазмерТекстаСпискаТоваров = 38;
	СмещениеРазмераТекстаСпискаТоваров = 6;
	РазмерТекстаСпискаТоваров = РазмерТекстаСпискаТоваров + КоэффициентМасштаба * СмещениеРазмераТекстаСпискаТоваров;
	
	ШиринаЯчейкиВПроцентах = Цел(100 / Форма.РеквизитыПалитры.КоличествоЭлементовВРяду);
	ВысотаЯчейкиВПроцентах = Цел(100 / Форма.РеквизитыПалитры.КоличествоРядовНаСтранице);
	БлокСтилей = 
	".generalBlock {
	|	border: 1px solid black;
	|	padding: 0px;
	|		}
	|.detailedBlock {
	|	border: 1px dotted black;
	|	padding: 0px;
	|		}
	|.selectedBlock {
	|	border: 2px solid red;
	|		}
	|.ordinaryLabel {
	|			text-align: center;
	|			vertical-align: middle;
	|			align: center;
	|			font-size: &LabelSizepx;
	|	}
	|.plateTd {
	|			width: &CellWidth%;
	|			border: 0px;
	|			background-color: #C0C0C0;
	|		}
	|.plateTr {
	|			height: &CellHeight%;
	|		}
	|.plateTable {
	|			width: 100%;
	|			height: 100%;
	|		}
	|#goodsList {
	|			text-align: center;
	|			vertical-align: middle;
	|			align: center;
	|			font-size: &GoodsFontSizepx;
	|	}";
	БлокСтилей = СтрЗаменить(БлокСтилей, "&GoodsFontSize", Формат(РазмерТекстаСпискаТоваров, "ЧГ="));
	БлокСтилей = СтрЗаменить(БлокСтилей, "&LabelSize", Формат(РазмерТекстаОбластей, "ЧГ="));
	БлокСтилей = СтрЗаменить(БлокСтилей, "&CellWidth", ШиринаЯчейкиВПроцентах);
	БлокСтилей = СтрЗаменить(БлокСтилей, "&CellHeight", ВысотаЯчейкиВПроцентах);
	
	БлокПанелей = ПолучитьВложенныйБлок(Форма, Форма.ДеревоОбластейФормыРМК.ПолучитьЭлементы(),
		ТипыГруппировок.Вертикальная, ИмяТекущейОбласти, 1);
	
	СтильГлавнойГруппы = СформироватьСтильГлавнойГруппы(Форма);

	ШаблонДокумента = ШаблонСхемыФормыРМК();
	СодержимоеДокумента = СтрЗаменить(ШаблонДокумента, "&WrapperStyle}", СтильГлавнойГруппы);
	СодержимоеДокумента = СтрЗаменить(СодержимоеДокумента, "&StyleContent", БлокСтилей);
	СодержимоеДокумента = СтрЗаменить(СодержимоеДокумента, "&FieldContent", БлокПанелей);
	
	Возврат СодержимоеДокумента;
	
КонецФункции

Функция ОчиститьКэшКонтроляПродаж(КэшКонтроляПродаж, ТолькоДанныеКорзины = Ложь) Экспорт
	
	Если ТолькоДанныеКорзины Тогда
		ПостоянныеЭлементыКонтроляПродаж = ПолучитьПостоянныеЭлементыКонтроляПродаж(КэшКонтроляПродаж);
		ПостоянныеВидыКонтроля = ПолучитьПостоянныеВидыКонтроля(КэшКонтроляПродаж, ПостоянныеЭлементыКонтроляПродаж);
		КоличествоСтрокЭлементовКонтроля = КэшКонтроляПродаж.ЭлементыКонтроляПродаж.Количество();
		КоличествоСтрокВидов = КэшКонтроляПродаж.СтрокиВидовКонтроля.Количество();
		
		ИндексСтроки = 0;
		Пока ИндексСтроки < КоличествоСтрокЭлементовКонтроля Цикл
			ТекущийИндекс = КоличествоСтрокЭлементовКонтроля - ИндексСтроки - 1;
			СтрокаЭлементаКонтроля = КэшКонтроляПродаж.ЭлементыКонтроляПродаж.Получить(ТекущийИндекс);
			Если ПостоянныеЭлементыКонтроляПродаж.Найти(СтрокаЭлементаКонтроля.КонтрольПродаж) = Неопределено Тогда
				КэшКонтроляПродаж.ЭлементыКонтроляПродаж.Удалить(ТекущийИндекс);
			КонецЕсли;
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
		
		ИндексСтроки = 0;
		Пока ИндексСтроки < КоличествоСтрокВидов Цикл
			ТекущийИндекс = КоличествоСтрокВидов - ИндексСтроки - 1;
			СтрокаВида = КэшКонтроляПродаж.СтрокиВидовКонтроля.Получить(ТекущийИндекс);
			Если ПостоянныеВидыКонтроля.Найти(СтрокаВида.ВидКонтроля) = Неопределено Тогда
				КэшКонтроляПродаж.СтрокиВидовКонтроля.Удалить(ТекущийИндекс);
			КонецЕсли;
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
	Иначе
		КэшКонтроляПродаж.ЭлементыКонтроляПродаж.Очистить();
		КэшКонтроляПродаж.СтрокиВидовКонтроля.Очистить();
		КэшКонтроляПродаж.НоменклатураПлиткиКонтроляПродаж.Очистить();
		КэшКонтроляПродаж.ОбщийКонтрольПродаж.Очистить();
	КонецЕсли;
	КэшКонтроляПродаж.НоменклатураКонтроляПродаж.Очистить();
	
КонецФункции

Функция ШаблонРезультатаКонтроляПродаж() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("КонтролируемыеСтрокиТоваров", Новый Массив);
	РезультатФункции.Вставить("ОграниченияПродаж", Новый Массив);
	РезультатФункции.Вставить("ОповещениеПриУспехе", Неопределено);
	РезультатФункции.Вставить("ОповещениеПриОтказе", Неопределено);
	РезультатФункции.Вставить("ЭтапКонтроля", -1);
	РезультатФункции.Вставить("НуженПересчет", Ложь);
	РезультатФункции.Вставить("ДобавлениеПодбором", Ложь);
	РезультатФункции.Вставить("ДобавлениеИзПлитки", Ложь);
	РезультатФункции.Вставить("НужнаПроверкаДоступностиОплаты", Ложь);
	РезультатФункции.Вставить("БылоУдалениеСтрок", Ложь);
	РезультатФункции.Вставить("ТекстПредупрежденияЗапретаОплатыБонусами", "");
	РезультатФункции.Вставить("НеВыводитьЗапретБонусов", Ложь);
	РезультатФункции.Вставить("БылоИзменениеЦены", Ложь);
	РезультатФункции.Вставить("ТребуетсяПроверкаМарки", Ложь);
	РезультатФункции.Вставить("КонтекстПроверкиМарки", Неопределено);
	РезультатФункции.Вставить("СтартКонтроля", Ложь);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция СформироватьЗаголовокПредупрежденияПоТипуКонтроля(ТипКонтроля) Экспорт
	
	РезультатФункции = "";
	
	Если ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваВСтроке") Тогда
		РезультатФункции = НСтр("ru = 'Превышение допустимого количества в строке товара.'");
	ИначеЕсли ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваСтрокВЧеке") Тогда
		РезультатФункции = НСтр("ru = 'Превышение количества строк в чеке.'");
	ИначеЕсли ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитСуммыВЧеке") Тогда
		РезультатФункции = НСтр("ru = 'Превышение допустимой суммы в чеке.'");
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ЭтапыКонтроляПродаж() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ДобавлениеТовара", 0);
	РезультатФункции.Вставить("ОткрытиеЧека", 1);
	РезультатФункции.Вставить("ПробитиеЧека", 2);
	РезультатФункции.Вставить("ИзменениеСтрокиТовара", 3);
	РезультатФункции.Вставить("ПереходКОплате", 4);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ВыполнитьПроверкиКонтроляПродаж(Форма, ЭтапКонтроля, ДополнительныеПараметры = Неопределено) Экспорт
	
	ЭтапыКонтроляПродаж = ЭтапыКонтроляПродаж();
	Если (ЭтапКонтроля = ЭтапыКонтроляПродаж.ДобавлениеТовара И Форма.СписокДобавленныхСтрокТоваров.Количество() = 0)
			Или Не Форма.ИспользоватьКонтрольПродаж Тогда
		Форма.СписокДобавленныхСтрокТоваров.Очистить();
		Возврат;
	КонецЕсли;
	
	РезультатКонтроля = Форма.РезультатКонтроляПродаж;
	КэшКонтроляПродаж = Форма.КэшКонтроляПродаж;
	ИспользуемыеТипыКонтроля = ПолучитьТипыКонтроляЭтапа(ЭтапКонтроля);
	
	ОчиститьРезультатКонтроляПродаж(РезультатКонтроля);
	РезультатКонтроля.ЭтапКонтроля = ЭтапКонтроля;
	Если ЭтапКонтроля = ЭтапыКонтроляПродаж.ДобавлениеТовара
			Или ЭтапКонтроля = ЭтапыКонтроляПродаж.ИзменениеСтрокиТовара Тогда
			
		Для Каждого СтрокаДобавленногоТовара Из Форма.СписокДобавленныхСтрокТоваров Цикл
			ОтборСтроки = Новый Структура("ИдентификаторСтроки", СтрокаДобавленногоТовара.Значение);
				
			СтрокиТоваров = Форма.объект.Товары.НайтиСтроки(ОтборСтроки);
			Если СтрокиТоваров.Количество() > 0 Тогда
				РезультатКонтроля.КонтролируемыеСтрокиТоваров.Добавить(СтрокиТоваров[0]);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	ДатаПроверки = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	ОтобранныеВидыКонтроля = ОтобратьВидыКонтроляПоТипам(КэшКонтроляПродаж, ИспользуемыеТипыКонтроля);
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ЭтапКонтроля", ЭтапКонтроля);
	ПараметрыПроверки.Вставить("МассивВидовКонтроля", ОтобранныеВидыКонтроля.МассивВидовКонтроля);
	ПараметрыПроверки.Вставить("СоответствиеСтрокВидовКонтроля", ОтобранныеВидыКонтроля.СоответствиеСтрокВидовКонтроля);
	ПараметрыПроверки.Вставить("ДатаПроверки", ДатаПроверки);
	ПараметрыПроверки.Вставить("ИспользуемыеТипыКонтроля", ИспользуемыеТипыКонтроля);
	
	КоличествоОбщихЭлементов = КэшКонтроляПродаж.ОбщийКонтрольПродаж.Количество();
	ИндексЭлементаКонтроля = 0;
	Пока ИндексЭлементаКонтроля < КоличествоОбщихЭлементов Цикл
		ЭлементОбщегоКонтроля = КэшКонтроляПродаж.ОбщийКонтрольПродаж.Получить(ИндексЭлементаКонтроля);
		СтрокаЭлементаКонтроляПродаж = ПолучитьСтрокуЭлементаКонтроляПродаж(КэшКонтроляПродаж, ЭлементОбщегоКонтроля);
		Если Не СтрокаЭлементаКонтроляПродаж = Неопределено Тогда
			
			КоличествоСтрокКонтроля = СтрокаЭлементаКонтроляПродаж.СтрокиКонтроля.Количество();
			ИндексСтрокиКонтроля = 0;
			Пока ИндексСтрокиКонтроля < КоличествоСтрокКонтроля Цикл
				СтрокаКонтроляПродаж = СтрокаЭлементаКонтроляПродаж.СтрокиКонтроля.Получить(ИндексСтрокиКонтроля);
				ВыполнитьПроверкиДляСтрокиКонтроляПродаж(Форма, СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж,
					Неопределено, ПараметрыПроверки);
				ИндексСтрокиКонтроля = ИндексСтрокиКонтроля + 1;
			КонецЦикла;
			
		КонецЕсли;
		ИндексЭлементаКонтроля = ИндексЭлементаКонтроля + 1;
	КонецЦикла;
	
	КоллекцияТоваров = ?(ЭтапКонтроля = ЭтапыКонтроляПродаж.ДобавлениеТовара,
		РезультатКонтроля.КонтролируемыеСтрокиТоваров, Форма.Объект.Товары);
		
	КоличествоСтрокТоваров = КоллекцияТоваров.Количество();
	ИндексСтрокиТовара = 0;
	Пока ИндексСтрокиТовара < КоличествоСтрокТоваров Цикл
		СтрокаТовара = КоллекцияТоваров.Получить(ИндексСтрокиТовара);
		СтрокиЭлементовКонтроляПродаж = ПолучитьЭлементыКонтроляПродажПоНоменклатуре(КэшКонтроляПродаж, СтрокаТовара);
		КоличествоЭлементовКонтроляПродаж = СтрокиЭлементовКонтроляПродаж.Количество();
		ИндексЭлементаКонтроля = 0;
		Пока ИндексЭлементаКонтроля < КоличествоЭлементовКонтроляПродаж Цикл
			СтрокаЭлементаКонтроляПродаж = СтрокиЭлементовКонтроляПродаж.Получить(ИндексЭлементаКонтроля);
			
			КоличествоСтрокКонтроля = СтрокаЭлементаКонтроляПродаж.СтрокиКонтроля.Количество();
			ИндексСтрокиКонтроля = 0;
			Пока ИндексСтрокиКонтроля < КоличествоСтрокКонтроля Цикл
				СтрокаКонтроляПродаж = СтрокаЭлементаКонтроляПродаж.СтрокиКонтроля.Получить(ИндексСтрокиКонтроля);
				ВыполнитьПроверкиДляСтрокиКонтроляПродаж(Форма, СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж,
					СтрокаТовара, ПараметрыПроверки);
				ИндексСтрокиКонтроля = ИндексСтрокиКонтроля + 1;
			КонецЦикла;
			
			ИндексЭлементаКонтроля = ИндексЭлементаКонтроля + 1;
		КонецЦикла;
		ИндексСтрокиТовара = ИндексСтрокиТовара + 1;
	КонецЦикла;

	УстановитьТекстПредупрежденияЗапретаОплатыБонусами(РезультатКонтроля, КэшКонтроляПродаж, ПараметрыПроверки);
	Если РезультатКонтроля.ТекстПредупрежденияЗапретаОплатыБонусами = "" Тогда
		РезультатКонтроля.ТекстПредупрежденияЗапретаОплатыБонусами
			= НСтр("ru = 'Бонусами и скидками запрещено оплачивать подарки'");
	КонецЕсли;
	
	Форма.СписокДобавленныхСтрокТоваров.Очистить();
	
КонецПроцедуры

Процедура ОчиститьРезультатКонтроляПродаж(РезультатКонтроляПродаж) Экспорт
	
	РезультатКонтроляПродаж.КонтролируемыеСтрокиТоваров.Очистить();
	РезультатКонтроляПродаж.ОграниченияПродаж.Очистить();
	РезультатКонтроляПродаж.ОповещениеПриУспехе = Неопределено;
	РезультатКонтроляПродаж.ОповещениеПриОтказе = Неопределено;
	РезультатКонтроляПродаж.ЭтапКонтроля = -1;
	РезультатКонтроляПродаж.НуженПересчет = Ложь;
	РезультатКонтроляПродаж.ДобавлениеПодбором = Ложь;
	РезультатКонтроляПродаж.ДобавлениеИзПлитки = Ложь;
	РезультатКонтроляПродаж.НужнаПроверкаДоступностиОплаты = Ложь;
	РезультатКонтроляПродаж.БылоУдалениеСтрок = Ложь;
	РезультатКонтроляПродаж.ТребуетсяПроверкаМарки = Ложь;
	РезультатКонтроляПродаж.КонтекстПроверкиМарки = Неопределено;
	РезультатКонтроляПродаж.СтартКонтроля = Ложь;
	
КонецПроцедуры

Функция ПолучитьПараметрыИзТекстаШаблонаПредупреждения(ТекстШаблона) Экспорт
	
	РезультатФункции = Новый Массив;
	
	СимволНачалаПараметра = "[";
	СимволКонцаПараметра = "]";
	СтрокаШаблона = ТекстШаблона;
	ПозицияНачала = СтрНайти(СтрокаШаблона, СимволНачалаПараметра);
	Пока ПозицияНачала > 0 Цикл
		
		ПозицияОкончания = СтрНайти(СтрокаШаблона, СимволКонцаПараметра);
		Если ПозицияОкончания > 0 Тогда
			ИмяПараметра = Сред(СтрокаШаблона, ПозицияНачала + 1, ПозицияОкончания - ПозицияНачала - 1);
			Если СтрДлина(ИмяПараметра) > 0 И СтрНайти(ИмяПараметра, " ") = 0 Тогда
				РезультатФункции.Добавить(ИмяПараметра);
			КонецЕсли;
			СтрокаШаблона = Сред(СтрокаШаблона, ПозицияОкончания + 1);
			ПозицияНачала = СтрНайти(СтрокаШаблона, СимволНачалаПараметра);
		Иначе
			ПозицияНачала = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

#Область РаботаСУниверсальнойЦифровойКлавиатурой

Функция ПолучитьТекстКнопкиДваНуля() Экспорт
	
	Возврат "00";
	
КонецФункции

Функция ПолучитьСимволЗвездочка() Экспорт
	
	Возврат "*";
	
КонецФункции

Функция ПолучитьСимволКоманды(ИмяКоманды) Экспорт
	
	РезультатФункции = "";
	
	ИмяХвоста = "УниверсальнаяКлавиатура";
	ДлинаПрефикса = 5;
	ПозицияХвоста = СтрНайти(ИмяКоманды, ИмяХвоста);
	Если ПозицияХвоста > 1 Тогда
		РезультатФункции = Сред(ИмяКоманды, ДлинаПрефикса + 1, 1);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ОчиститьТекстРедактированияВПолеФормы(Форма, РедактируемыйЭлемент) Экспорт
	
	ДлинаТекста = СтрДлина(РедактируемыйЭлемент.ТекстРедактирования);
	РедактируемыйЭлемент.УстановитьГраницыВыделения(1,ДлинаТекста+1);
	РедактируемыйЭлемент.ВыделенныйТекст = "";
	Возврат АктивироватьЭлементВводаПриВозможности(Форма, РедактируемыйЭлемент);
	
КонецФункции

Функция ПолучитьПозициюКурсораСУчетомФорматирования(ТекстДо, ТекстПосле, НачалоВыделения, ДлинаВставки, СимволИсключения) Экспорт
	
	РезультатФункции = 1;
	ИндексСимвола = 1;
	ДлинаТекста = СтрДлина(ТекстПосле);
	ДлинаЛевойЧасти = ПолучитьДлинуЗначащихСимволов(ТекстДо, НачалоВыделения, СимволИсключения) + ДлинаВставки;
	ИндексЗначимогоСимвола = 0;
	Пока ИндексСимвола <= ДлинаТекста И ИндексЗначимогоСимвола < ДлинаЛевойЧасти Цикл
		
		ТекущийСимвол = Сред(ТекстПосле, ИндексСимвола, 1);
		Если Не ТекущийСимвол = СимволИсключения Тогда
			ИндексЗначимогоСимвола = ИндексЗначимогоСимвола + 1;
		КонецЕсли;
		РезультатФункции = РезультатФункции + 1;
		
		ИндексСимвола = ИндексСимвола + 1;
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ВычислитьПозициюВыделенияПослеВставки(Форма, РедактируемыйЭлемент, ТекстДоРедактирования, ПараметрыВыделения,
		СимволыКлавиатуры) Экспорт
	
	РезультатФункции = 0;
	
	ДлинаТекста = СтрДлина(РедактируемыйЭлемент.ТекстРедактирования);
	ВычестьИзДлиныПостфикс(ДлинаТекста, РедактируемыйЭлемент);
	ДлинаВставки = СтрДлина(СимволыКлавиатуры);
	
	СимволРазделителя = ИнтерфейсРМКСлужебныйКлиентСервер.РазделительДробнойЧасти();
	ВводДробнойЧасти = Ложь;
	ПозицияРазделителя = СтрНайти(ТекстДоРедактирования, СимволРазделителя);
	ВводДробнойЧасти = (ПараметрыВыделения.НачалоВыделения > ПозицияРазделителя);
	Если ИнтерфейсРМКСлужебныйКлиентСервер.ЭтоПолеТелефонаСМаской(РедактируемыйЭлемент) Тогда
		Если ПараметрыВыделения.НачалоВыделения < 3 Тогда
			ПараметрыВыделения.НачалоВыделения = 3;
		КонецЕсли;
		РезультатФункции = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПозициюКурсораСУчетомФорматирования(ТекстДоРедактирования,
			РедактируемыйЭлемент.ТекстРедактирования, ПараметрыВыделения.НачалоВыделения, ДлинаВставки, " ");
	ИначеЕсли ВводДробнойЧасти Тогда
	
		РезультатФункции = Мин(ДлинаТекста + 1, ПараметрыВыделения.НачалоВыделения + ДлинаВставки);
	
	ИначеЕсли ПозицияРазделителя > 0 И ПараметрыВыделения.НачалоВыделения <= ПозицияРазделителя
			И ПараметрыВыделения.КонецВыделения > ПозицияРазделителя Тогда
		
		РезультатФункции = СтрНайти(РедактируемыйЭлемент.ТекстРедактирования, СимволРазделителя);
		
	Иначе
		
		ТекстЦелоеДоЕдиницы = СтрШаблон("0%1", СимволРазделителя);
		Если Лев(ТекстДоРедактирования, 2) = ТекстЦелоеДоЕдиницы Тогда
			ПараметрыВыделения.НачалоВыделения = 1;
		КонецЕсли;
		РезультатФункции = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПозициюКурсораСУчетомФорматирования(ТекстДоРедактирования,
			РедактируемыйЭлемент.ТекстРедактирования, ПараметрыВыделения.НачалоВыделения, ДлинаВставки, Символы.НПП);
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УдалитьСимволыВРедактируемомПоле(Форма, РедактируемыйЭлемент, СимволИсключения) Экспорт
	
	Если Не РедактируемыйЭлемент = Неопределено Тогда
		
		ПараметрыВыделения = Новый Структура();
		ПараметрыВыделения.Вставить("НачалоВыделения", 0);
		ПараметрыВыделения.Вставить("НачалоСтроки", 0);
		ПараметрыВыделения.Вставить("КонецВыделения", 0);
		ПараметрыВыделения.Вставить("КонецСтроки", 0);
		
		РедактируемыйЭлемент.ПолучитьГраницыВыделения(ПараметрыВыделения.НачалоСтроки, ПараметрыВыделения.НачалоВыделения,
			ПараметрыВыделения.КонецСтроки, ПараметрыВыделения.КонецВыделения);
		РедактируемыйТекст = РедактируемыйЭлемент.ТекстРедактирования;
		Форма.ТекущийЭлемент = РедактируемыйЭлемент;
		
		НовыйКонецВыделения = 1;
		МинимальноеНачало = 1;
		СимволЗамены = "";
		Если ПараметрыВыделения.НачалоВыделения = ПараметрыВыделения.КонецВыделения Тогда
			Если ПараметрыВыделения.НачалоВыделения > МинимальноеНачало Тогда
				СимволСлева = Сред(РедактируемыйТекст, ПараметрыВыделения.НачалоВыделения - 1, 1);
				Если СимволСлева = СимволИсключения Тогда
					НовыйКонецВыделения = ПараметрыВыделения.НачалоВыделения - 1;
				Иначе
					РедактируемыйЭлемент.УстановитьГраницыВыделения(ПараметрыВыделения.НачалоВыделения - 1,
						ПараметрыВыделения.НачалоВыделения);
					РедактируемыйЭлемент.ВыделенныйТекст = СимволЗамены;
					Форма.ОбновитьОтображениеДанных(РедактируемыйЭлемент);
					
					ПараметрыПозиции = Новый Структура();
					ПараметрыПозиции.Вставить("НачалоВыделения", ПараметрыВыделения.НачалоВыделения - 1);
					ПараметрыПозиции.Вставить("КонецВыделения", ПараметрыВыделения.КонецВыделения);
					
					НовыйКонецВыделения = ВычислитьПозициюВыделенияПослеВставки(Форма, РедактируемыйЭлемент, РедактируемыйТекст,
						ПараметрыПозиции, "");
				КонецЕсли;
			КонецЕсли;
		Иначе
			РедактируемыйЭлемент.ВыделенныйТекст = СимволЗамены;
			Форма.ОбновитьОтображениеДанных(РедактируемыйЭлемент);
			НовыйКонецВыделения = ВычислитьПозициюВыделенияПослеВставки(Форма, РедактируемыйЭлемент, РедактируемыйТекст,
				ПараметрыВыделения, "");
		КонецЕсли;
		РедактируемыйЭлемент.УстановитьГраницыВыделения(НовыйКонецВыделения, НовыйКонецВыделения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВставитьСимволыВРедактируемоеПоле(Форма, РедактируемыйЭлемент, СимволыКлавиатуры) Экспорт
	
	Если Не РедактируемыйЭлемент = Неопределено Тогда
		
		ПараметрыВыделения = Новый Структура();
		ПараметрыВыделения.Вставить("НачалоВыделения", 0);
		ПараметрыВыделения.Вставить("НачалоСтроки", 0);
		ПараметрыВыделения.Вставить("КонецВыделения", 0);
		ПараметрыВыделения.Вставить("КонецСтроки", 0);
		
		РедактируемыйЭлемент.ПолучитьГраницыВыделения(ПараметрыВыделения.НачалоСтроки, ПараметрыВыделения.НачалоВыделения,
			ПараметрыВыделения.КонецСтроки, ПараметрыВыделения.КонецВыделения);
		РедактируемыйТекст = РедактируемыйЭлемент.ТекстРедактирования;
		
		Форма.ТекущийЭлемент = РедактируемыйЭлемент;
		РедактируемыйЭлемент.ВыделенныйТекст = СимволыКлавиатуры;
		Форма.ОбновитьОтображениеДанных(РедактируемыйЭлемент);
		
		НовыйКонецВыделения = ИнтерфейсРМКСлужебныйКлиент.ВычислитьПозициюВыделенияПослеВставки(ЭтотОбъект,
			РедактируемыйЭлемент, РедактируемыйТекст, ПараметрыВыделения, СимволыКлавиатуры);
		
		РедактируемыйЭлемент.УстановитьГраницыВыделения(НовыйКонецВыделения, НовыйКонецВыделения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеХарактеристик

// Процедура заполнения плитки выбора данными из таблицы
// Параметры:
//  Форма - Форма рабочего места кассира.
Процедура ПостроитьПлиткуВыбораЗначений(Форма) Экспорт
	
	МаксимальноеКоличествоНаСтранице = ИнтерфейсРМКСлужебныйКлиентСервер.КоличествоКарточекИзбранногоНаСтранице();
	ЗначенияНаСтранице = Форма.ДанныеПлиткиПодбораЗначений;
	ОбщееКоличествоЭлементов = ЗначенияНаСтранице.Количество();
	Элементы = Форма.Элементы;
	ДанныеКнопок = Форма.ДанныеКнопок;
	
	// Скрываются лишние ряды, если элементов достаточно для одного ряда
	ЭлементРяд = Элементы.РядКнопок_2;
	Если Не (Форма.ЕстьГруппыИзбранногоБолее4 И Форма.ИзбранноеРазвернуто) Тогда
		ЭлементРяд.Видимость = (ОбщееКоличествоЭлементов > Цел(МаксимальноеКоличествоНаСтранице / 2));
	КонецЕсли;
	
	ОтображатьОстаток = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОтображатьОстаток") Тогда
		ОтображатьОстаток = Форма.ОтображатьОстаток;
	КонецЕсли;
	
	СкрыватьЦену = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СкрыватьЦенуИзбранных") Тогда
		СкрыватьЦену = Форма.СкрыватьЦенуИзбранных;
	КонецЕсли;
	
	ОтображатьНаименованиеДляПечати = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,
		"ОтображатьНаименованиеДляПечати") Тогда
		ОтображатьНаименованиеДляПечати = Форма.ОтображатьНаименованиеДляПечати;
	КонецЕсли;
	
	ИзбраннаяПозиция = Неопределено;
	ИменаЭлементов = ПолучитьИменаЭлементовИзбранного();
	
	Для ИндексПП = 0 По МаксимальноеКоличествоНаСтранице - 1 Цикл
		
		НомерКарточки = ИндексПП + 1;
		ПозицияКнопки = ДанныеКнопок[ИндексПП];
		ПозицияКнопки.АдресИзображения = "";
		ПозицияКнопки.ПервыйИндексПлитки = -1;
		ПозицияКнопки.ВторойИндексПлитки = -1;
		ПозицияКнопки.ЭтоКатегория = Ложь;
		ПозицияКнопки.Номенклатура = Неопределено;
		ПозицияКнопки.Характеристика = Неопределено;
		ПозицияКнопки.ЭтоТекущаяКатегория = Ложь;
		ПозицияКнопки.ИмеетсяВложенность = Ложь;
		ПозицияКнопки.КоличествоТекст = "";
		ПозицияКнопки.ЦенаТекст = "";
		ПозицияКнопки.ИмяЭлемента = "";
		
		ЭтоПустаяОбласть = (ИндексПП >= ОбщееКоличествоЭлементов);
		Если ЭтоПустаяОбласть Тогда
			Элементы[ИменаЭлементов.Контейнер + НомерКарточки].ТекущаяСтраница
				= Элементы[ИменаЭлементов.ВидПустой + НомерКарточки];
		Иначе
			ИзбраннаяПозиция = ЗначенияНаСтранице[ИндексПП];
			Если ИндексПП = МаксимальноеКоличествоНаСтранице - 1 И Не ЗначениеЗаполнено(ИзбраннаяПозиция.ЗначениеВыбора) Тогда
				СтраницаХарактеристики = Элементы[ИменаЭлементов.СтраницаГруппы + НомерКарточки];
			Иначе
				СтраницаХарактеристики = Элементы[ИменаЭлементов.СтраницаЭлемента + НомерКарточки];
			КонецЕсли;
			Элементы[ИменаЭлементов.СтраницыИзбранного + НомерКарточки].ТекущаяСтраница = СтраницаХарактеристики;
			
			Элементы[ИменаЭлементов.Контейнер + НомерКарточки].ТекущаяСтраница
				= Элементы[ИменаЭлементов.СтраницаИзбранное + НомерКарточки];
			УстановитьЦветаИзбранного(Элементы, НомерКарточки, ИзбраннаяПозиция, ОтображатьОстаток, СкрыватьЦену);
			ПараметрыЗаполнения = Новый Структура();
			ПараметрыЗаполнения.Вставить("ОтображатьОстаток", ОтображатьОстаток);
			ПараметрыЗаполнения.Вставить("СкрыватьЦену", СкрыватьЦену);
			ПараметрыЗаполнения.Вставить("ОтображатьНаименованиеДляПечати", ОтображатьНаименованиеДляПечати);
			ЗаполнитьДанныеКарточкиХарактеристики(ПозицияКнопки, ИзбраннаяПозиция, ПараметрыЗаполнения);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

Функция НовыйТерминалДляСверкиИтогов() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ИспользоватьБезПодключенияОборудования", Ложь);
	Результат.Вставить("ПодключаемоеОборудование", Неопределено);
	Результат.Вставить("Организация", Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ДополнительныеПараметрыОткрытияЗакрытияСмены() Экспорт
	
	ДополнительныеПараметрыОткрытияЗакрытияСмены = Новый Структура();
	ДополнительныеПараметрыОткрытияЗакрытияСмены.Вставить("Пользователь");
	ДополнительныеПараметрыОткрытияЗакрытияСмены.Вставить("Кассир");
	ДополнительныеПараметрыОткрытияЗакрытияСмены.Вставить("КассаККМ");
	ДополнительныеПараметрыОткрытияЗакрытияСмены.Вставить("ВариантЗаполненияМестаРасчетов");
	
	Возврат ДополнительныеПараметрыОткрытияЗакрытияСмены;
	
КонецФункции

Функция КассовыеОперации() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("УправлениеСменами", 0);
	РезультатФункции.Вставить("Внесение", 1);
	РезультатФункции.Вставить("Выемка", 2);
	РезультатФункции.Вставить("ОтчетГашение", 3);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция БуферОбменаДисплеяПокупателя() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ТоварНаименование");
	Результат.Вставить("ТоварЦена");
	Результат.Вставить("ТоварКоличество");
	Результат.Вставить("ТоварСумма");
	Результат.Вставить("ТоварСкидка");
	Результат.Вставить("СуммаИтого", 0);
	Результат.Вставить("СуммаСкидки", 0);
	Результат.Вставить("Сдача", 0);
	Результат.Вставить("Оплата", 0);
	Результат.Вставить("Информация");
	Результат.Вставить("Весовой");
	Результат.Вставить("ЧекФискализации");
	
	Возврат Результат;
	
КонецФункции

Функция ШаблонПараметровВнесенияВыемки(ЭтоВнесение) Экспорт
	
	Результат = Новый Структура();
	
	Результат.Вставить("КассаККМ", Неопределено);
	Результат.Вставить("ТаблицаКассККМОрганизаций", Неопределено);
	Результат.Вставить("Кассир", Неопределено);
	Результат.Вставить("ПользовательБД", Неопределено);
	Результат.Вставить("ПодключаемоеОборудование", Неопределено);
	Результат.Вставить("Организация", Неопределено);
	Результат.Вставить("СписокРолейПользователя", Неопределено);
	Результат.Вставить("УникальныйИдентификаторФормы", Неопределено);
	Результат.Вставить("ФормаИсточник", Неопределено);
	Если ЭтоВнесение Тогда
		Результат.Вставить("СуммаВнесение", 0);
	Иначе
		Результат.Вставить("СуммаВыемка", 0);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПараметрыОткрытияФормыОборудования(Сообщение, ТекстЗаголовка = "") Экспорт
	
	ПараметрыОшибки = Новый Структура;
	
	ПараметрыОшибки.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	ПараметрыОшибки.Вставить("ТекстСообщения", Сообщение);
	ПараметрыОшибки.Вставить("ЭтоТерминалБезПодключения", Ложь);
	ПараметрыОшибки.Вставить("ЭтоОжиданиеОплаты", Ложь);
	ПараметрыОшибки.Вставить("ЭтоАвтономнаяККТ", Ложь);
	ПараметрыОшибки.Вставить("ЭтоОшибкаФискализации", Ложь); 
	ПараметрыОшибки.Вставить("ЭтоОшибкаЭквайринговойОперации", Ложь);
	ПараметрыОшибки.Вставить("ПодключенаОблачнаяККТ", Ложь);
	ПараметрыОшибки.Вставить("ЭтоОшибкаПроверкиСтатусаЧекаВОблаке", Ложь);
	ПараметрыОшибки.Вставить("ЭтоОшибкаПовторногоПробития", Ложь);
	ПараметрыОшибки.Вставить("ТипОплаты", "");
	ПараметрыОшибки.Вставить("ОшибкаФормированияИсходныхДанных", Ложь);
	ПараметрыОшибки.Вставить("ТранзакцияПоКартеЗавершена", Ложь);
	ПараметрыОшибки.Вставить("НеобходимоСторно", Ложь);
	ПараметрыОшибки.Вставить("ЭтоПродажа", Ложь);
	ПараметрыОшибки.Вставить("РежимКассыСамообслуживания", Ложь);
	ПараметрыОшибки.Вставить("УвеличенныйВариантМасштаба", Ложь);
	ПараметрыОшибки.Вставить("ИспользоватьДисплейПокупателя", Ложь);
	ПараметрыОшибки.Вставить("ИспользоватьПодключаемоеОборудование", Ложь);
	ПараметрыОшибки.Вставить("Организация", Неопределено);
	
	Возврат ПараметрыОшибки;
	
КонецФункции

Функция ПолучитьПараметрыЗапускаФормыОборудования(ФормаВладелец, ИмяПроцедурыОповещения, ПараметрыОткрытия) Экспорт
	
	ОбработчикОповещения = Неопределено;
	Если Не СокрЛП(ИмяПроцедурыОповещения) = "" Тогда
		ОбработчикОповещения = Новый ОписаниеОповещения(ИмяПроцедурыОповещения, ФормаВладелец);
	КонецЕсли;
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ПараметрыОткрытия", ПараметрыОткрытия);
	ПараметрыЗапуска.Вставить("ОбработчикОповещения", ОбработчикОповещения);
	
	Возврат ПараметрыЗапуска;
	
КонецФункции

Функция ПолучитьИмяФормыВзаимодействияСОборудованием() Экспорт
	
	Возврат "Обработка.РабочееМестоКассира.Форма.ФормаВзаимодействияСОборудованием";
	
КонецФункции

Процедура ОткрытьФормуВзаимодействияСОборудованием(ФормаВладелец, ПараметрыЗапуска) Экспорт
	
	ИмяФормыВзаимодействия = ПолучитьИмяФормыВзаимодействияСОборудованием();
	
	РежимБлокировкиОкна = РежимблокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	РежимОтображенияОкна = РежимОтображенияОкнаФормы.ВДиалоговомОкне;
	
	ОткрытьФорму(ИмяФормыВзаимодействия, ПараметрыЗапуска.ПараметрыОткрытия, ФормаВладелец,,,,
		ПараметрыЗапуска.ОбработчикОповещения, РежимБлокировкиОкна, РежимОтображенияОкна);
	
КонецПроцедуры

Функция НайтиФормуПоИмениИВладельцу(ИмяПроверяемойФормы, ВладелецФормы) Экспорт
	
	РезультатФункции = Неопределено;
	ОткрытыеОкна = ПолучитьОкна();
	Счт = 0;
	Пока Счт < ОткрытыеОкна.Количество() И РезультатФункции = Неопределено Цикл
		ТекущееОкно = ОткрытыеОкна.Получить(Счт);
		Если ТекущееОкно.Содержимое.Количество() > 0 Тогда
			ФормаОкна = ТекущееОкно.Содержимое[0];
			Если ТипЗнч(ФормаОкна) = Тип("ФормаКлиентскогоПриложения") И ФормаОкна.ИмяФормы = ИмяПроверяемойФормы
					И ФормаОкна.ВладелецФормы = ВладелецФормы Тогда
				РезультатФункции = ФормаОкна;
			КонецЕсли;
		КонецЕсли;
		Счт = Счт + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ШаблонСтруктурыФормыВводаСумм() Экспорт
	
	ПараметрыДляОткрытия = Новый Структура;
	ПараметрыДляОткрытия.Вставить("Режим", 0);
	ПараметрыДляОткрытия.Вставить("ОжидаемоеКоличествоЧеков", 0);
	ПараметрыДляОткрытия.Вставить("ИспользоватьЦифровуюКлавиатуру", Истина);
	ПараметрыДляОткрытия.Вставить("СуммаИтого", 0);
	ПараметрыДляОткрытия.Вставить("Масштаб", Неопределено);
	ПараметрыДляОткрытия.Вставить("УвеличенныйВариантМасштаба", Истина);
	ПараметрыДляОткрытия.Вставить("НомерТелефонаПолучателя", НСтр("ru = ''"));
	ПараметрыДляОткрытия.Вставить("ШаблонСообщения", "");
	ПараметрыДляОткрытия.Вставить("ПредставлениеКарты", НСтр("ru = ''"));
	ПараметрыДляОткрытия.Вставить("ДоступноБаллов", 0);
	ПараметрыДляОткрытия.Вставить("СуммаПодтвержденияБонусов", 0);
	ПараметрыДляОткрытия.Вставить("ЗапрашиватьСМС", Ложь);
	ПараметрыДляОткрытия.Вставить("ПодарочныйСертификат", Неопределено);
	ПараметрыДляОткрытия.Вставить("НомерПодарочногоСертификата", НСтр("ru = ''"));
	ПараметрыДляОткрытия.Вставить("СуммаСертификата", 0);
	ПараметрыДляОткрытия.Вставить("ИспользоватьПанельВводаНаличных", Ложь);
	ПараметрыДляОткрытия.Вставить("ТекущаяНастройкаРМК", Неопределено);
	ПараметрыДляОткрытия.Вставить("ЭтоВнесениеПредоплатыПоЗаказу", Ложь);
	ПараметрыДляОткрытия.Вставить("СуммаОплаченоЗачетАванса", 0);
	ПараметрыДляОткрытия.Вставить("ПриемАванса", Ложь);
	ПараметрыДляОткрытия.Вставить("ИспользоватьДисплейПокупателя", Ложь);
	ПараметрыДляОткрытия.Вставить("ЗаголовокЭлемента", НСтр("ru = ''"));
	ПараметрыДляОткрытия.Вставить("ТипЗначения", Неопределено);
	ПараметрыДляОткрытия.Вставить("Формат", НСтр("ru = ''"));
	ПараметрыДляОткрытия.Вставить("МаскаВвода", НСтр("ru = ''"));
	ПараметрыДляОткрытия.Вставить("ЗначениеЭлемента", Неопределено);
	ПараметрыДляОткрытия.Вставить("ТребуетсяРазделитель", Истина);
	ПараметрыДляОткрытия.Вставить("РежимКассыСамообслуживания", Ложь);
	ПараметрыДляОткрытия.Вставить("КомпактныйРежимПодменю", Ложь);
	
	Возврат ПараметрыДляОткрытия;
	
КонецФункции

Функция СформироватьЗаголовокВызоваСотрудника(ЭтоУдаленныйСотрудник, НаименованиеПользователяВОбращении) Экспорт
	
	РезультатФункции = "";
	Если ЗначениеЗаполнено(НаименованиеПользователяВОбращении) Тогда
		НачалоФразы = НСтр("ru = 'Обратитесь к'");
		РезультатФункции = СтрШаблон("%1 %2", НачалоФразы, НаименованиеПользователяВОбращении);
	ИначеЕсли ЭтоУдаленныйСотрудник Тогда
		РезультатФункции = НСтр("ru = 'Обратитесь к сотруднику.'");
	Иначе
		РезультатФункции = НСтр("ru = 'Ожидайте сотрудника.'");
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ИспользуетсяУникальныйВидОплаты(Форма) Экспорт
	
	РезультатФункции = Ложь;
	Если Не Форма.ИспользуемыеВидыОплат = Неопределено Тогда
		МассивПоддерживаемыхВидов = ИнтерфейсРМКСлужебныйКлиентСервер.ПоддерживаемыеКнопкиУникальныхВидовОплат();
		РезультатФункции = (Форма.ИспользуемыеВидыОплат.Количество() = 1
			И (Не МассивПоддерживаемыхВидов.Найти(Форма.ИспользуемыеВидыОплат[0]) = Неопределено));
	КонецЕсли;
		
	Возврат РезультатФункции;
	
КонецФункции

Процедура НастроитьВидКнопкиОплатыВПлитке(Форма, ЭтоВозврат = Ложь) Экспорт
	
	Элементы = Форма.Элементы;
	Если (Не ЭтоВозврат) И (Не Форма.РежимЗаказа) И ПропуститьОкноСВыборомКартыЛояльностиДопустимо(Форма) Тогда
		Элементы.СтраницаКнопкиПереходаКОплатеПлитка.Видимость = Ложь;
		Элементы.СтраницаУникальнойКнопкиОплатыПлитка.Видимость = Истина;
		Элементы.ВидыКнопкиОплатыВПлитке.ТекущаяСтраница = Элементы.СтраницаУникальнойКнопкиОплатыПлитка;
	Иначе
		Элементы.СтраницаКнопкиПереходаКОплатеПлитка.Видимость = Истина;
		Элементы.СтраницаУникальнойКнопкиОплатыПлитка.Видимость = Ложь;
		Элементы.ВидыКнопкиОплатыВПлитке.ТекущаяСтраница = Элементы.СтраницаКнопкиПереходаКОплатеПлитка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПропуститьОкноСВыборомКартыЛояльностиДопустимо(Форма) Экспорт
	
	РезультатФункции = (Форма.НапоминатьПроВводКартыЛояльности Или (Не Форма.ВводДисконтныхКарт)
		Или ИнтерфейсРМКСлужебныйКлиентСервер.ДанныеЛояльностиЗаполнены(Форма));
	Возврат РезультатФункции;
	
КонецФункции

Функция ШаблонДанныхВосстановленияОплатПриВозврате() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ТоварыПриВозврате", Новый Массив);
	РезультатФункции.Вставить("ОплатыПриВозврате", Новый Массив);
	РезультатФункции.Вставить("ДисконтнаяКарта", Неопределено);
	РезультатФункции.Вставить("Контрагент", Неопределено);
	РезультатФункции.Вставить("ИдентификаторКарты", "");
	РезультатФункции.Вставить("КодКарты", "");
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗаполнитьКэшДанныхОплатВозврата(Форма) Экспорт
	
	ДанныеОбъекта = Форма.Объект;
	ДанныеОплатПриВозврате = Форма.ДанныеОплатПриВозврате;
	Если ДанныеОплатПриВозврате.ОплатыПриВозврате.Количество() = 0 И ДанныеОбъекта.Оплата.Количество() > 0 Тогда
		
		Для Каждого СтрокаТовара Из ДанныеОбъекта.Товары Цикл
			ДанныеСтрокиТовары = Новый Структура();
			ДанныеСтрокиТовары.Вставить("Номенклатура", СтрокаТовара.Номенклатура);
			ДанныеСтрокиТовары.Вставить("Характеристика", СтрокаТовара.Характеристика);
			ДанныеСтрокиТовары.Вставить("Количество", СтрокаТовара.Количество);
			ДанныеОплатПриВозврате.ТоварыПриВозврате.Добавить(ДанныеСтрокиТовары);
		КонецЦикла;
		
		Для Каждого СтрокаОплаты Из ДанныеОбъекта.Оплата Цикл
			ДанныеСтрокиОплаты = Новый Структура();
			Для Каждого КолонкаОплаты Из Форма.КолонкиТаблицФормы.Оплата Цикл
				ДанныеСтрокиОплаты.Вставить(КолонкаОплаты.Имя, СтрокаОплаты[КолонкаОплаты.Имя]);
			КонецЦикла;
			ДанныеОплатПриВозврате.ОплатыПриВозврате.Добавить(ДанныеСтрокиОплаты);
		КонецЦикла;
		ДанныеОплатПриВозврате.ДисконтнаяКарта = ДанныеОбъекта.ДисконтнаяКарта;
		ДанныеОплатПриВозврате.Контрагент = ДанныеОбъекта.Контрагент;
		Если Не Форма.ПараметрыКартыЛояльности = Неопределено Тогда
			ДанныеОплатПриВозврате.ИдентификаторКарты = Форма.ПараметрыКартыЛояльности.ИдентификаторКарты;
			ДанныеОплатПриВозврате.КодКарты = Форма.ПараметрыКартыЛояльности.КодКарты;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВосстановитьТаблицуОплатВозврата(Форма) Экспорт
	
	ДанныеОбъекта = Форма.Объект;
	ОплатыПриВозврате = Форма.ДанныеОплатПриВозврате.ОплатыПриВозврате;
	Для Каждого ЭлементОплаты Из ОплатыПриВозврате Цикл
		НоваяСтрока = ДанныеОбъекта.Оплата.Добавить();
		Для Каждого КолонкаОплаты Из Форма.КолонкиТаблицФормы.Оплата Цикл
			ЗначениеКолонки = Неопределено;
			Если ЭлементОплаты.Свойство(КолонкаОплаты.Имя, ЗначениеКолонки) Тогда
				НоваяСтрока[КолонкаОплаты.Имя] = ЗначениеКолонки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьКэшДанныхОплатВозврата(ДанныеОплатПриВозврате) Экспорт
	
	ДанныеОплатПриВозврате.ТоварыПриВозврате.Очистить();
	ДанныеОплатПриВозврате.ОплатыПриВозврате.Очистить();
	ДанныеОплатПриВозврате.ДисконтнаяКарта = Неопределено;
	ДанныеОплатПриВозврате.Контрагент = Неопределено;
	ДанныеОплатПриВозврате.ИдентификаторКарты = "";
	ДанныеОплатПриВозврате.КодКарты = "";
	
КонецПроцедуры

Функция ДанныеЛояльностиВозвратаИдентичны(Форма) Экспорт
	
	ДанныеОбъекта = Форма.Объект;
	ДанныеОплатПриВозврате = Форма.ДанныеОплатПриВозврате;
	
	РезультатФункции = ДанныеОбъекта.ДисконтнаяКарта = ДанныеОплатПриВозврате.ДисконтнаяКарта
		И ДанныеОбъекта.Контрагент = ДанныеОплатПриВозврате.Контрагент
		И ((Форма.ПараметрыКартыЛояльности = Неопределено И ДанныеОплатПриВозврате.ИдентификаторКарты = ""
			И ДанныеОплатПриВозврате.КодКарты = "")
				Или (Форма.ПараметрыКартыЛояльности <> Неопределено
					И Форма.ПараметрыКартыЛояльности.ИдентификаторКарты = ДанныеОплатПриВозврате.ИдентификаторКарты
					И Форма.ПараметрыКартыЛояльности.КодКарты = ДанныеОплатПриВозврате.КодКарты));
	
	Возврат РезультатФункции
	
КонецФункции

Функция СоставНоменклатурыВозвратаИдентичен(Товары, КэшИсходныхТоваров) Экспорт
	
	РезультатФункции = Истина;
	КэшТоваров = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(КэшИсходныхТоваров);
	Если Товары.Количество() = КэшТоваров.Количество() Тогда
		КоличествоСтрок = Товары.Количество();
		Счт = 0;
		Пока Счт < КоличествоСтрок И РезультатФункции Цикл
			СтрокаТовара = Товары.Получить(Счт);
			ИндексДанныхКэша = ПолучитьИндексЭлементаКэшаТоваров(КэшТоваров, СтрокаТовара);
			Если ИндексДанныхКэша >= 0 Тогда
				КэшТоваров.Удалить(ИндексДанныхКэша);
			Иначе
				РезультатФункции = Ложь;
			КонецЕсли;
			Счт = Счт + 1;
		КонецЦикла;
	Иначе
		РезультатФункции = Ложь;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#Область РаботаСЭлектроннымиВесами

Процедура ДобавитьПустоеОписаниеРазмещенияНаЭлектронныхВесах(ДанныеРазмещения, ЭлектронныеВесы) Экспорт
	
	СтрокаРазмещения = ПолучитьСтрокуДанныхРазмещения(ДанныеРазмещения, ЭлектронныеВесы);
	Если СтрокаРазмещения = Неопределено Тогда
		НовоеОписание = МенеджерОборудованияРМККлиент.ПолучитьПараметрыСобытияВеса();
		Если Не НовоеОписание = Неопределено Тогда
			НовоеОписание.ИдентификаторУстройства = ЭлектронныеВесы;
			ДанныеРазмещения.Добавить(НовоеОписание);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанныеРазмещенияНаЭлектронныхВесах(ДанныеРазмещения, ПараметрыОповещения) Экспорт
	
	СтрокаРазмещения = ПолучитьСтрокуДанныхРазмещения(ДанныеРазмещения, ПараметрыОповещения.ИдентификаторУстройства);
	Если СтрокаРазмещения = Неопределено Тогда
		СтрокаРазмещения = МенеджерОборудованияРМККлиент.ПолучитьПараметрыСобытияВеса();
		Если Не СтрокаРазмещения = Неопределено Тогда
			СтрокаРазмещения.ИдентификаторУстройства = ПараметрыОповещения.ИдентификаторУстройства;
			ДанныеРазмещения.Добавить(СтрокаРазмещения);
		КонецЕсли;
	КонецЕсли;
	Если Не СтрокаРазмещения = Неопределено Тогда
		СтрокаРазмещения.ОшибкаРазмещения = ПараметрыОповещения.ОшибкаРазмещения;
		СтрокаРазмещения.ЗонаПересечения = ПараметрыОповещения.ЗонаПересечения;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтрокуДанныхРазмещения(ДанныеРазмещения, ЭлектронныеВесы) Экспорт
	
	РезультатФункции = Неопределено;
	
	КоличествоЭлементов = ДанныеРазмещения.Количество();
	Счт = 0;
	Пока Счт < КоличествоЭлементов И РезультатФункции = Неопределено Цикл
		ТекущееОписание = ДанныеРазмещения[Счт];
		Если ТекущееОписание.ИдентификаторУстройства = ЭлектронныеВесы Тогда
			РезультатФункции = ТекущееОписание;
		КонецЕсли;
		Счт = Счт + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция СкопироватьДанныеРазмещенияНаЭлектронныхВесах(ДанныеРазмещения) Экспорт
	
	НовыеДанные = Новый Массив;
	ПоляКопирования = "ОшибкаРазмещения,ИдентификаторУстройства"; // При расширении надо будет поддержать
	// копирование массива зона пересечения, не копирование ссылки
	
	Для Каждого СтрокаРазмещения Из ДанныеРазмещения Цикл
		НоваяСтрокаРазмещения = МенеджерОборудованияРМККлиент.ПолучитьПараметрыСобытияВеса();
		Если Не НоваяСтрокаРазмещения = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРазмещения, СтрокаРазмещения, ПоляКопирования);
			НовыеДанные.Добавить(НоваяСтрокаРазмещения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовыеДанные;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СхемаФормыРМК

Процедура ЗаполнитьЗначенияШириныГлавнойГруппы(ШиринаОбластиВПроцентах, МинимальнаяШиринаОбласти)
	
	МинимальнаяШиринаВертикальногоЭкрана = 0;
	ПодключенГоризонтальныйЭкран = Ложь;
	ПодключенВертикальныйЭкран = Ложь;
	ИнформацияЭкранов = ПолучитьИнформациюЭкрановКлиента();
	Для Каждого ДанныеЭкрана Из ИнформацияЭкранов Цикл
		Если ДанныеЭкрана.Ширина > ДанныеЭкрана.Высота Тогда
			ПодключенГоризонтальныйЭкран = Истина;
		Иначе
			ПодключенВертикальныйЭкран = Истина;
			Если МинимальнаяШиринаВертикальногоЭкрана = 0 Или ДанныеЭкрана.Ширина < МинимальнаяШиринаВертикальногоЭкрана Тогда
				МинимальнаяШиринаВертикальногоЭкрана = ДанныеЭкрана.Ширина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ПодключенГоризонтальныйЭкран Тогда
		ШиринаОбластиВПроцентах = 60;
		Коэффициент = 0.45;
		Если ПодключенВертикальныйЭкран Тогда
			МинимальнаяШиринаОбласти = Окр(Коэффициент * МинимальнаяШиринаВертикальногоЭкрана, 0, 1);
		КонецЕсли;
	Иначе
		ШиринаОбластиВПроцентах = 98;
	КонецЕсли;
	
КонецПроцедуры

Функция ШаблонСхемыФормыРМК()
	
	РезультатФункции = 
	"<html>
	|	<head>
	|		<meta charset=""utf-8"">
	|		<style>
	|			&WrapperStyle}
	|
	|			.box {
	|				position: absolute;
	|				left: 0;
	|				top: 0;
	|				width: 100%;
	|				height: 100%;
	|				border: 1px solid black;
	|			}
	|			&StyleContent
	|		</style>
	|	</head>
	|	<body>
	|		<div class=""wrapper"">
	|			<div class=""box"">
	|				&FieldContent
	|			</div>
	|		</div>
	|	</body>
	|</html>";
	
	Возврат РезультатФункции;
	
КонецФункции

Функция СформироватьСтильГлавнойГруппы(Форма)
	
	СтильГруппы = "";
	
	Если Форма.ГоризонтальнаяОриентация Тогда
		ПроцентПропорции = Окр(100 * Форма.ВысотаСхемыРМК / Форма.ШиринаСхемыРМК, 1, 1);
		СтильГруппы =
		".wrapper {
		|	position: relative;
		|	width: 98%;
		|	padding-top: &Ratio%;
		|	}";
		СтильГруппы = СтрЗаменить(СтильГруппы, "&Ratio", Формат(ПроцентПропорции, "ЧРД=.; ЧГ="));
	Иначе
		ШиринаОбластиВПроцентах = 0;
		МинимальнаяШиринаОбласти = 0;
		ЗаполнитьЗначенияШириныГлавнойГруппы(ШиринаОбластиВПроцентах, МинимальнаяШиринаОбласти);
		СтильГруппы =
		".wrapper {
		|	position: relative;
		|	height: 98%;
		|	width: &DivWidth%;
		|	&DivMinWidth
		|	}";
		СтильГруппы = СтрЗаменить(СтильГруппы, "&DivWidth", Формат(ШиринаОбластиВПроцентах, "ЧРД=.; ЧГ="));
		МинимальнаяШиринаСтрокой = "";
		Если МинимальнаяШиринаОбласти > 0 Тогда
			МинимальнаяШиринаСтрокой = СтрШаблон("min-width: %1px;", Формат(МинимальнаяШиринаОбласти, "ЧГ="));
		КонецЕсли;
		СтильГруппы = СтрЗаменить(СтильГруппы, "&DivMinWidth", МинимальнаяШиринаСтрокой);
	КонецЕсли;
	
	Возврат СтильГруппы;
	
КонецФункции

Функция ПолучитьВложенныйБлок(Форма, СтрокиБлока, ГруппировкаБлока, Знач ИмяТекущейОбласти, Знач Уровень)
	
	ТипыГруппировок = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыГруппировок();
	
	КлассГлавныхБлоков = "class=""generalBlock""";
	КлассДетальныхБлоков = "class=""detailedBlock""";
	КлассВыбранногоБлока = "class=""selectedBlock""";
	ВложенныйБлок = "<table style = ""width: 100%; height: 100%; border-collapse: collapse; margin: 0;"">";
	Если Уровень <= 2 Тогда
		ВложенныйБлок = СтрЗаменить(ВложенныйБлок, "border-collapse: collapse;", "");
	КонецЕсли;
	Если ГруппировкаБлока = ТипыГруппировок.Горизонтальная Тогда
		ВложенныйБлок = СтрШаблон("%1%2%3", ВложенныйБлок, Символы.ПС, "<tr style = ""height: 100%;"">");
	КонецЕсли;
	Для Каждого СтрокаБлока Из СтрокиБлока Цикл
		Если СтрокаБлока.ДоступностьГруппы Тогда
			Если ГруппировкаБлока = ТипыГруппировок.Вертикальная Тогда
				ТэгНачалаСтроки = "<tr style = ""height: &RowHeight%;"">";
				ТэгНачалаСтроки = СтрЗаменить(ТэгНачалаСтроки, "&RowHeight", Формат(СтрокаБлока.ВысотаВПроцентах, "ЧРД=.; ЧГ="));
				ВложенныйБлок = СтрШаблон("%1%2%3", ВложенныйБлок, Символы.ПС, ТэгНачалаСтроки);
			КонецЕсли;
			ЯчейкаБлока = "<td id=""&FiledName"" &TdClass style = ""width: &ColumnWidth%; &BackgroundColor"">&BlockContent</td>";
			ЯчейкаБлока = СтрЗаменить(ЯчейкаБлока, "&FiledName", СтрокаБлока.ИмяОбласти);
			ПредставлениеЦвета = ПолучитьПредставлениеЦвета(СтрокаБлока.ЦветОбласти);
			ЦветЯчейки = СтрШаблон("background-color: %1", ПредставлениеЦвета);
			ЯчейкаБлока = СтрЗаменить(ЯчейкаБлока, "&BackgroundColor", ЦветЯчейки);
			Если СтрокаБлока.ИмяОбласти = ИмяТекущейОбласти Тогда
				КлассБлоков = КлассВыбранногоБлока;
			Иначе
				КлассБлоков = ?(Уровень > 2, КлассДетальныхБлоков, КлассГлавныхБлоков);
			КонецЕсли;
			ЯчейкаБлока = СтрЗаменить(ЯчейкаБлока, "&TdClass", КлассБлоков);
			ЯчейкаБлока = СтрЗаменить(ЯчейкаБлока, "&ColumnWidth", Формат(СтрокаБлока.ШиринаВПроцентах, "ЧРД=.; ЧГ="));
			СодержимоеБлока = ПолучитьСодержимоеБлока(Форма, СтрокаБлока, ИмяТекущейОбласти, Уровень);
			ЯчейкаБлока = СтрЗаменить(ЯчейкаБлока, "&BlockContent", СодержимоеБлока);
			ВложенныйБлок = СтрШаблон("%1%2%3", ВложенныйБлок, Символы.ПС, ЯчейкаБлока);
			Если ГруппировкаБлока = ТипыГруппировок.Вертикальная Тогда
				ВложенныйБлок = СтрШаблон("%1%2%3", ВложенныйБлок, Символы.ПС, "</tr>");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ГруппировкаБлока = ТипыГруппировок.Горизонтальная Тогда
		ВложенныйБлок = СтрШаблон("%1%2%3", ВложенныйБлок, Символы.ПС, "</tr>");
	КонецЕсли;
	
	ВложенныйБлок = СтрШаблон("%1%2%3", ВложенныйБлок, Символы.ПС, "</table>");
	
	Возврат ВложенныйБлок;
	
КонецФункции

Функция ПолучитьСодержимоеБлока(Форма, СтрокаБлока, Знач ИмяТекущейОбласти, Знач Уровень)
	
	РезультатФункции = "";
	
	Если СтрокаБлока.ПолучитьЭлементы().Количество() = 0 Тогда
		ДополнительныеПараметры = Новый Структура("РеквизитыПалитры", Форма.РеквизитыПалитры);
		РезультатФункции = ПолучитьСодержимоеИменнойОбластиСхемыФормыРМК(Форма, СтрокаБлока, ДополнительныеПараметры);
	Иначе
		РезультатФункции = ПолучитьВложенныйБлок(Форма, СтрокаБлока.ПолучитьЭлементы(),
			СтрокаБлока.Группировка, ИмяТекущейОбласти, Уровень + 1);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьПредставлениеЦвета(ЦветОбласти)
	
	РезультатФункции = "";
	Если Не ЦветОбласти = Неопределено Тогда
		Если ЦветОбласти.Вид = ВидЦвета.WebЦвет Тогда
			ЦветСтрокой = Строка(ЦветОбласти);
			ПозицияНачалаСкобок = СтрНайти(ЦветСтрокой, "(");
			ПозицияКонцаСкобок = СтрНайти(ЦветСтрокой, ")");
			Если ПозицияНачалаСкобок > 0 И ПозицияКонцаСкобок - ПозицияНачалаСкобок > 1 Тогда
				РезультатФункции = Сред(ЦветСтрокой, ПозицияНачалаСкобок + 1);
				РезультатФункции = Лев(РезультатФункции, ПозицияКонцаСкобок - ПозицияНачалаСкобок - 1);
			КонецЕсли;
		ИначеЕсли ЦветОбласти.Вид = ВидЦвета.Абсолютный Тогда
			РезультатФункции = СтрШаблон("#%1%2%3", ИнтерфейсРМКСлужебныйКлиентСервер.DecToHex(ЦветОбласти.Красный),
				ИнтерфейсРМКСлужебныйКлиентСервер.DecToHex(ЦветОбласти.Зеленый),
				ИнтерфейсРМКСлужебныйКлиентСервер.DecToHex(ЦветОбласти.Синий));
		Иначе
			РезультатФункции = "#FFFFFF";
		КонецЕсли;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти

Функция ПолучитьИндексЭлементаКэшаТоваров(МассивТоваров, СтрокаТовара)
	
	РезультатФункции = -1;
	
	КоличествоЭлементов = МассивТоваров.Количество();
	Счт = 0;
	Пока Счт < КоличествоЭлементов И РезультатФункции = -1 Цикл
		ЭлементКэша = МассивТоваров[Счт];
		Если ЭлементКэша.Номенклатура = СтрокаТовара.Номенклатура И ЭлементКэша.Характеристика = СтрокаТовара.Характеристика
				И ЭлементКэша.Количество = СтрокаТовара.Количество Тогда
				
			РезультатФункции = Счт;
				
		КонецЕсли;
		Счт = Счт + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьИменаЭлементовПлитки()
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ВидСтраницы", "КонтейнерПлитки_");
	РезультатФункции.Вставить("ВидЭлемент", "СтраницаСодержимогоЭлемента_");
	РезультатФункции.Вставить("ВидПапка", "СтраницаСодержимогоГруппы_");
	РезультатФункции.Вставить("ВидПустой", "СтраницаПлиткаПустоеМесто_");
	РезультатФункции.Вставить("Остаток", "ОстатокВПлитке_");
	РезультатФункции.Вставить("Текст1", "НаименованиеГруппыПлитки_");
	РезультатФункции.Вставить("Текст2", "НаименованиеЭлементаПлитки_");
	РезультатФункции.Вставить("КарточкаЭлемента", "ПлиткаКарточкаЭлемента_");
	РезультатФункции.Вставить("КарточкаГруппы", "ПлиткаКарточкаГруппы_");
	РезультатФункции.Вставить("СтатусГруппы", "КартинкаСтатусаГруппы_");
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УстановитьЦветаИзбранного(Элементы, НомерКарточки, ИзбраннаяПозиция, ОтображатьОстаток, СкрыватьЦену)
	
	ИменаЭлементов = ПолучитьИменаЭлементовИзбранного();
	Элементы[ИменаЭлементов.ТекстЭлемент + НомерКарточки].ЦветТекста = ИзбраннаяПозиция.ЦветШрифта;
	Элементы[ИменаЭлементов.ТекстГруппа + НомерКарточки].ЦветТекста = ИзбраннаяПозиция.ЦветШрифта;
	Если ОтображатьОстаток Тогда
		Элементы[ИменаЭлементов.ТекстОстаток + НомерКарточки].ЦветТекста = ИзбраннаяПозиция.ЦветШрифта;
	КонецЕсли;
	Если Не СкрыватьЦену Тогда
		Элементы[ИменаЭлементов.ТекстЦена + НомерКарточки].ЦветТекста = ИзбраннаяПозиция.ЦветШрифта;
	КонецЕсли;
	Элементы[ИменаЭлементов.КарточкаИзбранного + НомерКарточки].ЦветФона = ИзбраннаяПозиция.ЦветФона;
	
КонецПроцедуры

Процедура УстановитьЦветаПлитки(Элементы, ИменаЭлементов, ИндексПП, ИзбраннаяПозиция, ОтображатьОстаток)
	
	Элементы[ИменаЭлементов.Текст1 + ИндексПП].ЦветТекста = ИзбраннаяПозиция.ЦветШрифта;
	Элементы[ИменаЭлементов.Текст2 + ИндексПП].ЦветТекста = ИзбраннаяПозиция.ЦветШрифта;
	Если ОтображатьОстаток Тогда
		Элементы[ИменаЭлементов.Остаток + ИндексПП].ЦветТекста = ИзбраннаяПозиция.ЦветШрифта;
	КонецЕсли;
	
	ИмяКарточки = ?(ИзбраннаяПозиция.ЭтоКатегория И Не ИзбраннаяПозиция.ЭтоТекущаяКатегория,
		ИменаЭлементов.КарточкаГруппы, ИменаЭлементов.КарточкаЭлемента);
	Элементы[ИмяКарточки + ИндексПП].ЦветФона = ИзбраннаяПозиция.ЦветФона;
	
КонецПроцедуры

Функция ПолучитьКартинкуСтатусаГруппыИзбранного(Интерфейс8_5, ИзбраннаяПозиция)
	
	РезультатФункции = Неопределено;
	
	Если Интерфейс8_5 Тогда
		РезультатФункции = ?(ИзбраннаяПозиция.ЭтоТекущаяКатегория,
			БиблиотекаКартинок.РМКНаУровеньВверх, БиблиотекаКартинок.РМКНаУровеньВниз);
	Иначе
		РезультатФункции = ?(ИзбраннаяПозиция.ЭтоТекущаяКатегория,
			БиблиотекаКартинок.УровеньВверх, БиблиотекаКартинок.УровеньВниз);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьДлинуЗначащихСимволов(ИсходныйТекст, ПозицияВТексте, СимволИсключения)
	
	РезультатФункции = 0;
	ИндексСимвола = 1;
	Пока ИндексСимвола < ПозицияВТексте Цикл
		ТекущийСимвол = Сред(ИсходныйТекст, ИндексСимвола, 1);
		Если Не ТекущийСимвол = СимволИсключения Тогда
			РезультатФункции = РезультатФункции + 1;
		КонецЕсли;
		ИндексСимвола = ИндексСимвола + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Функция АктивироватьЭлементВводаПриВозможности(Форма, РедактируемыйЭлемент)
	
	РезультатФункции = Ложь;
	Если Не РедактируемыйЭлемент = Неопределено Тогда
		Форма.ТекущийЭлемент = РедактируемыйЭлемент;
		РезультатФункции = Истина;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьНастройкиЧасовРМК(Форма)
	
	РезультатФункции = Новый Структура("Использование", Ложь);

	УменьшенныйМасштаб = ПредопределенноеЗначение("Перечисление.ВидыОтображения.Уменьшенный");
	СтандартныйМасштаб = ПредопределенноеЗначение("Перечисление.ВидыОтображения.Стандартный");
	УвеличенныйМасштаб = ПредопределенноеЗначение("Перечисление.ВидыОтображения.Увеличенный");
	
	ВыравниваниеАвто = НСтр("ru = 'Авто'");
	ПоложениеНет = НСтр("ru = 'Нет'");
	СвойствоПоложениеЧасов = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ПоложениеЧасов");
	СвойствоВысотаКнопок = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ВысотаКнопок");
	СвойствоЦветФона = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ЦветКнопок");
	СвойствоЦветТекста = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ЦветШрифта");
	СвойствоШрифт = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ШрифтКнопок");
	СвойствоВыравнивание = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ВыравниваниеЭлементов");
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	НастройкиЭлементов = Форма.СвойстваНастроекЭлементов;
	ГруппаОтбора = ?(Форма.РежимПлитки, ЗаголовкиОбластей.ПлиточныйИнтерфейс, ЗаголовкиОбластей.ОбластьПанельОпераций);
	НаборСвойств = НастройкиЭлементов.Получить(ГруппаОтбора);
	ЗначениеВыравнивания = Неопределено;
	Если Не НаборСвойств = Неопределено Тогда
		ПоложениеЧасов = НаборСвойств.Получить(СвойствоПоложениеЧасов);
		ЗначениеВыравнивания = НаборСвойств.Получить(СвойствоВыравнивание);
		Если Не ПоложениеЧасов = ПоложениеНет Тогда
			РезультатФункции.Использование = Истина;
			
			ЗначениеШрифта = НаборСвойств.Получить(СвойствоШрифт);
			
			ПараметрыЦветаФона = СформироватьПараметрыЦветаИзНастроек(НаборСвойств, СвойствоЦветФона);
			ПараметрыЦветаТекста = СформироватьПараметрыЦветаИзНастроек(НаборСвойств, СвойствоЦветТекста);;
			ВысотаПоля = 1;
			ШиринаПоля = 10;
			ШрифтЖирный = Ложь;
			ШрифтНаклонный = Ложь;
			Если Не (ЗначениеШрифта = Неопределено Или ЗначениеШрифта.Вид = ВидШрифта.АвтоШрифт) Тогда
				ШрифтАбсолютный = ?(ЗначениеШрифта.Вид = ВидШрифта.Абсолютный, ЗначениеШрифта, ЗначениеШрифта.ПолучитьАбсолютный());
				ШрифтЖирный = ШрифтАбсолютный.Полужирный;
				ШрифтНаклонный = ШрифтАбсолютный.Наклонный;
			КонецЕсли;
			
			ЗначениеВысоты = НаборСвойств.Получить(СвойствоВысотаКнопок);
			Если ЗначениеЗаполнено(ЗначениеВысоты) Тогда
				ВысотаПоля = Мин(ЗначениеВысоты, 2);
			ИначеЕсли Форма.РежимПлитки И Форма.ВидОтображения = УменьшенныйМасштаб Тогда
				ВысотаПоля = 2;
			Иначе
				ВысотаПоля = 1;
			КонецЕсли;
			
			Если ВысотаПоля = 1 И Форма.ВидОтображения = УменьшенныйМасштаб Тогда
				ШиринаПоля = 8;
			ИначеЕсли ВысотаПоля = 1 И Форма.ВидОтображения = СтандартныйМасштаб Тогда
				ШиринаПоля = 9;
			ИначеЕсли ВысотаПоля = 2 И Форма.ВидОтображения = УвеличенныйМасштаб Тогда
				ШиринаПоля = 11;
			КонецЕсли;
			
			РазмерШрифта = 12 + (ШиринаПоля - 7) * 2;
			
			РезультатФункции.Вставить("ЦветФона", ПараметрыЦветаФона);
			РезультатФункции.Вставить("ЦветТекста", ПараметрыЦветаТекста);
			РезультатФункции.Вставить("Высота", ВысотаПоля);
			РезультатФункции.Вставить("Ширина", ШиринаПоля);
			РезультатФункции.Вставить("РазмерШрифта", РазмерШрифта);
			РезультатФункции.Вставить("ШрифтЖирный", ШрифтЖирный);
			РезультатФункции.Вставить("ШрифтНаклонный", ШрифтНаклонный);
			РезультатФункции.Вставить("ПоложениеЧасов", ПоложениеЧасов);
			
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеВыравнивания = Неопределено Тогда
		ЗначениеВыравнивания = ВыравниваниеАвто;
	КонецЕсли;
	РезультатФункции.Вставить("ВыравниваниеПанели", ЗначениеВыравнивания);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция СформироватьПараметрыЦветаИзНастроек(НаборСвойств, СвойствоЦвет)
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("Зеленый", Неопределено);
	РезультатФункции.Вставить("Красный", Неопределено);
	РезультатФункции.Вставить("Синий", Неопределено);
	
	ЗначениеЦвета = НаборСвойств.Получить(СвойствоЦвет);
	Если Не (ЗначениеЦвета = Неопределено Или ЗначениеЦвета.Вид = ВидЦвета.АвтоЦвет) Тогда
		ЗначенияОттенков = ?(ЗначениеЦвета.Вид = ВидЦвета.Абсолютный, ЗначениеЦвета, ЗначениеЦвета.ПолучитьАбсолютный());
		
		РезультатФункции.Зеленый = ЗначенияОттенков.Зеленый;
		РезультатФункции.Красный = ЗначенияОттенков.Красный;
		РезультатФункции.Синий = ЗначенияОттенков.Синий;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция СформироватьПредставлениеЦвета(ПараметрыЦвета)
	
	Возврат СтрШаблон("#%1%2%3", ИнтерфейсРМКСлужебныйКлиентСервер.DecToHex(ПараметрыЦвета.Красный),
		ИнтерфейсРМКСлужебныйКлиентСервер.DecToHex(ПараметрыЦвета.Зеленый),
		ИнтерфейсРМКСлужебныйКлиентСервер.DecToHex(ПараметрыЦвета.Синий));
	
КонецФункции

Функция ПолучитьКодРеализацииЧасов(НастройкиЧасов)
	
	СтрокаЦветТекста = "";
	Если Не НастройкиЧасов.ЦветТекста.Зеленый = Неопределено Тогда
		ПредставлениеЦвета = СформироватьПредставлениеЦвета(НастройкиЧасов.ЦветТекста);
		СтрокаЦветТекста = СтрШаблон("color: %1;", ПредставлениеЦвета);
	КонецЕсли;
	
	СтрокаЖирногоШрифта = "";
	Если НастройкиЧасов.ШрифтЖирный Тогда
		СтрокаЖирногоШрифта = "font-weight: bolt;";
	КонецЕсли;
	
	СтрокаНаклонногоШрифта = "";
	Если НастройкиЧасов.ШрифтНаклонный Тогда
		СтрокаНаклонногоШрифта = "font-style: italic;";
	КонецЕсли;
	
	ВысотаТаблицы = "100%";
	Если НастройкиЧасов.Высота = 2 Тогда
		ВысотаТаблицы = "94%";
	КонецЕсли;
	
	РезультатФункции =
	"<html>
	|<head>
	|	<style>
	|		table {
	|			border-spacing: 0px;
	|			border-collapse: collapse;
	|		}
	|		#clockDiv {
	|			width: 100%;
	|			height: 100%;
	|		}
	|		#clockTD {
	|			&Color&
	|			&Bold&
	|			font-size: &FontSize&px;
	|			&Italic&
	|		}
	|		* {
	|			margin: 0;
	|			padding: 0;
	|		}
	|	</style>
	|	<script>
	|		function digitalClock() {
	|			var date = new Date();
	|			var hours = date.getHours();
	|			var minutes = date.getMinutes();
	|			var seconds = date.getSeconds();
	|			var hoursString = (hours < 10) ? '0' + hours.toString() : hours.toString();
	|			var minutesString = (minutes < 10) ? '0' + minutes.toString() : minutes.toString();
	|			var secondsString = (seconds < 10) ? '0' + seconds.toString() : seconds.toString();
	|			document.getElementById(""clockTD"").innerHTML = hoursString + ':' + minutesString + ':' + secondsString;
	|			setTimeout(digitalClock, 1000);
	|		}
	|	</script>
	|</head>
	|<body>
	|	<div align = ""center"" id=""clockDiv"">
	|		<table width = ""100%"" height = ""&TableHeight&"">
	|			<tr><td width = ""100%"" height = ""&TableHeight&"" align = ""center"" valign = ""middle"" id = ""clockTD""></td>
	|			</tr></table></div>
	|	<script>digitalClock();</script>
	|</body>
	|</html>";

	РезультатФункции = СтрЗаменить(РезультатФункции, "&TableHeight&", ВысотаТаблицы);
	РезультатФункции = СтрЗаменить(РезультатФункции, "&Color&", СтрокаЦветТекста);
	РезультатФункции = СтрЗаменить(РезультатФункции, "&Bold&", СтрокаЖирногоШрифта);
	РезультатФункции = СтрЗаменить(РезультатФункции, "&Italic&", СтрокаНаклонногоШрифта);
	РезультатФункции = СтрЗаменить(РезультатФункции, "&FontSize&", Строка(НастройкиЧасов.РазмерШрифта));
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ШаблонСтрокиОграниченияПродаж() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ВидКонтроля", Неопределено);
	РезультатФункции.Вставить("ТипКонтроля", Неопределено);
	РезультатФункции.Вставить("ВозрастКонтроля", 0);
	РезультатФункции.Вставить("ПодтверждениеЧерезMAX", Ложь);
	РезультатФункции.Вставить("ТекстПредупреждения", "");
	РезультатФункции.Вставить("ПараметрыВидаКонтроля", Новый Массив);
	РезультатФункции.Вставить("СтрокиТоваров", Новый Массив);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ОтключенВыводПредупрежденийВидаКонтроля(СтрокаВидаКонтроля)
	
	РезультатФункции = Ложь;
	ПараметрВыводаНайден = Ложь;
	КоличествоПараметров = СтрокаВидаКонтроля.ПараметрыКонтроля.Количество();
	ИндексПараметра = 0;
	Пока ИндексПараметра < КоличествоПараметров И Не ПараметрВыводаНайден Цикл
		СтрокаПараметра = СтрокаВидаКонтроля.ПараметрыКонтроля.Получить(ИндексПараметра);
		Если СтрокаПараметра.Параметр
				= ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.НеВыводитьСообщение") Тогда
			ПараметрВыводаНайден = Истина;
			ЗначениеВывода = СтрокаПараметра.Значение;
			ТипБулево = Новый ОписаниеТипов("Булево");
			ЗначениеБулево = ТипБулево.ПривестиЗначение(ЗначениеВывода);
			РезультатФункции = ЗначениеБулево;
		КонецЕсли;
		
		ИндексПараметра = ИндексПараметра + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УстановитьТекстПредупрежденияЗапретаОплатыБонусами(РезультатКонтроля,
		ДанныеКонтроляПродаж, ПараметрыПроверки)
		
	НеВыводитьЗапретБонусов = Ложь;
	КоличествоСтрокВидовКонтроля = ДанныеКонтроляПродаж.СтрокиВидовКонтроля.Количество();
	ВидКонтроляЗапретБонусов = ПредопределенноеЗначение("Справочник.ВидыКонтроля.ЗапретОплатыБонусами");
	ИндексСтрокиВида = 0;
	СтрокаДобавлена = Ложь;
	Пока ИндексСтрокиВида < КоличествоСтрокВидовКонтроля И Не СтрокаДобавлена Цикл
		СтрокаВидаКонтроля = ДанныеКонтроляПродаж.СтрокиВидовКонтроля.Получить(ИндексСтрокиВида);
		Если СтрокаВидаКонтроля.ВидКонтроля = ВидКонтроляЗапретБонусов Тогда
			Если ПараметрыПроверки.СоответствиеСтрокВидовКонтроля.Получить(СтрокаВидаКонтроля.ВидКонтроля) = Неопределено Тогда
				ПараметрыПроверки.СоответствиеСтрокВидовКонтроля.Вставить(СтрокаВидаКонтроля.ВидКонтроля, СтрокаВидаКонтроля);
			КонецЕсли;
			СтрокаДобавлена = Истина;
			НеВыводитьЗапретБонусов = ОтключенВыводПредупрежденийВидаКонтроля(СтрокаВидаКонтроля);
		КонецЕсли;
		ИндексСтрокиВида = ИндексСтрокиВида + 1;
	КонецЦикла;
	
	ТекстПредупрежденияЗапрета = "";
	Для Каждого ЭлементКонтроляПродаж Из ДанныеКонтроляПродаж.ЭлементыКонтроляПродаж Цикл
		ЗапретКонтроляОбработан = Ложь;
		КоличествоСтрокКонтроля = ЭлементКонтроляПродаж.СтрокиКонтроля.Количество();
		ИндексСтрокиКонтроля = 0;
		Пока ИндексСтрокиКонтроля < КоличествоСтрокКонтроля И Не ЗапретКонтроляОбработан Цикл
			СтрокаКонтроля = ЭлементКонтроляПродаж.СтрокиКонтроля.Получить(ИндексСтрокиКонтроля);
			Если СтрокаКонтроля.ВидКонтроля = ВидКонтроляЗапретБонусов
					И ОграничениеДействуетВМоментВремени(СтрокаКонтроля, ПараметрыПроверки.ДатаПроверки) Тогда
					
				ТекстПредупреждения
					= СформироватьТекстПредупреждения(ЭлементКонтроляПродаж, СтрокаКонтроля, Неопределено, ПараметрыПроверки);
				ДобавитьТекстПредупреждения(ТекстПредупрежденияЗапрета, ТекстПредупреждения);
					
				ЗапретКонтроляОбработан = Истина;
					
			КонецЕсли;
			ИндексСтрокиКонтроля = ИндексСтрокиКонтроля + 1;
		КонецЦикла;
	КонецЦикла;
	РезультатКонтроля.ТекстПредупрежденияЗапретаОплатыБонусами = ТекстПредупрежденияЗапрета;
	РезультатКонтроля.НеВыводитьЗапретБонусов = НеВыводитьЗапретБонусов;
	
КонецПроцедуры

Процедура ДобавитьТекстПредупреждения(ОбщийТекст, КусокТекста)
	
	Если ОбщийТекст = "" Тогда
		ОбщийТекст = КусокТекста;
	Иначе
		ОбщийТекст = СтрШаблон("%1%2%3", ОбщийТекст, Символы.ПС, КусокТекста);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьПроверкиДляСтрокиКонтроляПродаж(Форма, СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж,
		СтрокаТовара, ПараметрыПроверки)
		
	ТипыКонтроляНаЧек = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыКонтроляНаЧек();
	Если (Не ПараметрыПроверки.МассивВидовКонтроля.Найти(СтрокаКонтроляПродаж.ВидКонтроля) = Неопределено)
			И ОграничениеДействуетВМоментВремени(СтрокаКонтроляПродаж, ПараметрыПроверки.ДатаПроверки)
			И КонтрольСоответствуетВидуОперацииИЭтапуКонтроля(СтрокаКонтроляПродаж, Форма, ПараметрыПроверки) Тогда
			
		СтрокаВидаКонтроля = ПараметрыПроверки.СоответствиеСтрокВидовКонтроля.Получить(СтрокаКонтроляПродаж.ВидКонтроля);
		Если СтрокаКонтроляПродаж.ВидКонтроля = ПредопределенноеЗначение("Справочник.ВидыКонтроля.ЗапретОплатыБонусами")
				Или СтрокаВидаКонтроля.ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЗапретРучнойСкидки")
				Или СтрокаВидаКонтроля.ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.КонтрольОстатков") Тогда
				
			ИмяКолонкиРесурса = ПолучитьИмяРесурсаПоВидуКонтроля(СтрокаВидаКонтроля);
			Если Не ИмяКолонкиРесурса = "" Тогда
				УстановитьФлагКонтроляПродажВДобавленныхТоварах(Форма, СтрокаТовара, ИмяКолонкиРесурса, ПараметрыПроверки);
			КонецЕсли;
			
		ИначеЕсли СтрокаВидаКонтроля.ТипКонтроля
				= ПредопределенноеЗначение("Перечисление.ТипыКонтроля.КонтрольСотрудникомНаКСО") Тогда
			
			ДобавитьОграниченияКонтроляТоваровНаКСО(Форма, СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж, СтрокаТовара,
				ПараметрыПроверки);
				
		ИначеЕсли СтрокаВидаКонтроля.ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЗапретПодбора") Тогда
			
			ДобавитьОграничениеКонтроляПоСтрокеТовара(Форма, СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж,
				СтрокаТовара, ПараметрыПроверки);
			
		ИначеЕсли СтрокаВидаКонтроля.ТипКонтроля
				= ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ПроверкаПокупателя") Тогда
				
			ДобавитьОграничениеКонтроляПокупателя(Форма, СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж, СтрокаТовара,
				ПараметрыПроверки);
				
		ИначеЕсли СтрокаВидаКонтроля.ТипКонтроля
				= ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваВСтроке") Тогда
				
			ДобавитьОграничениеКонтроляПриВыполненииПредельногоУсловия(Форма, СтрокаЭлементаКонтроляПродаж,
				СтрокаКонтроляПродаж, СтрокаТовара, ПараметрыПроверки);
				
		ИначеЕсли Не ТипыКонтроляНаЧек.Найти(СтрокаВидаКонтроля.ТипКонтроля) = Неопределено Тогда
			
			ДобавитьОграничениеНаЧекПриВыполненииУсловия(Форма, СтрокаКонтроляПродаж, ПараметрыПроверки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОграничениеСтрокиТовараПриВыполненииПредельногоУсловия(Форма, СтрокаЭлементаКонтроляПродаж,
		СтрокаКонтроляПродаж, СтрокаТовара, ПараметрыПроверки, ЗначениеПредела)
	
	ЭтапыКонтроляПродаж = ЭтапыКонтроляПродаж();
	СтрокаВидаКонтроля = ПараметрыПроверки.СоответствиеСтрокВидовКонтроля.Получить(СтрокаКонтроляПродаж.ВидКонтроля);
	
	ЗначениеИзСтрокиТовара = ПолучитьКонтролируемоеЗначениеСтрокиТовара(СтрокаТовара, СтрокаВидаКонтроля);
	Если ЗначениеИзСтрокиТовара > ЗначениеПредела Тогда
		
		НайденноеОграничение = Неопределено;
		РезультатКонтроля = Форма.РезультатКонтроляПродаж;
		ПозицияДобавления = ПолучитьПозициюДобавленияОграничения(Форма, РезультатКонтроля.ОграниченияПродаж,
			СтрокаВидаКонтроля, Неопределено, ПараметрыПроверки, НайденноеОграничение);
		Если ПозицияДобавления >= 0 Тогда
			
			ТекстПредупреждения = СформироватьТекстПредупреждения(СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж,
				СтрокаТовара, ПараметрыПроверки);
			НоваяСтрокаОграничения = ШаблонСтрокиОграниченияПродаж();
			НоваяСтрокаОграничения.ВидКонтроля = СтрокаВидаКонтроля.ВидКонтроля;
			НоваяСтрокаОграничения.ТипКонтроля = СтрокаВидаКонтроля.ТипКонтроля;
			НоваяСтрокаОграничения.ТекстПредупреждения = ТекстПредупреждения;
			НоваяСтрокаОграничения.ПараметрыВидаКонтроля = СтрокаВидаКонтроля.ПараметрыКонтроля;
			НоваяСтрокаОграничения.СтрокиТоваров.Добавить(СтрокаТовара.ПолучитьИдентификатор());
			РезультатКонтроля.ОграниченияПродаж.Вставить(ПозицияДобавления, НоваяСтрокаОграничения);
			
		ИначеЕсли НайденноеОграничение.СтрокиТоваров.Найти(СтрокаТовара.ПолучитьИдентификатор()) = Неопределено Тогда
			НайденноеОграничение.СтрокиТоваров.Добавить(СтрокаТовара.ПолучитьИдентификатор());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбойтиСтрокиТоваровПриДобавленииПредельногоОграниченияНаСтроку(Форма, СтрокаЭлементаКонтроляПродаж,
	СтрокаКонтроляПродаж, СтрокаТовара, ПараметрыПроверки, ЗначениеПредела)
	
	МассивНомеровНаборов = Новый Массив;
	ЭтапыКонтроляПродаж = ЭтапыКонтроляПродаж();
	Если СтрокаТовара = Неопределено Тогда
		
		КоллекцияТоваров = ?(ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ДобавлениеТовара
			Или ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ИзменениеСтрокиТовара,
			Форма.РезультатКонтроляПродаж.КонтролируемыеСтрокиТоваров, Форма.Объект.Товары);
			
		Для Каждого СтрокаКоллекции Из КоллекцияТоваров Цикл
			Если СтрокаКоллекции.ЭтоНабор И ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ИзменениеСтрокиТовара Тогда
				МассивНомеровНаборов.Добавить(СтрокаКоллекции.НомерНабора);
			КонецЕсли;
			ДобавитьОграничениеСтрокиТовараПриВыполненииПредельногоУсловия(Форма, СтрокаЭлементаКонтроляПродаж,
				СтрокаКонтроляПродаж, СтрокаКоллекции, ПараметрыПроверки, ЗначениеПредела);
		КонецЦикла;
		
	Иначе
		Если СтрокаТовара.ЭтоНабор И ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ИзменениеСтрокиТовара Тогда
			МассивНомеровНаборов.Добавить(СтрокаТовара.НомерНабора);
		КонецЕсли;
		ДобавитьОграничениеСтрокиТовараПриВыполненииПредельногоУсловия(Форма, СтрокаЭлементаКонтроляПродаж,
			СтрокаКонтроляПродаж, СтрокаТовара, ПараметрыПроверки, ЗначениеПредела);
	КонецЕсли;
		
	Если МассивНомеровНаборов.Количество() > 0 Тогда
		
		ТоварыЧека = Форма.Объект.Товары;
		СтрокиНаборов = ПолучитьСтрокиНабораИзКоллекции(ТоварыЧека, МассивНомеровНаборов);
		Для Каждого СтрокаНабора Из СтрокиНаборов Цикл
			ДобавитьОграничениеСтрокиТовараПриВыполненииПредельногоУсловия(Форма, СтрокаЭлементаКонтроляПродаж,
				СтрокаКонтроляПродаж, СтрокаНабора, ПараметрыПроверки, ЗначениеПредела);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОграничениеКонтроляПриВыполненииПредельногоУсловия(Форма, СтрокаЭлементаКонтроляПродаж,
	СтрокаКонтроляПродаж, СтрокаТовара, ПараметрыПроверки)
	
	ЭтапыКонтроляПродаж = ЭтапыКонтроляПродаж();
	ЗначениеПредела = 0;
	ПредупреждениеОтключено = Ложь;
	СтрокаВидаКонтроля = ПараметрыПроверки.СоответствиеСтрокВидовКонтроля.Получить(СтрокаКонтроляПродаж.ВидКонтроля);
	ЗаполнитьПараметрыКонтроляСЛимитом(СтрокаВидаКонтроля, ЗначениеПредела, ПредупреждениеОтключено);
	
	НадоПредупредить = (Форма.ПодтвержденныеВидыКонтроляВЧеке.НайтиПоЗначению(СтрокаВидаКонтроля.ВидКонтроля)
		= Неопределено И Не ПредупреждениеОтключено);
	
	Если ЗначениеПредела > 0 И (НадоПредупредить
		Или ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ПробитиеЧека
		Или ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ПереходКОплате) Тогда
		
		ОбойтиСтрокиТоваровПриДобавленииПредельногоОграниченияНаСтроку(Форма, СтрокаЭлементаКонтроляПродаж,
			СтрокаКонтроляПродаж, СтрокаТовара, ПараметрыПроверки, ЗначениеПредела);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОграничениеНаЧекПриВыполненииУсловия(Форма, СтрокаКонтроляПродаж, ПараметрыПроверки)
	
	ЭтапыКонтроляПродаж = ЭтапыКонтроляПродаж();
	УсловиеВыполняется = Ложь;
	СтрокаВидаКонтроля = ПараметрыПроверки.СоответствиеСтрокВидовКонтроля.Получить(СтрокаКонтроляПродаж.ВидКонтроля);
	ЗначениеПредела = 0;
	ПредупреждениеОтключено = Ложь;
	
	ЗаполнитьПараметрыКонтроляСЛимитом(СтрокаВидаКонтроля, ЗначениеПредела, ПредупреждениеОтключено);
	Если ЗначениеПредела > 0 Тогда
		ЗначениеИзЧека = ПолучитьКонтролируемоеЗначениеИзЧека(Форма, СтрокаВидаКонтроля);
		УсловиеВыполняется = (ЗначениеИзЧека > ЗначениеПредела);
	КонецЕсли;
	НадоПредупредить = (Форма.ПодтвержденныеВидыКонтроляВЧеке.НайтиПоЗначению(СтрокаВидаКонтроля.ВидКонтроля)
		= Неопределено И Не ПредупреждениеОтключено);
		
	Если УсловиеВыполняется И (НадоПредупредить
		Или ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ПробитиеЧека
		Или ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ПереходКОплате) Тогда
		
		НайденноеОграничение = Неопределено;
		РезультатКонтроля = Форма.РезультатКонтроляПродаж;
		ПозицияДобавления = ПолучитьПозициюДобавленияОграничения(Форма, РезультатКонтроля.ОграниченияПродаж,
			СтрокаВидаКонтроля, Неопределено, ПараметрыПроверки, НайденноеОграничение);
		Если ПозицияДобавления >= 0 Тогда
			
			ТекстПредупреждения = СформироватьТекстПредупреждения(Неопределено, СтрокаКонтроляПродаж,
				Неопределено, ПараметрыПроверки);
			НоваяСтрокаОграничения = ШаблонСтрокиОграниченияПродаж();
			НоваяСтрокаОграничения.ВидКонтроля = СтрокаВидаКонтроля.ВидКонтроля;
			НоваяСтрокаОграничения.ТипКонтроля = СтрокаВидаКонтроля.ТипКонтроля;
			НоваяСтрокаОграничения.ТекстПредупреждения = ТекстПредупреждения;
			НоваяСтрокаОграничения.ПараметрыВидаКонтроля = СтрокаВидаКонтроля.ПараметрыКонтроля;
			РезультатКонтроля.ОграниченияПродаж.Вставить(ПозицияДобавления, НоваяСтрокаОграничения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОграниченияКонтроляТоваровНаКСО(Форма, СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж,
		СтрокаТовара, ПараметрыПроверки)
	
	РезультатКонтроля = Форма.РезультатКонтроляПродаж;
	Если СтрокаТовара = Неопределено Тогда
		Для Каждого СтрокаТовараКоллекции Из РезультатКонтроля.КонтролируемыеСтрокиТоваров Цикл
			ДобавитьОграничениеКонтроляПоСтрокеТовара(Форма, СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж,
				СтрокаТовараКоллекции, ПараметрыПроверки);
		КонецЦикла;
	Иначе
		ДобавитьОграничениеКонтроляПоСтрокеТовара(Форма, СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж,
			СтрокаТовара, ПараметрыПроверки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОграничениеКонтроляПокупателя(Форма, СтрокаЭлементаКонтроляПродаж,
		СтрокаКонтроляПродаж, СтрокаТовара, ПараметрыПроверки)
		
	СтрокаВидаКонтроля = ПараметрыПроверки.СоответствиеСтрокВидовКонтроля.Получить(СтрокаКонтроляПродаж.ВидКонтроля);
	ЭтоПроверкаВозраста = Ложь;
	ЗначениеВозраста = ПолучитьЗначениеВозрастаВидаКонтроля(СтрокаВидаКонтроля, ЭтоПроверкаВозраста);
	ВидКонтроляУжеУчтен = Ложь;
	Если ЭтоПроверкаВозраста Тогда
		Если Форма.ПодтвержденныйВозрастПокупателя >= ЗначениеВозраста Тогда
			ВидКонтроляУжеУчтен = Истина;
		КонецЕсли;
	ИначеЕсли Не Форма.ПодтвержденныеВидыКонтроляВЧеке.НайтиПоЗначению(СтрокаВидаКонтроля.ВидКонтроля)
			= Неопределено Тогда
		ВидКонтроляУжеУчтен = Истина;
	КонецЕсли;
	Если Не ВидКонтроляУжеУчтен Тогда
		ДобавитьОграничениеКонтроляПоСтрокеТовара(Форма, СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж, СтрокаТовара,
			ПараметрыПроверки);
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьОграничениеКонтроляПоСтрокеТовара(Форма, СтрокаЭлементаКонтроляПродаж,
		СтрокаКонтроляПродаж, СтрокаТовара, ПараметрыПроверки)
		
	НайденноеОграничение = Неопределено;
	РезультатКонтроля = Форма.РезультатКонтроляПродаж;
	СтрокаВидаКонтроля = ПараметрыПроверки.СоответствиеСтрокВидовКонтроля.Получить(СтрокаКонтроляПродаж.ВидКонтроля);
	ПозицияДобавления = ПолучитьПозициюДобавленияОграничения(Форма, РезультатКонтроля.ОграниченияПродаж,
		СтрокаВидаКонтроля, СтрокаТовара, ПараметрыПроверки, НайденноеОграничение);
	Если ПозицияДобавления >= 0 Тогда
		
		ТекстПредупреждения = СформироватьТекстПредупреждения(СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж,
			СтрокаТовара, ПараметрыПроверки);
			
		ЭтоПроверкаВозраста = Ложь;
		ЗначениеВозраста = ПолучитьЗначениеВозрастаВидаКонтроля(СтрокаВидаКонтроля, ЭтоПроверкаВозраста);
			
		НоваяСтрокаОграничения = ШаблонСтрокиОграниченияПродаж();
		Если ЭтоПроверкаВозраста Тогда
			НоваяСтрокаОграничения.ВозрастКонтроля = ЗначениеВозраста;
			НоваяСтрокаОграничения.ПодтверждениеЧерезMAX = ЭтоПодтверждениеЧерезMAX(СтрокаВидаКонтроля,
				Форма.ИспользоватьПодтверждениеВозрастаЧерезMAX);
		Иначе
			НоваяСтрокаОграничения.ВидКонтроля = СтрокаВидаКонтроля.ВидКонтроля;
		КонецЕсли;
		НоваяСтрокаОграничения.ТипКонтроля = СтрокаВидаКонтроля.ТипКонтроля;
		НоваяСтрокаОграничения.ТекстПредупреждения = ТекстПредупреждения;
		НоваяСтрокаОграничения.ПараметрыВидаКонтроля = СтрокаВидаКонтроля.ПараметрыКонтроля;
		ДобавитьСтрокиТоваровВОграничение(Форма, НоваяСтрокаОграничения, СтрокаТовара, ПараметрыПроверки);
		
		РезультатКонтроля.ОграниченияПродаж.Вставить(ПозицияДобавления, НоваяСтрокаОграничения);
		
	Иначе
		
		ДобавитьСтрокиТоваровВОграничение(Форма, НайденноеОграничение, СтрокаТовара, ПараметрыПроверки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокиТоваровВОграничение(Форма, СтрокаОграничения, СтрокаТовара, ПараметрыПроверки)
	
	ЭтапыКонтроляПродаж = ЭтапыКонтроляПродаж();
	КоллекцияТоваров = ?(ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ДобавлениеТовара
		Или ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ИзменениеСтрокиТовара,
			Форма.РезультатКонтроляПродаж.КонтролируемыеСтрокиТоваров, Форма.Объект.Товары);
		
	МассивНомеровНаборов = Новый Массив;
	
	Если СтрокаТовара = Неопределено Тогда
		Для Каждого СтрокаКоллекции Из КоллекцияТоваров Цикл
			Если СтрокаОграничения.СтрокиТоваров.Найти(СтрокаКоллекции.ПолучитьИдентификатор()) = Неопределено Тогда
				СтрокаОграничения.СтрокиТоваров.Добавить(СтрокаКоллекции.ПолучитьИдентификатор());
				Если СтрокаКоллекции.ЭтоНабор Тогда
					МассивНомеровНаборов.Добавить(СтрокаКоллекции.НомерНабора);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли СтрокаОграничения.СтрокиТоваров.Найти(СтрокаТовара.ПолучитьИдентификатор()) = Неопределено Тогда
		СтрокаОграничения.СтрокиТоваров.Добавить(СтрокаТовара.ПолучитьИдентификатор());
		Если СтрокаТовара.ЭтоНабор Тогда
			МассивНомеровНаборов.Добавить(СтрокаТовара.НомерНабора);
		КонецЕсли;
	КонецЕсли;
	СтрокиНаборов = ПолучитьСтрокиНабораИзКоллекции(КоллекцияТоваров, МассивНомеровНаборов);
	Для Каждого СтрокаНабора Из СтрокиНаборов Цикл
		Если СтрокаОграничения.СтрокиТоваров.Найти(СтрокаНабора.ПолучитьИдентификатор()) = Неопределено Тогда
			СтрокаОграничения.СтрокиТоваров.Добавить(СтрокаНабора.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКонтролируемоеЗначениеИзЧека(Форма, СтрокаВидаКонтроля)
	
	РезультатФункции = 0;
	Если СтрокаВидаКонтроля.ТипКонтроля
		= ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваСтрокВЧеке") Тогда
		РезультатФункции = Форма.Объект.Товары.Количество();
	ИначеЕсли СтрокаВидаКонтроля.ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитСуммыВЧеке") Тогда
		РезультатФункции = Форма.СуммаИтого;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьКонтролируемоеЗначениеСтрокиТовара(СтрокаТовара, СтрокаВидаКонтроля)
	
	РезультатФункции = 0;
	
	Если СтрокаВидаКонтроля.ТипКонтроля
		= ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваВСтроке") Тогда
		
		РезультатФункции = СтрокаТовара.Количество;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗаполнитьПараметрыКонтроляСЛимитом(СтрокаВидаКонтроля, ЗначениеПредела, ПредупреждениеОтключено)
	
	ПараметрСкрытьПредупреждение = ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.НеВыводитьСообщение");
	ПараметрЗначениеЛимита = ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.ПредельноеЗначение");
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	КоличествоПараметров = СтрокаВидаКонтроля.ПараметрыКонтроля.Количество();
	Для Каждого СтрокаПараметра Из СтрокаВидаКонтроля.ПараметрыКонтроля Цикл
		Если СтрокаПараметра.Параметр = ПараметрСкрытьПредупреждение Тогда
			ПредупреждениеОтключено = ТипБулево.ПривестиЗначение(СтрокаПараметра.Значение);
		ИначеЕсли СтрокаПараметра.Параметр = ПараметрЗначениеЛимита Тогда
			ЗначениеПредела = ТипЧисло.ПривестиЗначение(СтрокаПараметра.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтрокиНабораИзКоллекции(КоллекцияТоваров, МассивНомеровНаборов)
	
	МассивСтрокНаборов = Новый Массив;
	Для Каждого СтрокаКоллекции Из КоллекцияТоваров Цикл
		Если СтрокаКоллекции.ЭтоНабор И Не МассивНомеровНаборов.Найти(СтрокаКоллекции.НомерНабора) = Неопределено Тогда
			МассивСтрокНаборов.Добавить(СтрокаКоллекции);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСтрокНаборов;
	
КонецФункции

Функция СформироватьТекстПредупреждения(СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж, СтрокаТовара,
		ПараметрыПроверки)
		
	СтрокаВидаКонтроля = ПараметрыПроверки.СоответствиеСтрокВидовКонтроля.Получить(СтрокаКонтроляПродаж.ВидКонтроля);
	ТекстПредупреждения = СокрЛП(СтрокаВидаКонтроля.ТекстШаблонаПредупреждения);
	ПараметрыИзШаблона = ПолучитьПараметрыИзТекстаШаблонаПредупреждения(ТекстПредупреждения);
	Для каждого ПараметрШаблона Из ПараметрыИзШаблона Цикл
		ТекстПараметра = СформироватьТекстПоПараметруШаблона(ПараметрШаблона, СтрокаЭлементаКонтроляПродаж,
			СтрокаКонтроляПродаж, СтрокаТовара, ПараметрыПроверки);
		ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, СтрШаблон("[%1]", ПараметрШаблона), ТекстПараметра);
	КонецЦикла;
	
	Возврат ТекстПредупреждения;
		
КонецФункции

Функция СформироватьТекстПоПараметруШаблона(ПараметрШаблона, СтрокаЭлементаКонтроляПродаж, СтрокаКонтроляПродаж,
		СтрокаТовара, ПараметрыПроверки)
	
	РезультатФункции = "";
	СтрокаВидаКонтроля = ПараметрыПроверки.СоответствиеСтрокВидовКонтроля.Получить(СтрокаКонтроляПродаж.ВидКонтроля);
	ИмяПараметраГруппаТоваров = "ГруппаТоваров";
	ИмяПараметраОписаниеПериода = "ОписаниеПериода";
	ИмяПараметраВозраст = "Возраст";
	ИмяПараметраДатаРождения = "ДатаРождения";
	ИмяПараметраПредставлениеТовара = "ПредставлениеТовара";
	СдвигГода = -12;
	
	Если ПараметрШаблона = ИмяПараметраГруппаТоваров Тогда
		РезультатФункции = СокрЛП(СтрокаЭлементаКонтроляПродаж.НаименованиеГруппыТоваров);
	ИначеЕсли ПараметрШаблона = ИмяПараметраОписаниеПериода Тогда
		ПустаяДата = Дата(1, 1, 1, 0, 0, 0);
		ДатаКонецДня = Дата(1, 1, 1, 23, 59, 59);
		Если ЗначениеЗаполнено(СтрокаКонтроляПродаж.ВремяНачала) Или (ЗначениеЗаполнено(СтрокаКонтроляПродаж.ВремяОкончания)
				И Не СтрокаКонтроляПродаж.ВремяОкончания = ДатаКонецДня) Тогда
			РезультатФункции = СтрШаблон(НСтр("ru = 'с %1 по %2'"),
				Формат(СтрокаКонтроляПродаж.ВремяНачала, "ДФ=HH.mm; ДП=00:00"),
				Формат(СтрокаКонтроляПродаж.ВремяОкончания, "ДФ=HH.mm; ДП=00:00"));
		КонецЕсли;
	ИначеЕсли ПараметрШаблона = ИмяПараметраВозраст Тогда
		ЗначениеВозраста = ПолучитьЗначениеВозрастаВидаКонтроля(СтрокаВидаКонтроля);
		Если ЗначениеВозраста > 0 Тогда
			РезультатФункции = Формат(ЗначениеВозраста, "ЧГ=");
		КонецЕсли;
	ИначеЕсли ПараметрШаблона = ИмяПараметраДатаРождения Тогда
		ЗначениеВозраста = ПолучитьЗначениеВозрастаВидаКонтроля(СтрокаВидаКонтроля);
		Если ЗначениеВозраста > 0 Тогда
			ДатаРождения = ДобавитьМесяц(ПараметрыПроверки.ДатаПроверки, СдвигГода * ЗначениеВозраста);
			РезультатФункции = Формат(ДатаРождения, "ДЛФ=D");
		КонецЕсли;
	ИначеЕсли ПараметрШаблона = ИмяПараметраПредставлениеТовара Тогда
		Если Не СтрокаТовара = Неопределено Тогда
			РезультатФункции = СокрЛП(СтрокаТовара.ПредставлениеНоменклатураХарактеристика);
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьЗначениеВозрастаВидаКонтроля(СтрокаВидаКонтроля, ЭтоВидКонтроляПроверкаВозраста = Неопределено)
	
	РезультатФункции = 0;
	
	КоличествоПараметров = СтрокаВидаКонтроля.ПараметрыКонтроля.Количество();
	ИндексПараметра = 0;
	ПараметрНайден = Ложь;
	ПараметрВозраст = ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.Возраст");
	ТипЧисло = Новый ОписаниеТипов("Число");
	Пока ИндексПараметра < КоличествоПараметров И Не ПараметрНайден Цикл
		СтрокаПараметра = СтрокаВидаКонтроля.ПараметрыКонтроля.Получить(ИндексПараметра);
		Если СтрокаПараметра.Параметр = ПараметрВозраст Тогда
			РезультатФункции = ТипЧисло.ПривестиЗначение(СтрокаПараметра.Значение);
			ПараметрНайден = Истина;
		КонецЕсли;
		
		ИндексПараметра = ИндексПараметра + 1;
	КонецЦикла;
	ЭтоВидКонтроляПроверкаВозраста = (ПараметрНайден
		И СтрокаВидаКонтроля.ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ПроверкаПокупателя"));
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьПозициюДобавленияОграничения(Форма, ОграниченияПродаж, СтрокаВидаКонтроля, СтрокаТовара,
		ПараметрыПроверки, НайденноеОграничение)
	
	ПозицияДобавления = 0;
	КоличествоОграничений = ОграниченияПродаж.Количество();
	ПорядокТекущегоТипа = ПараметрыПроверки.ИспользуемыеТипыКонтроля.Найти(СтрокаВидаКонтроля.ТипКонтроля);
	ИндексОграничения = 0;
	
	ЭтоПроверкаВозраста = Ложь;
	ЗначениеВозраста = ПолучитьЗначениеВозрастаВидаКонтроля(СтрокаВидаКонтроля, ЭтоПроверкаВозраста);
	ПодтверждениеЧерезMAX = ЭтоПодтверждениеЧерезMAX(СтрокаВидаКонтроля,
		Форма.ИспользоватьПодтверждениеВозрастаЧерезMAX);
	ТипПроверкаПокупателя = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ПроверкаПокупателя");
	
	Пока ИндексОграничения < КоличествоОграничений Цикл
		СтрокаОграничения = ОграниченияПродаж.Получить(ИндексОграничения);
		Если ОграниченияКонтроляИдентичны(Форма, СтрокаОграничения, СтрокаВидаКонтроля, СтрокаТовара,
			ЗначениеВозраста, ПодтверждениеЧерезMAX) Тогда
			
			ИндексОграничения = КоличествоОграничений;
			ПозицияДобавления = -1;
			НайденноеОграничение = СтрокаОграничения;
		Иначе
			ПорядокПроверяемогоТипа = ПараметрыПроверки.ИспользуемыеТипыКонтроля.Найти(СтрокаОграничения.ТипКонтроля);
			Если ПорядокТекущегоТипа > ПорядокПроверяемогоТипа Тогда
				ИндексОграничения = ИндексОграничения + 1;
				ПозицияДобавления = ИндексОграничения;
			ИначеЕсли ПорядокТекущегоТипа = ПорядокПроверяемогоТипа Тогда
				Если СтрокаОграничения.ТипКонтроля = ТипПроверкаПокупателя Тогда
					ОпределитьПозициюДобавленияОграниченияТипаПроверкаПокупателя(СтрокаОграничения,
						ЭтоПроверкаВозраста, ЗначениеВозраста, ПодтверждениеЧерезMAX,
						ПозицияДобавления, КоличествоОграничений, ИндексОграничения);
				Иначе
					ИндексОграничения = ИндексОграничения + 1;
					ПозицияДобавления = ИндексОграничения;
				КонецЕсли;
			Иначе
				ИндексОграничения = КоличествоОграничений;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат ПозицияДобавления;
	
КонецФункции

Функция ОграниченияКонтроляИдентичны(Форма, СтрокаОграничения, СтрокаВидаКонтроля, СтрокаТовара,
	ЗначениеВозраста, ПодтверждениеЧерезMAX)
	
	РезультатФункции = Ложь;
	
	ТипПроверкаПокупателя = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ПроверкаПокупателя");
	
	Если СтрокаВидаКонтроля.ТипКонтроля
			= ПредопределенноеЗначение("Перечисление.ТипыКонтроля.КонтрольСотрудникомНаКСО") Тогда
			
		Если СтрокаОграничения.СтрокиТоваров.Количество() > 0 Тогда
			
			ИдентификаторСтроки = СтрокаОграничения.СтрокиТоваров[0];
			СтрокаТовараОграничения = Форма.Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
			РезультатФункции = (СтрокаОграничения.ТипКонтроля = СтрокаВидаКонтроля.ТипКонтроля
				И СтрокаТовараОграничения.Номенклатура = СтрокаТовара.Номенклатура
				И СтрокаТовараОграничения.Характеристика = СтрокаТовара.Характеристика);
			
		КонецЕсли;
			
	ИначеЕсли СтрокаВидаКонтроля.ТипКонтроля = ТипПроверкаПокупателя Тогда
			
		Если ЗначениеВозраста > 0 И СтрокаОграничения.ВозрастКонтроля > 0 Тогда
			РезультатФункции = (ЗначениеВозраста = СтрокаОграничения.ВозрастКонтроля
				И СтрокаОграничения.ТипКонтроля = ТипПроверкаПокупателя
				И СтрокаОграничения.ПодтверждениеЧерезMAX = ПодтверждениеЧерезMAX);
		Иначе
			РезультатФункции = (СтрокаОграничения.ВидКонтроля = СтрокаВидаКонтроля.ВидКонтроля);
		КонецЕсли;
		
	Иначе
			
		РезультатФункции = (СтрокаОграничения.ВидКонтроля = СтрокаВидаКонтроля.ВидКонтроля);
			
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьИмяРесурсаПоВидуКонтроля(СтрокаВидаКонтроля)
	
	РезультатФункции = "";
	
	Если СтрокаВидаКонтроля.ВидКонтроля = ПредопределенноеЗначение("Справочник.ВидыКонтроля.ЗапретОплатыБонусами") Тогда
		РезультатФункции = "ЗапретОплатыБонусамиСкидками";
	ИначеЕсли СтрокаВидаКонтроля.ТипКонтроля
			= ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЗапретРучнойСкидки") Тогда
		
		РезультатФункции = "ЗапретРучныхСкидок";
	ИначеЕсли СтрокаВидаКонтроля.ТипКонтроля
			= ПредопределенноеЗначение("Перечисление.ТипыКонтроля.КонтрольОстатков") Тогда
		
		РезультатФункции = "КонтролироватьОстатки";
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УстановитьФлагКонтроляПродажВДобавленныхТоварах(Форма, СтрокаТовара, ИмяКолонкиРесурса, ПараметрыПроверки)
	
	Если СтрокаТовара = Неопределено Тогда
		
		РезультатКонтроля = Форма.РезультатКонтроляПродаж;
		
		ЭтапыКонтроляПродаж = ЭтапыКонтроляПродаж();
		КоллекцияТоваров = ?(ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ОткрытиеЧека,
			Форма.Объект.Товары, РезультатКонтроля.КонтролируемыеСтрокиТоваров);
		
		Для Каждого СтрокаТовараКоллекции Из КоллекцияТоваров Цикл
			СтрокаТовараКоллекции[ИмяКолонкиРесурса] = Истина;
		КонецЦикла;
		
	Иначе
		СтрокаТовара[ИмяКолонкиРесурса] = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ОграничениеДействуетВМоментВремени(СтрокаКонтроляПродаж, МоментВремени)
	
	РезультатФункции = Ложь;
	ПустаяДата = Дата(1, 1, 1, 0, 0, 0);
	Если МоментВремени >= СтрокаКонтроляПродаж.НачалоПериода
			И (МоментВремени <= КонецДня(СтрокаКонтроляПродаж.КонецПериода)
			Или СтрокаКонтроляПродаж.КонецПериода = ПустаяДата) Тогда
	
		ВремяПроверки = ОбщегоНазначенияРМККлиентСервер.ВремяИзДатыВСекундах(МоментВремени);
		ТекущийДеньНедели = ОбщегоНазначенияРМККлиентСервер.ДеньНеделиПеречислением(МоментВремени);
		
		ВремяНачалаЗапрета = ОбщегоНазначенияРМККлиентСервер.ВремяИзДатыВСекундах(СтрокаКонтроляПродаж.ВремяНачала);
		ВремяОкончанияЗапрета = ОбщегоНазначенияРМККлиентСервер.ВремяИзДатыВСекундах(СтрокаКонтроляПродаж.ВремяОкончания);
		ДеньНеделиЗапрета = СтрокаКонтроляПродаж.ДеньНедели;
		
		ЭтоДеньЗапрета = (ДеньНеделиЗапрета = ТекущийДеньНедели Или НЕ ЗначениеЗаполнено(ДеньНеделиЗапрета));
		Если ЭтоДеньЗапрета И ВремяПроверки >= ВремяНачалаЗапрета
				И (ВремяПроверки <= ВремяОкончанияЗапрета Или ВремяОкончанияЗапрета = 0) Тогда
				
			РезультатФункции = Истина;
				
		КонецЕсли;
		
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция КонтрольСоответствуетВидуОперацииИЭтапуКонтроля(СтрокаКонтроляПродаж, Форма, ПараметрыПроверки)
	
	РезультатФункции = Истина;
	ЭтапыКонтроляПродаж = ЭтапыКонтроляПродаж();
	ЭтоВозврат = ОбщегоНазначенияРМККлиент.ЭтоВидОперацииВозврат(Форма.Объект.ВидОперации);
	ТипКонтроляЗапретПодбора = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЗапретПодбора");
	ТипКонтроляПроверкаПокупателя = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ПроверкаПокупателя");
	ТипКонтроляКоличествоВСтроке = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваВСтроке");
	ТипКонтроляКоличествоСтрокВЧеке = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваСтрокВЧеке");
	ТипКонтроляСуммаВЧеке = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитСуммыВЧеке");
	
	ТипыКонтроляИсключения = Новый Массив;
	ТипыКонтроляИсключения.Добавить(ТипКонтроляЗапретПодбора);
	ТипыКонтроляИсключения.Добавить(ТипКонтроляПроверкаПокупателя);
	
	ТипыКонтроляЛимитов = Новый Массив;
	ТипыКонтроляЛимитов.Добавить(ТипКонтроляКоличествоВСтроке);
	ТипыКонтроляЛимитов.Добавить(ТипКонтроляКоличествоСтрокВЧеке);
	ТипыКонтроляЛимитов.Добавить(ТипКонтроляСуммаВЧеке);
	
	СтрокаВидаКонтроля = ПараметрыПроверки.СоответствиеСтрокВидовКонтроля.Получить(СтрокаКонтроляПродаж.ВидКонтроля);
	Если ЭтоВозврат Тогда
		ЭтоТипИсключенияПриДобавленииТовара = (ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ДобавлениеТовара
			И Не ТипыКонтроляИсключения.Найти(СтрокаВидаКонтроля.ТипКонтроля) = Неопределено);
		ЭтоПовторПроверкиЗапретаПриПробитии = ((ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ПробитиеЧека
			Или ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ПереходКОплате)
			И Форма.ИгнорироватьЗапретПодбора И СтрокаВидаКонтроля.ТипКонтроля = ТипКонтроляЗапретПодбора);
		ЭтоПроверкаПокупателяПриПробитии = ((ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ПробитиеЧека
			Или ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ПереходКОплате)
			И СтрокаВидаКонтроля.ТипКонтроля = ТипКонтроляПроверкаПокупателя);
		ЭтоКонтрольЛимитаПриПробитии = ((ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ПробитиеЧека
			Или ПараметрыПроверки.ЭтапКонтроля = ЭтапыКонтроляПродаж.ПереходКОплате)
			И НЕ ТипыКонтроляЛимитов.Найти(СтрокаВидаКонтроля.ТипКонтроля) = Неопределено);
		
		Если ЭтоТипИсключенияПриДобавленииТовара Или ЭтоПовторПроверкиЗапретаПриПробитии
				Или ЭтоПроверкаПокупателяПриПробитии Или ЭтоКонтрольЛимитаПриПробитии Тогда
			РезультатФункции = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьЭлементыКонтроляПродажПоНоменклатуре(КэшКонтроляПродаж, СтрокаТовара)
	
	РезультатФункции = Новый Массив;
	
	Если СтрокаТовара = Неопределено Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Для Каждого СтрокаНоменклатурыКэшаПлитки Из КэшКонтроляПродаж.НоменклатураПлиткиКонтроляПродаж Цикл
		Если ТоварСоответствуетНоменклатуреХарактеристике(СтрокаНоменклатурыКэшаПлитки, СтрокаТовара) Тогда
			ДобавитьСтрокиКонтроляПродажВКоллекцию(КэшКонтроляПродаж, СтрокаНоменклатурыКэшаПлитки.МассивКонтролейПродаж,
				РезультатФункции);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаНоменклатурыКэша Из КэшКонтроляПродаж.НоменклатураКонтроляПродаж Цикл
		Если ТоварСоответствуетНоменклатуреХарактеристике(СтрокаНоменклатурыКэша, СтрокаТовара) Тогда
			ДобавитьСтрокиКонтроляПродажВКоллекцию(КэшКонтроляПродаж, СтрокаНоменклатурыКэша.МассивКонтролейПродаж,
				РезультатФункции);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТоварСоответствуетНоменклатуреХарактеристике(СтрокаНоменклатурыКэша, СтрокаТовара)
	
	Возврат (СтрокаНоменклатурыКэша.Номенклатура = СтрокаТовара.Номенклатура
		И (СтрокаНоменклатурыКэша.Характеристика = СтрокаТовара.Характеристика
			Или Не ЗначениеЗаполнено(СтрокаНоменклатурыКэша.Характеристика)));
	
КонецФункции

Процедура ДобавитьСтрокиКонтроляПродажВКоллекцию(КэшКонтроляПродаж, МассивКонтролейПродаж, СтрокиЭлементовКонтроля)
	
	Для Каждого ЭлементКонтроля Из МассивКонтролейПродаж Цикл
		СтрокаЭлементаКонтроляПродаж = ПолучитьСтрокуЭлементаКонтроляПродаж(КэшКонтроляПродаж, ЭлементКонтроля);
		Если Не СтрокаЭлементаКонтроляПродаж = Неопределено Тогда
			СтрокиЭлементовКонтроля.Добавить(СтрокаЭлементаКонтроляПродаж);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтрокуЭлементаКонтроляПродаж(КэшКонтроляПродаж, ЭлементКонтроля)
	
	ЭлементыКонтроляПродаж = КэшКонтроляПродаж.ЭлементыКонтроляПродаж;
	КоличествоЭлементов = ЭлементыКонтроляПродаж.Количество();
	РезультатФункции = Неопределено;
	ИндексЭлемента = 0;
	Пока ИндексЭлемента < КоличествоЭлементов И РезультатФункции = Неопределено Цикл
		СтрокаЭлемента = ЭлементыКонтроляПродаж.Получить(ИндексЭлемента);
		Если СтрокаЭлемента.КонтрольПродаж = ЭлементКонтроля Тогда
			РезультатФункции = СтрокаЭлемента;
		КонецЕсли;
		ИндексЭлемента = ИндексЭлемента + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Функция ОтобратьВидыКонтроляПоТипам(ДанныеКонтроляПродаж, ИспользуемыеТипыКонтроля)
	
	РезультатФункции = Новый Структура;
	МассивВидовКонтроля = Новый Массив;
	СоответствиеСтрокВидовКонтроля = Новый Соответствие;
	
	Для Каждого СтрокаВидаКонтроля Из ДанныеКонтроляПродаж.СтрокиВидовКонтроля Цикл
		Если Не ИспользуемыеТипыКонтроля.Найти(СтрокаВидаКонтроля.ТипКонтроля) = Неопределено Тогда
			МассивВидовКонтроля.Добавить(СтрокаВидаКонтроля.ВидКонтроля);
			СоответствиеСтрокВидовКонтроля.Вставить(СтрокаВидаКонтроля.ВидКонтроля, СтрокаВидаКонтроля);
		КонецЕсли;
	КонецЦикла;
	
	РезультатФункции.Вставить("МассивВидовКонтроля", МассивВидовКонтроля);
	РезультатФункции.Вставить("СоответствиеСтрокВидовКонтроля", СоответствиеСтрокВидовКонтроля);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьТипыКонтроляЭтапа(ЭтапКонтроля)
	
	// Порядок добавления типов контролей не менять. Проверки выполняются в соответствии с указанным тут порядком.
	РезультатФункции = Новый Массив;
	ЭтапыКонтроляПродаж = ЭтапыКонтроляПродаж();
	Если ЭтапКонтроля = ЭтапыКонтроляПродаж.ДобавлениеТовара Или ЭтапКонтроля = ЭтапыКонтроляПродаж.ОткрытиеЧека Тогда
		РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.КонтрольОстатков"));
		РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЗапретВидаОплаты"));
		РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЗапретРучнойСкидки"));
	КонецЕсли;
	Если ЭтапКонтроля = ЭтапыКонтроляПродаж.ДобавлениеТовара Тогда
		РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.КонтрольСотрудникомНаКСО"));
	КонецЕсли;
	Если Не (ЭтапКонтроля = ЭтапыКонтроляПродаж.ОткрытиеЧека
			Или ЭтапКонтроля = ЭтапыКонтроляПродаж.ИзменениеСтрокиТовара) Тогда
			
		РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЗапретПодбора"));
		РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ПроверкаПокупателя"));
		
	КонецЕсли;
	Если Не ЭтапКонтроля = ЭтапыКонтроляПродаж.ОткрытиеЧека Тогда
		РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваВСтроке"));
		РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваСтрокВЧеке"));
		Если Не ЭтапКонтроля = ЭтапыКонтроляПродаж.ПереходКОплате Тогда
			РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитСуммыВЧеке"));
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьПостоянныеЭлементыКонтроляПродаж(КэшКонтроляПродаж)
	
	ПостоянныеЭлементыКонтроляПродаж = Новый Массив;
	Для Каждого СтрокаНоменклатуры Из КэшКонтроляПродаж.НоменклатураПлиткиКонтроляПродаж Цикл
		Для Каждого КонтрольПродаж Из СтрокаНоменклатуры.МассивКонтролейПродаж Цикл
			Если ПостоянныеЭлементыКонтроляПродаж.Найти(КонтрольПродаж) = Неопределено Тогда
				ПостоянныеЭлементыКонтроляПродаж.Добавить(КонтрольПродаж);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого КонтрольПродаж Из КэшКонтроляПродаж.ОбщийКонтрольПродаж Цикл
		Если ПостоянныеЭлементыКонтроляПродаж.Найти(КонтрольПродаж) = Неопределено Тогда
			ПостоянныеЭлементыКонтроляПродаж.Добавить(КонтрольПродаж);
		КонецЕсли;
	КонецЦикла;
	Возврат ПостоянныеЭлементыКонтроляПродаж;
	
КонецФункции

Функция ПолучитьПостоянныеВидыКонтроля(КэшКонтроляПродаж, ПостоянныеЭлементыКонтроляПродаж)
	
	ПостоянныеВидыКонтроля = Новый Массив;
	Для Каждого КонтрольПродаж Из ПостоянныеЭлементыКонтроляПродаж Цикл
		СтрокаЭлементаКонтроля = ПолучитьСтрокуЭлементаКонтроляИзКэша(КэшКонтроляПродаж, КонтрольПродаж);
		Если Не СтрокаЭлементаКонтроля = Неопределено Тогда
			Для Каждого СтрокаКонтроля Из СтрокаЭлементаКонтроля.СтрокиКонтроля Цикл
				Если ПостоянныеВидыКонтроля.Найти(СтрокаКонтроля.ВидКонтроля) = Неопределено Тогда
					ПостоянныеВидыКонтроля.Добавить(СтрокаКонтроля.ВидКонтроля);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат ПостоянныеВидыКонтроля;
	
КонецФункции

Функция ПолучитьСтрокуЭлементаКонтроляИзКэша(КэшКонтроляПродаж, КонтрольПродаж)

	РезультатФункции = Неопределено;
	
	КоличествоСтрок = КэшКонтроляПродаж.ЭлементыКонтроляПродаж.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаЭлемента = КэшКонтроляПродаж.ЭлементыКонтроляПродаж.Получить(ИндексСтроки);
		Если СтрокаЭлемента.КонтрольПродаж = КонтрольПродаж Тогда
			РезультатФункции = СтрокаЭлемента;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура РасширитьИнтервалМеждуВидамиОплатПриНеобходимости(Форма)
	
	Если Форма.РежимКассыСамообслуживания Тогда
		КоличествоВидовОплат = ?(Форма.ИспользуемыеВидыОплат = Неопределено, 0, Форма.ИспользуемыеВидыОплат.Количество());
		Элементы = Форма.Элементы;
		ПределДляРасширения = 4;
		КоличествоВключенныхГрупп = КоличествоВидовОплат + ?(Форма.ИспользоватьОплатуБонусами, 1, 0);
		Если КоличествоВключенныхГрупп <= ПределДляРасширения Тогда
			Элементы.ГруппаВидовОплат.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Двойной;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ИмяГруппыВидаОплатБонусами()
	
	Возврат "ГруппаВидОплатыБонусы";
	
КонецФункции

Функция ЭтоГруппаВидаОплаты(ГруппаВидаОплаты)
	
	НачалоИмениГруппы = ОбщаяЧастьИмениГруппВидовОплат();
	Возврат (ТипЗнч(ГруппаВидаОплаты) = Тип("ГруппаФормы") И СтрНайти(ГруппаВидаОплаты.Имя, НачалоИмениГруппы) = 1
		И Не ГруппаВидаОплаты.Имя = ИмяГруппыВидаОплатБонусами());
	
КонецФункции

Функция ПолучитьЭлементМассиваПоИндексу(ИсходныйМассив, ИндексЭлемента)
	
	СтрокаЭлемента = Неопределено;
	
	Если ИсходныйМассив.Количество() > Макс(0, ИндексЭлемента) Тогда
		СтрокаЭлемента = ИсходныйМассив[ИндексЭлемента];
	КонецЕсли;
	
	Возврат СтрокаЭлемента;
	
КонецФункции

Функция ШаблонЭлементаПлитки()
	
	ШаблонЭлемента = Новый Структура;
	ШаблонЭлемента.Вставить("ПорядковыйНомер", -1);
	ШаблонЭлемента.Вставить("ИндексИзОпорныхДанных", -1);
	ШаблонЭлемента.Вставить("НомерКатегории", -1);
	ШаблонЭлемента.Вставить("ИндексПозицииВКатегории", -1);
	ШаблонЭлемента.Вставить("НомерКатегорииРазмещенияЭлемента", -1);
	ШаблонЭлемента.Вставить("ПервыйИндексПлитки", 0);
	ШаблонЭлемента.Вставить("ВторойИндексПлитки", 0);
	ШаблонЭлемента.Вставить("Наименование", "");
	ШаблонЭлемента.Вставить("ИмяДействия", "");
	
	Возврат ШаблонЭлемента;
	
КонецФункции

Процедура ЗаполнитьДанныеКарточкиХарактеристики(ПозицияКнопки, ИзбраннаяПозиция, ПараметрыЗаполнения)
	
	Если ПараметрыЗаполнения.ОтображатьНаименованиеДляПечати
			И ЗначениеЗаполнено(ИзбраннаяПозиция.НаименованиеДляПечати) Тогда
		ПозицияКнопки.ИмяЭлемента = ИзбраннаяПозиция.НаименованиеДляПечати;
	Иначе
		ПозицияКнопки.ИмяЭлемента = ИзбраннаяПозиция.ИмяЭлемента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИзбраннаяПозиция.Цена) И Не ПараметрыЗаполнения.СкрыватьЦену Тогда
		
		ЦенаТекстом = Формат(ИзбраннаяПозиция.Цена, "ЧДЦ=2");
		ПозицияКнопки.ЦенаТекст = ЦенаТекстом;
		
	КонецЕсли;
	Если ЗначениеЗаполнено(ИзбраннаяПозиция.Доступно) И ПараметрыЗаполнения.ОтображатьОстаток Тогда
		
		ДоступноВФормате = "";
		Если ИзбраннаяПозиция.Доступно > 999 Тогда
			ДоступноВФормате = "999+";
		Иначе
			ДоступноВФормате = Формат(ИзбраннаяПозиция.Доступно, "ЧДЦ=3");
		КонецЕсли;
		ПозицияКнопки.КоличествоТекст = ДоступноВФормате;
		
	КонецЕсли;
	
	ПозицияКнопки.Характеристика = ИзбраннаяПозиция.ЗначениеВыбора;
	ПозицияКнопки.ПервыйИндексПлитки = 0;
	ПозицияКнопки.ВторойИндексПлитки = 0;
	
КонецПроцедуры

Процедура ЗаполнитьКнопкиПлитокПродолжение(Форма, ПараметрыЗаполнения)
	
	Элементы = Форма.Элементы;
	ДанныеКнопокПлиток = Форма.ДанныеКнопокПлиток;
	ДанныеДляПлитки = Форма.ДанныеДляПлитки;
	ДанныеПлитокДляЗаполнения = ПараметрыЗаполнения.ДанныеПлитокДляЗаполнения;
	ДанныеПлиток = Форма.ОпорныеДанные;
	ОтображатьОстаток = ПараметрыЗаполнения.ОтображатьОстаток;
	СкрыватьЦену = ПараметрыЗаполнения.СкрыватьЦену;
	ПредставлениеВалюты = ПараметрыЗаполнения.ПредставлениеВалюты;
	КоличествоПлитокНаСтранице = Форма.КоличествоЭлементовВРяду * Форма.КоличествоРядовНаСтранице;
	
	Для Индекс = 0 По ПараметрыЗаполнения.КоличествоЭлементовНаСтранице Цикл
		СтрокаПоИндексу = ПолучитьЭлементМассиваПоИндексу(ДанныеДляПлитки, ПараметрыЗаполнения.ИндексПлитки + Индекс);
		Если СтрокаПоИндексу = Неопределено Или Не СтрокаПоИндексу.НомерКатегорииРазмещенияЭлемента
				= ПараметрыЗаполнения.ТекущаяКатегорияРазмещения Тогда
			Прервать;
		КонецЕсли;
		
		Если Индекс = 0 И СтрокаПоИндексу.ИндексПозицииВКатегории > 2 Тогда
			ПараметрыЗаполнения.ЕстьПредыдущаяСтраница = Истина;
		КонецЕсли;
		
		Если Индекс = ПараметрыЗаполнения.КоличествоЭлементовНаСтранице Тогда
			ПараметрыЗаполнения.ЕстьСледующаяСтраница = Истина;
		Иначе
			ДанныеПлитокДляЗаполнения.Добавить(СтрокаПоИндексу);
			Если Индекс = 0 Тогда
				Форма.ТекущийВторойИндексПлитки = ПараметрыЗаполнения.ИндексПлитки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьПолныйПутьПлитки(Форма, ДанныеПлитокДляЗаполнения);
	
	Элементы.КнопкаПлиткаВперед.Доступность = ПараметрыЗаполнения.ЕстьСледующаяСтраница;
	Элементы.КнопкаПлиткаНазад.Доступность = ПараметрыЗаполнения.ЕстьПредыдущаяСтраница;
	Элементы.ПерейтиНаНачальнуюСтраницу.Доступность
		= (Форма.ТекущийПервыйИндексПлитки > 0 Или Форма.ТекущийВторойИндексПлитки > 1);
		
	Если ПараметрыЗаполнения.НесколькоСтраниц Тогда
		НомерКонтейнераСтрокой = Формат(КоличествоПлитокНаСтранице - 1, "ЧГ=");
		ИмяКонтейнера = СтрШаблон("КонтейнерПлитки_%1", НомерКонтейнераСтрокой);
		Элементы[ИмяКонтейнера].ТекущаяСтраница = Элементы.СтраницаПлиткаНавигация;
	КонецЕсли;
	
	КоличествоНаСтранице = ДанныеПлитокДляЗаполнения.Количество();
	ИменаЭлементов = ПолучитьИменаЭлементовПлитки(); 
	
	Для ИндексПП = 0 По КоличествоПлитокНаСтранице - 1 Цикл 
		
		ПозицияКнопки = ДанныеКнопокПлиток[ИндексПП];
		ПозицияКнопки.АдресИзображения = "";
		ПозицияКнопки.АдресИзображенияГруппы = "";
		ПозицияКнопки.ПервыйИндексПлитки = -1;
		ПозицияКнопки.ВторойИндексПлитки = -1;
		ПозицияКнопки.ЭтоКатегория = Ложь;
		ПозицияКнопки.Номенклатура = Неопределено;
		ПозицияКнопки.Характеристика = Неопределено;
		ПозицияКнопки.ЭтоТекущаяКатегория = Ложь;
		ПозицияКнопки.ИмеетсяВложенность = Ложь;
		ПозицияКнопки.КоличествоТекст = "";
		ПозицияКнопки.ЦенаТекст = "";
		ПозицияКнопки.ИмяЭлемента = "";
		
		ЭтоПустаяОбласть = Ложь;
		Если ИндексПП < КоличествоНаСтранице Тогда
			СтрокаДанныхЭлементаПлитки = ДанныеПлитокДляЗаполнения[ИндексПП];
			ИзбраннаяПозиция = ДанныеПлиток[СтрокаДанныхЭлементаПлитки.ИндексИзОпорныхДанных];
			ЭтоПустаяОбласть = (Не (ИзбраннаяПозиция.ЭтоКатегория Или ЗначениеЗаполнено(ИзбраннаяПозиция.Номенклатура)));
		КонецЕсли;
		
		Если ЭтоПустаяОбласть Или ИндексПП + 1 > КоличествоНаСтранице Тогда
			Если Не (ИндексПП = (КоличествоПлитокНаСтранице - 1) И ПараметрыЗаполнения.НесколькоСтраниц) Тогда
				Элементы[ИменаЭлементов.ВидСтраницы + ИндексПП].ТекущаяСтраница = Элементы[ИменаЭлементов.ВидПустой + ИндексПП];
			КонецЕсли;
			Продолжить;
		ИначеЕсли ИзбраннаяПозиция.ЭтоКатегория И Не ИзбраннаяПозиция.ЭтоТекущаяКатегория Тогда
			Элементы[ИменаЭлементов.ВидСтраницы + ИндексПП].ТекущаяСтраница = Элементы[ИменаЭлементов.ВидПапка + ИндексПП];
		Иначе
			Элементы[ИменаЭлементов.ВидСтраницы + ИндексПП].ТекущаяСтраница = Элементы[ИменаЭлементов.ВидЭлемент + ИндексПП];
		КонецЕсли;
		
		Если ИзбраннаяПозиция.ЭтоТекущаяКатегория Тогда
			ПозицияКнопки.АдресИзображения = Форма.АдресКартинкиСтрелкаНазад;
		Иначе
			ПозицияКнопки.АдресИзображения = ИзбраннаяПозиция.АдресИзображения;
		КонецЕсли;
		
		УстановитьЦветаПлитки(Элементы, ИменаЭлементов, ИндексПП, ИзбраннаяПозиция, ОтображатьОстаток);
		
		Если ЗначениеЗаполнено(ИзбраннаяПозиция.Цена) И Не ИзбраннаяПозиция.ЭтоКатегория И Не СкрыватьЦену Тогда
			ЦенаВФормате = Формат(ИзбраннаяПозиция.Цена, "ЧДЦ=2");
			ЦенаТекст = СтрШаблон(НСтр("ru = '%1 %2'"), ЦенаВФормате, ПредставлениеВалюты);
			Если ЗначениеЗаполнено(ИзбраннаяПозиция.Упаковка) Тогда
				ПредставлениеУпаковки = ?(ЗначениеЗаполнено(ИзбраннаяПозиция.ПредставлениеУпаковки),
					ИзбраннаяПозиция.ПредставлениеУпаковки, Строка(ИзбраннаяПозиция.Упаковка));
				ЦенаТекст = СтрШаблон(НСтр("ru = '%1/%2'"), ЦенаТекст, ПредставлениеУпаковки);
			КонецЕсли;
			ПозицияКнопки.ЦенаТекст = ЦенаТекст;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИзбраннаяПозиция.Доступно) И Не ИзбраннаяПозиция.ЭтоКатегория
			И ОтображатьОстаток И Не ИзбраннаяПозиция.СкрыватьОстаток Тогда
			Если ИзбраннаяПозиция.Доступно > 999 Тогда
				ДоступноВФормате = "999+";
			Иначе
				ДоступноВФормате = Формат(ИзбраннаяПозиция.Доступно, "ЧДЦ=2");
			КонецЕсли;
			ДоступноТекст = СтрШаблон(НСтр("ru = '%1 %2'"), ДоступноВФормате, ИзбраннаяПозиция.ПредставлениеЕдиницыИзмерения);
			ПозицияКнопки.КоличествоТекст = ДоступноТекст;
		ИначеЕсли ОбщегоНазначенияРМККлиентСервер.ПоддерживаетсяПодключениеКОборудованиюРозлива(ИзбраннаяПозиция.КлючВидовПродукцииИС)
				И ИзбраннаяПозиция.Доступно = 0
				И Не ИзбраннаяПозиция.ЭтоКатегория
				И ОтображатьОстаток И Не ИзбраннаяПозиция.СкрыватьОстаток Тогда
			ПозицияКнопки.КоличествоТекст = НСтр("ru = 'Подключить'")
		КонецЕсли;
		
		Если Форма.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК" 
				И Форма.ТипПостроенияПлитки = Форма.ТипыПостроенияПлитки.РаспознанныйВесовойТовар
				И Не Форма.ВозвратныеПапкиПриРаспознавании.Найти(ИзбраннаяПозиция) = Неопределено Тогда
			ПозицияКнопки.ИмяЭлемента = ИнтерфейсРМКСлужебныйКлиентСервер.ИмяГруппыДругихВесовыхТоваров();
		Иначе
			ПозицияКнопки.ИмяЭлемента = ИзбраннаяПозиция.ИмяЭлемента;
		КонецЕсли;
		ПозицияКнопки.Номенклатура = ИзбраннаяПозиция.Номенклатура;
		ПозицияКнопки.Характеристика = ИзбраннаяПозиция.Характеристика;
		ПозицияКнопки.ЭтоКатегория = ИзбраннаяПозиция.ЭтоКатегория;
		ПозицияКнопки.ЭтоТекущаяКатегория = ИзбраннаяПозиция.ЭтоТекущаяКатегория;
		ПозицияКнопки.ИмеетсяВложенность = ИзбраннаяПозиция.ИмеетсяВложенность;
		
		Если ИзбраннаяПозиция.ЭтоКатегория ИЛИ ИзбраннаяПозиция.ИмеетсяВложенность
				ИЛИ ИзбраннаяПозиция.ЭтоТекущаяКатегория Тогда
			ПозицияКнопки.ПервыйИндексПлитки = СтрокаДанныхЭлементаПлитки.ПервыйИндексПлитки;
		Иначе
			ПозицияКнопки.ПервыйИндексПлитки = СтрокаДанныхЭлементаПлитки.ПорядковыйНомер;
		КонецЕсли;
		ПозицияКнопки.ВторойИндексПлитки = СтрокаДанныхЭлементаПлитки.ВторойИндексПлитки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКнопкиИзбранныхПозицийПродолжение(Форма, ПараметрыЗаполнения)
	
	МаксимальноеКоличествоНаСтранице = ИнтерфейсРМКСлужебныйКлиентСервер.КоличествоКарточекИзбранногоНаСтранице();
	КоличествоКарточек = МаксимальноеКоличествоНаСтранице;
	ИсточникиПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ДанныеДляЗаполнения = ПараметрыЗаполнения.ДанныеДляЗаполнения;
	ДанныеКнопок = Форма.ДанныеКнопок;
	ИндексПлитки = ПараметрыЗаполнения.ИндексПлитки;
	ОпорныеДанные = Форма.ОпорныеДанные;
	Элементы = Форма.Элементы;
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	
	Для Индекс = 0 По ПараметрыЗаполнения.КоличествоЭлементовНаСтранице Цикл
		
		СтрокаПоИндексу = ПолучитьЭлементМассиваПоИндексу(ОпорныеДанные, ИндексПлитки + Индекс);
		Если СтрокаПоИндексу = Неопределено
				Или Не (СтрокаПоИндексу.НомерКатегорииРазмещенияЭлемента = ПараметрыЗаполнения.ТекущаяКатегорияРазмещения
				И СтрокаПоИндексу.ИсточникПлитки = ИсточникиПлитки.Избранное) Тогда
			Прервать;
		КонецЕсли;
		
		Если Индекс = 0 И СтрокаПоИндексу.ИндексПозицииВКатегории > 2 Тогда
			ПараметрыЗаполнения.ЕстьПредыдущаяСтраница = Истина;
		КонецЕсли;
		
		Если Индекс = ПараметрыЗаполнения.КоличествоЭлементовНаСтранице Тогда
			ПараметрыЗаполнения.ЕстьСледующаяСтраница = Истина;
		Иначе
			ДанныеДляЗаполнения.Добавить(СтрокаПоИндексу);
			Если Индекс = 0 Тогда
				Форма.ТекущийВторойИндексИзбранного = ИндексПлитки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.НавигацияИзбранногоВключена = Ложь;
	Если Форма.ЕстьГруппыИзбранногоБолее4 Тогда
		Если ПараметрыЗаполнения.НесколькоСтраниц Тогда
			Элементы.КонтейнерИзбранное_8.ТекущаяСтраница = Элементы.СтраницаИзбранноеНавигация;
			Форма.НавигацияИзбранногоВключена = Истина;
		КонецЕсли;
		Элементы.КнопкаИзбранноеНазад.Доступность = ПараметрыЗаполнения.ЕстьПредыдущаяСтраница;
		Элементы.КнопкаИзбранноеВперед.Доступность = ПараметрыЗаполнения.ЕстьСледующаяСтраница;
	Иначе
		КоличествоКарточек = 4;
	КонецЕсли;
	
	ИзбраннаяПозиция = Неопределено;
	ИменаЭлементов = ПолучитьИменаЭлементовИзбранного();
	КоличествоИзбранных = ДанныеДляЗаполнения.Количество();
	Для ИндексПП = 0 По КоличествоКарточек - 1 Цикл
		
		НомерКарточки = ИндексПП + 1;
		ПозицияКнопки = ДанныеКнопок[ИндексПП];
		ПозицияКнопки.АдресИзображения = "";
		ПозицияКнопки.ПервыйИндексПлитки = -1;
		ПозицияКнопки.ВторойИндексПлитки = -1;
		ПозицияКнопки.ЭтоКатегория = Ложь;
		ПозицияКнопки.Номенклатура = Неопределено;
		ПозицияКнопки.Характеристика = Неопределено;
		ПозицияКнопки.ЭтоТекущаяКатегория = Ложь;
		ПозицияКнопки.ИмеетсяВложенность = Ложь;
		ПозицияКнопки.КоличествоТекст = "";
		ПозицияКнопки.ЦенаТекст = "";
		ПозицияКнопки.ИмяЭлемента = "";
		
		ЭтоПустаяОбласть = Истина;
		ВидимостьКартинки = Ложь;
		Если ИндексПП < КоличествоИзбранных Тогда
			ИзбраннаяПозиция = ДанныеДляЗаполнения[ИндексПП];
			ЭтоПустаяОбласть = (Не (ИзбраннаяПозиция.ЭтоКатегория Или ЗначениеЗаполнено(ИзбраннаяПозиция.Номенклатура)));
			ВидимостьКартинки = ЗначениеЗаполнено(ИзбраннаяПозиция.АдресИзображения);
		КонецЕсли;
		
		Если ЭтоПустаяОбласть Тогда
			Если Не (ИндексПП = (МаксимальноеКоличествоНаСтранице - 1) И ПараметрыЗаполнения.НесколькоСтраниц) Тогда
				Элементы[ИменаЭлементов.Контейнер + НомерКарточки].ТекущаяСтраница
					= Элементы[ИменаЭлементов.ВидПустой + НомерКарточки];
			КонецЕсли;
			Продолжить;
		ИначеЕсли ИзбраннаяПозиция.ЭтоКатегория Тогда
			ИмяГруппы = ?(ВидимостьКартинки, ИменаЭлементов.СтраницаГруппыСКартинкой, ИменаЭлементов.СтраницаГруппы);
			ИмяСтатусаГруппы = ?(ВидимостьКартинки, ИменаЭлементов.СтатусГруппыСКартинкой, ИменаЭлементов.СтатусГруппы);
			Элементы[ИменаЭлементов.СтраницыИзбранного + НомерКарточки].ТекущаяСтраница = Элементы[ИмяГруппы + НомерКарточки];
			КартинкаПапки = ПолучитьКартинкуСтатусаГруппыИзбранного(ЭтоИнтерфейс85, ИзбраннаяПозиция);
			Элементы[ИмяСтатусаГруппы + НомерКарточки].Картинка = КартинкаПапки;
		Иначе
			ИмяЭлемента = ?(ВидимостьКартинки, ИменаЭлементов.СтраницаЭлементаСКартинкой, ИменаЭлементов.СтраницаЭлемента);
			Элементы[ИменаЭлементов.СтраницыИзбранного + НомерКарточки].ТекущаяСтраница = Элементы[ИмяЭлемента + НомерКарточки];
		КонецЕсли;
		Элементы[ИменаЭлементов.Контейнер + НомерКарточки].ТекущаяСтраница
			= Элементы[ИменаЭлементов.СтраницаИзбранное + НомерКарточки];
		
		ПозицияКнопки.АдресИзображения = ИзбраннаяПозиция.АдресИзображения;
		УстановитьЦветаИзбранного(Элементы, НомерКарточки, ИзбраннаяПозиция, ПараметрыЗаполнения.ОтображатьОстаток,
			ПараметрыЗаполнения.СкрыватьЦену);
			
		Если ЗначениеЗаполнено(ИзбраннаяПозиция.Цена) И Не ИзбраннаяПозиция.ЭтоКатегория
				И Не ПараметрыЗаполнения.СкрыватьЦену Тогда
			
			ЦенаТекстом = Формат(ИзбраннаяПозиция.Цена, "ЧДЦ=2");
			ПозицияКнопки.ЦенаТекст = ЦенаТекстом;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИзбраннаяПозиция.Доступно) И Не ИзбраннаяПозиция.ЭтоКатегория
				И ПараметрыЗаполнения.ОтображатьОстаток И Не ИзбраннаяПозиция.СкрыватьОстаток Тогда
				
			ОстатокТекстом = "";
			ДоступноВФормате = "";
			Если ИзбраннаяПозиция.Доступно > 999 Тогда
				ДоступноВФормате = "999+";
			Иначе
				ДоступноВФормате = Формат(ИзбраннаяПозиция.Доступно, "ЧДЦ=3");
			КонецЕсли;
			ОстатокТекстом = СтрШаблон(НСтр("ru = '%1 %2'"), ДоступноВФормате, ИзбраннаяПозиция.ПредставлениеЕдиницыИзмерения);
			ПозицияКнопки.КоличествоТекст = ОстатокТекстом;
			
		КонецЕсли;
		
		ПозицияКнопки.ИмяЭлемента = ИзбраннаяПозиция.ИмяЭлемента;
		ПозицияКнопки.Номенклатура = ИзбраннаяПозиция.Номенклатура;
		ПозицияКнопки.Характеристика = ИзбраннаяПозиция.Характеристика;
		ПозицияКнопки.ЭтоКатегория = ИзбраннаяПозиция.ЭтоКатегория;
		ПозицияКнопки.ЭтоТекущаяКатегория = ИзбраннаяПозиция.ЭтоТекущаяКатегория;
		ПозицияКнопки.ИмеетсяВложенность = ИзбраннаяПозиция.ИмеетсяВложенность;
		
		ПозицияКнопки.ПервыйИндексПлитки = ИзбраннаяПозиция.ПервыйИндексПлитки;
		ПозицияКнопки.ВторойИндексПлитки = ИзбраннаяПозиция.ВторойИндексПлитки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОжидаетсяЗаполнениеВесовогоТовара(Форма)
	
	Возврат (ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ЕстьВесовойТовар")
		И Не Форма.ЕстьВесовойТовар);
	
КонецФункции

Процедура ПодготовитьДанныеДляПлиткиПоПалитре(Форма)
	
	ОпорныеДанные = Форма.ОпорныеДанные;
	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ИсточникПалитра = ИсточникиДанныхПлитки.Палитра;
	ИсточникВесовойТовар = ИсточникиДанныхПлитки.ВесовойТовар;
	ПорядковыйНомер = 0;
	Для Каждого СтрокаОпорныхДанных Из ОпорныеДанные Цикл
		
		УчетВесовогоТовара = (СтрокаОпорныхДанных.ИсточникПлитки = ИсточникПалитра
			Или СтрокаОпорныхДанных.ИсточникПлитки = ИсточникВесовойТовар);
		Если УчетВесовогоТовара И СтрокаОпорныхДанных.Весовой И ОжидаетсяЗаполнениеВесовогоТовара(Форма) Тогда
			Форма.ЕстьВесовойТовар = Истина;
		КонецЕсли;
		
		Если СтрокаОпорныхДанных.ИсточникПлитки = ИсточникПалитра Тогда
			
			НовыйЭлемент = ШаблонЭлементаПлитки();
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтрокаОпорныхДанных, , "ИмяДействия");
			НовыйЭлемент.ИндексИзОпорныхДанных = ОпорныеДанные.Индекс(СтрокаОпорныхДанных);
			НовыйЭлемент.ПорядковыйНомер = ПорядковыйНомер;
			Форма.ДанныеДляПлитки.Добавить(НовыйЭлемент);
			
			ПорядковыйНомер = ПорядковыйНомер + 1;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВторойИндексЭлементаВесовыхТоваровПлитки(Форма, СтрокаРодителя, КоличествоСлужебныхЭлементов,
		СмещениеКатегории, РасчетныеПараметры)
	
	РезультатФункции = 0;
	
	ДанныеДляПлитки = Форма.ДанныеДляПлитки;
	ИндексПеренесеннойГруппы = СтрокаРодителя.НомерКатегорииРазмещенияЭлемента - 1 - СмещениеКатегории;
	// В РасчетныеПараметры.ПеренесенныеГруппы хранятся старые номера перенесенных групп,
	// Новый номер категории в "ДанныеДляПлитки" - это индекс перенесенной группы в "ПеренесенныеГруппы" + 1 + Смещение
	// У элементов верхнего уровня из опорных данных нет группы, соответственно, если ИндексПеренесеннойГруппы = -1,
	// то это старый НомерКатегории = 0
	СтарыйНомер = ?(ИндексПеренесеннойГруппы < 0, 0, РасчетныеПараметры.ПеренесенныеГруппы[ИндексПеренесеннойГруппы]);
	КоличествоВКатегории = РасчетныеПараметры.КоличествоВКатегориях.Получить(СтарыйНомер);
	КоличествоПлиток = Форма.КоличествоЭлементовВРяду * Форма.КоличествоРядовНаСтранице;
	НомерСтраницы = 0;
	Если КоличествоВКатегории > КоличествоПлиток Тогда
		НомерСтраницы = Цел((СтрокаРодителя.ИндексПозицииВКатегории - 2) / (КоличествоПлиток - 2));
	КонецЕсли;
	НачальныйИндексПозицииНаСтранице = НомерСтраницы * (КоличествоПлиток - 2) + 2;
	ФильтрЭлемента = Новый Структура;
	ФильтрЭлемента.Вставить("НомерКатегорииРазмещенияЭлемента", СтрокаРодителя.НомерКатегорииРазмещенияЭлемента);
	ФильтрЭлемента.Вставить("ИндексПозицииВКатегории", НачальныйИндексПозицииНаСтранице);
	СтрокиОтбора = ОбщегоНазначенияРМККлиентСервер.НайтиСтрокиМассиваСтруктур(ДанныеДляПлитки, ФильтрЭлемента);
	Если СтрокиОтбора.Количество() > 0 Тогда
		СтрокаНачальнойПозиции = СтрокиОтбора[0];
		РезультатФункции = ДанныеДляПлитки.Найти(СтрокаНачальнойПозиции)
			+ КоличествоСлужебныхЭлементов + (2 * СмещениеКатегории);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ПодготовитьДанныеВесовыхТоваровДляПлитки(Форма, ДанныеСлужебныхЭлементов = Неопределено)
	
	ОпорныеДанные = Форма.ОпорныеДанные;
	ДанныеДляПлитки = Форма.ДанныеДляПлитки;

	КоличествоСлужебныхЭлементов = 0;
	ЕстьПеремещениеВСлужебнуюГруппу = Ложь;
	Если Не ДанныеСлужебныхЭлементов = Неопределено Тогда
		КоличествоСлужебныхЭлементов = ДанныеСлужебныхЭлементов.КоличествоСлужебныхЭлементов;
		ЕстьПеремещениеВСлужебнуюГруппу = ДанныеСлужебныхЭлементов.ЕстьПеремещениеВСлужебнуюГруппу;
	КонецЕсли;
	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	
	ПеренесенныеГруппы = Новый Массив;
	КоличествоВКатегориях = Новый Соответствие;
	РасчетныеПараметры = Новый Структура();
	РасчетныеПараметры.Вставить("ПеренесенныеГруппы", ПеренесенныеГруппы);
	РасчетныеПараметры.Вставить("КоличествоСлужебныхЭлементов", КоличествоСлужебныхЭлементов);
	РасчетныеПараметры.Вставить("ЕстьПеремещениеВСлужебнуюГруппу", ЕстьПеремещениеВСлужебнуюГруппу);
	РасчетныеПараметры.Вставить("ИсходноеКоличество", ОпорныеДанные.Количество());
	РасчетныеПараметры.Вставить("КоличествоВКатегориях", КоличествоВКатегориях); // Хранит количество
	// перенесенных элементов - карточек в каждом уровне - категрии. Нумерация категорий в этом поле из ОпорныхДанных
	
	ИндексОбхода = 0;
	Пока ИндексОбхода < РасчетныеПараметры.ИсходноеКоличество Цикл
		ИндексЭлемента = РасчетныеПараметры.ИсходноеКоличество - ИндексОбхода - 1;
		СтрокаОпорныхДанных = ОпорныеДанные.Получить(ИндексЭлемента);
		Если СтрокаОпорныхДанных.Весовой И Не СтрокаОпорныхДанных.ИсточникПлитки = ИсточникиДанныхПлитки.Избранное Тогда
			
			ПеренестиЭлементВДанныеДляПлитки(ДанныеДляПлитки, ОпорныеДанные, СтрокаОпорныхДанных, РасчетныеПараметры);
			ДобавитьГруппуПлиткиПриНеобходимости(ДанныеДляПлитки, СтрокаОпорныхДанных,
				ОпорныеДанные, ИндексЭлемента, РасчетныеПараметры);
			
		КонецЕсли;
		ИндексОбхода = ИндексОбхода + 1;
	КонецЦикла;
	КолонкиСравнения = СтрРазделить("НомерКатегорииРазмещенияЭлемента,ИндексПозицииВКатегории", ",");
	ОтсортироватьМассивСтруктурВДиапазоне(ДанныеДляПлитки, КолонкиСравнения, 0, ДанныеДляПлитки.Количество() - 1);
	
	ПервыеИндексыВКатегориях = Новый Соответствие;
	ХранилищеГрупп = Новый Соответствие;
	ПорядковыйНомер = 0;
	СчетчикПозицииВКатегории = 1;
	СмещениеКатегории = ?(ЕстьПеремещениеВСлужебнуюГруппу, 1, 0);
	ПредыдущийНомерКатегорииРазмещения = СмещениеКатегории;
	Для Каждого ОписаниеДляПлитки Из ДанныеДляПлитки Цикл
		Если ОписаниеДляПлитки.НомерКатегории > 0 Тогда
			НовыйНомерКатегории = РасчетныеПараметры.ПеренесенныеГруппы.Найти(ОписаниеДляПлитки.НомерКатегории);
			Если Не НовыйНомерКатегории = Неопределено Тогда
				ОписаниеДляПлитки.НомерКатегории = НовыйНомерКатегории + 1 + СмещениеКатегории;
			КонецЕсли;
			ХранилищеГрупп.Вставить(ОписаниеДляПлитки.НомерКатегории, ОписаниеДляПлитки);
		КонецЕсли;
		Если ОписаниеДляПлитки.НомерКатегорииРазмещенияЭлемента > 0 Тогда
			НовыйНомер = РасчетныеПараметры.ПеренесенныеГруппы.Найти(ОписаниеДляПлитки.НомерКатегорииРазмещенияЭлемента);
			Если Не НовыйНомер = Неопределено Тогда
				ОписаниеДляПлитки.НомерКатегорииРазмещенияЭлемента = НовыйНомер + 1 + СмещениеКатегории;
			КонецЕсли;
		ИначеЕсли СмещениеКатегории > 0 Тогда
			ОписаниеДляПлитки.НомерКатегорииРазмещенияЭлемента = СмещениеКатегории;
		КонецЕсли;
		ВычислятьВторойИндекс = Ложь;
		Если ПредыдущийНомерКатегорииРазмещения <> ОписаниеДляПлитки.НомерКатегорииРазмещенияЭлемента Тогда
			СчетчикПозицииВКатегории = 1;
			ПервыеИндексыВКатегориях.Вставить(ОписаниеДляПлитки.НомерКатегорииРазмещенияЭлемента, ПорядковыйНомер);
			Если ОписаниеДляПлитки.НомерКатегорииРазмещенияЭлемента > 0 Тогда
				СтрокаРодителя = ХранилищеГрупп.Получить(ОписаниеДляПлитки.НомерКатегорииРазмещенияЭлемента);
				Если Не СтрокаРодителя = Неопределено Тогда
					
					ВычислятьВторойИндекс = (СтрокаРодителя.НомерКатегорииРазмещенияЭлемента > 0);
					
					СтрокаРодителя.ПервыйИндексПлитки = ПорядковыйНомер + КоличествоСлужебныхЭлементов + (2 * СмещениеКатегории);
					ЗначениеПервогоИндекса = ПервыеИндексыВКатегориях.Получить(СтрокаРодителя.НомерКатегорииРазмещенияЭлемента);
					Если ЗначениеПервогоИндекса = Неопределено Тогда
						ЗначениеПервогоИндекса = 0;
					КонецЕсли;
					Если СтрокаРодителя.НомерКатегорииРазмещенияЭлемента = 1 И ЕстьПеремещениеВСлужебнуюГруппу Тогда
						ОписаниеДляПлитки.ПервыйИндексПлитки = ЗначениеПервогоИндекса + КоличествоСлужебныхЭлементов + СмещениеКатегории;
					Иначе
						ОписаниеДляПлитки.ПервыйИндексПлитки
							= ЗначениеПервогоИндекса + КоличествоСлужебныхЭлементов + (2 * СмещениеКатегории);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ПредыдущийНомерКатегорииРазмещения = ОписаниеДляПлитки.НомерКатегорииРазмещенияЭлемента;
		КонецЕсли;
		
		ОписаниеДляПлитки.ИндексПозицииВКатегории = СчетчикПозицииВКатегории;
		Если ОписаниеДляПлитки.НомерКатегорииРазмещенияЭлемента = 1 И ЕстьПеремещениеВСлужебнуюГруппу Тогда
			ОписаниеДляПлитки.ИндексПозицииВКатегории = ОписаниеДляПлитки.ИндексПозицииВКатегории + 1;
		КонецЕсли;
		ОписаниеДляПлитки.ПорядковыйНомер = ПорядковыйНомер + КоличествоСлужебныхЭлементов + (2 * СмещениеКатегории);
		
		Если ВычислятьВторойИндекс Тогда 
			
			Если СтрокаРодителя.НомерКатегорииРазмещенияЭлемента = 1
					И Форма.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК"
					И Форма.ТипПостроенияПлитки = Форма.ТипыПостроенияПлитки.РаспознанныйВесовойТовар Тогда
				Форма.ВозвратныеПапкиПриРаспознавании.Добавить(ОпорныеДанные[ОписаниеДляПлитки.ИндексИзОпорныхДанных]);
			КонецЕсли;
			
			ОписаниеДляПлитки.ВторойИндексПлитки = ПолучитьВторойИндексЭлементаВесовыхТоваровПлитки(Форма, СтрокаРодителя,
				КоличествоСлужебныхЭлементов, СмещениеКатегории, РасчетныеПараметры);
			
		КонецЕсли;
		
		СчетчикПозицииВКатегории = СчетчикПозицииВКатегории + 1;
		ПорядковыйНомер = ПорядковыйНомер + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьДанныеРаспознанныхТоваровДляПлитки(Форма, ТоварыКВыбору)
	
	ОпорныеДанные = Форма.ОпорныеДанные;
	ДанныеДляПлитки = Форма.ДанныеДляПлитки;
	ПорядковыйНомер = 0;
	ДанныеСлужебныхЭлементов = Новый Структура();
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВозвратныеПапкиПриРаспознавании") Тогда
		Форма.ВозвратныеПапкиПриРаспознавании.Очистить();
	КонецЕсли;
	
	СтрокиВерхнегоУровняИзОпорныхДанных = ПодготовитьСтрокиОпорныхДанныхПоРаспознаннымТоварам(ОпорныеДанные,
		ТоварыКВыбору);
	
	ИмяПапки = ИнтерфейсРМКСлужебныйКлиентСервер.ИмяГруппыДругихВесовыхТоваров();
	ИмяОбратнойПапки = ИнтерфейсРМКСлужебныйКлиентСервер.ИмяГруппыРаспознанныхВесовыхТоваров();
	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	СтрокаПапки = Неопределено;
	СтрокаОбратнойПапки = Неопределено;
	ОтборСтрокСлужебныхПапок = Новый Структура("ИсточникПлитки", ИсточникиДанныхПлитки.СлужебныеГруппы);
	СтрокиПапокОпорныхДанных = ОпорныеДанные.НайтиСтроки(ОтборСтрокСлужебныхПапок);
	Для Каждого СтрокаПапкиОпорныхДанных Из СтрокиПапокОпорныхДанных Цикл
		Если СтрокаПапкиОпорныхДанных.ЭтоТекущаяКатегория Тогда
			Если СтрокаПапкиОпорныхДанных.ИмяЭлемента = ИмяОбратнойПапки Тогда
				СтрокаОбратнойПапки = СтрокаПапкиОпорныхДанных;
			КонецЕсли;
		Иначе
			Если СтрокаПапкиОпорныхДанных.ИмяЭлемента = ИмяПапки Тогда
				СтрокаПапки = СтрокаПапкиОпорныхДанных;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеСлужебныхЭлементов.Вставить("КоличествоСлужебныхЭлементов",
		СтрокиВерхнегоУровняИзОпорныхДанных.Количество());
	ДанныеСлужебныхЭлементов.Вставить("ЕстьПеремещениеВСлужебнуюГруппу", Истина);
	ПодготовитьДанныеВесовыхТоваровДляПлитки(Форма, ДанныеСлужебныхЭлементов);
	
	Для Каждого СтрокаТовара Из СтрокиВерхнегоУровняИзОпорныхДанных Цикл
		
		НовыйЭлемент = ШаблонЭлементаПлитки();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтрокаТовара);
		НовыйЭлемент.ИндексИзОпорныхДанных = ОпорныеДанные.Индекс(СтрокаТовара);
		НовыйЭлемент.ПорядковыйНомер = ПорядковыйНомер;
		НовыйЭлемент.НомерКатегории = 0;
		НовыйЭлемент.ИндексПозицииВКатегории = ПорядковыйНомер + 1;
		НовыйЭлемент.НомерКатегорииРазмещенияЭлемента = 0;
		НовыйЭлемент.ПервыйИндексПлитки = 0;
		ДанныеДляПлитки.Вставить(ПорядковыйНомер, НовыйЭлемент);
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
		
	КонецЦикла;
	ДобавитьСлужебныеГруппыВДанныеДляПлитки(Форма, СтрокаПапки, СтрокаОбратнойПапки, ПорядковыйНомер);
	
КонецПроцедуры

Процедура ДобавитьСлужебныеГруппыВДанныеДляПлитки(Форма,
		СтрокаПапки,
		СтрокаОбратнойПапки,
		ПорядковыйНомер)
		
	ОпорныеДанные = Форма.ОпорныеДанные;
	ДанныеДляПлитки = Форма.ДанныеДляПлитки;
	КоличествоПлиток = Форма.КоличествоЭлементовВРяду * Форма.КоличествоРядовНаСтранице;

	// Служебная папка
	НовыйЭлемент = ШаблонЭлементаПлитки();
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтрокаПапки);
	НовыйЭлемент.ИндексИзОпорныхДанных = ОпорныеДанные.Индекс(СтрокаПапки);
	НовыйЭлемент.ПорядковыйНомер = ПорядковыйНомер;
	НовыйЭлемент.НомерКатегории = 1;
	НовыйЭлемент.ИндексПозицииВКатегории = ПорядковыйНомер + 1;
	НовыйЭлемент.НомерКатегорииРазмещенияЭлемента = 0;
	НовыйЭлемент.ПервыйИндексПлитки = ПорядковыйНомер + 1;
	ДанныеДляПлитки.Вставить(ПорядковыйНомер ,НовыйЭлемент);
	
	// Возврат из служебной папки
	НовыйЭлемент = ШаблонЭлементаПлитки();
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтрокаОбратнойПапки);
	НовыйЭлемент.ИндексИзОпорныхДанных = ОпорныеДанные.Индекс(СтрокаОбратнойПапки);
	НовыйЭлемент.ПорядковыйНомер = ПорядковыйНомер + 1;
	НовыйЭлемент.НомерКатегории = 0;
	НовыйЭлемент.ИндексПозицииВКатегории = 1;
	НовыйЭлемент.НомерКатегорииРазмещенияЭлемента = 1;
	НовыйЭлемент.ПервыйИндексПлитки = (КоличествоПлиток - 1) * Цел(ПорядковыйНомер / (КоличествоПлиток - 1));
	ДанныеДляПлитки.Вставить(ПорядковыйНомер + 1, НовыйЭлемент);
	
КонецПроцедуры

Функция ПодготовитьСтрокиОпорныхДанныхПоРаспознаннымТоварам(ОпорныеДанные, ТоварыКВыбору)
	
	РезультатФункции = Новый Массив;
	
	Для Каждого ДанныеТовара Из ТоварыКВыбору Цикл
		
		ОтборСтрокиОпорныхДанных = Новый Структура();
		ОтборСтрокиОпорныхДанных.Вставить("Номенклатура", ДанныеТовара.Номенклатура);
		ОтборСтрокиОпорныхДанных.Вставить("Характеристика", ДанныеТовара.Характеристика);
		ОтборСтрокиОпорныхДанных.Вставить("Весовой", Истина);
		СтрокиОпорныхДанных = ОпорныеДанные.НайтиСтроки(ОтборСтрокиОпорныхДанных);
		Если СтрокиОпорныхДанных.Количество() > 0 Тогда
			РезультатФункции.Добавить(СтрокиОпорныхДанных[0]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьГруппуПлиткиПриНеобходимости(ДанныеДляПлитки, СтрокаОпорныхДанных,
		ОпорныеДанные, ИндексЭлемента, РасчетныеПараметры)

	НомерКатегорииРодителя = СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента;
	Если НомерКатегорииРодителя > 0
			И РасчетныеПараметры.ПеренесенныеГруппы.Найти(НомерКатегорииРодителя) = Неопределено Тогда
			
		ДанныеРодителя = ПолучитьДанныеРодителяЭлемента(ОпорныеДанные, НомерКатегорииРодителя, ИндексЭлемента);
		Если Не ДанныеРодителя.СтрокаРодителя = Неопределено Тогда
			
			СтрокаРодителя = ДанныеРодителя.СтрокаРодителя;
			ПеренестиЭлементВДанныеДляПлитки(ДанныеДляПлитки, ОпорныеДанные, СтрокаРодителя, РасчетныеПараметры);
			ПеренестиЭлементВДанныеДляПлитки(ДанныеДляПлитки, ОпорныеДанные, ДанныеРодителя.СтрокаВозврата, РасчетныеПараметры);
			ВставитьНомерВМассивВПорядкеВозрастания(РасчетныеПараметры.ПеренесенныеГруппы, НомерКатегорииРодителя);
			ДобавитьГруппуПлиткиПриНеобходимости(ДанныеДляПлитки, СтрокаРодителя,
				ОпорныеДанные, ДанныеРодителя.ИндексРодителя, РасчетныеПараметры);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеренестиЭлементВДанныеДляПлитки(ДанныеДляПлитки, ОпорныеДанные, СтрокаОпорныхДанных, РасчетныеПараметры)
	
	НовыйЭлемент = ШаблонЭлементаПлитки();
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтрокаОпорныхДанных, , "ИмяДействия,ПервыйИндексПлитки");
	НовыйЭлемент.ИндексИзОпорныхДанных = ОпорныеДанные.Индекс(СтрокаОпорныхДанных);
	Если НовыйЭлемент.НомерКатегорииРазмещенияЭлемента = 0 И Не РасчетныеПараметры.ЕстьПеремещениеВСлужебнуюГруппу Тогда
		НовыйЭлемент.ИндексПозицииВКатегории
			= СтрокаОпорныхДанных.ИндексПозицииВКатегории + РасчетныеПараметры.КоличествоСлужебныхЭлементов;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаОпорныхДанных.Номенклатура) Тогда
		НовыйЭлемент.НомерКатегории = 0;
	КонецЕсли;
	ДанныеДляПлитки.Вставить(0, НовыйЭлемент);
	ДобавленноеКоличество
		= РасчетныеПараметры.КоличествоВКатегориях.Получить(НовыйЭлемент.НомерКатегорииРазмещенияЭлемента);
	НовоеКоличество = ?(ДобавленноеКоличество = Неопределено, 1, ДобавленноеКоличество + 1);
	РасчетныеПараметры.КоличествоВКатегориях.Вставить(НовыйЭлемент.НомерКатегорииРазмещенияЭлемента, НовоеКоличество);
	
КонецПроцедуры

Функция ПолучитьДанныеРодителяЭлемента(ОпорныеДанные, НомерКатегории, ИндексПодчиненногоЭлемента)
	
	ИндексРодителя = -1;
	СтрокаРодителя = Неопределено;
	СтрокаВозврата = Неопределено;
	
	ИндексОбхода = ИндексПодчиненногоЭлемента - 1;
	Пока ИндексОбхода >= 0 И ИндексРодителя < 0 Цикл
		ПроверяемаяСтрока = ОпорныеДанные.Получить(ИндексОбхода);
		Если ПроверяемаяСтрока.НомерКатегории = НомерКатегории Тогда
			СтрокаРодителя = ПроверяемаяСтрока;
			ИндексРодителя = ИндексОбхода;
		ИначеЕсли ПроверяемаяСтрока.НомерКатегорииРазмещенияЭлемента = НомерКатегории И ПроверяемаяСтрока.НомерКатегории = 0
				И ПроверяемаяСтрока.ЭтоКатегория Тогда
			СтрокаВозврата = ПроверяемаяСтрока;
		КонецЕсли;
		ИндексОбхода = ИндексОбхода - 1;
	КонецЦикла;
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("СтрокаРодителя", СтрокаРодителя);
	РезультатФункции.Вставить("СтрокаВозврата", СтрокаВозврата);
	РезультатФункции.Вставить("ИндексРодителя", ИндексРодителя);
	Возврат РезультатФункции;
	
КонецФункции

Процедура ВставитьНомерВМассивВПорядкеВозрастания(МассивНомеров, ВставляемыйНомер)
	
	ЭлементДобавлен = Ложь;
	ИндексЭлемента = 0;
	Пока ИндексЭлемента < МассивНомеров.Количество() И Не ЭлементДобавлен Цикл
		ТекущийНомер = МассивНомеров[ИндексЭлемента];
		Если ТекущийНомер > ВставляемыйНомер Тогда
			МассивНомеров.Вставить(ИндексЭлемента, ВставляемыйНомер);
			ЭлементДобавлен = Истина;
		КонецЕсли;
		ИндексЭлемента = ИндексЭлемента + 1;
	КонецЦикла;
	Если Не ЭлементДобавлен Тогда
		МассивНомеров.Добавить(ВставляемыйНомер);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтсортироватьМассивСтруктурВДиапазоне(СортируемыйМассив, КолонкиСравнения,
		Знач НачальныйИндекс, Знач КонечныйИндекс)

	СреднийИндекс = Цел((НачальныйИндекс + КонечныйИндекс) / 2);
	ИсходныйНачальныйИндекс = НачальныйИндекс;
	Если СреднийИндекс >= 0 И СортируемыйМассив.Количество() > 0 Тогда
		СреднийЭлемент = СортируемыйМассив[СреднийИндекс];
		Пока НачальныйИндекс <= КонечныйИндекс Цикл 
			
			Если НачальныйИндекс = СреднийИндекс Тогда
				НачальныйИндекс = НачальныйИндекс + 1;
			Иначе
				
				ПроверяемыйЭлемент = СортируемыйМассив[НачальныйИндекс];
				Если ПроверяемоеЗначениеБольше(СреднийЭлемент, ПроверяемыйЭлемент, КолонкиСравнения) Тогда
					Если НачальныйИндекс < СреднийИндекс Тогда
						СортируемыйМассив.Удалить(НачальныйИндекс);
						СортируемыйМассив.Вставить(КонечныйИндекс, ПроверяемыйЭлемент);
						СреднийИндекс = СреднийИндекс - 1;
					Иначе
						НачальныйИндекс = НачальныйИндекс + 1;
					КонецЕсли;
				Иначе
					Если НачальныйИндекс > СреднийИндекс Тогда 
					СортируемыйМассив.Удалить(НачальныйИндекс);
					СортируемыйМассив.Вставить(СреднийИндекс, ПроверяемыйЭлемент);
					СреднийИндекс = СреднийИндекс + 1;
					КонецЕсли;
					НачальныйИндекс = НачальныйИндекс + 1;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		Если СреднийИндекс > ИсходныйНачальныйИндекс + 1 Тогда
			ОтсортироватьМассивСтруктурВДиапазоне(СортируемыйМассив, КолонкиСравнения,
				ИсходныйНачальныйИндекс, СреднийИндекс - 1);
		КонецЕсли;
		Если СреднийИндекс + 1 < КонечныйИндекс Тогда
			ОтсортироватьМассивСтруктурВДиапазоне(СортируемыйМассив, КолонкиСравнения,
				СреднийИндекс + 1, КонечныйИндекс);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПроверяемоеЗначениеБольше(ИсходноеЗначение, ПроверяемоеЗначение, КолонкиСравнения)
	
	РезультатФункции = Ложь;
	ЭлементыРавны = Истина;
	КоличествоКолонок = КолонкиСравнения.Количество();
	ИндексСравнения = 0;
	Пока ЭлементыРавны И ИндексСравнения < КоличествоКолонок Цикл
		КолонкаСравнения = КолонкиСравнения[ИндексСравнения];
		Если ПроверяемоеЗначение[КолонкаСравнения] > ИсходноеЗначение[КолонкаСравнения] Тогда
			ЭлементыРавны = Ложь;
			РезультатФункции = Истина;
		ИначеЕсли ПроверяемоеЗначение[КолонкаСравнения] < ИсходноеЗначение[КолонкаСравнения] Тогда
			ЭлементыРавны = Ложь;
		КонецЕсли;
		ИндексСравнения = ИндексСравнения + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция МассивОграниченийЦифрДаты()
	
	МассивОграничений = Новый Массив;
	ДобавитьОграничениеЦифрДаты(МассивОграничений, 0, 3, "");
	ДобавитьОграничениеЦифрДаты(МассивОграничений, 1, 1, "[0] > 2");
	ДобавитьОграничениеЦифрДаты(МассивОграничений, 2, 1, "");
	ДобавитьОграничениеЦифрДаты(МассивОграничений, 3, 2, "[2] > 0");
	
	Возврат МассивОграничений;
	
КонецФункции

Процедура ДобавитьОграничениеЦифрДаты(МассивОграничений, НомерПозиции, МаксимальноеЗначение, ТекстУсловия)
	
	ОписаниеОграничения = Новый Структура;
	ОписаниеОграничения.Вставить("НомерПозиции", НомерПозиции);
	ОписаниеОграничения.Вставить("МаксимальноеЗначение", МаксимальноеЗначение);
	ОписаниеОграничения.Вставить("ТекстУсловия", ТекстУсловия);
	МассивОграничений.Добавить(ОписаниеОграничения);
	
КонецПроцедуры

Функция СодержимоеОбластиСпискаТоваров(ДанныеБлока)
	Возврат СтрШаблон("<div id = ""goodsList"">%1</div>", ДанныеБлока.ЗаголовокОбласти);
КонецФункции

Функция СодержимоеОбластиГлавнойКоманды(ДанныеБлока)
	Возврат СтрШаблон("<div class = ""ordinaryLabel""><b>%1</b></div>", ДанныеБлока.ЗаголовокОбласти);
КонецФункции

Функция СодержимоеТиповойОбласти(ДанныеБлока)
	Возврат СтрШаблон("<div class = ""ordinaryLabel"">%1</div>", ДанныеБлока.ЗаголовокОбласти);
КонецФункции

Функция СодержимоеОбластиПлитки(РеквизитыПалитры)
	
	СтрокаЯчейки = "
	|	<td class = ""plateTd""></td>%1";
	
	СтрокаРяда = "<tr class = ""plateTr"">%1
	|</tr>";
	Для НомерКолонки = 1 По РеквизитыПалитры.КоличествоЭлементовВРяду Цикл
		СтрокаРяда = СтрШаблон(СтрокаРяда, СтрокаЯчейки);
	КонецЦикла;
	СтрокаРяда = СтрШаблон(СтрокаРяда, "");
	СлужебнаяСтрокаРяда = СтрШаблон("%1%2%3", СтрокаРяда, Символы.ПС, "%1");
	СтрокаПлитки = "<table class = ""plateTable"">%1</table>";
	
	Для НомерРяда = 1 По РеквизитыПалитры.КоличествоРядовНаСтранице Цикл
		СтрокаПлитки = СтрШаблон(СтрокаПлитки, СлужебнаяСтрокаРяда);
	КонецЦикла;
	
	Возврат СтрШаблон(СтрокаПлитки, "");
	
КонецФункции

Функция СодержимоеОбластиДомашнейСтраницы(ЗаставкаСтрокой)
	Возврат СтрШаблон("<div class = ""ordinaryLabel""><img src=""%1""></div>", ЗаставкаСтрокой);
КонецФункции

Процедура ЗапуститьЧасы(Форма, НастройкиЧасов)
	
	Элементы = Форма.Элементы;
	ПоложениеЦентр = НСтр("ru = 'Центр'");
	ВыравниваниеАвто = НСтр("ru = 'Авто'");
	ВидимостьДекорации = Ложь;
	ВидимостьОтступа = Ложь;
	НуженРазделительКоманд = Ложь;
	
	Если Не Элементы.ПолеЧасов.Видимость = НастройкиЧасов.Использование Тогда
		Элементы.ПолеЧасов.Видимость = НастройкиЧасов.Использование;
		Элементы.КартинкаЧасы.Видимость = НастройкиЧасов.Использование;
	КонецЕсли;
	
	Если НастройкиЧасов.Использование Тогда
		
		Если Не Элементы.ПолеЧасов.Высота = НастройкиЧасов.Высота Тогда
			Элементы.ПолеЧасов.Высота = НастройкиЧасов.Высота;
		КонецЕсли;
		Если Не Элементы.ПолеЧасов.Ширина = НастройкиЧасов.Ширина Тогда
			Элементы.ПолеЧасов.Ширина = НастройкиЧасов.Ширина;
		КонецЕсли;
		Если Форма.РежимКассыСамообслуживания
				И ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(Элементы, "ПолеЧасовВПлиткеКСО") Тогда
			
			Если Не Элементы.ПолеЧасовВПлиткеКСО.Высота = НастройкиЧасов.Высота Тогда
				Элементы.ПолеЧасовВПлиткеКСО.Высота = НастройкиЧасов.Высота;
			КонецЕсли;
			Если Не Элементы.ПолеЧасовВПлиткеКСО.Ширина = НастройкиЧасов.Ширина Тогда
				Элементы.ПолеЧасовВПлиткеКСО.Ширина = НастройкиЧасов.Ширина;
			КонецЕсли;
			
		КонецЕсли;
		ВидимостьДекорации = (НастройкиЧасов.ПоложениеЧасов = ПоложениеЦентр
			И НастройкиЧасов.ВыравниваниеПанели = ВыравниваниеАвто);
		ВидимостьОтступа = (НастройкиЧасов.ПоложениеЧасов = ПоложениеЦентр
			И Не НастройкиЧасов.ВыравниваниеПанели = ВыравниваниеАвто);
		НуженРазделительКоманд = Не (НастройкиЧасов.ПоложениеЧасов = ПоложениеЦентр
			Или НастройкиЧасов.ВыравниваниеПанели = ВыравниваниеАвто);
		
		Форма.КодЧасов = ПолучитьКодРеализацииЧасов(НастройкиЧасов);
		
	ИначеЕсли Не НастройкиЧасов.ВыравниваниеПанели = ВыравниваниеАвто Тогда
		НуженРазделительКоманд = Истина;
		Форма.КодЧасов = "";
	КонецЕсли;
	
	Если Не Форма.РежимКассыСамообслуживания Тогда
		ИспользуетсяОтборВесовогоТовара = (Форма.РежимПлитки И Форма.ЕстьВесовойТоварВПлитке);
		Если Не Элементы.ДекорацияРастяжениеПослеЧасов.Видимость = ВидимостьДекорации Тогда
			Элементы.ДекорацияРастяжениеПослеЧасов.Видимость = ВидимостьДекорации;
		КонецЕсли;
		Если Не Элементы.ДекорацияОперацияОтступСправа.Видимость = ВидимостьОтступа Тогда
			Элементы.ДекорацияОперацияОтступСправа.Видимость = ВидимостьОтступа;
		КонецЕсли;
		Если Не Элементы.Декорация1.Видимость = ИспользуетсяОтборВесовогоТовара Тогда
			Элементы.Декорация1.Видимость = ИспользуетсяОтборВесовогоТовара;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВычестьИзДлиныПостфикс(ДлинаТекста, РедактируемыйЭлемент)
	
	СтрокаФорматаРедактирования = РедактируемыйЭлемент.ФорматРедактирования;
	
	Если Не СокрЛП(СтрокаФорматаРедактирования) = "" Тогда
		Постфикс = ПолучитьПостфиксИзСтрокиФормата(СтрокаФорматаРедактирования);
		ДлинаТекста = ДлинаТекста - СтрДлина(Постфикс);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьМаскуСимволовПередПостфиксом()
	
	РезультатФункции = Новый Массив;
	
	РезультатФункции.Добавить(СтрШаблон(НСтр("ru = 'NF%1ЧФ'"), Символы.ПС));
	РезультатФункции.Добавить("=");
	РезультатФункции.Добавить("'");
	РезультатФункции.Добавить(СтрШаблон(НСтр("ru = 'N%1Ч'"), Символы.ПС));
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьСтрокиПроверки(НаборСтрок, ПозицияПроверки)
	
	СтрокиДляПроверки = Новый Массив;
	Если НаборСтрок.Количество() > ПозицияПроверки Тогда
		СтрокиВхождения = НаборСтрок[ПозицияПроверки];
		СтрокиДляПроверки = СтрРазделить(СтрокиВхождения, Символы.ПС, Ложь);
	КонецЕсли;
	Возврат СтрокиДляПроверки;
	
КонецФункции

Функция ПроверитьВхождениеСтрок(СтрокаФорматаРедактирования, НомерСимвола, СтрокиПроверки)
	
	РезультатФункции = Новый Структура("ЕстьВхождение,ДлинаВхождения", Ложь, 0);
	
	КоличествоСтрок = СтрокиПроверки.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И Не РезультатФункции.ЕстьВхождение Цикл
		ПодстрокаПроверки = СтрокиПроверки[ИндексСтроки];
		ДлинаПодстроки = СтрДлина(ПодстрокаПроверки);
		Если Сред(СтрокаФорматаРедактирования, НомерСимвола, ДлинаПодстроки) = ПодстрокаПроверки Тогда
			РезультатФункции.ЕстьВхождение = Истина;
			РезультатФункции.ДлинаВхождения = ДлинаПодстроки;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьПостфиксИзСтрокиФормата(СтрокаФорматаРедактирования)
	
	Постфикс = "";
	ПозицияПроверки = 0;
	ЭтоФормированиеПостфикса = Ложь;
	СимволЗавершения = "'";
	МаскаПередПостфиксом = СформироватьМаскуСимволовПередПостфиксом();
	
	КоличествоСимволов = СтрДлина(СтрокаФорматаРедактирования);
	НомерСимвола = 0;
	Пока НомерСимвола < КоличествоСимволов Цикл
		НомерСимвола = НомерСимвола + 1;
		ТекущийСимвол = Сред(СтрокаФорматаРедактирования, НомерСимвола, 1);
		Если ЭтоФормированиеПостфикса Тогда
			
			Если ТекущийСимвол = СимволЗавершения Тогда
				ЭтоФормированиеПостфикса = Ложь;
				НомерСимвола = КоличествоСимволов;
			ИначеЕсли Не ТекущийСимвол = """" Тогда
				Постфикс = Постфикс + ТекущийСимвол;
			КонецЕсли;
			
		ИначеЕсли Не ТекущийСимвол = " " Тогда
			
			СтрокиПроверки = ПолучитьСтрокиПроверки(МаскаПередПостфиксом, ПозицияПроверки);
			РезультатПроверкиВхождения = ПроверитьВхождениеСтрок(СтрокаФорматаРедактирования, НомерСимвола, СтрокиПроверки);
			Если РезультатПроверкиВхождения.ЕстьВхождение Тогда
				Если РезультатПроверкиВхождения.ДлинаВхождения > 1 Тогда
					НомерСимвола = НомерСимвола + РезультатПроверкиВхождения.ДлинаВхождения - 1;
				КонецЕсли;
				ПозицияПроверки = ПозицияПроверки + 1;
				Если ПозицияПроверки = МаскаПередПостфиксом.Количество() Тогда
					ЭтоФормированиеПостфикса = Истина;
				КонецЕсли;
			ИначеЕсли ПозицияПроверки > 0 Тогда
				ПозицияПроверки = 0;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Постфикс;
	
КонецФункции

Процедура ЗаполнитьПолныйПутьПлитки(Форма, ДанныеПлитокДляЗаполнения)
	
	ПолныйПуть = "";
	
	Если ДанныеПлитокДляЗаполнения.Количество() > 0 Тогда
		ЭлементаПлитки = ДанныеПлитокДляЗаполнения[0];
		ИзбраннаяПозиция = Форма.ДанныеДляПлитки[ЭлементаПлитки.ПорядковыйНомер];
		
		Если ИзбраннаяПозиция.НомерКатегорииРазмещенияЭлемента = 0 Тогда
			Если Форма.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК" Тогда
				
				ПолныйПуть = ПолучитьНаименованиеКорняПлиточногоИнтерфейсаРМК(Форма);
				
			ИначеЕсли Форма.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаОбученияУстройствРаспознавания" Тогда
				ПолныйПуть = НСтр("ru='Распознанный товар'");
			Иначе
				ПолныйПуть = Форма.НаименованиеПалитры;
			КонецЕсли;
		Иначе
			ПолныйПуть = ПолучитьНаименованиеПутиПоЭлементуПлитки(Форма, ИзбраннаяПозиция);
		КонецЕсли;
	КонецЕсли;
	
	Форма.Элементы.ДекорацияПутьПлиточногоИнтерфейса.Заголовок = ПолныйПуть;
	
КонецПроцедуры

Функция ПолучитьНаименованиеПутиПоЭлементуПлитки(Форма, ИзбраннаяПозиция)
	
	РезультатФункции = "";
	
	МассивКатегорий = Новый Массив;
	ОчереднаяПлитка = ИзбраннаяПозиция;
	Счт = 0;
	Пока Счт < 3 И ОчереднаяПлитка.НомерКатегорииРазмещенияЭлемента > 0 Цикл
		ПлиткаРодитель = ПолучитьПлиткуКатегории(Форма, ОчереднаяПлитка.НомерКатегорииРазмещенияЭлемента);
		Если Не ПлиткаРодитель = Неопределено Тогда
			ПлиткаИзОпорныхДанных = Форма.ОпорныеДанные[ПлиткаРодитель.ИндексИзОпорныхДанных];
			МассивКатегорий.Вставить(0, ПлиткаИзОпорныхДанных.ИмяЭлемента);
			ОчереднаяПлитка = ПлиткаРодитель;
		Иначе
			Счт = 4;
		КонецЕсли;
		
		Счт = Счт + 1;
		Если Счт = 3 И ОчереднаяПлитка.НомерКатегорииРазмещенияЭлемента > 0 Тогда
			МассивКатегорий.Вставить(0, НСтр("ru='...'"));
		КонецЕсли;
	КонецЦикла;
	НуженРазделитель = Ложь;
	Для Каждого ЭлементМассива Из МассивКатегорий Цикл
		СимволРазделитель = ?(НуженРазделитель, "\", "");
		РезультатФункции = СтрШаблон("%1%2%3", РезультатФункции, СимволРазделитель, ЭлементМассива);
		НуженРазделитель = Истина; 
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьПлиткуКатегории(Форма, НомерКатегории)
	
	РезультатФункции = Неопределено;
	
	ОтборКатегорий = Новый Структура("НомерКатегории", НомерКатегории);
	СтрокиКатегории = ОбщегоНазначенияРМККлиентСервер.НайтиСтрокиМассиваСтруктур(Форма.ДанныеДляПлитки, ОтборКатегорий);
	Если СтрокиКатегории.Количество() > 0 Тогда
		РезультатФункции = СтрокиКатегории[0];
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьНаименованиеКорняПлиточногоИнтерфейсаРМК(Форма)
	
	РезультатФункции = "";
	Если Форма.ТипПостроенияПлитки = Форма.ТипыПостроенияПлитки.РаспознанныйВесовойТовар Тогда
		РезультатФункции = НСтр("ru='Распознанный товар'");
	ИначеЕсли Форма.ТипПостроенияПлитки = Форма.ТипыПостроенияПлитки.ВесовойТовар Тогда
		РезультатФункции = НСтр("ru='Весовой товар'");
	Иначе
		РезультатФункции = Форма.НаименованиеПалитры;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ЭтоПодтверждениеЧерезMAX(СтрокаВидаКонтроля, ИспользоватьПодтверждениеВозрастаЧерезMAX)
	
	Если НЕ ИспользоватьПодтверждениеВозрастаЧерезMAX Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПодтверждениеЧерезMAX = Ложь;
	ПараметрПодтверждениеЧерезMAX = ПредопределенноеЗначение(
		"Перечисление.ПараметрыКонтроляПродаж.ПодтверждениеЧерезMAX");
	
	Для каждого ПараметрКонтроля Из СтрокаВидаКонтроля.ПараметрыКонтроля Цикл
		Если ПараметрКонтроля.Параметр = ПараметрПодтверждениеЧерезMAX Тогда
			ПодтверждениеЧерезMAX = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПодтверждениеЧерезMAX;
	
КонецФункции

Процедура ОпределитьПозициюДобавленияОграниченияТипаПроверкаПокупателя(СтрокаОграничения,
	ЭтоПроверкаВозраста, ЗначениеВозраста, ПодтверждениеЧерезMAX,
	ПозицияДобавления, КоличествоОграничений, ИндексОграничения)
	
	// Пример сортировки:
	//  0)без параметра возраст(возраст = 0)
	//  1)проверка возраста сотрудником(возраст = 20)
	//  2)проверка возраста через MAX или сотрудника(возраст = 18)
	//  3)проверка возраста сотрудником(возраст = 18)
	//  4)проверка возраста сотрудником(возраст = 17)
	
	Если СтрокаОграничения.ВозрастКонтроля = 0 Тогда
		// Без параметра возраст(возраст = 0)
		ИндексОграничения = ИндексОграничения + 1;
		ПозицияДобавления = ИндексОграничения;
	ИначеЕсли СтрокаОграничения.ВозрастКонтроля > ЗначениеВозраста Тогда
		Если Не ЭтоПроверкаВозраста Тогда
			ИндексОграничения = КоличествоОграничений;
		Иначе
			ИндексОграничения = ИндексОграничения + 1;
			ПозицияДобавления = ИндексОграничения;
		КонецЕсли;
	ИначеЕсли СтрокаОграничения.ВозрастКонтроля < ЗначениеВозраста Тогда
		ИндексОграничения = КоличествоОграничений;
	Иначе
		// Ветка условия для СтрокаОграничения.ВозрастКонтроля = ЗначениеВозраста
		Если ПодтверждениеЧерезMAX И Не СтрокаОграничения.ПодтверждениеЧерезMAX Тогда
			ИндексОграничения = КоличествоОграничений;
		Иначе
			ИндексОграничения = ИндексОграничения + 1;
			ПозицияДобавления = ИндексОграничения;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФормаОшибки
Процедура ОткрытьФормуСообщенияОбОшибке(ВладелецФормы, ПараметрыОткрытияОшибки, ОбработчикОповещения = Неопределено) Экспорт
	
	Если ПараметрыОткрытияОшибки.Свойство("НеБлокироватьОкно") И ПараметрыОткрытияОшибки.НеБлокироватьОкно Тогда
		РежимБлокировкиОкна = РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать;
	Иначе
		РежимБлокировкиОкна = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаСообщенияОбОшибке", ПараметрыОткрытияОшибки, ВладелецФормы,,,,
		ОбработчикОповещения, РежимБлокировкиОкна);
	
КонецПроцедуры
	
Функция ПолучитьПараметрыОшибки(СообщениеОбОшибки, ТекстЗаголовка = "") Экспорт
	ПараметрыОшибки = Новый Структура;
	ПараметрыОшибки.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	ПараметрыОшибки.Вставить("ТекстОшибки", СообщениеОбОшибки);
	ПараметрыОшибки.Вставить("ЭтоПредупреждение", Ложь);
	ПараметрыОшибки.Вставить("НеБлокироватьОкно", Ложь);
	Возврат ПараметрыОшибки;
КонецФункции

#КонецОбласти
