#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Задать настройки формы отчета.
//
// Параметры:
//  Форма		 - ФормаКлиентскогоПриложения	 - Форма отчета
//  КлючВарианта - Строка						 - Ключ загружаемого варианта
//  Настройки	 - Структура					 - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт

	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
	Настройки.События.ПриЗагрузкеПользовательскихНастроекНаСервере = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// Процедура - Обработчик заполнения настроек отчета и варианта
//
// Параметры:
//  НастройкиОтчета		 - Структура - Настройки отчета, подробнее см. процедуру ОтчетыУНФ.ИнициализироватьНастройкиОтчета 
//  НастройкиВариантов	 - Структура - Настройки варианта отчета, подробнее см. процедуру ОтчетыУНФ.ИнициализироватьНастройкиВарианта
//
Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["НаличиеСчетовФактур"].ИмяМакетаОбразца = "ОбразецНаличиеСчетовФактур";
	
	УстановитьТегиВариантов(НастройкиВариантов);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОтчетыУНФ.ФормаОтчетаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	Форма.НастройкиОтчета.Вставить("СписокОрганизаций", Отчеты.НаличиеСчетовФактур.ПолучитьДоступныеОрганизации());
	
КонецПроцедуры

// Обработчик события ПриЗагрузкеВариантаНаСервере
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения	 - Форма отчета
//  НовыеНастройкиКД - НастройкиКомпоновкиДанных	 - Загружаемые настройки КД
//
Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	
	ОтчетыУНФ.ПреобразоватьСтарыеНастройки(Форма, НовыеНастройкиКД);
	ОтчетыУНФ.ФормаОтчетаПриЗагрузкеВариантаНаСервере(Форма, НовыеНастройкиКД);
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения СКД отчета.
//
// Параметры:
//   Контекст - Произвольный
//   КлючСхемы - Строка
//   КлючВарианта - Строка
//                - Неопределено
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных
//                    - Неопределено
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных
//                                    - Неопределено
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы <> КлючВарианта Тогда
		Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") И НовыеНастройкиКД <> Неопределено Тогда
			
			ИспользоватьНесколькоОрганизаций = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
			Если НЕ ИспользоватьНесколькоОрганизаций Тогда
				СхемаКомпоновкиДанных.Параметры.Организация.ОграничениеИспользования = Истина;
			КонецЕсли;
			
			ИспользоватьОригиналы = ПолучитьФункциональнуюОпцию("ИспользоватьУчетОригиналовПервичныхДокументов");
			Если Не ИспользоватьОригиналы Тогда
				ПолеОригинал = СхемаКомпоновкиДанных.НаборыДанных.НаборНаличиеСчетовФактур.Поля.Найти("Оригинал");
				ПолеОригинал.ОграничениеИспользования.Группировка = Истина;
				ПолеОригинал.ОграничениеИспользования.Поле = Истина;
				ПолеОригинал.ОграничениеИспользования.Порядок = Истина;
				ПолеОригинал.ОграничениеИспользования.Условие = Истина;
				
				Для Каждого ЭлементОтбора Из НовыеНастройкиКД.Отбор.Элементы Цикл
					Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Оригинал") Тогда
						НовыеНастройкиКД.Отбор.Элементы.Удалить(ЭлементОтбора);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого Элемент Из НовыеНастройкиКД.Выбор.Элементы Цикл
					Если Элемент.Поле = Новый ПолеКомпоновкиДанных("Оригинал") Тогда
						НовыеНастройкиКД.Выбор.Элементы.Удалить(Элемент);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого Уровень1 Из НовыеНастройкиКД.Структура Цикл
					Для Каждого Уровень2 Из Уровень1.Структура Цикл
						Для Каждого УсловноеОформление Из Уровень2.УсловноеОформление.Элементы Цикл
							Удалить = Ложь;
							
							Для Каждого Поле Из УсловноеОформление.Поля.Элементы Цикл
								Если Поле.Поле = Новый ПолеКомпоновкиДанных("Оригинал") Тогда
									Удалить = Истина;
								КонецЕсли;
							КонецЦикла;
							
							Если Удалить Тогда
								Уровень2.УсловноеОформление.Элементы.Удалить(УсловноеОформление);
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
				
			КонецЕсли;
			
			ИспользоватьСегментыКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьСегментыКонтрагентов");
			Если Не ИспользоватьСегментыКонтрагентов Тогда
				ПолеСегмент = СхемаКомпоновкиДанных.НаборыДанных.СоставСегментаКонтрагентов.Поля.Найти("Сегмент");
				ПолеСегмент.ОграничениеИспользования.Группировка = Истина;
				ПолеСегмент.ОграничениеИспользования.Поле = Истина;
				ПолеСегмент.ОграничениеИспользования.Порядок = Истина;
				ПолеСегмент.ОграничениеИспользования.Условие = Истина;
				
				Для Каждого ЭлементОтбора Из НовыеНастройкиКД.Отбор.Элементы Цикл
					Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сегмент") Тогда
						НовыеНастройкиКД.Отбор.Элементы.Удалить(ЭлементОтбора);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ПараметрОрганизация = СхемаКомпоновкиДанных.Параметры.Организация;
			ПараметрОрганизация.УстановитьДоступныеЗначения(Контекст.НастройкиОтчета.СписокОрганизаций);
			
			Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
				МодульОтчетыСервер = ОбщегоНазначения.ОбщийМодуль("ОтчетыСервер");
				МодульОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
			КонецЕсли;
			
			КлючСхемы = КлючВарианта;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Обработчик события ПриЗагрузкеПользовательскихНастроекНаСервере
//
// Параметры:
//  Форма							 - ФормаКлиентскогоПриложения				 - Форма отчета
//  НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных - Загружаемые пользовательские
//                                                                                 настройки КД
//
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ОтчетыУНФ.ПеренестиПараметрыЗаголовкаВНастройки(КомпоновщикНастроек.Настройки, НовыеПользовательскиеНастройкиКД);	
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	ПараметрыОтчета = Отчеты.НаличиеСчетовФактур.ПустыеПараметрыКомпоновкиОтчета();
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрПериод = ПолучитьПараметр(
	НастройкиОтчета,
	"Период");
	
	Если ПараметрПериод <> Неопределено Тогда
		ПараметрыОтчета.НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
		ПараметрыОтчета.КонецПериода = ПараметрПериод.Значение.ДатаОкончания;
	КонецЕсли;
	
	ПараметрОрганизация = ПолучитьПараметр(
	НастройкиОтчета,
	"Организация");
	ПараметрыОтчета.Организация = ПараметрОрганизация.Значение;
	
	ПараметрНаличиеСчетаФактуры = ПолучитьПараметр(
	НастройкиОтчета,
	"НаличиеСчетаФактуры");
	
	Если ПараметрНаличиеСчетаФактуры.Значение = НСтр("ru = 'Без ошибок'") Тогда
		ПараметрыОтчета.НаличиеСчетаФактуры = Истина;
	ИначеЕсли ПараметрНаличиеСчетаФактуры.Значение = НСтр("ru = 'С ошибками'") Тогда
		ПараметрыОтчета.НаличиеСчетаФактуры = Ложь;
	Иначе
		ПараметрыОтчета.НаличиеСчетаФактуры = Неопределено;
	КонецЕсли;
	
	ВнешниеНаборыДанных = Отчеты.НаличиеСчетовФактур.ПолучитьВнешниеНаборыДанных(ПараметрыОтчета, Неопределено);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["НаличиеСчетовФактур"].Теги = НСтр("ru = 'Закупки'");
	
КонецПроцедуры

// Возвращает значение параметра компоновки данных.
//
// Параметры:
//  Настройки - НастройкиКомпоновкиДанных, ПользовательскиеНастройкиКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных, 
//              КоллекцияЗначенийПараметровКомпоновкиДанных, ОформлениеКомпоновкиДанных - 
//              Настройки, в которых происходит поиск параметра. Не поддерживает тип ДанныеРасшифровкиКомпоновкиДанных.
//  Параметр - Строка, ПараметрКомпоновкиДанных - Имя параметра СКД, для которого нужно вернуть значение параметра.
//
// Возвращаемое значение:
//  ПараметрКомпоновкиДанных, ЗначениеПараметраНастроекКомпоновкиДанных - Искомый параметр.
//
Функция ПолучитьПараметр(Настройки, Параметр)
	
	ЗначениеПараметра = Неопределено;
	ПолеПараметр = ?(ТипЗнч(Параметр) = Тип("Строка"), Новый ПараметрКомпоновкиДанных(Параметр), Параметр);
	
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	ИначеЕсли ТипЗнч(Настройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Для Каждого ЭлементНастройки Из Настройки.Элементы Цикл
			Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И ЭлементНастройки.Параметр = ПолеПараметр Тогда
				ЗначениеПараметра = ЭлементНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Настройки) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Для Каждого ЭлементНастройки Из Настройки.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И ЭлементНастройки.Параметр = ПолеПараметр Тогда
				ЗначениеПараметра = ЭлементНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = Настройки.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Настройки) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройки.Найти(ПолеПараметр);
	ИначеЕсли ТипЗнч(Настройки) = Тип("ОформлениеКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройки.НайтиЗначениеПараметра(ПолеПараметр);
	КонецЕсли;
	
	Возврат ЗначениеПараметра;
	
КонецФункции

#КонецОбласти

#Область Инициализация

ЭтоОтчетУНФ = Истина;

#КонецОбласти 

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли