#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	ОрганизацияОтбор = Неопределено;
	Если Параметры.Свойство("Организация", ОрганизацияОтбор) Тогда
		ВладелецСписок.Добавить(ОрганизацияОтбор);
		ПриИзмененииОтбора(ЭтотОбъект, "ВладелецСписок");
	КонецЕсли;
	
	ТоварнаяГруппаОтбор = Неопределено;
	Если Параметры.Свойство("ТоварнаяГруппа", ТоварнаяГруппаОтбор) Тогда
		ТоварнаяГруппаСписок.Добавить(ТоварнаяГруппаОтбор);
		ПриИзмененииОтбора(ЭтотОбъект, "ТоварнаяГруппаСписок");	
	КонецЕсли;
	
	Если Параметры.Свойство("КПП", КПП) Тогда
		Если ЗначениеЗаполнено(КПП) Тогда
			ПриИзмененииОтбораПоКПП(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	РежимВыборМОД = Ложь;
	Если Не Параметры.Свойство("ВыборМОД", РежимВыборМОД) Тогда
		РежимВыборМОД = Ложь;
	КонецЕсли;
	
	Элементы.СписокВыбратьМОД.Видимость        = РежимВыборМОД;
	Элементы.ВладелецСтрокой.Доступность       = Не РежимВыборМОД;
	Элементы.ТоварнаяГруппаСтрокой.Доступность = Не РежимВыборМОД;
	Элементы.КодФИАС.Видимость                 = РежимВыборМОД;
	
	СобытияФормИС.ПоляСоставногоТипаИнициализация(ЭтотОбъект, ИменаЭлементовПолейСоставногоТипа());
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТоварныеГруппыОтборПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПолеОтбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ТоварнаяГруппаОтборПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ПриИзмененииОтбора(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТоварнаяГруппаОтборПредставлениеПриИзменении(Элемент)
	ПриИзмененииОтбора(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТоварнаяГруппаОтборСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	ТоварнаяГруппаСписок.Очистить();
	ПриИзмененииОтбора(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецОтборПредставлениеПриИзменении(Элемент)
	ПолеСоставногоТипаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецОтборПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПолеОтбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецОтборПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ПолеСоставногоТипаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецОтборСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПолеСоставногоТипаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АктуализироватьСписок(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыАктуализацииМОД = Новый Структура();
	ПараметрыАктуализацииМОД.Вставить("ИННУчастника",        СписокИННПоВыбраннымВладельцамМОД());
	ПараметрыАктуализацииМОД.Вставить("МассивТоварныхГрупп", ТоварнаяГруппаСписок.ВыгрузитьЗначения());
	
	Если ТоварнаяГруппаСписок.Количество() = 0 Тогда
		ПараметрыАктуализацииМОД.Вставить("ТоварнаяГруппа", ПустаяСсылкаТоварнаяГруппа());
	Иначе
		ПараметрыАктуализацииМОД.Вставить("ТоварнаяГруппа", ТоварнаяГруппаСписок[0].Значение);
	КонецЕсли;
	
	ПослеВыполненияОбновления = Новый ОписаниеОповещения("ПослеАктуализацииСпискаМОД", ЭтотОбъект);
	
	ПараметрыЗапроса                         = ИнтерфейсИСМПОбщегоНазначенияКлиент.ПараметрыЗапросаДанных();
	ПараметрыЗапроса.ОповещениеОЗавершении   = ПослеВыполненияОбновления;
	ПараметрыЗапроса.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыЗапроса.Параметры               = ПараметрыАктуализацииМОД;
	
	ИнтерфейсИСМПОбщегоНазначенияКлиент.СписокМестОсуществленияДеятельности(ПараметрыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьМОД(Команда)
	
	ПараметрыРегистрацииМОД = ИнтеграцияИСМПКлиент.ПараметрыРегистрацииМОДГИСМТ();
	СписокМОДКРегистрации   = Новый Массив;
	ВыбранныеТоварныеГруппы = Новый Массив;

	Для Каждого ТоварнаяГруппаОтбор Из ТоварнаяГруппаСписок Цикл
		ВыбранныеТоварныеГруппы.Добавить(ТоварнаяГруппаОтбор.Значение);
	КонецЦикла;
	
	ПараметрыРегистрацииМОД.ТоварныеГруппы = ВыбранныеТоварныеГруппы;
	
	Если ВладелецСписок.Количество() = 1 Тогда
		ОрганизацияОтбор = ВладелецСписок[0].Значение;
		Если ТипЗнч(ОрганизацияОтбор) = Тип("СправочникСсылка.Организации") Тогда
			ПараметрыРегистрацииМОД.Организация = ВладелецСписок[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	СписокМОДКРегистрации.Добавить(ПараметрыРегистрацииМОД);
	
	ПараметрыОткрытияФормыРегистрации = ИнтеграцияИСМПКлиент.ПараметрыОткрытияФормыРегистрацииМОДГИСМТ();
	
	ПараметрыОткрытияФормыРегистрации.СписокМОДКРегистрации     = СписокМОДКРегистрации;
	ПараметрыОткрытияФормыРегистрации.НезависимаяРегистрацияМОД = Ложь;
	
	ПослеРегистрацииМОД = Новый ОписаниеОповещения("ПослеРегистрацииМОДВГИСМТ", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.МестаОсуществленияДеятельностиИСМП.Форма.ФормаРегистрацииМОДВСервисе",
		ПараметрыОткрытияФормыРегистрации, ЭтотОбъект, , , , ПослеРегистрацииМОД,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМОД(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбранногоМОД = Новый Структура;
	ДанныеВыбранногоМОД.Вставить("ДанныеАдреса",        ТекущаяСтрока.ДанныеАдреса);
	ДанныеВыбранногоМОД.Вставить("ПредставлениеАдреса", ТекущаяСтрока.ПредставлениеАдреса);
	
	Закрыть(ДанныеВыбранногоМОД);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьМОД(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Владелец) <> Тип("СправочникСсылка.Организации") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Операция недоступна для МОД контрагентов.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыУдаленияМОД = Новый Структура;
	ПараметрыУдаленияМОД.Вставить("ТоварнаяГруппа", ТекущиеДанные.ТоварнаяГруппа);
	ПараметрыУдаленияМОД.Вставить("КодФИАС",        ТекущиеДанные.КодФИАС);
	ПараметрыУдаленияМОД.Вставить("КПП",            ТекущиеДанные.КПП);
	ПараметрыУдаленияМОД.Вставить("ИНН",            ТекущиеДанные.ИНН);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса", ПараметрыУдаленияМОД);
	ДополнительныеПараметры.Вставить("Организация",      ТекущиеДанные.Владелец);
	
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Место осуществления деятельности с кодом ФИАС ""%1"" будет удалено в ГИС МТ'"),
		ТекущиеДанные.КодФИАС);
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("УдалениеМОДВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Кнопки = Новый СписокЗначений();
	Кнопки.Добавить("Продолжить");
	Кнопки.Добавить("Отмена");
	
	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, Кнопки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	//Адрес
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПредставлениеАдреса.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ПредставлениеАдреса");
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru='<не заполнено>'"));
	
	//Дата обновления
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДатаПоследнегоОбновления.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ДатаПоследнегоОбновления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = ТекущаяДатаСеанса() - (86400 * 45);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);
	
	//Владелец
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Владелец.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Владелец");
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru='<не подобран по ИНН и КПП>'"));
	
КонецПроцедуры

#Область СписокМОДОтборы

&НаКлиенте
Процедура ПолеОтбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяЭлементаОтбора       = Лев(Элемент.Имя, СтрДлина(Элемент.Имя) - 7);
	ИмяЭлементаОтбораСписок = СтрШаблон("%1Список", ИмяЭлементаОтбора);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыбранныеЗначения", ЭтотОбъект[ИмяЭлементаОтбораСписок].ВыгрузитьЗначения());
	ПараметрыОткрытия.Вставить("ИмяЭлементаОтбора", ИмяЭлементаОтбора);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаОтбора", ИмяЭлементаОтбора);
	
	ПослеВыбораЗначенийОтбора = Новый ОписаниеОповещения("ПолеОтбораОкончаниеВыбора", ЭтотОбъект,
		ДополнительныеПараметры);
	
	ОткрытьФорму("РегистрСведений.МестаОсуществленияДеятельностиИСМП.Форма.ФормаВыбораЗначенийОтбора",
		ПараметрыОткрытия, ЭтотОбъект,,,, ПослеВыбораЗначенийОтбора, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтбораОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлементаОтбораСписок = СтрШаблон("%1Список", ДополнительныеПараметры.ИмяЭлементаОтбора);
	ЭтотОбъект[ИмяЭлементаОтбораСписок].ЗагрузитьЗначения(Результат);
	ПриИзмененииОтбора(ЭтотОбъект, ИмяЭлементаОтбораСписок);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииОтбора(Форма, Имя)
	
	Если Прав(Имя, 6) = "Список" Тогда
		ИмяЭлементаОтбора        = Лев(Имя, СтрДлина(Имя) - 6);
		ИмяЭлементаОтбораСписок  = Имя;
		ИмяЭлементаОтбораСтрокой = СтрШаблон("%1Строкой", ИмяЭлементаОтбора);
		
		Форма[ИмяЭлементаОтбораСтрокой] = Строка(Форма[ИмяЭлементаОтбораСписок]);
		
	ИначеЕсли Прав(Имя, 7) = "Строкой" Тогда
		ИмяЭлементаОтбора        = Лев(Имя, СтрДлина(Имя) - 7);;
		ИмяЭлементаОтбораСписок  = СтрШаблон("%1Список", ИмяЭлементаОтбора);
		ИмяЭлементаОтбораСтрокой = Имя;
		
		Форма[ИмяЭлементаОтбораСписок].Очистить();
		Если ЗначениеЗаполнено(Форма[ИмяЭлементаОтбораСтрокой]) Тогда
			Форма[ИмяЭлементаОтбораСписок].Добавить(Форма[ИмяЭлементаОтбора]);
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.Элементы[ИмяЭлементаОтбораСтрокой].РедактированиеТекста = Форма[ИмяЭлементаОтбораСписок].Количество() < 2;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список, ИмяЭлементаОтбора, Форма[ИмяЭлементаОтбораСписок],
		ВидСравненияКомпоновкиДанных.ВСписке,,
		Форма[ИмяЭлементаОтбораСписок].Количество() > 0);
			
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаПриИзменении(Элемент)
	
	СобытияФормИСКлиент.ПолеСоставногоТипаПриИзменении(ЭтотОбъект, Элемент);
	
	ПриИзмененииОтбора(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СобытияФормИСКлиент.ПолеСоставногоТипаОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
	ПриИзмененииОтбора(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИменаЭлементовПолейСоставногоТипа()
	
	Возврат "ВладелецСтрокой";
	
КонецФункции

&НаКлиенте
Процедура ПолеСоставногоТипаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЭтотОбъект[СтрЗаменить(Элемент.Имя, "Строкой", "Список")].Количество() > 1 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	СобытияФормИСКлиент.ПолеСоставногоТипаАвтоПодбор(ЭтотОбъект,
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	СобытияФормИСКлиент.ПолеСоставногоТипаОкончаниеВыбора(ЭтотОбъект, Результат, ДополнительныеПараметры);
	
	ПриИзмененииОтбора(ЭтотОбъект, ДополнительныеПараметры.Элемент.Имя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииОтбораПоКПП(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список, "КПП", Форма.КПП, 
		ВидСравненияКомпоновкиДанных.Равно, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область АктуализацияСпискаМОД

&НаКлиенте
Процедура ПослеАктуализацииСпискаМОД(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОшибки Тогда
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ОбновитьСписокМОДПоДаннымИзСервиса(Результат.Результат);
	ПослеУспешногоОбновленияСпискаМОД();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУспешногоОбновленияСпискаМОД()
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокМОДПоДаннымИзСервиса(СписокМОДИзСервиса)
	
	ДополнительныеПараметры = РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ИнициализироватьПараметрыЗаписиМОД();
	ДополнительныеПараметры.Обновление = Истина;	
	
	Если ВладелецСписок.Количество() Тогда
		ДополнительныеПараметры.СОтборомПоИНН = Истина;
		Если ВладелецСписок.Количество() = 1 Тогда
			ДополнительныеПараметры.Владелец = ВладелецСписок[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ОбновитьСписокМестОсуществленияДеятельности(СписокМОДИзСервиса,
		ДополнительныеПараметры);
			
КонецПроцедуры

&НаСервере
Функция СписокИННПоВыбраннымВладельцамМОД()
	
	ВладельцыСоответствие = Новый Соответствие();
	
	СтруктураИННКПП = Новый Структура();
	СтруктураИННКПП.Вставить("ИНН", "");
	СтруктураИННКПП.Вставить("КПП", "" );
	
	СписокИНН = Новый Массив;
	
	Для каждого СтрокаВладельца Из ВладелецСписок Цикл
		ВладельцыСоответствие.Вставить(СтрокаВладельца, СтруктураИННКПП);	
	КонецЦикла;
		
	ОбщегоНазначенияИСПереопределяемый.ЗаполнитьИННКПППоНесколькимОрганизациямКонтрагентам(ВладельцыСоответствие,
		ВладелецСписок.ВыгрузитьЗначения());
	
	Для каждого КлючИЗначение Из ВладельцыСоответствие Цикл
		ИННВЗапрос = КлючИЗначение.Значение.ИНН;
		Если ЗначениеЗаполнено(ИННВЗапрос) Тогда
			СписокИНН.Добавить(ИННВЗапрос);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокИНН;
	
КонецФункции

&НаСервере
Функция ПустаяСсылкаТоварнаяГруппа()
	
	Возврат Справочники.ТоварныеГруппыГИСМТ.ПустаяСсылка();	
	
КонецФункции

#КонецОбласти

#Область РегистрацияУдалениеМОДГИСМТ

&НаКлиенте
Процедура ПослеРегистрацииМОДВГИСМТ(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УдалениеМОДВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = "Продолжить" Тогда
		ПослеВыполненияУдаления = Новый ОписаниеОповещения("ПослеУдаленияМОДВГИСМТ",
			ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗапроса);

		ПараметрыЗапроса                         = ИнтерфейсИСМПОбщегоНазначенияКлиент.ПараметрыЗапросаДанных();
		ПараметрыЗапроса.Организация             = ДополнительныеПараметры.Организация;
		ПараметрыЗапроса.ОповещениеОЗавершении   = ПослеВыполненияУдаления;
		ПараметрыЗапроса.УникальныйИдентификатор = УникальныйИдентификатор;
		ПараметрыЗапроса.Параметры               = ДополнительныеПараметры.ПараметрыЗапроса;

		ИнтерфейсИСМПОбщегоНазначенияКлиент.УдалениеМестОсуществленияДеятельностиГИСМТ(ПараметрыЗапроса);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияМОДВГИСМТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОшибки Тогда
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	УдалениеМОДГИСМТЗавершение(ДополнительныеПараметры);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УдалениеМОДГИСМТЗавершение(ПараметрыМОД)
	
	ДополнительныеПараметры = РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ИнициализироватьПараметрыЗаписиМОД();
	ДополнительныеПараметры.Удаление = Истина;
	
	РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ОбновитьСписокМестОсуществленияДеятельности(ПараметрыМОД, 
		ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти