#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.УстановитьНовыйКод();
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Если Не ВозможностиПриложения.ЭтоБизнесПриложение() Тогда
		Возврат;
	КонецЕсли;
	
	Если НачальноеЗаполнениеВыполнено() Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяЗаказаПокупателя = Метаданные.Документы.ЗаказПокупателя.ПолноеИмя();
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипДата = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	Элемент = Элементы.Добавить();
	Элемент.Имя = "НомерДоговора";
	Элемент.Наименование = НСтр("ru = '№ договора'");
	Элемент.ТипЗначения = ТипСтрока;
	Элемент.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
	
	Элемент = Элементы.Добавить();
	Элемент.Имя = "ДатаДоговора";
	Элемент.Наименование = НСтр("ru = 'Дата договора'");
	Элемент.ТипЗначения = ТипДата;
	Элемент.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
	
	Элемент = Элементы.Добавить();
	Элемент.Имя = "РеквизитБизнесПриложение1";
	Элемент.Наименование = НСтр("ru = 'Стройка'");
	Элемент.ТипЗначения = ТипСтрока;
	Элемент.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
	
	Элемент = Элементы.Добавить();
	Элемент.Имя = "РеквизитБизнесПриложение2";
	Элемент.Наименование = НСтр("ru = 'Объект строительства'");
	Элемент.ТипЗначения = ТипСтрока;
	Элемент.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
	
	Элемент = Элементы.Добавить();
	Элемент.Имя = "НомерПлатежноРасчетногоДокумента";
	Элемент.Наименование = НСтр("ru = '№ платежно-расчетного документа'");
	Элемент.ТипЗначения = ТипСтрока;
	Элемент.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
	
	Элемент = Элементы.Добавить();
	Элемент.Имя = "ДатаПлатежноРасчетногоДокумента";
	Элемент.Наименование = НСтр("ru = 'Дата платежно-расчетного документа'");
	Элемент.ТипЗначения = ТипДата;
	Элемент.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
	
	Элемент = Элементы.Добавить();
	Элемент.Имя = "НомерСчетаФактурыНаАванс";
	Элемент.Наименование = НСтр("ru = '№ авансовой счет-фактуры'");
	Элемент.ТипЗначения = ТипСтрока;
	Элемент.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
	
	Элемент = Элементы.Добавить();
	Элемент.Имя = "ДатаСчетаФактурыНаАванс";
	Элемент.Наименование = НСтр("ru = 'Дата авансовой счет-фактуры'");
	Элемент.ТипЗначения = ТипДата;
	Элемент.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
	
КонецПроцедуры

// Начальное заполнение свойств 1
// Версия 3.0.13
//
Процедура НачальноеЗаполнениеСвойств1() Экспорт
	
	Если Не ВозможностиПриложения.ЭтоБизнесПриложение() Тогда
		
		ТекстСообщения = НСтр(
		"ru='Процедура НачальноеЗаполнениеСвойств1 успешно отработала - это не бизнес-приложение'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
		ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	ПолноеИмяЗаказаПокупателя = Метаданные.Документы.ЗаказПокупателя.ПолноеИмя();
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипДата = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	НачатьТранзакцию();
	
	Попытка
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерДоговора";
		НовоеСвойство.Наименование = НСтр("ru = '№ договора'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаДоговора";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата договора'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "РеквизитБизнесПриложение1";
		НовоеСвойство.Наименование = НСтр("ru = 'Стройка'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "РеквизитБизнесПриложение2";
		НовоеСвойство.Наименование = НСтр("ru = 'Объект строительства'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерПлатежноРасчетногоДокумента";
		НовоеСвойство.Наименование = НСтр("ru = '№ платежно-расчетного документа'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаПлатежноРасчетногоДокумента";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата платежно-расчетного документа'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерСчетаФактурыНаАванс";
		НовоеСвойство.Наименование = НСтр("ru = '№ авансовой счет-фактуры'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаСчетаФактурыНаАванс";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата авансовой счет-фактуры'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='Процедура НачальноеЗаполнениеСвойств1 неуспешно отработала по причине:
		|%1'", ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстОшибки);
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
		ТекстСообщения);
		
	КонецПопытки;
	
	ТекстСообщения = НСтр(
	"ru='Процедура НачальноеЗаполнениеСвойств1 успешно отработала'",
	ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(
	ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
	ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

// Функция - Список всех доступных реквизитов
// 
// Возвращаемое значение:
//  Массив из Строка - список реквизитов
//
Функция СписокВсехДоступныхРеквизитов() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("НомерДоговора");
	Результат.Добавить("ДатаДоговора");
	Результат.Добавить("РеквизитБизнесПриложение1");
	Результат.Добавить("РеквизитБизнесПриложение2");
	Результат.Добавить("НомерПлатежноРасчетногоДокумента");
	Результат.Добавить("ДатаПлатежноРасчетногоДокумента");
	Результат.Добавить("НомерСчетаФактурыНаАванс");
	Результат.Добавить("ДатаСчетаФактурыНаАванс");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДоступныеСвойства(Реквизиты = "") Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Массив") Тогда
		Если Реквизиты.Количество() = 0 Тогда
			Реквизиты = СписокВсехДоступныхРеквизитов();
		КонецЕсли;
	Иначе
		Если ПустаяСтрока(Реквизиты) Тогда
			Реквизиты = СписокВсехДоступныхРеквизитов();
		Иначе
			Реквизиты = СтрРазделить(Реквизиты, ",", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизитыБизнесПриложение.Имя КАК Имя,
		|	ДополнительныеРеквизитыБизнесПриложение.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение КАК ДополнительныеРеквизитыБизнесПриложение
		|ГДЕ
		|	ДополнительныеРеквизитыБизнесПриложение.Имя В(&Реквизиты)";
	Запрос.УстановитьПараметр("Реквизиты", Реквизиты);
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	Результат = Новый Соответствие;
	Для Каждого Реквизит Из Реквизиты Цикл
		
		Свойство = ТаблицаСвойств.НайтиСтроки(Новый Структура("Имя", Реквизит));
		Если Не Свойство.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Свойство = Свойство[0].Ссылка;
		Результат[Реквизит] = Свойство;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НачальноеЗаполнениеВыполнено()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДополнительныеРеквизитыБизнесПриложение.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение КАК ДополнительныеРеквизитыБизнесПриложение";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли