
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТипДокумента", ТипДокумента);
	
	ДеревоЗначений = ОбменСГИСЭПД.ДеревоГруппДанныхДляДополнительныхПолей(ТипДокумента);
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "Дерево");
	
	ТекущаяГруппа = Неопределено;
	Параметры.Свойство("ГруппаДанных", ТекущаяГруппа);
	
	Если ТекущаяГруппа <> Неопределено Тогда
		СтрокаДерева = НайтиСтрокуДереваРекурсивно(Дерево, "Путь", ТекущаяГруппа);
		Если СтрокаДерева <> Неопределено Тогда
			Элементы.Дерево.ТекущаяСтрока = СтрокаДерева.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;

	ВидимостьЭлементов85 = КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5;
	Элементы.ГруппаИнфо85.Видимость = ВидимостьЭлементов85;
	Элементы.ГруппаИнфо.Видимость = Не ВидимостьЭлементов85;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТехническиеПоля(Команда)
	
	Элементы.ДеревоПуть.Видимость = Не Элементы.ДеревоПуть.Видимость;
	Элементы.ДеревоУзел.Видимость = Не Элементы.ДеревоУзел.Видимость;
	
	Элементы.ДеревоПоказатьТехническиеПоля.Заголовок = ?(Элементы.ДеревоПуть.Видимость, 
		НСтр("ru='Скрыть технические поля'"), 
		НСтр("ru='Показать технические поля'"));
		
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда)
	
	Если КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5 Тогда
		ВыделенныеСтроки = Элементы.Дерево.ПолучитьСтрокиДляОбработки();
	Иначе
		ВыделенныеСтроки = Элементы.Дерево.ВыделенныеСтроки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяСтрока = ВыделенныеСтроки[0];
	
	ТекущиеДанные = Дерево.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Результат = Новый Структура;
	Результат.Вставить("ГруппаДанных", ТекущиеДанные.Путь);
	Результат.Вставить("Узел", ТекущиеДанные.Узел);
	
	Закрыть(Результат);
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Дерево.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Результат = Новый Структура;
	Результат.Вставить("ГруппаДанных", ТекущиеДанные.Путь);
	Результат.Вставить("Узел", ТекущиеДанные.Узел);
	
	Закрыть(Результат);

КонецПроцедуры

&НаСервере
Функция НайтиСтрокуДереваРекурсивно(ДеревоРодитель, ИмяПоля, Значение)
	
	Для Каждого СтрокаДерева Из ДеревоРодитель.ПолучитьЭлементы() Цикл
		Если СтрокаДерева[ИмяПоля] = Значение Тогда
			Возврат СтрокаДерева;	
		Иначе
			НайденнаяСтрока = НайтиСтрокуДереваРекурсивно(СтрокаДерева, ИмяПоля, Значение);
			Если НайденнаяСтрока <> Неопределено Тогда
				Возврат НайденнаяСтрока;
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
