#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресТаблицыФизическихЛиц") Тогда
		АдресТаблицыФизическихЛиц = Параметры.АдресТаблицыФизическихЛиц;
		ТаблицаФизЛиц = ПолучитьИзВременногоХранилища(АдресТаблицыФизическихЛиц);
		ПодобранныеФизическиеЛица.Загрузить(ТаблицаФизЛиц);
		ЗаполнитьМассивВыбранныхФизическихЛиц();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМассивВыбранныхФизическихЛиц()
	
	ТаблицаФизЛиц = ПодобранныеФизическиеЛица.Выгрузить();
	МассивВыбранныхФизЛиц = ТаблицаФизЛиц.ВыгрузитьКолонку("ФизическоеЛицо");
	
	СписокФизическихЛиц.Параметры.УстановитьЗначениеПараметра("МассивВыбранныхФизЛиц", МассивВыбранныхФизЛиц);
	
	Элементы.СписокФизическихЛиц.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	АдресТаблицыВоВременномХранилище = ВернутьАдресТаблицы();
	
	Закрыть(АдресТаблицыВоВременномХранилище);
	
КонецПроцедуры

&НаСервере
Функция ВернутьАдресТаблицы()
	
	Возврат ПоместитьВоВременноеХранилище(ПодобранныеФизическиеЛица.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ПодобранныеФизическиеЛицаПриИзменении(Элемент)
	
	ЗаполнитьМассивВыбранныхФизическихЛиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВыделенные(Команда)
	
	ТекущиеДанные = Элементы.СписокФизическихЛиц.ТекущиеДанные;
	ВыделенныеСтроки = Элементы.СписокФизическихЛиц.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() Тогда
		Для каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
			НоваяСтрока = ПодобранныеФизическиеЛица.Добавить();
			НоваяСтрока.ФизическоеЛицо = Элементы.СписокФизическихЛиц.ДанныеСтроки(ИдентификаторСтроки).Ссылка;
		КонецЦикла;
	ИначеЕсли Не ТекущиеДанные = Неопределено Тогда
		НоваяСтрока = ПодобранныеФизическиеЛица.Добавить();
		НоваяСтрока.ФизическоеЛицо = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	ЗаполнитьМассивВыбранныхФизическихЛиц();
	
КонецПроцедуры

#КонецОбласти
