
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыборПериода.Вариант = ВариантСтандартногоПериода.ЭтотГод;
	
	Элементы.Организации.Доступность = ТолькоВыбранныеОрганизации;
	
	ПроведеноДокументов = 0;
	НеУдалосьПровести = 0;
	
	ЗаполнитьСписокОрганизаций();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТолькоВыбранныеОрганизацииПриИзменении(Элемент)
	
	Элементы.Организации.Доступность = ТолькоВыбранныеОрганизации;
	Если Элементы.Организации.Доступность Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСпискаОрганизации из Организации Цикл
		ЭлементСпискаОрганизации.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КнопкаВыполнить(Команда)
	
	ОчиститьСообщения();
	
	ВыбранныеОрганизации = Новый Массив;
	Для Каждого ЭлементСпискаОрганизации из Организации Цикл
		Если ЭлементСпискаОрганизации.Пометка Тогда
			ВыбранныеОрганизации.Добавить(ЭлементСпискаОрганизации.Значение)
		КонецЕсли;
	КонецЦикла;
	
	Если ТолькоВыбранныеОрганизации = 1 И НЕ ЗначениеЗаполнено(ВыбранныеОрганизации) Тогда
		
		ТекстСообщения = НСтр("ru = 'Выберите одну или несколько организаций для перепроведения.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Организации");
		Возврат;
		
	КонецЕсли;
	
	Результат = ВыполнитьНаСервере(ВыбранныеОрганизации);
	
	Если Результат = 1 Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Перепроведение уже выполняется. Ожидайте завершения.'"));
		Возврат;
		
	ИначеЕсли Результат = 2 Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Перепроведение уже выполняется другим пользователем.'"));
		Возврат;
		
	КонецЕсли;
	
	ПослеОбработкиПодготовленныхДанных(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокОрганизаций()
	
	Организации.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организации.Наименование";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Организации.Добавить(Выборка.Ссылка, Выборка.Наименование, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыполненияФоновогоЗадания(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗагрузки = Неопределено Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрЗаголовок = НСтр("ru ='Перепроведение документов'");
	Если РезультатЗагрузки.Статус = "Выполнено" Тогда 
		
		ЗагрузитьПодготовленныеДанныеНаСервере();
		ПоказатьРезультатПерепроведения();
		
	ИначеЕсли РезультатЗагрузки.Статус = "Ошибка" Тогда
		
		ПоказатьОповещениеПользователя(РезультатЗагрузки.КраткоеПредставлениеОшибки, , ПараметрЗаголовок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРезультатПерепроведения()
	
	ТекстСообщения = НСтр("ru='Выполнено перепроведение документов:
	|– проведено документов: %1;
	|%2'");
	
	Если НеУдалосьПровести = 0 Тогда
		
		ТекстСообщенияОбОшибках = НСтр("ru='– ошибок не обнаружено.'");
		
	Иначе
		
		ТекстСообщенияОбОшибках = СтрШаблон(НСтр("ru='– не удалось провести документов: %1'"), НеУдалосьПровести);
		
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПроведеноДокументов,
		ТекстСообщенияОбОшибках);
	ПоказатьПредупреждение(Неопределено, ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбработкиПодготовленныхДанных(Результат)
	
	Если Результат = Неопределено Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.Статус <> "Выполняется" Тогда 
		
		ОбработатьРезультатВыполненияФоновогоЗадания(Результат, Неопределено);
		Возврат;
		
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("ОбработатьРезультатВыполненияФоновогоЗадания", ЭтотОбъект, Неопределено);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Групповое перепроведение документов'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат, Обработчик, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанныеНаСервере()
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("ПроведеноДокументов") Тогда
		
		ПроведеноДокументов = СтруктураДанных.ПроведеноДокументов;
		
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("НеУдалосьПровести") Тогда
		
		НеУдалосьПровести = СтруктураДанных.НеУдалосьПровести;
		
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("Ошибки")
		И СтруктураДанных.Ошибки <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(СтруктураДанных.Ошибки);
		
	КонецЕсли;
	
	ИдентификаторЗадания = Неопределено;
	РазблокироватьДанныеДляРедактирования(, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьНаСервере(Знач ВыбранныеОрганизации)
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) 
		И Не ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
		
		Возврат 1;
		
	КонецЕсли;
	
	Если ТолькоВыбранныеОрганизации = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Попытка
				ЗаблокироватьДанныеДляРедактирования(Выборка.Организация,, УникальныйИдентификатор);
			Исключение
				РазблокироватьДанныеДляРедактирования(, УникальныйИдентификатор);
				Возврат 2;
			КонецПопытки;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого ВыбраннаяОрганизация Из ВыбранныеОрганизации Цикл
			
			Попытка
				
				ЗаблокироватьДанныеДляРедактирования(ВыбраннаяОрганизация,, УникальныйИдентификатор);
				
			Исключение
				
				РазблокироватьДанныеДляРедактирования(, УникальныйИдентификатор);
				Возврат 2;
				
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Организация", ?(ТолькоВыбранныеОрганизации = 0, Неопределено, ВыбранныеОрганизации));
	ПараметрыПроцедуры.Вставить("НачалоПериода", ВыборПериода.ДатаНачала);
	ПараметрыПроцедуры.Вставить("КонецПериода", ВыборПериода.ДатаОкончания);
	ПараметрыПроцедуры.Вставить("ЗаписыватьОшибкиВЖурналРегистрации", Истина);
	ПараметрыПроцедуры.Вставить("ОстанавливатьсяПоОшибке", ОстанавливатьсяПоОшибке);
	ПараметрыПроцедуры.Вставить("УстановитьПризнакМодифицированностиУДокумента", УстановитьПризнакМодифицированностиУДокумента);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Групповое перепроведение документов'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ИмяМетода = "Обработки.ГрупповоеПерепроведениеДокументов.ПерепроведениеДокументов";
	РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыПроцедуры, ПараметрыВыполнения);
	
	АдресХранилища = РезультатФоновогоЗадания.АдресРезультата;
	ИдентификаторЗадания = РезультатФоновогоЗадания.ИдентификаторЗадания;
	
	Если РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда
		
		ЗагрузитьПодготовленныеДанныеНаСервере();
		
	КонецЕсли;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

#КонецОбласти
