#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодробноеПредставлениеОшибки = Параметры.ПодробноеПредставлениеОшибки;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СкопироватьТекстОшибкиВБуферОбмена(Команда)
	Если Не СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		Возврат;
	КонецЕсли;
	ЭлементыБуфераОбмена = Новый Массив;
	Если СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(СтандартныйФорматДанныхБуфераОбмена.Текст) Тогда
		ДляБуфераОбмена = Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст,
			ПодробноеПредставлениеОшибки);
		ЭлементыБуфераОбмена.Добавить(ДляБуфераОбмена);
	КонецЕсли;
	СредстваБуфераОбмена.ПоместитьДанныеАсинх(ЭлементыБуфераОбмена);
КонецПроцедуры

#КонецОбласти