#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму "ДвиженияДокумента"
//
// Параметры:
//  ПараметрКоманды - ДокументСсылка - документ, для которого следует показать движения
//
Процедура ПоказатьДвижения(ПараметрКоманды) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ПараметрКоманды", ПараметрКоманды);
	
	ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, , ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти
