#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Вызывается при работе в модели сервиса для получения сведений о предопределенных вариантах отчета.
//
// Возвращаемое значение:
//  Массив из Структура:
//    * Имя           - Строка - имя варианта отчета; например, "Основной";
//    * Представление - Строка - имя варианта отчета; например, НСтр("ru = 'Динамика изменений файлов'").
//
Функция ВариантыНастроек() Экспорт 
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Имя, Представление", "Основной", 
		НСтр("ru = 'Статистика по согласованию заявок'")));
	Возврат Результат;
	
КонецФункции

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина);
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтатистикаСогласованияЗаявок, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет показывает статистику по согласованным заявкам за указанный период.'");
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Деньги.Подсистемы.ПлатежныйКалендарь, "");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьМаршрутизациюЗаявок");
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

// Получить время в работе строкой.
// 
// Параметры:
//  ВремяВРаботе - Число - время в работе
// 
// Возвращаемое значение:
//  Строка
Функция ПолучитьВремяВРаботеСтрокой(ВремяВРаботе) Экспорт
	
	Если Не ЗначениеЗаполнено(ВремяВРаботе) Тогда
		Возврат "";
	КонецЕсли;
	
	ШаблонДни = НСтр("ru = ' дн.'");
	ШаблонЧасы = НСтр("ru = ' ч.'");
	ШаблонОбщий = НСтр("ru = '%1 %2 %3 мин. %4 сек.'"); 
	
	Дата = Дата(1, 1, 1) + ВремяВРаботе;
	Дни = ?(ДеньГода(Дата) > 1, Строка(ДеньГода(Дата)-1) + ШаблонДни, "");
	Часы = ?(Час(Дата) >= 1, Строка(Час(Дата)) + ШаблонЧасы, "");
	
	ВремяВРаботеСтрокой = СтрШаблон(ШаблонОбщий, Дни, Часы, Минута(Дата), Секунда(Дата));
	ВремяВРаботеСтрокой = СокрЛП(СтрЗаменить(ВремяВРаботеСтрокой, "  ", " "));
	
	Возврат ВремяВРаботеСтрокой;
	
КонецФункции

#КонецОбласти

#КонецЕсли