#Область ПрограммныйИнтерфейс

// Регистрирует тарифицируемые услуги конфигурации из Структуры.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ПоставщикиУслуг - Массив из Структура - описывает поставщика услуги:
// 	 * Идентификатор - Строка - идентификатор поставщика услуги (тип Строка - Строка(50)),
// 	 * Наименование - Строка - наименование поставщика услуги (тип Строка - Строка(150)),
// 	 * Услуги - Массив из Структура - услуги поставщика с обязательными ключами:
// 	   ** Идентификатор - Строка - идентификатор услуги  (тип Строка - Строка(50))
// 	   ** Наименование - Строка - наименование услуги  (тип Строка - Строка(150))
// 	   ** ТипУслуги - ПеречислениеСсылка.ТипыУслуг - тип услуги.
//
Процедура ПриФормированииСпискаУслуг(ПоставщикиУслуг) Экспорт
	
	ТарификацияУНФ.ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	ТарификацияБизнес.ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	
	// БиблиотекаЭлектронныхДокументов
	ЭлектронноеВзаимодействие.ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	// Конец БиблиотекаЭлектронныхДокументов
	
	// МобильноеПриложение
	МобильноеПриложениеВызовСервера.ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	// Конец МобильноеПриложение  
	
	Облачная1СО.ПриФормированииСпискаУслуг(ПоставщикиУслуг);

КонецПроцедуры

// Событие, которое вызывается при изменении активации лицензии.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ДанныеОЛицензии - Структура - данные о лицензии:
//   * ИдентификаторУслуги - Строка - идентификатор услуги.
//   * ИдентификаторПоставщика - Строка - идентификатор поставщика.
//   * ИмяЛицензии - Строка - имя лицензии.
//   * КонтекстЛицензии - Строка - контекст лицензии.
//  ЛицензияАктивирована - Булево - активирована лицензия или деактивирована.
//
Процедура ПриИзмененииСостоянияАктивацииЛицензии(ДанныеОЛицензии, ЛицензияАктивирована) Экспорт
	
	ТарификацияУНФ.ПриИзмененииСостоянияАктивацииЛицензии(ДанныеОЛицензии, ЛицензияАктивирована);
	ТарификацияБизнес.ПриИзмененииСостоянияАктивацииЛицензии(ДанныеОЛицензии, ЛицензияАктивирована);
	
КонецПроцедуры

// Событие, которое вызывается при обновлении доступных лицензий.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ПараметрыЛицензии - Структура:
//   * ИдентификаторПодписки - УникальныйИдентификатор - внутренний идентификатор подписки.
//   * ИдентификаторУслуги - Строка - идентификатор услуги.
//   * ИдентификаторПоставщика - Строка - идентификатор поставщика.
//   * ДатаНачалаДействия - Дата - дата начала действия подписки.
//   * ДатаОкончанияДействия - Дата - дата окончания действия подписки.
//   * КоличествоЛицензий - Число - количество лицензий.
//   * НомерПодписки - Строка - номер подписки.
//   * ДатаИзменения - Дата - дата изменения.
//
//@skip-check module-empty-method
Процедура ПриОбновленииДоступныхЛицензий(ПараметрыЛицензии) Экспорт
	
	СписокТаблиц = ТарификацияБизнес.ПолучитьТаблицыДоступныхИИзмененных();
	
	ТарификацияУНФ.ПриОбновленииДоступныхЛицензий(ПараметрыЛицензии);
	ТарификацияБизнес.ПриОбновленииДоступныхЛицензий(ПараметрыЛицензии);   
	
	Облачная1СО.ПриОбновленииДоступныхЛицензий(ПараметрыЛицензии);

	ТарификацияБизнес.ОбработатьНастройкиЕБВ(СписокТаблиц);
	
КонецПроцедуры

// Событие, которое вызывается при удалении доступных лицензий.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ПараметрыЛицензии - Структура:
//   * ИдентификаторПодписки - УникальныйИдентификатор - внутренний идентификатор подписки.
//   * ИдентификаторУслуги - Строка - идентификатор услуги.
//   * ИдентификаторПоставщика - Строка - идентификатор поставщика.
//   * ДатаНачалаДействия - Дата - дата начала действия подписки.
//   * ДатаОкончанияДействия - Дата - дата окончания действия подписки.
//   * КоличествоЛицензий - Число - количество лицензий.
//   * НомерПодписки - Строка - номер подписки.
//   * ДатаИзменения - Дата - дата изменения.
//   * ДоступнаПослеУдаления - Булево - Истина, если лицензия доступна в рамках другой подписки
//
//@skip-check module-empty-method
Процедура ПриУдаленииДоступныхЛицензий(ПараметрыЛицензии) Экспорт
	
	СписокТаблиц = ТарификацияБизнес.ПолучитьТаблицыДоступныхИИзмененных();
	
	ТарификацияУНФ.ПриУдаленииДоступныхЛицензий(ПараметрыЛицензии);
	ТарификацияБизнес.ПриУдаленииДоступныхЛицензий(ПараметрыЛицензии);  
	
	Облачная1СО.ПриУдаленииДоступныхЛицензий(ПараметрыЛицензии);

	ТарификацияБизнес.ОбработатьНастройкиЕБВ(СписокТаблиц);
	
КонецПроцедуры

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. См. ТарификацияУНФ.ПриДобавленииПараметровРаботыКлиентаПриЗапуске
Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	ТарификацияУНФ.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
	
КонецПроцедуры

// Устарела. См. ТарификацияУНФ.ВыполнитьАктивациюЛицензииКоличествоКасс
Процедура ВыполнитьАктивациюЛицензииКоличествоКасс(ИмяЛицензии, ЛицензияАктивирована) Экспорт
	
	ТарификацияУНФ.ВыполнитьАктивациюЛицензииКоличествоКасс(ИмяЛицензии, ЛицензияАктивирована);
	
КонецПроцедуры

// Устарела. Будет удалена в следующей версии программы.
// Возвращаемое значение:
//   См. ТарификацияУНФ.ОграничениеКоличествоКассПоТарифу
Функция ОграничениеКоличествоКассПоТарифу() Экспорт
	
	Возврат ТарификацияУНФ.ОграничениеКоличествоКассПоТарифу();
	
КонецФункции

// Устарела. Будет удалена в следующей версии программы.
// Возвращаемое значение:
//   См. ТарификацияУНФ.ОтменаРегистрацииКассыНаСервереТарификации
Функция ОтменаРегистрацииКассыНаСервереТарификации(ИдентификаторЛицензии, УдалениеОбъекта = Истина,
	ОтменитьДляВсехОбластей = Ложь, КодОбластиДанных = 0) Экспорт
	
	Возврат ТарификацияУНФ.ОтменаРегистрацииКассыНаСервереТарификации(ИдентификаторЛицензии, УдалениеОбъекта,
		ОтменитьДляВсехОбластей, КодОбластиДанных)
	
КонецФункции

// Устарела. Будет удалена в следующей версии программы.
// Возвращаемое значение:
//  Строка - см. ТарификацияУНФ.СсылкаНаЛичныйКабинетАбонента
Функция СсылкаНаЛичныйКабинетАбонента() Экспорт
	
	Возврат ТарификацияУНФ.СсылкаНаЛичныйКабинетАбонента();
	
КонецФункции

// Устарела. Будет удалена в следующей версии программы.
// Возвращаемое значение:
//  Булево - см. ТарификацияУНФ.ПодключениеКассыПоТарифу
Функция ПодключениеКассыПоТарифу(ИдентификаторЛицензии) Экспорт
	
	Возврат ТарификацияУНФ.ПодключениеКассыПоТарифу(ИдентификаторЛицензии);
	
КонецФункции

#КонецОбласти

