#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		Если ТипДанныхЗаполнения = Тип("Структура")
		   И ДанныеЗаполнения.Свойство("Основание")
		   И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Основание.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения.Основание;
		ИначеЕсли ТипДанныхЗаполнения <> Тип("Структура")
		        И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения;
		КонецЕсли;
		
		ЗаполнитьПоДокументуОснованию(ДокументОснование);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКонтрагентов") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорКонтрагента");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ДОПП Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ДокументПартии");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КодВидаТранспорта");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КоличествоПоТНВЭД");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.СтранаПроисхождения");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.СтавкаНДС");
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ДатаВвоза");
		МассивНепроверяемыхРеквизитов.Добавить("Перевозчик");
		МассивНепроверяемыхРеквизитов.Добавить("РегистрационныйЗнак");
		МассивНепроверяемыхРеквизитов.Добавить("ОсобыйПризнакДОПП");
		МассивНепроверяемыхРеквизитов.Добавить("ОсобыйПризнакЗаявителя");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ОсобыйПризнакДОПП");
	КонецЕсли;
	
	ПлательщикНДС              = УчетнаяПолитика.ПлательщикНДС(Организация, Дата)
		ИЛИ УчетнаяПолитика.ПлательщикНДСНаУСНСВычетами(Организация, Дата);
	ВедетсяПростойУчетЕНП      = Истина;
	
	ДатаДекларирования    = '00010101'; // для проверки того, что товары в документе ввезены в одном месяце
	Для Каждого Строка Из Товары Цикл
		
		Префикс = "Объект.Товары[%1].";
		Префикс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				Префикс, Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ="));
				
	    Если Строка.СуммаНДС <> 0
			И НЕ ЗначениеЗаполнено(Строка.СтавкаНДС) Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Заполнение",
				НСтр("ru='% НДС'"),
				Строка.НомерСтроки,
				НСтр("ru='Товары, ввозимые из стран Таможенного Союза'"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Префикс + "СтавкаНДС", , Отказ);
			
		КонецЕсли;
		
		Если ВедетсяПростойУчетЕНП Тогда
			ПервыйДеньМесяцаПринятияНаУчет = НачалоМесяца(Строка.ДатаПринятияНаУчет);
			Если Не ЗначениеЗаполнено(ДатаДекларирования) Тогда
				ДатаДекларирования = ПервыйДеньМесяцаПринятияНаУчет;
				Продолжить;
			КонецЕсли;
			
			Если ПервыйДеньМесяцаПринятияНаУчет <> ДатаДекларирования Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Колонка",
					"Корректность",
					НСтр("ru='Документ партии'"),
					Строка.НомерСтроки,
					НСтр("ru='Товары, ввозимые из стран Таможенного Союза'"),
					НСтр("ru='В документ следует включать партии товаров, принятые на учет в одном месяце.'"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Префикс + "ДокументПартии", , Отказ);
			КонецЕсли;
			
			Если Строка.ПодакцизныйТовар И ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ЗаявлениеОВвозе
				И Строка.СуммаАкциза <> 0 И Не ЗначениеЗаполнено(Строка.СчетАкциза) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнен ""Счет акциза""'");

				Поле = "Товары[" + Формат(Строка.НомерСтроки - 1, "ЧГ=") + "].СчетАкциза";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.ЗаявлениеОВвозеТоваров.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	// Начисление НДС
	УчетНДС.СформироватьДвиженияВвозТоваровИзТаможенногоСоюза(
		ПараметрыПроведения.ТаблицаНачисленияНДС,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей.
	ПроведениеДокументовУНФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Окр(Товары.Итог("СуммаНДС"));
	
	Если ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ДОПП Тогда
		СуммаДокумента = Окр(Товары.Итог("ОбеспечительныйПлатеж"));
	Иначе
		СуммаДокумента = Окр(Товары.Итог("СуммаНДС")) + Окр(Товары.Итог("СуммаАкциза"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ЗаявлениеОВвозе;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоДокументуОснованию(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходнаяНакладная")
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Если Не Основание.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика
			И Не Основание.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию 
			И Не Основание.ВидОперации = Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаЗакупку Тогда
			Возврат;
		КонецЕсли;

		ДанныеОбъекта = Новый Структура("Дата, Организация, ВалютаДокумента");
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ЭтотОбъект);
		ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ЗаявлениеОВвозе;

		ДанныеОбъекта.Вставить("ВалютаРегламентированногоУчета",
			УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту());
		ДанныеОбъекта.Вставить("ВалютаДолларыСША", Справочники.Валюты.НайтиПоКоду("840"));

		ТоварыПоДаннымПоступления = Документы.ЗаявлениеОВвозеТоваров.ТоварыПоДаннымПоступления(ДанныеОбъекта, Основание);

		Если ТоварыПоДаннымПоступления.Количество() > 0 Тогда
			Товары.Загрузить(ТоварыПоДаннымПоступления);
		КонецЕсли;

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда

		ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ДОПП;

		ДатаВвоза = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Дата");
		ДанныеОбъекта = Новый Структура("Дата,Организация,ВалютаДокумента,ДатаВвоза,ОсобыйПризнакЗаявителя");
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ЭтотОбъект);
		ДанныеОбъекта.Вставить("ВалютаРегламентированногоУчета",
			УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту());

		ТоварыПоСчетуПоставщика = Документы.ЗаявлениеОВвозеТоваров.ТоварыПоСчетуПоставщика(ДанныеОбъекта, Основание);

		Если ТоварыПоСчетуПоставщика.Количество() > 0 Тогда
			Товары.Загрузить(ТоварыПоСчетуПоставщика);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли



