#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьЭлементовДляИнтерфейса85();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СервисПровайдерыСУЗ" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзСУЗ(Команда)

	ОткрытьФорму("Справочник.СервисПровайдерыСУЗ.Форма.ФормаЗагрузкаИзСУЗ", , ЭтаФорма, УникальныйИдентификатор);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовДляИнтерфейса85()
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85();
	ИнтеграцияИС.УстановитьВидимостьЭлементовТакси85(ЭтотОбъект);
	ОтображатьКоманднуюПанель = ЭтоИнтерфейс85;
	Элементы.СписокСоздать.Видимость = Не ЭтоИнтерфейс85;
	Элементы.СписокСкопировать.Видимость = Не ЭтоИнтерфейс85;
	
КонецПроцедуры

#КонецОбласти