#Область ПрограммныйИнтерфейс

// Отображение результата проверки контрагента в справочнике.
// Реализация тела метода является обязательной.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма справочника, в котором выполнялась проверка контрагента.
//  	Результат проверки хранится в реквизите РеквизитыПроверкиКонтрагентов(Структура) формы контрагента.
//  	Структуру полей РеквизитыПроверкиКонтрагентов см. в процедуре ИнициализироватьРеквизитыФормыКонтрагент ОМ
//  	ПроверкаКонтрагентов.
//  ПредставлениеРезультатаПроверки	 - ФорматированнаяСтрока, Строка - представление результата проверки
//  					контрагента.
//
//@skip-warning
Процедура ОтобразитьРезультатПроверкиКонтрагентаВСправочнике(Форма, ПредставлениеРезультатаПроверки) Экспорт
	
	ПроверяемыеСостояния = Новый Массив;
	ПроверяемыеСостояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.НеДействуетИлиИзмененКПП"));
	ПроверяемыеСостояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.КонтрагентОтсутствуетВБазеФНС"));
	ПроверяемыеСостояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.КППНеСоответствуетДаннымБазыФНС"));
	
	Если ПроверяемыеСостояния.Найти(Форма.РеквизитыПроверкиКонтрагентов.СостояниеКонтрагента) <> Неопределено Тогда
		Форма.ПредставлениеРезультатПроверкиКонтрагента = ПредставлениеРезультатаПроверки;
	Иначе
		Форма.ПредставлениеРезультатПроверкиКонтрагента = Неопределено;
	КонецЕсли;
	
	СформироватьПредставлениеПроверкиДанных(Форма);
	
КонецПроцедуры

// Получение объекта (ДанныеФормыСтруктура) и ссылки(ДокументСсылка, СправочникСсылка) документа или
// справочника,  в котором выполняется проверка контрагента, по форме.
// Обязательна к заполнению.
//
// Параметры:
//	Форма     - ФормаКлиентскогоПриложения - Форма документа или справочника, в котором выполняется проверка контрагента.
//	Результат - Структура - Объект и Ссылка, полученные по форме документа.
//		Ключи: "Объект" (Тип ДанныеФормыСтруктура) и "Ссылка" (Тип ДокументСсылка, СправочникСсылка).
//
//@skip-warning
Процедура ПриОпределенииОбъектаИСсылкиПоФорме(Форма, Результат) Экспорт
	
	ИсточникОбъект = Форма.Объект;
	ИсточникСсылка = ИсточникОбъект.Ссылка;
	
	Результат.Вставить("Объект", ИсточникОбъект);
	Результат.Вставить("Ссылка", ИсточникСсылка);
	
КонецПроцедуры

// Возвращает представление результата проверки контрагента
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма справочника, в котором выполнялась проверка контрагента.
//
// Возвращаемое значение:
//  ПредставлениеРезультатаПроверки	 - ФорматированнаяСтрока, Строка - представление результата проверки контрагента.
//
Процедура СформироватьПредставлениеПроверкиДанных(Форма) Экспорт
	
	Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
		ОтобразитьПредставленияВсехПроверокНаПолнойФорме(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлементаБыстрая" Тогда
		ОтобразитьПредставленияВсехПроверокНаУпрощеннойФорме(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтобразитьПредставленияВсехПроверокНаПолнойФорме(Форма)
	
	Элементы = Форма.Элементы;
	
	ПоказатьПроверкуКонтрагентаВСервисе = 
	ПустаяСтрока(Форма.ПредставлениеПроверкиИНН)
	И ПустаяСтрока(Форма.ПредставлениеПроверкиКПП)
	И НЕ ПустаяСтрока(Форма.ПредставлениеРезультатПроверкиКонтрагента);
	
	Если ПоказатьПроверкуКонтрагентаВСервисе Тогда
		Элементы.ПредставлениеРезультатПроверкиКонтрагента.Заголовок = Форма.ПредставлениеРезультатПроверкиКонтрагента;
		Элементы.ПредставлениеРезультатПроверкиКонтрагента1.Заголовок = Форма.ПредставлениеРезультатПроверкиКонтрагента;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Форма.ПредставлениеПроверкиИНН) Тогда
		Элементы.ПредставлениеПроверкиИНН.Заголовок = Форма.ПредставлениеПроверкиИНН;
		Элементы.ПредставлениеПроверкиИНН1.Заголовок = Форма.ПредставлениеПроверкиИНН;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Форма.ПредставлениеПроверкиКПП) Тогда
		Элементы.ПредставлениеПроверкиКПП.Заголовок = Форма.ПредставлениеПроверкиКПП;
		Элементы.ПредставлениеПроверкиКПП1.Заголовок = Форма.ПредставлениеПроверкиКПП;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Форма.ПредставлениеПроверкиОКПО) Тогда
		Элементы.ПредставлениеПроверкиОКПО.Заголовок = Форма.ПредставлениеПроверкиОКПО;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Форма.ПредставлениеПроверкиОГРН) Тогда
		Элементы.ПредставлениеПроверкиОГРН.Заголовок = Форма.ПредставлениеПроверкиОГРН;
		Элементы.ПредставлениеПроверкиОГРН1.Заголовок = Форма.ПредставлениеПроверкиОГРН;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Форма.ПредставлениеПроверкиДублей) Тогда
		Элементы.ПредставлениеПроверкиДублей.Заголовок = Форма.ПредставлениеПроверкиДублей;
		Элементы.ПредставлениеПроверкиДублей1.Заголовок = Форма.ПредставлениеПроверкиДублей;
		Элементы.ПредставлениеПроверкиДублейИНН.Заголовок = Форма.ПредставлениеПроверкиДублей;
		Элементы.ПредставлениеПроверкиДублейИНН1.Заголовок = Форма.ПредставлениеПроверкиДублей;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Форма.ПредставлениеПроверкиИНН) Или Не ПустаяСтрока(Форма.ПредставлениеПроверкиКПП)
		Или Не ПустаяСтрока(Форма.ПредставлениеПроверкиОКПО) Или Не ПустаяСтрока(Форма.ПредставлениеПроверкиОГРН) Тогда
		Элементы.СтраницаЮридическиеДанные.Картинка = БиблиотекаКартинок.ПредупреждениеБаннерЦветной16ВТакси;
	Иначе
		Элементы.СтраницаЮридическиеДанные.Картинка = Новый Картинка;
	КонецЕсли;
	
	Элементы.ПредставлениеРезультатПроверкиКонтрагента.Видимость = ПоказатьПроверкуКонтрагентаВСервисе;
	Элементы.ПредставлениеПроверкиИНН.Видимость = Не ПустаяСтрока(Форма.ПредставлениеПроверкиИНН);
	Элементы.ПредставлениеПроверкиКПП.Видимость = Не ПустаяСтрока(Форма.ПредставлениеПроверкиКПП);
	Элементы.ПредставлениеПроверкиОКПО.Видимость = Не ПустаяСтрока(Форма.ПредставлениеПроверкиОКПО);
	Элементы.ПредставлениеПроверкиОГРН.Видимость = Не ПустаяСтрока(Форма.ПредставлениеПроверкиОГРН);
	
	ДублиНайденыПоКПП = СтрНайти(Форма.ПредставлениеПроверкиДублей, НСтр("ru = 'КПП'"));
	Элементы.ПредставлениеПроверкиДублей.Видимость = Не ПустаяСтрока(Форма.ПредставлениеПроверкиДублей) И ДублиНайденыПоКПП;
	Элементы.ПредставлениеПроверкиДублейИНН.Видимость = Не ПустаяСтрока(Форма.ПредставлениеПроверкиДублей) И Не ДублиНайденыПоКПП;
	
	Элементы.ПредставлениеРезультатПроверкиКонтрагента1.Видимость = Элементы.ПредставлениеРезультатПроверкиКонтрагента.Видимость;
	Элементы.ПредставлениеПроверкиИНН1.Видимость = Элементы.ПредставлениеПроверкиИНН.Видимость;
	Элементы.ПредставлениеПроверкиКПП1.Видимость = Элементы.ПредставлениеПроверкиКПП.Видимость;
	Элементы.ПредставлениеПроверкиОГРН1.Видимость = Элементы.ПредставлениеПроверкиОГРН.Видимость;
	Элементы.ПредставлениеПроверкиДублей1.Видимость = Элементы.ПредставлениеПроверкиДублей.Видимость;
	Элементы.ПредставлениеПроверкиДублейИНН1.Видимость = Элементы.ПредставлениеПроверкиДублейИНН.Видимость;
	
	Элементы.ГруппаПодсказкаИНН.Видимость = Элементы.ПредставлениеПроверкиИНН.Видимость Или Элементы.ПредставлениеПроверкиДублейИНН.Видимость;
	Элементы.ГруппаПодсказкаКПП.Видимость = Элементы.ПредставлениеПроверкиКПП.Видимость;
	Элементы.ГруппаПодсказкаКодПоОКПО.Видимость = Элементы.ПредставлениеПроверкиОКПО.Видимость;
	Элементы.ГруппаПодсказкаРегистрационныйНомер.Видимость = Элементы.ПредставлениеПроверкиОГРН.Видимость;
	Элементы.ГруппаПодсказкаИННиКПП.Видимость = Элементы.ПредставлениеПроверкиДублей.Видимость;
	Элементы.ГруппаПодсказкаИНН1.Видимость = Элементы.ПредставлениеПроверкиИНН1.Видимость Или Элементы.ПредставлениеПроверкиДублейИНН1.Видимость;
	Элементы.ГруппаПодсказкаКПП1.Видимость = Элементы.ПредставлениеПроверкиКПП1.Видимость;
	Элементы.ГруппаПодсказкаРегистрационныйНомер1.Видимость = Элементы.ПредставлениеПроверкиОГРН1.Видимость;
	Элементы.ГруппаПодсказкаЮрДанныеНаГлавной.Видимость = Элементы.ПредставлениеПроверкиДублей1.Видимость;
	
КонецПроцедуры

Процедура ОтобразитьПредставленияВсехПроверокНаУпрощеннойФорме(Форма)
	
	Элементы = Форма.Элементы;
	
	ПоказатьПроверкуКонтрагентаВСервисе = 
	ПустаяСтрока(Форма.ПредставлениеПроверкиИНН)
	И ПустаяСтрока(Форма.ПредставлениеПроверкиКПП)
	И НЕ ПустаяСтрока(Форма.ПредставлениеРезультатПроверкиКонтрагента);
	
	Если ПоказатьПроверкуКонтрагентаВСервисе Тогда
		Элементы.ПредставлениеРезультатПроверкиКонтрагента.Заголовок = Форма.ПредставлениеРезультатПроверкиКонтрагента;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Форма.ПредставлениеПроверкиИНН) Тогда
		Элементы.ПредставлениеПроверкиИНН.Заголовок = Форма.ПредставлениеПроверкиИНН;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Форма.ПредставлениеПроверкиКПП) Тогда
		Элементы.ПредставлениеПроверкиКПП.Заголовок = Форма.ПредставлениеПроверкиКПП;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Форма.ПредставлениеПроверкиДублей) Тогда
		Элементы.ПредставлениеПроверкиДублей.Заголовок = Форма.ПредставлениеПроверкиДублей;
		Элементы.ПредставлениеПроверкиДублейИНН.Заголовок = Форма.ПредставлениеПроверкиДублей;
	КонецЕсли;
	
	Элементы.ПредставлениеРезультатПроверкиКонтрагента.Видимость = ПоказатьПроверкуКонтрагентаВСервисе;
	Элементы.ПредставлениеПроверкиИНН.Видимость = Не ПустаяСтрока(Форма.ПредставлениеПроверкиИНН);
	Элементы.ПредставлениеПроверкиКПП.Видимость = Не ПустаяСтрока(Форма.ПредставлениеПроверкиКПП);
	
	ДублиНайденыПоКПП = СтрНайти(Форма.ПредставлениеПроверкиДублей, НСтр("ru = 'КПП'"));
	Элементы.ПредставлениеПроверкиДублей.Видимость = Не ПустаяСтрока(Форма.ПредставлениеПроверкиДублей) И ДублиНайденыПоКПП;
	Элементы.ПредставлениеПроверкиДублейИНН.Видимость = Не ПустаяСтрока(Форма.ПредставлениеПроверкиДублей) И Не ДублиНайденыПоКПП;
	
	Элементы.ГруппаПодсказкаИНН.Видимость = Элементы.ПредставлениеПроверкиИНН.Видимость Или Элементы.ПредставлениеПроверкиДублейИНН.Видимость;
	Элементы.ГруппаПодсказкаКПП.Видимость = Элементы.ПредставлениеПроверкиКПП.Видимость;
	Элементы.ГруппаПодсказкаИННиКПП.Видимость = Элементы.ПредставлениеПроверкиДублей.Видимость;
	
КонецПроцедуры

#КонецОбласти
