

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Только номенклатуру(0); Номенклатуру и ее характеристики(1);
	ИспользоватьХарактеристики = ?(Параметры.ХарактеристикиВидны = Истина, 1, 0);
	Если Параметры.Свойство("ПоказыватьНедействительныеХарактеристики") Тогда
		ПоказыватьНедействительныеХарактеристики = Параметры.ПоказыватьНедействительныеХарактеристики;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		// Обход ошибки платформы 30163126
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияКартинка", "Ширина", 2);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияКартинка", "Высота", 0);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   


#Область СобытияРеквизитовФормы

#КонецОбласти

#Область ОбработчикиКоманд  

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Новый Структура; 
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина); 
	
	ОповещениеОЗакрытие = Новый ОписаниеОповещения("ПослеВыбораЦеновыхГруппЗакрытие", ЭтотОбъект);
	ОткрытьФорму("Справочник.ЦеновыеГруппы.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытие);  
	
КонецПроцедуры    
	
&НаКлиенте
Процедура Выбрать(Команда)
	
	АдресВременногоХранилища = "";
	ЗаписатьВХранилищеДанныеТабличнойЧасти(АдресВременногоХранилища);
	
	Если ПустаяСтрока(АдресВременногоХранилища) Тогда
		
		ВывестиСообщениеОНеправильномВыборе();
		
	Иначе
		
		Закрыть(Новый Структура("ВыборПроизведен, АдресВременногоХранилища", Истина, АдресВременногоХранилища));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	
	Если ЦеновыеГруппы.Количество() > 0 Тогда
		
		ПоказатьОтчетСПредварительнымРезультатом();
		
	Иначе
		
		ВывестиСообщениеОНеправильномВыборе();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ПослеВыбораЦеновыхГруппЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ОбработатьРезультатВыбораНаСервере(Результат);
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ОбработатьРезультатВыбораНаСервере(Результат)
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда 
		
		Для Каждого ЭлементМассива Из Результат Цикл 
			
			НоваяСтрокаТЗ = ЦеновыеГруппы.Добавить();
			НоваяСтрокаТЗ.ЦеноваяГруппа = ЭлементМассива;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда 
		
		НоваяСтрокаТЗ = ЦеновыеГруппы.Добавить();
		НоваяСтрокаТЗ.ЦеноваяГруппа = Результат;  
		
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервере
Функция ПолучитьВыбранныеЦеновыеГруппы()
	
	МассивЦеновыхГрупп = ЦеновыеГруппы.Выгрузить().ВыгрузитьКолонку("ЦеноваяГруппа");
	
	Возврат МассивЦеновыхГрупп;
	
КонецФункции

&НаСервере
Процедура ПолучитьНоменклатуру(АдресВременногоХранилища)
	
	МассивЦеновыхГрупп = ПолучитьВыбранныеЦеновыеГруппы();
	Если МассивЦеновыхГрупп.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДеревоНоменклатуры = Новый ДеревоЗначений;
	
	// 1. Получим СКД
	ИмяСхемыКД = "ПоЦеновымГруппам";
	СхемаКомпоновкиДанных = Документы.УстановкаЦенНоменклатуры.ПолучитьМакет(ИмяСхемыКД);
	
	// 2. создаем настройки для схемы 
	НастройкиКомпоновкиДанных = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	// 2.1 установим значения параметров
	ПараметрКД = СхемаКомпоновкиДанных.Параметры.Найти("МассивЦеновыхГрупп");
	ПараметрКД.Значение = МассивЦеновыхГрупп;
	
	Если ИспользоватьХарактеристики = 0 Тогда
		
		НастройкиКомпоновкиДанных.Структура[0].Структура[0].Использование = Ложь;
		
	КонецЕсли;
	
	// 3. готовим макет 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// 4. исполняем макет 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	ПроцессорКомпоновки.Сбросить();
	
	// 5. выводим результат 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДеревоНоменклатуры);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	СтруктураТаблицДанных = Документы.УстановкаЦенНоменклатуры.РазобратьДеревоНоменклатуры(ДеревоНоменклатуры, ПоказыватьНедействительныеХарактеристики);
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(СтруктураТаблицДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчетСПредварительнымРезультатом()
	
	МассивЦеновыхГрупп = ПолучитьВыбранныеЦеновыеГруппы();
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ИмяСКД", "ПоЦеновымГруппам");
	ПараметрыОткрытия.Вставить("МассивЦеновыхГрупп", МассивЦеновыхГрупп);
	ПараметрыОткрытия.Вставить("ИспользоватьХарактеристики", ИспользоватьХарактеристики);
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаПредварительногоПросмотра", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВХранилищеДанныеТабличнойЧасти(АдресВременногоХранилища)
	
	ПолучитьНоменклатуру(АдресВременногоХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокиРекурсивно(Строки, ЗначениеОтметки)
	
	Для каждого СтрокаЦеновойГруппы Из Строки Цикл
		
		СтрокаЦеновойГруппы.Отметка = ЗначениеОтметки;
		ОбработатьСтрокиРекурсивно(СтрокаЦеновойГруппы.ПолучитьЭлементы(), ЗначениеОтметки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСообщениеОНеправильномВыборе()
	
	ТекстСообщения = НСтр("ru ='Необходимо отметить ценовые группы'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ЦеновыеГруппы");
	
КонецПроцедуры


#КонецОбласти
