
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	СохранитьГлобальныеНастройки();
	
	АдресТаблицыУчастников = Неопределено;
	Параметры.Свойство("АдресТаблицыУчастников", АдресТаблицыУчастников);
	Если АдресТаблицыУчастников = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуПолучателей(АдресТаблицыУчастников, Отказ);
	
	Заголовок = СтрШаблон(НСтр("ru = 'Получатели: %1'"), ТаблицаПолучателей.Количество());
	
	ОбновитьОтображениеКомандСтроки();
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Контрагент"
		Или ИмяСобытия = "Запись_КонтактноеЛицо"
		Или ИмяСобытия = РаботаСЛидамиКлиентСервер.КлючОповещения() Тогда
		
		ОбработатьСозданиеКонтакта(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПолучателей

&НаКлиенте
Процедура ТаблицаПолучателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаДанных = ТаблицаПолучателей.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ЗначениеЗаполнено(СтрокаДанных.КонтактCRM) Тогда
		ПоказатьЗначение(, СтрокаДанных.КонтактCRM);
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = Элементы.ТаблицаПолучателейСохранитьВCRM.Имя И ЭтоТакси Тогда
		ПоказатьМенюСозданияКонтакта(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПолучателейПриНаведении(Элемент, Строка, Поле)
	
	Если Строка = Неопределено Тогда
		Если ТипЗнч(Элемент.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Возврат;
		КонецЕсли;
		ДанныеСтроки = Элемент.ТекущиеДанные;
	ИначеЕсли ТипЗнч(Строка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	Иначе
		ДанныеСтроки = ТаблицаПолучателей.НайтиПоИдентификатору(Строка);
	КонецЕсли;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтактСтрокой = СокрЛП(ДанныеСтроки.КонтактСтрокой);
	
	Элементы.ПодменюСоздатьВCRM.Доступность =
	Не ЗначениеЗаполнено(ДанныеСтроки.КонтактCRM) И ЗначениеЗаполнено(КонтактСтрокой) И КонтактСтрокой <> "<>";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьКонтрагента(Команда)
	СоздатьКлиента("Контрагент");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛид(Команда)
	СоздатьКлиента("Лид");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтакт(Команда)
	СоздатьКлиента("Контакт");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтображениеКомандСтроки()
	
	Если Не ЭтоТакси Тогда
		
		ЕстьНесохраненныеКлиенты = Ложь;
		Для Каждого СтрокаТЗ Из ТаблицаПолучателей Цикл
			Если Не ЗначениеЗаполнено(СтрокаТЗ.КонтактCRM) Тогда
				
				ЕстьНесохраненныеКлиенты = Истина;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
		
		Элементы.ПодменюСоздатьВCRM.Видимость = ЕстьНесохраненныеКлиенты;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПолучателей(АдресХранилища, Отказ)
	
	ПолученнаяТаблицаКонтактов = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(ПолученнаяТаблицаКонтактов) <> Тип("ТаблицаЗначений") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПолученнаяТаблицаКонтактов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПолученнаяТаблицаКонтактов[0].Контакт) = Тип("СправочникСсылка.АдресатыПисем") Тогда
		Если ЭтоТакси Тогда
			
			Элементы.ТаблицаПолучателейСохранитьВCRM.Видимость = Истина;
			
		КонецЕсли;
	Иначе
		УсловноеОформление.Элементы.Очистить();
	КонецЕсли;
	
	Если ПолученнаяТаблицаКонтактов.Колонки.Найти("ИндексКартинки") = Неопределено Тогда
		ПолученнаяТаблицаКонтактов.Колонки.Добавить("ИндексКартинки", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	Для Каждого Получатель Из ПолученнаяТаблицаКонтактов Цикл
		
		НовыйПолучатель = ТаблицаПолучателей.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйПолучатель, Получатель, , "КонтактСтрокой");
		
		НовыйПолучатель.КонтактСтрокой = СтрШаблон("%1 <%2>", Получатель.КонтактСтрокой, Получатель.КакСвязаться);
		
		Важность = ЭлектроннаяПочтаУНФ.ВажностьОтображенияКонтакта(НовыйПолучатель.КонтактCRM);
		НовыйПолучатель.Важность = Важность;
		
		Если Не ЗначениеЗаполнено(Получатель.КонтактCRM) Тогда
			НовыйПолучатель.СохранитьВCRM = НСтр("ru = 'Сохранить в CRM'");
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаПолучателей.Сортировать("Важность Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМенюСозданияКонтакта(Элемент)
	
	ПараметрыДляПередачи = Новый Структура;
	ПараметрыДляПередачи.Вставить("Элемент", Элемент);
	ПараметрыДляПередачи.Вставить("Форма", ЭтотОбъект);
	
	ЭлектроннаяПочтаУНФКлиент.ПоказатьМенюСозданияКонтакта(ПараметрыДляПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСозданиеКонтакта(ПараметрыПослеЗаписи)
	
	ТипПараметров = ТипЗнч(ПараметрыПослеЗаписи);
	Ссылка = Неопределено;
	
	Если ТипПараметров = Тип("СправочникСсылка.Контрагенты") Или ТипПараметров = Тип("СправочникСсылка.Лиды") Тогда
		Ссылка = ПараметрыПослеЗаписи;
	ИначеЕсли ТипПараметров = Тип("Структура") Тогда
		
		Контакт = Неопределено;
		Если ПараметрыПослеЗаписи.Свойство("КонтактноеЛицо", Контакт) Тогда
			Ссылка = Контакт;
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКонтакта = ДанныеКонтакта(Ссылка);
	
	СтруктураДляПоиска = Новый Структура("КакСвязаться", ДанныеКонтакта.КакСвязаться);
	Строки = ТаблицаПолучателей.НайтиСтроки(СтруктураДляПоиска);
	
	Для Каждого Строка Из Строки Цикл
		ЗаполнитьЗначенияСвойств(Строка, ДанныеКонтакта);
		Строка.СохранитьВCRM = "";
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеКонтакта(Знач Ссылка)
	
	ДанныеКонтакта = Новый Структура;
	
	ТипКонтакта = ТипЗнч(Ссылка);
	
	Если ТипКонтакта = Тип("СправочникСсылка.Контрагенты") Тогда
		ПоляКонтакта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Представление, АдресЭПДляПоиска, ВидКонтрагента");
	ИначеЕсли ТипКонтакта = Тип("СправочникСсылка.Лиды") Тогда
		ПоляКонтакта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Представление, АдресЭПДляПоиска, Вид");
	Иначе
		ПоляКонтакта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Представление, АдресЭПДляПоиска");
	КонецЕсли;
	
	ДанныеКонтакта.Вставить("КонтактCRM", Ссылка);
	КонтактСтрокой = СтрШаблон("%1 <%2>", ПоляКонтакта.Представление, ПоляКонтакта.АдресЭПДляПоиска);
	ДанныеКонтакта.Вставить("КонтактСтрокой", КонтактСтрокой);
	ДанныеКонтакта.Вставить("КакСвязаться", ПоляКонтакта.АдресЭПДляПоиска);
	ДанныеКонтакта.Вставить("Важность", ЭлектроннаяПочтаУНФ.ВажностьОтображенияКонтакта(Ссылка));
	
	Если ТипКонтакта = Тип("СправочникСсылка.Контрагенты") Тогда
		ИндексКартинки = ЭлектроннаяПочтаУНФ.НомерКартинкиУчастникаПоТипуКонтакта(Ссылка, ПоляКонтакта.ВидКонтрагента);
	ИначеЕсли ТипКонтакта = Тип("СправочникСсылка.Лиды") Тогда
		ИндексКартинки = ЭлектроннаяПочтаУНФ.НомерКартинкиУчастникаПоТипуКонтакта(Ссылка, ПоляКонтакта.Вид);
	Иначе
		ИндексКартинки = ЭлектроннаяПочтаУНФ.НомерКартинкиУчастникаПоТипуКонтакта(Ссылка, , 0);
	КонецЕсли;
	
	ДанныеКонтакта.Вставить("ИндексКартинки", ИндексКартинки);
	
	Возврат ДанныеКонтакта;
	
КонецФункции

&НаКлиенте
Процедура СоздатьКлиента(ТипКлиента)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Форма", ЭтотОбъект);
	ПараметрыФормы.Вставить("Элемент", Элементы.ТаблицаПолучателей);
	ПараметрыСозданияКлиента = ЭлектроннаяПочтаУНФКлиент.ПараметрыДляСозданияКонтакта(ПараметрыФормы);
	
	ВыборПользователя = Новый Структура("Значение", ТипКлиента);
	ЭлектроннаяПочтаУНФКлиент.СоздатьКонтактCRMНаОсновании(ВыборПользователя, ПараметрыСозданияКлиента);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьГлобальныеНастройки()
	
	Это85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ЭтоТакси = Не Это85;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "ТаблицаПолучателей.КонтактCRM", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ТаблицаПолучателейКонтактСтрокой.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
	НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Оранжевый);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Элементы.ПодменюСоздатьВCRM.Видимость = Не ЭтоТакси;
	
КонецПроцедуры

#КонецОбласти
