#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ТекстУсловий") Тогда
		ТекстУсловий = Параметры.ТекстУсловий;
	КонецЕсли;
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	Если Параметры.Свойство("Условия") Тогда
		Условия = Параметры.Условия;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Здесь можно отредактировать текст условий, который будет выведен в печатные формы текущего документа.'");
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.ТипСообщения = "Информация";
	ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Информация о форме'");
	ПараметрыСообщения.Сообщение = ТекстСообщения;
	ПараметрыСообщения.Скрываемый = Истина;
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);

	АдаптацияФормыТакси();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ТекстУсловий);
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьТекстУсловий(Команда)
	
	ТекстУсловий = ПолучитьТекстУсловийИзШаблона(Условия);
	 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.ФормаОК, Элементы.ГруппаКоманднаяПанельТакси);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстУсловийИзШаблона(Условия)
	
	Текст = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Условия, "ТекстУсловий");
	Возврат Текст;
	 
КонецФункции

#КонецОбласти