
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыОткрытия = Новый Структура;
	
	ВыделенныеСтроки = Элементы.Список.ПолучитьСтрокиДляОбработки();
	Если ВыделенныеСтроки.Количество() = 1 Тогда
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыделенныеСтроки[0]);
		
		ПараметрыОткрытия.Вставить("Маршрут", Неопределено);
		ПараметрыОткрытия.Вставить("ВидПоказателя", Неопределено);
		
		ДанныеСтроки.Свойство("Маршрут", ПараметрыОткрытия.Маршрут);
		ДанныеСтроки.Свойство("ВидПоказателя", ПараметрыОткрытия.ВидПоказателя);
		
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ПравилаМаршрутизацииЗаявок.Форма.ФормаЗаписи", ПараметрыОткрытия);
	
КонецПроцедуры

 #КонецОбласти