
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "ТекущееРабочееМесто") Тогда
		ТекущееРабочееМесто = Параметры.ТекущееРабочееМесто;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "МассивКасс") Тогда
		Для Каждого СтрокаМассива Из Параметры.МассивКасс Цикл
			НоваяСтрока = ТаблицаКассыККМ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "МассивЭквайринга") Тогда
		Для Каждого СтрокаМассива Из Параметры.МассивЭквайринга Цикл
			НоваяСтрока = ТаблицаЭквайринг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "ОткрытиеОборудования")
		И Параметры.ОткрытиеОборудования Тогда
		ОткрытиеОборудования = Параметры.ОткрытиеОборудования;
		НомерЭлемента = 0;
		Для Каждого СтрокаОборудование Из Параметры.МассивНастройкиОборудования Цикл
			НомерЭлемента = НомерЭлемента + 1;
			НоваяСтрока = ТаблицаОборудование.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОборудование);
			НоваяСтрока.НомерЭлемента = НомерЭлемента;
		КонецЦикла;
		
		Элементы.СтраницыНастройки.ТекущаяСтраница = Элементы.СтраницаНастройки;
		Элементы.ЗаписатьНастройки.Важность = ВажностьКнопки.Главная;
		ЗаполнитьДанныеФормы();
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "НастройкаККТ") Тогда
		НастройкаККТ = Параметры.НастройкаККТ;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "НастройкаЭквайринг") Тогда
		НастройкаЭквайринг = Параметры.НастройкаЭквайринг;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ОткрытиеОборудования Тогда
		ПереключательПриИзмененииНаКлиенте();
	ИначеЕсли НастройкаККТ
		Или НастройкаЭквайринг Тогда
		ПерейтиКСозданиюОборудованияКлиент();
	Иначе
		НастроитьЭлементыФормы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПараметрыОповещения = Новый Структура("ПодключенТерминал", ПодключенТерминал);
	Оповестить("ПодключениеОборудования", ПараметрыОповещения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура БольшеНастроек(Команда)
	ОбработчикЗавершение = Новый ОписаниеОповещения("ВыполнитьНастройкуОборудованияЗавершение", ЭтотОбъект);
	ИмяРеквизитаОборудование = СтрШаблон(НСтр("ru = 'ПодключаемоеОборудование_%1'"), НомерСтраницы);
	Если ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизитаОборудование]) Тогда
		МенеджерОборудованияРМККлиент.ВыполнитьНастройкуОборудования(ЭтотОбъект[ИмяРеквизитаОборудование], ОбработчикЗавершение);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Автонастройка(Команда)
	Оповещение = Новый ОписаниеОповещения("АвтонастройкаУстройстваЗавершение", ЭтотОбъект);
	ПараметрыУстройства = Новый Структура;
	СтрокиОборудования = ТаблицаОборудование.НайтиСтроки(Новый Структура("НомерЭлемента", НомерСтраницы));
	Если СтрокиОборудования.Количество() > 0 Тогда
		Для Каждого СтрокаПараметр Из СтрокиОборудования[0].ПараметрыСканера Цикл
			ПараметрыУстройства.Вставить(СтрокаПараметр.Представление, СтрокаПараметр.Значение);
		КонецЦикла;
		ИмяРеквизитаОборудование = СтрШаблон(НСтр("ru = 'ПодключаемоеОборудование_%1'"), НомерСтраницы);
		МенеджерОборудованияКлиент.НачатьАвтонастройкуУстройства(Оповещение, ЭтотОбъект[ИмяРеквизитаОборудование], ПараметрыУстройства);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	
	СтрокиОборудование = ТаблицаОборудование.НайтиСтроки(Новый Структура("НомерЭлемента", НомерСтраницы));
	ОборудованиеПодключено = Ложь;
	Если СтрокиОборудование.Количество() > 0 Тогда
		ОборудованиеПодключено = ЗначениеЗаполнено(СтрокиОборудование[0].ПодключаемоеОборудование);
	КонецЕсли;
	
	Если ОборудованиеПодключено Тогда
		ОбновнитьДанныеОборудованияНаКлиенте();
	Иначе
		СоздатьЭкземплярОборудования();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроизводительАтол(Команда)
	ИмяСтраницКасса = СтрШаблон(НСтр("ru = 'СтраницыКасса_%1'"), НомерСтраницы);
	ИмяСтраницаНастройкаККМ = СтрШаблон(НСтр("ru = 'СтраницаНастройкаККМ_%1'"), НомерСтраницы);
	
	ЭлементыСтраницы = Элементы.Найти(ИмяСтраницКасса);
	Если НЕ ЭлементыСтраницы = Неопределено Тогда
		ЭлементСтраница = Элементы.Найти(ИмяСтраницаНастройкаККМ);
		Если НЕ ЭлементыСтраницы = Неопределено Тогда
			ЭлементыСтраницы.ТекущаяСтраница = ЭлементСтраница;
		КонецЕсли;
	КонецЕсли;
	Производитель = НСтр("ru ='АТОЛ'");
	ЗаполнитьПараметрыКассы();
КонецПроцедуры

&НаКлиенте
Процедура ПроизводительВсе(Команда)
	ИмяСтраницКасса = СтрШаблон(НСтр("ru = 'СтраницыКасса_%1'"), НомерСтраницы);
	ИмяСтраницаНастройкаККМ = СтрШаблон(НСтр("ru = 'СтраницаНастройкаККМ_%1'"), НомерСтраницы);
	
	ЭлементыСтраницы = Элементы.Найти(ИмяСтраницКасса);
	Если НЕ ЭлементыСтраницы = Неопределено Тогда
		ЭлементСтраница = Элементы.Найти(ИмяСтраницаНастройкаККМ);
		Если НЕ ЭлементыСтраницы = Неопределено Тогда
			ЭлементыСтраницы.ТекущаяСтраница = ЭлементСтраница;
		КонецЕсли;
	КонецЕсли;
	Производитель = НСтр("ru =''");
	ЗаполнитьПараметрыКассы();
КонецПроцедуры

&НаКлиенте
Процедура ПроизводительДримкас(Команда)
	ИмяСтраницКасса = СтрШаблон(НСтр("ru = 'СтраницыКасса_%1'"), НомерСтраницы);
	ИмяСтраницаНастройкаККМ = СтрШаблон(НСтр("ru = 'СтраницаНастройкаККМ_%1'"), НомерСтраницы);
	
	ЭлементыСтраницы = Элементы.Найти(ИмяСтраницКасса);
	Если НЕ ЭлементыСтраницы = Неопределено Тогда
		ЭлементСтраница = Элементы.Найти(ИмяСтраницаНастройкаККМ);
		Если НЕ ЭлементыСтраницы = Неопределено Тогда
			ЭлементыСтраницы.ТекущаяСтраница = ЭлементСтраница;
		КонецЕсли;
	КонецЕсли;
	Производитель = НСтр("ru ='Дримкас'");
	ЗаполнитьПараметрыКассы();
КонецПроцедуры

&НаКлиенте
Процедура ПроизводительПосЦентр(Команда)
	ИмяСтраницКасса = СтрШаблон(НСтр("ru = 'СтраницыКасса_%1'"), НомерСтраницы);
	ИмяСтраницаНастройкаККМ = СтрШаблон(НСтр("ru = 'СтраницаНастройкаККМ_%1'"), НомерСтраницы);
	
	ЭлементыСтраницы = Элементы.Найти(ИмяСтраницКасса);
	Если НЕ ЭлементыСтраницы = Неопределено Тогда
		ЭлементСтраница = Элементы.Найти(ИмяСтраницаНастройкаККМ);
		Если НЕ ЭлементыСтраницы = Неопределено Тогда
			ЭлементыСтраницы.ТекущаяСтраница = ЭлементСтраница;
		КонецЕсли;
	КонецЕсли;
	Производитель = НСтр("ru ='ПОСЦентр'");
	ЗаполнитьПараметрыКассы();
КонецПроцедуры

&НаКлиенте
Процедура ПроизводительСбер(Команда)
	ИмяСтраницЭквайринг = СтрШаблон(НСтр("ru = 'СтраницыЭквайринг_%1'"), НомерСтраницы);
	ИмяСтраницаНастройкаЭквайринг = СтрШаблон(НСтр("ru = 'СтраницаНастройкаЭквайринг_%1'"), НомерСтраницы);
	
	ЭлементыСтраницы = Элементы.Найти(ИмяСтраницЭквайринг);
	Если НЕ ЭлементыСтраницы = Неопределено Тогда
		ЭлементСтраница = Элементы.Найти(ИмяСтраницаНастройкаЭквайринг);
		Если НЕ ЭлементыСтраницы = Неопределено Тогда
			ЭлементыСтраницы.ТекущаяСтраница = ЭлементСтраница;
		КонецЕсли;
	КонецЕсли;
	Производитель = НСтр("ru ='Сбербанк'");
	ЗаполнитьПараметрыЭквайринг();
КонецПроцедуры

&НаКлиенте
Процедура ПроизводительВсеЭквайринг(Команда)
	ИмяСтраницЭквайринг = СтрШаблон(НСтр("ru = 'СтраницыЭквайринг_%1'"), НомерСтраницы);
	ИмяСтраницаНастройкаЭквайринг = СтрШаблон(НСтр("ru = 'СтраницаНастройкаЭквайринг_%1'"), НомерСтраницы);
	
	ЭлементыСтраницы = Элементы.Найти(ИмяСтраницЭквайринг);
	Если НЕ ЭлементыСтраницы = Неопределено Тогда
		ЭлементСтраница = Элементы.Найти(ИмяСтраницаНастройкаЭквайринг);
		Если НЕ ЭлементыСтраницы = Неопределено Тогда
			ЭлементыСтраницы.ТекущаяСтраница = ЭлементСтраница;
		КонецЕсли;
	КонецЕсли;
	Производитель = НСтр("ru =''");
	ЗаполнитьПараметрыЭквайринг();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСозданиюОборудования(Команда)
	ПерейтиКСозданиюОборудованияКлиент();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура Подключаемый_ДрайверПриИзменении(Элемент)
	ИмяРеквизитаТипОборудования = СтрШаблон(НСтр("ru = 'ТипОборудования_%1'"), НомерСтраницы);
	ИмяРеквизитаДрайвер = СтрШаблон(НСтр("ru = 'ДрайверОборудования_%1'"), НомерСтраницы);
	
	ЭтоКасса = ЭтотОбъект[ИмяРеквизитаТипОборудования] = ПолучитьТипОборудования("KKT");
	ЭтоЭквайринг = ЭтотОбъект[ИмяРеквизитаТипОборудования] = ПолучитьТипОборудования("POSTerminal");
	
	ИмяРеквизитаНаименование = СтрШаблон(НСтр("ru = 'Наименование_%1'"), НомерСтраницы);
	Если ЭтоКасса Тогда
		ИмяРеквизитаКассаККМ = СтрШаблон(НСтр("ru = 'КассаККМ_%1'"), НомерСтраницы);
		ЭтотОбъект[ИмяРеквизитаНаименование] = СтрШаблон(НСтр("ru = '%1 (%2)'"), ЭтотОбъект[ИмяРеквизитаКассаККМ], ТекущееРабочееМесто);
	ИначеЕсли ЭтоЭквайринг Тогда
		ИмяРеквизитаЭквайринг = СтрШаблон(НСтр("ru = 'ЭквайринговыйТерминал_%1'"), НомерСтраницы);
		ЭтотОбъект[ИмяРеквизитаНаименование] = СтрШаблон(НСтр("ru = '%1 (%2)'"), ЭтотОбъект[ИмяРеквизитаЭквайринг], ТекущееРабочееМесто);
	Иначе
		ЭтотОбъект[ИмяРеквизитаНаименование] = СтрШаблон(НСтр("ru = '%1 (%2)'"), ЭтотОбъект[ИмяРеквизитаДрайвер], ТекущееРабочееМесто);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПереключателиПриИзменении(Элемент)
	ПереключательПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриСозданииДрайвер(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ИмяОповещения = "ОбновитьДанныеДрайверов";
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуВыбораДрайвера(ЭтотОбъект, ИмяОповещения);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСканерПриИзменении(Элемент)
	ПроверитьДоступностьКомандыСоздать();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСчитывательМагнитныхКартПриИзменении(Элемент)
	ПроверитьДоступностьКомандыСоздать();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаККТПриИзменении(Элемент)
	ПроверитьДоступностьКомандыСоздать();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПринтерЧековПриИзменении(Элемент)
	ПроверитьДоступностьКомандыСоздать();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЭквайрингПриИзменении(Элемент)
	ПроверитьДоступностьКомандыСоздать();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДисплейПокупателейПриИзменении(Элемент)
	ПроверитьДоступностьКомандыСоздать();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаУстройствоРаспознованияПриИзменении(Элемент)
	ПроверитьДоступностьКомандыСоздать();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЭлектронныеВесыПриИзменении(Элемент)
	ПроверитьДоступностьКомандыСоздать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	Элементы.НастройкаККТ.Видимость = ТаблицаКассыККМ.Количество() > 0;
	Элементы.НастройкаЭквайринг.Видимость = ТаблицаЭквайринг.Количество() > 0;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступностьКомандыСоздать()
	КомандаДоступна = НастройкаСканер Или НастройкаСчитывательМагнитныхКарт Или НастройкаУстройствоРаспознования
		Или НастройкаЭквайринг Или НастройкаЭлектронныеВесы Или НастройкаПринтерЧеков Или НастройкаККТ
		Или НастройкаДисплейПокупателей;
	Элементы.ПерейтиКСозданиюОборудования.Доступность = КомандаДоступна;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	ЗаполнитьПереключатели();
	Если ОткрытиеОборудования Тогда
		ЗаполнитьДанныеОборудования();
	КонецЕсли;
	СоздатьЭлементыНастроек();
КонецПроцедуры

&НаСервере
Функция ПолучитьДрайверыОборудования(ТипОборудованияДляДрайверов)
	
	СписокДрайверов = МенеджерОборудованияРМК.СписокДрайверов(ТипОборудованияДляДрайверов);
	
	Возврат СписокДрайверов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПереключатели()
	НомерСтраницы = 1;
	Если ОткрытиеОборудования
		Или ТаблицаОборудование.Количество() <= 1 Тогда
		Элементы.СписокПереключатели.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаОборудование Из ТаблицаОборудование Цикл
		Если ЗначениеЗаполнено(СтрокаОборудование.КассаККМ) Тогда
			Представление = Строка(СтрокаОборудование.КассаККМ);
		ИначеЕсли ЗначениеЗаполнено(СтрокаОборудование.ЭквайринговыйТерминал) Тогда
			Представление = Строка(СтрокаОборудование.ЭквайринговыйТерминал);
		Иначе
			Представление = Строка(СтрокаОборудование.ТипОборудования);
		КонецЕсли;
		Элементы.СписокПереключатели.СписокВыбора.Добавить(СтрокаОборудование.НомерЭлемента, Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыНастроек()
	МассивПодключенияОборудования = Новый Массив;
	ОбщегоНазначенияРМКПереопределяемый.ПолучитьТипыПодключенияОборудования(МассивПодключенияОборудования);
	Для Каждого СтрокаОборудование Из ТаблицаОборудование Цикл
		Если СтрокаОборудование.ТипОборудования = ПолучитьТипОборудования("KKT") Тогда
			СоздатьСтраницыКасса(СтрокаОборудование, МассивПодключенияОборудования);
		ИначеЕсли СтрокаОборудование.ТипОборудования = ПолучитьТипОборудования("POSTerminal") Тогда
			СоздатьСтраницыЭквайринг(СтрокаОборудование);
		Иначе
			СоздатьГруппуОборудование(СтрокаОборудование);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппуОборудование(СтрокаОборудование)
	ИмяГруппыКассаККМ = СтрШаблон(НСтр("ru = 'ГруппаОборудование_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппа = Элементы.Добавить(ИмяГруппыКассаККМ, Тип("ГруппаФормы"), Элементы.ГруппаЭлементыНастроек);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппа.РастягиватьПоГоризонтали = Истина;
	НоваяГруппа.Видимость = Ложь;
	
	ТипРеквизитаСтрока = Новый ОписаниеТипов("Строка");
	ТипРеквизитаДрайвер = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ДрайверОборудованияРМК.Тип);
	ТипРеквизитаОборудование = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ПодключаемоеОборудованиеРМК.Тип);
	ТипРеквизитаТипОборудования = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ТипыПодключаемогоОборудования.Тип);
	
	ДобавляемыеРеквизиты = Новый Массив;
	ИмяРеквизитаНаименование = СтрШаблон(НСтр("ru = 'Наименование_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаНаименование, ТипРеквизитаСтрока);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаДрайвер = СтрШаблон(НСтр("ru = 'ДрайверОборудования_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаДрайвер, ТипРеквизитаДрайвер);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаСерийныйНомер = СтрШаблон(НСтр("ru = 'СерийныйНомер_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаСерийныйНомер, ТипРеквизитаСтрока);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаОборудование = СтрШаблон(НСтр("ru = 'ПодключаемоеОборудование_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаОборудование, ТипРеквизитаОборудование);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаТипОборудования = СтрШаблон(НСтр("ru = 'ТипОборудования_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаТипОборудования, ТипРеквизитаТипОборудования);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаНаименование, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Наименование'");
	НовыйЭлемент.ПутьКДанным = ИмяРеквизитаНаименование;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.ОтметкаОбязательногоЗаполнения = Истина;
	
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаДрайвер, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Драйвер'");
	НовыйЭлемент.ПутьКДанным = ИмяРеквизитаДрайвер;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.РежимВыбораИзСписка = Не ЗначениеЗаполнено(СтрокаОборудование.ДрайверОборудования);
	НовыйЭлемент.ОтметкаОбязательногоЗаполнения = Истина;
	НовыйЭлемент.Доступность = Не ЗначениеЗаполнено(СтрокаОборудование.ДрайверОборудования);
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ДрайверПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаСерийныйНомер, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Серийный номер'");
	НовыйЭлемент.ПутьКДанным = ИмяРеквизитаСерийныйНомер;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ИмяГруппыБаннер = СтрШаблон(НСтр("ru = 'БаннерИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппаБаннер = Элементы.Добавить(ИмяГруппыБаннер, Тип("ГруппаФормы"), НоваяГруппа);
	НоваяГруппаБаннер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаБаннер.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппаБаннер.ОтображатьЗаголовок = Ложь;
	НоваяГруппаБаннер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаБаннер.РастягиватьПоГоризонтали = Истина;
	НоваяГруппаБаннер.Видимость = Ложь;
	НоваяГруппаБаннер.ОтображатьКакКарточку = Истина;
	НоваяГруппаБаннер.ЦветФона = ЦветаПалитры.Голубой;
	
	ИмяГруппыКартинкаБаннер = СтрШаблон(НСтр("ru = 'КолонкаПодКартинкуИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппаКартинкаБаннер = Элементы.Добавить(ИмяГруппыКартинкаБаннер, Тип("ГруппаФормы"), НоваяГруппаБаннер);
	НоваяГруппаКартинкаБаннер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаКартинкаБаннер.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппаКартинкаБаннер.ОтображатьЗаголовок = Ложь;
	НоваяГруппаКартинкаБаннер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаКартинкаБаннер.РастягиватьПоГоризонтали = Истина;
	
	ИмяРеквизитаДекорацияДрайвер = СтрШаблон(НСтр("ru = 'КартинкаБаннераИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаДекорацияДрайвер, Тип("ДекорацияФормы"),НоваяГруппаКартинкаБаннер);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Информация;
	
	ИмяГруппыДекорацияБаннер = СтрШаблон(НСтр("ru = 'КолонкаПодКонтентБаннераИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппаДекорацияБаннер = Элементы.Добавить(ИмяГруппыДекорацияБаннер, Тип("ГруппаФормы"), НоваяГруппаБаннер);
	НоваяГруппаДекорацияБаннер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаДекорацияБаннер.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппаДекорацияБаннер.ОтображатьЗаголовок = Ложь;
	НоваяГруппаДекорацияБаннер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаДекорацияБаннер.РастягиватьПоГоризонтали = Истина;
	
	ИмяРеквизитаДекорацияДрайвер = СтрШаблон(НСтр("ru = 'ДекорацияДрайверСообщения_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаДекорацияДрайвер, Тип("ДекорацияФормы"),НоваяГруппаДекорацияБаннер);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок =  НСтр("ru = ''");
	
	СписокДрайверов = ПолучитьДрайверыОборудования(СтрокаОборудование.ТипОборудования);
	Для Каждого СтрокаДрайвер Из СписокДрайверов Цикл
		Элементы[ИмяРеквизитаДрайвер].СписокВыбора.Добавить(СтрокаДрайвер.Значение, СтрокаДрайвер.Представление);
	КонецЦикла;
	
	Если СписокДрайверов.Количество() > 0 Тогда
		ЭтотОбъект[ИмяРеквизитаДрайвер] = СписокДрайверов[0].Значение;
	КонецЕсли;
	ЭтотОбъект[ИмяРеквизитаНаименование] = СтрШаблон(НСтр("ru = '%1 (%2)'"), ЭтотОбъект[ИмяРеквизитаДрайвер], ТекущееРабочееМесто);
	ЭтотОбъект[ИмяРеквизитаОборудование] = СтрокаОборудование.ПодключаемоеОборудование;
	ЭтотОбъект[ИмяРеквизитаТипОборудования] = СтрокаОборудование.ТипОборудования;
	Если ЗначениеЗаполнено(СтрокаОборудование.Наименование) Тогда
		ЭтотОбъект[ИмяРеквизитаНаименование] = СтрокаОборудование.Наименование;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаОборудование.ДрайверОборудования) Тогда
		ЭтотОбъект[ИмяРеквизитаДрайвер] = СтрокаОборудование.ДрайверОборудования;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьСтраницыКасса(СтрокаОборудование, МассивПодключенияОборудования)
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ИмяСтраницКасса = СтрШаблон(НСтр("ru = 'СтраницыКасса_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяСтраницаКассы = Элементы.Добавить(ИмяСтраницКасса, Тип("ГруппаФормы"), Элементы.ГруппаЭлементыНастроек);
	НоваяСтраницаКассы.Вид = ВидГруппыФормы.Страницы;
	НоваяСтраницаКассы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	НоваяСтраницаКассы.Видимость = Истина;
	
	ИмяСтраницаВыборПроизводителя = СтрШаблон(НСтр("ru = 'СтраницаВыборПроизводителя_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяСтраница = Элементы.Добавить(ИмяСтраницаВыборПроизводителя, Тип("ГруппаФормы"), НоваяСтраницаКассы);
	НоваяСтраница.Вид = ВидГруппыФормы.Страница;
	
	ИмяГруппыПроизводитель = СтрШаблон(НСтр("ru = 'ГруппаПроизводитель_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппа = Элементы.Добавить(ИмяГруппыПроизводитель, Тип("ГруппаФормы"), НоваяСтраница);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа.РастягиватьПоГоризонтали = Истина;
	Если Не ЭтоИнтерфейс85 Тогда
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;

	ИмяПроизводительАтол = СтрШаблон(НСтр("ru = 'ПроизводительАтол_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяПроизводительАтол, Тип("КнопкаФормы"), НоваяГруппа);
	НовыйЭлемент.Заголовок = НСтр("ru = 'Атол'");
	НовыйЭлемент.ИмяКоманды = НСтр("ru = 'ПроизводительАтол'");
	НовыйЭлемент.ОтображатьКакКарточку = Истина;
	НовыйЭлемент.ВысотаКартинки = 1;
	НовыйЭлемент.ВыравниваниеКартинкиИЗаголовкаКарточки = ВариантВыравниванияКартинкиИЗаголовкаКарточки.ГоризонтальноЦентрВертикальноЦентр;
	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	Если Не ЭтоИнтерфейс85 Тогда
		НовыйЭлемент.Высота = 3;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
	ИмяПроизводительПосЦентр = СтрШаблон(НСтр("ru = 'ПроизводительПосЦентр_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяПроизводительПосЦентр, Тип("КнопкаФормы"), НоваяГруппа);
	НовыйЭлемент.Заголовок = НСтр("ru = 'POScenter'");
	НовыйЭлемент.ИмяКоманды = НСтр("ru = 'ПроизводительПосЦентр'");
	НовыйЭлемент.ОтображатьКакКарточку = Истина;
	НовыйЭлемент.ВысотаКартинки = 1;
	НовыйЭлемент.ВыравниваниеКартинкиИЗаголовкаКарточки = ВариантВыравниванияКартинкиИЗаголовкаКарточки.ГоризонтальноЦентрВертикальноЦентр;
	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	Если Не ЭтоИнтерфейс85 Тогда
		НовыйЭлемент.Высота = 3;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
	ИмяПроизводительДримкас = СтрШаблон(НСтр("ru = 'ПроизводительДримкас_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяПроизводительДримкас, Тип("КнопкаФормы"), НоваяГруппа);
	НовыйЭлемент.Заголовок = НСтр("ru = 'Дримкас'");
	НовыйЭлемент.ИмяКоманды = НСтр("ru = 'ПроизводительДримкас'");
	НовыйЭлемент.ОтображатьКакКарточку = Истина;
	НовыйЭлемент.ВысотаКартинки = 1;
	НовыйЭлемент.ВыравниваниеКартинкиИЗаголовкаКарточки = ВариантВыравниванияКартинкиИЗаголовкаКарточки.ГоризонтальноЦентрВертикальноЦентр;
	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Если Не ЭтоИнтерфейс85 Тогда
		НовыйЭлемент.Высота = 3;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
	ИмяПроизводительВсе = СтрШаблон(НСтр("ru = 'ПроизводительВсе_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяПроизводительВсе, Тип("КнопкаФормы"), НоваяГруппа);
	ЗаголовокККТШаблон = НСтр("ru = 'Остальные %1 ККТ'");
	НовыйЭлемент.Заголовок = СтрШаблон(ЗаголовокККТШаблон, Символы.ПС);
	НовыйЭлемент.ИмяКоманды = НСтр("ru = 'ПроизводительВсе'");
	НовыйЭлемент.ОтображатьКакКарточку = Истина;
	НовыйЭлемент.ВысотаКартинки = 1;
	НовыйЭлемент.Высота = 3;
	НовыйЭлемент.Ширина = 12;
	Если НЕ ЭтоИнтерфейс85 Тогда
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		НовыйЭлемент.Заголовок = НСтр("ru = 'Остальные ККТ'");
	КонецЕсли;
	НовыйЭлемент.ВыравниваниеКартинкиИЗаголовкаКарточки = ВариантВыравниванияКартинкиИЗаголовкаКарточки.ГоризонтальноЦентрВертикальноЦентр;
	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	ИмяСтраницаНастройкаККМ = СтрШаблон(НСтр("ru = 'СтраницаНастройкаККМ_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяСтраница = Элементы.Добавить(ИмяСтраницаНастройкаККМ, Тип("ГруппаФормы"), НоваяСтраницаКассы);
	НоваяСтраница.Вид = ВидГруппыФормы.Страница;
	
	ИмяГруппыНастройкаКассы = СтрШаблон(НСтр("ru = 'ГруппаНастройкаКассыККМ_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппа = Элементы.Добавить(ИмяГруппыНастройкаКассы, Тип("ГруппаФормы"), НоваяСтраница);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппа.РастягиватьПоГоризонтали = Истина;
	
	ТипРеквизитаСтрока = Новый ОписаниеТипов("Строка");
	ТипРеквизитаДрайвер = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ДрайверОборудованияРМК.Тип);
	ТипРеквизитаОборудование = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ПодключаемоеОборудованиеРМК.Тип);
	ТипРеквизитаТипПодключения = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ТипПодключенияОборудованияРМК.Тип);
	ТипРеквизитаОрганизация = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ОрганизацияРМК.Тип);
	ТипРеквизитаТипОборудования = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ТипыПодключаемогоОборудования.Тип);
	ТипРеквизитКассаККМ = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.КассаККМРМК.Тип);
	
	ДобавляемыеРеквизиты = Новый Массив;
	ИмяРеквизитаНаименование = СтрШаблон(НСтр("ru = 'Наименование_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаНаименование, ТипРеквизитаСтрока);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаДрайвер = СтрШаблон(НСтр("ru = 'ДрайверОборудования_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаДрайвер, ТипРеквизитаДрайвер);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаТипПодключения = СтрШаблон(НСтр("ru = 'ТипПодключения_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаТипПодключения, ТипРеквизитаТипПодключения);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаОборудование = СтрШаблон(НСтр("ru = 'ПодключаемоеОборудование_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаОборудование, ТипРеквизитаОборудование);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаКассаККМ = СтрШаблон(НСтр("ru = 'КассаККМ_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаКассаККМ, ТипРеквизитКассаККМ);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаТипОборудования = СтрШаблон(НСтр("ru = 'ТипОборудования_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаТипОборудования, ТипРеквизитаТипОборудования);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаОрганизация = СтрШаблон(НСтр("ru = 'Организация_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаОрганизация, ТипРеквизитаОрганизация);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаТипПодключения, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеПереключателя;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Тип подключения'");
	НовыйЭлемент.ПутьКДанным = ИмяРеквизитаТипПодключения;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ОтметкаОбязательногоЗаполнения = Истина;
	НовыйЭлемент.ВидПереключателя = ВидПереключателя.Тумблер;
	НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(МассивПодключенияОборудования);
	
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаОрганизация, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Организация'");
	НовыйЭлемент.ПутьКДанным = ИмяРеквизитаОрганизация;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.ОтметкаОбязательногоЗаполнения = Истина;
	
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаНаименование, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Наименование'");
	НовыйЭлемент.ПутьКДанным = ИмяРеквизитаНаименование;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.ОтметкаОбязательногоЗаполнения = Истина;
	
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаДрайвер, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Драйвер'");
	НовыйЭлемент.ПутьКДанным = ИмяРеквизитаДрайвер;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.РежимВыбораИзСписка = Не ЗначениеЗаполнено(СтрокаОборудование.ДрайверОборудования);
	НовыйЭлемент.ОтметкаОбязательногоЗаполнения = Истина;
	НовыйЭлемент.КнопкаСоздания = Истина;
	НовыйЭлемент.Доступность = Не ЗначениеЗаполнено(СтрокаОборудование.ДрайверОборудования);
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ДрайверПриИзменении");
	НовыйЭлемент.УстановитьДействие("Создание", "Подключаемый_ПриСозданииДрайвер");
	
	ИмяГруппыБаннер = СтрШаблон(НСтр("ru = 'БаннерИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппаБаннер = Элементы.Добавить(ИмяГруппыБаннер, Тип("ГруппаФормы"), НоваяГруппа);
	НоваяГруппаБаннер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаБаннер.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппаБаннер.ОтображатьЗаголовок = Ложь;
	НоваяГруппаБаннер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаБаннер.РастягиватьПоГоризонтали = Истина;
	НоваяГруппаБаннер.Видимость = Ложь;
	НоваяГруппаБаннер.ОтображатьКакКарточку = Истина;
	НоваяГруппаБаннер.ЦветФона = ЦветаПалитры.Голубой;
	
	ИмяГруппыКартинкаБаннер = СтрШаблон(НСтр("ru = 'КолонкаПодКартинкуИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппаКартинкаБаннер = Элементы.Добавить(ИмяГруппыКартинкаБаннер, Тип("ГруппаФормы"), НоваяГруппаБаннер);
	НоваяГруппаКартинкаБаннер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаКартинкаБаннер.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппаКартинкаБаннер.ОтображатьЗаголовок = Ложь;
	НоваяГруппаКартинкаБаннер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаКартинкаБаннер.РастягиватьПоГоризонтали = Истина;
	
	ИмяРеквизитаДекорацияДрайвер = СтрШаблон(НСтр("ru = 'КартинкаБаннераИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаДекорацияДрайвер, Тип("ДекорацияФормы"),НоваяГруппаКартинкаБаннер);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Информация;
	
	ИмяГруппыДекорацияБаннер = СтрШаблон(НСтр("ru = 'КолонкаПодКонтентБаннераИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппаДекорацияБаннер = Элементы.Добавить(ИмяГруппыДекорацияБаннер, Тип("ГруппаФормы"), НоваяГруппаБаннер);
	НоваяГруппаДекорацияБаннер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаДекорацияБаннер.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппаДекорацияБаннер.ОтображатьЗаголовок = Ложь;
	НоваяГруппаДекорацияБаннер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаДекорацияБаннер.РастягиватьПоГоризонтали = Истина;
	
	ИмяРеквизитаДекорацияДрайвер = СтрШаблон(НСтр("ru = 'ДекорацияДрайверСообщения_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаДекорацияДрайвер, Тип("ДекорацияФормы"),НоваяГруппаДекорацияБаннер);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок =  НСтр("ru = ''");
	
	Если МассивПодключенияОборудования.Количество() > 0 Тогда
		ЭтотОбъект[ИмяРеквизитаТипПодключения] = МассивПодключенияОборудования[0];
	КонецЕсли;
	ЭтотОбъект[ИмяРеквизитаОрганизация] = СтрокаОборудование.Организация;
	ЭтотОбъект[ИмяРеквизитаТипОборудования] = СтрокаОборудование.ТипОборудования;
	ЭтотОбъект[ИмяРеквизитаКассаККМ] = СтрокаОборудование.КассаККМ;
	Если ЗначениеЗаполнено(СтрокаОборудование.Наименование) Тогда
		ЭтотОбъект[ИмяРеквизитаНаименование] = СтрокаОборудование.Наименование;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаОборудование.ДрайверОборудования) Тогда
		ЭтотОбъект[ИмяРеквизитаДрайвер] = СтрокаОборудование.ДрайверОборудования;
	КонецЕсли;
	ЭтотОбъект[ИмяРеквизитаОборудование] = СтрокаОборудование.ПодключаемоеОборудование;
КонецПроцедуры

&НаСервере
Процедура СоздатьСтраницыЭквайринг(СтрокаОборудование)
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ИмяСтраницЭквайринг = СтрШаблон(НСтр("ru = 'СтраницыЭквайринг_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяСтраницаКассы = Элементы.Добавить(ИмяСтраницЭквайринг, Тип("ГруппаФормы"), Элементы.ГруппаЭлементыНастроек);
	НоваяСтраницаКассы.Вид = ВидГруппыФормы.Страницы;
	НоваяСтраницаКассы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	НоваяСтраницаКассы.Видимость = Истина;
	
	ИмяСтраницаВыборПроизводителя = СтрШаблон(НСтр("ru = 'СтраницаВыборПроизводителяЭквайринг_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяСтраница = Элементы.Добавить(ИмяСтраницаВыборПроизводителя, Тип("ГруппаФормы"), НоваяСтраницаКассы);
	НоваяСтраница.Вид = ВидГруппыФормы.Страница;
	
	ИмяГруппыПроизводитель = СтрШаблон(НСтр("ru = 'ГруппаПроизводитель_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппа = Элементы.Добавить(ИмяГруппыПроизводитель, Тип("ГруппаФормы"), НоваяСтраница);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа.РастягиватьПоГоризонтали = Истина;
	Если Не ЭтоИнтерфейс85 Тогда
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
	ИмяПроизводительСбер = СтрШаблон(НСтр("ru = 'ПроизводительСбер_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяПроизводительСбер, Тип("КнопкаФормы"), НоваяГруппа);
	НовыйЭлемент.Заголовок = НСтр("ru = 'Сбер'");
	НовыйЭлемент.ИмяКоманды = НСтр("ru = 'ПроизводительСбер'");
	НовыйЭлемент.ОтображатьКакКарточку = Истина;
	НовыйЭлемент.ВысотаКартинки = 1;
	НовыйЭлемент.ВыравниваниеКартинкиИЗаголовкаКарточки = ВариантВыравниванияКартинкиИЗаголовкаКарточки.ГоризонтальноЦентрВертикальноЦентр;
	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	Если Не ЭтоИнтерфейс85 Тогда
		НовыйЭлемент.Высота = 3;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
	ИмяПроизводительВсе = СтрШаблон(НСтр("ru = 'ПроизводительВсе_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяПроизводительВсе, Тип("КнопкаФормы"), НоваяГруппа);
	ЗаголовокТерминалШаблон = НСтр("ru = 'Остальные %1 терминалы'");
	НовыйЭлемент.Заголовок = СтрШаблон(ЗаголовокТерминалШаблон, Символы.ПС);
	НовыйЭлемент.ИмяКоманды = НСтр("ru = 'ПроизводительВсеЭквайринг'");
	НовыйЭлемент.ОтображатьКакКарточку = Истина;
	НовыйЭлемент.ВысотаКартинки = 1;
	НовыйЭлемент.Высота = 3;
	НовыйЭлемент.Ширина = 12;
	НовыйЭлемент.ВыравниваниеКартинкиИЗаголовкаКарточки = ВариантВыравниванияКартинкиИЗаголовкаКарточки.ГоризонтальноЦентрВертикальноЦентр;
	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Если Не ЭтоИнтерфейс85 Тогда
		НовыйЭлемент.Высота = 3;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		НовыйЭлемент.Заголовок = НСтр("ru = 'Остальные терминалы'");
	КонецЕсли;
	
	ИмяСтраницаНастройкаЭквайринг = СтрШаблон(НСтр("ru = 'СтраницаНастройкаЭквайринг_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяСтраница = Элементы.Добавить(ИмяСтраницаНастройкаЭквайринг, Тип("ГруппаФормы"), НоваяСтраницаКассы);
	НоваяСтраница.Вид = ВидГруппыФормы.Страница;
	
	ИмяГруппыНастройкаЭквайринг = СтрШаблон(НСтр("ru = 'ГруппаНастройкаЭквайринг_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппа = Элементы.Добавить(ИмяГруппыНастройкаЭквайринг, Тип("ГруппаФормы"), НоваяСтраница);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппа.РастягиватьПоГоризонтали = Истина;
	
	ТипРеквизитаСтрока = Новый ОписаниеТипов("Строка");
	ТипРеквизитаДрайвер = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ДрайверОборудованияРМК.Тип);
	ТипРеквизитаОборудование = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ПодключаемоеОборудованиеРМК.Тип);
	ТипРеквизитаОрганизация = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ОрганизацияРМК.Тип);
	ТипРеквизитаТипОборудования = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ТипыПодключаемогоОборудования.Тип);
	ТипРеквизитЭквайринг = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ЭквайринговыйТерминалРМК.Тип);
	
	ДобавляемыеРеквизиты = Новый Массив;
	ИмяРеквизитаНаименование = СтрШаблон(НСтр("ru = 'Наименование_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаНаименование, ТипРеквизитаСтрока);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаДрайвер = СтрШаблон(НСтр("ru = 'ДрайверОборудования_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаДрайвер, ТипРеквизитаДрайвер);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаОборудование = СтрШаблон(НСтр("ru = 'ПодключаемоеОборудование_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаОборудование, ТипРеквизитаОборудование);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаЭквайринг = СтрШаблон(НСтр("ru = 'ЭквайринговыйТерминал_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаЭквайринг, ТипРеквизитЭквайринг);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаТипОборудования = СтрШаблон(НСтр("ru = 'ТипОборудования_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаТипОборудования, ТипРеквизитаТипОборудования);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизитаОрганизация = СтрШаблон(НСтр("ru = 'Организация_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаОрганизация, ТипРеквизитаОрганизация);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаОрганизация, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Организация'");
	НовыйЭлемент.ПутьКДанным = ИмяРеквизитаОрганизация;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.ОтметкаОбязательногоЗаполнения = Истина;
	
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаНаименование, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Наименование'");
	НовыйЭлемент.ПутьКДанным = ИмяРеквизитаНаименование;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.ОтметкаОбязательногоЗаполнения = Истина;
	
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаДрайвер, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Драйвер'");
	НовыйЭлемент.ПутьКДанным = ИмяРеквизитаДрайвер;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.РежимВыбораИзСписка = Не ЗначениеЗаполнено(СтрокаОборудование.ДрайверОборудования);
	НовыйЭлемент.ОтметкаОбязательногоЗаполнения = Истина;
	НовыйЭлемент.КнопкаСоздания = Истина;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ДрайверПриИзменении");
	НовыйЭлемент.УстановитьДействие("Создание", "Подключаемый_ПриСозданииДрайвер");
	НовыйЭлемент.Доступность = Не ЗначениеЗаполнено(СтрокаОборудование.ДрайверОборудования);
	
	ЭтотОбъект[ИмяРеквизитаОрганизация] = СтрокаОборудование.Организация;
	ЭтотОбъект[ИмяРеквизитаТипОборудования] = СтрокаОборудование.ТипОборудования;
	ЭтотОбъект[ИмяРеквизитаЭквайринг] = СтрокаОборудование.ЭквайринговыйТерминал;
	ЭтотОбъект[ИмяРеквизитаОборудование] = СтрокаОборудование.ПодключаемоеОборудование;
	Если ЗначениеЗаполнено(СтрокаОборудование.Наименование) Тогда
		ЭтотОбъект[ИмяРеквизитаНаименование] = СтрокаОборудование.Наименование;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаОборудование.ДрайверОборудования) Тогда
		ЭтотОбъект[ИмяРеквизитаДрайвер] = СтрокаОборудование.ДрайверОборудования;
	КонецЕсли;
	
	ИмяГруппыБаннер = СтрШаблон(НСтр("ru = 'БаннерИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппаБаннер = Элементы.Добавить(ИмяГруппыБаннер, Тип("ГруппаФормы"), НоваяГруппа);
	НоваяГруппаБаннер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаБаннер.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппаБаннер.ОтображатьЗаголовок = Ложь;
	НоваяГруппаБаннер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаБаннер.РастягиватьПоГоризонтали = Истина;
	НоваяГруппаБаннер.Видимость = Ложь;
	НоваяГруппаБаннер.ОтображатьКакКарточку = Истина;
	НоваяГруппаБаннер.ЦветФона = ЦветаПалитры.Голубой;
	
	ИмяГруппыКартинкаБаннер = СтрШаблон(НСтр("ru = 'КолонкаПодКартинкуИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппаКартинкаБаннер = Элементы.Добавить(ИмяГруппыКартинкаБаннер, Тип("ГруппаФормы"), НоваяГруппаБаннер);
	НоваяГруппаКартинкаБаннер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаКартинкаБаннер.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппаКартинкаБаннер.ОтображатьЗаголовок = Ложь;
	НоваяГруппаКартинкаБаннер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаКартинкаБаннер.РастягиватьПоГоризонтали = Истина;
	
	ИмяРеквизитаДекорацияДрайвер = СтрШаблон(НСтр("ru = 'КартинкаБаннераИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаДекорацияДрайвер, Тип("ДекорацияФормы"),НоваяГруппаКартинкаБаннер);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Информация;
	
	ИмяГруппыДекорацияБаннер = СтрШаблон(НСтр("ru = 'КолонкаПодКонтентБаннераИнформация_%1'"), СтрокаОборудование.НомерЭлемента);
	НоваяГруппаДекорацияБаннер = Элементы.Добавить(ИмяГруппыДекорацияБаннер, Тип("ГруппаФормы"), НоваяГруппаБаннер);
	НоваяГруппаДекорацияБаннер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаДекорацияБаннер.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппаДекорацияБаннер.ОтображатьЗаголовок = Ложь;
	НоваяГруппаДекорацияБаннер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаДекорацияБаннер.РастягиватьПоГоризонтали = Истина;
	
	ИмяРеквизитаДекорацияДрайвер = СтрШаблон(НСтр("ru = 'ДекорацияДрайверСообщения_%1'"), СтрокаОборудование.НомерЭлемента);
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаДекорацияДрайвер, Тип("ДекорацияФормы"),НоваяГруппаДекорацияБаннер);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок =  НСтр("ru = ''");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюДрайвераОборудования(ДрайверОборудования)
	
	Если ЗначениеЗаполнено(ДрайверОборудования) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗавершениеОбновленияИнформацииДрайвераОборудования", ЭтотОбъект);
		МенеджерОборудованияРМККлиент.НачатьПолучениеОписанияДрайвера(Оповещение, ДрайверОборудования);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыСканераНаСервере(Результат, ПодключаемоеОборудование)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Результат.ОписаниеДрайвера.ПараметрыДрайвера);
	ЧтениеXML.ПерейтиКСодержимому();
	СтрокиОборудования = ТаблицаОборудование.НайтиСтроки(Новый Структура("НомерЭлемента", НомерСтраницы));
	Если СтрокиОборудования.Количество() > 0 Тогда
		СтрокиОборудования[0].ПараметрыСканера.Очистить();
	КонецЕсли;
	ХранимыеЗначения = Справочники.ПодключаемоеОборудование.ПараметрыУстройства(ПодключаемоеОборудование);
	
	Если ЧтениеXML.Имя = "Settings" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "Parameter" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				ТолькоЧтение = ?(ВРег(ЧтениеXML.ЗначениеАтрибута("ReadOnly")) = "TRUE", Истина, Ложь) 
										Или ?(ВРег(ЧтениеXML.ЗначениеАтрибута("ReadOnly")) = "ИСТИНА", Истина, Ложь);
				ОригинальноеИмя   =  ЧтениеXML.ЗначениеАтрибута("Name");
				ПараметрИмя       = ?(ТолькоЧтение, "R_", "P_") + ОригинальноеИмя;
				ПараметрЗначение  = ЧтениеXML.ЗначениеАтрибута("DefaultValue");
				ПараметрТип       = ВРег(ЧтениеXML.ЗначениеАтрибута("TypeValue"));
				ПараметрТип       = ?(НЕ ПустаяСтрока(ПараметрТип), ПараметрТип, "STRING");
				
				Элемент = Неопределено;
				ИмяРеквизита = "";
				ХранимоеЗначение = Неопределено;
				Если ХранимыеЗначения.Свойство(ПараметрИмя, ХранимоеЗначение) Тогда
					ПараметрЗначение = ХранимоеЗначение;
				ИначеЕсли НЕ ПустаяСтрока(ПараметрЗначение) Тогда
					Если ПараметрТип = "NUMBER" Тогда
						ПараметрЗначение = Число(ПараметрЗначение);
					ИначеЕсли ПараметрТип = "BOOLEAN" Тогда
						ПараметрЗначение = ?(ВРег(ПараметрЗначение) = "TRUE", Истина, Ложь) Или ?(ВРег(ПараметрЗначение) = "ИСТИНА", Истина, Ложь);
					Иначе
						ПараметрЗначение = Строка(ПараметрЗначение);
					КонецЕсли;
				КонецЕсли;
				Если СтрокиОборудования.Количество() > 0 Тогда
					СтрокиОборудования[0].ПараметрыСканера.Добавить(ПараметрЗначение, ПараметрИмя);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ОписаниеРевизииИнтерфейса(РевизияИнтерфейса)
	
	СообщениеНаЭкране = НСтр("ru='(Версия требований к разработке драйверов %Версия%)'");
	
	Если РевизияИнтерфейса >= 3000 Тогда
		
		Результат = Символы.НПП + СообщениеНаЭкране;
		Результат = СтрЗаменить(Результат, "%Версия%", "3." + Строка(РевизияИнтерфейса - 3000));
		
	ИначеЕсли РевизияИнтерфейса >= 2000 Тогда
		
		Результат = Символы.НПП + СообщениеНаЭкране;
		Результат = СтрЗаменить(Результат, "%Версия%", "2." + Строка(РевизияИнтерфейса - 2000));
		
	ИначеЕсли РевизияИнтерфейса > 1000 Тогда
		
		Результат = Символы.НПП + СообщениеНаЭкране;
		Результат = СтрЗаменить(Результат, "%Версия%", "1." + Строка(РевизияИнтерфейса - 1000));
		
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура АвтонастройкаУстановитьПараметры(ПараметрыПодключения)
	
	ИмяРеквизитаОборудование = СтрШаблон(НСтр("ru = 'ПодключаемоеОборудование_%1'"), НомерСтраницы);
	ХранилищеНовый = Новый ХранилищеЗначения(ПараметрыПодключения);
	
	НачатьТранзакцию();
	
	Попытка

		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ПодключаемоеОборудование");
		БлокировкаДанных.Заблокировать();
		
		ПодключаемоеОборудованиеОбъект = ЭтотОбъект[ИмяРеквизитаОборудование].ПолучитьОбъект();
		ПодключаемоеОборудованиеОбъект.Параметры = ХранилищеНовый;
		ПодключаемоеОборудованиеОбъект.Записать();
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Попытка записи подключаемого оборудования'",
			ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,,
			ОписаниеОшибки)
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭкземплярОборудования()
	СтруктураДанных = СоздатьИзменитьПодключаемоеОборудованиеНаСервере();
	Если ЗначениеЗаполнено(СтруктураДанных.ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(, СтруктураДанных.ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.НавигационнаяСсылка) Тогда
		ИмяРеквизитаОборудование = СтрШаблон(НСтр("ru = 'ПодключаемоеОборудование_%1'"), НомерСтраницы);
		ТекстСообщения = НСтр("ru = 'Создано оборудование'");
		ПоказатьОповещениеПользователя(ТекстСообщения , СтруктураДанных.НавигационнаяСсылка, ЭтотОбъект[ИмяРеквизитаОборудование]);
		ИмяРеквизитаДрайвер = СтрШаблон(НСтр("ru = 'ДрайверОборудования_%1'"), НомерСтраницы);
		ОбновитьИнформациюДрайвераОборудования(ЭтотОбъект[ИмяРеквизитаДрайвер]);
		ЗаголовокКоманды = НСтр("ru = 'Записать настройки'");
		Элементы.ЗаписатьНастройки.Заголовок = ЗаголовокКоманды;
		Элементы.БольшеНастроек.Доступность = Истина;
		Элементы.Автонастройка.Доступность = Истина;
		СтрокиОборудование = ТаблицаОборудование.НайтиСтроки(Новый Структура("НомерЭлемента", НомерСтраницы));
		Если СтрокиОборудование.Количество() > 0 Тогда
			СтрокиОборудование[0].ПодключаемоеОборудование = ЭтотОбъект[ИмяРеквизитаОборудование];
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПриИзмененииНаКлиенте()
	Производитель = НСтр("ru = ''");
	ТипСканер = ПолучитьТипОборудования("BarcodeScanner");
	ТипККТ = ПолучитьТипОборудования("KKT");
	ТипЭквайринг = ПолучитьТипОборудования("POSTerminal");
	Для Каждого СтрокаОборудование Из ТаблицаОборудование Цикл
		Если СтрокаОборудование.ТипОборудования = ТипККТ Тогда
			ИмяГруппы = СтрШаблон(НСтр("ru = 'СтраницыКасса_%1'"), СтрокаОборудование.НомерЭлемента);
		ИначеЕсли СтрокаОборудование.ТипОборудования = ТипЭквайринг Тогда
			ИмяГруппы = СтрШаблон(НСтр("ru = 'СтраницыЭквайринг_%1'"), СтрокаОборудование.НомерЭлемента);
		Иначе
			ИмяГруппы = СтрШаблон(НСтр("ru = 'ГруппаОборудование_%1'"), СтрокаОборудование.НомерЭлемента);
		КонецЕсли;
		Элемент = Элементы.Найти(ИмяГруппы);
		ВидимостьЭлемента = Ложь;
		Если НомерСтраницы = СтрокаОборудование.НомерЭлемента Тогда
			ВидимостьЭлемента = Истина;
		КонецЕсли;
		Если НЕ Элемент = Неопределено Тогда
			Элемент.Видимость = ВидимостьЭлемента;
		КонецЕсли;
	КонецЦикла;
	
	ИмяРеквизитаОборудование = СтрШаблон(НСтр("ru = 'ПодключаемоеОборудование_%1'"), НомерСтраницы);
	ИмяРеквизитаТипОборудования = СтрШаблон(НСтр("ru = 'ТипОборудования_%1'"), НомерСтраницы);
	ОборудованиеПодключено = ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизитаОборудование]);
	
	ЭтоСканер = ТипСканер = ЭтотОбъект[ИмяРеквизитаТипОборудования];
	ЭтоКасса = ТипККТ = ЭтотОбъект[ИмяРеквизитаТипОборудования];
	ЭтоЭквайринг = ТипЭквайринг = ЭтотОбъект[ИмяРеквизитаТипОборудования];
	
	ВидимостьКоманд = Истина;
	Если ЭтоКасса Тогда
		ИмяСтраницКасса = СтрШаблон(НСтр("ru = 'СтраницыКасса_%1'"), НомерСтраницы);
		ИмяСтраницаНастройкаККМ = СтрШаблон(НСтр("ru = 'СтраницаНастройкаККМ_%1'"), НомерСтраницы);
		ЭлементыСтраницы = Элементы.Найти(ИмяСтраницКасса);
		Если НЕ ЭлементыСтраницы = Неопределено Тогда
			ЭлементСтраница = Элементы.Найти(ИмяСтраницаНастройкаККМ);
			Если НЕ ЭлементыСтраницы = Неопределено Тогда
				Если ОборудованиеПодключено Тогда
					ЭлементыСтраницы.ТекущаяСтраница = ЭлементСтраница;
				Иначе
					ВидимостьКоманд = ЭлементыСтраницы.ТекущаяСтраница = ЭлементСтраница;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоЭквайринг Тогда
		ИмяСтраницЭквайринг = СтрШаблон(НСтр("ru = 'СтраницыЭквайринг_%1'"), НомерСтраницы);
		ИмяСтраницаНастройкаЭквайринг = СтрШаблон(НСтр("ru = 'СтраницаНастройкаЭквайринг_%1'"), НомерСтраницы);
		ЭлементыСтраницы = Элементы.Найти(ИмяСтраницЭквайринг);
		Если НЕ ЭлементыСтраницы = Неопределено Тогда
			ЭлементСтраница = Элементы.Найти(ИмяСтраницаНастройкаЭквайринг);
			Если НЕ ЭлементыСтраницы = Неопределено Тогда
				Если ОборудованиеПодключено Тогда
					ЭлементыСтраницы.ТекущаяСтраница = ЭлементСтраница;
				Иначе
					ВидимостьКоманд = ЭлементыСтраницы.ТекущаяСтраница = ЭлементСтраница;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ВидимостьКоманд Тогда
		Если ОборудованиеПодключено Тогда
			ЗаголовокКоманды = НСтр("ru = 'Записать настройки'");
		Иначе
			ЗаголовокКоманды = НСтр("ru = 'Создать экземпляр оборудования'");
		КонецЕсли;
		Элементы.ГруппаКоманда.Видимость = ВидимостьКоманд;
		Элементы.ЗаписатьНастройки.Заголовок = ЗаголовокКоманды;
		Элементы.БольшеНастроек.Доступность = ОборудованиеПодключено;
		Элементы.Автонастройка.Видимость = ЭтоСканер;
		Элементы.Автонастройка.Доступность = ОборудованиеПодключено;
	Иначе
		Элементы.ГруппаКоманда.Видимость = ВидимостьКоманд;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТипОборудования(ТипОборудования)
	
	ТипыПодключаемогоОборудования = МенеджерОборудованияРМК.ТипыПодключаемогоОборудования();
	
	ТипОборудованияДляДрайверов = ТипыПодключаемогоОборудования.Получить(ТипОборудования);
	
	Возврат ТипОборудованияДляДрайверов;
	
КонецФункции

&НаСервере
Функция СоздатьИзменитьПодключаемоеОборудованиеНаСервере()
	
	СтруктураВозвращаемыхЗначений = Новый Структура;
	СтруктураВозвращаемыхЗначений.Вставить("ТекстПредупреждения", "");
	СтруктураВозвращаемыхЗначений.Вставить("НавигационнаяСсылка", "");
	
	ИмяРеквизитаНаименование = СтрШаблон(НСтр("ru = 'Наименование_%1'"), НомерСтраницы);
	ИмяРеквизитаДрайвер = СтрШаблон(НСтр("ru = 'ДрайверОборудования_%1'"), НомерСтраницы);
	ИмяРеквизитаСерийныйНомер = СтрШаблон(НСтр("ru = 'СерийныйНомер_%1'"), НомерСтраницы);
	ИмяРеквизитаОборудование = СтрШаблон(НСтр("ru = 'ПодключаемоеОборудование_%1'"), НомерСтраницы);
	ИмяРеквизитаТипПодключения = СтрШаблон(НСтр("ru = 'ТипПодключения_%1'"), НомерСтраницы);
	ИмяРеквизитаТипОборудования = СтрШаблон(НСтр("ru = 'ТипОборудования_%1'"), НомерСтраницы);
	ИмяРеквизитаОрганизация = СтрШаблон(НСтр("ru = 'Организация_%1'"), НомерСтраницы);
	
	ЭтоКасса = ЭтотОбъект[ИмяРеквизитаТипОборудования] = ПолучитьТипОборудования("KKT");
	ЭтоЭквайринг = ЭтотОбъект[ИмяРеквизитаТипОборудования] = ПолучитьТипОборудования("POSTerminal");
	
	СтруктураСозданияОборудования = Новый Структура;
	СтруктураСозданияОборудования.Вставить("Наименование", ЭтотОбъект[ИмяРеквизитаНаименование]);
	СтруктураСозданияОборудования.Вставить("ДрайверОборудования", ЭтотОбъект[ИмяРеквизитаДрайвер]);
	СтруктураСозданияОборудования.Вставить("ПодключаемоеОборудование", ЭтотОбъект[ИмяРеквизитаОборудование]);
	СтруктураСозданияОборудования.Вставить("РабочееМесто", ТекущееРабочееМесто);
	Если ЭтоКасса Тогда
		СтруктураСозданияОборудования.Вставить("ТипПодключения", ЭтотОбъект[ИмяРеквизитаТипПодключения]);
		СтруктураСозданияОборудования.Вставить("Организация", ЭтотОбъект[ИмяРеквизитаОрганизация]);
	ИначеЕсли ЭтоЭквайринг Тогда
		СтруктураСозданияОборудования.Вставить("Организация", ЭтотОбъект[ИмяРеквизитаОрганизация]);
	Иначе
		СтруктураСозданияОборудования.Вставить("СерийныйНомер", ЭтотОбъект[ИмяРеквизитаСерийныйНомер]);
	КонецЕсли;
	
	МассивПроверяемыхРеквизитов = ПолучитьМассивПроверяемыхРеквизитов();
	ШаблонПредупреждения = НСтр("ru = 'Не заполнен реквизит %1'");
	ТекстПредупреждения = НСтр("ru = ''");
	ПроверкаУспешна = Истина;
	Для Номер = 0 По МассивПроверяемыхРеквизитов.Количество() - 1 Цикл
		Если Не ЗначениеЗаполнено(СтруктураСозданияОборудования[МассивПроверяемыхРеквизитов[Номер]]) Тогда
			ПроверкаУспешна = Ложь;
			ТекстПредупреждения = СтрШаблон(ШаблонПредупреждения, МассивПроверяемыхРеквизитов[Номер]);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПроверкаУспешна Тогда
		СтруктураВозвращаемыхЗначений.ТекстПредупреждения = ТекстПредупреждения;
		Возврат СтруктураВозвращаемыхЗначений;
	КонецЕсли;
	
	ЕстьДубли = Ложь;
	ОбщегоНазначенияРМКПереопределяемый.ПроверитьОборудованиеНаДубли(ЭтотОбъект[ИмяРеквизитаНаименование], ТекущееРабочееМесто, ЕстьДубли);
	
	Если ЕстьДубли Тогда
		СтруктураВозвращаемыхЗначений.ТекстПредупреждения = НСтр("ru = 'Укажите уникальное наименование'");
		Возврат СтруктураВозвращаемыхЗначений;
	КонецЕсли;
	
	ОбщегоНазначенияРМКПереопределяемый.СоздатьЭкзеплярОборудования(СтруктураСозданияОборудования);
	ЭтотОбъект[ИмяРеквизитаОборудование] = СтруктураСозданияОборудования.ПодключаемоеОборудование;
	СтруктураВозвращаемыхЗначений.НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ЭтотОбъект[ИмяРеквизитаОборудование]);
	Если ЭтоКасса Тогда
		ИмяРеквизитаКассаККМ = СтрШаблон(НСтр("ru = 'КассаККМ_%1'"), НомерСтраницы);
		СтрукутураИзменяемыхРеквизитов = Новый Структура("ПодключаемоеОборудование", ЭтотОбъект[ИмяРеквизитаОборудование]);
		ОбщегоНазначенияРМКПереопределяемый.СохранитьИзмененияКассыККМ(ЭтотОбъект[ИмяРеквизитаКассаККМ], СтрукутураИзменяемыхРеквизитов);
	КонецЕсли;
	
	Если ЭтоЭквайринг Тогда
		ИмяРеквизитаЭквайринг = СтрШаблон(НСтр("ru = 'ЭквайринговыйТерминал_%1'"), НомерСтраницы);
		СтрукутураИзменяемыхРеквизитов = Новый Структура("ПодключаемоеОборудование", ЭтотОбъект[ИмяРеквизитаОборудование]);
		ОбщегоНазначенияРМКПереопределяемый.СохранитьИзменениеЭквайринговыйТерминал(ЭтотОбъект[ИмяРеквизитаЭквайринг], СтрукутураИзменяемыхРеквизитов);
		ПодключенТерминал = Истина;
	КонецЕсли;
	
	Возврат СтруктураВозвращаемыхЗначений;
КонецФункции

&НаСервере
Функция ПолучитьМассивПроверяемыхРеквизитов()
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Наименование");
	МассивРеквизитов.Добавить("ДрайверОборудования");
	
	Возврат МассивРеквизитов;
КонецФункции

&НаКлиенте
Процедура ОбновнитьДанныеОборудованияНаКлиенте()
	СтруктураДанныхОбновления = ОбновитьОборудованиеНаСервере();
	
	Если ЗначениеЗаполнено(СтруктураДанныхОбновления.ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(, СтруктураДанныхОбновления.ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанныхОбновления.НавигационнаяСсылка) Тогда
		ИмяРеквизитаОборудование = СтрШаблон(НСтр("ru = 'ПодключаемоеОборудование_%1'"), НомерСтраницы);
		ТекстСообщения = НСтр("ru = 'Данные оборудования обновлены'");
		ПоказатьОповещениеПользователя(ТекстСообщения, СтруктураДанныхОбновления.НавигационнаяСсылка, ЭтотОбъект[ИмяРеквизитаОборудование]);
		ИмяРеквизитаДрайвер = СтрШаблон(НСтр("ru = 'ДрайверОборудования_%1'"), НомерСтраницы);
		ОбновитьИнформациюДрайвераОборудования(ЭтотОбъект[ИмяРеквизитаДрайвер]);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбновитьОборудованиеНаСервере()
	
	СтруктураВозвращаемыхЗначений = Новый Структура;
	СтруктураВозвращаемыхЗначений.Вставить("ТекстПредупреждения", "");
	СтруктураВозвращаемыхЗначений.Вставить("НавигационнаяСсылка", "");
	
	СтрокиОборудование = ТаблицаОборудование.НайтиСтроки(Новый Структура("НомерЭлемента", НомерСтраницы));
	
	Если СтрокиОборудование.Количество() = 0 Тогда
		Возврат СтруктураВозвращаемыхЗначений;
	КонецЕсли;
	
	ИмяРеквизитаНаименование = СтрШаблон(НСтр("ru = 'Наименование_%1'"), НомерСтраницы);
	ИмяРеквизитаДрайвер = СтрШаблон(НСтр("ru = 'ДрайверОборудования_%1'"), НомерСтраницы);
	ИмяРеквизитаСерийныйНомер = СтрШаблон(НСтр("ru = 'СерийныйНомер_%1'"), НомерСтраницы);
	ИмяРеквизитаТипПодключения = СтрШаблон(НСтр("ru = 'ТипПодключения_%1'"), НомерСтраницы);
	ИмяРеквизитаОрганизация = СтрШаблон(НСтр("ru = 'Организация_%1'"), НомерСтраницы);
	
	ИмяРеквизитаТипОборудования = СтрШаблон(НСтр("ru = 'ТипОборудования_%1'"), НомерСтраницы);
	ЭтоКасса = ЭтотОбъект[ИмяРеквизитаТипОборудования] = ПолучитьТипОборудования("KKT");
	ЭтоЭквайринг = ЭтотОбъект[ИмяРеквизитаТипОборудования] = ПолучитьТипОборудования("POSTerminal");
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Наименование", ЭтотОбъект[ИмяРеквизитаНаименование]);
	СтруктураДанных.Вставить("ДрайверОборудования", ЭтотОбъект[ИмяРеквизитаДрайвер]);
	Если ЭтоКасса Тогда
		СтруктураДанных.Вставить("ТипПодключения", ЭтотОбъект[ИмяРеквизитаТипПодключения]);
		СтруктураДанных.Вставить("Организация", ЭтотОбъект[ИмяРеквизитаОрганизация]);
	ИначеЕсли ЭтоЭквайринг Тогда
		СтруктураДанных.Вставить("Организация", ЭтотОбъект[ИмяРеквизитаОрганизация]);
	Иначе
		СтруктураДанных.Вставить("СерийныйНомер", ЭтотОбъект[ИмяРеквизитаСерийныйНомер]);
	КонецЕсли;

	СтруктураДанных.Вставить("РабочееМесто", ТекущееРабочееМесто);
	
	МассивПроверяемыхРеквизитов = ПолучитьМассивПроверяемыхРеквизитов();
	ШаблонПредупреждения = НСтр("ru = 'Не заполнен реквизит %1'");
	ТекстПредупреждения = НСтр("ru = ''");
	ПроверкаУспешна = Истина;
	Для Номер = 0 По МассивПроверяемыхРеквизитов.Количество() - 1 Цикл
		Если Не ЗначениеЗаполнено(СтруктураДанных[МассивПроверяемыхРеквизитов[Номер]]) Тогда
			ПроверкаУспешна = Ложь;
			ТекстПредупреждения = СтрШаблон(ШаблонПредупреждения, МассивПроверяемыхРеквизитов[Номер]);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПроверкаУспешна Тогда
		СтруктураВозвращаемыхЗначений.ТекстПредупреждения = ТекстПредупреждения;
		Возврат СтруктураВозвращаемыхЗначений;
	КонецЕсли;
	
	ОбщегоНазначенияРМКПереопределяемый.ОбновитьДанныеОборудованияОборудования(СтрокиОборудование[0].ПодключаемоеОборудование, СтруктураДанных);
	СтруктураВозвращаемыхЗначений.НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СтрокиОборудование[0].ПодключаемоеОборудование);
	Возврат СтруктураВозвращаемыхЗначений;
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыКассы()
	ИмяРеквизитаНаименование = СтрШаблон(НСтр("ru = 'Наименование_%1'"), НомерСтраницы);
	ИмяРеквизитаКассаККМ = СтрШаблон(НСтр("ru = 'КассаККМ_%1'"), НомерСтраницы);
	ЗаполнитьДанныеДрайвера();
	ЭтотОбъект[ИмяРеквизитаНаименование] = СтрШаблон(НСтр("ru = '%1 (%2)'"), ЭтотОбъект[ИмяРеквизитаКассаККМ], ТекущееРабочееМесто);
	Элементы.ГруппаКоманда.Видимость = Истина;
	ЗаголовокКоманды = НСтр("ru = 'Создать экземпляр оборудования'");
	Элементы.ЗаписатьНастройки.Заголовок = ЗаголовокКоманды;
	Элементы.БольшеНастроек.Доступность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДрайвера()
	ИмяРеквизитаДрайвер = СтрШаблон(НСтр("ru = 'ДрайверОборудования_%1'"), НомерСтраницы);
	ИмяРеквизитаТипОборудования = СтрШаблон(НСтр("ru = 'ТипОборудования_%1'"), НомерСтраницы);
	
	СписокДрайверов = ПолучитьДрайверыОборудования(ЭтотОбъект[ИмяРеквизитаТипОборудования]);
	Элементы[ИмяРеквизитаДрайвер].СписокВыбора.Очистить();
	МассивДрайверов = Новый Массив;
	Для Каждого СтрокаДрайвер Из СписокДрайверов Цикл
		Если СтрНайти(СтрокаДрайвер.Представление, Производитель) > 0 Тогда
			Элементы[ИмяРеквизитаДрайвер].СписокВыбора.Добавить(СтрокаДрайвер.Значение, СтрокаДрайвер.Представление);
			МассивДрайверов.Добавить(СтрокаДрайвер.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДрайверов.Количество() > 0
		И Не ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизитаДрайвер]) Тогда
		ЭтотОбъект[ИмяРеквизитаДрайвер] = МассивДрайверов[0];
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыЭквайринг()
	ИмяРеквизитаНаименование = СтрШаблон(НСтр("ru = 'Наименование_%1'"), НомерСтраницы);
	ИмяРеквизитаЭквайринг = СтрШаблон(НСтр("ru = 'ЭквайринговыйТерминал_%1'"), НомерСтраницы);
	ЗаполнитьДанныеДрайвера();
	ЭтотОбъект[ИмяРеквизитаНаименование] = СтрШаблон(НСтр("ru = '%1 (%2)'"), ЭтотОбъект[ИмяРеквизитаЭквайринг], ТекущееРабочееМесто);
	Элементы.ГруппаКоманда.Видимость = Истина;
	ЗаголовокКоманды = НСтр("ru = 'Создать экземпляр оборудования'");
	Элементы.ЗаписатьНастройки.Заголовок = ЗаголовокКоманды;
	Элементы.БольшеНастроек.Доступность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОборудования()
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьДанныеОборудования(ТаблицаОборудование);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСозданиюОборудованияКлиент()
	Элементы.СтраницыНастройки.ТекущаяСтраница = Элементы.СтраницаНастройки;
	Элементы.ЗаписатьНастройки.Важность = ВажностьКнопки.Главная;
	НомерЭлемента = 0;
	Если НастройкаСканер Тогда
		НомерЭлемента = НомерЭлемента + 1;
		НоваяСтрока = ТаблицаОборудование.Добавить();
		НоваяСтрока.ТипОборудования = ПолучитьТипОборудования("BarcodeScanner");
		НоваяСтрока.НомерЭлемента = НомерЭлемента;
	КонецЕсли;
	
	Если НастройкаСчитывательМагнитныхКарт Тогда
		НомерЭлемента = НомерЭлемента + 1;
		НоваяСтрока = ТаблицаОборудование.Добавить();
		НоваяСтрока.ТипОборудования = ПолучитьТипОборудования("CardReader");
		НоваяСтрока.НомерЭлемента = НомерЭлемента;
	КонецЕсли;
	
	Если НастройкаККТ Тогда
		Для Каждого СтрокаКассаККМ Из ТаблицаКассыККМ Цикл
			НомерЭлемента = НомерЭлемента + 1;
			НоваяСтрока = ТаблицаОборудование.Добавить();
			НоваяСтрока.ТипОборудования = ПолучитьТипОборудования("KKT");
			НоваяСтрока.КассаККМ = СтрокаКассаККМ.КассаККМ;
			НоваяСтрока.Организация = СтрокаКассаККМ.Организация;
			НоваяСтрока.НомерЭлемента = НомерЭлемента;
		КонецЦикла;
	КонецЕсли;
	
	Если НастройкаПринтерЧеков Тогда
		НомерЭлемента = НомерЭлемента + 1;
		НоваяСтрока = ТаблицаОборудование.Добавить();
		НоваяСтрока.ТипОборудования = ПолучитьТипОборудования("ReceiptPrinter");
		НоваяСтрока.НомерЭлемента = НомерЭлемента;
	КонецЕсли;
	
	Если НастройкаЭквайринг Тогда
		Для Каждого СтрокаЭквайринг Из ТаблицаЭквайринг Цикл
			НомерЭлемента = НомерЭлемента + 1;
			НоваяСтрока = ТаблицаОборудование.Добавить();
			НоваяСтрока.ТипОборудования = ПолучитьТипОборудования("POSTerminal");
			НоваяСтрока.ЭквайринговыйТерминал = СтрокаЭквайринг.Эквайринг;
			НоваяСтрока.Организация = СтрокаЭквайринг.Организация;
			НоваяСтрока.НомерЭлемента = НомерЭлемента;
		КонецЦикла;
	КонецЕсли;
	
	Если НастройкаДисплейПокупателей Тогда
		НомерЭлемента = НомерЭлемента + 1;
		НоваяСтрока = ТаблицаОборудование.Добавить();
		НоваяСтрока.ТипОборудования = ПолучитьТипОборудования("CustomerDisplay");
		НоваяСтрока.НомерЭлемента = НомерЭлемента;
	КонецЕсли;
	
	Если НастройкаЭлектронныеВесы Тогда
		НомерЭлемента = НомерЭлемента + 1;
		НоваяСтрока = ТаблицаОборудование.Добавить();
		НоваяСтрока.ТипОборудования = ПолучитьТипОборудования("WeighingScales");
		НоваяСтрока.НомерЭлемента = НомерЭлемента;
	КонецЕсли;
	
	Если НастройкаУстройствоРаспознования Тогда
		НомерЭлемента = НомерЭлемента + 1;
		НоваяСтрока = ТаблицаОборудование.Добавить();
		НоваяСтрока.ТипОборудования = ПолучитьТипОборудования("Recognizer");
		НоваяСтрока.НомерЭлемента = НомерЭлемента;
	КонецЕсли;
	
	ЗаполнитьДанныеФормы();
	ПереключательПриИзмененииНаКлиенте();
КонецПроцедуры
#КонецОбласти

#Область ПрограммныйИнтерфейс
&НаКлиенте
Процедура ВыполнитьНастройкуОборудованияЗавершение(Результат, Параметры) Экспорт
	ИмяРеквизитаДрайвер = СтрШаблон(НСтр("ru = 'ДрайверОборудования_%1'"), НомерСтраницы);
	ОбновитьИнформациюДрайвераОборудования(ЭтотОбъект[ИмяРеквизитаДрайвер]);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОбновленияИнформацииДрайвераОборудования(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Свойство("Результат") И РезультатВыполнения.Результат
		И РезультатВыполнения.Свойство("ОписаниеДрайвера") Тогда
		
		ИмяРеквизитаДекорацияДрайвер = СтрШаблон(НСтр("ru = 'ДекорацияДрайверСообщения_%1'"), НомерСтраницы);
		
		ОписаниеДрайвера = РезультатВыполнения.ОписаниеДрайвера;
		
		Если ОписаниеДрайвера.ИнтеграционныйКомпонент Тогда
			
			ТекущийСтатус = НСтр("ru='Установлен интеграционный компонент.'") + Символы.ПС;
			ТекущийСтатус = ТекущийСтатус + ?(ОписаниеДрайвера.ОсновнойДрайверУстановлен,
												НСтр("ru='Установлена основная поставка драйвера.'"),
												НСтр("ru='Основная поставка драйвера не установлена.'"));
												
		Иначе
			ТекущийСтатус = НСтр("ru='Установлен на текущем компьютере.'");
		КонецЕсли;
		
		Если Не ПустаяСтрока(ОписаниеДрайвера.ВерсияДрайвера) Тогда
			
			УстановленнаяВерсия = ОписаниеДрайвера.ВерсияДрайвера;
			Если Не ПустаяСтрока(ОписаниеДрайвера.ВерсияИнтеграционногоКомпонента) Тогда
				УстановленнаяВерсия = УстановленнаяВерсия + "/" + ОписаниеДрайвера.ВерсияИнтеграционногоКомпонента;
			КонецЕсли;
			
			УстановленнаяВерсия = УстановленнаяВерсия + ОписаниеРевизииИнтерфейса(ОписаниеДрайвера.РевизияИнтерфейса);
			ТекущийСтатус = СтрШаблон("%1%2%3", ТекущийСтатус, Символы.ПС, УстановленнаяВерсия);
			
		КонецЕсли;
		
		ИмяРеквизитаТипОборудования = СтрШаблон(НСтр("ru = 'ТипОборудования_%1'"), НомерСтраницы);
		ИмяРеквизитаОборудование = СтрШаблон(НСтр("ru = 'ПодключаемоеОборудование_%1'"), НомерСтраницы);
		ТипСканер = ПолучитьТипОборудования("BarcodeScanner");
		Если ЭтотОбъект[ИмяРеквизитаТипОборудования] = ТипСканер
			И ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизитаОборудование]) Тогда
			ЗаполнитьПараметрыСканераНаСервере(РезультатВыполнения, ЭтотОбъект[ИмяРеквизитаОборудование]);
		КонецЕсли;
		
	Иначе
		
		ТекущаяСтраница = Элементы.СтраницаДекорацииДрайвераНеудача;
		ИмяПоясняющегоЭлемента = "ДекорацияДрайверСообщения";
		ТекущийСтатус = НСтр("ru = 'Драйвер не установлен'");
		
		Если РезультатВыполнения.Свойство("ОписаниеОшибки") Тогда
			ТекущийСтатус = СтрШаблон("%1%2%3", ТекущийСтатус, Символы.ПС, РезультатВыполнения.ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;
	ИмяГруппыБаннер = СтрШаблон(НСтр("ru = 'БаннерИнформация_%1'"), НомерСтраницы);
	ЭлементФормы = Элементы.Найти(ИмяГруппыБаннер);
	Если НЕ Элементы.Найти(ИмяГруппыБаннер) = Неопределено Тогда
		ЭлементФормы.Видимость = ЗначениеЗаполнено(ТекущийСтатус);
	КонецЕсли;
	Элементы[ИмяРеквизитаДекорацияДрайвер].Заголовок = ТекущийСтатус;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтонастройкаУстройстваЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	ТекстСообщения = ?(РезультатВыполнения.Результат, НСтр("ru = 'Операция выполнена успешно.'"), НСтр("ru = 'Операция не выполнена.'"));
	
	Если РезультатВыполнения.Результат Тогда
		Если РезультатВыполнения.ПараметрыПодключения.Количество() > 0 Тогда
			АвтонастройкаУстановитьПараметры(РезультатВыполнения.ПараметрыПодключения);
		Иначе
			ТекстСообщения = НСтр("ru = 'Параметры настройки драйвера не определены.'");
		КонецЕсли;
	КонецЕсли;
	
	ПоказатьПредупреждение(,ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеДрайверов(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	ЗаполнитьДанныеДрайвера();
КонецПроцедуры

#КонецОбласти