#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов.
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Наименование = СформироватьАвтоНаименованиеНаСервере();
	Иначе
		СформироватьАвтоНаименованиеНаСервере();
	КонецЕсли;
	
	Для каждого ВариантНаименования Из Элементы.Наименование.СписокВыбора Цикл
		Если Объект.Наименование = ВариантНаименования.Значение Тогда 
			
			ИспользуетсяАвтоНаименование = Истина;
			
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПодсказкуУсловия();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	НаименованиеИзмененоПользователем = Истина;

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		
		СформироватьАвтоНаименованиеНаКлиенте(); 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УсловиеНачисленияПриИзменении(Элемент)
	
	ОбновитьАвтонаименование(Истина);
	УстановитьПодсказкуУсловия();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеУсловияПриИзменении(Элемент) 
	
	ОбновитьАвтонаименование(Истина); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьАвтонаименование(Обновить = Истина)
	
	НужноИзменитьНаименование = Не ЗначениеЗаполнено(Объект.Наименование);
	Если НЕ НужноИзменитьНаименование И Обновить Тогда
		НужноИзменитьНаименование = ИспользуетсяАвтоНаименование И Не НаименованиеИзмененоПользователем;
	КонецЕсли;
	
	Если НужноИзменитьНаименование Тогда
		
		Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
		ИспользуетсяАвтоНаименование = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция АвтоНаименование(УсловиеНачисления, Значение, ВалютаУчета)
	
	Если УсловиеНачисления
		= ПредопределенноеЗначение("Перечисление.УсловияНачисленияПремийПоЛичнымПродажам.ЗаОбъемПродажСумма") Тогда
		
		Возврат СтрШаблон(НСтр("ru = 'При достижении суммы продаж: %1 %2'"), Значение, ВалютаУчета);
	КонецЕсли;
		
	Если УсловиеНачисления
		= ПредопределенноеЗначение("Перечисление.УсловияНачисленияПремийПоЛичнымПродажам.ЗаОбъемПродажКоличество") Тогда
		
		Возврат СтрШаблон(НСтр("ru = 'При достижении объема продаж в количестве: %1 ед. изм. хранения'"),
			Значение);
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция СформироватьАвтоНаименованиеНаКлиенте()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = АвтоНаименование(Объект.УсловиеНачисленияПремий,
		Объект.ЗначениеУсловияНачисления, ВалютаУчета);
	Если НЕ ПустаяСтрока(СтрокаНаименования) Тогда
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	КонецЕсли;
	
	Возврат СтрокаНаименования;

КонецФункции

&НаКлиенте
Процедура УстановитьПодсказкуУсловия()
	
	Если Объект.УсловиеНачисленияПремий
		= ПредопределенноеЗначение("Перечисление.УсловияНачисленияПремийПоЛичнымПродажам.ЗаОбъемПродажСумма") Тогда
		
		Элементы.ЗначениеУсловияНачисленияРасширеннаяПодсказка.Заголовок
			= СтрШаблон(НСтр("ru = 'В валюте учета %1'"), ВалютаУчета);
	КонецЕсли;
	
	Если Объект.УсловиеНачисленияПремий
		= ПредопределенноеЗначение("Перечисление.УсловияНачисленияПремийПоЛичнымПродажам.ЗаОбъемПродажКоличество") Тогда
		
		Элементы.ЗначениеУсловияНачисленияРасширеннаяПодсказка.Заголовок = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьАвтоНаименованиеНаСервере()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = АвтоНаименование(Объект.УсловиеНачисленияПремий,
		Объект.ЗначениеУсловияНачисления, ВалютаУчета);
	Если НЕ ПустаяСтрока(СтрокаНаименования) Тогда
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	КонецЕсли;
	
	Возврат СтрокаНаименования;

КонецФункции

#КонецОбласти
