
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем МассивВидовЦен;
	
	Если НЕ Параметры.Свойство("ВидыЦен", МассивВидовЦен) Тогда
		
		МассивВидовЦен = Новый Массив;
		
	КонецЕсли;
	
	ТекущийВидыЦен.ЗагрузитьЗначения(МассивВидовЦен);
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ФОУчетЦенКонтрагентов", ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов"));
	КэшЗначений.Вставить("Статический", Перечисления.ТипыВидовЦен.Статический);
	КэшЗначений.Вставить("ДинамическийПроцент", Перечисления.ТипыВидовЦен.ДинамическийПроцент);
	КэшЗначений.Вставить("ДинамическийФормула", Перечисления.ТипыВидовЦен.ДинамическийФормула);
	
	ЗаполнитьДеревоОперандов(МассивВидовЦен);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияРеквизитовФормы

&НаКлиенте
Процедура ВидыЦенИспользованиеПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ВидыЦен.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки <> Неопределено
		И НЕ ЗначениеЗаполнено(ДанныеТекущейСтроки.ВидЦен) Тогда
		
		ПодчиненныеСтроки = ДанныеТекущейСтроки.ПолучитьЭлементы(); 
		Для каждого Строка Из ПодчиненныеСтроки Цикл
			
			ДанныеТекущейСтроки.Свойство("Использование", Строка.Использование);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Результат			= Новый Структура;
	Результат.Вставить("ВыборПроизведен", Истина);
	
	ВыбранныеВидыЦен	= Новый Соответствие;
	
	СтрокиГруппВидовЦен = ВидыЦен.ПолучитьЭлементы();
	Для каждого ГруппаВидовЦен Из СтрокиГруппВидовЦен Цикл
		
		СтрокиБазовыхВидовЦен = ГруппаВидовЦен.ПолучитьЭлементы();
		Для каждого СтрокаБазовогоВидаЦен Из СтрокиБазовыхВидовЦен Цикл
			
			Если НЕ СтрокаБазовогоВидаЦен.Использование Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ПодчиненныеВидыЦен		= Новый Массив;
			СтрокиРасчетныхВидовЦен = СтрокаБазовогоВидаЦен.ПолучитьЭлементы();
			Для каждого СтрокаВидаЦен Из СтрокиРасчетныхВидовЦен Цикл
				
				ПодчиненныеВидыЦен.Добавить(СтрокаВидаЦен.ВидЦен);
				
			КонецЦикла;
			
			ВыбранныеВидыЦен.Вставить(СтрокаБазовогоВидаЦен.ВидЦен, ПодчиненныеВидыЦен);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Результат.Вставить("ВыбранныеВидыЦен", ВыбранныеВидыЦен);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ЗаполнитьДеревоОперандов(МассивВидовЦен)
	
	ДеревоРезультата = Новый ДеревоЗначений;
	
	ВключаяЦеныНоменклатуры = Истина;
	Параметры.Свойство("ЦеныНоменклатуры", ВключаяЦеныНоменклатуры);
	
	ВключаяЦеныКонтрагентов = КэшЗначений.ФОУчетЦенКонтрагентов;
	Если КэшЗначений.ФОУчетЦенКонтрагентов Тогда
		
		Параметры.Свойство("ЦеныКонтрагентов", ВключаяЦеныКонтрагентов);
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДеревоРезультата", ДеревоРезультата);
	СтруктураПараметров.Вставить("МассивВидовЦен", МассивВидовЦен);
	СтруктураПараметров.Вставить("ВключаяЦеныНоменклатуры", ВключаяЦеныНоменклатуры);
	СтруктураПараметров.Вставить("ВключаяЦеныКонтрагентов", ВключаяЦеныКонтрагентов);
	СтруктураПараметров.Вставить("ВидыЦенВыбраныПриЗаполнении", Ложь);
	СтруктураПараметров.Вставить("УникальныйИдентификаторФормы", Неопределено);
		
	Документы.УстановкаЦенНоменклатуры.ПолучитьДеревоВидовЦен(СтруктураПараметров);
	
	ЗначениеВРеквизитФормы(СтруктураПараметров.ДеревоРезультата, "ВидыЦен");
	
КонецПроцедуры

#КонецОбласти
