
#Область ОписаниеПеременных

#Область ПеременныеМодуля

&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	ПереходИзБыстройФормы = Ложь;
	Если Параметры.Свойство("ПереходИзБыстройФормы") Тогда
		ЗаполнитьПоБыстройФорме();
		ПереходИзБыстройФормы = Истина;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ПараметрыКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ПараметрыКонтактнойИнформации.ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ПараметрыКонтактнойИнформации);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	ЗаполнитьКонтактнуюИнформацию();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиУНФ.ЗаполнитьДополнительныеПараметры(Объект,
		"ДополнительныеРеквизиты", , "КомандыОбычные");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	НаборСвойств_Справочник_Контрагенты = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Контрагенты");
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереКонтрагент(ЭтотОбъект, Параметры);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	АвтоподборКонтактов.ПодготовитьРеквизитыДляАвтоподбораИзКлассификатора(ЭтотОбъект, Параметры);
	
	Параметры.Свойство("СопоставитьКонтактИАдресЭПВСобытияхПослеЗаписиОбъекта", СопоставитьКонтактИАдресЭПВСобытияхПослеЗаписиОбъекта);
	СобытиеДляПоказаПослеЗакрытия = Параметры.СобытиеДляПоказаПослеЗакрытия;
	ТекущийЭлемент = Элементы.НаименованиеПолное;
	
	ИспользоватьСобытия = ПолучитьФункциональнуюОпцию("ИспользоватьСобытия");
	ИспользоватьПодсистемуКаналыПродаж = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуКаналыПродаж");
	ИспользоватьПодсистемуМобильныйЛичныйКабинет = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуМобильныйЛичныйКабинет");
	Элементы.Банк.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Банки");
	
	ИспользоватьБыструюФормуКонтрагентовВДокументах = ПерсональныеНастройкиРУНФ.Прочитать("ИспользоватьБыструюФормуКонтрагентовВДокументах");
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Параметры.Свойство("Контакт",ПривязанныйКонтакт);
		Если ЗначениеЗаполнено(Параметры.Наименование) Тогда
			 Объект.НаименованиеПолное = Параметры.Наименование;
		КонецЕсли;
		
		Параметры.ЗначенияЗаполнения.Свойство("ВидОперации", ВидОперацииДокумента);
				
		// Этот фрагмент должен быть до ПриСозданииПриЧтенииНаСервере
		// Создание из документа с установленным признаком вид операции.
		Если Параметры.ДополнительныеПараметры.Свойство("ВидОперации") Тогда
			
			Если Не ТипЗнч(Параметры.ДополнительныеПараметры.ВидОперации) = Тип("Строка") Тогда
				Отношения = КлассификацияКонтактов.ТипОтношенийСКонтрагентомПоВидуОперации(Параметры.ДополнительныеПараметры.ВидОперации);
				ЗаполнитьЗначенияСвойств(Объект, Отношения, "Покупатель,Поставщик,ПрочиеОтношения");
			КонецЕсли;
		
			ВидОперацииДокумента = Параметры.ДополнительныеПараметры.ВидОперации;
			
		ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("ЧекККМ") Тогда
			Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
			Объект.Покупатель = Истина;
		ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("ВыплатыСамозанятым") Тогда
			Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
			Объект.Самозанятый = Истина;
			Объект.ПрочиеОтношения = Истина;
		КонецЕсли;
		// Этот фрагмент должен быть до ПриСозданииПриЧтенииНаСервере
		
		ПриСозданииПриЧтенииНаСервере(ПереходИзБыстройФормы); 
		
		Если Не ПустаяСтрока(Параметры.ТекстЗаполнения) Тогда
			ЗаполнитьРеквизитыПоТекстуЗаполнения(Параметры.ТекстЗаполнения);
		КонецЕсли;
		
		Если Параметры.Свойство("ЭтоКомиссия") Тогда
			ВидОперацииКомиссия = Истина;
			Объект.Покупатель = Истина;
			Объект.Наименование = Параметры.Наименование;
		КонецЕсли;
		
		ЭтотКонтрагентЯвляетсяГоловным = Ложь;
		
		// Форма открыта для создания нового элемента, ссылку на который планируется использовать в дальнейшем, после записи, в вызывающей форме.
		Параметры.Свойство("НеобходимоОповеститьОЗаписиНового", НеобходимоОповеститьОЗаписиНового);
		
	Иначе
		
		ВестиУчетПрослеживаемыхТоваров = ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров");
		Если ВестиУчетПрослеживаемыхТоваров И ЗначениеЗаполнено(Объект.СтранаРегистрации) Тогда
			УчастникЕАЭС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтранаРегистрации, "УчастникЕАЭС");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыплатыСамозанятым") Тогда
		ЭлементСпискаСамозанятый = Элементы.Вид.СписокВыбора.НайтиПоЗначению("Самозанятый");
		Элементы.Вид.СписокВыбора.Удалить(ЭлементСпискаСамозанятый);
	КонецЕсли;
	
	ПерсональныеДанные = НСтр("ru ='Персональные данные'");
	ЦветГиперссылки = ЦветаПалитры.Синий;
	
	ВыполнитьВсеПроверки(ЭтотОбъект);
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
	НастроитьВидимостьРеквизитовВалюты();
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.КомандыЭДО_ФормаЭлементаПриСоздании(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	СПАРКРискиПриСозданииНаСервере();
	
	Если ЗначениеЗаполнено(ПривязанныйКонтакт) Тогда
		Если ЗначениеЗаполнено(Параметры.Наименование) Тогда
			Объект.Наименование = Параметры.Наименование;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
			Объект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПривязанныйКонтакт, "Наименование");
		КонецЕсли;
		
		ТекущийЭлемент = Элементы.НаименованиеПолное;
		Модифицированность = Истина;
	КонецЕсли;
	
	ОбязательноЗаполнятьИсточникВПокупателях = 
		РегистрыСведений.ОбязательностьЗаполненияРеквизитов.ОбязательностьЗаполненияРеквизита("Покупатель", "ИсточникПривлечения");
	
	// Взаиморасчеты
	ЗаполнитьДополнительныеРеквизитыВзаиморасчетов();
		
	ПечатьДокументовУНФ.КорректировкаРазмещениеПодчиненнойГруппыКомандПечати(ЭтотОбъект, Элементы.ПодменюПечать, Элементы.ПодменюДоговорКонтрагента);
	Элементы.КомандыПечатиДоговорКонтрагента.Вид = ВидГруппыФормы.ГруппаКнопок;
	ШаблоныПечатиОфисныхДокументов.ОпределитьВидимостьКомандШаблоновПечати(Элементы.ФормаОткрытьШаблоныПечатиДоговоровКонтрагентов);
	
	УстановитьВидимостьИДоступность();
	ПараметрыДатыОтгрузкиОплаты = Новый Структура("ВестиРасчетыПоДоговорам, Покупатель, КонтрагентСсылка",
			Объект.ВестиРасчетыПоДоговорам, Объект.Покупатель, Объект.Ссылка);
	УстановитьОтображениеНастройкиДатыОтгрузкиОплаты(ПараметрыДатыОтгрузкиОплаты);
	
	ТекущийКонтакт = Неопределено;
	Если Параметры.Свойство("ТекущийКонтакт", ТекущийКонтакт) Тогда
		ТекущиеКонтакты = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("КонтактноеЛицо", ТекущийКонтакт));
		Если ТекущиеКонтакты.Количество() <> 0 Тогда 
			ЭлементКонтакта = Элементы.Найти("НаименованиеКонтакт_" + ДанныеКонтактныхЛиц.Индекс(ТекущиеКонтакты[0]));
			Если ЭлементКонтакта <> Неопределено Тогда
				ТекущийЭлемент = ЭлементКонтакта;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("АктивизироватьГруппуВзаиморасчеты") Тогда
		Элементы.Взаиморасчеты.Показать();
	КонецЕсли;
	
	УстановитьНастройкиКонтроляДублей();
	СозданКопированием = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	
	// КабинетКлиента
	УстановитьОтображениеКабинетаКлиента();
	// Конец КабинетКлиента
	
	УстановитьВидимостьИДоступностьМобильноеПриложениеИРМК();
	
	СоздатьОбновитьКарточкиКИ();
	
	АдаптацияТакси();
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ПустаяСтрока(ОписаниеОшибкиЗаполнения) Тогда
		ОбработчикЗавершенияОбработкиОшибки = Новый ОписаниеОповещения(
		"ОбработатьОшибкуЗаполнитьРеквизитыПоИННЗавершение",
		ЭтотОбъект,
		Объект.ИНН);
		РаботаСКонтрагентамиКлиент.ОбработатьОшибку(ОписаниеОшибкиЗаполнения, ОбработчикЗавершенияОбработкиОшибки);
	КонецЕсли;
	
	УправлениеФормой();
	УстановитьМаскуНомераСчета();
	
	Если ИспользоватьСпаркРиски Тогда
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		СПАРКРискиКлиент.ПриОткрытии(ЭтотОбъект, Объект);
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	КонецЕсли;
	
	// Отключаем проверку контрагентов для РМК
	Если НЕ УправлениеДоступомУНФКлиент.ЕстьПрофильРабочееМестоКассира() Тогда
		// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
		ПроверкаКонтрагентовКлиент.ПриОткрытииКонтрагент(ЭтотОбъект);
		// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеУНФКлиент.КомандыЭДО_ПриОткрытии(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы И ЗначениеЗаполнено(СобытиеДляПоказаПослеЗакрытия) Тогда
		ПоказатьЗначение(, СобытиеДляПоказаПослеЗакрытия);
	КонецЕсли;
	
	Если КонтрагентЗамененНаДубль ИЛИ НеобходимоОповеститьОЗаписиНового Тогда
		ОповеститьОЗаписиНового(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//  Загрузили данные контрагента из XML (БЭД)
	Если СтрНайти("ОбновитьСостояниеЭД", ИмяСобытия) > 0 Тогда
		Прочитать();
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменилисьСчетаРасчетов" И Источник = Объект.Ссылка Тогда
		
		Объект.СчетУчетаРасчетовСПокупателем = Параметр.СчетУчетаРасчетовСПокупателем;
		Объект.СчетУчетаАвансовПокупателя = Параметр.СчетУчетаАвансовПокупателя;
		Объект.СчетУчетаРасчетовСПоставщиком = Параметр.СчетУчетаРасчетовСПоставщиком;
		Объект.СчетУчетаАвансовПоставщику = Параметр.СчетУчетаАвансовПоставщику;
		Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия = "УстановкаОсновногоСчета" И Параметр.Владелец = Объект.Ссылка Тогда

		Объект.БанковскийСчетПоУмолчанию = Параметр.НовыйОсновнойСчет;
		ПрочитатьБанковскийСчетПоУмолчанию(Объект.БанковскийСчетПоУмолчанию);
		
		Если Не Модифицированность Тогда
			Записать();
		КонецЕсли;
		Оповестить("УстановкаОсновногоСчетаВыполнена");
		
	ИначеЕсли ИмяСобытия = "УстановкаОсновногоСчета" И Параметр.Владелец = Объект.Ссылка Тогда
		
		Объект.БанковскийСчетПоУмолчанию = Параметр.НовыйОсновнойСчет;
		Если НЕ Модифицированность Тогда
			Записать();
		КонецЕсли;
		Оповестить("УстановкаОсновногоСчетаВыполнена");
		
	ИначеЕсли ИмяСобытия = "УстановкаКонтактногоЛица" И Параметр.Контрагент = Объект.Ссылка Тогда
		
		Объект[Параметр.Реквизит] = Параметр.КонтактноеЛицо;
		Если НЕ Модифицированность Тогда
			Записать();
		КонецЕсли;
		Оповестить("УстановкаРеквизитаВыполнена",Параметр.КонтактноеЛицо);
		
	ИначеЕсли ИмяСобытия = "Запись_КонтактноеЛицо" 
		И (ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("КонтактноеЛицо",Параметр.КонтактноеЛицо)).Количество() <> 0
		ИЛИ (Источник <> Неопределено И Источник.ВладелецФормы = ЭтотОбъект)) Тогда
		
		ОбновитьДанныеОбъекта();
		ЗаполнитьИОбновитьКонтактныеЛица();
		Если НЕ Модифицированность Тогда
			Записать();
			Прочитать();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Выбор_КонтактноеЛицо" Тогда
		
		Если Источник.ВладелецФормы = Неопределено Тогда
			Возврат;
		КонецЕсли;  
		Если Источник.ВладелецФормы = ЭтотОбъект Тогда
			ОбновитьЭлементТаблицыКонтактныхЛиц(ИндексВыбранногоКонтактногоЛица,Параметр.Контакт);
			Если НЕ Модифицированность Тогда
				Записать();
				Прочитать();
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "УстановитьСвязь_Дубли" И (Источник <> Неопределено И Источник.ВладелецФормы = ЭтотОбъект) Тогда
		
		НовоеКонтактноеЛицо = ДанныеКонтактныхЛиц.Добавить();		
		ИндексКонтактногоЛица = ДанныеКонтактныхЛиц.Индекс(НовоеКонтактноеЛицо);
		ОбновитьЭлементТаблицыКонтактныхЛиц(ИндексКонтактногоЛица,Параметр.КонтактноеЛицо);

	ИначеЕсли ИмяСобытия = "Запись_ШаблоныПечатиОфисныхДокументов" И Параметр.Свойство("Назначение") Тогда
		
		Если Параметр.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагента") Тогда
			ГруппаКомандПечати = Элементы.ПодменюДоговорКонтрагента;
			ШаблоныПечатиОфисныхДокументовКлиент.УстановитьПризнакПоявленияНовойКомандыПечати(ГруппаКомандПечати);
		КонецЕсли;

	ИначеЕсли ИмяСобытия = "ИзмененаНастройкаДатыОтгрузкиВДоговоре" И Параметр.Владелец = Объект.Ссылка 
		И НЕ Объект.ВестиРасчетыПоДоговорам Тогда
		
		ПараметрыДатыОтгрузкиОплаты = Новый Структура("КонтрагентСсылка", Объект.Ссылка);
		ТекстЗаголовкаДатыОтгрузки = ПолучитьТекстСсылкиДатыОтгрузки(ПараметрыДатыОтгрузкиОплаты);
		Элементы.ДекорацияНастройкаДатыОтгрузки.Подсказка = ТекстЗаголовкаДатыОтгрузки;
	
		Если СтрДлина(ТекстЗаголовкаДатыОтгрузки) > 50 Тогда
			ТекстЗаголовка = Лев(ТекстЗаголовкаДатыОтгрузки, 47) + "...";
		КонецЕсли;		
		ДекорацияНастройкаДатыОтгрузки = ТекстЗаголовкаДатыОтгрузки;	
	
	ИначеЕсли ИмяСобытия = "ПовторноеОткрытиеФормыИзПодсказкиПоВзаиморасчетам" Тогда
		
		Элементы.Взаиморасчеты.Показать();
		
	Иначе
		
		// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		ЭлектронноеВзаимодействиеУНФКлиент.КомандыЭДО_ФормаЭлементаОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
		// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда // Не локализуется
		Если Источник = "ФункциональнаяУчетВалютныхОпераций" Тогда // Не локализуется
			НастроитьВидимостьРеквизитовВалюты();
		КонецЕсли;
	КонецЕсли;
	
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
	Если ИспользоватьСпаркРиски Тогда
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		СПАРКРискиКлиент.ОбработкаОповещения(ЭтотОбъект, Объект, ИмяСобытия, Параметр, Источник);
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	ИспользоватьСобытия = ПолучитьФункциональнуюОпцию("ИспользоватьСобытия");
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, ИмяЭлементаДляРазмещения);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриСозданииПриЧтенииНаСервере();
	ЗаполнитьДополнительныеРеквизитыВзаиморасчетов();
	ПрочитатьБанковскийСчетПоУмолчанию(ТекущийОбъект.БанковскийСчетПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если СозданКопированием И Элементы.ФормаПроверитьКонтрагентаНаДубли.Видимость Тогда
		
		Состояние(НСтр("ru='Проверка контрагента на дубли'"), 49);
		ПроверитьКонтрагентаНаДублиСервер();
		Состояние(НСтр("ru='Проверка контрагента на дубли'"), 100);
		
		ПоказатьСообщениеОДублях();
	КонецЕсли;
	
	Если Элементы.НаименованиеПолное.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу
		ИЛИ Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу ИЛИ ДублиКИ.Количество() > 0 Тогда
		ПоказатьПредупреждениеОДублях();
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// СтандартныеПодсистемы.ОценкаПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени("СправочникКонтрагентыЗапись");
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереКонтрагент(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	ТегированиеОбъектов.ПередЗаписьюНаСервере(ЭтотОбъект,ТекущийОбъект);
	
	ОсновноеКонтактноеЛицо = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("Основной", Истина));
	Если ОсновноеКонтактноеЛицо.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(ОсновноеКонтактноеЛицо[0].КонтактноеЛицо) Тогда
			ТекущийОбъект.КонтактноеЛицо = ОсновноеКонтактноеЛицо[0].КонтактноеЛицо
		Иначе
			ТекущийОбъект.КонтактноеЛицо = Справочники.КонтактныеЛица.ПолучитьСсылку();
			ТекущийОбъект.ДополнительныеСвойства.Вставить("НовоеОсновноеКонтактноеЛицо", ТекущийОбъект.КонтактноеЛицо);
		КонецЕсли;
	КонецЕсли;
	
	КонтактноеЛицоПодписант = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("Подписант", Истина));
	Если КонтактноеЛицоПодписант.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(КонтактноеЛицоПодписант[0].КонтактноеЛицо) Тогда
			ТекущийОбъект.КонтактноеЛицоПодписант = КонтактноеЛицоПодписант[0].КонтактноеЛицо;
		Иначе
			ТекущийОбъект.КонтактноеЛицоПодписант = Справочники.КонтактныеЛица.ПолучитьСсылку();
			ТекущийОбъект.ДополнительныеСвойства.Вставить("НовоеКонтактноеЛицоПодписант", ТекущийОбъект.КонтактноеЛицо);
		КонецЕсли;
	КонецЕсли;

	ПараметрыОтбораКонтактноеЛицо = Новый Структура;
	ПараметрыОтбораКонтактноеЛицо.Вставить("КонтактноеЛицо",ТекущийОбъект.КонтактноеЛицо);
	НайденноеКонтактноеЛицо = НедействительныеСвязиКонтактныеЛица.НайтиСтроки(ПараметрыОтбораКонтактноеЛицо);
	
	ПараметрыОтбораКонтактноеЛицоПодписант = Новый Структура;
	ПараметрыОтбораКонтактноеЛицоПодписант.Вставить("КонтактноеЛицо",ТекущийОбъект.КонтактноеЛицоПодписант);
	НайденноеКонтактноеЛицоПодписант = НедействительныеСвязиКонтактныеЛица.НайтиСтроки(ПараметрыОтбораКонтактноеЛицоПодписант);
	
	Если НайденноеКонтактноеЛицо.Количество() <> 0 Тогда
		ТекущийОбъект.КонтактноеЛицо = Неопределено;
	КонецЕсли;
	
	Если НайденноеКонтактноеЛицоПодписант.Количество() <> 0 Тогда
		ТекущийОбъект.КонтактноеЛицоПодписант = Неопределено;
	КонецЕсли;
			
	// Заполним основное контактное лицо первым имеющимся
	Если Не ЗначениеЗаполнено(ТекущийОбъект.КонтактноеЛицо) Тогда
		Для Каждого ДанныеКЛ Из ДанныеКонтактныхЛиц Цикл
			Если ЗначениеЗаполнено(ДанныеКЛ.КонтактноеЛицо) Тогда
				ТекущийОбъект.КонтактноеЛицо = ДанныеКЛ.КонтактноеЛицо;
				Прервать;
			ИначеЕсли Не ПустаяСтрока(ДанныеКЛ.Наименование) И ТипЗнч(ДанныеКЛ.Наименование) = Тип("Строка") Тогда
				ТекущийОбъект.КонтактноеЛицо = Справочники.КонтактныеЛица.ПолучитьСсылку();
				ТекущийОбъект.ДополнительныеСвойства.Вставить("НовоеОсновноеКонтактноеЛицо", ТекущийОбъект.КонтактноеЛицо);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// Заполним информацию о записываемых контактных лицах для реквизита "ОсновныеСведения"
	ТаблицаКонтактнойИнформацииКонтактныхЛиц = КонтактнаяИнформацияУНФ.ПолучитьТаблицуКонтактнойИнформацииКонтактныхЛиц(ЭтотОбъект, Объект.Ссылка);	
	МассивСтрок = Новый Массив;       
	ИндексКонтактногоЛица = 0;	   	
	Для Каждого ДанныеКЛ Из ДанныеКонтактныхЛиц Цикл
		
		Если ПустаяСтрока(ДанныеКЛ.Наименование) Тогда  
			ИндексКонтактногоЛица = ИндексКонтактногоЛица + 1;				
			Продолжить;
		КонецЕсли;
		
		Если МассивСтрок.Количество() > 0 Тогда
			МассивСтрок.Добавить(Символы.ПС);
		КонецЕсли;
		
		МассивСтрок.Добавить(ДанныеКЛ.Наименование);
		Если ЗначениеЗаполнено(ДанныеКЛ.КонтактноеЛицо) Тогда
			СтрокиКонтактнойИнформации = ТаблицаКонтактнойИнформацииКонтактныхЛиц.НайтиСтроки(Новый Структура("КонтактноеЛицо", ДанныеКЛ.КонтактноеЛицо)); 
		Иначе
			СтрокиКонтактнойИнформации = ТаблицаКонтактнойИнформацииКонтактныхЛиц.НайтиСтроки(Новый Структура("ИндексКонтактногоЛица", 
					?(ИндексКонтактногоЛица = 0, "0", Формат(ИндексКонтактногоЛица, "ЧГ="))));
		КонецЕсли;      
		
		Для Каждого СтрокаКИ Из СтрокиКонтактнойИнформации Цикл
			Если ПустаяСтрока(СтрокаКИ.Представление) Тогда
				Продолжить;
			КонецЕсли;
			МассивСтрок.Добавить(СтрокаКИ.Представление);
		КонецЦикла;
		
		ИндексКонтактногоЛица = ИндексКонтактногоЛица + 1;
		
	КонецЦикла;     
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ОсновныеСведенияКонтактныхЛиц", МассивСтрок);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоГоловной", ЭтотКонтрагентЯвляетсяГоловным);
	// Заполним основной банковский счет
	УстановитьБанковскийСчетПоУмолчанию(ТекущийОбъект);
	
	Если ПроигнорированоСообщениеОДублях Тогда 
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоЗаписьДубля");
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СообщениеОДублированииИнформации", СообщениеОДублированииИнформации);
	КонецЕсли;
	
	ПроигнорированоСообщениеОДублях = Ложь;
	СообщениеОДублированииИнформации = "";

	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность", Модифицированность);
	// Конец Обсуждения

	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзФормыЭлементаКонтрагента", Истина);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ВидОперацииКомиссия", ВидОперацииКомиссия);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ВидОперации", ВидОперацииДокумента);    
	
	Если Объект.Ссылка.Пустая() Тогда
		СтатистикаПоПоказателямКлиентСервер.ДобавитьСобытие("Данные.Контрагенты.ЗаписьНового");
	Иначе
		СтатистикаПоПоказателямКлиентСервер.ДобавитьСобытие("Данные.Контрагенты.Запись");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьДанныеКонтактныхЛиц(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	Если ИзменилиБанковскийСчет Тогда
		ЗаписатьБанковскийСчетПоУмолчанию(ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	ПривязанныйКонтакт = Неопределено;
	ЗаполнитьИОбновитьКонтактныеЛица();
	СоздатьОбновитьКарточкиКИ();
	
	Если ИспользоватьСпаркРиски Тогда
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		СПАРКРиски.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	КонецЕсли;
	
	//Обсуждения
	ОбсужденияУНФ.ПослеЗаписиНаСервере(ТекущийОбъект);	
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	СтруктураПараметров = Новый Структура("Ссылка, ИзменилиКонтактнуюИнформацию", Объект.Ссылка, ИзменилиКонтактнуюИнформацию);
	Оповестить("Запись_Контрагент", СтруктураПараметров, ЭтотОбъект);
	
	Для Каждого КонтактноеЛицо Из ДанныеКонтактныхЛиц Цикл
		Оповестить("ИзменениеКонтактногоЛица_Контрагент",КонтактноеЛицо.КонтактноеЛицо,ЭтотОбъект);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПроверитьЗаполнениеКонтактныхЛиц(Отказ);
	
	Если Не ПустаяСтрока(ОсновнойСчет_Номер) И Не ЗначениеЗаполнено(ОсновнойСчет_Банк) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения( , "Заполнение", НСтр("ru = 'Банк'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ОсновнойСчет_Банк", , Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновнойСчет_Банк) И ПустаяСтрока(ОсновнойСчет_Номер) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения( , "Заполнение", НСтр("ru = 'Номер счета'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ОсновнойСчет_Номер", , Отказ);
	КонецЕсли;
	
	Если Объект.Покупатель Тогда
		РегистрыСведений.ОбязательностьЗаполненияРеквизитов.ПроверитьОбязательноеЗаполнениеИсточникаПривлеченияНаФорме(
		"Покупатель", Объект, Отказ, "ИсточникПривлеченияПокупателя");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Справочник.Контрагенты.Форма.РедактированиеИсторииНаименований") Тогда
		
		УстановитьНаименованиеПослеРедактированияИстории(ВыбранноеЗначение.ИсторияНаименований);
		
	ИначеЕсли ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Справочник.Контрагенты.Форма.РедактированиеИсторииКПП") Тогда
		
		УстановитьКПППослеРедактированияИстории(ВыбранноеЗначение.ИсторияКПП);
			
	КонецЕсли;
	
	Если ВыбранДубльКонтакта = Истина Тогда			
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выбран дубль контакта! Дублирование контактов в карточке контрагента не допускается'"),,);
		ВыбранДубльКонтакта = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНаУстановкуНажатие(Элемент)
	НастройкиПубликацииМЛККлиент.СкопироватьВБуферОбмена("http://onelink.to/phnsu5", НСтр("ru = 'Ссылка на установку скопирована.'"));
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияQRКодНаУстановкуНажатие(Элемент)
	НачатьПолучениеФайлаССервера(АдресQRКодаДляСкачивания(), НСтр("ru = 'QR-код для установки приложения.png'"));
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКодКлиентаQRКодНажатие(Элемент)
	НачатьПолучениеФайлаССервера(ПолучитьQRКод(КабинетКлиентаКодКлиента), СтрШаблон(НСтр("ru = 'QR-код клиента (%1).png'"),Объект.Наименование));
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКодКомпанииQRКодНажатие(Элемент)
	НачатьПолучениеФайлаССервера(ПолучитьQRКод(), НСтр("ru = 'QR-код компании.png'"));
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияУстановитьИндивидуальныеЦеныНажатие(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьВопросУстановитьИндивидуальныеЦены",ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.'")
		+ Символы.ПС + НСтр("ru = 'Переход к установке индивидуальных цен возможен только после записи данных.'")
		+ Символы.ПС + НСтр("ru = 'Данные будут записаны'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Контрагент",Объект.Ссылка);
	ПараметрыФормы.Вставить("УстановитьИндивидуальныеЦены", Истина);
	ПараметрыФормы.Вставить("Ключ", ПолучитьСсылкуНаКонструктор());
	Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторЗавершение",ЭтотОбъект);
	ОткрытьФорму("Справочник.НастройкиПубликацииМЛК.Форма.КонструкторМобильногоПриложения", ПараметрыФормы,,,,,Оповещение);
	Оповестить("УстановитьИндивидуальныеЦены", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура КабинетКлиентаОткрытьНастройкиНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", ПолучитьСсылкуНаКонструктор());
	Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторЗавершение",ЭтотОбъект);
	ОткрытьФорму("Справочник.НастройкиПубликацииМЛК.Форма.КонструкторМобильногоПриложения", ПараметрыФормы,,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкаДатыОплатыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьВопросЗаполнениеДатыОплаты",ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.'")
		+ Символы.ПС + НСтр("ru = 'Переход к настройке заполнения даты оплаты в заказах покупателей возможен только после записи данных'")
		+ Символы.ПС + НСтр("ru = 'Данные будут записаны'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
		
	ОсновнойДоговор = ПолучитьОсновнойДоговор();
	ПараметрыНастроек = Новый Структура("ДоговорКонтрагента", ОсновнойДоговор);
	ДопПараметр = Новый Структура("ДоговорКонтрагента", ОсновнойДоговор);
	Оповещение = Новый ОписаниеОповещения("НастройкаДатыОплатыЗавершение", ЭтотОбъект, ДопПараметр);
	ОткрытьФорму("Обработка.НастройкаЗаполненияДатыОплаты.Форма.ФормаНастроек", ПараметрыНастроек, , , , ,
		 Оповещение);
		 
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкаДатыОтгрузкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьВопросЗаполнениеДатыОтгрузки",ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.'")
		+ Символы.ПС + НСтр("ru = 'Переход к настройке заполнения даты отгрузки в заказах покупателей возможен только после записи данных'")
		+ Символы.ПС + НСтр("ru = 'Данные будут записаны'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
		
	ОсновнойДоговор = ПолучитьОсновнойДоговор();
	ПараметрыНастроек = Новый Структура("ДоговорКонтрагента", ОсновнойДоговор);
	ДопПараметр = Новый Структура("ДоговорКонтрагента", ОсновнойДоговор);
	Оповещение = Новый ОписаниеОповещения("НастройкаДатыОтгрузкиЗавершение", ЭтотОбъект, ДопПараметр);
	ОткрытьФорму("Обработка.НастройкаЗаполненияДатыОтгрузки.Форма.ФормаНастроек", ПараметрыНастроек, , , , ,
		 Оповещение);
		 
КонецПроцедуры

&НаКлиенте
Процедура ВалютаРасчетовПоУмолчаниюПриИзменении(Элемент)
	
	Если Объект.ВалютаРасчетовПоУмолчанию = НациональнаяВалюта Тогда
		Объект.РасчетыВУсловныхЕдиницахПоУмолчанию = Ложь;
	КонецЕсли;
	УстановитьВидимостьФлагаВ_УЕ();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
#Если Не ВебКлиент Тогда
	
	ТекущийТекстНомераСчета = СтрЗаменить(Текст, " ", "");
	
	Если ЯвляетсяБанкомРФ И ТекущийТекстНомераСчета <> Неопределено Тогда
		
		ДлинаСчетаРФ = 20;
		КоличествоЦифрВСчете = СтрДлина(ТекущийТекстНомераСчета);
		
		Если ДлинаСчетаРФ <> КоличествоЦифрВСчете Тогда
			
			ТекстСообщения = НСтр("ru = 'Осталось ввести %1'");
			СклоняемыйТекст = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 цифру;;%1 цифры;%1 цифр;%1 цифры'"), ДлинаСчетаРФ - КоличествоЦифрВСчете);
			
			ПодсказкаНомераСчета = СтрШаблон(ТекстСообщения, СклоняемыйТекст);
			
		Иначе
			ПодсказкаНомераСчета = "";
		КонецЕсли;
		
	Иначе
		ПодсказкаНомераСчета = "";
	КонецЕсли;
	
#КонецЕсли
	
	ИзменилиБанковскийСчет = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональныеДанныеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ЖурналДокументов.СогласияНаОбработкуПерсональныхДанных.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРазнесенияОплатыПоУмолчаниюРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиКНастройкеВзаиморасчетов(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаПредоплатыПоУмолчаниюРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиКНастройкеВзаиморасчетов(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	
	ИзменилиБанковскийСчет = Истина;
	ЯвляетсяБанкомРФ = ЯвляетсяБанкомРФ(ОсновнойСчет_Банк);
	УстановитьМаскуНомераСчета();
	
КонецПроцедуры

&НаКлиенте
Процедура БанкНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Банки.ФормаВыбора", , Элемент);

КонецПроцедуры

&НаКлиенте
Процедура БанкОчистка(Элемент, СтандартнаяОбработка)

	Элементы.Банк.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Банки");

КонецПроцедуры

&НаКлиенте
Процедура БанкСоздание(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Банки.ФормаОбъекта", , Элемент);

КонецПроцедуры

&НаКлиенте
Процедура БанкОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	Если ВыбранноеЗначение = "ЗагрузитьКлассификатор" Тогда
		СтандартнаяОбработка = Ложь;
		РаботаСБанкамиКлиент.ОткрытьФормуЗагрузкиКлассификатора();
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) <> Тип("СправочникСсылка.КлассификаторБанков") Тогда
		Возврат;
	КонецЕсли;

	НайденныйБанк = БанкиУНФВызовСервера.СсылкаНаБанкИзКлассификатора(ВыбранноеЗначение);
	Если ЗначениеЗаполнено(НайденныйБанк) Тогда
		ВыбранноеЗначение = НайденныйБанк;
	Иначе
		Элементы.Банк.ОграничениеТипа = Новый ОписаниеТипов;
	КонецЕсли;
	ИзменилиБанковскийСчет = Истина;

КонецПроцедуры

&НаКлиенте
Процедура БанкАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	ДанныеВыбора = БанкиУНФВызовСервера.БанкАвтоПодборДанныеВыбора(Текст);

КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	ИзменилиБанковскийСчет = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГоловнойКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение)
		И Объект.Ссылка = ВыбранноеЗначение Тогда
		
		ВыбранноеЗначение = Неопределено;
		
		ТекстСообщения = НСтр("ru ='Выбрано некорректное значение для головного контрагента.
			|Головной контрагент совпадает с текущим.'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , , "Объект.ГоловнойКонтрагент");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокВзаиморасчетовНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ОтборРасшифровки = Новый Структура;
	ОтборРасшифровки.Вставить("Контрагент", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("Отбор", ОтборРасшифровки);
	Вариант =  СсылкаВариантаОтчета("АктСверки", "АктСверкиКонтекст");
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант, ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПродажНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "ДинамикаПродажПоПокупателям");
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Период,Контрагент", Новый СтандартныйПериод, Объект.Ссылка));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.Продажи.Форма", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)
	
	Объект.НаименованиеПолное = СтрЗаменить(Объект.НаименованиеПолное, Символы.ПС, " ");
	ПриИзмененииНаименованияКонтрагента();
		
	ОпределитьВидКонтрагента(ЭтотОбъект);
	УправлениеФормой();
	
	Если НЕ ПроверятьЮрНазваниеНаДубли И ПроверятьПредставлениеНаДубли Тогда
		ПроверитьНаДубли("Наименование");
	КонецЕсли;
	
	Если НЕ ПроверятьЮрНазваниеНаДубли Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.НаименованиеПолное)) Тогда
		Элементы.НаименованиеПолное.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Возврат;
	КонецЕсли;
	
	ПроверитьНаДубли("НаименованиеПолное");

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если НЕ ПроверятьПредставлениеНаДубли Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.Наименование)) Тогда
		Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Возврат;
	КонецЕсли;
	
	НаименованиеДляПоискаДублей = НаименованиеДляПоискаДублей(Объект.Наименование);
	ПроверитьНаДубли("Наименование");

КонецПроцедуры

&НаКлиенте
Процедура ВидКонтрагентаПриИзменении(Элемент)
	
	ПриИзмененииВидаКонтрагента();

	ВыполнитьВсеПроверки(ЭтотОбъект);

	Если ВестиУчетПрослеживаемыхТоваров
		И Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ГосударственныйОрган") Тогда
		УчастникЕАЭС = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтранаРегистрации)
		И Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо") Тогда
		Объект.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	КонецЕсли;
	
	УправлениеФормой();
	СохранитьВосстановитьВведенноеЗначениеКПП();
	
	Если ИспользоватьСпаркРиски Тогда
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		ИндексыСПАРКРиски = Неопределено;
		ФакторыРискаСПАРК = Неопределено;
		ОбновитьОтображениеИндексыСПАРК();
		ОбновитьОтображениеФакторовРискаСПАРК();
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура СтранаРегистрацииПриИзменении(Элемент)
	
	СформироватьПредставлениеПроверкиОГРН(ЭтотОбъект);
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(ЭтотОбъект);
	
	УправлениеФормой();
	
	Если ИспользоватьСпаркРиски Тогда
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		ИндексыСПАРКРиски = Неопределено; 
		ФакторыРискаСПАРК = Неопределено;
		ОбновитьОтображениеИндексыСПАРК();
		ОбновитьОтображениеФакторовРискаСПАРК();
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	Если ВестиУчетПрослеживаемыхТоваров Тогда
		Если ЗначениеЗаполнено(Объект.СтранаРегистрации) Тогда
			СтранаРегистрацииПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	СформироватьПредставлениеПроверкиИНН(ЭтотОбъект);
	
	Если Объект.ИННВведенКорректно И ПустаяСтрока(Объект.КПП) И Элементы.КПП.Видимость Тогда
		РаботаСКонтрагентамиУНФКлиент.ЗаполнитьКПППоИНН(Объект.ИНН, Объект.КПП);
	КонецЕсли;
	
	СформироватьПредставлениеПроверкиДублей(ЭтотОбъект);
	
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(ЭтотОбъект);
	
	Если Не ПустаяСтрока(Объект.ИНН) И Объект.ИННВведенКорректно И Не КлючевыеРеквизитыЗаполнены(ЭтотОбъект) Тогда
		// обновление индексов СПАРКРиски происходит при заполнении реквизитов
		ВыполнитьЗаполнениеРеквизитовПоИНН(Объект.ИНН);
	Иначе
		// если реквизиты не были заполнены требуется обновление индексов
		Если ИспользоватьСпаркРиски Тогда
			// ИнтернетПоддержкаПользователей.СПАРКРиски
			ИндексыСПАРКРиски = Неопределено;
			ФакторыРискаСПАРК = Неопределено;
			ОбновитьОтображениеИндексыСПАРК();
			ОбновитьОтображениеФакторовРискаСПАРК();
			// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
		КонецЕсли;
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура КПППриИзменении(Элемент)
	
	СформироватьПредставлениеПроверкиКПП(ЭтотОбъект);
	СформироватьПредставлениеПроверкиДублей(ЭтотОбъект);
	
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(ЭтотОбъект);
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура КодПоОКПОПриИзменении(Элемент)
	
	СформироватьПредставлениеПроверкиОКПО(ЭтотОбъект);
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйНомерПриИзменении(Элемент)
	
	СформироватьПредставлениеПроверкиОГРН(ЭтотОбъект);
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидГосударственногоОрганаПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПроверкиДанныхОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, "ПоказатьДубли") > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИНН", СокрЛП(Объект.ИНН));
		ПараметрыФормы.Вставить("КПП", СокрЛП(Объект.КПП));
		ПараметрыФормы.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
		ПараметрыФормы.Вставить("ИсключаяКонтакты", Новый Массив);
		ПараметрыФормы.Вставить("ЭтоЮрЛицо", ЭтоЮрЛицо(Объект.ВидКонтрагента));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораДублей", ПараметрыФормы, Элемент,,,,ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИндексыСПАРКРискиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, Элемент,
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	
КонецПроцедуры

&НаКлиенте
Процедура ГоловнойКонтрагентПриИзменении(Элемент)
	
	ГоловнойКонтрагентПриИзмененииНаСервере();
	
	УправлениеФормой();
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ДублиПоПолномуНаименованиюНажатие(Элемент)
	
	ПараметрыДублей = Новый Структура;	
	МассивКонтактов = Новый Массив;
	
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		МассивКонтактов.Добавить(Контакт.КонтактноеЛицо);
	КонецЦикла;
	
	ПараметрыДублей.Вставить("ИсключаяКонтакты", МассивКонтактов);
	ПараметрыДублей.Вставить("НаименованиеПолное", НаименованиеПолноеДляПоискаДублей);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДублиПоПредставлениюНажатие(Элемент)
	
	ПараметрыДублей = Новый Структура;
	МассивКонтактов = Новый Массив;
	
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		МассивКонтактов.Добавить(Контакт.КонтактноеЛицо);
	КонецЦикла;
	
	ПараметрыДублей.Вставить("ИсключаяКонтакты", МассивКонтактов);
	ПараметрыДублей.Вставить("Наименование", НаименованиеДляПоискаДублей);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияНажатие(Элемент)
	ОповещениеОВыбореКонтрагента = Новый ОписаниеОповещения("ВыборКонтрагентаИзИерархии",ЭтотОбъект);
	
	ГоловнойКонтрагент = Объект.ГоловнойКонтрагент;
	КонтрагентТекущий = Объект.Ссылка;
	
	СписокИерархии = СписокЗначенийИерархииКонтрагента(ГоловнойКонтрагент,
		КонтрагентТекущий);
		
	ПоказатьВыборИзМеню(ОповещениеОВыбореКонтрагента,СписокИерархии,Элементы.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДляВключенияОпцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасчетыРаботаСФормамиКлиент.ОткрытьДиалогВключенияНесколькихВалют();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЛидыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Объект.Ссылка);
	ОткрытьФорму("Справочник.Лиды.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоследняяПродажаНадписьНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ОбщегоНазначенияСлужебныйКлиент.ЭтоНавигационнаяСсылка(СсылкаНаДокументПоследнейПродажи) Тогда
		ПерейтиПоНавигационнойСсылке(СсылкаНаДокументПоследнейПродажи);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоследнееСобытиеНадписьНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ОбщегоНазначенияСлужебныйКлиент.ЭтоНавигационнаяСсылка(СсылкаНаДокументПоследнегоСобытия) Тогда
		ПерейтиПоНавигационнойСсылке(СсылкаНаДокументПоследнегоСобытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КППРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ВидКИЮрАдрес" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначениеАсинх(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента"));
		
	КонецЕсли;
	
КонецПроцедуры

#Область Теги

&НаКлиенте
Процедура СписокТеговАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	БыстрыеФормыУНФКлиент.ТегиАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокТеговОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	БыстрыеФормыУНФКлиент.СписокТеговОбработкаВыбора(ВыбранноеЗначение, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТеговОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	БыстрыеФормыУНФКлиент.СписокТеговОкончаниеВводаТекста(Текст, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАналитикаВзаиморасчетов

&НаКлиенте
Процедура АналитикаВзаиморасчетовДолгиПриИзменении(Элемент)
	
	Таблица = Элемент.Родитель;
	Если Таблица = Неопределено Или Таблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Таблица.ТекущиеДанные;
	СмотретьПо = ТекущиеДанные.СмотретьПо;
	
	Если СмотретьПо = "ПоДоговорам" Тогда
		
		Объект.ВестиРасчетыПоДоговорам = ТекущиеДанные.Долги;
		
		СформироватьЗаголовокГруппыДеньги();
		УстановитьЗаголовкиИВидимостьПриИзмененииФлагаРасчетовПоДоговорам();
		ПараметрыДатыОтгрузкиОплаты = Новый Структура("ВестиРасчетыПоДоговорам, Покупатель, КонтрагентСсылка",
			Объект.ВестиРасчетыПоДоговорам, Объект.Покупатель, Объект.Ссылка);
		УстановитьОтображениеНастройкиДатыОтгрузкиОплаты(ПараметрыДатыОтгрузкиОплаты);
		
	ИначеЕсли СмотретьПо = "ПоДокументам" Тогда
		
		Объект.ВестиРасчетыПоДокументам = ТекущиеДанные.Долги;
		
		Если ВключенаОтчетность() И НЕ Объект.ВестиРасчетыПоДокументам Тогда
			
			ТекущиеДанные.Долги = Истина;
			Объект.ВестиРасчетыПоДокументам = Истина;
			ПоказатьПредупреждение(,НСтр("ru = 'При включенном разделе ""Налоги"" необходимо всегда вести расчеты по документам'"));
			
		КонецЕсли;
		
		ТекущиеДанные.Оплата = ТекущиеДанные.Долги;
		СформироватьЗаголовокГруппыДеньги();
		
	ИначеЕсли СмотретьПо = "ПоЗаказам" Тогда
		
		Объект.ВестиРасчетыПоЗаказам = ТекущиеДанные.Долги;
		
		Если Объект.ВестиРасчетыПоЗаказам И ЕстьКомиссияБезЗаказов() Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'У контрагента есть договоры комиссии по которым не ведется учет по заказам. Изменение не возможно.'"));
			ТекущиеДанные.Долги = Ложь;
			Объект.ВестиРасчетыПоЗаказам = Ложь;
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.Оплата = ТекущиеДанные.Долги;
		СформироватьЗаголовокГруппыДеньги();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикаВзаиморасчетовОплатаПриИзменении(Элемент)
	
	Таблица = Элемент.Родитель;
	Если Таблица = Неопределено Или Таблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВестиУчетОплатыПоСчетам = Таблица.ТекущиеДанные.Оплата;
	СформироватьЗаголовокГруппыДеньги();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСвязь(Команда)
	
	Если Объект.Ссылка.Пустая() Или ЭтотОбъект.Модифицированность = Истина Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьВопросКонтрагентНеЗаписанСвязь", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Для установления связи необходимо записать карточку контрагента. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;       
	
	ИндексВыбранногоКонтактногоЛица = Число(Сред(Команда.Имя, СтрДлина("КомандаУстановитьСвязь_")+1));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОткрытиеИзФормыКонтрагента",Истина);
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаСписка",ПараметрыФормы,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонтактноеЛицо(Команда)    
	
	Если Объект.Ссылка.Пустая() Или ЭтотОбъект.Модифицированность = Истина Тогда
		ПараметрыКЛ = Новый Структура;
		Если Объект.Ссылка.Пустая() = Ложь Тогда
			ПараметрыКЛ.Вставить("ЭтоДобавлениеКЛ");	
		КонецЕсли;
		Оповещение = Новый ОписаниеОповещения("ОбработатьВопросКонтрагентНеЗаписан", ЭтотОбъект, ПараметрыКЛ);
		ПоказатьВопрос(Оповещение, "Для добавления контактных лиц необходимо записать карточку контрагента. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;       
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", Новый Структура("Контрагент", Объект.Ссылка));	
	ПараметрыОткрытия.Вставить("Перечитать", Истина);	

	ОткрытьФорму("Справочник.КонтактныеЛица.Форма.ФормаЭлемента", ПараметрыОткрытия
	,ЭтотОбъект,,,, Новый ОписаниеОповещения("ОбработатьОбновлениеКИ", ЭтотОбъект, ПараметрыОткрытия), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСправочника(Команда)
	
	ПараметрыДиалога = Новый Структура;
	
	ПараметрыДиалога.Вставить("НастройкиСправочников", Истина);
	
	ПараметрыДиалога.Вставить("ВидДокумента", НСтр("ru='контрагенты'"));
	
	ПараметрыДиалога.Вставить("ИспользоватьБыструюФормуКонтрагентовВДокументах", ИспользоватьБыструюФормуКонтрагентовВДокументах);
	
	ПараметрыДиалога.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	ОткрытьФорму("ОбщаяФорма.ШапкаТабличнаяЧасть", ПараметрыДиалога,,,,, Новый ОписаниеОповещения("НастройкиЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКабинетКлиента(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", ПолучитьСсылкуНаКонструктор());
	Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторЗавершение",ЭтотОбъект);
	ОткрытьФорму("Справочник.НастройкиПубликацииМЛК.Форма.КонструкторМобильногоПриложения", ПараметрыФормы,,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВСписке(Команда)
	
	ИндексВыбранногоКонтактногоЛица = Число(Сред(Команда.Имя, СтрДлина("ПереместитьВниз_")+1));
	КонтактноеЛицо = ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].КонтактноеЛицо;
	
	ПараметрыСписка = Новый Структура;
	ПараметрыСписка.Вставить("Отбор", Новый Структура);
	ПараметрыСписка.Отбор.Вставить("Контрагент", Объект.Ссылка);
	ПараметрыСписка.Отбор.Вставить("ТекущийКонтакт", КонтактноеЛицо);
	
	ОткрытьФорму("Справочник.КонтактныеЛица.Форма.ФормаСписка", ПараметрыСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонтрагента(Команда)
	УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
	ПроверкаКонтрагентовКлиент.ПроверитьКонтрагентаПоКнопке(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШаблоныПечатиДоговоровКонтрагентов(Команда)
	
	ШаблоныПечатиОфисныхДокументовКлиент.ОткрытьШаблоныПечатиОфисныхДокументов(
	ПредопределенноеЗначение("Перечисление.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагента"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоДаннымЕГР(Команда)
	
	Если Не ПустаяСтрока(Объект.ИНН) И Объект.ИННВведенКорректно Тогда
	// Выполняем заполнение по ИНН без открытия вспомогательной формы
		
		Если КлючевыеРеквизитыЗаполнены(ЭтотОбъект) Тогда
			ТекстВопроса = НСтр("ru='Перезаполнить текущие реквизиты?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПерезаполнитьРеквизитыПоИННЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ВыполнитьЗаполнениеРеквизитовПоИНН(Объект.ИНН);
		КонецЕсли;
		
	Иначе
	// Открываем форму заполнения реквизитов
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СтрокаПоиска", ?(ПустаяСтрока(Объект.НаименованиеПолное), Объект.ИНН, Объект.НаименованиеПолное));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнениеРеквизитовКонтрагентВыбран", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ЗаполнениеРеквизитовКонтрагента", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДополнительныйРеквизит(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", НаборСвойств_Справочник_Контрагенты);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта", ПараметрыФормы, , , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонтрагентаНаДубли(Команда)
	
	Состояние(НСтр("ru='Проверка контрагента на дубли'"), 49);
	ПроверитьКонтрагентаНаДублиСервер();
	Состояние(НСтр("ru='Проверка контрагента на дубли'"), 100);
	
	ПоказатьСообщениеОДублях();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДублиКонтактнойИнформации(Команда)
	
	УдалитьДублиКонтактнойИнформацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияНаименований(Команда)
	
	ОткрытьИсториюНаименования();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияКПП(Команда)
	
	ПараметрыФормы = Новый Структура("ТекущийКПП, ИсторияКПП, ТолькоПросмотр", Объект.КПП, Объект.ИсторияКПП, ТолькоПросмотр);
	ОткрытьФорму("Справочник.Контрагенты.Форма.РедактированиеИсторииКПП", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиБиблиотек

// ИнтернетПоддержкаПользователей.СПАРКРиски
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьОтображениеИндексыСПАРК()
	ОбновитьОтображениеИндексыСПАРК();
КонецПроцедуры

// Обновляет отображение факторов риска СПАРК.
//
&НаКлиенте
Процедура Подключаемый_ОбновитьОтображениеФакторовРискаСПАРК()
	
	ОбновитьОтображениеФакторовРискаСПАРК();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеИндексыСПАРК()
	
	ВидКонтрагентаСПАРКРиски = СПАРКРискиКлиентСерверУНФ.ВидКонтрагентаСПАРКРиски(Объект.ВидКонтрагента);
	
	СПАРКРискиКлиент.ОтобразитьИндексыСПАРК(
	ИндексыСПАРКРиски,
	Объект,
	Объект.ИНН,
	ВидКонтрагентаСПАРКРиски,
	ЭтотОбъект,
	Новый Структура("ВариантОтображения", "Однострочный"));
	
	ЗаполнитьЗначенияСвойств(
	Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски1,
	Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски,
	"Видимость,Картинка,Подсказка");
	
	ЗаполнитьЗначенияСвойств(
	Элементы.ДекорацияИндексыСПАРКРиски1,
	Элементы.ДекорацияИндексыСПАРКРиски,
	"Видимость,Заголовок");
	
	СПАРКРискиКлиент.ОтобразитьИндексыСПАРК(
	ИндексыСПАРКРиски,
	Объект,
	Объект.ИНН,
	ВидКонтрагентаСПАРКРиски,
	ЭтотОбъект,
	Новый Структура("ВариантОтображения", "Многострочный"));
	
	ПоказатьСвоюПодсказку = Не Элементы.ДекорацияИндексыСПАРКРиски.Видимость И Не Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Видимость;
	Элементы.СвояПодсказка1СПАРКРиски.Видимость = ПоказатьСвоюПодсказку;
	Элементы.СвояПодсказка1СПАРКРиски1.Видимость = ПоказатьСвоюПодсказку;
	Элементы.ДекорацияЗаголовокСПАРКРиски.Видимость = ПоказатьСвоюПодсказку;
	
КонецПроцедуры 

// Обновляет отображение факторов риска СПАРК.
//
&НаКлиенте
Процедура ОбновитьОтображениеФакторовРискаСПАРК()
	
	ВидКонтрагентаСПАРКРиски = СПАРКРискиКлиентСерверУНФ.ВидКонтрагентаСПАРКРиски(Объект.ВидКонтрагента);
	ПараметрыОтображения = СПАРКРискиКлиентСервер.ПараметрыОтображенияДанныхСПАРК(); 
	СПАРКФакторыРискаКлиент.ОтобразитьФакторыРиска(
		ФакторыРискаСПАРК,
		Объект,
		Объект.ИНН,
		ЭтотОбъект,
		ПараметрыОтображения);
	
	ЗаполнитьЗначенияСвойств(
	Элементы.КартинкаОжиданиеЗагрузкиФакторовРиска1,
	Элементы.КартинкаОжиданиеЗагрузкиФакторовРиска,
	"Видимость,Картинка,Подсказка");
	
	ЗаполнитьЗначенияСвойств(
	Элементы.ДекорацияФакторыРиска1,
	Элементы.ДекорацияФакторыРиска,
	"Видимость,Заголовок");
	
	ПоказатьСвоюПодсказку = Не Элементы.ДекорацияФакторыРиска.Видимость И Не Элементы.КартинкаОжиданиеЗагрузкиФакторовРиска.Видимость;
	Элементы.СвояПодсказкаФакторовРиска.Видимость = ПоказатьСвоюПодсказку;
	Элементы.СвояПодсказкаФакторовРиска1.Видимость = ПоказатьСвоюПодсказку;
	Элементы.ДекорацияЗаголовокФакторыРиска.Видимость = ПоказатьСвоюПодсказку;
	Элементы.НазваниеГруппыУпрощеннойПодсказкиФакторыРиска.Видимость = ПоказатьСвоюПодсказку;
	
КонецПроцедуры

&НаСервере
Процедура СПАРКРискиПриСозданииНаСервере()
	
	ИспользоватьСпаркРиски = ПолучитьФункциональнуюОпцию("ИспользоватьСервисСПАРКРиски");
	Элементы.ГруппаИндексыСПАРКРиски.Видимость = ИспользоватьСпаркРиски;
	Элементы.Страница1СПАРКРиски.Видимость = ИспользоватьСпаркРиски;
	
	Если ИспользоватьСпаркРиски Тогда
		
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		ВидКонтрагентаСПАРКРиски = СПАРКРискиКлиентСерверУНФ.ВидКонтрагентаСПАРКРиски(Объект.ВидКонтрагента);
		ПараметрыОтображения = СПАРКРискиКлиентСервер.ПараметрыОтображенияДанныхСПАРК();
		ПараметрыОтображения.ВариантОтображения = "Однострочный";
		
		СПАРКРиски.ПриСозданииНаСервере(
		ЭтотОбъект,
		Объект,
		Объект.Ссылка,
		ВидКонтрагентаСПАРКРиски,
		ПараметрыОтображения);
		
		ЗаполнитьЗначенияСвойств(
		Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски1,
		Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски,
		"Видимость,Картинка,Подсказка");
		
		ЗаполнитьЗначенияСвойств(
		Элементы.ДекорацияИндексыСПАРКРиски1,
		Элементы.ДекорацияИндексыСПАРКРиски,
		"Видимость,Заголовок");
		
		ЗаполнитьЗначенияСвойств(
		Элементы.КартинкаОжиданиеЗагрузкиФакторовРиска1,
		Элементы.КартинкаОжиданиеЗагрузкиФакторовРиска,
		"Видимость,Картинка,Подсказка");
		
		ЗаполнитьЗначенияСвойств(
		Элементы.ДекорацияФакторыРиска1,
		Элементы.ДекорацияФакторыРиска,
		"Видимость,Заголовок");
		
		ПараметрыОтображения.ВариантОтображения = "Многострочный";
		СПАРКРиски.ПриСозданииНаСервере(
		ЭтотОбъект,
		Объект,
		Объект.Ссылка,
		ВидКонтрагентаСПАРКРиски,
		ПараметрыОтображения);
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
		
		ПоказатьСвоюПодсказку = Не Элементы.ДекорацияИндексыСПАРКРиски.Видимость И Не Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Видимость;
		Элементы.СвояПодсказка1СПАРКРиски.Видимость = ПоказатьСвоюПодсказку;
		Элементы.СвояПодсказка1СПАРКРиски1.Видимость = ПоказатьСвоюПодсказку;
		Элементы.ДекорацияЗаголовокСПАРКРиски.Видимость = ПоказатьСвоюПодсказку;
		
		ПоказатьСвоюПодсказкуФакторыРиска = Не Элементы.ДекорацияФакторыРиска.Видимость И Не Элементы.КартинкаОжиданиеЗагрузкиФакторовРиска.Видимость;
		Элементы.СвояПодсказкаФакторовРиска.Видимость = ПоказатьСвоюПодсказкуФакторыРиска;
		Элементы.СвояПодсказкаФакторовРиска1.Видимость = ПоказатьСвоюПодсказкуФакторыРиска;
		Элементы.ДекорацияЗаголовокФакторыРиска.Видимость = ПоказатьСвоюПодсказкуФакторыРиска;
		Элементы.НазваниеГруппыУпрощеннойПодсказкиФакторыРиска.Видимость = ПоказатьСвоюПодсказкуФакторыРиска;
				
		// Команды1СПАРКРиски
		СПАРКРиски.ДобавитьПодключаемыеКомандыКонтрагента(ЭтотОбъект, Объект, Элементы.Подменю1СПАРКРиски);
		// Конец Команды1СПАРКРиски
		
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтернетПоддержкаПользователей.СПАРКРиски

// Команды1СПАРКРиски
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду1СПАРКРиски(Команда)
	СПАРКРискиКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец Команды1СПАРКРиски

// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПоказатьПредложениеИспользоватьПроверкуКонтрагентов()
	ПроверкаКонтрагентовКлиент.ПредложитьВключитьПроверкуКонтрагентов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбработатьРезультатПроверкиКонтрагентов(Результат, ДополнительныеПараметры) Экспорт
	ПроверкаКонтрагентовКлиент.ОбработатьРезультатПроверкиКонтрагентовВСправочнике(ЭтотОбъект);
КонецПроцедуры
// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ЭлектронноеВзаимодействие.ОбменСКонтрагентами

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКомандыЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

// СтандартныеПодсистемы.Свойства
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_РедактироватьСоставСвойств()

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры // ОбновитьЗависимостиДополнительныхРеквизитов()

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.НачатьИзменение(ЭтотОбъект, Элемент);
	КонтактнаяИнформацияКонтактногоЛицаПриИзменении(Элемент);
	КонтактнаяИнформацияПриИзменении(Элемент.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьОчистку(ЭтотОбъект, Элемент.Имя);
	КонтактнаяИнформацияКонтактногоЛицаПриИзменении(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьОбработкуНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьОбновлениеКонтактнойИнформации(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьКонтактнуюИнформацию(Результат);
	Если Результат.Свойство("ИмяРеквизита") Тогда
		КонтактнаяИнформацияКонтактногоЛицаПриИзменении(Элементы[Результат.ИмяРеквизита]);
		КонтактнаяИнформацияПриИзменении(Результат.ИмяРеквизита);		
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ОбновитьКонтактнуюИнформацию(Результат)
	ИзменилиКонтактнуюИнформацию = Истина;
	Если Результат.Свойство("ИмяЭлементаДляРазмещения") Тогда
		ИмяЭлементаДляРазмещения = Результат.ИмяЭлементаДляРазмещения;
	Иначе
		ОписаниеКИ = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Результат.ИмяРеквизита);
		ИмяЭлементаДляРазмещения = ОписаниеКИ.ИмяЭлементаДляРазмещения;
	КонецЕсли;
	Результат.Вставить("ПостфиксИмяРеквизита", ИмяЭлементаДляРазмещения);
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
	УправлениеКонтактнойИнформациейУНФ.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, НастройкиПереопределенияКонтактнойИнформации(), Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#КонецОбласти

#Область КонтактнаяИнформацияУНФ

&НаСервере
Процедура СоздатьОбновитьКарточкиКИ()
	
	ОсновнаяТаблицаСоздана = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "ДанныеПанелиКонтактнойИнформации");
	КоличествоКонтактовГруппа = 0;
	Если ОсновнаяТаблицаСоздана = Ложь Тогда
		КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформацияТаблица_0");
		Элементы["КонтактнаяИнформацияТаблица_0"].РастягиватьПоВертикали = Истина;
    КонецЕсли;
   	Элементы.ВсеКонтакты.Видимость = Ложь;
	Элементы.ГруппаКомандаДобавления.Видимость = Ложь;
	Элементы.ДанныеПанелиКонтактнойИнформации.Видимость = Ложь;
	
	Если ЗаполнениеИзСвязанногоОбъекта = Ложь Тогда
  		КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, Объект.Ссылка);
	Иначе	
		КоличествоКонтактовГруппа = 1;
	КонецЕсли;
	
	МассивУникальныхВладельцев = Новый Массив;

	МаксПорядок = 0;
	Для Каждого Строка Из ДанныеКонтактныхЛиц Цикл   
		СтрокиКЛ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.НайтиСтроки(Новый Структура("ВладелецКИ", Строка.КонтактноеЛицо));
		Для Каждого СтрокаКЛ Из СтрокиКЛ Цикл
			СтрокаКЛ.ПолеСортировки = Строка.Порядок;
			Если СтрокаКЛ.ТипОтображаемыхДанных = "КонтактноеЛицо" Тогда      
				Если Строка.Основной = Истина И Строка.Подписант = Истина Тогда            
					СтрокаКЛ.Отображение = СтрокаКЛ.Отображение + " (основной, подписант)";	
				ИначеЕсли Строка.Основной = Истина Тогда    
					СтрокаКЛ.Отображение = СтрокаКЛ.Отображение + " (основной)";						
				ИначеЕсли Строка.Подписант = Истина Тогда	
					СтрокаКЛ.Отображение = СтрокаКЛ.Отображение + " (подписант)";						
				КонецЕсли;
			КонецЕсли;  
		КонецЦикла; 	
	КонецЦикла;
	
	Для Каждого Строка Из ЭтотОбъект.ДанныеПанелиКонтактнойИнформации Цикл
		
		Если ЗначениеЗаполнено(Строка.ВладелецКИ) И МассивУникальныхВладельцев.Найти(Строка.ВладелецКИ) = Неопределено И Строка.ВладелецКИ <> Объект.Ссылка Тогда
			МассивУникальныхВладельцев.Добавить(Строка.ВладелецКИ);	
			КоличествоКонтактовГруппа = КоличествоКонтактовГруппа + 1;
		КонецЕсли;
		Если Строка.ТипОтображаемыхДанных = "КонтактноеЛицо" И НЕ ЗаполнениеИзСвязанногоОбъекта Тогда
			Строка.ИндексПиктограммы = 5;       
		КонецЕсли;
		Если Строка.ВладелецКИ = Объект.Ссылка Тогда			
			Строка.ЭтоСсылка = Истина;
		КонецЕсли;

	КонецЦикла; 
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СвязиКонтрагентКонтактСрезПоследних.Должность КАК Должность,
		|	СвязиКонтрагентКонтактСрезПоследних.Контакт КАК Контакт
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(
		|			,
		|			Контрагент = &Контрагент
		|				И Контакт В (&МассивКонтактов)) КАК СвязиКонтрагентКонтактСрезПоследних";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
		Запрос.УстановитьПараметр("МассивКонтактов", МассивУникальныхВладельцев);
		
		ВыборкаДолжность = Запрос.Выполнить().Выбрать();
		ЕстьДолжности = Ложь;
		Пока ВыборкаДолжность.Следующий() Цикл   
			Если ВыборкаДолжность.Должность = "" Тогда
				Продолжить;
			КонецЕсли;     
			СтрокиПорядокКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.НайтиСтроки(
				Новый Структура("ТипОтображаемыхДанных, ВладелецКИ", "КонтактноеЛицо", ВыборкаДолжность.Контакт));
			Если СтрокиПорядокКИ.Количество() = 0 Тогда	   
				Продолжить;
			КонецЕсли;  

			СтрокаКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Вставить(ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Индекс(СтрокиПорядокКИ[0]) + 1);  
			СтрокаКИ.ВладелецКИ = ВыборкаДолжность.Контакт;
			СтрокаКИ.ТипОтображаемыхДанных = "ЗначениеКИ";
			СтрокаКИ.Отображение = "Должность: " + ВыборкаДолжность.Должность;
			СтрокаКИ.ИндексПиктограммы = 5;
			СтрокаКИ.ПолеСортировки = СтрокиПорядокКИ[0].ПолеСортировки;
			
			ЕстьДолжности = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПривязанныйКонтакт) Тогда
		
		СтрокиНетДанных = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.НайтиСтроки(Новый Структура("ТипОтображаемыхДанных","НетДанных"));
		Если СтрокиНетДанных.Количество() > 0 Тогда
			ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Удалить(СтрокиНетДанных[0]);	
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПорядокТиповКИ.Тип КАК Тип,
		|	ПорядокТиповКИ.Вид КАК Вид,
		|	ПорядокТиповКИ.Порядок КАК Порядок
		|ПОМЕСТИТЬ втПорядокТиповКИ
		|ИЗ
		|	&ПорядокТиповКИ КАК ПорядокТиповКИ
		|;
		|ВЫБРАТЬ
		|	КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК КонтактноеЛицо,
		|	КонтактныеЛицаКонтактнаяИнформация.Тип КАК Тип,
		|	КонтактныеЛицаКонтактнаяИнформация.Вид КАК Вид,
		|	КонтактныеЛицаКонтактнаяИнформация.Представление КАК Представление,
		|	КонтактныеЛицаКонтактнаяИнформация.Значение КАК Значение,
		|	ПРЕДСТАВЛЕНИЕ(КонтактныеЛицаКонтактнаяИнформация.Вид) КАК ПредставлениеВидаКИ
		|ИЗ
		|	Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТиповКИ КАК втПорядокТиповКИ
		|		ПО КонтактныеЛицаКонтактнаяИнформация.Тип = втПорядокТиповКИ.Тип
		|		И КонтактныеЛицаКонтактнаяИнформация.Вид = втПорядокТиповКИ.Вид
		|ГДЕ
		|	КонтактныеЛицаКонтактнаяИнформация.Ссылка = &Контакт
		|
		|УПОРЯДОЧИТЬ ПО
		|	втПорядокТиповКИ.Порядок,
		|	КонтактныеЛицаКонтактнаяИнформация.Вид.Наименование";
		//Запрос.УстановитьПараметр("ПорядокТиповКИ", КонтактнаяИнформацияУНФ.ПорядокТиповКИ());
		Запрос.УстановитьПараметр("ПорядокТиповКИ", КонтактнаяИнформацияУНФ.ПорядокТиповКИСправочник());
		Запрос.УстановитьПараметр("Контакт", ПривязанныйКонтакт);  
		ВыборкаКонтактнаяИнформация = Запрос.Выполнить().Выбрать();
		
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Отображение", Строка(ПривязанныйКонтакт));
		НоваяСтрока.Вставить("ИндексПиктограммы", -1);
		НоваяСтрока.Вставить("ТипОтображаемыхДанных", "КонтактноеЛицо");
		НоваяСтрока.Вставить("ВладелецКИ", ПривязанныйКонтакт);
		СтрокаКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКИ,НоваяСтрока);
		КоличествоКонтактовГруппа = 1;
		Пока ВыборкаКонтактнаяИнформация.Следующий() Цикл
			НоваяСтрока = Новый Структура;
			НоваяСтрока.Вставить("Отображение", Строка(ВыборкаКонтактнаяИнформация.Вид) + ": " +ВыборкаКонтактнаяИнформация.Представление);
			НоваяСтрока.Вставить("ИндексПиктограммы", КонтактнаяИнформацияПанельУНФ.ИндексПиктограммыПоТипу(ВыборкаКонтактнаяИнформация.Тип));
			НоваяСтрока.Вставить("ТипОтображаемыхДанных", "ЗначениеКИ");
			НоваяСтрока.Вставить("ВладелецКИ", ПривязанныйКонтакт);
			НоваяСтрока.Вставить("ПредставлениеКИ", ВыборкаКонтактнаяИнформация.Представление);
			НоваяСтрока.Вставить("ТипКИ", ВыборкаКонтактнаяИнформация.Тип);
			СтрокаКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКИ,НоваяСтрока); 
		КонецЦикла;		
	КонецЕсли;
	 
	Номер = 1;
	ИмяТекТаблицы = "ДанныеПанелиКонтактнойИнформации_" + Номер;
	Если ЭтотОбъект.Элементы.Найти("КонтактнаяИнформацияТаблица_" + Номер) = Неопределено Тогда
		ГруппаТаблица = ЭтотОбъект.Элементы.Добавить("КонтактнаяИнформацияТаблица_" + Номер,Тип("ГруппаФормы"), Элементы.ГруппаКонтактыТаблица);
		ГруппаТаблица.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
		ГруппаТаблица.ОтображатьЗаголовок = Ложь;  
		ГруппаТаблица.РастягиватьПоВертикали = Истина;
		КонтактнаяИнформацияПанельУНФ.СоздатьЭлементТаблицаФормы(ЭтотОбъект, ИмяТекТаблицы,
		"КонтактнаяИнформацияТаблица_" + Номер,  "ДанныеПанелиКонтактнойИнформации", Истина);    
		КонтактнаяИнформацияПанельУНФ.УстановитьУсловноеОформление(ЭтотОбъект, "_" + Номер, Истина);
		
		Элементы[ИмяТекТаблицы].ВыделенныеСтроки.Очистить(); 
		Элементы[ИмяТекТаблицы].УстановитьДействие("ПриАктивизацииЯчейки", "СписокПриАктивизацииЯчейки"); 
		Элементы[ИмяТекТаблицы].ЧередованиеЦветовСтрок = Ложь;
		Элементы[ИмяТекТаблицы].ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.ИспользоватьВсегда;
		
		НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
		ГруппаИли = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ГруппаИЛИ");
	
		РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
			ГруппаИли, "ДанныеПанелиКонтактнойИнформации.ТипОтображаемыхДанных", "КонтактноеЛицо", ВидСравненияКомпоновкиДанных.Равно); 
		
		РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
			ГруппаИли, "ДанныеПанелиКонтактнойИнформации.ТипОтображаемыхДанных", "НетДанных", ВидСравненияКомпоновкиДанных.Равно); 
		
		ОформляемыеПоля = Новый Массив; 
		ОформляемыеПоля.Добавить(ИмяТекТаблицы + "ОтображениеТипаКИ");
		РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
		РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);
		
	КонецЕсли;
	
	Если ДанныеКонтактныхЛиц.Количество() = 0 И ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.НайтиСтроки(Новый Структура("ЭтоСсылка", Истина)).Количество() > 0 
		И НЕ ЗначениеЗаполнено(ПривязанныйКонтакт) Тогда
		НоваяСтрокаСтруктура = Новый Структура;
		НоваяСтрокаСтруктура.Вставить("Отображение", НСтр("ru='<Нет контактных данных>'"));
		НоваяСтрокаСтруктура.Вставить("ИндексПиктограммы", -1);
		НоваяСтрокаСтруктура.Вставить("ТипОтображаемыхДанных", "НетДанных");
		НоваяСтрокаСтруктура.Вставить("ВладелецКИ", Неопределено);
		СтрокаПустая = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПустая, НоваяСтрокаСтруктура);
	КонецЕсли;
	
	ЗаполнитьОтображениеТипаКИ();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ЭтоСсылка", Ложь);
	Элементы[ИмяТекТаблицы].ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска); 
	Элементы.КонтактнаяИнформацияТаблица_1.Высота = 0;
	
	Элементы.ДанныеПанелиКонтактнойИнформации.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;
	Если ЭтоИнтерфейсТакси = Ложь И Элементы.Найти("КонтактнаяИнформацияТаблица_1") <> Неопределено Тогда
		Элементы.КонтактнаяИнформацияТаблица_1.Высота = 26;
		Элементы.КонтактнаяИнформацияТаблица_1.Высота = 0;
		Элементы.Контакты.Высота = 0;
		Элементы.Контакты.РастягиватьПоВертикали = Истина;
	КонецЕсли;
	Элементы.Контакты.Заголовок = НСтр("ru = 'Контакты ('") + КоличествоКонтактовГруппа + ")";
	
	Если ЭтоИнтерфейсТакси Тогда
		
		Если Элементы.КонтактнаяИнформацияТаблица_1.ПодчиненныеЭлементы.Количество() 
			И ТипЗнч(Элементы.КонтактнаяИнформацияТаблица_1.ПодчиненныеЭлементы[0]) = Тип("ТаблицаФормы") Тогда
			
			ЭлементТаблицы = Элементы.КонтактнаяИнформацияТаблица_1.ПодчиненныеЭлементы[0];
			ЭлементТаблицы.ВысотаВСтрокахТаблицы = 10;
			ЭлементТаблицы.РастягиватьПоВертикали = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьОтображениеТипаКИ()

	ОсновнаяТаблицаСоздана = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "ДанныеПанелиКонтактнойИнформации");
	Если ОсновнаяТаблицаСоздана = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ЭтотОбъект.ДанныеПанелиКонтактнойИнформации Цикл
		Если Строка.ТипОтображаемыхДанных <> "КонтактноеЛицо" Тогда
			Если СтрНайти(Строка.Отображение, ": ") > 0 И Строка.ОтображениеТипаКИ = "" Тогда
				Строка.ОтображениеТипаКИ = Лев(Строка.Отображение, СтрНайти(Строка.Отображение, ":"));	
				Строка.Отображение = Сред(Строка.Отображение, СтрНайти(Строка.Отображение, ":") + 2);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		

КонецПроцедуры 

&НаКлиенте
Процедура ВыборДействийКонтакт(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПорядокКЛ = ДополнительныеПараметры.ПорядокКЛ;
	КонтактноеЛицо = ДополнительныеПараметры.КонтактноеЛицо;
	ИндексКИ = ПорядокКЛ;
	Если Результат.Значение = "ИспользоватьКакОсновной" Тогда	 
		Если ИндексКИ < 0 Тогда
			Возврат;	
		КонецЕсли;
		ВыборИспользоватьКакОсновной(КонтактноеЛицо);   
		Модифицированность = Истина;  
		
	ИначеЕсли Результат.Значение = "ИспользоватьКакПодписанта" Тогда	 
		Если ИндексКИ < 0 Тогда
			Возврат;	
		КонецЕсли;
		ВыборИспользоватьКакПодписанта(КонтактноеЛицо);   
		Модифицированность = Истина;  
		
	ИначеЕсли Результат.Значение = "ИзменитьПорядок" Тогда
		ИзменитьПорядок(КонтактноеЛицо);   
		
	ИначеЕсли Результат.Значение = "РазорватьСвязь" Тогда	 
		Если ИндексКИ < 0 Тогда
			Возврат;	
		КонецЕсли;
		РазорватьСвязьКЛ(КонтактноеЛицо);    
		
	ИначеЕсли Результат.Значение = "Изменить" Тогда
		
		ЕстьИзменения = Ложь;
		Для Каждого СтрокаТЧ Из ДанныеКонтактныхЛиц Цикл
			Если СтрокаТЧ.Порядок = ПорядокКЛ Тогда
				ИндексВыбранногоКонтактногоЛица = ДанныеКонтактныхЛиц.Индекс(СтрокаТЧ);
			КонецЕсли;
			Если СтрокаТЧ.Изменен = Истина Тогда
				ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЦикла;
		
		ВыбранноеКонтактноеЛицо = ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].КонтактноеЛицо;
		
		Если ЕстьИзменения = Истина Тогда  
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Ключ", ВыбранноеКонтактноеЛицо);
			ПараметрыОткрытия.Вставить("ТекущийКонтрагент", Объект.Ссылка);
			Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("ЭтоДолжность") Тогда
				ПараметрыОткрытия.Вставить("ЭтоДолжность", Истина);
			КонецЕсли;
			Оповещение = Новый ОписаниеОповещения("ОбработатьВопросКонтрагентНеЗаписан", ЭтотОбъект,  ПараметрыОткрытия);
			ПоказатьВопрос(Оповещение, "Контактная информация была изменена." + Символы.ПС + "Необходимо записать карточку контрагента. Продолжить?", РежимДиалогаВопрос.ДаНет);
			Возврат;
		Иначе
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Ключ", ВыбранноеКонтактноеЛицо); 
			ПараметрыОткрытия.Вставить("ТекущийКонтрагент", Объект.Ссылка);			
			Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("ЭтоДолжность") Тогда
				ПараметрыОткрытия.Вставить("ЭтоДолжность", Истина);
			КонецЕсли;
			ОткрытьФорму("Справочник.КонтактныеЛица.Форма.ФормаЭлемента", ПараметрыОткрытия
				,ЭтотОбъект,,,, Новый ОписаниеОповещения("ОбработатьОбновлениеКИ", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			
		КонецЕсли;       
		
		Возврат; 
		
	ИначеЕсли Результат.Значение = "ПоказатьВСписке" Тогда
		ВыборПоказатьВСписке(КонтактноеЛицо)	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПорядок(КонтактноеЛицо)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Контрагент", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("СкрыватьИсторию", Истина);

	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаИзмененияПорядка", ПараметрыОткрытия
	,,,,, Новый ОписаниеОповещения("ОбработатьОбновлениеКИ", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаСервере
Функция НастройкиПереопределенияКонтактнойИнформации()
	
	НастройкиПереопределения = УправлениеКонтактнойИнформациейУНФ.НастройкиПереопределения();
	НастройкиПереопределения.ИспользоватьСтандартнуюШирину = Ложь;
	Возврат НастройкиПереопределения;
	
КонецФункции

&НаКлиенте
Процедура КонтактнаяИнформацияКонтактногоЛицаПриИзменении(Элемент)
	
	ОписаниеРеквизита = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Элемент.Имя);
	Если ОписаниеРеквизита = Неопределено И СтрНачинаетсяС(НРег(Элемент.Имя), НРег("Комментарий")) Тогда
		ИмяЭлемента = Прав(Элемент.Имя, СтрДлина(Элемент.Имя) - СтрДлина("Комментарий"));
		ОписаниеРеквизита = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, ИмяЭлемента);
	КонецЕсли;
	
	Если ОписаниеРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлементаДляРазмещения = ОписаниеРеквизита.ИмяЭлементаДляРазмещения;
	Если ИмяЭлементаДляРазмещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ИмяЭлементаДляРазмещения, "КонтактнаяИнформацияКонтакт_") = 0 Тогда
		// Поле контактной информации контрагента.
		Возврат;
	КонецЕсли;
	
	Индекс = СтрЗаменить(ИмяЭлементаДляРазмещения, "КонтактнаяИнформацияКонтакт_", "");
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Индекс) Тогда
		ДанныеКонтактныхЛиц[Число(Индекс)].Изменен = Истина;
	КонецЕсли;
	
	КонтактнаяИнформацияКонтактногоЛицаПриИзмененииСервер(Элемент.Имя, Индекс);
	
КонецПроцедуры

&НаСервере
Процедура КонтактнаяИнформацияКонтактногоЛицаПриИзмененииСервер(ИмяЭлемента, ИндексКЛ)
	
	ЭтоРедактированиеПоляКИ = Не СтрНачинаетсяС(НРег(ИмяЭлемента), НРег("Комментарий"));
	Если ЭтоРедактированиеПоляКИ Тогда
		ОписаниеКИ = УправлениеКонтактнойИнформациейУНФ.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, ИмяЭлемента);
		ПроверитьКИНаДубли(ОписаниеКИ, ИндексКЛ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КонтактнаяИнформацияПриИзменении(ИмяЭлемента)
	
	ЭтоРедактированиеПоляКИ = Не СтрНачинаетсяС(НРег(ИмяЭлемента), НРег("Комментарий"));
	Если ЭтоРедактированиеПоляКИ Тогда
		ОписаниеКИ = УправлениеКонтактнойИнформациейУНФ.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, ИмяЭлемента);
		ПроверитьКИНаДубли(ОписаниеКИ);
	КонецЕсли;
	ИзменилиКонтактнуюИнформацию = Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборИспользоватьКакОсновной(КонтактноеЛицо)
	
	Строки = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("КонтактноеЛицо", КонтактноеЛицо)); 
	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ИндексВыбранногоКонтактногоЛица = ДанныеКонтактныхЛиц.Индекс(Строки[0]);
	
	ОсновнойКонтакт = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("Основной", Истина));
	Если ОсновнойКонтакт.Количество() > 0 Тогда
		ОсновнойКонтакт[0].Основной = Ложь;
	КонецЕсли;	
	
	ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].Основной = Истина;
	ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].Изменен = Истина;
	
	Объект.КонтактноеЛицо = ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].КонтактноеЛицо;
	ОпределитьОсновногоПодписанта();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборИспользоватьКакПодписанта(КонтактноеЛицо)

	Строки = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("КонтактноеЛицо", КонтактноеЛицо));
	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ИндексВыбранногоКонтактногоЛица = ДанныеКонтактныхЛиц.Индекс(Строки[0]);
	
	Подписант = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("Подписант", Истина));
	Если Подписант.Количество() > 0 Тогда
		Подписант[0].Подписант = Ложь;
	КонецЕсли;
	
	ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].Подписант = Истина;
	ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].Изменен = Истина;
	
	ОпределитьОсновногоПодписанта();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПоказатьВСписке(КонтактноеЛицо)
	
	ПараметрыСписка = Новый Структура;
	ПараметрыСписка.Вставить("Отбор", Новый Структура);
	ПараметрыСписка.Отбор.Вставить("Контрагент", Объект.Ссылка);
	ПараметрыСписка.Отбор.Вставить("ТекущийКонтакт", КонтактноеЛицо);
	
	ОткрытьФорму("Справочник.КонтактныеЛица.Форма.ФормаСписка", ПараметрыСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьОсновногоПодписанта()
	
	Для Каждого Строка Из ДанныеКонтактныхЛиц Цикл   
		СтрокиКЛ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.НайтиСтроки(Новый Структура("ВладелецКИ", Строка.КонтактноеЛицо));
		Для Каждого СтрокаКЛ Из СтрокиКЛ Цикл 
			СтрокаКЛ.Отображение = СтрЗаменить(СтрокаКЛ.Отображение, " (основной, подписант)","");
			СтрокаКЛ.Отображение = СтрЗаменить(СтрокаКЛ.Отображение, " (основной)", "");
			СтрокаКЛ.Отображение = СтрЗаменить(СтрокаКЛ.Отображение, " (подписант)", "");
			Если СтрокаКЛ.ТипОтображаемыхДанных = "КонтактноеЛицо" Тогда      
				Если Строка.Основной = Истина И Строка.Подписант = Истина Тогда            
					СтрокаКЛ.Отображение = СтрокаКЛ.Отображение + " (основной, подписант)";	
				ИначеЕсли Строка.Основной = Истина Тогда    
					СтрокаКЛ.Отображение = СтрокаКЛ.Отображение + " (основной)";						
				ИначеЕсли Строка.Подписант = Истина Тогда	
					СтрокаКЛ.Отображение = СтрокаКЛ.Отображение + " (подписант)";						
				КонецЕсли;
			КонецЕсли;  
		КонецЦикла; 	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазорватьСвязьКЛ(КонтактноеЛицо)
	
	ДанныеКонтактногоЛица = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("КонтактноеЛицо", КонтактноеЛицо))[0];
	
	КонтактОсновноеКЛ = ДанныеКонтактногоЛица.КонтактноеЛицо = Объект.КонтактноеЛицо И ЗначениеЗаполнено(Объект.КонтактноеЛицо);
	КонтактПодписант = ДанныеКонтактногоЛица.КонтактноеЛицо = Объект.КонтактноеЛицоПодписант И ЗначениеЗаполнено(Объект.КонтактноеЛицоПодписант);
	Если НЕ КонтактОсновноеКЛ И НЕ КонтактПодписант И НЕ Модифицированность Тогда
		РазорватьСвязьКЛНаСервере(КонтактноеЛицо);
		Прочитать();		
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВопросОсновноеКЛПодписантВыборКонтрагента", ЭтотОбъект, Новый Структура("КонтактноеЛицо", КонтактноеЛицо));
	ПроверитьКонтактНаОсновнойИПодписанта(ДанныеКонтактногоЛица, Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура РазорватьСвязьКЛНаСервере(КонтактноеЛицо)
	
	ДанныеКонтактногоЛица = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("КонтактноеЛицо", КонтактноеЛицо))[0];
	
	ОсновнойКонтакт = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("Основной", Истина));
	Если ОсновнойКонтакт.Количество() > 0 И ОсновнойКонтакт[0].КонтактноеЛицо = КонтактноеЛицо Тогда
		ОсновнойКонтакт[0].Основной = Ложь;
		Объект.КонтактноеЛицо = Неопределено;  
		ДанныеКонтактныхЛиц.Удалить(ОсновнойКонтакт[0]);
		Если ОсновнойКонтакт[0].Подписант = Истина Тогда
			Объект.КонтактноеЛицоПодписант = Неопределено; 
		КонецЕсли;
	КонецЕсли; 
	
	Подписант = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("Подписант", Истина));
	Если Подписант.Количество() > 0 И Подписант[0].КонтактноеЛицо = КонтактноеЛицо Тогда
		Подписант[0].Подписант = Ложь;
		Объект.КонтактноеЛицоПодписант = Неопределено; 
		ДанныеКонтактныхЛиц.Удалить(Подписант[0]);
	КонецЕсли; 

	РегистрыСведений.СвязиКонтрагентКонтакт.УстановитьНедействительной(Объект.Ссылка, ДанныеКонтактногоЛица.КонтактноеЛицо);
	
	Записать();
	ЗаполнитьИОбновитьКонтактныеЛица();
	СоздатьОбновитьКарточкиКИ();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОбновлениеКИ(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Прочитать();
	КонецЕсли;
	
	ЗаполнитьИОбновитьКонтактныеЛица();	
	ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц();
 	СоздатьОбновитьКарточкиКИ();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросКонтрагентНеЗаписан(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	Записать();                        
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;      
	
	ПереданаСтруктура = ТипЗнч(ДополнительныеПараметры) = Тип("Структура");	
	ПараметрыОткрытия = Новый Структура;
	Если ЭтоНовый = Истина ИЛИ (ПереданаСтруктура = Истина И ДополнительныеПараметры.Свойство("ЭтоДобавлениеКЛ")) Тогда
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", Новый Структура("Контрагент", Объект.Ссылка));	
	Иначе       
		Если ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда
			Возврат;
		КонецЕсли;
		Если Не ДополнительныеПараметры.Свойство("Ключ") Тогда
			Возврат;
		КонецЕсли;
		ПараметрыОткрытия.Вставить("Ключ", ДополнительныеПараметры.Ключ);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.КонтактныеЛица.Форма.ФормаЭлемента", ПараметрыОткрытия
		,ЭтотОбъект,,,, Новый ОписаниеОповещения("ОбработатьОбновлениеКИ", ЭтотОбъект),  РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросКонтрагентНеЗаписанСвязь(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	Записать();                        
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОткрытиеИзФормыКонтрагента", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаСписка",ПараметрыФормы,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросОсновноеКЛПодписантВыборКонтрагента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		РазорватьСвязьКЛНаСервере(ДополнительныеПараметры.КонтактноеЛицо);
		Прочитать();				
	КонецЕсли;
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(Элемент)

	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(ЭтотОбъект, Элемент); 

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока,
		Поле, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область БанковскийСчетПоУмолчанию

&НаСервере
Процедура ПрочитатьБанковскийСчетПоУмолчанию(БанковскийСчетПоУмолчанию)

	Если ЗначениеЗаполнено(БанковскийСчетПоУмолчанию) Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БанковскийСчетПоУмолчанию, "Банк, НомерСчета");
		ОсновнойСчет_Банк = ЗначенияРеквизитов.Банк;
		ОсновнойСчет_Номер = ЗначенияРеквизитов.НомерСчета;
		ЯвляетсяБанкомРФ = ЯвляетсяБанкомРФ(ЗначенияРеквизитов.Банк);
		ИзменилиБанковскийСчет = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьБанковскийСчетПоУмолчанию(ТекущийОбъект)

	Если Не ЗначениеЗаполнено(ОсновнойСчет_Банк) Или ПустаяСтрока(ОсновнойСчет_Номер) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ОсновнойСчет_Банк) = Тип("СправочникСсылка.КлассификаторБанков") Тогда
		ОсновнойСчет_Банк = БанкиУНФ.БанкИзКлассификатора(ОсновнойСчет_Банк);
	КонецЕсли;

	Если ТекущийОбъект.ЭтоНовый() Тогда
	// Если организация новая, банковский счет надо создавать новый
		НадоСоздаватьНовый = Истина;
	Иначе
	// Для существующего контрагента, надо проверять наличие банковского счета с такими же ключевыми полями

		Запрос = Новый Запрос;
		Запрос.Текст = "
					   |ВЫБРАТЬ ПЕРВЫЕ 1
					   |	БанковскиеСчета.Ссылка
					   |ИЗ
					   |	Справочник.БанковскиеСчета КАК БанковскиеСчета
					   |ГДЕ
					   |	БанковскиеСчета.Владелец = &Владелец
					   |	И БанковскиеСчета.Банк = &Банк
					   |	И БанковскиеСчета.НомерСчета = &НомерСчета";

		Запрос.УстановитьПараметр("Владелец", ТекущийОбъект.Ссылка);
		Запрос.УстановитьПараметр("Банк", ОсновнойСчет_Банк);
		Запрос.УстановитьПараметр("НомерСчета", ОсновнойСчет_Номер);

		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);

		Если РезультатЗапроса.Пустой() Тогда
			// Нет банковского счета с такими ключевыми полями
			Если ЗначениеЗаполнено(ТекущийОбъект.БанковскийСчетПоУмолчанию) Тогда
				// Модифицируется существующий основной счет
				НадоСоздаватьНовый = Ложь;
			Иначе
				// Создается новый
				НадоСоздаватьНовый = Истина;
			КонецЕсли;
		Иначе
			// Банковский счет есть, устанавливаем его в качестве основного
			НадоСоздаватьНовый = Ложь;

			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ТекущийОбъект.БанковскийСчетПоУмолчанию = Выборка.Ссылка;
		КонецЕсли;

	КонецЕсли;

	Если НадоСоздаватьНовый Тогда
		ТекущийОбъект.БанковскийСчетПоУмолчанию = Справочники.БанковскиеСчета.ПолучитьСсылку();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьБанковскийСчетПоУмолчанию(ТекущийОбъект)

	Если Не ЗначениеЗаполнено(ОсновнойСчет_Банк) Или ПустаяСтрока(ОсновнойСчет_Номер) Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	БанковскийСчетОбъект = ТекущийОбъект.БанковскийСчетПоУмолчанию.ПолучитьОбъект();

	Если БанковскийСчетОбъект = Неопределено Тогда
		
		// Создание
		БанковскийСчетОбъект = Справочники.БанковскиеСчета.СоздатьЭлемент();
		БанковскийСчетОбъект.УстановитьСсылкуНового(ТекущийОбъект.БанковскийСчетПоУмолчанию);
		БанковскийСчетОбъект.Заполнить(ТекущийОбъект.Ссылка);

	Иначе

		БанковскийСчетОбъект.Заблокировать();

	КонецЕсли;
	
	// Внесение изменений
	БанковскийСчетОбъект.Банк = ОсновнойСчет_Банк;
	БанковскийСчетОбъект.НомерСчета = ОсновнойСчет_Номер;
	БанковскийСчетОбъект.СформироватьНаименование();
	
	// Запись объекта
	БанковскийСчетОбъект.Записать();

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Является банком РФ.
// 
// Параметры:
//  Банк - СправочникСсылка.Банки
// 
// Возвращаемое значение:
//  Булево - Является банком РФ
&НаСервереБезКонтекста
Функция ЯвляетсяБанкомРФ(Банк)
	
	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(Банк) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(Банк) = Тип("СправочникСсылка.КлассификаторБанков") Тогда
		КодСтраныРоссия = "643";
		Результат =
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "КодСтраны") = КодСтраныРоссия;
	КонецЕсли;
	
	Если ТипЗнч(Банк) = Тип("СправочникСсылка.Банки") Тогда
		Результат =
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "Страна") = Справочники.СтраныМира.Россия;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура УстановитьМаскуНомераСчета()

	Если ЯвляетсяБанкомРФ Тогда
		Элементы.НомерСчета.Маска 	= "99999999999999999999";
	Иначе
		Элементы.НомерСчета.Маска 	= "";
		ПодсказкаНомераСчета 		= "";
		Элементы.НомерСчета.Подсказка = ПодсказкаНомераСчета;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Теги

&НаКлиенте
Процедура Подключаемый_ДобавитьВведенныйТегТекст()
	
	ДобавитьВведенныйТегСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДобавитьВведенныйТег()
	
	Если ДобавлениеТега = Ложь Тогда
		Возврат;
	КонецЕсли; 
	
	ДобавлениеТега = Ложь;
	ДобавитьВведенныйТегСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВведенныйТегСервер()
	
	ТегированиеОбъектов.ДобавитьВведенныйТег(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьИсториюНаименования()
	
	ПараметрыФормы = Новый Структура(
	"ТекущееНаименованиеПолное, ИсторияНаименований, ТолькоПросмотр",
	Объект.НаименованиеПолное, Объект.ИсторияНаименований, ТолькоПросмотр);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьИсториюНаименованияЗавершение", ЭтотОбъект);
	
	ОткрытьФорму(
	"Справочник.Контрагенты.Форма.РедактированиеИсторииНаименований", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюНаименованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНаименованиеПослеРедактированияИстории(Результат.ИсторияНаименований);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеВзаиморасчетов(Вариант)
	
	Если Вариант = "настройки" Тогда // Не локализуется
		ПараметрыФормы = Новый Структура("СтрокаПоиска", НСтр("ru='заполнение реквизитов контрагента'"));
		ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоБыстройФорме()
	
	Объект.Наименование = Объект.НаименованиеПолное;
	
	ОсновнойСчет_Банк = Параметры.ЗначенияЗаполнения.ОсновнойСчет_Банк;
	ОсновнойСчет_Номер = Параметры.ЗначенияЗаполнения.ОсновнойСчет_Номер;
	
	Для Каждого СтрокаКонтактнойИнформации Из Параметры.КонтактнаяИнформация Цикл
		НоваяСтрока = Объект.КонтактнаяИнформация.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКонтактнойИнформации);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СтранаРегистрацииПриИзмененииНаСервере()
	
	Если ВестиУчетПрослеживаемыхТоваров Тогда
		Если ЗначениеЗаполнено(Объект.СтранаРегистрации) Тогда
			УчастникЕАЭС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтранаРегистрации, "УчастникЕАЭС");
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаименованиеПослеРедактированияИстории(НаборЗаписей)
	
	Модифицированность = Истина;
	
	НаборЗаписей.Сортировать("Период");
	
	Объект.ИсторияНаименований.Очистить();
	Если НаборЗаписей.Количество() > 1 Тогда
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			ЗаписьИстории = Объект.ИсторияНаименований.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьИстории, ЗаписьНабора);
		КонецЦикла;
	КонецЕсли;
	
	ФормироватьНаименованиеАвтоматически = ПустаяСтрока(Объект.НаименованиеПолное)
		ИЛИ (Объект.НаименованиеПолное = Объект.Наименование);
		
	Объект.НаименованиеПолное = НаборЗаписей[НаборЗаписей.Количество()-1].НаименованиеПолное;
	
	ПриИзмененииНаименованияКонтрагента();
	
	ОпределитьВидКонтрагента(ЭтотОбъект);
	УправлениеФормой();
	
	Если НЕ ПроверятьЮрНазваниеНаДубли И ПроверятьПредставлениеНаДубли Тогда
		ПроверитьНаДубли("Наименование");
	КонецЕсли;
	
	Если НЕ ПроверятьЮрНазваниеНаДубли Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.НаименованиеПолное)) Тогда
		Элементы.НаименованиеПолное.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Возврат;
	КонецЕсли;
	
	ПроверитьНаДубли("НаименованиеПолное");
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКПППослеРедактированияИстории(НаборЗаписей)
	
	Модифицированность = Истина;
	
	НаборЗаписей.Сортировать("Период");
	
	Объект.ИсторияКПП.Очистить();
	Если НаборЗаписей.Количество() > 1 Тогда
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			ЗаписьИстории = Объект.ИсторияКПП.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьИстории, ЗаписьНабора);
		КонецЦикла;
	КонецЕсли;
	
	Объект.КПП = НаборЗаписей[НаборЗаписей.Количество()-1].КПП;
	
	СформироватьПредставлениеПроверкиКПП(ЭтотОбъект);
	СформироватьПредставлениеПроверкиДублей(ЭтотОбъект);
	
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(ЭтотОбъект);
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаСервере
Функция ЕстьКомиссияБезЗаказов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.НеУчитыватьЗаказыПриПередачеНаКомиссию";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере(ПереходИзБыстройФормы = Ложь)
	
	ВестиУчетПрослеживаемыхТоваров = ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров");
	
	Если ВестиУчетПрослеживаемыхТоваров И ЗначениеЗаполнено(Объект.СтранаРегистрации) Тогда
		УчастникЕАЭС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтранаРегистрации, "УчастникЕАЭС");
	КонецЕсли;
	
	// 1. Инициализация реквизитов формы
	
	КлассификаторОПФ.Загрузить(РегламентированныеДанныеПовтИсп.КлассификаторОрганизационноПравовыхФорм());
	
	ПросмотрВзаиморасчетов = ПравоДоступа("Просмотр", Метаданные.Отчеты.Взаиморасчеты);
	ПросмотрПродаж = ПравоДоступа("Просмотр", Метаданные.Отчеты.Продажи);
	
	// 2. Чтение дополнительных данных
	
	ЗаполнитьИОбновитьКонтактныеЛица();
	
	ТегированиеОбъектов.ПриСозданииПриЧтенииНаСервере(ЭтотОбъект,Объект);
	
	ПрочитатьДанныеПанелиДопИнформации();
	
	ЭтотКонтрагентЯвляетсяГоловным = КонтрагентЯвляетсяГоловным(Объект.Ссылка);
	
	// Заполним список возможных кратких наименований и определим флаг автоматической смены краткого наименования
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект);
	
	ФормироватьНаименованиеАвтоматически = ПустаяСтрока(Объект.Наименование)
		Или Элементы.Наименование.СписокВыбора.НайтиПоЗначению(Объект.Наименование) <> Неопределено
		Или (ДанныеКонтактныхЛиц.Количество() > 0 И Элементы.Наименование.СписокВыбора.НайтиПоЗначению(ДанныеКонтактныхЛиц[0].Наименование) <> Неопределено);
	
	Если Параметры.Свойство("ДанныеИзКонтактнойФормы") Тогда
		ЗаполнитьПоДаннымКонтактнойФормы(Параметры);
	КонецЕсли;
	
	Если Параметры.Свойство("КонтактКакСвязаться", КонтактКакСвязаться) Тогда
		ЗаполнитьКонтактКакСвязаться();
	КонецЕсли;
	
	ЗаполнитьВидКонтрагента();
	
	УстановитьОтображениеСсылкиНаЛидов();
	ЗаполнитьТаблицуВзаиморасчетов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидКонтрагента()

	Если Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
		Если Объект.Самозанятый Тогда 
			Вид = "Самозанятый";
		Иначе
			Вид = "ФизическоеЛицо";
		КонецЕсли;
	ИначеЕсли Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель Тогда
		Вид = "ИндивидуальныйПредприниматель";
	ИначеЕсли Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган Тогда
		Вид = "ГосударственныйОрган";
	Иначе
		Вид = "ЮридическоеЛицо";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	ЭтоЮридическоеЛицо = (Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо"));
	
	// Изменяем видимость реквизитов формы в зависимости от вида контрагента
	Если ЭтоЮридическоеЛицо Тогда
		
		КонтрагентЗарегистрированВРФ = Объект.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
		
		Элементы.СтранаРегистрации.Видимость				= Истина;
		Элементы.ФИО.Видимость								= Ложь;
		Элементы.ИНН.Видимость								= Истина;
		Элементы.ИНН1.Видимость								= Истина;
		Элементы.ГруппаИНН.Видимость								= Истина;
		Элементы.ГруппаИНН1.Видимость								= Истина;
		Элементы.КПП.Видимость								= КонтрагентЗарегистрированВРФ;
		Элементы.КПП1.Видимость								= КонтрагентЗарегистрированВРФ;
		Элементы.ГруппаКПП.Видимость								= КонтрагентЗарегистрированВРФ;
		Элементы.ГруппаКПП1.Видимость								= КонтрагентЗарегистрированВРФ;
		Элементы.КодПоОКПО.Видимость						= КонтрагентЗарегистрированВРФ;
		Элементы.ГруппаКодПоОКПО.Видимость						= КонтрагентЗарегистрированВРФ;
		Элементы.РегистрационныйНомер.Видимость				= Истина;
		Элементы.РегистрационныйНомер1.Видимость				= Истина;
		Элементы.ГруппаРегистрационныйНомер.Видимость				= Истина;
		Элементы.ГруппаРегистрационныйНомер1.Видимость				= Не КонтрагентЗарегистрированВРФ;
		Элементы.ВидГосударственногоОргана.Видимость		= Ложь;
		Элементы.КодГосударственногоОргана.Видимость		= Ложь;
		Элементы.СвидетельствоСерияНомер.Видимость			= Ложь;
		Элементы.СвидетельствоДатаВыдачи.Видимость			= Ложь;
		Элементы.ДокументУдостоверяющийЛичность.Видимость	= Ложь;
		Элементы.Пол.Видимость								= Ложь;
		Элементы.ДатаРождения.Видимость						= Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчастникЕАЭС", "Видимость", ВестиУчетПрослеживаемыхТоваров);
		
		Элементы.ИНН.ПодсказкаВвода							= НСтр("ru = '10 цифр'");
		Элементы.ИНН.ОграничениеТипа						= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10));
		Элементы.ИНН1.ПодсказкаВвода							= НСтр("ru = '10 цифр'");
		Элементы.ИНН1.ОграничениеТипа						= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10));
		Элементы.КодПоОКПО.ПодсказкаВвода					= НСтр("ru = '8 цифр'");
		Элементы.КодПоОКПО.ОграничениеТипа					= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(8));
		Элементы.НаименованиеПолное.ПодсказкаВвода			= НСтр("ru = 'Юридическое название'");
		
		Если КонтрагентЗарегистрированВРФ Тогда
			Элементы.РегистрационныйНомер.Заголовок			= НСтр("ru = 'ОГРН'");
			Элементы.РегистрационныйНомер.Подсказка			= НСтр("ru = 'Основной государственный регистрационный номер юридического лица'");
			Элементы.РегистрационныйНомер.ПодсказкаВвода	= НСтр("ru = '13 цифр'");
			Элементы.РегистрационныйНомер.ОграничениеТипа	= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(13));
			Элементы.РегистрационныйНомер1.Заголовок			= НСтр("ru = 'ОГРН'");
			Элементы.РегистрационныйНомер1.Подсказка			= НСтр("ru = 'Основной государственный регистрационный номер юридического лица'");
			Элементы.РегистрационныйНомер1.ПодсказкаВвода	= НСтр("ru = '13 цифр'");
			Элементы.РегистрационныйНомер1.ОграничениеТипа	= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(13));
			Элементы.ИНН.Подсказка							= НСтр("ru = 'Идентификационный номер налогоплательщика'");
			Элементы.ИНН1.Подсказка							= НСтр("ru = 'Идентификационный номер налогоплательщика'");
		Иначе
			Элементы.РегистрационныйНомер.Заголовок			= НСтр("ru='Рег. номер'");
			Элементы.РегистрационныйНомер.Подсказка			= НСтр("ru='Регистрационный номер, присвоенный иностранной организации в стране регистрации (инкорпорации)'");
			Элементы.РегистрационныйНомер.ПодсказкаВвода	= НСтр("ru='Рег. номер в стране регистрации'");
			Элементы.РегистрационныйНомер.ОграничениеТипа	= Новый ОписаниеТипов("Строка");
			Элементы.РегистрационныйНомер1.Заголовок			= НСтр("ru='Рег. номер'");
			Элементы.РегистрационныйНомер1.Подсказка			= НСтр("ru='Регистрационный номер, присвоенный иностранной организации в стране регистрации (инкорпорации)'");
			Элементы.РегистрационныйНомер1.ПодсказкаВвода	= НСтр("ru='Рег. номер в стране регистрации'");
			Элементы.РегистрационныйНомер1.ОграничениеТипа	= Новый ОписаниеТипов("Строка");
			Элементы.ИНН.Подсказка							= НСтр("ru = 'Идентификационный номер налогоплательщика, присваивается иностранной организации 
																	|при первой постановке на учет в налоговом органе Российской Федерации'");
			Элементы.ИНН1.Подсказка							= НСтр("ru = 'Идентификационный номер налогоплательщика, присваивается иностранной организации 
																	|при первой постановке на учет в налоговом органе Российской Федерации'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИНН", "Доступность", НЕ ЗначениеЗаполнено(Объект.ГоловнойКонтрагент));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИНН1", "Доступность", НЕ ЗначениеЗаполнено(Объект.ГоловнойКонтрагент));
		
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель") Тогда
		
		Элементы.СтранаРегистрации.Видимость				= Истина;
		Элементы.ФИО.Видимость								= Истина;
		Элементы.ИНН.Видимость								= Истина;
		Элементы.ИНН1.Видимость								= Истина;
		Элементы.ГруппаИНН.Видимость								= Истина;
		Элементы.ГруппаИНН1.Видимость								= Истина;
		Элементы.КПП.Видимость								= Ложь;
		Элементы.КПП1.Видимость								= Ложь;
		Элементы.ГруппаКПП.Видимость								= Ложь;
		Элементы.ГруппаКПП1.Видимость								= Ложь;
		Элементы.КодПоОКПО.Видимость						= Истина;
		Элементы.ГруппаКодПоОКПО.Видимость						= Истина;
		Элементы.РегистрационныйНомер.Видимость				= Истина;
		Элементы.РегистрационныйНомер1.Видимость				= Истина;
		Элементы.ГруппаРегистрационныйНомер.Видимость				= Истина;
		Элементы.ГруппаРегистрационныйНомер1.Видимость				= Ложь;
		Элементы.ВидГосударственногоОргана.Видимость		= Ложь;
		Элементы.КодГосударственногоОргана.Видимость		= Ложь;
		Элементы.СвидетельствоСерияНомер.Видимость			= Истина;
		Элементы.СвидетельствоДатаВыдачи.Видимость			= Истина;
		Элементы.ДокументУдостоверяющийЛичность.Видимость	= Истина;
		Элементы.Пол.Видимость								= Истина;
		Элементы.ДатаРождения.Видимость						= Истина;
		Элементы.НаименованиеПолное.ПодсказкаВвода			= НСтр("ru = 'Юридическое название'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчастникЕАЭС", "Видимость", ВестиУчетПрослеживаемыхТоваров);
		
		Элементы.РегистрационныйНомер.Заголовок				= НСтр("ru = 'ОГРН ИП'");
		Элементы.РегистрационныйНомер.Подсказка 			= НСтр("ru = 'Основной государственный регистрационный номер индивидуального предпринимателя, 
																	|указан в Свидетельстве о государственной регистрации физического лица в качестве ИП'");
		Элементы.РегистрационныйНомер.ПодсказкаВвода		= НСтр("ru = '15 цифр'");
		Элементы.РегистрационныйНомер.ОграничениеТипа		= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(15));
		Элементы.РегистрационныйНомер1.Заголовок				= НСтр("ru = 'ОГРН ИП'");
		Элементы.РегистрационныйНомер1.Подсказка 			= НСтр("ru = 'Основной государственный регистрационный номер индивидуального предпринимателя, 
																	|указан в Свидетельстве о государственной регистрации физического лица в качестве ИП'");
		Элементы.РегистрационныйНомер1.ПодсказкаВвода		= НСтр("ru = '15 цифр'");
		Элементы.РегистрационныйНомер1.ОграничениеТипа		= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(15));
		Элементы.ИНН.ПодсказкаВвода							= НСтр("ru = '12 цифр'");
		Элементы.ИНН.ОграничениеТипа						= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(12));
		Элементы.ИНН1.ПодсказкаВвода							= НСтр("ru = '12 цифр'");
		Элементы.ИНН1.ОграничениеТипа						= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(12));
		Элементы.КодПоОКПО.ПодсказкаВвода					= НСтр("ru = '10 цифр'");
		Элементы.КодПоОКПО.ОграничениеТипа					= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10));
		
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо") Тогда
		
		Элементы.СтранаРегистрации.Видимость				= Истина;
		Элементы.ФИО.Видимость								= Истина;
		Элементы.ИНН.Видимость								= Истина;
		Элементы.ИНН1.Видимость								= Истина;
		Элементы.ГруппаИНН.Видимость								= Истина;
		Элементы.ГруппаИНН1.Видимость								= Истина;
		Элементы.КПП.Видимость								= Ложь;
		Элементы.КПП1.Видимость								= Ложь;
		Элементы.ГруппаКПП.Видимость								= Ложь;
		Элементы.ГруппаКПП1.Видимость								= Ложь;
		Элементы.КодПоОКПО.Видимость						= Ложь;
		Элементы.ГруппаКодПоОКПО.Видимость						= Ложь;
		Элементы.РегистрационныйНомер.Видимость				= Ложь;
		Элементы.РегистрационныйНомер1.Видимость				= Ложь;
		Элементы.ГруппаРегистрационныйНомер.Видимость				= Ложь;
		Элементы.ГруппаРегистрационныйНомер1.Видимость				= Ложь;
		Элементы.ВидГосударственногоОргана.Видимость		= Ложь;
		Элементы.КодГосударственногоОргана.Видимость		= Ложь;
		Элементы.СвидетельствоСерияНомер.Видимость			= Ложь;
		Элементы.СвидетельствоДатаВыдачи.Видимость			= Ложь;
		Элементы.ДокументУдостоверяющийЛичность.Видимость	= Истина;
		Элементы.Пол.Видимость								= Истина;
		Элементы.ДатаРождения.Видимость						= Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчастникЕАЭС", "Видимость", ВестиУчетПрослеживаемыхТоваров);
		
		Элементы.ИНН.ПодсказкаВвода					= НСтр("ru = '12 цифр'");
		Элементы.ИНН.ОграничениеТипа				= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(12));
		Элементы.ИНН1.ПодсказкаВвода					= НСтр("ru = '12 цифр'");
		Элементы.ИНН1.ОграничениеТипа				= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(12));
		Элементы.НаименованиеПолное.ПодсказкаВвода	= НСтр("ru = 'Фамилия Имя Отчество'");
		
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ГосударственныйОрган") Тогда
		
		Элементы.СтранаРегистрации.Видимость				= Ложь;
		Элементы.ФИО.Видимость								= Ложь;
		Элементы.ИНН.Видимость								= Истина;
		Элементы.ИНН1.Видимость								= Истина;
		Элементы.ГруппаИНН.Видимость								= Истина;
		Элементы.ГруппаИНН1.Видимость								= Истина;
		Элементы.КПП.Видимость								= Истина;
		Элементы.КПП1.Видимость								= Истина;
		Элементы.ГруппаКПП.Видимость								= Истина;
		Элементы.ГруппаКПП1.Видимость								= Истина;
		Элементы.КодПоОКПО.Видимость						= Ложь;
		Элементы.ГруппаКодПоОКПО.Видимость						= Ложь;
		Элементы.РегистрационныйНомер.Видимость				= Ложь;
		Элементы.РегистрационныйНомер1.Видимость				= Ложь;
		Элементы.ГруппаРегистрационныйНомер.Видимость				= Ложь;
		Элементы.ГруппаРегистрационныйНомер1.Видимость				= Ложь;
		Элементы.ВидГосударственногоОргана.Видимость		= Истина;
		Элементы.КодГосударственногоОргана.Видимость		= Истина;
		Элементы.СвидетельствоСерияНомер.Видимость			= Ложь;
		Элементы.СвидетельствоДатаВыдачи.Видимость			= Ложь;
		Элементы.ДокументУдостоверяющийЛичность.Видимость	= Ложь;
		Элементы.Пол.Видимость								= Ложь;
		Элементы.ДатаРождения.Видимость						= Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчастникЕАЭС", "Видимость", Ложь);
		
		Элементы.ИНН.ПодсказкаВвода					= НСтр("ru = '10 цифр'");
		Элементы.ИНН.ОграничениеТипа				= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10));
		Элементы.ИНН1.ПодсказкаВвода					= НСтр("ru = '10 цифр'");
		Элементы.ИНН1.ОграничениеТипа				= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10));
		Элементы.НаименованиеПолное.ПодсказкаВвода	= НСтр("ru = 'Юридическое название'");
		
		Если ЗначениеЗаполнено(Объект.ВидГосударственногоОргана) Тогда
			
			Если Объект.ВидГосударственногоОргана = ПредопределенноеЗначение("Перечисление.ВидыГосударственныхОрганов.НалоговыйОрган") Тогда
				Элементы.КодГосударственногоОргана.ОграничениеТипа	= Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(4));
				Элементы.КодГосударственногоОргана.Заголовок		= НСтр("ru = 'Код инспекции'");
			ИначеЕсли Объект.ВидГосударственногоОргана = ПредопределенноеЗначение("Перечисление.ВидыГосударственныхОрганов.ОрганПФР") Тогда
				Элементы.КодГосударственногоОргана.ОграничениеТипа	= Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(3));
				Элементы.КодГосударственногоОргана.Заголовок		= НСтр("ru = 'Код отделения'");
			ИначеЕсли Объект.ВидГосударственногоОргана = ПредопределенноеЗначение("Перечисление.ВидыГосударственныхОрганов.ОрганФСС") Тогда
				Элементы.КодГосударственногоОргана.ОграничениеТипа	= Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(4));
				Элементы.КодГосударственногоОргана.Заголовок		= НСтр("ru = 'Код отделения'");
			Иначе
				Элементы.КодГосударственногоОргана.ОграничениеТипа	= Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10));
				Элементы.КодГосударственногоОргана.Заголовок		= НСтр("ru = 'Код'");
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ИсточникПривлеченияПокупателя.Видимость = Объект.Покупатель;
	Если ОбязательноЗаполнятьИсточникВПокупателях И Объект.Покупатель Тогда
		Элементы.ИсточникПривлеченияПокупателя.АвтоОтметкаНезаполненного = Истина;
		Элементы.ИсточникПривлеченияПокупателя.ОтметкаОбязательногоЗаполнения = Элементы.ИсточникПривлеченияПокупателя.АвтоОтметкаНезаполненного;
	КонецЕсли;
	Элементы.ФормаПроверитьКонтрагентаНаДубли.Видимость = ПроверятьПредставлениеНаДубли ИЛИ ПроверятьАдресЭПНаДубли 
		ИЛИ ПроверятьНомерТелефонаНаДубли ИЛИ ПроверятьЮрНазваниеНаДубли;
	Элементы.ОстатокВзаиморасчетов.Видимость	= ПросмотрВзаиморасчетов;
	Элементы.СуммаПродаж.Видимость				= ПросмотрПродаж И Объект.Покупатель;
	Элементы.ПоследняяПродажа.Видимость			= ПросмотрПродаж И Объект.Покупатель;
	Элементы.ПоследнееСобытие.Видимость			= ИспользоватьСобытия;
	Элементы.ПокупательПоставщикПрочие.Заголовок = ЗаголовокГруппыВидКонтрагентаМК(ЭтотОбъект);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГоловнойКонтрагент", "Видимость", ЭтоЮридическоеЛицо И НЕ ЭтотКонтрагентЯвляетсяГоловным);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"Подразделения", 
		"Видимость", 
		ЭтоЮридическоеЛицо И (ЭтотКонтрагентЯвляетсяГоловным ИЛИ ЗначениеЗаполнено(Объект.ГоловнойКонтрагент)));
	
	// Взаиморасчеты
	УстановитьВидимостьФлагаВ_УЕ();
	УстановитьЗаголовкиИВидимостьПриИзмененииФлагаРасчетовПоДоговорам();
	// Конец Взаиморасчеты
	
	// КабинетКлиента
	УстановитьВидимостьГруппыКабинетКлиента();
	// Конец КабинетКлиента
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокФормы(Форма)
	
	Объект = Форма.Объект;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Форма.Автозаголовок = Истина;
		Возврат;
	КонецЕсли;
	
	Форма.Автозаголовок = Ложь;
	ВидыОтношений = Новый Массив;
	
	Если Объект.Покупатель Тогда
		ВидыОтношений.Добавить(НСтр("ru='Покупатель'"));
	КонецЕсли;
	
	Если Объект.Поставщик Тогда
		ВидыОтношений.Добавить(НСтр("ru='Поставщик'"));
	КонецЕсли;
	
	Если Объект.ПрочиеОтношения Тогда
		ВидыОтношений.Добавить(НСтр("ru='Прочие отношения'"));
	КонецЕсли;
	
	Заголовок = Объект.Наименование + " (" + НСтр("ru='Контрагент'");
	
	Если ВидыОтношений.Количество() > 0 Тогда
		Заголовок = Заголовок + ": ";
		Для Каждого Вид Из ВидыОтношений Цикл
			Заголовок = Заголовок + Вид + ", ";
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(Заголовок, 2);
	КонецЕсли;
	
	Заголовок = Заголовок + ")";
	
	Форма.Заголовок = Заголовок;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораНаименования(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	СписокВыбора = Элементы.Наименование.СписокВыбора;
	СписокВыбора.Очистить();
	
	Если Не ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		
		Форма.ОрганизационноПравоваяФорма = УправлениеНебольшойФирмойКлиентСервер.ВыделитьИзНаименованияОПФ(Форма.КлассификаторОПФ, Объект.НаименованиеПолное);
		
		СписокВыбора.Добавить(Форма.ОрганизационноПравоваяФорма.НаименованиеБезОПФ);
		
		Если НЕ ПустаяСтрока(Форма.ОрганизационноПравоваяФорма.КраткаяФорма) Тогда
			СписокВыбора.Вставить(0, Форма.ОрганизационноПравоваяФорма.НаименованиеБезОПФ + " " + Форма.ОрганизационноПравоваяФорма.КраткаяФорма);
			СписокВыбора.Добавить(Форма.ОрганизационноПравоваяФорма.КраткаяФорма + " " + Форма.ОрганизационноПравоваяФорма.НаименованиеБезОПФ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Форма.ДанныеКонтактныхЛиц.Количество() > 0 И Не ПустаяСтрока(Форма.ДанныеКонтактныхЛиц[0].Наименование) Тогда
		СписокВыбора.Добавить(Строка(Форма.ДанныеКонтактныхЛиц[0].Наименование));
	КонецЕсли;
	
	Форма.Элементы.Наименование.КнопкаВыпадающегоСписка = СписокВыбора.Количество() > 0;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьВидКонтрагента(Форма)
	
	Если ТипЗнч(Форма.ОрганизационноПравоваяФорма) <> Тип("Структура") 
		Или Не Форма.ОрганизационноПравоваяФорма.Свойство("ПолнаяФорма") Тогда
		
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ОрганизационноПравоваяФорма.ПолнаяФорма = "Индивидуальный предприниматель" Тогда
		Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель");
	ИначеЕсли Не ПустаяСтрока(Форма.ОрганизационноПравоваяФорма.ПолнаяФорма) Тогда
		Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоТекстуЗаполнения(Знач ТекстЗаполнения)
	
	Если (СтрДлина(ТекстЗаполнения) = 10 ИЛИ СтрДлина(ТекстЗаполнения) = 12)
		И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ТекстЗаполнения) Тогда
		
		Объект.Наименование = "";
		Объект.ИНН = ТекстЗаполнения;
		Объект.ВидКонтрагента = ?(СтрДлина(ТекстЗаполнения) = 10,
			Перечисления.ВидыКонтрагентов.ЮридическоеЛицо,
			Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель);
		ТекстЗаполнения = Неопределено;
		
		ОписаниеОшибкиЗаполнения = "";
		ЗаполнитьРеквизитыПоИНННаСервере(Объект.ИНН);
		
	Иначе
		
		Объект.НаименованиеПолное = ТекстЗаполнения;
		ТекущийЭлемент = Элементы.НаименованиеПолное;
		
		ФормироватьНаименованиеАвтоматически = Истина;
		ЗаполнитьСписокВыбораНаименования(ЭтотОбъект);
		Если Элементы.Наименование.СписокВыбора.Количество() > 0 Тогда
			Объект.Наименование = Элементы.Наименование.СписокВыбора[0];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтактКакСвязаться()
	
	Если Не Параметры.Свойство("КонтактКакСвязаться") Тогда
		Возврат;
	КонецЕсли;
	
	Если КонтактКакСвязаться.ВидКонтакта = "Контрагент" Тогда
		
		Если КонтактКакСвязаться.ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			ВидКИ = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EmailКонтрагента");
		ИначеЕсли КонтактКакСвязаться.ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			ВидКИ = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента");
		КонецЕсли;
		Если ВидКИ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Объект.Наименование = КонтактКакСвязаться.Контакт;
		Объект.НаименованиеПолное = КонтактКакСвязаться.Контакт;
		
		СтруктураКИ = Новый Структура();
		СтруктураКИ.Вставить("Представление", КонтактКакСвязаться.КакСвязаться);
		СтруктураКИ.Вставить("Комментарий");
		СтруктураКИ.Вставить("Значение");
		СтруктураКИ.Вставить("Вид", ВидКИ);
		
		УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформацию(ЭтотОбъект, Объект, СтруктураКИ);
		
	КонецЕсли;
	
	Если КонтактКакСвязаться.ВидКонтакта = "КонтактноеЛицо" Тогда
		
		Если КонтактКакСвязаться.ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			ВидКИ = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EmailКонтактногоЛица");
		ИначеЕсли КонтактКакСвязаться.ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			ВидКИ = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица");
		КонецЕсли;
		Если ВидКИ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
			Объект.Наименование = КонтактКакСвязаться.Контакт;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ФИО) Тогда
			Объект.ФИО = КонтактКакСвязаться.Контакт;
		КонецЕсли;
		
		ДобавляемСтрокуКонтакта = Ложь;
		Если ДанныеКонтактныхЛиц.Количество() = 0 ИЛИ ЗначениеЗаполнено(ДанныеКонтактныхЛиц[0].Наименование) Тогда
			ДанныеКЛ = ДанныеКонтактныхЛиц.Добавить();
			ИндексКЛ = ДанныеКонтактныхЛиц.Индекс(ДанныеКЛ);
			ДобавляемСтрокуКонтакта = Истина;			
		Иначе
			ДанныеКЛ = ДанныеКонтактныхЛиц[0];
			ИндексКЛ = 0;
		КонецЕсли;
		
		ДанныеКЛ.ГруппаРазвернута = Истина;
 
		Если ТипЗнч(КонтактКакСвязаться.Контакт) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
			КонтактСсылка = КонтактКакСвязаться.Контакт; // см. СправочникСсылка.КонтактныеЛица
			ДанныеКЛ.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонтактСсылка, "Наименование");
			ДанныеКЛ.КонтактноеЛицо = КонтактКакСвязаться.Контакт;
			ДанныеКЛ.Изменен = Истина;
		Иначе
			ДанныеКЛ.Наименование = КонтактКакСвязаться.Контакт;
			ДанныеКЛ.Изменен = Истина;
		КонецЕсли;
		
		ПоказыватьВсеКонтакты = Истина;
		
		Если ДобавляемСтрокуКонтакта = Истина Тогда
			
			ЗаполнениеИзСвязанногоОбъекта = Истина;
			
			ОсновнаяТаблицаСоздана = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "ДанныеПанелиКонтактнойИнформации");
			
			Если ОсновнаяТаблицаСоздана = Ложь Тогда
				КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформацияТаблица_0");      
			КонецЕсли;
			
			СтрокиНетДанных = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.НайтиСтроки(Новый Структура("ТипОтображаемыхДанных","НетДанных"));
			Если СтрокиНетДанных.Количество() > 0 Тогда
				ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Удалить(СтрокиНетДанных[0]);	
			КонецЕсли; 
			НоваяСтрока = Новый Структура;
			НоваяСтрока.Вставить("Отображение", Строка(ДанныеКЛ.Наименование));
			НоваяСтрока.Вставить("ИндексПиктограммы", -1);
			НоваяСтрока.Вставить("ТипОтображаемыхДанных", "КонтактноеЛицо");
			СтрокаКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКИ, НоваяСтрока); 
			Если ЗначениеЗаполнено(КонтактКакСвязаться.КакСвязаться) Тогда
				СтрокаКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Добавить();
				СтрокаКИ.ТипОтображаемыхДанных = "ЗначениеКИ";
				СтрокаКИ.Отображение = Строка(ВидКИ) + ": " + КонтактКакСвязаться.КакСвязаться; 
				СтрокаКИ.ПредставлениеКИ = КонтактКакСвязаться.КакСвязаться;
				СтрокаКИ.ТипКИ = ВидКИ.Тип;
				СтрокаКИ.ИндексПиктограммы = -1;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

	ЗаполнитьОтображениеТипаКИ();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтактнуюИнформацию()
	
	Если Параметры.ДобавитьКонтактнуюИнформацию = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ДобавитьКонтактнуюИнформацию) = Тип("Структура") Тогда
		ДобавляемаяКИ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры.ДобавитьКонтактнуюИнформацию);
	ИначеЕсли ТипЗнч(Параметры.ДобавитьКонтактнуюИнформацию) = Тип("Массив") Тогда
		ДобавляемаяКИ = Параметры.ДобавитьКонтактнуюИнформацию;
	Иначе
		Возврат;
	КонецЕсли;
	
	Для каждого ОписаниеКИ Из ДобавляемаяКИ Цикл
		ДанныеКИ = Новый Структура();
		ДанныеКИ.Вставить("ИмяЭлементаДляРазмещения");
		ДанныеКИ.Вставить("Вид");
		ДанныеКИ.Вставить("Представление");
		ДанныеКИ.Вставить("Значение");
		
		ЗаполнитьЗначенияСвойств(ДанныеКИ, ОписаниеКИ);
		Если ОписаниеКИ.Свойство("ВидКИ") Тогда
			// Для совместимости.
			ДанныеКИ.Вид = ОписаниеКИ.ВидКИ;
		КонецЕсли;
		ДанныеКИ.ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
		УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформациюНаФорму(ЭтотОбъект, Объект, ДанныеКИ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СписокЗначенийИерархииКонтрагента(ТекущийГоловной, ТекущийКонтрагент)
	Возврат Справочники.Контрагенты.СписокПодразделенийГоловногоКонтрагента(ТекущийГоловной, ТекущийКонтрагент);	
КонецФункции

&НаКлиенте
Процедура ВыборКонтрагентаИзИерархии(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКонтрагента = Новый Структура("Ключ", Результат.Значение);
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыКонтрагента);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымКонтактнойФормы(ДополнительныеПараметры)
	
	Если ДополнительныеПараметры.Свойство("Связь") Тогда
		ДанныеКЛ = ДанныеКонтактныхЛиц.Добавить();
		ИндексКЛ = ДанныеКонтактныхЛиц.Индекс(ДанныеКЛ);
		ДанныеКЛ.Изменен = Истина;
		ИмяЭлементаДляРазмещения = ДанныеКонтактныхЛиц[ИндексКЛ].ИмяЭлементаДляРазмещения;
		
		ВидКИТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
		ВидКИАдресЭП = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
		ВидКИСкайп   = Справочники.ВидыКонтактнойИнформации.SkypeКонтактногоЛица;
		ВидКИДругое  = Справочники.ВидыКонтактнойИнформации.МессенджерКонтактногоЛица;
	Иначе
		ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
		ВидКИТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		ВидКИАдресЭП = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
		ВидКИСкайп   = Справочники.ВидыКонтактнойИнформации.SkypeКонтрагента;
		ВидКИДругое  = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагента;
		Объект.Наименование = ДополнительныеПараметры.Контакт;
	КонецЕсли;
	
	ДанныеКФ = ДополнительныеПараметры.ДанныеИзКонтактнойФормы;
	Если ДанныеКФ["НомераТелефонов"].Количество()>0 Тогда
		КИТелефон = ДанныеКФ["НомераТелефонов"][0];
		ДанныеКИ = Новый Структура;
		ДанныеКИ.Вставить("Представление", КИТелефон);
		ДанныеКИ.Вставить("Вид", ВидКИТелефон);
		ДанныеКИ.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформациюНаФорму(ЭтотОбъект, Объект, ДанныеКИ);
	КонецЕсли;
	
	Для Каждого КИ Из ДанныеКФ["АдресаЭП"] Цикл
		ДанныеКИ = Новый Структура;
		ДанныеКИ.Вставить("Представление", КИ);
		ДанныеКИ.Вставить("Вид", ВидКИАдресЭП);
		ДанныеКИ.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформациюНаФорму(ЭтотОбъект, Объект, ДанныеКИ);
	КонецЦикла;
	
	Для Каждого КИ Из ДанныеКФ["Скайп"] Цикл
		ДанныеКИ = Новый Структура;
		ДанныеКИ.Вставить("Представление", КИ);
		ДанныеКИ.Вставить("Вид", ВидКИСкайп);
		ДанныеКИ.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформациюНаФорму(ЭтотОбъект, Объект, ДанныеКИ);
	КонецЦикла;
	
	Для Каждого КИ Из ДанныеКФ["Другое"] Цикл
		ДанныеКИ = Новый Структура;
		ДанныеКИ.Вставить("Представление", КИ);
		ДанныеКИ.Вставить("Вид", ВидКИДругое);
		ДанныеКИ.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформациюНаФорму(ЭтотОбъект, Объект, ДанныеКИ);
	КонецЦикла;
	
	ПроверитьКонтрагентаНаДублиСервер();
	
КонецПроцедуры

&НаСервере
Функция СсылкаВариантаОтчета(ИмяОтчета, КлючВарианта)
	
	Отчет = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет." + ИмяОтчета);
	Возврат ВариантыОтчетов.ВариантОтчета(Отчет, КлючВарианта);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьИДоступностьМобильноеПриложениеИРМК()
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		
		Элементы.ГруппаПоказатели.Видимость = Ложь;
		Элементы.ФормаЗаполнитьРеквизитыПоДаннымЕГР.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправочникКонтрагентыДосьеКонтрагента", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроверитьКонтрагента", "Видимость", Ложь);
		Элементы.ЮридическиеДанные.Видимость = Ложь;
		Элементы.Взаиморасчеты.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Ложь;
		Элементы.ДобавитьДополнительныйРеквизит.Видимость = Ложь;
		Элементы.ИсточникПривлеченияПокупателя.Видимость = Ложь;
		Элементы.ВсеКонтакты.Видимость = Ложь;
		Элементы.ПокупательПоставщикПрочие.Видимость = Ложь;
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Объект.ВестиРасчетыПоДоговорам = Ложь;
			Объект.ВестиРасчетыПоДокументам = Ложь;
			Объект.Покупатель = Истина;
			Объект.Поставщик = Истина;
			Объект.ПрочиеОтношения = Истина;
		КонецЕсли;
	// Конец МобильноеПриложение
	
	ИначеЕсли УправлениеДоступомУНФ.ЕстьПрофильРабочееМестоКассира() Тогда
		
		Элементы.ГруппаПоказатели.Видимость = Ложь;
		Элементы.ФормаЗаполнитьРеквизитыПоДаннымЕГР.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправочникКонтрагентыДосьеКонтрагента", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроверитьКонтрагента", "Видимость", Ложь);
		Элементы.Взаиморасчеты.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Ложь;
		Элементы.ДобавитьДополнительныйРеквизит.Видимость = Ложь;
		Элементы.ИсточникПривлеченияПокупателя.Видимость = Ложь;
		Элементы.ВсеКонтакты.Видимость = Ложь;
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Объект.ВестиРасчетыПоДоговорам = Константы.ВестиРасчетыПоДоговорам.Получить();
			Объект.ВестиРасчетыПоДокументам = Константы.ВестиРасчетыПоДокументам.Получить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Элементы.СтатьяДДСПоУмолчанию.Видимость = ПравоДоступа("Чтение",
		Метаданные.Справочники.СтатьиДвиженияДенежныхСредств);
		
	ДоступностьВыбораУчастникаЕАЭС = ВестиУчетПрослеживаемыхТоваров 
	И Не Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ГосударственныйОрган");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчастникЕАЭС", "Видимость", ДоступностьВыбораУчастникаЕАЭС);
	
	ПродажиЗакупкиВключены = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуПродажи") И ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки");
	Если НЕ ПродажиЗакупкиВключены Тогда
		Элементы.ГруппаВзаиморасчеты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВключенаОтчетность()
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьОтчетность");
КонецФункции

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыВзаиморасчетов()
	
	СформироватьЗаголовокГруппыДеньги();
	
	НациональнаяВалюта = Константы.НациональнаяВалюта.Получить();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВалютаРасчетовПоУмолчанию = НациональнаяВалюта;
	КонецЕсли;
	
	Если Объект.СпособЗачетаПредоплатыПоУмолчанию.Пустая() Тогда
		Объект.СпособЗачетаПредоплатыПоУмолчанию = РасчетыРаботаСФормамиВызовСервера.ПолучитьСпособЗачетаПредоплатыПоУмолчанию();
	КонецЕсли;
	Если Объект.СпособРазнесенияОплатыПоУмолчанию.Пустая() Тогда
		Объект.СпособРазнесенияОплатыПоУмолчанию = РасчетыРаботаСФормамиВызовСервера.ПолучитьСпособРазнесенияОплатыПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокГруппыДеньги()
	
	РасчетыРаботаСФормамиВызовСервера.СформироватьЗаголовокГруппыДеньги(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура РазорватьСвязьНаСервере()
	
	ДанныеКонтактногоЛица = ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица];
	
	Если ЗначениеЗаполнено(ДанныеКонтактногоЛица.КонтактноеЛицо) Тогда
		НедействительнаяСвязьСКонтрагентом = НедействительныеСвязиКонтактныеЛица.Добавить();
		НедействительнаяСвязьСКонтрагентом.КонтактноеЛицо = ДанныеКонтактногоЛица.КонтактноеЛицо;
		НедействительнаяСвязьСКонтрагентом.Должность = ДанныеКонтактногоЛица.Должность;
	
		ОсновнойКонтакт = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("Основной", Истина));
		Если ОсновнойКонтакт.Количество() > 0 И ОсновнойКонтакт[0].КонтактноеЛицо = ДанныеКонтактногоЛица.КонтактноеЛицо Тогда
			ОсновнойКонтакт[0].Основной = Ложь;
			Объект.КонтактноеЛицо = Неопределено;
		КонецЕсли; 
		
	КонецЕсли;
	
	ДанныеКонтактногоЛица.Наименование = Неопределено;
	ДанныеКонтактногоЛица.КонтактноеЛицо = Неопределено;
	ДанныеКонтактногоЛица.Ссылка = Неопределено;
	ДанныеКонтактногоЛица.Должность = Неопределено;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ГоловнойКонтрагентПриИзмененииНаСервере()
	
	УстановитьИННОбособленногоПодразделения(Объект);
	
КонецПроцедуры

// Установить ИННОбособленного подразделения.
// 
// Параметры:
//  Объект - СправочникОбъект.Контрагенты
&НаСервереБезКонтекста
Процедура УстановитьИННОбособленногоПодразделения(Объект)
	
	Если ЗначениеЗаполнено(Объект.ГоловнойКонтрагент) Тогда
		
		ИННГоловногоКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ГоловнойКонтрагент, "ИНН");
		Если Объект.ИНН <> ИННГоловногоКонтрагента Тогда
			
			Объект.ИНН = ИННГоловногоКонтрагента;
			
		КонецЕсли;
		
	Иначе
		
		Объект.ИНН = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПунктСозданиеКонтакта(ЭтотОбъект, ДанныеВыбора, Параметры, Текст,СтандартнаяОбработка)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Текст", Текст);
	
	Если Не ЭтотОбъект.ПоддержкаАвтоподбораКонтактов.ЕстьКонтактыСозданныеПоСобытию И Не ПустаяСтрока(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.КонтактныеЛица"), Параметры);
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СозданиеНовогоКонтакта", ЭтотОбъект, ДополнительныеПараметры);
	
	Если ДанныеВыбора = Неопределено Тогда
		ДанныеВыбора = Новый СписокЗначений;
	КонецЕсли;
	
	ПредставлениеПункта = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Добавить <span style=""color:ЗеленыйТекстСтрок;font:ВажнаяНадписьШрифт"">%1</span>'"), Текст);
	
	СтрокаПриЗагрузкеКонтактов = ДанныеВыбора.НайтиПоЗначению(Текст);
	Если СтрокаПриЗагрузкеКонтактов <> Неопределено Тогда
		ДанныеВыбора.Удалить(0);
		ДанныеВыбора.Вставить(0, ОписаниеОповещения, ПредставлениеПункта, , БиблиотекаКартинок.Плюс);
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора.Добавить(ОписаниеОповещения, ПредставлениеПункта, , БиблиотекаКартинок.Плюс);
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНовогоКонтакта(Результат, ДополнительныеПараметры) Экспорт
	
	ЭлементКИ = Элементы.Найти("ПредставлениеКонтакт_"+ИндексВыбранногоКонтактногоЛица+"_КИ_0");
	
	ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].Наименование = ДополнительныеПараметры.Текст;
	ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].Изменен = Истина;
	ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].ФамилияИнициалы = ФамилияИнициалыФИО(
		ДополнительныеПараметры.Текст);
		
	Модифицированность = Истина;
	Элементы.Найти("УстановитьСвязь_" + ИндексВыбранногоКонтактногоЛица).Доступность = Ложь;
	Элементы.Найти("РазорватьСвязь_" + ИндексВыбранногоКонтактногоЛица).Доступность = Истина;
	
	Если ЭлементКИ <> Неопределено Тогда	
		ТекущийЭлемент = ЭлементКИ;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФамилияИнициалыФИО(Знач Наименование)
	
	Возврат Справочники.КонтактныеЛица.ФамилияИнициалыФИО(Наименование);
	
КонецФункции

&НаСервере
Функция КонтрагентЯвляетсяГоловным(КонтрагентСсылка)
	
	Если НЕ ЗначениеЗаполнено(КонтрагентСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ Справочник.Контрагенты КАК СпрКонтрагенты ГДЕ СпрКонтрагенты.ГоловнойКонтрагент = &КонтрагентСсылка";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	ЯвляетсяГоловным = НЕ РезультатЗапроса.Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЯвляетсяГоловным
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеОбъекта()
	НовыйОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(НовыйОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонтактНаОсновнойИПодписанта(ДанныеКонтактногоЛица,Оповещение)
	
	КонтактОсновноеКЛ = (ДанныеКонтактногоЛица.КонтактноеЛицо = Объект.КонтактноеЛицо);
	КонтактПодписант = (ДанныеКонтактногоЛица.КонтактноеЛицо = Объект.КонтактноеЛицоПодписант);
	
	ТекстВопроса = "";
	Если КонтактОсновноеКЛ И КонтактПодписант Тогда
		ТекстВопроса = НСтр("ru = 'Контакт используется как основной и подписант для контрагента
							|При записи основной контакт и подписант контрагента станут незаполненными'");
	ИначеЕсли КонтактОсновноеКЛ Тогда
		ТекстВопроса = НСтр("ru = 'Контакт используется как основной для контрагента
							|При записи основной контакт контрагента станет незаполненным'");
	ИначеЕсли КонтактПодписант Тогда
		ТекстВопроса = НСтр("ru = 'Контакт используется как подписант для контрагента
							|При записи подписант станет незаполненным'");
	КонецЕсли;
	
	Если Модифицированность = Истина Тогда
		ТекстВопроса = НСтр("ru = 'Внимание! Контрагент был изменен и в случае продолжения будет записан!'") + Символы.ПС + ТекстВопроса;
	КонецЕсли;
	
	ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru = 'Продолжить?'");
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросОсновноеКЛВыборКонтрагента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		РазорватьСвязьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНаименованияКонтактногоЛица()
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНаименованиеКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНаименованияКонтрагента()
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект);
	ОбновитьНаименованиеКонтрагента();
	Если НЕ ПроверятьПредставлениеНаДублиКонтакт И ПроверятьПредставлениеНаДубли Тогда
		ПроверитьНаДубли("Наименование");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименованиеКонтрагента()
	
	Если НЕ ФормироватьНаименованиеАвтоматически Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Наименование.СписокВыбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Наименование = Элементы.Наименование.СписокВыбора[0].Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросСозданиеКЛ(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Ок Тогда
		
		ПриИзмененииНаименованияКонтактногоЛица();
		
		Записать();
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		
		Если ДанныеКонтактныхЛиц.Количество() > 0 
			И ЗначениеЗаполнено(ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].КонтактноеЛицо) Тогда
			ПараметрыФормы.Вставить("Ключ",ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].КонтактноеЛицо);
			ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта",ПараметрыФормы);
			Возврат;
		КонецЕсли;
		
		Если ДанныеКонтактныхЛиц.Количество() = 0 Тогда
			НаименованиеКонтактаДляСоздания = "";
		Иначе
			НаименованиеКонтактаДляСоздания = ДанныеКонтактныхЛиц[ИндексВыбранногоКонтактногоЛица].Наименование;
		КонецЕсли;
		
		ПараметрыФормы.Вставить("Контрагент",Объект.Ссылка);
		ПараметрыФормы.Вставить("НаименованиеКонтакта", НаименованиеКонтактаДляСоздания);
		ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта",ПараметрыФормы,ЭтотОбъект);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОКонтрагенте.ОтображатьКакКарточку = Ложь;
	Элементы.Вид.АвтоМаксимальнаяШирина = Истина;
	Элементы.НаименованиеПолное.АвтоМаксимальнаяШирина = Истина;
	Элементы.Наименование.АвтоМаксимальнаяШирина = Истина;
	Элементы.ИНН1.АвтоМаксимальнаяШирина = Истина;
	Элементы.КПП1.АвтоМаксимальнаяШирина = Истина;
	Элементы.РегистрационныйНомер1.АвтоМаксимальнаяШирина = Истина;
	Элементы.Банк.АвтоМаксимальнаяШирина = Истина;
	Элементы.НомерСчета.АвтоМаксимальнаяШирина = Истина;
	
	Элементы.КолонкаСправа.Ширина = 0;
	Элементы.КолонкаСправа.РастягиватьПоГоризонтали = Неопределено;
	Элементы.СтатьяДДСПоУмолчанию.АвтоМаксимальнаяШирина = Истина;
	Элементы.ГруппаДоступа.АвтоМаксимальнаяШирина = Истина;
	Элементы.Ответственный.АвтоМаксимальнаяШирина = Истина;
	Элементы.ИсточникПривлеченияПокупателя.АвтоМаксимальнаяШирина = Истина;
	Элементы.СписокТегов.АвтоМаксимальнаяШирина = Истина;
	Элементы.Родитель.АвтоМаксимальнаяШирина = Истина;
	
	Элементы.ЮридическиеДанные.Ширина = 0;
	Элементы.ЮридическиеДанные.РастягиватьПоГоризонтали = Неопределено;
	Элементы.ПредставлениеПроверкиОГРН1.Ширина = 0;
	Элементы.ПредставлениеПроверкиКПП1.Ширина = 0;
	Элементы.ПредставлениеПроверкиДублейИНН1.Ширина = 0;
	Элементы.ПредставлениеПроверкиИНН1.Ширина = 0;
	Элементы.ПредставлениеПроверкиКПП.Ширина = 0;
	Элементы.ПредставлениеПроверкиИНН.Ширина = 0;
	Элементы.ПредставлениеПроверкиОГРН.Ширина = 0;
	Элементы.ПредставлениеПроверкиОКПО.Ширина = 0;
	
	Элементы.ГруппаВзаиморасчетыКарточка.ОтображатьКакКарточку = Ложь;
	Элементы.ГруппаУсловияЗаполненияДокументовОплатыКарточка.ОтображатьКакКарточку = Ложь;
	
	Элементы.ПанельДополнительнойИнформации.Ширина = 0;
	Элементы.Комментарий.Высота = 4;
	
	Элементы.ГруппаПоказателиИСПАРКРиски.ОтображатьКакКарточку = Истина;
	Элементы.ОстатокВзаиморасчетов.РастягиватьПоГоризонтали = Неопределено;
	Элементы.СуммаПродаж.РастягиватьПоГоризонтали = Неопределено;
	Элементы.ПоследняяПродажа.РастягиватьПоГоризонтали = Неопределено;
	Элементы.ПоследнееСобытие.РастягиватьПоГоризонтали = Неопределено;
	Элементы.ОстатокВзаиморасчетовНадпись.АвтоМаксимальнаяШирина = Ложь;
	Элементы.ОстатокВзаиморасчетовНадпись.МаксимальнаяШирина = 30;
	Элементы.СуммаПродажНадпись.АвтоМаксимальнаяШирина = Ложь;
	Элементы.СуммаПродажНадпись.МаксимальнаяШирина = 30;
	Элементы.ПоследняяПродажаНадпись.АвтоМаксимальнаяШирина = Ложь;
	Элементы.ПоследняяПродажаНадпись.МаксимальнаяШирина = 30;
	Элементы.ПоследнееСобытиеНадпись.АвтоМаксимальнаяШирина = Ложь;
	Элементы.ПоследнееСобытиеНадпись.МаксимальнаяШирина = 30;
	
	Элементы.ГруппаИндексыСПАРКРиски.ОтображатьКакКарточку = Ложь;
	Элементы.ГруппаИндексыСПАРКРиски.Ширина = 0;
	Элементы.ГруппаИндексыСПАРКРиски.РастягиватьПоГоризонтали = Неопределено;
	Элементы.ДекорацияИндексыСПАРКРиски1.Ширина = 0;
	Элементы.ДекорацияИндексыСПАРКРиски1.АвтоМаксимальнаяШирина = Истина;
	Элементы.ДекорацияИндексыСПАРКРиски1.РастягиватьПоГоризонтали = Неопределено;
	Элементы.СвояПодсказка1СПАРКРиски1.Ширина = 0;
	Элементы.СвояПодсказка1СПАРКРиски1.АвтоМаксимальнаяШирина = Истина;
	Элементы.СвояПодсказка1СПАРКРиски1.РастягиватьПоГоризонтали = Неопределено; 
	
	Элементы.ДекорацияФакторыРиска1.Ширина = 0;
	Элементы.ДекорацияФакторыРиска1.АвтоМаксимальнаяШирина = Истина;
	Элементы.ДекорацияФакторыРиска1.РастягиватьПоГоризонтали = Неопределено;
	Элементы.СвояПодсказкаФакторовРиска1.Ширина = 0;
	Элементы.СвояПодсказкаФакторовРиска1.АвтоМаксимальнаяШирина = Истина;
	Элементы.СвояПодсказкаФакторовРиска1.РастягиватьПоГоризонтали = Неопределено;
	
	Элементы.Переместить(Элементы.ГруппаПоказателиИСПАРКРиски, Элементы.ОКонтрагенте, Элементы.ГруппаБанкНомер);
	
	Элементы.Переместить(Элементы.НаименованиеПолноеКонтекстноеМенюИсторияНаименований, Элементы.НаименованиеПолное.КонтекстноеМеню);
	Элементы.Переместить(Элементы.КППКонтекстноеМенюИсторияКПП1, Элементы.КПП1.КонтекстноеМеню);
	Элементы.Переместить(Элементы.КППКонтекстноеМенюИсторияКПП, Элементы.КПП.КонтекстноеМеню);
	
	Если ЭтоИнтерфейсТакси Тогда
		Элементы.ГруппаНаименованиеИНедействителен.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокГруппыВидКонтрагентаМК(Форма)
	ОбъектФормы = Форма.Объект;
	СтрокаЗаголовок = Новый Массив;
	Если ОбъектФормы.Покупатель Тогда
		СтрокаЗаголовок.Добавить(НСтр("ru = 'покупатель'"));
	КонецЕсли;
	
	Если ОбъектФормы.Поставщик Тогда
		СтрокаЗаголовок.Добавить(НСтр("ru = 'покупатель'"));
	КонецЕсли;
	
	Если ОбъектФормы.ПрочиеОтношения Тогда
		СтрокаЗаголовок.Добавить(НСтр("ru = 'прочие'"));
	КонецЕсли;
		
	Если НЕ ОбъектФормы.ПрочиеОтношения
		И НЕ ОбъектФормы.Поставщик
		И НЕ ОбъектФормы.Покупатель Тогда
		СтрокаЗаголовок.Добавить(НСтр("ru = '<Не указан>'"));
	КонецЕсли;
	
	Заголовок = СтрШаблон(НСтр("ru='Вид: %1'"), СтрСоединить(СтрокаЗаголовок, ", "));
	Возврат Заголовок;
	
КонецФункции

&НаКлиенте
Процедура СохранитьВосстановитьВведенноеЗначениеКПП()
	
	Если Элементы.КПП.Видимость Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.КПП) Тогда
			Объект.КПП = ВведенныйКППКэш;
		КонецЕсли;
		
		ВведенныйКППКэш = Неопределено;
		
	Иначе
		
		Если ЗначениеЗаполнено(Объект.КПП) Тогда
			ВведенныйКППКэш = Объект.КПП;
		КонецЕсли;
		
		Объект.КПП = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДублиКонтактнойИнформацииНаСервере()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("СтрокаХеш");
	ТаблицаЗначений.Колонки.Добавить("Количество");
	ТаблицаЗначений.Колонки.Добавить("Строка");
	
	Для Каждого Стр Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
		
		Структура = Новый Структура;
		Структура.Вставить("Тип", Стр.Тип);
		Структура.Вставить("Вид", Стр.Вид);
		Структура.Вставить("ДействуетС", Стр.ДействуетС);
		Структура.Вставить("Значение", Стр.Значение);
		Структура.Вставить("Комментарий", Стр.Комментарий);
		Структура.Вставить("Представление", Стр.Представление);
		Структура.Вставить("ХранитьИсториюИзменений", Стр.ХранитьИсториюИзменений);
		Структура.Вставить("ЭтоИсторическаяКонтактнаяИнформация", Стр.ЭтоИсторическаяКонтактнаяИнформация);
		
		СтрокаХеш = ИнтеграцияСМагазинамиСоцСетейСервер.ПолучитьХешСтроки(ЗначениеВСтрокуВнутр(Структура));
		
		НовСтр = ТаблицаЗначений.Добавить();
		НовСтр.СтрокаХеш = СтрокаХеш;
		НовСтр.Количество = 1;
		НовСтр.Строка = Стр;
		
	КонецЦикла;
	
	ТаблицаЗначенийДоп = ТаблицаЗначений.Скопировать(,"СтрокаХеш,Количество");
	ТаблицаЗначенийДоп.Свернуть("СтрокаХеш", "Количество");
	
	ЕстьИзменения = Ложь;
	Для Каждого Стр Из ТаблицаЗначенийДоп Цикл
		
		Если Стр.Количество <= 1 Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрок = ТаблицаЗначений.НайтиСтроки(Новый Структура("СтрокаХеш", Стр.СтрокаХеш));
		
		Если МассивСтрок.Количество() < 2 Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьИзменения = Истина;
		
		МассивСтрок.Удалить(0);
		
		Для Каждого СтрМассива Из МассивСтрок Цикл
			
			ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Удалить(СтрМассива.Строка);
			
			Если ЗначениеЗаполнено(СтрМассива.Строка.ИмяРеквизита) Тогда
				
				ГруппаКИ = Элементы.Найти(СтрШаблон("Группа%1", СтрМассива.Строка.ИмяРеквизита));
				Если ГруппаКИ <> Неопределено Тогда
					Элементы.Удалить(ГруппаКИ);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьРеквизитовВалюты()
	
	Если ВозможностиПриложения.ЭтоРозница()
		ИЛИ ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
		Элементы.ВалютаДляВключенияОпции.Видимость = Ложь;
	Иначе
		Элементы.ВалютаДляВключенияОпции.Видимость = Истина;
		ВалютаДляВключенияОпции = Константы.НациональнаяВалюта.Получить();
		Элементы.ВалютаДляВключенияОпции.СписокВыбора.Добавить(Строка(ВалютаДляВключенияОпции));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВидаКонтрагента()

	Если Вид = "ФизическоеЛицо" Тогда
		Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
		Объект.Самозанятый                = Ложь;
	ИначеЕсли Вид = "ИндивидуальныйПредприниматель" Тогда
		Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
		Объект.Самозанятый                = Ложь;
	ИначеЕсли Вид = "Самозанятый" Тогда
		Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
		Объект.Самозанятый                = Истина;
	ИначеЕсли Вид = "ГосударственныйОрган" Тогда
		Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган;
		Объект.Самозанятый                = Ложь;
	Иначе
		Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
		Объект.Самозанятый                = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеСсылкиНаЛидов()
	
	Если Не РаботаСЛидами.ЛидыДоступны() Тогда
		Элементы.ГруппаЛиды.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ПредставлениеЛидов = Справочники.Контрагенты.ПредставлениеЛидовКонтрагента(Объект.Ссылка);
	Если ЗначениеЗаполнено(ПредставлениеЛидов) Тогда
		ДекорацияЛиды = СтроковыеФункции.ФорматированнаяСтрока(НСтр("ru = '<a href=""https://1c.ru"">%1</a>'"), ПредставлениеЛидов);
	Иначе
		Элементы.ГруппаЛиды.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.НаименованиеПолное.ВысотаЗаголовка = 2;
	Элементы.Наименование.ВысотаЗаголовка = 2;
	
	Элементы.ГруппаЮрДанныеНаГлавной.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.ГруппаЮрДанныеНаГлавнойСПроверками.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	Элементы.РегистрационныйНомер1.МаксимальнаяШирина = 21;
	Элементы.КПП1.РастягиватьПоГоризонтали = Истина;
	
	Элементы.ПредставлениеПроверкиИНН1.Ширина = 0;
	Элементы.ПредставлениеПроверкиДублейИНН1.Ширина = 0;
	Элементы.ПредставлениеПроверкиКПП1.Ширина = 0;
	Элементы.ПредставлениеПроверкиОГРН1.Ширина = 0;
	
	Элементы.ГруппаБанкНомер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.ГруппаБанкНомер.Объединенная = Ложь;
	Элементы.НомерСчета.АвтоМаксимальнаяШирина = Истина;
	Элементы.Банк.АвтоМаксимальнаяШирина = Истина;
	
	Элементы.ГруппаПоказатели.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Полуторный;
	Элементы.ПоследнееСобытиеКартинка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	Элементы.ПоследняяПродажаКартинка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	Элементы.СуммаПродажКартинка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	Элементы.ОстатокВзаиморасчетовКартинка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	Элементы.НазваниеГруппыУпрощеннойПодсказки1СПАРКРиски.Шрифт = Новый Шрифт(, , Истина);
	
	Элементы.ЮридическиеДанные.Ширина = 50;
	Элементы.ГруппаИННиКППСПроверками.Объединенная = Ложь;
	Элементы.ГруппаСвидетельствоИДатаВыдачи.Объединенная = Ложь;
	Элементы.ДатаРожденияПол.Объединенная = Ложь;
	Элементы.РегистрационныйНомер.АвтоМаксимальнаяШирина = Ложь;
	Элементы.КодПоОКПО.АвтоМаксимальнаяШирина = Ложь;
	Элементы.КПП.АвтоМаксимальнаяШирина = Ложь;
	Элементы.ИНН.АвтоМаксимальнаяШирина = Ложь;
	Элементы.РегистрационныйНомер.МаксимальнаяШирина = 21;
	Элементы.КодПоОКПО.МаксимальнаяШирина = 21;
	Элементы.КПП.МаксимальнаяШирина = 21;
	Элементы.ИНН.МаксимальнаяШирина = 21;
	Элементы.КПП.РастягиватьПоГоризонтали = Истина;
	Элементы.КодПоОКПО.РастягиватьПоГоризонтали = Истина;
	
	Элементы.ПредставлениеПроверкиКПП.Ширина = 0;
	Элементы.ПредставлениеПроверкиИНН.Ширина = 0;
	Элементы.ПредставлениеПроверкиОГРН.Ширина = 0;
	Элементы.ПредставлениеПроверкиОКПО.Ширина = 0;
	
	Элементы.ГруппаИННиКПП.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.ГруппаОКПОиОГРН.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.ГруппаГоловной.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.ГруппаСвидетельствоИДатаВыдачи.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.ДатаРожденияПол.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Элементы["ДанныеПанелиКонтактнойИнформации_1"].ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.ИспользоватьАвтоматически;
	
	Элементы.КолонкиФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Элементы.КолонкаСлева.Ширина = 57;
	Элементы.КолонкаСправа.Ширина = 40;
	
	Элементы.ПанельДополнительнойИнформации.Ширина = 30;
	Элементы.ПанельДополнительнойИнформации.РастягиватьПоГоризонтали = Ложь;
	
КонецПроцедуры

#Область КонтактныеЛица

&НаСервере
Процедура ЗаполнитьИОбновитьКонтактныеЛица()
	
	ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц()
	
	// TODO: 00-00018720
	//Возврат;
	// TODO: 00-00018720
	
	Если ЗначениеЗаполнено(КлассификаторДляЗаполненияКИ) Тогда
		ЗаполнитьНаименованиеИКонтактнуюИнформацию(КлассификаторДляЗаполненияКИ);
		Возврат;
	КонецЕсли;
	
	ДанныеКонтактныхЛиц.Очистить();
	
	Если ЗначениеЗаполнено(ПривязанныйКонтакт) Тогда
		
		ДанныеКЛ = ДанныеКонтактныхЛиц.Добавить();
		ДанныеКЛ.Изменен = Истина;
		ДанныеПривязанногоКонтакта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПривязанныйКонтакт,
			"Наименование, ФамилияИнициалы");
		
		КонтактноеЛицо = Новый Структура;
		КонтактноеЛицо.Вставить("КонтактноеЛицо",  ПривязанныйКонтакт);
		КонтактноеЛицо.Вставить("Ссылка",          ПривязанныйКонтакт);       				
		КонтактноеЛицо.Вставить("Наименование",    ДанныеПривязанногоКонтакта.Наименование);
		КонтактноеЛицо.Вставить("ФамилияИнициалы", ДанныеПривязанногоКонтакта.ФамилияИнициалы);
		КонтактноеЛицо.Вставить("Должность",       "");
		
		ЗаполнитьЗначенияСвойств(ДанныеКЛ, КонтактноеЛицо,
			"КонтактноеЛицо,Наименование,Должность,Ссылка,ФамилияИнициалы"); 
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязиКонтрагентКонтактСрезПервых.Контакт КАК Контакт,
	|	СвязиКонтрагентКонтактСрезПервых.Порядок КАК Порядок
	|ПОМЕСТИТЬ втПорядокКонтактовКонтрагента
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПервых(, Контрагент = &Владелец) КАК СвязиКонтрагентКонтактСрезПервых
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛица.Ссылка КАК КонтактноеЛицо,
	|	СвязиКонтрагентКонтакт.Контрагент КАК Владелец,
	|	СвязиКонтрагентКонтакт.Должность КАК Должность,
	|	КонтактныеЛица.Наименование КАК Наименование,
	|	КонтактныеЛица.ФамилияИнициалы КАК ФамилияИнициалы,
	|	втПорядокКонтактовКонтрагента.Порядок КАК РеквизитДопУпорядочивания
	|ПОМЕСТИТЬ втКонтакты
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(, Контрагент = &Владелец) КАК СвязиКонтрагентКонтакт
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокКонтактовКонтрагента КАК втПорядокКонтактовКонтрагента
	|		ПО (втПорядокКонтактовКонтрагента.Контакт = СвязиКонтрагентКонтакт.Контакт)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛица
	|		ПО СвязиКонтрагентКонтакт.Контакт = КонтактныеЛица.Ссылка
	|ГДЕ
	|	КонтактныеЛица.Недействителен = ЛОЖЬ
	|	И СвязиКонтрагентКонтакт.СвязьНедействительна = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКонтакты.КонтактноеЛицо КАК КонтактноеЛицо,
	|	втКонтакты.Наименование КАК Наименование,
	|	втКонтакты.ФамилияИнициалы КАК ФамилияИнициалы,
	|	втКонтакты.Должность КАК Должность,
	|	втКонтакты.РеквизитДопУпорядочивания КАК Порядок
	|ИЗ
	|	втКонтакты КАК втКонтакты
	|
	|УПОРЯДОЧИТЬ ПО
	|	втКонтакты.РеквизитДопУпорядочивания,
	|	Наименование";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("ОсновноеКонтактноеЛицо", Объект.КонтактноеЛицо);
	
	ВыборкаКонтакты = Запрос.Выполнить().Выбрать();
	Отбор = Новый Структура("КонтактноеЛицо");
	
	Пока ВыборкаКонтакты.Следующий() Цикл
		
		Отбор.КонтактноеЛицо = ВыборкаКонтакты.КонтактноеЛицо;
		НедействительнаяСвязь = НедействительныеСвязиКонтактныеЛица.НайтиСтроки(Отбор);
		
		Если НедействительнаяСвязь.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеКЛ = ДанныеКонтактныхЛиц.Добавить();
		
		ЗаполнитьЗначенияСвойств(ДанныеКЛ, ВыборкаКонтакты,
			"КонтактноеЛицо,Наименование,Должность,ФамилияИнициалы,Порядок");
			
		Если ЗначениеЗаполнено(ПривязанныйКонтакт) Тогда
			ДанныеКЛ.Порядок = ДанныеКЛ.Порядок + 1;
		КонецЕсли;
		
		ДанныеКЛ.Ссылка = ДанныеКЛ.КонтактноеЛицо;
		ДанныеКЛ.Основной = Объект.КонтактноеЛицо = ВыборкаКонтакты.КонтактноеЛицо;
		ДанныеКЛ.Подписант = Объект.КонтактноеЛицоПодписант = ВыборкаКонтакты.КонтактноеЛицо;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементТаблицыКонтактныхЛиц(Индекс, Контакт, ОтправлятьСообщение = Ложь)
	
	СтрокиДубли = ДанныеКонтактныхЛиц.НайтиСтроки(Новый Структура("КонтактноеЛицо", Контакт));
	Если СтрокиДубли.Количество() > 0 Тогда
		Если ОтправлятьСообщение = Истина Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр(
				"ru = 'Выбран дубль контакта! Дублирование контактов в карточке контрагента не допускается'"), , );
		Иначе
			ВыбранДубльКонтакта = Истина;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;

	Если ТипЗнч(Контакт) = Тип("Массив") Тогда
		Контакт = Контакт[0];	
	КонецЕсли;             
	
	РегистрыСведений.СвязиКонтрагентКонтакт.НоваяСвязь(Объект.Ссылка, Контакт);
	
	ЗаполнитьИОбновитьКонтактныеЛица();
	СоздатьОбновитьКарточкиКИ();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеКонтактныхЛиц(Отказ)
	
	// Проверка на заполненность ФИО контактного лица, если введена контактная информация
	Для Каждого ДанныеКонтактногоЛица Из ДанныеКонтактныхЛиц Цикл
		
		Если Не ПустаяСтрока(ДанныеКонтактногоЛица.Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = "ДанныеКонтактныхЛиц[" + ДанныеКонтактныхЛиц.Индекс(ДанныеКонтактногоЛица) + "].Наименование";
		Для Каждого СтрокаТаблицы Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(
				Новый Структура("ИмяЭлементаДляРазмещения",ДанныеКонтактногоЛица.ИмяЭлементаДляРазмещения)) Цикл   
			Если СтрНайти(СтрокаТаблицы.ИмяРеквизита, "КонтактнаяИнформацияКонтакт_") = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если Не ПустаяСтрока(СтрокаТаблицы.Значение) Или Не ПустаяСтрока(СтрокаТаблицы.Представление) Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'ФИО контакта не заполнено.'"),,,ИмяРеквизита, Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеКонтактныхЛиц(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого ДанныеКЛ Из ДанныеКонтактныхЛиц Цикл
		
		Если ПустаяСтрока(ДанныеКЛ.Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ДанныеКЛ.Изменен Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если ЗначениеЗаполнено(ДанныеКЛ.КонтактноеЛицо) Тогда
			КонтактноеЛицоОбъект = ДанныеКЛ.КонтактноеЛицо.ПолучитьОбъект();
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеКЛ.КонтактноеЛицо) Или КонтактноеЛицоОбъект = Неопределено Тогда
			
			// Создание
			КонтактноеЛицоОбъект = Справочники.КонтактныеЛица.СоздатьЭлемент();
			КонтактноеЛицоОбъект.Заполнить(ТекущийОбъект.Ссылка);
			КонтактноеЛицоОбъект.ГруппаДоступа = Объект.ГруппаДоступа;
			
			// Установим ссылку нового по переданной ссылке основного контактного лица
			Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовоеОсновноеКонтактноеЛицо") Тогда
				КонтактноеЛицоОбъект.УстановитьСсылкуНового(
					ТекущийОбъект.ДополнительныеСвойства.НовоеОсновноеКонтактноеЛицо);
				ТекущийОбъект.ДополнительныеСвойства.Удалить("НовоеОсновноеКонтактноеЛицо");
			КонецЕсли;
			
			Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовоеКонтактноеЛицоПодписант") Тогда
				КонтактноеЛицоОбъект.УстановитьСсылкуНового(
					ТекущийОбъект.ДополнительныеСвойства.НовоеКонтактноеЛицоПодписант);
				ТекущийОбъект.ДополнительныеСвойства.Удалить("НовоеКонтактноеЛицоПодписант");
			КонецЕсли;
			
		КонецЕсли;
		
		// Внесение изменений
		ЗаполнитьЗначенияСвойств(КонтактноеЛицоОбъект, ДанныеКЛ, "Наименование, ФамилияИнициалы");
		
		Если ЗаполнениеИзСвязанногоОбъекта = Истина Тогда    
			МассивКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.НайтиСтроки(Новый Структура("ЭтоСсылка,ТипОтображаемыхДанных", Ложь, "ЗначениеКИ"));
			Если МассивКИ.Количество() = 1 Тогда
				СтрокаИсточник = МассивКИ[0];
				ТипКИ = СтрокаИсточник.ТипКИ; 
				ВидКИ = Неопределено;
				Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
				ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВидКИ) Тогда
					УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(КонтактноеЛицоОбъект, СтрокаИсточник.ПредставлениеКИ,
					ВидКИ); 
				КонецЕсли;
			КонецЕсли;
            ЗаполнениеИзСвязанногоОбъекта = Ложь;
		КонецЕсли;

		Если ЗначениеЗаполнено(Объект.ГруппаДоступа)
			И НЕ ЗначениеЗаполнено(КонтактноеЛицоОбъект.ГруппаДоступа) Тогда
			КонтактноеЛицоОбъект.ГруппаДоступа = Объект.ГруппаДоступа;
		КонецЕсли;
		
		// Запись объекта
		КонтактноеЛицоОбъект.ДополнительныеСвойства.Вставить("СвязьСКонтрагентом", 
			Новый Структура("Контрагент,Должность,Порядок", ТекущийОбъект.Ссылка, ДанныеКЛ.Должность, ДанныеКЛ.Порядок));
		КонтактноеЛицоОбъект.Записать();
				
		// Сохранение ссылки на созданный объект
		ДанныеКЛ.КонтактноеЛицо = КонтактноеЛицоОбъект.Ссылка;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЦикла;
	
	КонтактныеЛица = Новый Массив;
	Для Каждого ДанныеКЛ Из НедействительныеСвязиКонтактныеЛица Цикл
		КонтактныеЛица.Добавить(ДанныеКЛ.КонтактноеЛицо);
	КонецЦикла;
	
	Если КонтактныеЛица.Количество() <> 0 Тогда
		РегистрыСведений.СвязиКонтрагентКонтакт.УстановитьНедействительной(ТекущийОбъект.Ссылка, КонтактныеЛица);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкиКонтрагента

&НаКлиентеНаСервереБезКонтекста
Процедура ВыполнитьВсеПроверки(Форма)
	
	СформироватьПредставлениеПроверкиИНН(Форма);
	СформироватьПредставлениеПроверкиКПП(Форма);
	СформироватьПредставлениеПроверкиОКПО(Форма);
	СформироватьПредставлениеПроверкиОГРН(Форма);
	СформироватьПредставлениеПроверкиДублей(Форма);
	
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПроверкиИНН(Форма)
	
	Объект = Форма.Объект;
	ОписаниеОшибки = "";
	Если ПустаяСтрока(Объект.ИНН) Тогда
		Объект.ИННВведенКорректно = Истина;
	Иначе
		Объект.ИННВведенКорректно = РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(Объект.ИНН, ЭтоЮрЛицо(Объект.ВидКонтрагента), ОписаниеОшибки);
	КонецЕсли;
	Форма.ПредставлениеПроверкиИНН = Новый ФорматированнаяСтрока(ОписаниеОшибки);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПроверкиКПП(Форма)
	
	Объект = Форма.Объект;
	ОписаниеОшибки = "";
	Если ПустаяСтрока(Объект.КПП) Тогда
		Объект.КППВведенКорректно = Истина;
	Иначе
		Объект.КППВведенКорректно = РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(Объект.КПП, ОписаниеОшибки);
	КонецЕсли;
	Форма.ПредставлениеПроверкиКПП = Новый ФорматированнаяСтрока(ОписаниеОшибки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПроверкиОКПО(Форма)
	
	Объект = Форма.Объект;
	ОписаниеОшибки = "";
	Если Не ПустаяСтрока(Объект.КодПоОКПО) Тогда
		РегламентированныеДанныеКлиентСервер.КодПоОКПОСоответствуетТребованиям(Объект.КодПоОКПО, ЭтоЮрЛицо(Объект.ВидКонтрагента), ОписаниеОшибки);
	КонецЕсли;
	Форма.ПредставлениеПроверкиОКПО = Новый ФорматированнаяСтрока(ОписаниеОшибки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПроверкиОГРН(Форма)
	
	Объект = Форма.Объект;
	ОписаниеОшибки = "";
	
	// Проверка ОГРН имеет смысл только для юридического лица зарегистрированного в России или для индивидуального предпринимателя
	Если Не ПустаяСтрока(Объект.РегистрационныйНомер)
		И ((ЭтоЮрЛицо(Объект.ВидКонтрагента) И Объект.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия"))
		Или (Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель"))) Тогда
		
		РегламентированныеДанныеКлиентСервер.ОГРНСоответствуетТребованиям(Объект.РегистрационныйНомер, ЭтоЮрЛицо(Объект.ВидКонтрагента), ОписаниеОшибки);
	КонецЕсли;
	
	Форма.ПредставлениеПроверкиОГРН = Новый ФорматированнаяСтрока(ОписаниеОшибки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПроверкиДублей(Форма)
	
	Объект = Форма.Объект;
	ОписаниеОшибки = "";
	
	Если ИННиКППКорректны(Форма) И Не ПустаяСтрока(Объект.ИНН) Тогда
		
		
		МассивДублей = ПолучитьДублиКонтрагентаСервер(СокрЛП(Объект.ИНН), СокрЛП(Объект.КПП), Объект.Ссылка);
		
		КоличествоДублей = МассивДублей.Количество();
		
		Если КоличествоДублей > 0 Тогда
			
			СтруктураПараметровСообщенияОДублях = Новый Структура;
			СтруктураПараметровСообщенияОДублях.Вставить("ИННиКПП", ?(ЭтоЮрЛицо(Объект.ВидКонтрагента), НСтр("ru = 'ИНН и КПП'"), НСтр("ru = 'ИНН'")));
			
			Если КоличествоДублей = 1 Тогда
				СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей", НСтр("ru = 'один'"));
				СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКонтрагентов", НСтр("ru = 'контрагент'"));
			ИначеЕсли КоличествоДублей < 5 Тогда
				СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей", КоличествоДублей);
				СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКонтрагентов", НСтр("ru = 'контрагента'"));
			Иначе
				СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей", КоличествоДублей);
				СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКонтрагентов", НСтр("ru = 'контрагентов'"));
			КонецЕсли;
			
			ОписаниеОшибки = НСтр("ru = 'С таким [ИННиКПП] есть [КоличествоДублей] [СклонениеКонтрагентов]'");
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ОписаниеОшибки, СтруктураПараметровСообщенияОДублях);
			
		КонецЕсли;
	КонецЕсли;
	
	Форма.ПредставлениеПроверкиДублей = Новый ФорматированнаяСтрока(ОписаниеОшибки, , , , "ПоказатьДубли");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДублиКонтрагентаСервер(ИНН, КПП, ИсключаяСсылку)
	
	Возврат Справочники.Контрагенты.ПроверитьДублиСправочникаКонтрагентыПоИННКПП(ИНН, КПП, ИсключаяСсылку);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИННиКППКорректны(Форма)
	
	Объект = Форма.Объект;
	ЭтоЮрЛицо = ЭтоЮрЛицо(Объект.ВидКонтрагента);
	
	Если ЭтоЮрЛицо Тогда
		Результат = Объект.ИННВведенКорректно И (Объект.КППВведенКорректно Или ПустаяСтрока(Объект.КПП));
	Иначе
		Результат = Объект.ИННВведенКорректно;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоЮрЛицо(ВидКонтрагента)
	
	Возврат ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо")
		Или ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ГосударственныйОрган");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРеквизитыПроверкиКонтрагентов(Форма)
	
	Объект = Форма.Объект;
	
	Форма.РеквизитыПроверкиКонтрагентов.ЭтоИностранныйКонтрагент =
		(Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо")
		И Объект.СтранаРегистрации <> ПредопределенноеЗначение("Справочник.СтраныМира.Россия"));
	
	Форма.РеквизитыПроверкиКонтрагентов.ЭтоЮридическоеЛицо 		 =
		(Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо")
		Или Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ГосударственныйОрган"));
	
	Форма.РеквизитыПроверкиКонтрагентов.ОтключитьПроверкуФНС 	 = Форма.РеквизитыПроверкиКонтрагентов.ЭтоИностранныйКонтрагент;
		
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеЕГР

&НаКлиенте
Процедура ВыполнитьЗаполнениеРеквизитовПоИНН(знач ИНН)
	
	ОписаниеОшибкиЗаполнения = "";
	ЗаполнитьРеквизитыПоИНННаСервере(ИНН);
	УправлениеФормой();
	
	Если Не ПустаяСтрока(ОписаниеОшибкиЗаполнения) Тогда
		ОбработчикЗавершенияОбработкиОшибки = Новый ОписаниеОповещения(
		"ОбработатьОшибкуЗаполнитьРеквизитыПоИННЗавершение",
		ЭтотОбъект,
		ИНН);
		РаботаСКонтрагентамиКлиент.ОбработатьОшибку(ОписаниеОшибкиЗаполнения, ОбработчикЗавершенияОбработкиОшибки);
	Иначе
		Если ИспользоватьСпаркРиски Тогда
			// ИнтернетПоддержкаПользователей.СПАРКРиски
			ИндексыСПАРКРиски = Неопределено; 
			ФакторыРискаСПАРК = Неопределено;
			ОбновитьОтображениеИндексыСПАРК(); 
			ОбновитьОтображениеФакторовРискаСПАРК();
			// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
		КонецЕсли;
		
		// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
		УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
		ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
		// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоИНННаСервере(ИНН)
	
	Если СтрДлина(ИНН) = 12 Тогда
		ЭтоЮрЛицо = Ложь;
	Иначе
		ЭтоЮрЛицо = Истина;
	КонецЕсли;
	
	ЭтоГосударственныйОрган = Ложь;
	КодОКВЭД = "";
	
	Если ЭтоЮрЛицо Тогда
		РеквизитыКонтрагента = РаботаСКонтрагентами.СведенияОЮридическомЛицеПоИНН(ИНН);
		
		Если ЗначениеЗаполнено(РеквизитыКонтрагента.ОписаниеОшибки) Тогда
			ОписаниеОшибкиЗаполнения = РеквизитыКонтрагента.ОписаниеОшибки;
			Возврат;
		КонецЕсли;
		
		Если РеквизитыКонтрагента.ЕГРЮЛ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Объект.Наименование         = РеквизитыКонтрагента.ЕГРЮЛ.Наименование;
		Объект.НаименованиеПолное   = РеквизитыКонтрагента.ЕГРЮЛ.НаименованиеСокращенное;
		Объект.ИНН                  = РеквизитыКонтрагента.ИНН;
		Объект.КПП                  = РеквизитыКонтрагента.ЕГРЮЛ.КПП;
		Объект.РегистрационныйНомер = РеквизитыКонтрагента.ЕГРЮЛ.РегистрационныйНомер;
		РеквизитыКонтрагента.ЕГРЮЛ.Свойство("КодОКВЭД", КодОКВЭД);
		
		ЗаполнитьКонтактнуюИнформациюКонтрагентаПоДаннымЕГРЮЛ(РеквизитыКонтрагента);
		
		ДобавляемСтрокуКонтакта = Ложь;
		Если ДанныеКонтактныхЛиц.Количество() = 0 Тогда
			ОсновнойКонтакт = ДанныеКонтактныхЛиц.Добавить(); 
			ДобавляемСтрокуКонтакта = Истина;
		Иначе
			ОсновнойКонтакт = ДанныеКонтактныхЛиц[0];
		КонецЕсли;

		Руководители = РеквизитыКонтрагента.ЕГРЮЛ.ДанныеРуководителей.Руководители;
		
		Если Руководители.Количество() <> 0 И ПустаяСтрока(ОсновнойКонтакт.Наименование) Тогда
			ДанныеРуководителяПоИНН = Руководители[0];
			ФИОРуководителя = Новый Массив;
			Если ЗначениеЗаполнено(ДанныеРуководителяПоИНН.Фамилия) Тогда
				ФИОРуководителя.Добавить(ДанныеРуководителяПоИНН.Фамилия);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеРуководителяПоИНН.Имя) Тогда
				ФИОРуководителя.Добавить(ДанныеРуководителяПоИНН.Имя);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеРуководителяПоИНН.Отчество) Тогда
				ФИОРуководителя.Добавить(ДанныеРуководителяПоИНН.Отчество);
			КонецЕсли;
			ОсновнойКонтакт.Наименование = СтрСоединить(ФИОРуководителя, " ");
			ОсновнойКонтакт.Должность = ДанныеРуководителяПоИНН.Должность;
			ОсновнойКонтакт.Изменен = Истина;
			ОсновнойКонтакт.ГруппаРазвернута = Истина; 
			
			Если ДобавляемСтрокуКонтакта = Истина Тогда          
				ОсновнаяТаблицаСоздана = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "ДанныеПанелиКонтактнойИнформации");
				Если ОсновнаяТаблицаСоздана = Ложь Тогда
					КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформацияТаблица_0"); 
					Элементы["КонтактнаяИнформацияТаблица_0"].РастягиватьПоВертикали = Истина;
				КонецЕсли;
				ЗаполнениеИзСвязанногоОбъекта = Истина;
				
				СтрокиНетДанных = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.НайтиСтроки(Новый Структура("ТипОтображаемыхДанных","НетДанных"));
				Если СтрокиНетДанных.Количество() > 0 Тогда
					ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Удалить(СтрокиНетДанных[0]);	
				КонецЕсли; 
    			НоваяСтрока = Новый Структура;
				НоваяСтрока.Вставить("Отображение", Строка(ОсновнойКонтакт.Наименование));
				НоваяСтрока.Вставить("ИндексПиктограммы", -1);
				НоваяСтрока.Вставить("ТипОтображаемыхДанных", "КонтактноеЛицо");
				СтрокаКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаКИ,НоваяСтрока); 
				Если ЗначениеЗаполнено(ОсновнойКонтакт.Должность) Тогда
					СтрокаКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Добавить();
					СтрокаКИ.ТипОтображаемыхДанных = "ЗначениеКИ";
					СтрокаКИ.Отображение = "Должность: " + ОсновнойКонтакт.Должность;
					СтрокаКИ.ИндексПиктограммы = -1;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НаименованиеПолное = РеквизитыКонтрагента.ЕГРЮЛ.НаименованиеПолное;
		
	Иначе
		
		РеквизитыПредпринимателя = РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН(ИНН);
		
		Если ЗначениеЗаполнено(РеквизитыПредпринимателя.ОписаниеОшибки) Тогда
			ОписаниеОшибкиЗаполнения = РеквизитыПредпринимателя.ОписаниеОшибки;
			Возврат;
		КонецЕсли;
		
		Объект.Наименование			= РеквизитыПредпринимателя.Наименование;
		Объект.НаименованиеПолное	= РеквизитыПредпринимателя.НаименованиеСокращенное;
		Объект.ИНН					= РеквизитыПредпринимателя.ИНН;
		Объект.РегистрационныйНомер	= РеквизитыПредпринимателя.РегистрационныйНомер;
		РеквизитыПредпринимателя.Свойство("КодОКВЭД", КодОКВЭД);
		
		Если РеквизитыПредпринимателя.СвидетельствоОРегистрации <> Неопределено Тогда
			Объект.СвидетельствоСерияНомер = "" + РеквизитыПредпринимателя.СвидетельствоОРегистрации.Серия + " " + РеквизитыПредпринимателя.СвидетельствоОРегистрации.Номер;
			Объект.СвидетельствоДатаВыдачи = РеквизитыПредпринимателя.СвидетельствоОРегистрации.Дата;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыПредпринимателя.Фамилия) Тогда
			Объект.ФИО = РеквизитыПредпринимателя.Фамилия
				+ ?(ПустаяСтрока(РеквизитыПредпринимателя.Имя), "", " " + РеквизитыПредпринимателя.Имя)
				+ ?(ПустаяСтрока(РеквизитыПредпринимателя.Отчество), "", " " + РеквизитыПредпринимателя.Отчество);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыПредпринимателя.Пол) Тогда
			Объект.Пол = ?(РеквизитыПредпринимателя.Пол = "1", Перечисления.ПолФизическогоЛица.Мужской, Перечисления.ПолФизическогоЛица.Женский);
		КонецЕсли;
		
		НаименованиеПолное = РеквизитыПредпринимателя.НаименованиеПолное;
		
	КонецЕсли;
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект);
	Если ЗначениеЗаполнено(НаименованиеПолное) Тогда
		
		Элементы.Наименование.СписокВыбора.Добавить(НаименованиеПолное);
		
		Элементы.НаименованиеПолное.СписокВыбора.Очистить();
		Элементы.НаименованиеПолное.СписокВыбора.Добавить(Объект.НаименованиеПолное);
		Элементы.НаименованиеПолное.СписокВыбора.Добавить(НаименованиеПолное);
		Элементы.НаименованиеПолное.КнопкаВыпадающегоСписка = Истина;
		
	КонецЕсли;
	
	Если СтрНачинаетсяС(КодОКВЭД, "84.") Тогда
		ЭтоГосударственныйОрган = Истина;
	КонецЕсли;

	Если ЭтоГосударственныйОрган Тогда
		Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган;
	ИначеЕсли СтрДлина(ИНН) = 10 Тогда
		Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	ИначеЕсли СтрДлина(ИНН) = 12 Тогда
		
		Если ТипЗнч(ОрганизационноПравоваяФорма) = Тип("Структура")
			И ОрганизационноПравоваяФорма.Свойство("ПолнаяФорма")
			И ВРег(ОрганизационноПравоваяФорма.ПолнаяФорма) = ВРег("Индивидуальный предприниматель") Тогда
				
			Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
		Иначе
			Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьОтображениеТипаКИ();
	
	ЗаполнитьВидКонтрагента();
	ВыполнитьВсеПроверки(ЭтотОбъект);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтактнуюИнформациюКонтрагентаПоДаннымЕГРЮЛ(СведенияОЮридическомЛицеПоИНН)
	
	НоваяКонтактнаяИнформация = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
	
	Если СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес <> Неопределено Тогда
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.Представление;
		ДанныеКИ.Значение = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.КонтактнаяИнформация;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.Представление;
		ДанныеКИ.Значение = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.КонтактнаяИнформация;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	КонецЕсли;
	
	Если СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Свойство("Телефон")
		И СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Телефон <> Неопределено Тогда
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Телефон.Представление;
		ДанныеКИ.Значение = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Телефон.КонтактнаяИнформация;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	КонецЕсли;
	
	УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(Объект, НоваяКонтактнаяИнформация);
	ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, Объект, ИмяЭлементаДляРазмещения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючевыеРеквизитыЗаполнены(Форма)
	
	Результат = Ложь;
	Объект = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.Наименование)
		Или Объект.КонтактнаяИнформация.Количество() > 0 Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОшибкуЗаполнитьРеквизитыПоИННЗавершение(Результат, СтрокаИНН) Экспорт
	
	Если Результат.ПовторитьДействие Тогда
		ВыполнитьЗаполнениеРеквизитовПоИНН(СтрокаИНН);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеРеквизитовКонтрагентВыбран(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) 
		ИЛИ ТипЗнч(Результат) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИНН = Результат;
	ВыполнитьЗаполнениеРеквизитовПоИНН(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПерезаполнитьРеквизитыПоИННЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаполнениеРеквизитовПоИНН(Объект.ИНН);
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ПанельДополнительнойИнформации

&НаСервере
Процедура ПрочитатьДанныеПанелиДопИнформации()
	
	ПоследнееСобытие = Новый ФорматированнаяСтрока(НСтр("ru = '<нет>'"));
	ПоследняяПродажа = Новый ФорматированнаяСтрока(НСтр("ru = '<нет>'"));
	СуммаПродаж = Новый ФорматированнаяСтрока(НСтр("ru = '<нет>'"));
	ОстатокВзаиморасчетов = Новый ФорматированнаяСтрока(НСтр("ru = '<нет>'"));
	
	Если УправлениеДоступомУНФ.ЕстьПрофильРабочееМестоКассира() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// 1. Остаток взаиморасчетов
	
	Если ПросмотрВзаиморасчетов Тогда
		
		Элементы.ОстатокВзаиморасчетов.Заголовок = РаботаСКонтрагентамиУНФ.ЗаголовокПоляВзаиморасчетов(Объект.Ссылка);
		ОстатокВзаиморасчетов = РаботаСКонтрагентамиУНФ.ОстатокВзаиморасчетовБезЗаголовка(Объект.Ссылка);
		
	КонецЕсли;
	
	// 2. Сумма продаж
	
	Если ПросмотрПродаж Тогда
		
		Запрос.Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПродажиОбороты.СуммаОборот КАК Сумма
			|ИЗ
			|	РегистрНакопления.Продажи.Обороты(, , , Контрагент = &Контрагент) КАК ПродажиОбороты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Продажи.Документ КАК Документ,
			|	Продажи.Документ.Дата КАК Дата
			|ИЗ
			|	РегистрНакопления.Продажи КАК Продажи
			|ГДЕ
			|	Продажи.Контрагент = &Контрагент
			|	И Продажи.Документ.Ссылка ЕСТЬ НЕ NULL
			|
			|УПОРЯДОЧИТЬ ПО
			|	Продажи.Документ.Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Выборка = МассивРезультатов[0].Выбрать();
		Если Выборка.Следующий() Тогда
			Сумма = Выборка.Сумма;
		Иначе
			Сумма = 0;
		КонецЕсли;
		
		КомпонентыФС = Новый Массив;
		
		СуммаСтрокой = Формат(Сумма, "ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0,00");
		ПозицияРазделителя = СтрНайти(СуммаСтрокой, ",");
		КомпонентыЧисла = Новый Массив;
		КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Лев(СуммаСтрокой, ПозицияРазделителя)));
		КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Сред(СуммаСтрокой, ПозицияРазделителя+1)));
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(КомпонентыЧисла));
		
		КомпонентыФС.Добавить(" "
		+ УправлениеНебольшойФирмойПовтИсп.ПолучитьСимвольноеПредставлениеВалюты(
		УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета()));
		
		СуммаПродаж = Новый ФорматированнаяСтрока(КомпонентыФС);
		
		// 3. Последняя продажа
		
		Выборка = МассивРезультатов[1].Выбрать();
		Если Выборка.Следующий() Тогда
			Дата = Выборка.Дата;
			СсылкаНаДокументПоследнейПродажи = ПолучитьНавигационнуюСсылку(Выборка.Документ);
		Иначе
			Дата = '00010101';
			СсылкаНаДокументПоследнейПродажи = "";
		КонецЕсли;
		
		КомпонентыФС = Новый Массив;
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(Формат(Дата, "Л=ru_RU; ДЛФ=D; ДП=<нет>")));
		
		ПоследняяПродажа = Новый ФорматированнаяСтрока(КомпонентыФС);
		
	КонецЕсли;
	
	// 4. Последнее событие
	
	Если НЕ ИспользоватьСобытия Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Событие.Ссылка КАК Событие,
	|	Событие.НачалоСобытия КАК Дата
	|ИЗ
	|	Документ.Событие.Участники КАК СобытиеУчастники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Событие КАК Событие
	|		ПО СобытиеУчастники.Ссылка = Событие.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиАдресатКонтактCRM КАК СвязиАдресатКонтактCRM
	|		ПО СобытиеУчастники.Контакт = СвязиАдресатКонтактCRM.Адресат
	|			И (СвязиАдресатКонтактCRM.КонтактCRM В (&КонтактыНаПоиск))
	|ГДЕ
	|	(СобытиеУчастники.Контакт В (&КонтактыНаПоиск)
	|			ИЛИ СвязиАдресатКонтактCRM.Адресат ЕСТЬ НЕ NULL )
	|	И Событие.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Событие.НачалоСобытия УБЫВ";
	
	КонтактыНаПоиск = Новый Массив;
	КонтактыНаПоиск.Добавить(Объект.Ссылка);
	СвязанныеКонтакты = Справочники.Контрагенты.СвязанныеКонтакты(Объект.Ссылка);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КонтактыНаПоиск, СвязанныеКонтакты);
	
	Если РаботаСЛидами.ЛидыДоступны() Тогда
		ЛидОснование = Справочники.Контрагенты.ЛидОснование(Объект.Ссылка);
		КонтактыНаПоиск.Добавить(ЛидОснование);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КонтактыНаПоиск", КонтактыНаПоиск);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Дата = Выборка.Дата;
		СсылкаНаДокументПоследнегоСобытия = ПолучитьНавигационнуюСсылку(Выборка.Событие);
	Иначе
		Дата = '00010101';
		СсылкаНаДокументПоследнегоСобытия = "";
	КонецЕсли;
	
	КомпонентыФС = Новый Массив;
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(Формат(Дата, "Л=ru_RU; ДЛФ=D; ДП=<нет>")));
	
	ПоследнееСобытие = Новый ФорматированнаяСтрока(КомпонентыФС);
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольДублей

&НаСервере
Процедура УстановитьНастройкиКонтроляДублей()
	
	Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	Элементы.НаименованиеПолное.ОтображениеПодсказки = ОтображениеПодсказки.Нет;

	НастройкиКонтроляДублейКонтрагенты = Константы.НастройкиКонтроляДублейКонтрагенты.Получить().Получить();
	НастройкиКонтроляДублейКонтакты    = Константы.НастройкиКонтроляДублейКонтакты.Получить().Получить();
	
	Если НастройкиКонтроляДублейКонтрагенты <> Неопределено Тогда
		ПроверятьПредставлениеНаДубли = НастройкиКонтроляДублейКонтрагенты.Получить("ПроверятьНаименование");
		ПроверятьЮрНазваниеНаДубли    = НастройкиКонтроляДублейКонтрагенты.Получить("ПроверятьЮрНазвание");
		ПроверятьНомерТелефонаНаДубли = НастройкиКонтроляДублейКонтрагенты.Получить("ПроверятьТелефон");
		ПроверятьАдресЭПНаДубли       = НастройкиКонтроляДублейКонтрагенты.Получить("ПроверятьАдресЭП");
	КонецЕсли;

	Если НастройкиКонтроляДублейКонтакты <> Неопределено Тогда
		ПроверятьПредставлениеНаДублиКонтакт = НастройкиКонтроляДублейКонтакты.Получить("ПроверятьНаименование");
		ПроверятьНомерТелефонаНаДублиКонтакт = НастройкиКонтроляДублейКонтакты.Получить("ПроверятьТелефон");
		ПроверятьАдресЭПНаДублиКонтакт       = НастройкиКонтроляДублейКонтакты.Получить("ПроверятьАдресЭП");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаДубли(Реквизит)
	
	Если Реквизит = "НаименованиеПолное" Тогда
		Если НЕ ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
			Возврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОрганизационноПравоваяФорма.НаименованиеБезОПФ) Тогда
			Возврат;
		КонецЕсли;
		НаименованиеПолноеДляПоискаДублей = НаименованиеДляПоискаДублей(ОрганизационноПравоваяФорма.НаименованиеБезОПФ);
	КонецЕсли;

	Если Реквизит = "Наименование" Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
			Возврат;
		КонецЕсли;
		НаименованиеДляПоискаДублей = НаименованиеДляПоискаДублей(Объект.Наименование);
	КонецЕсли;
	
	ЗапросКонтрагенты = Новый Запрос;
	ЗапросКонтрагенты.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.Ссылка = &Ссылка
	|	И (Контрагенты.Наименование ПОДОБНО &Наименование
	|			ИЛИ Контрагенты.НаименованиеПолное ПОДОБНО &Наименование)
	|	И НЕ Контрагенты.ЭтоГруппа";
	
	
	ЗапросКонтрагенты.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
	ЗапросКонтрагенты.УстановитьПараметр("Ссылка", Объект.Ссылка);
	УстановитьПривилегированныйРежим(Истина);
	Результат = ЗапросКонтрагенты.Выполнить();
			
	Если Результат.Пустой() Тогда
		
		ЗапросКонтакты = Новый Запрос;
		ЗапросКонтакты.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК Контакты
		|ГДЕ
		|	Контакты.Наименование ПОДОБНО &Наименование
		|	И НЕ Контакты.Ссылка В (&Контакты)
		|	И НЕ Контакты.ЭтоГруппа";
		
		ЗапросКонтакты.УстановитьПараметр("Контакты", ДанныеКонтактныхЛиц.Выгрузить(,"КонтактноеЛицо").ВыгрузитьКолонку("КонтактноеЛицо"));
		ЗапросКонтакты.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
		Результат = ЗапросКонтакты.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			ЗапросЛиды = Новый Запрос;
			ЗапросЛиды.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Лиды.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Лиды КАК Лиды
			|ГДЕ
			|	Лиды.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПустаяСсылка)
			|	И НЕ Лиды.ЭтоГруппа
			|	И Лиды.Вид <> ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
			|	И (Лиды.Наименование ПОДОБНО &Наименование
			|			ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование)";
			
			Если Реквизит = "Наименование" Тогда
				
				ЗапросЛиды.Текст = СтрЗаменить(ЗапросЛиды.Текст,
				"	И Лиды.Вид <> ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
				|	И (Лиды.Наименование ПОДОБНО &Наименование
				|			ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование)",
				"	И ВЫБОР
				|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
				|				ТОГДА Лиды.Наименование ПОДОБНО &Наименование
				|			ИНАЧЕ Лиды.Наименование ПОДОБНО &Наименование
				|					ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование
				|		КОНЕЦ");
				
			КонецЕсли;
			
			ЗапросЛиды.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
			Результат = ЗапросЛиды.Выполнить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДублиНайдены = Не Результат.Пустой();
	Если ДублиНайдены Тогда
		ОтображениеПодсказкиЭлемента = ОтображениеПодсказки.ОтображатьСнизу;
	Иначе
		ОтображениеПодсказкиЭлемента = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	Если Реквизит = "НаименованиеПолное" Тогда
		Элементы.НаименованиеПолное.ОтображениеПодсказки = ОтображениеПодсказкиЭлемента;
	ИначеЕсли Реквизит = "Наименование" Тогда
		Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказкиЭлемента;
	Иначе
		Элементы["Дубли"+Реквизит].Видимость = ДублиНайдены;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаименованиеКонтактаНаДубли(ИндексКЛ)
	
	ПредставлениеКонтакта = ДанныеКонтактныхЛиц[ИндексКЛ].Наименование;
	
	Если НЕ ЗначениеЗаполнено(ПредставлениеКонтакта) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверятьПредставлениеНаДублиКонтакт Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеКонтактаДляПоискаДублей = НаименованиеДляПоискаДублей(ПредставлениеКонтакта);
	
	ЗапросКонтрагенты = Новый Запрос;
	ЗапросКонтрагенты.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.Ссылка = &Ссылка
	|	И (Контрагенты.Наименование ПОДОБНО &Наименование
	|			ИЛИ Контрагенты.НаименованиеПолное ПОДОБНО &Наименование)";
	
	ЗапросКонтрагенты.УстановитьПараметр("Наименование", НаименованиеКонтактаДляПоискаДублей);
	ЗапросКонтрагенты.УстановитьПараметр("Ссылка", Объект.Ссылка);
	УстановитьПривилегированныйРежим(Истина);
	Результат = ЗапросКонтрагенты.Выполнить();
			
	Если Результат.Пустой() Тогда
		
		ЗапросКонтакты = Новый Запрос;
		ЗапросКонтакты.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	Контакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК Контакты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(, ) КАК СвязиКонтрагентКонтакт
		|		ПО (СвязиКонтрагентКонтакт.Контакт = Контакты.Ссылка)
		|ГДЕ
		|	Контакты.Наименование ПОДОБНО &Наименование
		|	И НЕ СвязиКонтрагентКонтакт.Контрагент = &Ссылка
		|	И НЕ Контакты.Ссылка = &Контакт
		|	И СвязиКонтрагентКонтакт.СвязьНедействительна = ЛОЖЬ";
		
		ЗапросКонтакты.УстановитьПараметр("Ссылка", Объект.Ссылка);
		ЗапросКонтакты.УстановитьПараметр("Контакт", ДанныеКонтактныхЛиц[ИндексКЛ].КонтактноеЛицо);
		ЗапросКонтакты.УстановитьПараметр("Наименование", НаименованиеКонтактаДляПоискаДублей);
		Результат = ЗапросКонтакты.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			ЗапросЛиды = Новый Запрос;
			ЗапросЛиды.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Лиды.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Лиды КАК Лиды
			|ГДЕ
			|	Лиды.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПустаяСсылка)
			|	И ВЫБОР
			|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
			|				ТОГДА Лиды.Наименование ПОДОБНО &Наименование
			|			ИНАЧЕ Лиды.Наименование ПОДОБНО &Наименование
			|					ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование
			|		КОНЕЦ";
			
			ЗапросЛиды.УстановитьПараметр("Наименование", НаименованиеКонтактаДляПоискаДублей);
			Результат = ЗапросЛиды.Выполнить();
			
		КонецЕсли;
		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	ПоказатьСкрытьНадписьОДубляхНаименованияКЛ(ИндексКЛ, НЕ Результат.Пустой());

КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьНадписьОДубляхНаименованияКЛ(ИндексКЛ, ЕстьДубли)
	
	Если НЕ ЕстьДубли Тогда
		
		ЭлементКЛ = Элементы.Найти("СообщениеОДубляхКЛ_"+ Строка(ИндексКЛ));
		Если ЭлементКЛ <> Неопределено Тогда
			Элементы.Удалить(ЭлементКЛ);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	СообщениеОДублях = Элементы.Добавить("СообщениеОДубляхКЛ_" + Строка(ИндексКЛ), Тип("ДекорацияФормы"), Элементы["Контакт_" + ИндексКЛ]);
	СообщениеОДублях.Заголовок = НСтр("ru = 'Найдены дубли по представлению'");
	СообщениеОДублях.Гиперссылка = Истина;
	СообщениеОДублях.УстановитьДействие("Нажатие", "Подключаемый_СообщениеОДубляхКЛНажатие");
	Элементы.Переместить(СообщениеОДублях, Элементы["Контакт_" + ИндексКЛ], Элементы["КонтактнаяИнформацияКонтакт_" + ИндексКЛ]);
	СообщениеОДублях.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКИНаДубли(ДанныеКИ, ИндексКЛ = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ДанныеКИ.Представление) И ДублиКИ.Количество() <> 0 Тогда
		УдалитьНеактивныеДублиИЭлементы(ИндексКЛ);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеКИ.Представление) Тогда
		Возврат;
	КонецЕсли;
	
	ТипКИАдресЭП = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ТипКИНомер   = Перечисления.ТипыКонтактнойИнформации.Телефон;
	
	Если ДанныеКИ.Тип <> ТипКИАдресЭП И ДанныеКИ.Тип <> ТипКИНомер Тогда
		Возврат;
	КонецЕсли;
	
	Если (ДанныеКИ.Тип = ТипКИАдресЭП И НЕ ПроверятьАдресЭПНаДубли И ИндексКЛ = Неопределено)
		ИЛИ (ДанныеКИ.Тип = ТипКИАдресЭП И НЕ ПроверятьАдресЭПНаДублиКонтакт И ИндексКЛ <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеКИ.Тип = ТипКИНомер И НЕ ПроверятьНомерТелефонаНаДубли И ИндексКЛ = Неопределено
		ИЛИ (ДанныеКИ.Тип = ТипКИНомер И НЕ ПроверятьНомерТелефонаНаДублиКонтакт И ИндексКЛ <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросКонтрагенты = Новый Запрос;
	ЗапросКонтрагенты.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.Ссылка = &Ссылка
	|	И Контрагенты.АдресЭПДляПоиска ПОДОБНО &ПредставлениеКИ
	|	И НЕ Контрагенты.ЭтоГруппа";
	
	ПоисковоеВыражение = ДанныеКИ.Представление;
	
	Если ДанныеКИ.Тип = ТипКИНомер Тогда
		ПоисковоеВыражение = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(ДанныеКИ.Представление);
		ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "+", "");
		Если СтрНачинаетсяС(ПоисковоеВыражение, "7") Тогда
			ПоисковоеВыражение = Сред(ПоисковоеВыражение, 2, СтрДлина(ПоисковоеВыражение) - 1);
		КонецЕсли;

		ЗапросКонтрагенты.Текст = СтрЗаменить(ЗапросКонтрагенты.Текст, "АдресЭП", "НомерТелефона");
	КонецЕсли;
	
	ЗапросКонтрагенты.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ЗапросКонтрагенты.УстановитьПараметр("ПредставлениеКИ", "%" + ПоисковоеВыражение + "%");
	УстановитьПривилегированныйРежим(Истина);
	Результат = ЗапросКонтрагенты.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		ЗапросКонтакты = Новый Запрос;
		ЗапросКонтакты.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК Контакты
		|ГДЕ
		|	НЕ Контакты.Ссылка В (&МассивКонтактов)
		|	И Контакты.АдресЭПДляПоиска ПОДОБНО &ПредставлениеКИ
		|	И НЕ Контакты.ЭтоГруппа";
		
		Если ДанныеКИ.Тип = ТипКИНомер Тогда
			
			ПоисковоеВыражение = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(ДанныеКИ.Представление);
			ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "+", "");
			Если СтрНачинаетсяС(ПоисковоеВыражение, "7") Тогда
				ПоисковоеВыражение = Сред(ПоисковоеВыражение, 2, СтрДлина(ПоисковоеВыражение) - 1);
			КонецЕсли;
			
			ЗапросКонтакты.Текст = СтрЗаменить(ЗапросКонтакты.Текст, "АдресЭП", "НомерТелефона");
			
		КонецЕсли;
		
		ЗапросКонтакты.УстановитьПараметр("МассивКонтактов", ДанныеКонтактныхЛиц.Выгрузить(,"КонтактноеЛицо").ВыгрузитьКолонку("КонтактноеЛицо"));
		ЗапросКонтакты.УстановитьПараметр("ПредставлениеКИ", "%" + ПоисковоеВыражение + "%");
		
		Результат = ЗапросКонтакты.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			ЗапросЛиды = Новый Запрос;
			ЗапросЛиды.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Лиды.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Лиды КАК Лиды
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
			|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
			|ГДЕ
			|	Лиды.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПустаяСсылка)
			|	И ВЫБОР
			|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
			|				ТОГДА ЕСТЬNULL(СвязиКонтрагентЛид.Контрагент.АдресЭПДляПоиска, Лиды.АдресЭПДляПоиска)
			|			ИНАЧЕ Лиды.АдресЭПДляПоиска
			|		КОНЕЦ ПОДОБНО &ПредставлениеКИ
			|	И НЕ Лиды.ЭтоГруппа";
			
			Если ДанныеКИ.Тип = ТипКИНомер Тогда
				
				ПоисковоеВыражение = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(ДанныеКИ.Представление);
				ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "+", "");
				Если СтрНачинаетсяС(ПоисковоеВыражение, "7") Тогда
					ПоисковоеВыражение = Сред(ПоисковоеВыражение, 2, СтрДлина(ПоисковоеВыражение) - 1);
				КонецЕсли;
				
				ЗапросЛиды.Текст = СтрЗаменить(ЗапросЛиды.Текст, "АдресЭП", "НомерТелефона");
				
			КонецЕсли;

			ЗапросЛиды.УстановитьПараметр("ПредставлениеКИ", "%" + ПоисковоеВыражение + "%");
			Результат = ЗапросЛиды.Выполнить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	ЕстьДубли = НЕ Результат.Пустой();
	ПоказатьСкрытьНадписьОДубляхКИ(ДанныеКИ, ЕстьДубли, ИндексКЛ);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьНадписьОДубляхКИ(ДанныеКИ, ЕстьДубли, ИндексКЛ = Неопределено)
	
	УдалитьНеактивныеДублиИЭлементы(ИндексКЛ);
	
	Дубли = ДублиКИ.НайтиСтроки(Новый Структура("Представление", ДанныеКИ.Представление));
	
	Если Дубли.Количество() <> 0 Тогда
		СообщениеОДублях = Элементы.Найти("СообщениеОДублях_" + Строка(Дубли[0].ИндексДекорации));
		СообщениеОДублях.Видимость = ЕстьДубли;
		Возврат;
	КонецЕсли;

	Если НЕ ЕстьДубли Тогда
		Возврат;
	КонецЕсли;
	
	ДублиКИ.Сортировать("ИндексДекорации УБЫВ");
	
	НовыйДубль = ДублиКИ.Добавить();
	НовыйДубль.ИмяЭлемента     = ДанныеКИ.ИмяРеквизита;
	НовыйДубль.ТипКИ           = ДанныеКИ.Тип;
	НовыйДубль.Представление   = ДанныеКИ.Представление;
	НовыйДубль.ИндексДекорации = ДублиКИ[0].ИндексДекорации + 1;
	НовыйДубль.ЭтоДубльКЛ      = ?(ИндексКЛ = Неопределено, Ложь, Истина);
	НовыйДубль.ИндексКЛ        = ?(ИндексКЛ = Неопределено, 0, ИндексКЛ);
	
	ГруппаЗначенияКИ = Элементы[ДанныеКИ.ИмяРеквизита].Родитель.Родитель;
	ГруппаТекущегоЗначенияКИ = Элементы[ДанныеКИ.ИмяРеквизита].Родитель;
	ГруппаСоседнегоЗначенияКИ = УправлениеКонтактнойИнформациейУНФ.СледующийЭлементВКоллекцииПочиненных(ГруппаЗначенияКИ.ПодчиненныеЭлементы, ГруппаТекущегоЗначенияКИ);
	
	СообщениеОДублях = Элементы.Добавить("СообщениеОДублях_" + Строка(НовыйДубль.ИндексДекорации), Тип("ДекорацияФормы"), ГруппаЗначенияКИ);
	СообщениеОДублях.Заголовок = СообщенияОДубляхКИПоТипу(ДанныеКИ.Тип);
	СообщениеОДублях.Гиперссылка = Истина;
	СообщениеОДублях.УстановитьДействие("Нажатие", "Подключаемый_СообщениеОДубляхНажатие");
	СообщениеОДублях.Шрифт = ШрифтыСтиля.ПодзаголовокПервогоУровня;
	
	Если ГруппаСоседнегоЗначенияКИ <> Неопределено Тогда
		Элементы.Переместить(СообщениеОДублях, ГруппаЗначенияКИ, ГруппаСоседнегоЗначенияКИ);
	КонецЕсли;
	
	СообщениеОДублях.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Функция СообщенияОДубляхКИПоТипу(Тип)
	
	Если Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		Возврат НСтр("ru = 'Найдены дубли по e-mail'");
	КонецЕсли;
	
	Если Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		Возврат НСтр("ru = 'Найдены дубли по номеру телефона'");
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УдалитьНеактивныеДублиИЭлементы(ИндексКЛ = Неопределено)
	
	Если ДублиКИ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийИндекс = ДублиКИ.Количество() - 1;
	
	Пока ТекущийИндекс >= 0 Цикл
		
		Дубль = ДублиКИ[ТекущийИндекс];
		ТекущийИндекс = ТекущийИндекс - 1;
		Если ИндексКЛ = Неопределено И Дубль.ЭтоДубльКЛ Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИндексКЛ = Неопределено И Дубль.ЭтоДубльКЛ Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИндексКЛ <> Неопределено И НЕ Дубль.ЭтоДубльКЛ Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеКИ = УправлениеКонтактнойИнформациейУНФ.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Дубль.ИмяЭлемента);
		Если ОписаниеКИ.Представление = Дубль.Представление Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы.Удалить(Элементы["СообщениеОДублях_"+ Строка(Дубль.ИндексДекорации)]);
		ДублиКИ.Удалить(ДублиКИ.Индекс(Дубль));
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПроверитьКонтрагентаНаДублиКИ()
	
	Для каждого ДанныеКИ Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
		Если СтрНачинаетсяС(ДанныеКИ.ИмяЭлементаДляРазмещения, "КонтактнаяИнформацияКонтакт_") Тогда
			// Это контактная информация контактого лица.
			Продолжить;
		КонецЕсли;
		ПроверитьКИНаДубли(ДанныеКИ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеДляПоискаДублей(Наименование)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Наименование))Тогда
		Возврат "";
	КонецЕсли;
	
	ПоисковоеВыражение = ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(Наименование);
	
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "-", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, " ", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "(", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, ")", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, ".", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, """", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, """", "%");
	
	Возврат СокрЛП("%"+ПоисковоеВыражение+"%");
	
КонецФункции

&НаСервере
Процедура ОбработатьВыборДублей(ВыбранныйКонтрагент)
	
	ЗакрыватьПриВыборе = Ложь;
	ЗначениеВРеквизитФормы(ВыбранныйКонтрагент.ПолучитьОбъект(), "Объект");
	УдалитьЭлементыДублейКИ();
	ДублиКИ.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеОДублях()
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыПредупреждениеДублей",ЭтотОбъект);
	ТекстПредупреждения = ТекстПредупрежденияПоДублям();

	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Проигнорировать и записать'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстПредупреждения, СписокКнопок,,КодВозвратаДиалога.Отмена, "Контроль дублей");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыПредупреждениеДублей(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПроигнорированоСообщениеОДублях = Истина;
	СозданКопированием = Ложь;
	СообщениеОДублированииИнформации = ТекстПредупрежденияПоДублям(Истина);
	
	УдалитьЭлементыДублейКИ();
	Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	Элементы.НаименованиеПолное.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыДублейКИ()
	
	Для Каждого Дубль Из ДублиКИ Цикл
		Если Элементы.Найти("СообщениеОДублях_"+ Строка(Дубль.ИндексДекорации)) <> Неопределено Тогда
			Элементы.Удалить(Элементы["СообщениеОДублях_"+ Строка(Дубль.ИндексДекорации)]);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		
		ИндексКЛ = ДанныеКонтактныхЛиц.Индекс(Контакт);
		
		Если Элементы.Найти("СообщениеОДубляхКЛ_"+ Строка(ИндексКЛ)) <> Неопределено Тогда
			Элементы.Удалить(Элементы["СообщениеОДубляхКЛ_"+ Строка(ИндексКЛ)]);
		КонецЕсли;
		
	КонецЦикла;
	
	ДублиКИ.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКонтрагентаНаДублиСервер()
	
	Если ПроверятьПредставлениеНаДубли  Тогда
		ПроверитьНаДубли("Наименование");
	КонецЕсли;
	
	Если ПроверятьЮрНазваниеНаДубли Тогда
		ПроверитьНаДубли("НаименованиеПолное");
	КонецЕсли;
	
	УдалитьЭлементыДублейКИ();
	ПроверитьКонтрагентаНаДублиКИ();
	
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		
		ИндексКЛ = ДанныеКонтактныхЛиц.Индекс(Контакт);
		ПроверитьНаименованиеКонтактаНаДубли(ИндексКЛ);
		
		Для каждого ДанныеКИ Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
			Если СтрНачинаетсяС(ДанныеКИ.ИмяЭлементаДляРазмещения, "КонтактнаяИнформацияКонтакт_") Тогда
				ПроверитьКИНаДубли(ДанныеКИ, ИндексКЛ);
			КонецЕсли;
		КонецЦикла
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросДобавлениеКонтактов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Ок Тогда
		
		Записать();
		
		Возврат;
		
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ТекстПредупрежденияПоДублям(СообщениеПриЗаписи = Ложь)
	
	МассивСтрок = Новый Массив;
	
	Если Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу Тогда
		МассивСтрок.Добавить(НСтр("ru = 'представлению'"));
	КонецЕсли;
	
	Если Элементы.НаименованиеПолное.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу Тогда
		МассивСтрок.Добавить(НСтр("ru = 'юр. названию'"));
	КонецЕсли;
	
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		
		ИндексКЛ = ДанныеКонтактныхЛиц.Индекс(Контакт);
		
		Если Элементы.Найти("СообщениеОДубляхКЛ_"+Строка(ИндексКЛ)) <> Неопределено Тогда
			МассивСтрок.Добавить(НСтр("ru = 'имени контакта'"));
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Отбор = Новый Структура("ТипКИ", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	ДублиПоНомеру = ДублиКИ.НайтиСтроки(Отбор);
	Если ДублиПоНомеру.Количество() > 0 Тогда
		МассивСтрок.Добавить(НСтр("ru = 'номеру телефона'"));
	КонецЕсли;
	
	Отбор = Новый Структура("ТипКИ", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	ДублиПоАдресуЭП = ДублиКИ.НайтиСтроки(Отбор);
	Если ДублиПоАдресуЭП.Количество() > 0 Тогда
		МассивСтрок.Добавить(НСтр("ru = 'e-mail'"));
	КонецЕсли;
	
	Если СообщениеПриЗаписи Тогда
		Возврат СтрШаблон(НСтр("ru = 'Проигнорировано сообщение о дублировании информации по %1'"), СтрСоединить(МассивСтрок,", "));
	КонецЕсли;
	
	ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Найдены дубли по %1'"), СтрСоединить(МассивСтрок,", "));
	Возврат ТекстПредупреждения;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСообщениеОДублях()
	
	Если НЕ Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу
		И НЕ Элементы.НаименованиеПолное.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу 
		И ДублиКИ.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Дублей не найдено'"));
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПредупрежденияПоДублям());
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СообщениеОДубляхКЛНажатие(Элемент)
	
	ПоложениеИндекса = СтрНайти(Элемент.Имя, "_", НаправлениеПоиска.СКонца);
	ИндексДекорации  = Число(Сред(Элемент.Имя, ПоложениеИндекса+1));
	
	НаименованиеКЛ = ДанныеКонтактныхЛиц[ИндексДекорации].Наименование;
	
	ПараметрыДублей = Новый Структура;
	МассивКонтактов = Новый Массив;
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		МассивКонтактов.Добавить(Контакт.КонтактноеЛицо);
	КонецЦикла;
	
	ПараметрыДублей.Вставить("Наименование", НаименованиеДляПоискаДублей(НаименованиеКЛ));
	ПараметрыДублей.Вставить("ИсключаяКонтакты", МассивКонтактов);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СообщениеОДубляхНажатие(Элемент)
	
	ПоложениеИндекса = СтрНайти(Элемент.Имя, "_", НаправлениеПоиска.СКонца);
	ИндексДекорации  = Число(Сред(Элемент.Имя, ПоложениеИндекса+1));
	
	СтрокиДублиКИ = ДублиКИ.НайтиСтроки(Новый Структура("ИндексДекорации", ИндексДекорации));
	Если СтрокиДублиКИ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Дубль = СтрокиДублиКИ[0];
	ДанныеКИ = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Дубль.ИмяЭлемента);
	Если ДанныеКИ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДублей = Новый Структура;
	МассивКонтактов = Новый Массив;
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		МассивКонтактов.Добавить(Контакт.КонтактноеЛицо);
	КонецЦикла;
	ПараметрыДублей.Вставить("ПредставлениеКИ", ДанныеКИ.Представление);
	ПараметрыДублей.Вставить("ТипКИ",           ДанныеКИ.Тип);
	ПараметрыДублей.Вставить("ИсключаяКонтакты", МассивКонтактов);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСпискаДублей(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено И РезультатЗакрытия.Свойство("ВыбранДубльКонтрагента") Тогда
		
		ОбработатьВыборДублей(РезультатЗакрытия.ВыбранныйКонтрагент);
		Прочитать();		
		Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Элементы.НаименованиеПолное.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		КонтрагентЗамененНаДубль = Истина;		
		Возврат;
		
	КонецЕсли;
	
	СформироватьПредставлениеПроверкиДублей(ЭтотОбъект);
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область АвтоподборКонтактов

&НаСервере
Процедура ЗаполнитьНаименованиеИКонтактнуюИнформацию(Знач КлассификаторСсылка, Знач ИмяЭлемента = "")
	
	ДанныеКонтакта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
	КлассификаторСсылка,
	"Title, JSON");
	
	Если ДанныеКонтактныхЛиц.Количество() = 0 Тогда
		ДанныеКонтактныхЛиц.Добавить();
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяЭлемента) Тогда
		ИндексЭлемента = 0;
	Иначе
		ИндексЭлемента = Число(СтрЗаменить(ИмяЭлемента, "НаименованиеКонтакт_", ""));
	КонецЕсли;
	
	Если ИндексЭлемента = 0 Тогда
		Объект.Наименование = ДанныеКонтакта.Title;
	КонецЕсли;
	
	ДанныеКонтактныхЛиц[ИндексЭлемента].Наименование = ДанныеКонтакта.Title;
	ДанныеКонтактныхЛиц[ИндексЭлемента].Изменен = Истина;
	ДанныеКонтактныхЛиц[ИндексЭлемента].КонтактноеЛицо = Неопределено;
	// todo проверить сценарий
	
	Справочники.КлассификаторКонтактов.ЗаполнитьКонтактнуюИнформациюИзJSON(
	ДанныеКонтактныхЛиц[ИндексЭлемента].КонтактнаяИнформация,
	ДанныеКонтакта.JSON,
	ТипЗнч(ДанныеКонтактныхЛиц[ИндексЭлемента].КонтактноеЛицо));
	
	Модифицированность = Истина;
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_АвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	АвтоподборКонтактовКлиент.Подключаемый_АвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, Параметры, Ожидание,
		СтандартнаяОбработка);
		
	Если СтрНайти(Элемент.Имя, "Контакт") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьПунктСозданиеКонтакта(ЭтотОбъект, ДанныеВыбора, Параметры, Текст,СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область Взаиморасчеты

&НаСервере
Процедура ЗаполнитьТаблицуВзаиморасчетов()
	
	АналитикаВзаиморасчетов.Очистить();
	
	ДанныеСтроки = АналитикаВзаиморасчетов.Добавить();
	ДанныеСтроки.СмотретьПо = "ПоДоговорам";
	ДанныеСтроки.Представление = НСтр("ru = 'По договорам'");
	ДанныеСтроки.Долги = Объект.ВестиРасчетыПоДоговорам;
	ДанныеСтроки.ДолгиДоступны = Истина;
	
	ДанныеСтроки = АналитикаВзаиморасчетов.Добавить();
	ДанныеСтроки.СмотретьПо = "ПоДокументам";
	ДанныеСтроки.Представление = НСтр("ru = 'По документам'");
	ДанныеСтроки.Долги = Объект.ВестиРасчетыПоДокументам;
	ДанныеСтроки.Оплата = Объект.ВестиРасчетыПоДокументам;
	ДанныеСтроки.ДолгиДоступны = Истина;
	
	ДанныеСтроки = АналитикаВзаиморасчетов.Добавить();
	ДанныеСтроки.СмотретьПо = "ПоЗаказам";
	ДанныеСтроки.Представление = НСтр("ru = 'По заказам'");
	ДанныеСтроки.Долги = Объект.ВестиРасчетыПоЗаказам;
	ДанныеСтроки.Оплата = Объект.ВестиРасчетыПоЗаказам;
	ДанныеСтроки.ДолгиДоступны = Истина;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСчетаНаОплату") Тогда
		
		ДанныеСтроки = АналитикаВзаиморасчетов.Добавить();
		ДанныеСтроки.СмотретьПо = "ПоСчетам";
		ДанныеСтроки.Представление = НСтр("ru = 'По счетам'");
		ДанныеСтроки.Оплата = Объект.ВестиУчетОплатыПоСчетам;
		ДанныеСтроки.ОплатаДоступна = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиИВидимостьПриИзмененииФлагаРасчетовПоДоговорам()
	
	Если Объект.ВестиРасчетыПоДоговорам Тогда
		Элементы.ГруппаУсловияЗаполненияДокументовОплаты.Заголовок = НСтр("ru = 'Заполнение новых договоров'");
	Иначе
		Элементы.ГруппаУсловияЗаполненияДокументовОплаты.Заголовок = НСтр("ru = 'Заполнение новых документов'");
	КонецЕсли;
	Элементы.ГруппаЗначенияДляДоговораПоУмолчанию.Видимость = Объект.ВестиРасчетыПоДоговорам;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьФлагаВ_УЕ()
	
	Если Объект.ВалютаРасчетовПоУмолчанию = НациональнаяВалюта Тогда
		Элементы.РасчетыВУсловныхЕдиницахПоУмолчанию.Видимость = Ложь;
	Иначе
		Элементы.РасчетыВУсловныхЕдиницахПоУмолчанию.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДатаОтгрузки

&НаСервере
Процедура УстановитьОтображениеНастройкиДатыОтгрузкиОплаты(ПараметрыДатыОтгрузкиОплаты)
		
	Элементы.ГруппаЗаполнениеДатыОтгрузки.Видимость = ПараметрыДатыОтгрузкиОплаты.Покупатель
		И НЕ ПараметрыДатыОтгрузкиОплаты.ВестиРасчетыПоДоговорам;
	Элементы.ГруппаЗаполнениеДатыОплаты.Видимость = ПараметрыДатыОтгрузкиОплаты.Покупатель
		И НЕ ПараметрыДатыОтгрузкиОплаты.ВестиРасчетыПоДоговорам;
		
	Если НЕ ПараметрыДатыОтгрузкиОплаты.ВестиРасчетыПоДоговорам Тогда
		ТекстЗаголовкаДатыОтгрузки = ПолучитьТекстСсылкиДатыОтгрузки(ПараметрыДатыОтгрузкиОплаты);
		Элементы.ДекорацияНастройкаДатыОтгрузки.Подсказка = ТекстЗаголовкаДатыОтгрузки;
	
		Если СтрДлина(ТекстЗаголовкаДатыОтгрузки) > 50 Тогда
			ТекстЗаголовка = Лев(ТекстЗаголовкаДатыОтгрузки, 47) + "...";
		КонецЕсли;		
		ДекорацияНастройкаДатыОтгрузки = ТекстЗаголовкаДатыОтгрузки;
		
		ТекстЗаголовкаДатыОплаты = ПолучитьТекстСсылкиДатыОплаты(ПараметрыДатыОтгрузкиОплаты);
		Элементы.ДекорацияНастройкаДатыОплаты.Подсказка = ТекстЗаголовкаДатыОплаты;
		
		Если СтрДлина(ТекстЗаголовкаДатыОплаты) > 42 Тогда
			ТекстЗаголовка = Лев(ТекстЗаголовкаДатыОплаты, 39) + "...";
		КонецЕсли;		
		ДекорацияНастройкаДатыОплаты = ТекстЗаголовкаДатыОплаты;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстСсылкиДатыОтгрузки(ПараметрыДатыОтгрузкиОплаты)

	ОсновнойДоговор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(ПараметрыДатыОтгрузкиОплаты.КонтрагентСсылка);
	ТекстЗаголовка = Обработки.НастройкаЗаполненияДатыОтгрузки.ПолучитьЗаголовок(ОсновнойДоговор);
	
	Возврат ТекстЗаголовка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекстСсылкиДатыОплаты(ПараметрыДатыОтгрузкиОплаты)

	ОсновнойДоговор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(ПараметрыДатыОтгрузкиОплаты.КонтрагентСсылка);
	ТекстЗаголовка = Обработки.НастройкаЗаполненияДатыОплаты.ПолучитьЗаголовок(ОсновнойДоговор);
	
	Возврат ТекстЗаголовка;
	
КонецФункции

&НаСервере
Функция ПолучитьОсновнойДоговор()
	
	Возврат Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура НастройкаДатыОтгрузкиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		
		РезультатЗакрытия.Вставить("ДоговорКонтрагента", ДополнительныеПараметры.ДоговорКонтрагента);
		СохранитьНастройкуВДоговоре(РезультатЗакрытия);
		
	КонецЕсли;	
	ПараметрыДатыОтгрузкиОплаты = Новый Структура("КонтрагентСсылка", Объект.Ссылка);
	ТекстЗаголовкаДатыОтгрузки = ПолучитьТекстСсылкиДатыОтгрузки(ПараметрыДатыОтгрузкиОплаты);
	Элементы.ДекорацияНастройкаДатыОтгрузки.Подсказка = ТекстЗаголовкаДатыОтгрузки;
	
	Если СтрДлина(ТекстЗаголовкаДатыОтгрузки) > 50 Тогда
		ТекстЗаголовка = Лев(ТекстЗаголовкаДатыОтгрузки, 47) + "...";
	КонецЕсли;		
	ДекорацияНастройкаДатыОтгрузки = ТекстЗаголовкаДатыОтгрузки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросЗаполнениеДатыОтгрузки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Ок Тогда
		
		Записать();
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДатыОплатыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		
		РезультатЗакрытия.Вставить("ДоговорКонтрагента", ДополнительныеПараметры.ДоговорКонтрагента);
		СохранитьНастройкуВДоговоре(РезультатЗакрытия);
		
	КонецЕсли;
	ПараметрыДатыОтгрузкиОплаты = Новый Структура("КонтрагентСсылка", Объект.Ссылка);
	ТекстЗаголовкаДатыОплаты = ПолучитьТекстСсылкиДатыОплаты(ПараметрыДатыОтгрузкиОплаты);
	Элементы.ДекорацияНастройкаДатыОплаты.Подсказка = ТекстЗаголовкаДатыОплаты;
	
	Если СтрДлина(ТекстЗаголовкаДатыОплаты) > 42 Тогда
		ТекстЗаголовка = Лев(ТекстЗаголовкаДатыОплаты, 39) + "...";
	КонецЕсли;		
	ДекорацияНастройкаДатыОплаты = ТекстЗаголовкаДатыОплаты;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросЗаполнениеДатыОплаты(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Ок Тогда
		
		Записать();
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуВДоговоре(Настройка)
	
	Договор = Настройка.ДоговорКонтрагента.ПолучитьОбъект();
	Договор.Заблокировать();
	ЗаполнитьЗначенияСвойств(Договор, Настройка);
	Договор.Записать();
		
КонецПроцедуры

#КонецОбласти

#Область КабинетКлиента

&НаСервере
Функция АдресQRКодаДляСкачивания()
	Возврат ПоместитьВоВременноеХранилище(БиблиотекаКартинок.QRКодКабинетКлиентаМЛК.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
КонецФункции

&НаСервере
Функция ПолучитьQRКод(КодКлиента = Неопределено)
	
	НастройкиПубликацииМЛК = Справочники.НастройкиПубликацииМЛК.ПолучитьНастройкиПубликацииМЛК();
	
	Если НастройкиПубликацииМЛК = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекущиеНастройкиКабинетКлиента = Справочники.НастройкиПубликацииМЛК.НастройкиИнтеграцииКабинетКлиента(НастройкиПубликацииМЛК);
	
	Если ТекущиеНастройкиКабинетКлиента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	QRСтрока = "sbmcs" + ";" + ТекущиеНастройкиКабинетКлиента.АдресПриложения;
	Если КодКлиента <> Неопределено Тогда
		QRСтрока = QRСтрока + ";" + КодКлиента;
	КонецЕсли;
	ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(QRСтрока, 0, 190);
	QRКод = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	
	Возврат QRКод
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуНаКонструктор()
	Возврат Справочники.НастройкиПубликацииМЛК.ПолучитьНастройкиПубликацииМЛК();
КонецФункции

&НаКлиенте
Процедура ОбработатьВопросУстановитьИндивидуальныеЦены(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Ок Тогда
		
		Записать();
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Контрагент",Объект.Ссылка);
		ПараметрыФормы.Вставить("УстановитьИндивидуальныеЦены", Истина);
		ПараметрыФормы.Вставить("Ключ", ПолучитьСсылкуНаКонструктор());
		Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторЗавершение",ЭтотОбъект);
		ОткрытьФорму("Справочник.НастройкиПубликацииМЛК.Форма.КонструкторМобильногоПриложения", ПараметрыФормы,,,,,Оповещение);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗавершение(Результат, ДополнительныеПараметры) Экспорт
	УстановитьОтображениеКабинетаКлиента();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеКабинетаКлиента()
	
	Если ИспользоватьПодсистемуМобильныйЛичныйКабинет = Ложь Тогда 
		Элементы.ГруппаКабинетКлиента.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьПодсистемуКаналыПродаж = Ложь Тогда 
		Элементы.ГруппаКабинетКлиента.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаКабинетКлиента.Видимость = Объект.Покупатель;
	Если НЕ Элементы.ГруппаКабинетКлиента.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоАдминистраторПрограммы = Пользователи.ЭтоПолноправныйПользователь(, Ложь, Ложь);
	Если Не ЭтоАдминистраторПрограммы Тогда
		Элементы.ГруппаКабинетКлиента.Видимость = Ложь;
		Элементы.КабинетКлиентаПодключен.Видимость = Ложь;
		Элементы.КабинетКлиентаНеПодключен.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	НастройкиПубликацииМЛК = Справочники.НастройкиПубликацииМЛК.ПолучитьНастройкиПубликацииМЛК(); // см. СправочникСсылка.НастройкиПубликацииМЛК
	
	Если НастройкиПубликацииМЛК = Неопределено Тогда
		Элементы.КабинетКлиентаПодключитьПодключен.Заголовок = НСтр("ru = 'Подключить'");
		Элементы.КабинетКлиентаПодключен.Видимость = Ложь;
		Элементы.КабинетКлиентаНеПодключен.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	НастройкиИнтеграцииКабинетКлиента = Справочники.НастройкиПубликацииМЛК.НастройкиИнтеграцииКабинетКлиента(НастройкиПубликацииМЛК);
	
	Если НастройкиИнтеграцииКабинетКлиента = Неопределено Тогда
		Элементы.КабинетКлиентаПодключитьПодключен.Заголовок = НСтр("ru = 'Подключить'");
		Элементы.КабинетКлиентаПодключен.Видимость = Ложь;
		Элементы.КабинетКлиентаНеПодключен.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	КодКомпании = СтрЗаменить(НастройкиИнтеграцииКабинетКлиента.НомерОбласти, Символ(160), "");
	
	Если НастройкиИнтеграцииКабинетКлиента = Неопределено Тогда
		Элементы.КабинетКлиентаПодключитьПодключен.Заголовок = НСтр("ru = 'Подключить'");
		Элементы.КабинетКлиентаПодключен.Видимость = Ложь;
		Элементы.КабинетКлиентаНеПодключен.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.КабинетКлиентаПодключитьПодключен.Заголовок = НСтр("ru = 'Подключен'");
	Элементы.КабинетКлиентаПодключен.Видимость = Истина;
	Элементы.КабинетКлиентаНеПодключен.Видимость = Ложь;
	
	РезультатЗапроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкиПубликацииМЛК, "ИндивидуальныеЦены");
	
	Если ТипЗнч(РезультатЗапроса) = Тип("РезультатЗапроса") Тогда
		ИндивидуальныеЦены = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Или ТипЗнч(ИндивидуальныеЦены) <> Тип("ТаблицаЗначений") Тогда
		Элементы.ИндивидуальныеЦеныЕсть.Видимость = Ложь;
		Элементы.ИндивидуальныеЦеныОтсутствуют.Видимость = Истина;
		КабинетКлиентаКодКомпании = КонструкторМобильногоПриложения.КодКлиентаКомпанииСМаской(КодКомпании);
		Возврат
	КонецЕсли;
	
	ИндивидуальныеЦеныНайденныеСтрокиМассив = ИндивидуальныеЦены.НайтиСтроки(Новый Структура("Контрагент", Объект.Ссылка));
	
	Если ИндивидуальныеЦеныНайденныеСтрокиМассив.Количество() = 0 Тогда
		Элементы.ИндивидуальныеЦеныЕсть.Видимость = Ложь;
		Элементы.ИндивидуальныеЦеныОтсутствуют.Видимость = Истина;
		КабинетКлиентаКодКомпании = КонструкторМобильногоПриложения.КодКлиентаКомпанииСМаской(КодКомпании);
	Иначе
		Элементы.ИндивидуальныеЦеныОтсутствуют.Видимость = Ложь;
		Элементы.ИндивидуальныеЦеныЕсть.Видимость = Истина;
		НайденнаяСтрока = ИндивидуальныеЦеныНайденныеСтрокиМассив[0];
		КабинетКлиентаКодКлиента = КонструкторМобильногоПриложения.КодКлиентаКомпанииСМаской(НайденнаяСтрока.КодКлиента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГруппыКабинетКлиента()
	
	Если ИспользоватьПодсистемуМобильныйЛичныйКабинет = Ложь Тогда 
		Элементы.ГруппаКабинетКлиента.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьПодсистемуКаналыПродаж = Ложь Тогда 
		Элементы.ГруппаКабинетКлиента.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаКабинетКлиента.Видимость = Объект.Покупатель И (Элементы.КабинетКлиентаПодключен.Видимость Или Элементы.КабинетКлиентаНеПодключен.Видимость);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		
		Если Результат.Свойство("ИспользоватьБыструюФормуКонтрагентовВДокументах")
			И ИспользоватьБыструюФормуКонтрагентовВДокументах <> Результат.ИспользоватьБыструюФормуКонтрагентовВДокументах Тогда
			ИспользоватьБыструюФормуКонтрагентовВДокументах = Результат.ИспользоватьБыструюФормуКонтрагентовВДокументах;
			
			УстановитьНастройкуФормы(ИспользоватьБыструюФормуКонтрагентовВДокументах, "ИспользоватьБыструюФормуКонтрагентовВДокументах");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкуФормы(ЗначениеНастройки, ИмяНастройки)
	ПерсональныеНастройкиРУНФ.Установить(ЗначениеНастройки, ИмяНастройки,
		Пользователи.ТекущийПользователь());
КонецПроцедуры

#КонецОбласти

#КонецОбласти
