#Область СлужебныеПроцедурыИФункции

Функция ПеречисленияТипВсеСсылки() Экспорт
	
	Возврат РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ПеречисленияТипВсеСсылки();
	
КонецФункции

Функция ПолучитьИмяОткрываемойФормыПоТипу(ТипДокумента, ВариантОбработки) Экспорт
	
	ЭтоИнтерфейс85 = ИнтернетПоддержкаПользователейКлиентСервер.ЭтоИнтерфейс85();
	
	Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.ТОРГ12")
		Или ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.УПД")
		Или ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг")
		Или ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетФактура") Тогда
		
		Если ЭтоИнтерфейс85 Тогда
			ИмяФормы = "Обработка.ТОРГ12РаспознаваниеДокументов.Форма.Форма85";
		Иначе
			ИмяФормы = "Обработка.ТОРГ12РаспознаваниеДокументов.Форма.Форма";
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату") Тогда
		
		Если ЭтоИнтерфейс85 Тогда
			ИмяФормы = "Обработка.СчетНаОплатуРаспознаваниеДокументов.Форма.Форма85";
		Иначе
			ИмяФормы = "Обработка.СчетНаОплатуРаспознаваниеДокументов.Форма.Форма";
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.КассовыйЧек") Тогда
		
		Если ЭтоИнтерфейс85 Тогда
			ИмяФормы = "Обработка.КассовыйЧекРаспознаваниеДокументов.Форма.Форма85";
		Иначе
			ИмяФормы = "Обработка.КассовыйЧекРаспознаваниеДокументов.Форма.Форма";
		КонецЕсли;
		
	Иначе
		
		Если ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.ПоступлениеТоваров")
			Или ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.РеализацияТоваров") Тогда 
			
			Если ЭтоИнтерфейс85 Тогда
				ИмяФормы = "Обработка.ТОРГ12РаспознаваниеДокументов.Форма.Форма85";
			Иначе
				ИмяФормы = "Обработка.ТОРГ12РаспознаваниеДокументов.Форма.Форма";
			КонецЕсли;
			
		ИначеЕсли ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуПоставщика")
			Или ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуКлиента") Тогда
			
			Если ЭтоИнтерфейс85 Тогда
				ИмяФормы = "Обработка.СчетНаОплатуРаспознаваниеДокументов.Форма.Форма85";
			Иначе
				ИмяФормы = "Обработка.СчетНаОплатуРаспознаваниеДокументов.Форма.Форма";
			КонецЕсли;
			
		Иначе
			ИмяФормы = "Документ.РаспознанныйДокумент.Форма.ФормаДокументаСОшибкой";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИмяФормы;
	
КонецФункции

Функция ТипДокументаПоВариантуОбработки(ВариантОбработки) Экспорт
	
	Если ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуКлиента")
		Или ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуПоставщика") Тогда 
		
		ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату");
		
	Иначе
		ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.НеопознанныйДокумент");
	КонецЕсли;
	
	Возврат ТипДокумента;
	
КонецФункции

Функция НаправлениеПоВариантуОбработки(ВариантОбработки) Экспорт
	
	Если ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.ПоступлениеТоваров")
		Или ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуПоставщика") Тогда 
		
		Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Входящий");
		
	ИначеЕсли ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.РеализацияТоваров")
		Или ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуКлиента") Тогда
		
		Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий");
	Иначе
		Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Входящий");
	КонецЕсли;
	
	Возврат Направление;
	
КонецФункции

Функция ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2 = Ложь) Экспорт
	
	Возврат РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2);
	
КонецФункции

Функция ТипыПоИмениОпределяемогоТипа(ИмяОпределяемогоТипа) Экспорт
	
	Возврат РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ТипыПоИмениОпределяемогоТипа(ИмяОпределяемогоТипа);
	
КонецФункции

#КонецОбласти