#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	АдаптацияФормыТакси();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ИнтерфейсТакси = НЕ ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	Элементы.Переместить(Элементы.ОбщаяКомандаИсторияИзменений, Элементы.Список.КоманднаяПанель);
	
КонецПроцедуры

#КонецОбласти
