#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подобрать маршрут по показателям заявки
// 
// Параметры:
//  ДанныеЗаявки - Структура - данные заявки
// 
// Возвращаемое значение:
//  СправочникСсылка.МаршрутыСогласованияЗаявок, Неопределено - подобранный маршрут
//
Функция ПодобратьМаршрут(ДанныеЗаявки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПравилаМаршрутизацииЗаявок.ВидПоказателя КАК ВидПоказателя,
		|	ПравилаМаршрутизацииЗаявок.ВидСравнения КАК ВидСравнения,
		|	ПравилаМаршрутизацииЗаявок.ЗначениеДляСравнения КАК ЗначениеДляСравнения,
		|	ПравилаМаршрутизацииЗаявок.Маршрут КАК Маршрут
		|ИЗ
		|	РегистрСведений.ПравилаМаршрутизацииЗаявок КАК ПравилаМаршрутизацииЗаявок
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПравилаМаршрутизацииЗаявок.Маршрут.Приоритет УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидПоказателя = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.ВидОперации Тогда
			Результат = ПолучитьРезультатСравнения(ДанныеЗаявки.ВидОперации, Выборка.ВидСравнения, Выборка.ЗначениеДляСравнения);	
		ИначеЕсли Выборка.ВидПоказателя = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Автор Тогда
			Результат = ПолучитьРезультатСравнения(ДанныеЗаявки.Автор, Выборка.ВидСравнения, Выборка.ЗначениеДляСравнения);
		ИначеЕсли Выборка.ВидПоказателя = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Статья Тогда
			Результат = ПолучитьРезультатСравнения(ДанныеЗаявки.Статья, Выборка.ВидСравнения, Выборка.ЗначениеДляСравнения);
		ИначеЕсли Выборка.ВидПоказателя = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Сумма Тогда
			Результат = ПолучитьРезультатСравнения(ДанныеЗаявки.Сумма, Выборка.ВидСравнения, Выборка.ЗначениеДляСравнения);
		КонецЕсли;
		
		Если Результат = Истина Тогда
			Возврат Выборка.Маршрут;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить результат сравнения.
// 
// Параметры:
//  ЛевоеЗначение - Произвольный - Левое значение
//  ВидСравнения - Произвольный - Вид сравнения
//  ПравоеЗначение - Произвольный - Правое значение
// 
// Возвращаемое значение:
//  Булево - Результат сравнения
//
Функция ПолучитьРезультатСравнения(ЛевоеЗначение, ВидСравнения, ПравоеЗначение)
	
	Результат = Ложь;
	
	Если ВидСравнения = Перечисления.ВидСравненияЗначений.Больше Тогда
		Результат = (ЛевоеЗначение > ПравоеЗначение);
	ИначеЕсли ВидСравнения = Перечисления.ВидСравненияЗначений.БольшеИлиРавно Тогда
		Результат = (ЛевоеЗначение >= ПравоеЗначение);
	ИначеЕсли ВидСравнения = Перечисления.ВидСравненияЗначений.Меньше Тогда
		Результат = (ЛевоеЗначение < ПравоеЗначение);
	ИначеЕсли ВидСравнения = Перечисления.ВидСравненияЗначений.МеньшеИлиРавно Тогда
		Результат = (ЛевоеЗначение <= ПравоеЗначение);
	ИначеЕсли ВидСравнения = Перечисления.ВидСравненияЗначений.Равно Тогда
		Результат = (ЛевоеЗначение = ПравоеЗначение);
	Иначе // Не равно
		Результат = (ЛевоеЗначение <> ПравоеЗначение);
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецЕсли