// @strict-types
#Область ПрограммныйИнтерфейс

// Переопределяет формы подбора и параметры при их открытии.
// 
// Параметры:
//  ИмяКоманды - Строка - Команда, которая иницировала вызов процедуры
//  ФормаИмя - Строка - Например, "Обработка.ПодборТоваровПоОтбору.Форма"
//  ПараметрыФормы - Структура - Параметры открытия формы
Процедура ПриОпределенииФормыПодбораИПараметров(ИмяКоманды, ФормаИмя, ПараметрыФормы) Экспорт
	
	Если ИмяКоманды = "Подобрать" Тогда
		ФормаИмя = "Справочник.Номенклатура.ФормаСписка";
	КонецЕсли;
	ПараметрыФормы.Вставить("ИмяФормыВладельца", ФормаИмя);
	ПараметрыФормы.Вставить("ЭтоНачальнаяСтраница", Ложь);
	ПараметрыФормы.Вставить("ВалютаДокумента", УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	ПараметрыФормы.Вставить("ЭтоПодбор", Истина);
	ПараметрыФормы.Вставить("КнопкаПеренестиВДокументЗаголовок", "Перенести");

КонецПроцедуры

// Перед обработкой результата подбора товаров услуг.
// 
// Параметры:
//  РезультатПодбора - НастройкиКомпоновкиДанных, Структура - Результат подбора:
//   * АдресТоваровВХранилище - Строка - Адрес хранилища с таблицей товаров
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции
Функция ПередОбработкойРезультатаПодбораТоваровУслуг(РезультатПодбора) Экспорт
	Возврат Истина;
КонецФункции

#КонецОбласти
