#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьПараметры(Форма, ПереданныеПараметры, ПлатежнаяСистема_ВидыОплат) Экспорт
	
	ЗаполнитьЗначенияСвойств(Форма, ПереданныеПараметры);
	Форма.ПлатежнаяСистема_НоваяЗаявка = ПереданныеПараметры;
	
	#Если Клиент Тогда
	Если Не ПереданныеПараметры.ВидОперацииПродажа
		Или ПлатежнаяСистема_ВидыОплат.Количество() > 1 Тогда
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(Форма, "ГруппаОсновнаяСтраница");
	Иначе
		ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации", НСтр("ru = 'Инициализация платежной системы...'"));
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(Форма, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
	КонецЕсли;
	#КонецЕсли
	
	Если ЗначениеЗаполнено(Форма.ПлатежнаяСистема_НоваяЗаявка.ВидОплатыПлатежнойСистемы) Тогда
		ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.НастроитьФормуПоВидуОплаты(Форма, ПлатежнаяСистема_ВидыОплат);
	КонецЕсли;
	
	Форма.Элементы.ИдентификаторОплаты.Видимость = Не Форма.ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа
		И Не ЗначениеЗаполнено(Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторОплаты);
	
	Форма.Элементы.ГруппаАктивацияNFC.Видимость = Форма.АктивацияNFC И Форма.ИспользоватьКассовуюСсылку;
	
КонецПроцедуры

Функция ПараметрыИнициализации() Экспорт
	
	ПереданныеПараметры = Новый Структура;
	
	// обязательные параметры
	ПереданныеПараметры.Вставить("ИтогПоОрганизации",  0);
	ПереданныеПараметры.Вставить("СуммаОперации",      0);
	ПереданныеПараметры.Вставить("НомерДокумента",     "");
	ПереданныеПараметры.Вставить("Оплачивается",       Ложь);
	ПереданныеПараметры.Вставить("ИдентификаторПС",    "");
	ПереданныеПараметры.Вставить("Товары",             Новый Массив);
	ПереданныеПараметры.Вставить("СсылочныйНомер",     "");
	ПереданныеПараметры.Вставить("ВидОперацииПродажа", Истина);
	ПереданныеПараметры.Вставить("КассоваяСсылка",     Неопределено); // данные кассового qr-кода
	ПереданныеПараметры.Вставить("ОтменаЗаказа",       Неопределено); // данные для отмены заказа
	ПереданныеПараметры.Вставить("РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы", Ложь);
	ПереданныеПараметры.Вставить("ДокументОплаты");
	ПереданныеПараметры.Вставить("Интеграция");
	ПереданныеПараметры.Вставить("ВидОплатыПлатежнойСистемы");
	ПереданныеПараметры.Вставить("СпособОплатыПлатежнойСистемы");
	ПереданныеПараметры.Вставить("Магазин");
	
	// параметры оплаты через чек ККМ
	ПереданныеПараметры.Вставить("Организация");
	ПереданныеПараметры.Вставить("КассаККМ");
	ПереданныеПараметры.Вставить("КлючСвязиТПЧеков", 0);
	
	// параметры возврата
	ПереданныеПараметры.Вставить("ИдентификаторОплаты", "");
	ПереданныеПараметры.Вставить("ВидОплатыВозврата");
	ПереданныеПараметры.Вставить("ДокументВозврата");
	
	// интерфейс
	ПереданныеПараметры.Вставить("НадписьЗаголовок", "");
	ПереданныеПараметры.Вставить("ЦветТекстаЗаголовка");
	
	// служебные
	ПереданныеПараметры.Вставить("ОпределитьСтатусВозвратаПозже", Ложь);
	ПереданныеПараметры.Вставить("ОпределитьСтатусОплатыПозже",   Ложь);
	ПереданныеПараметры.Вставить("НастройкиФормыИнтеграции",      Новый Структура());
	ПереданныеПараметры.Вставить("НастройкиИнтеграции",           НовыйНастройкиТорговойТочки());
	ПереданныеПараметры.Вставить("ТипПлатежнойСистемы");
	ПереданныеПараметры.Вставить("ИдентификаторQRКода");
	ПереданныеПараметры.Вставить("КартинкаQRКода");
	ПереданныеПараметры.Вставить("ДанныеQRКода");
	ПереданныеПараметры.Вставить("ИдентификаторЗаданияВозврата");
	ПереданныеПараметры.Вставить("ИдентификаторЗаданияПроверкиСтатуса");
	ПереданныеПараметры.Вставить("ИдентификаторЗаданияФормированияQRКода");
	ПереданныеПараметры.Вставить("ИдентификаторЗаданияОтменаЗаказа");
	ПереданныеПараметры.Вставить("БылоПодтверждениеКодомАдминистратора", Ложь);
	ПереданныеПараметры.Вставить("БылоПодтверждениеПлатежнойСистемы", Ложь);
	ПереданныеПараметры.Вставить("ПодключаемоеОборудование");
    ПереданныеПараметры.Вставить("АвтономнаяККТ", Ложь);
	
	// устаревшие параметры
	ПереданныеПараметры.Вставить("ВидОперации");
	ПереданныеПараметры.Вставить("КраткоеПредставлениеКоманд", Истина); // устаревший параметр
	
	Возврат ПереданныеПараметры;
	
КонецФункции

Функция НовыйНастройкиТорговойТочки() Экспорт
	
	Операции = Новый Структура;
	Операции.Вставить("ОтменаЗаказа",                   Ложь);
	Операции.Вставить("ОтменаОплаты",                   Ложь);
	Операции.Вставить("СрокЖизниQRКода",                Ложь);
	Операции.Вставить("ПлатежнаяСсылка",                Ложь);
	Операции.Вставить("ВыборПлатежнойСистемыВозврата",  Ложь);
	Операции.Вставить("ПлатежныеСистемыВозврата",       Неопределено);
	Операции.Вставить("КассовыеСсылки",                 Ложь);
	Операции.Вставить("Идентификатор",                  Ложь);
	Операции.Вставить("СинонимСистемы",                 Ложь);
	Операции.Вставить("Используется",                   Ложь);
	Операции.Вставить("РазрешенВозврат",                Истина);
	Операции.Вставить("ЗаписыватьДокументПередОплатой", Ложь);
	Операции.Вставить("ПодключениеКассовойСсылки",      Ложь);
	Операции.Вставить("ОтменаЗаказаДанные",             Неопределено); // данные для отмены заказа
	Операции.Вставить("НастройкиКассовойСсылки",        Неопределено);
	
	Возврат Операции;
	
КонецФункции

Функция СтрокаТоваров() Экспорт
	
	ТоварыУслуги = Новый Структура;
	ТоварыУслуги.Вставить("Артикул");
	ТоварыУслуги.Вставить("Наименование");
	ТоварыУслуги.Вставить("ЕдиницаИзмерения");
	ТоварыУслуги.Вставить("Количество");
	ТоварыУслуги.Вставить("Цена");
	ТоварыУслуги.Вставить("Сумма");
	ТоварыУслуги.Вставить("СуммаСкидки");
	
	Возврат ТоварыУслуги;
	
КонецФункции

Функция ТекущаяСтраница(Страница, ТекущийСлой = "") Экспорт
	
	РезультатФункции = Ложь;
	Если ТекущийСлой = "" Тогда
		РезультатФункции = (Страница.Родитель.ТекущаяСтраница = Страница);
	Иначе
		РезультатФункции = (Страница = ТекущийСлой);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УстановитьТекущуюСтраницу(Страница) Экспорт
	
	Страница.Родитель.ТекущаяСтраница             = Страница;
	Страница.Родитель.ТекущаяСтраница.Доступность = Истина;
	
КонецПроцедуры

Процедура НастроитьФормуПоВидуОплаты(Форма, ВидыОплатОрганизации) Экспорт
	
	ПараметрыВидаОплат = Новый Структура;
	КлючПоиска         = Новый Структура("ИдентификаторПС", Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторПС);
	
	СтрокиОплаты = ВидыОплатОрганизации.НайтиСтроки(КлючПоиска);
	
	ПараметрыВидаОплат.Вставить("Интеграция",          СтрокиОплаты[0].Интеграция);
	ПараметрыВидаОплат.Вставить("ТипПлатежнойСистемы", СтрокиОплаты[0].ПлатежнаяСистема);
	
	НастройкиИнтеграции = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.НастройкиТорговойТочки(
		СтрокиОплаты[0].Интеграция,
		Форма.ПлатежнаяСистема_НоваяЗаявка.КассаККМ);
	
	Если НастройкиИнтеграции.КассовыеСсылки
		И НастройкиИнтеграции.НастройкиКассовойСсылки <> Неопределено
		И НастройкиИнтеграции.НастройкиКассовойСсылки.ИспользоватьКассовыйQRКодСБП
		И ЗначениеЗаполнено(Форма.ПлатежнаяСистема_НоваяЗаявка.СпособОплатыПлатежнойСистемы) Тогда
		
		СпособОплаты   = Форма.ПлатежнаяСистема_НоваяЗаявка.СпособОплатыПлатежнойСистемы;
		КассоваяСсылка = НастройкиИнтеграции.НастройкиКассовойСсылки.СпособыОплаты.Получить(СпособОплаты);
		Форма.ИспользоватьКассовуюСсылку = ЗначениеЗаполнено(КассоваяСсылка);
		
	КонецЕсли;
	
	ПараметрыВидаОплат.Вставить("НастройкиИнтеграции", НастройкиИнтеграции);
	
	ЗаполнитьЗначенияСвойств(Форма.ПлатежнаяСистема_НоваяЗаявка, ПараметрыВидаОплат);
	
	Если Не Форма.ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа Тогда
		
		Форма.Элементы.ПлатежнаяСистема_БанкКлиента.СписокВыбора.Очистить();
		
		Если НастройкиИнтеграции.ВыборПлатежнойСистемыВозврата Тогда
			
			Для Каждого КлючЗначение Из НастройкиИнтеграции.ПлатежныеСистемыВозврата Цикл
				
				Форма.Элементы.ПлатежнаяСистема_БанкКлиента.СписокВыбора.Добавить(
					КлючЗначение.Ключ,
					КлючЗначение.Значение);
					
				Форма.Элементы.ПлатежнаяСистема_БанкКлиента.СписокВыбора.СортироватьПоПредставлению();
				
			КонецЦикла;
			
		КонецЕсли;
		
		Форма.Элементы.ПлатежнаяСистема_БанкКлиента.Видимость =
			Форма.Элементы.ПлатежнаяСистема_БанкКлиента.СписокВыбора.Количество() > 0;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьФормуПоИнтеграции(Форма, Знач ОписаниеОшибки = "", Знач ТекстДлительнойОперации = "") Экспорт
	
	Элементы = Форма.Элементы;
	
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаИнструкция,         Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаПречек,             Ложь);
	
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаСоздатьQRКод,       Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаВозвратПлатежа,     Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьВозврат, Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаПовторить,          Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьОплату,  Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтменитьОплату,     Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтложить,           Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаЗакрытьОплату,      Ложь);
	
	Форма.ТекущийЭлемент = Элементы.ДекорацияПустаяСлужебная;
	
	ТекущийСлойГруппы = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьТекущийСлойГруппы(
		Элементы.ГруппаСлоевПанелиДействийПлатежнойСистемы);
	
	Если Не ТекущаяСтраница(Элементы.ГруппаОшибка, ТекущийСлойГруппы) Тогда
		ЭтоПродажа             = Форма.ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа;
		ИстеклоВремяОжидания   = Форма.ИстеклоВремяОжидания;
		Оплачивается           = Форма.ПлатежнаяСистема_НоваяЗаявка.Оплачивается;
		ПраваАдминистратора    = Форма.ПлатежнаяСистема_НоваяЗаявка.РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы;
		РежимКСО               = Форма.РежимКСО;
		ФормаОтложитьДоступно  = Не Форма.ЗапретитьОткладывание И ПраваАдминистратора И ЭтоПродажа;
		ЗапретитьЗакрытие      = Не ЭтоПродажа И РежимКСО;
		Форма.ОтображатьКнопкуЗакрытия = Не ЗапретитьЗакрытие;
		ОткрытоБлокирующееОкно = Элементы.ГруппаВопросПредупреждение.Видимость
			Или Элементы.ГруппаВопросОтложитьЧек.Видимость
			Или Элементы.ГруппаПодтверждениеОплатыВозврата.Видимость;
	КонецЕсли;
	
	Если ТекущаяСтраница(Элементы.ГруппаОсновнаяСтраница, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ГруппаПродажа, ЭтоПродажа);
		УстановитьВидимостьЭлементаФормы(Элементы.ГруппаВозврат, НЕ ЭтоПродажа);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаЗакрытьОплату, Не ЗапретитьЗакрытие);
		
		Если ЭтоПродажа Тогда
			УстановитьВидимостьЭлементаФормы(Элементы.ФормаСоздатьQRКод, Истина);
			Элементы.ФормаСоздатьQRКод.Важность = ВажностьКнопки.Главная;
		Иначе
			УстановитьВидимостьЭлементаФормы(Элементы.ФормаВозвратПлатежа, Истина);
			Элементы.ФормаВозвратПлатежа.Важность = ВажностьКнопки.Главная;
			Элементы.ФормаВозвратПлатежа.Доступность = ЗначениеЗаполнено(Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторОплаты);
			СуммаОперации = Формат(Форма.СуммаКОплате, "ЧДЦ=2; ЧН=0,00");
			ОписаниеВозврата = СтрШаблон(НСтр("ru = 'Сумма к возврату: %1 %2'"), СуммаОперации, Форма.ВалютаПредставление);
			Элементы.ДекорацияСуммаКВозврату.Заголовок = ОписаниеВозврата;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаДлительнаяОперация, ТекущийСлойГруппы) Тогда
		
		Если ЗначениеЗаполнено(ТекстДлительнойОперации) Тогда
			Элементы.ДекорацияНадписьДлительнаяОперация.Заголовок = ТекстДлительнойОперации;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаQRКод, ТекущийСлойГруппы)
		И Не ОткрытоБлокирующееОкно Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаИнструкция, Истина);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаПречек,     Не РежимКСО);
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтменитьОплату, Истина);
		
		Если ИстеклоВремяОжидания Тогда
			Если ПраваАдминистратора Тогда
				УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьОплату, Истина);
				Элементы.ФормаПодтвердитьОплату.Важность = ВажностьКнопки.Главная;
			КонецЕсли;
			УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтложить, ФормаОтложитьДоступно);
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаИнструкция, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаИнструкция, Истина);
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаПодтверждениеВозврата, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаЗакрытьОплату, Истина);
		Элементы.ФормаЗакрытьОплату.Важность = ВажностьКнопки.Главная;
		
		Если ПраваАдминистратора Тогда
			УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьВозврат, Истина);
			Элементы.ФормаПодтвердитьВозврат.Важность = ВажностьКнопки.Главная;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаИстеклоВремяОжидания, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаПовторить, Истина);
		Элементы.ФормаПовторить.Важность = ВажностьКнопки.Главная;
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьОплату, ПраваАдминистратора);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтменитьОплату, Истина);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтложить, ФормаОтложитьДоступно);
		
		Элементы.ДекорацияНадписьВыполняется.Заголовок = ?(ЭтоПродажа,
			НСтр("ru = 'Платежная система не подтвердила оплату.'"),
			НСтр("ru = 'Платежная система не подтвердила возврат.'"));
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаОшибка, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаЗакрытьОплату, Истина);
		Элементы.ФормаЗакрытьОплату.Важность = ВажностьКнопки.Главная;
		
		Элементы.ДекорацияОписаниеОшибки.Заголовок = ?(ЗначениеЗаполнено(ОписаниеОшибки),
			ОписаниеОшибки, НСтр("ru = 'Неизвестная ошибка'"));
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаОшибкаПолученияСтатуса, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаПовторить,      Истина);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтменитьОплату, Истина);
		Элементы.ФормаПовторить.Важность = ВажностьКнопки.Главная;
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьОплату, ПраваАдминистратора);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтложить, ФормаОтложитьДоступно);
		
		Элементы.ДекорацияОписаниеОшибкиПолученияСтатуса.Заголовок = ?(ЗначениеЗаполнено(ОписаниеОшибки),
			ОписаниеОшибки, НСтр("ru = 'Неизвестная ошибка'"));
		
	КонецЕсли;
	
	Если ТекущийСлойГруппы <> Неопределено
		И Не ТекущаяСтраница(Элементы.ГруппаИнструкция, ТекущийСлойГруппы) Тогда
		Форма.ТекущийСлойГруппы = ТекущийСлойГруппы.Имя;
	КонецЕсли;
	
КонецПроцедуры

Функция ВидПлатежнойКартыСБП() Экспорт
	
	Возврат НСтр("ru = 'Система быстрых платежей'");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьВидимостьЭлементаФормы(Элемент, Видимость) Экспорт
	
	Элемент.Видимость = Видимость;
	
КонецПроцедуры

#КонецОбласти

