#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5 Тогда
		
		Элементы.ИспользоватьУПД.Заголовок = НСтр("ru='УПД'");
		Элементы.ИспользоватьУКД.Заголовок = НСтр("ru='УКД'");
		Элементы.ЭтоИнтеркампани.Заголовок = НСтр("ru='Интеркампани'");
		Элементы.ЭтоПрямойОбмен.Заголовок = НСтр("ru='Прямой обмен'");
		
		Элементы.Список.ПутьКДаннымКартинкиСтроки = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные.ЭтоПрямойОбмен Тогда
		ПараметрыФормы = НастройкиОтправкиЭДОКлиент.НовыеПараметрыФормыНастройкиПрямогоОбмена();
		ПараметрыФормы.Организация = Элемент.ТекущиеДанные.Отправитель;
		ПараметрыФормы.Контрагент = Элемент.ТекущиеДанные.Получатель;
		ПараметрыФормы.Договор = Элемент.ТекущиеДанные.Договор;
		НастройкиОтправкиЭДОКлиент.ОткрытьНастройкуПрямогоОбмена(ПараметрыФормы);
	ИначеЕсли Элемент.ТекущиеДанные.ЭтоИнтеркампани Тогда 
		ПараметрыФормы = НастройкиОтправкиЭДОКлиент.НовыеПараметрыФормыНастроекИнтеркампани();
		ПараметрыФормы.Отправитель = Элемент.ТекущиеДанные.Отправитель;
		ПараметрыФормы.Получатель = Элемент.ТекущиеДанные.Получатель;
		НастройкиОтправкиЭДОКлиент.ОткрытьНастройкуИнтеркампани(ПараметрыФормы);
	Иначе
		ПараметрыФормы = НастройкиОтправкиЭДОКлиент.НовыеПараметрыФормыНастроекОтправки();
		ПараметрыФормы.КлючНастроекОтправки.Отправитель = Элемент.ТекущиеДанные.Отправитель;
		ПараметрыФормы.КлючНастроекОтправки.Получатель = Элемент.ТекущиеДанные.Получатель;
		ПараметрыФормы.КлючНастроекОтправки.Договор = Элемент.ТекущиеДанные.Договор;
		НастройкиОтправкиЭДОКлиент.ОткрытьНастройкуОтправки(ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


