
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовДляИнтерфейса85();
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	ТекущаяДата = ТекущаяУниверсальнаяДата();
	
	Если Запись.ДатаНедоступнаДоУниверсальная < ТекущаяДата Тогда
		
		Элементы.СтраницыСтатусПлощадки.ТекущаяСтраница = Элементы.СтраницаПлощадкаДоступна;
		Активна                                         = Истина;
		
	Иначе
		
		Элементы.СтраницыСтатусПлощадки.ТекущаяСтраница = Элементы.СтраницаПлощадкаЗаблокирована;
		
		ШаблонНадписи = НСтр("ru = 'Площадка недоступна до %1.'");
		
		Если НачалоДня(Запись.ДатаНедоступнаДоУниверсальная) = НачалоДня(ТекущаяДата) Тогда
			ДатаНедоступности = Формат(МестноеВремя(Запись.ДатаНедоступнаДоУниверсальная), "ДФ=HH:mm:ss;");
		Иначе
			ДатаНедоступности = Формат(МестноеВремя(Запись.ДатаНедоступнаДоУниверсальная), "ДФ='dd.MM.yyyy HH:mm:ss';");
		КонецЕсли;
		
		Элементы.НадписьСтатусПлощадкиПлощадкиНедоступна.Заголовок = СтрШаблон(ШаблонНадписи, Формат(ДатаНедоступности));
		Активна                                                    = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовДляИнтерфейса85()
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85();
	
	Элементы.ИнформацияКартинкаПлощадкаДоступна.Видимость      = Не ЭтоИнтерфейс85;
	Элементы.ИнформацияКартинкаПлощадкаЗаблокирована.Видимость = Не ЭтоИнтерфейс85;
	
	ОформляемыеГруппыФормы = ОбщегоНазначенияИС.НоваяСтруктураОформляемыхГруппФормы();
	ОформляемыеГруппыФормы.Успешно = "ГруппаПлощадкаДоступна";
	ОбщегоНазначенияИС.УстановитьОформлениеГруппФормы(ЭтотОбъект, ОформляемыеГруппыФормы, Ложь);
	
	ОформляемыеГруппыФормы = ОбщегоНазначенияИС.НоваяСтруктураОформляемыхГруппФормы();
	ОформляемыеГруппыФормы.Ошибка = "ГруппаПлощадкаЗаблокирована";
	ОбщегоНазначенияИС.УстановитьОформлениеГруппФормы(ЭтотОбъект, ОформляемыеГруппыФормы, Ложь);
	
КонецПроцедуры

#КонецОбласти
