#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьИПроверитьПереданныеПараметры();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НавигационнаяСсылкаРезультат = НавигационнаяСсылкаФорматированнойСтроки;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы И ЗначениеЗаполнено(НавигационнаяСсылкаРезультат) Тогда
		СобытияФормИСКлиент.ОбработкаНавигационнойСсылки(ВладелецФормы, НавигационнаяСсылкаРезультат, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьИПроверитьПереданныеПараметры()
	
	Индекс = 0;
	Для Каждого ОписаниеСтроки Из Параметры.НавигационныеСтроки Цикл
		Если ЗначениеЗаполнено(ОписаниеСтроки.Текст) Тогда
			ИмяПоля = СтрШаблон("ФорматированнаяСтрока%1Текст", Индекс);
			ИмяКартинки = СтрШаблон("ФорматированнаяСтрока%1Картинка", Индекс);
			Элементы[ИмяПоля].Видимость = Истина;
			ЭтотОбъект[ИмяПоля] = ОписаниеСтроки.Текст;
			СтрокВГиперссылке = СтрЧислоВхождений(Строка(ОписаниеСтроки.Текст), Символы.ПС) + 1;
			Элементы[ИмяПоля].МаксимальнаяВысота = СтрокВГиперссылке;
			Элементы[ИмяПоля].Высота = СтрокВГиперссылке;
			Индекс = Индекс + 1;
			Элементы[ИмяКартинки].Видимость = Истина;
			Элементы[ИмяКартинки].Картинка = ОписаниеСтроки.Картинка;
		КонецЕсли;
	КонецЦикла;
	
	Заголовок = Параметры.Заголовок;
	
КонецПроцедуры

#КонецОбласти
