
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ДатаДокумента = Объект.Дата;
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Компания = Константы.УчетПоКомпании.Компания(Объект.Организация);
	ВалютаПоУмолчанию = Константы.НациональнаяВалюта.Получить();
	
	ОписаниеРежимовПросмотра = ОписаниеПереключенияРежимов();
	ОписаниеРежимовПросмотра.Сотрудники.ИмяСтраницы = Элементы.СтраницаТолькоСотрудники.Имя;
	ОписаниеРежимовПросмотра.Сотрудники.ИмяТаблицыСотрудники = Элементы.Сотрудники.Имя;
	ОписаниеРежимовПросмотра.НачисленияУдержания.ИмяСтраницы = Элементы.СтраницаНачисленияУдержания.Имя;
	ОписаниеРежимовПросмотра.НачисленияУдержания.ИмяТаблицыСотрудники = Элементы.СотрудникиНачислений.Имя;
	ОписаниеРежимовПросмотра.Налоги.ИмяСтраницы = Элементы.СтраницаНалоги.Имя;
	ОписаниеРежимовПросмотра.Налоги.ИмяТаблицыСотрудники = Элементы.СотрудникиНалоги.Имя;
	
	ИмяТабличнойЧасти = ОписаниеРежимовПросмотра.Сотрудники.ИмяТаблицыСотрудники;
	РежимПросмотраСотрудники = ОписаниеРежимовПросмотра.Сотрудники.СписокЗначение;
	РежимПросмотраСотрудникиПредыдущий = РежимПросмотраСотрудники;
	ОбновитьОписаниеРежимов(ОписаниеРежимовПросмотра, РежимПросмотраСотрудники,
		Объект.НачисленияУдержания.Количество(), Объект.НалогиНаДоходы.Количество());
		
	Элементы.РежимПросмотраСотрудники.СписокВыбора.Очистить();
	Элементы.РежимПросмотраСотрудники.СписокВыбора.Добавить(ОписаниеРежимовПросмотра.Сотрудники.СписокЗначение,
		ОписаниеРежимовПросмотра.Сотрудники.СписокПредставление);
	Элементы.РежимПросмотраСотрудники.СписокВыбора.Добавить(ОписаниеРежимовПросмотра.НачисленияУдержания.СписокЗначение,
		ОписаниеРежимовПросмотра.НачисленияУдержания.СписокПредставление);
		
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСовместительство") Тогда
		
		Если Элементы.Найти("СотрудникиСотрудникКод") <> Неопределено Тогда
			
			Элементы.СотрудникиСотрудникКод.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗначениеНастройки = ПерсональныеНастройкиРУНФ.Прочитать("ОсновноеПодразделение");
	ОсновноеПодразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки,
		Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	
	УчетНалогов = ПолучитьФункциональнуюОпцию("ВестиУчетНалогаНаДоходыИВзносов");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТекущийСотрудникНалоги", "Видимость",
		УчетНалогов);
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
	ИзменитьОтображениеПодсказки(Элементы, Не ЗначениеЗаполнено(Объект.Ссылка) И ПолучитьФункциональнуюОпцию(
		"ИспользоватьОтчетность"));
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект); 
	
	УстановитьЗначениеДополнительныхРеквизитовТабличныхЧастей();
	
	УстановитьВидимостьВкладок();
	
	УстановитьУсловноеОформлениеФормы();
	
	ИспользоватьМногофирменныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Если Не ИспользоватьМногофирменныйУчет И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Организация.Гиперссылка = Истина;
	КонецЕсли;
	
	АдаптацияФормыТакси();
	АдаптацияМобильныйКлиент();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ОбратнаяСвязь
	ОбратнаяСвязь.ПередЗаписьюДокумента(Отказ, ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);
	// Конец ОбратнаяСвязь
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Оповестить("ИзменениеПоКадровомуУчету");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_Организации" И Источник = Объект.Организация Тогда
		УстановитьВидимостьВкладок();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьДоступностьПолейСуммы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДанныеДляИзмененияДаты = ДокументыУНФКлиент.ДанныеДляИзмененияДаты(ЭтотОбъект, Объект);
	Если ДанныеДляИзмененияДаты.ДатаНеМенялась Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПереходСЗВТДНажатие(Элемент)
	
	ОткрытьФорму("Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРеквизитыПечатиНажатие(Элемент)
	
	ОткрытьФормуРеквизитыПечати();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗакрытьПодсказкуНажатие(Элемент)
	
	ИзменитьОтображениеПодсказки(Элементы, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура РежимПросмотраСотрудникиПриИзменении(Элемент)
	
	ОписаниеПредыдущее = ОписаниеРежимовПросмотра[РежимПросмотраСотрудникиПредыдущий];
	
	ТекущаяСтрока = Элементы[ОписаниеПредыдущее.ИмяТаблицыСотрудники].ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		Элементы.Сотрудники.ТекущаяСтрока = ТекущаяСтрока;
		Элементы.СотрудникиНачислений.ТекущаяСтрока = ТекущаяСтрока;
		Элементы.СотрудникиНалоги.ТекущаяСтрока = ТекущаяСтрока;
	КонецЕсли;
	РежимПросмотраСотрудникиПредыдущий = РежимПросмотраСотрудники;
	
	ОписаниеТекущее = ОписаниеРежимовПросмотра[РежимПросмотраСотрудники];
	Элементы.СтраницыСотрудники.ТекущаяСтраница = Элементы[ОписаниеТекущее.ИмяСтраницы];
	
	ОбновитьЭлементРежимПросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыСотрудникиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОткрытыйРежим = "";
	Для Каждого Режим Из ОписаниеРежимовПросмотра Цикл
		Если ТекущаяСтраница.Имя = Режим.Значение.ИмяСтраницы Тогда
			ОткрытыйРежим = Режим.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОткрытыйРежим) И ОткрытыйРежим <> РежимПросмотраСотрудники Тогда
		РежимПросмотраСотрудники = ОткрытыйРежим;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийСвернутоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	
	ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, "НачисленияУдержания");
	ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, "НалогиНаДоходы");
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ИмяТабличнойЧасти = "Сотрудники";	
	Если НоваяСтрока Тогда
		
		ТабличныеЧастиУНФКлиент.ДобавитьКлючСвязиВСтрокуТабличнойЧасти(ЭтотОбъект);
		ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, "НачисленияУдержания");
		ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, "НалогиНаДоходы");
		
		СтрокаТабличнойЧасти = Элементы.Сотрудники.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтруктурнаяЕдиница) Тогда
			
			СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередУдалением(Элемент, Отказ)

	ИмяТабличнойЧасти = "Сотрудники";
	Для Каждого ВыделеннаяСтрока Из Элементы.Сотрудники.ПолучитьСтрокиДляОбработки() Цикл
		ТекущиеДанныеСтроки = Элементы.Сотрудники.ДанныеСтроки(ВыделеннаяСтрока);
		ТабличныеЧастиУНФКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтотОбъект, "НачисленияУдержания", Ложь,
			ТекущиеДанныеСтроки);
		ТабличныеЧастиУНФКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтотОбъект, "НалогиНаДоходы", Ложь,
			ТекущиеДанныеСтроки);
	КонецЦикла;

	ОбновитьЭлементРежимПросмотра();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	Элементы.Сотрудники.ТекущиеДанные.ЗанимаемыхСтавок = 1;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисленияУдержания

&НаКлиенте
Процедура НачисленияУдержанияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТабличныеЧастиУНФКлиент.ДобавитьКлючСвязиВСтрокуПодчиненнойТабличнойЧасти(ЭтотОбъект, Элемент.Имя);
		СтрокаТабличнойЧасти = Элементы.НачисленияУдержания.ТекущиеДанные;
		СтрокаТабличнойЧасти.Валюта = ВалютаПоУмолчанию;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
#Если МобильныйКлиент Тогда
	Если НеВыбранаСтрокаСотрудника(Элемент.Имя) Тогда
		Отказ = Истина;
	КонецЕсли; 
#Иначе	
	Если ТабличныеЧастиУНФКлиент.НеВыбранаСтрокаОсновнойТЧ(ЭтотОбъект, Элемент.Имя) Тогда
		Отказ = Истина;
	КонецЕсли; 
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияВидНачисленияУдержанияПриИзменении(Элемент)
	
	ЗарплатаИПерсоналКлиент.СчетЗатратПоУмолчаниюВТекущуюСтроку(ЭтотОбъект);
	УстановитьДоступностьПоляСумма();
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияСчетЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаИПерсоналКлиент.ПараметрыВыбораСчетаЗатрат(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНалогиНаДоходы

&НаКлиенте
Процедура НалогиНаДоходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТабличныеЧастиУНФКлиент.ДобавитьКлючСвязиВСтрокуПодчиненнойТабличнойЧасти(ЭтотОбъект, Элемент.Имя);
		СтрокаТабличнойЧасти = Элементы.НалогиНаДоходы.ТекущиеДанные;
		СтрокаТабличнойЧасти.Валюта = ВалютаПоУмолчанию;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НалогиНаДоходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
#Если МобильныйКлиент Тогда
	Если НеВыбранаСтрокаСотрудника(Элемент.Имя) Тогда
		Отказ = Истина;
	КонецЕсли; 
#Иначе	
	Если ТабличныеЧастиУНФКлиент.НеВыбранаСтрокаОсновнойТЧ(ЭтотОбъект, Элемент.Имя) Тогда
		Отказ = Истина;
	КонецЕсли; 
#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудникиНачислений

&НаКлиенте
Процедура СотрудникиНачисленийПриАктивизацииСтроки(Элемент)
	ИмяТабличнойЧасти = Элементы.СотрудникиНачислений.Имя;
	ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, Элементы.НачисленияУдержания.Имя);
	
	Если ЭтоМобильныйКлиент И Элемент.ТекущиеДанные <> Неопределено Тогда
		Элементы.ГруппаТаблицаНачисления.Заголовок = СтрШаблон(НСтр("ru = 'Начисления и удержания сотрудника ""%1""'"),
			Элемент.ТекущиеДанные.Сотрудник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиНачисленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если ЭтоМобильныйКлиент Тогда
		Элементы.СотрудникиНачислений.Видимость = Ложь;
		Элементы.ВыбратьСотрудникаНачислений.Видимость = Истина;
		Элементы.ГруппаТаблицаНачисления.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудникиНалоги

&НаКлиенте
Процедура СотрудникиНалогиПриАктивизацииСтроки(Элемент)
	ИмяТабличнойЧасти = Элементы.СотрудникиНалоги.Имя;
	ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, Элементы.НалогиНаДоходы.Имя);
	
	Если ЭтоМобильныйКлиент И Элемент.ТекущиеДанные <> Неопределено Тогда
		Элементы.ГруппаТаблицаНалоги.Заголовок = СтрШаблон(НСтр("ru = 'Налоги сотрудника ""%1""'"),
			Элемент.ТекущиеДанные.Сотрудник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиНалогиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если ЭтоМобильныйКлиент Тогда
		Элементы.СотрудникиНалоги.Видимость = Ложь;
		Элементы.ВыбратьСотрудникаНалоги.Видимость = Истина;
		Элементы.ГруппаТаблицаНалоги.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьКомментарий(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСотрудникаНачислений(Команда)
	
	Элементы.СотрудникиНачислений.Видимость = Истина;
	Элементы.ВыбратьСотрудникаНачислений.Видимость = Ложь;
	Элементы.ГруппаТаблицаНачисления.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСотрудникаНалоги(Команда)

	Элементы.СотрудникиНалоги.Видимость = Истина;
	Элементы.ВыбратьСотрудникаНалоги.Видимость = Ложь;
	Элементы.ГруппаТаблицаНалоги.Видимость = Ложь;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();

	Если ЭтоИнтерфейсТакси Тогда
		Элементы.Комментарий.КнопкаВыбора = Истина;
		Элементы.ПодвалСвернут.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	МобильныйКлиентУНФ.НастроитьФормуОбъектаМобильныйКлиент(Элементы);
	
	Элементы.СотрудникиНачислений.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Элементы.СотрудникиНачислений.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	Элементы.ГруппаТаблицаНачисления.ОтображатьЗаголовок = Истина;
	Элементы.ГруппаТаблицаНачисления.Видимость = Ложь;
	
	Элементы.СотрудникиНалоги.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Элементы.СотрудникиНалоги.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	Элементы.ГруппаТаблицаНалоги.ОтображатьЗаголовок = Истина;
	Элементы.ГруппаТаблицаНалоги.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКоманду(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты)
	
	ДокументыУНФ.ДатаПриИзменении(ДанныеДляИзмененияДаты, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ДокументыУНФ.ОрганизацияПриИзменении(ЭтотОбъект, Объект);
	УстановитьВидимостьВкладок();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВкладок()
	
	СдаетсяОтчетность = Ложь;
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		СдаетсяОтчетность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ИспользуетсяОтчетность");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаНалоги",
		"Видимость", НЕ СдаетсяОтчетность);
	
	ОписаниеНалоги = ОписаниеРежимовПросмотра.Налоги;
	ЭлементНалоги = Элементы.РежимПросмотраСотрудники.СписокВыбора.НайтиПоЗначению(ОписаниеНалоги.СписокЗначение);
	Если СдаетсяОтчетность И ЭлементНалоги <> Неопределено Тогда
		Элементы.РежимПросмотраСотрудники.СписокВыбора.Удалить(ЭлементНалоги);
	КонецЕсли;
	Если НЕ СдаетсяОтчетность И ЭлементНалоги = Неопределено Тогда
		Элементы.РежимПросмотраСотрудники.СписокВыбора.Добавить(ОписаниеНалоги.СписокЗначение,
			ОписаниеНалоги.СписокПредставление);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеПереключенияРежимов()
	
	ОписаниеРежима = Новый Структура;
	ОписаниеРежима.Вставить("ИмяСтраницы", "");
	ОписаниеРежима.Вставить("ИмяТаблицыСотрудники", "");
	ОписаниеРежима.Вставить("Заголовок", "");
	ОписаниеРежима.Вставить("СписокЗначение", "");
	ОписаниеРежима.Вставить("СписокПредставление", "");
	ОписаниеРежима.Вставить("ОтображатьКоличествоНачисления", Истина);
	ОписаниеРежима.Вставить("ОтображатьКоличествоНалоги", Истина);
	
	ШаблонОписания = Новый ФиксированнаяСтруктура(ОписаниеРежима);
	
	Результат = Новый Структура;
	
	КлючСотрудники = "Сотрудники";
	Результат.Вставить(КлючСотрудники, Новый Структура(ШаблонОписания));
	Результат.Сотрудники.СписокЗначение = КлючСотрудники;
	Результат.Сотрудники.Заголовок = НСтр("ru = 'Сотрудники'");
	Результат.Сотрудники.СписокПредставление = Результат.Сотрудники.Заголовок;
	
	КлючНачисления = "НачисленияУдержания";
	Результат.Вставить(КлючНачисления, Новый Структура(ШаблонОписания));
	Результат.НачисленияУдержания.СписокЗначение = КлючНачисления;
	Результат.НачисленияУдержания.Заголовок = НСтр("ru = 'Начисления и удержания сотрудников'");
	Результат.НачисленияУдержания.Вставить("ОтображатьКоличествоНачисления", Ложь);
	
	КлючНалоги = "Налоги";
	Результат.Вставить(КлючНалоги, Новый Структура(ШаблонОписания));
	Результат.Налоги.СписокЗначение = "Налоги";
	Результат.Налоги.Заголовок = НСтр("ru = 'Налоги сотрудников'");
	Результат.Налоги.Вставить("ОтображатьКоличествоНалоги", Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЭлементРежимПросмотра()
	ОбновитьОписаниеРежимов(ОписаниеРежимовПросмотра, РежимПросмотраСотрудники,
		Объект.НачисленияУдержания.Количество(), Объект.НалогиНаДоходы.Количество());
		
	ЭлементНачисления = Элементы.РежимПросмотраСотрудники.СписокВыбора.НайтиПоЗначению(
		ОписаниеРежимовПросмотра.НачисленияУдержания.СписокЗначение);
	Если ЭлементНачисления <> Неопределено Тогда
		ЭлементНачисления.Представление = ОписаниеРежимовПросмотра.НачисленияУдержания.СписокПредставление;
	КонецЕсли;
	
	ЭлементНалоги = Элементы.РежимПросмотраСотрудники.СписокВыбора.НайтиПоЗначению(
		ОписаниеРежимовПросмотра.Налоги.СписокЗначение);
	Если ЭлементНалоги <> Неопределено Тогда
		ЭлементНалоги.Представление = ОписаниеРежимовПросмотра.Налоги.СписокПредставление;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОписаниеРежимов(ОписаниеРежимов, ТекущийРежим, КоличествоНачисления, КоличествоНалоги)
	
	ШаблонКоличество = "%1 (%2)";
	
	ТекущееОписание = ОписаниеРежимов[ТекущийРежим];
	
	ЗаголовокНачисления = ОписаниеРежимов.НачисленияУдержания.Заголовок;
	Если ТекущееОписание.ОтображатьКоличествоНачисления Тогда
		ЗаголовокНачисления = СтрШаблон(ШаблонКоличество, ЗаголовокНачисления, КоличествоНачисления);
	КонецЕсли;
	ОписаниеРежимов.НачисленияУдержания.СписокПредставление = ЗаголовокНачисления;
	
	ЗаголовокНалоги = ОписаниеРежимов.Налоги.Заголовок;
	Если ТекущееОписание.ОтображатьКоличествоНалоги Тогда
		ЗаголовокНалоги = СтрШаблон(ШаблонКоличество, ЗаголовокНалоги, КоличествоНалоги);
	КонецЕсли;
	ОписаниеРежимов.Налоги.СписокПредставление = ЗаголовокНалоги;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьОтображениеПодсказки(Элементы, Показать)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаПодсказкаАссистента",
		"Видимость",
		Показать);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПоляСумма()
	
	ТекущиеДанные = Элементы.НачисленияУдержания.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.ВидНачисленияУдержания) Тогда
		
		ТекущиеДанные.СуммаЗаблокирована = ПолучитьЗначениеБлокировкиСуммы(ТекущиеДанные.ВидНачисленияУдержания);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьЗначениеДополнительныхРеквизитовТабличныхЧастей()
	
	ЗаблокированныеНачисления = Новый Соответствие;
	
	Для Каждого СтрокаНачисленийУдержаний Из Объект.НачисленияУдержания Цикл
		
		ЗначениеБлокировки = ЗаблокированныеНачисления.Получить(СтрокаНачисленийУдержаний.ВидНачисленияУдержания);
		
		Если ЗначениеБлокировки = Неопределено Тогда
			Если ЗначениеЗаполнено(СтрокаНачисленийУдержаний.ВидНачисленияУдержания) Тогда
				ДанныеНачисления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					СтрокаНачисленийУдержаний.ВидНачисленияУдержания, "Формула, Предопределенный");
				ЗначениеБлокировки = НЕ ЗначениеЗаполнено(ДанныеНачисления.Формула)
					ИЛИ ДанныеНачисления.Предопределенный;
			Иначе
				ЗначениеБлокировки = Истина;
			КонецЕсли;
			ЗаблокированныеНачисления.Вставить(СтрокаНачисленийУдержаний.ВидНачисленияУдержания, ЗначениеБлокировки);
		КонецЕсли; 
		
		Если ЗначениеБлокировки = Истина Тогда
			СтрокаНачисленийУдержаний.СуммаЗаблокирована = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	УсловноеОформление.Элементы.Очистить();
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"Объект.НачисленияУдержания.СуммаЗаблокирована", Истина);
	РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, Элементы.НачисленияУдержанияСумма.Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление,
		"ЦветТекста", ЦветаПалитры.ТекстВторостепеннойНадписиУНФ);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление,
		"Текст", НСтр("ru = '<Значение не требуется>'"));
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр", Истина);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеБлокировкиСуммы(ВидНачисленияУдержания)
	
	Блокирован = Ложь;
	Если ВидНачисленияУдержания = Справочники.ВидыНачисленийИУдержаний.НалогНаДоходы
		ИЛИ ВидНачисленияУдержания = Справочники.ВидыНачисленийИУдержаний.ПогашениеЗаймаИзЗарплаты
		ИЛИ ВидНачисленияУдержания = Справочники.ВидыНачисленийИУдержаний.ПремияЗаПродажи Тогда
		
		Блокирован = Истина;
		
	КонецЕсли;
	
	Возврат Блокирован;
	
КонецФункции

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура УстановитьДоступностьПолейСуммы()
	
	Для каждого СтрокаНачисления Из Объект.НачисленияУдержания Цикл
	
		СтрокаНачисления.СуммаЗаблокирована = ПолучитьЗначениеБлокировкиСуммы(СтрокаНачисления.ВидНачисленияУдержания);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРеквизитыПечати()

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиПриемНаРаботу",
		Новый Структура("КонтекстПечати", Объект), ЭтотОбъект, , , , ОписаниеОповещения);
		
КонецПроцедуры 

&НаКлиенте
Функция НеВыбранаСтрокаСотрудника(ИмяЭлемента)
	
	ТекущийОтбор = Элементы[ИмяЭлемента].ОтборСтрок;
	Если ТипЗнч(ТекущийОтбор) = Тип("ФиксированнаяСтруктура") И ТекущийОтбор.Свойство("КлючСвязи") Тогда
		Возврат Ложь;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбрана строка Сотрудника'");
		Сообщение.Сообщить();
		Возврат Истина;
	КонецЕсли;

КонецФункции

#КонецОбласти
