

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Только номенклатуру(0); Номенклатуру и ее характеристики(1);
	ИспользоватьХарактеристики = ?(Параметры.ХарактеристикиВидны = Истина, 1, 0);
	Если Параметры.Свойство("ПоказыватьНедействительныеХарактеристики") Тогда
		ПоказыватьНедействительныеХарактеристики = Параметры.ПоказыватьНедействительныеХарактеристики;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		// Обход ошибки платформы 30163126
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияКартинка", "Ширина", 2);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияКартинка", "Высота", 0);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКоманд

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ТаблицаКатегорий.Количество() > 0 Тогда
		
		АдресВременногоХранилища = "";
		ЗаписатьВХранилищеДанныеТабличнойЧасти(АдресВременногоХранилища);
		
		Закрыть(Новый Структура("ВыборПроизведен, АдресВременногоХранилища", Истина, АдресВременногоХранилища));
		
	Иначе
		
		ВывестиСообщениеОНеправильномВыборе();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	
	Если ТаблицаКатегорий.Количество() > 0 Тогда
		
		ПоказатьОтчетСПредварительнымРезультатом();
		
	Иначе
		
		ВывестиСообщениеОНеправильномВыборе();
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Новый Структура; 
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина); 
	
	ОповещениеОЗакрытие = Новый ОписаниеОповещения("ПослеВыбораКатегоииЗакрытие", ЭтотОбъект);
	ОткрытьФорму("Справочник.КатегорииНоменклатуры.ФормаСписка", ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытие);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ПослеВыбораКатегоииЗакрытие(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		
		ОбработатьРезультатВыбораНаСервере(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыбораНаСервере(Результат)
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда 
		
		Для Каждого ЭлементМассива Из Результат Цикл 
			
			НоваяСтрокаТЗ = ТаблицаКатегорий.Добавить();
			НоваяСтрокаТЗ.Категория = ЭлементМассива;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("СправочникСсылка.КатегорииНоменклатуры") Тогда 
		
		НоваяСтрокаТЗ = ТаблицаКатегорий.Добавить();
		НоваяСтрокаТЗ.Категория = Результат;  
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуру(АдресВременногоХранилища)
	
	ДеревоНоменклатуры = Новый ДеревоЗначений;
	
	// 1. Получим СКД
	ИмяСхемыКД = "ПоКатегориямНоменклатуры";
	СхемаКомпоновкиДанных = Документы.УстановкаЦенНоменклатуры.ПолучитьМакет(ИмяСхемыКД);
	
	// 2. создаем настройки для схемы 
	НастройкиКомпоновкиДанных = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	// 2.1 установим значения параметров
	ПараметрКД = СхемаКомпоновкиДанных.Параметры.Найти("МассивКатегорийНоменклатуры");
	ПараметрКД.Значение = СформироватьМассивКатегорийИзТаблицы();
	
	Если ИспользоватьХарактеристики = 0 Тогда
		
		НастройкиКомпоновкиДанных.Структура[0].Структура[0].Использование = Ложь;
		
	КонецЕсли;
	
	// 3. готовим макет 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, , , 
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// 4. исполняем макет 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	ПроцессорКомпоновки.Сбросить();
	
	// 5. выводим результат 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДеревоНоменклатуры);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	СтруктураТаблицДанных = Документы.УстановкаЦенНоменклатуры.РазобратьДеревоНоменклатуры(ДеревоНоменклатуры, 
		ПоказыватьНедействительныеХарактеристики);
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(СтруктураТаблицДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчетСПредварительнымРезультатом()
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ИмяСКД"						, "ПоКатегориямНоменклатуры");
	ПараметрыОткрытия.Вставить("МассивКатегорийНоменклатуры"	, СформироватьМассивКатегорийИзТаблицы());
	ПараметрыОткрытия.Вставить("ИспользоватьХарактеристики"	, ИспользоватьХарактеристики);
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаПредварительногоПросмотра", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция СформироватьМассивКатегорийИзТаблицы()
	
	Возврат ТаблицаКатегорий.Выгрузить().ВыгрузитьКолонку("Категория");
	
КонецФункции

&НаСервере
Процедура ЗаписатьВХранилищеДанныеТабличнойЧасти(АдресВременногоХранилища)
	
	ПолучитьНоменклатуру(АдресВременногоХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСообщениеОНеправильномВыборе()
	
	ТекстСообщения = НСтр("ru ='Необходимо заполнить список категорий номенклатуры'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "КатегорииНоменклатуры");
	
КонецПроцедуры

#КонецОбласти
