#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	УстановитьВидимостьИДоступность();
	
	АдаптацияФормыТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ВводОстатков" Тогда
		Элементы.Список.Обновить();
		УстановитьВидимостьИДоступность();
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьВводОстатков(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	СтруктураПараметров = Новый Структура;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		СтруктураПараметров.Вставить("ВводОстатков", ТекущаяСтрока);
	КонецЕсли; 
	ОткрытьФорму("Обработка.ПомощникВводаНачальныхОстатков.Форма", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если Документы.ВводНачальныхОстатков.ОстаткиВведены() И Элементы.Найти("ФормаСоздать") <> Неопределено Тогда
		Элементы.ФормаСоздать.Видимость = Ложь;
	Иначе
		Элементы.ФормаПродолжитьВводОстатков.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.ФормаПродолжитьВводОстатков, КоманднаяПанель);
	
КонецПроцедуры

#КонецОбласти
