
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ТорговыеПредложения.ПравоПоискаТорговыхПредложений(Истина) Тогда
		Отказ = Истина;
		Возврат;          
	КонецЕсли; 
			
	УстановитьУсловноеОформление();
		
	АвтоНавигационнаяСсылка = Ложь;
	НавигационнаяСсылка = "e1cib/app/" + ИмяФормы;
	
	ЗаполнитьСпособыДоставки();
	ЗаполнитьНулевыеСтавкиНДС();
	
	ЗаполнитьФиксированныеОтборыДерева();
	
	ОбработатьПараметрыФормы();
	
	РежимСортировки = "СортировкаРелевантность";
	ПоказыватьПравуюПанель = Истина;
	
	ЗагрузитьСохраненныеНастройкиФормы();
			
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		ТорговыеПредложенияПереопределяемый.ПолучитьВалютуРегламентированногоУчета(Валюта);
	КонецЕсли;
	
	УстановитьПредставлениеВалютыПоиска();
	УстановитьРежимСортировки(Элементы, РежимСортировки, Валюта, ОтображатьЦеныБезНДС);
	
	Страницы = ТорговыеПредложенияСлужебный.НовыеПараметрыСтраницСервиса(100);
	
	ЗаполнитьОрганизации();
	ДобавитьКомандыПредставленияОрганизаций();
	
	УстановитьЗаголовокИзменитьПредставлениеЦеныВСписке();
	
	ЗаполнитьРегионыПоиска();
		
	АдресКорзины = ТорговыеПредложенияСлужебный.АдресКорзиныИзЛокальногоХранилища();
	
	ПараметрыЗапроса = НовыйПараметрыЗапросаПоискаНайтиТорговыеПредложения();
	ПараметрыЗапроса.ПолучитьДеревоКатегорий = Истина;
	ПараметрыЗапроса.ПолучитьДанныеКорзины = ЗначениеЗаполнено(АдресКорзины);
	ПараметрыЗапроса.Наименование = ОтборНаименование;
	
	НайтиТорговыеПредложенияВФоне(ПараметрыЗапроса, Ложь);
	
	ЕстьПравоСозданияЗаказовПоставщику = ТорговыеПредложения.ПравоСозданияЗаказовПоставщику();
	
	УстановитьВидимостьДоступность(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Если ЗначениеЗаполнено(ФоновоеЗаданиеПоиска) Тогда
		ОжидатьЗавершениеПоиска();
	КонецЕсли;

	УстановитьПометкуКомандыОтображатьЦеныБезНДСЕще();
	
	УстановитьКартинкуКнопкиПоказатьСкрытьПравуюПанель();
	УстановитьЗаголовокКнопкиПоказатьСкрытьПравуюПанель();
	УстановитьВидимостьПравойПанели();
	
	УстановитьВидимостьКнопкиКорзиныВПодменю();
			
	НастроитьВидимостьЭлементовИКомандКраткойИнформации();
	
	Если Не ПустаяСтрока(ТекущаяКатегория) Тогда
		ПодключитьОбработчикОжидания("ПриИзмененииТекущейКатегории", 1, Истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТорговыеПредложения_ПоискПоОтборам_Обновить" Тогда
		
		ОбработатьОповещениеОбновленияПоискаПоОтборам(Параметр);
		
	ИначеЕсли ИмяСобытия = "ТорговыеПредложения_ПеречитатьДанныеКорзины"
		И Источник <> ЭтотОбъект Тогда
		
		ОбработатьОповещениеЧтенияКорзины(Параметр.АдресДанныхКорзины);
		
	ИначеЕсли ИмяСобытия = "ТорговыеПредложения_ИзменитьКоличествоВЗаказе"
		И Параметр.ИдентификаторЗаказа = ИдентификаторЗаказа Тогда
			
		Количество = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Количество", 0);
		АдресаКоманд = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "АдресаКоманд");
				
		СтрокаСписка = ИзмененнаяСтрокаСписка(Параметр.Идентификатор, Количество);
		ОбработатьПредложениеВТабличнойЧастиТовары(Параметр.Идентификатор, СтрокаСписка, Количество, АдресаКоманд);
		
		ОбновитьИтогиПоКорзине();
		НастроитьВидимостьЭлементовИКомандКраткойИнформации();
		НастроитьВидимостьКомандыОчиститьКорзину();
			
	ИначеЕсли ИмяСобытия = "ТорговыеПредложения_УдалитьИзЗаказа"
		И Параметр.ИдентификаторЗаказа = ИдентификаторЗаказа Тогда
			
		УдалитьПредложенияИзЭлементовКорзины(Параметр.ИдентификаторыПредложений);
		
		ОбновитьИтогиПоКорзине();
		ПоказатьКнопкуСводныхДанныхКорзины();
		ПоказатьСтраницуРезультатТоваровВКорзине();
		НастроитьВидимостьЭлементовИКомандКраткойИнформации();
		НастроитьВидимостьКомандыОчиститьКорзину();

	ИначеЕсли ИмяСобытия = "ТорговыеПредложения_ОтправленыЗаказыТоваров"
		И Параметр.Свойство("ИдентификаторЗаказа")
		И Параметр.ИдентификаторЗаказа = ИдентификаторЗаказа Тогда
		
		ОчиститьТовары();
		
		ОбновитьИтогиПоКорзине();
		ПоказатьКнопкуСводныхДанныхКорзины();
		ПоказатьСтраницуРезультатТоваровВКорзине();
		НастроитьВидимостьЭлементовИКомандКраткойИнформации();
		НастроитьВидимостьКомандыОчиститьКорзину();
		
	ИначеЕсли ИмяСобытия = "БизнесСеть_РегистрацияОрганизаций" Тогда
		
		ПослеПодключенияОрганизации();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;  
	
	СохранитьНастройкиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
    ОчиститьОтборыНоменклатуры();
	НайтиТорговыеПредложения();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОчиститьСообщения();
	
	ОткрытьТекущееТорговоеПредложение();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	НастроитьВидимостьЭлементовИКомандКраткойИнформации();
	ПоказатьКартинкуПредложения(); 
		
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыборСписка();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		КоличествоВЗаказе = КоличествоТовараВЗаказе(ТекущиеДанные.Идентификатор);
		ТекущиеДанные.ГиперссылкаДобавить = КоличествоВЗаказе;
	Иначе
		ОбработкаИзмененияКоличестваВКорзине();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
		Или ТекущиеДанные.ГиперссылкаДобавить = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТорговыеПредложенияКлиент.КоличествоВведеноКорректно(
		ТекущиеДанные.ГиперссылкаДобавить, ТекущиеДанные.МинимальноеКоличество, ТекущиеДанные.КратностьУпаковки) Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокГиперссылкаДобавитьРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КоличествоВКорзинеОбработкаРегулирования(Направление);
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	НайтиТорговыеПредложения();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	ДанныеСтроки = Элемент.ДанныеСтроки(Строка);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьТоварВКорзине = ДанныеСтроки.ГиперссылкаДобавить > 0;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СписокУдалитьИзКорзины",
		"Доступность",
		ЕстьТоварВКорзине);
		
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовПравойПанели

&НаКлиенте
Процедура СтраницыПраваяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаДетали Тогда 
		ПоказатьКартинкуПредложения();
		НастроитьВидимостьЭлементовИКомандКраткойИнформации();
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаТоварыВКорзине Тогда
		НастроитьВидимостьКомандыОчиститьКорзину();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ГруппаДанныеКорзиныНажатие(Элемент)
	ОбработкаПереходаВКорзину();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКомандыОчиститьКорзину()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ТоварыОчиститьКорзину", "Видимость", Товары.Количество() > 0);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДереваКатегории

&НаКлиенте
Процедура КатегорииПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Категории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
		Или ТекущаяКатегория =  ТекущиеДанные.Идентификатор Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеКатегории = ТекущиеДанные.Наименование;
	ТекущаяКатегория       = ТекущиеДанные.Идентификатор;
	
	НайтиТорговыеПредложения(Истина);
	
	ПриИзмененииТекущейКатегории();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОтборов

&НаКлиенте
Процедура ДеревоОтборовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыОформления = ОбщегоНазначенияБЭДКлиент.НовыйПараметрыОформленияФормыУстановкаИнтервала();
	
	ТекущаяСтрока = ДеревоОтборов.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
	
	Если ТекущаяСтрока.Идентификатор <> "Поставщик" Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрокаДерева", ТекущаяСтрока);

	ЭлементПредставлениеОтбора = Элементы.ДеревоОтборовПредставлениеОтбораГиперссылка;

	Если ТекущаяСтрока.ФиксированныйОтбор Тогда
		Идентификатор = ТекущаяСтрока.Идентификатор;
		Если Идентификатор = "Поставщик" Тогда
			
			Если Элемент.ТекущийЭлемент.Имя = "ДеревоОтборовПредставление" Тогда
				Возврат;
			Иначе
				Элемент.ТекущийЭлемент.ТолькоПросмотр = НЕ РазрешитьИзменениеКонтрагента;
			КонецЕсли;
			
			Если РазрешитьИзменениеКонтрагента Тогда
				Элементы.ДеревоОтборовПредставлениеОтбора.КнопкаОчистки = 
					Не ПустаяСтрока(ТекущаяСтрока.ПредставлениеОтбора);
				Элементы.ДеревоОтборовПредставлениеОтбора.КнопкаВыбора   = Истина;
			КонецЕсли;
			
			Возврат;
			
		ИначеЕсли Идентификатор = "СпособДоставки"
			ИЛИ Идентификатор = "Доставка" ИЛИ Идентификатор = "Самовывоз" Тогда
						
			Если ТекущаяСтрока.Отбор 
				И РегионПоиска.РежимОтбора = 0 Тогда
				ДанныеТекущегоОтбора = ДанныеТекущегоОтбораСпособовДоставки(ТекущаяСтрока);
				ОткрытьВыборРегионаПоиска(ДанныеТекущегоОтбора);
				Возврат;
			КонецЕсли;
			
			ОбработатьУстановкуСпособаДоставки(ТекущаяСтрока, ТекущаяСтрока.Отбор);

		ИначеЕсли Идентификатор = "Цена" Тогда
			
			ПараметрыОформления.ЗаголовокФормы = НСтр("ru = 'Установите желаемый интервал цен'");
			ПараметрыОформления.ТекстДекорации = 
				НСтр("ru = 'Цена в результате поиска может отличаться от выбранного интервала на ставку НДС'");
			
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеОповещенияЗавершение = 
		Новый ОписаниеОповещения("ДеревоОтборовПриИзмененииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщегоНазначенияБЭДКлиент.ДеревоОтборовВыбор(Элементы.ДеревоОтборов, ЭлементПредставлениеОтбора, 
		Элементы.ДеревоОтборовПредставление, ОписаниеОповещенияЗавершение, , ПараметрыОформления);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборовПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаДерева  = ДополнительныеПараметры.ТекущаяСтрокаДерева;
	ДанныеОтбораИзменены = Истина;
	
	Если ТекущаяСтрокаДерева.ФиксированныйОтбор Тогда
		ОбработатьРезультатИзмененияФиксированногоОтбора(
			ТекущаяСтрокаДерева, ДанныеОтбораИзменены, Результат);
	Иначе
		ДанныеОтбораИзменены = Результат;
	КонецЕсли;
	
	Если ДанныеОтбораИзменены Тогда
		НайтиТорговыеПредложения(); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборовПриИзменении(Элемент)
	
	ТекущаяСтрока = ДеревоОтборов.НайтиПоИдентификатору(Элемент.ТекущаяСтрока); 
	
	ОбработатьДеревоОтборовПриИзменении(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДеревоОтборовПриИзменении(ТекущаяСтрока)
	
	ПараметрыОформления = ОбщегоНазначенияБЭДКлиент.НовыйПараметрыОформленияФормыУстановкаИнтервала();

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрокаДерева", ТекущаяСтрока);
	
	Результат = ТекущаяСтрока.Отбор;
	
	Если ТекущаяСтрока.ФиксированныйОтбор Тогда
		Идентификатор = ТекущаяСтрока.Идентификатор;
		Если Идентификатор = "Поставщик" Тогда
			
			Если НЕ РазрешитьИзменениеКонтрагента
				И (ЗначениеЗаполнено(Контрагент)
					ИЛИ ЗначениеЗаполнено(ИННКонтрагента)
					ИЛИ ЗначениеЗаполнено(НаименованиеКонтрагента)) Тогда
				ТекущаяСтрока.Отбор = Истина;
				Возврат;
			КонецЕсли;
			
			Если Результат
				И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ПредставлениеОтбора) Тогда
				ТекущаяСтрока.Отбор = Ложь;
				ОчиститьСообщения();
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран поставщик'"));
				Возврат;
			КонецЕсли;
			
		ИначеЕсли Идентификатор = "СпособДоставки"
			ИЛИ Идентификатор = "Доставка" ИЛИ Идентификатор = "Самовывоз" Тогда 
						
			Если Результат 
				И РегионПоиска.РежимОтбора = 0 Тогда
				ДанныеТекущегоОтбора = ДанныеТекущегоОтбораСпособовДоставки(ТекущаяСтрока);
				ОткрытьВыборРегионаПоиска(ДанныеТекущегоОтбора);
				Возврат;
			КонецЕсли;
			
			ОбработатьУстановкуСпособаДоставки(ТекущаяСтрока, ТекущаяСтрока.Отбор);
			
		ИначеЕсли Идентификатор = "Цена" Тогда 
			
			ПараметрыОформления.ЗаголовокФормы = НСтр("ru = 'Установите желаемый интервал цен'");
			ПараметрыОформления.ТекстДекорации = 
				НСтр("ru = 'Цена в результате поиска может отличаться от выбранного интервала на ставку НДС'");
			
		КонецЕсли; 
		
	КонецЕсли;
	
	ФиксированныйОтборыБезВыбора = ТекущаяСтрока.ФиксированныйОтбор 
		И НЕ ТекущаяСтрока.ЗначениеОтбора = "Список" 
		И НЕ ТипЗнч(ТекущаяСтрока.ЗначениеОтбора) = Тип("Число");
	
	Если ФиксированныйОтборыБезВыбора Тогда
		ДеревоОтборовПриИзмененииЗавершение(Результат, ДополнительныеПараметры);
	Иначе
		
		ОписаниеОповещенияЗавершение = 
			Новый ОписаниеОповещения("ДеревоОтборовПриИзмененииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
		ОбщегоНазначенияБЭДКлиент.ДеревоОтборовОтборПриИзменении(
			Элементы.ДеревоОтборов, ОписаниеОповещенияЗавершение, , ПараметрыОформления);
		
	КонецЕсли;	

КонецПроцедуры 

&НаКлиенте
Процедура ДеревоОтборовПредставлениеОтбораОкончаниеВводаТекста(
	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДеревоОтборов.ТекущиеДанные;
	Если ТекущаяСтрока.Идентификатор = "Поставщик" Тогда
		ТекущаяСтрока.Отбор = Истина;
		ТекущаяСтрока.ЗначениеОтбора = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборовПредставлениеОтбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДеревоОтборов.ТекущиеДанные;
	
	Если ТекущаяСтрока.Идентификатор = "Поставщик" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущаяСтрокаДерева", ТекущаяСтрока);
		
		ВыборКонтрагента(ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборовПредставлениеОтбораОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДеревоОтборов.ТекущиеДанные;
	
	Если ТекущаяСтрока.Идентификатор = "Поставщик" Тогда
		ТекущаяСтрока.ЗначениеОтбора = "";
		ТекущаяСтрока.ПредставлениеОтбора = "";
		ТекущаяСтрока.Отбор               = Ложь;
		ОчиститьДанныеПоКонтрагенту(ЭтотОбъект);
		НайтиТорговыеПредложения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияОтбораСпособовДоставки(ЭлементОтбора, УстановкаОтбора)

	ЭлементОтбора.Отбор = УстановкаОтбора;

	Если ЭлементОтбора.Идентификатор = "СпособДоставки" Тогда
		
		ВозможенСамовывоз = УстановкаОтбора;
		ВозможнаДоставка  = УстановкаОтбора;
		
		ДочерниеЭлементы = ЭлементОтбора.ПолучитьЭлементы();
		Для Каждого СтрокаЭлемента Из ДочерниеЭлементы Цикл
			СтрокаЭлемента.Отбор = УстановкаОтбора;
		КонецЦикла;
				
	ИначеЕсли ЭлементОтбора.Идентификатор = "Доставка" Тогда
		
		ВозможнаДоставка = УстановкаОтбора; 
		РодительДоставки = ЭлементОтбора.ПолучитьРодителя();
		РодительДоставки.Отбор = УстановкаОтбора; 
						
	ИначеЕсли ЭлементОтбора.Идентификатор = "Самовывоз" Тогда
		
		ВозможенСамовывоз = УстановкаОтбора;
		РодительДоставки = ЭлементОтбора.ПолучитьРодителя();
		РодительДоставки.Отбор = УстановкаОтбора; 
				
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Выполнение = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовКраткойИнформацииТорговогоПредложения

&НаКлиенте
Процедура КраткаяИнформацияКоличествоВКорзинеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КоличествоВКорзинеОбработкаРегулирования(Направление);
	ПодключитьОбработчикОжидания("ОбработкаИзмененияКоличестваВКорзине", 0.5, Истина);

КонецПроцедуры

&НаКлиенте
Процедура КраткаяИнформацияКоличествоВКорзинеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
		Или ТекущиеДанные.ГиперссылкаДобавить = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НовоеЗначение = Число(Текст);
	Если НовоеЗначение = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТорговыеПредложенияКлиент.КоличествоВведеноКорректно(
		НовоеЗначение, ТекущиеДанные.МинимальноеКоличество, ТекущиеДанные.КратностьУпаковки) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура КраткаяИнформацияКоличествоВКорзинеПриИзменении(Элемент)
	ОбработкаИзмененияКоличестваВКорзине();
КонецПроцедуры

&НаКлиенте
Процедура СписокНаименованиеКатегорииНажатие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ОчиститьСообщения();
	
	ПараметрыОткрытия = ТорговыеПредложенияКлиент.НовыеПараметрыОткрытияФормыПоиска(ТекущиеДанные.ИдентификаторКатегории);
	ПараметрыОткрытия.Валюта = Валюта;

	Оповестить("ТорговыеПредложения_ПоискПоОтборам_Обновить", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаКраткаяИнформацияОТовареНажатие(Элемент)
	ОчиститьСообщения();
	ОткрытьТекущееТорговоеПредложение(); 
КонецПроцедуры 

&НаКлиенте
Процедура ГруппаИзображенияНажатие(Элемент)
	ОчиститьСообщения();
	ОткрытьТекущееТорговоеПредложение(); 
КонецПроцедуры

&НаКлиенте
Процедура КраткиеХарактеристикиНаименованиеКонтрагентаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	УстановитьОтборПоПоставщику();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ТоварыКоличество" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = ТорговыеПредложенияКлиент.НовыеПараметрыОткрытияФормыТорговогоПредложения();
	ПараметрыОткрытия.Идентификатор = ТекущиеДанные.Идентификатор;
	ПараметрыОткрытия.Валюта = Валюта;
	ПараметрыОткрытия.ИдентификаторЗаказа = ИдентификаторЗаказа;
	ПараметрыОткрытия.Организация = ОтборОрганизация;
	ТорговыеПредложенияКлиент.ОткрытьТорговоеПредложение(ПараметрыОткрытия, ЭтотОбъект, ТекущиеДанные.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокиТоваров = Элементы.Товары.ПолучитьСтрокиДляОбработки();
	Если СтрокиТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ДанныеСтроки(СтрокиТоваров[0]);
	
	ЭтоУдалениеПредложенияИзКорзины = ТекущиеДанные.Количество = 0;
	Если Не ЭтоУдалениеПредложенияИзКорзины 
		И Не ТорговыеПредложенияКлиент.КоличествоВведеноКорректно(
		ТекущиеДанные.Количество, ТекущиеДанные.МинимальноеКоличество, ТекущиеДанные.КратностьУпаковки) Тогда  
		ТекущиеДанные.Количество = ТекущиеДанные.МинимальноеКоличество;
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если ЭтоУдалениеПредложенияИзКорзины Тогда
		УдалитьПредложениеИзКорзины(ТекущиеДанные.Идентификатор, ТекущиеДанные.АдресКомандыУдалить);
	Иначе
		ДобавитьПредложениеТоваровВКорзину();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборРегиона(Команда)
	ОткрытьВыборРегионаПоиска();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	НайтиТорговыеПредложения();
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗаказыТоваров(Команда)
	ОбработкаПереходаВКорзину();	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРежимСортировки(Команда)
	
	РежимСортировки = Команда.Имя;
	УстановитьРежимСортировки(Элементы, РежимСортировки, Валюта, ОтображатьЦеныБезНДС);
	НайтиТорговыеПредложения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсходящиеДокументы(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимИсходящихДокументов", Истина);
	ОчиститьСообщения();
	ОткрытьФорму("Обработка.БизнесСеть.Форма.ДокументыОбмена", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВалютуПоиска(Команда)
	ОткрытьИзменениеВалютыПоиска();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПоставщику(Команда)
	
	УстановитьОтборПоПоставщику();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборы(Команда)
	
	ОчиститьОтборИОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПригласитьПоставщиков(Команда)
	
	// Приглашение поставщиков в сервис.
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимПриглашения", "Поставщики");
	ОчиститьСообщения();
	ОткрытьФорму("Обработка.БизнесСеть.Форма.ОтправкаПриглашенийКонтрагентам", ПараметрыОткрытия);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьПравуюПанель(Команда)
	
	ПоказыватьПравуюПанель = Не ПоказыватьПравуюПанель;
	УстановитьВидимостьПравойПанели();
	УстановитьКартинкуКнопкиПоказатьСкрытьПравуюПанель();
	УстановитьЗаголовокКнопкиПоказатьСкрытьПравуюПанель();
	УстановитьВидимостьКнопкиКорзиныВПодменю();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварВКорзину(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено  Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьДобавлениеСЗадержкой = ТекущиеДанные.ГиперссылкаДобавить > 0;
	
	ТекущиеДанные.ГиперссылкаДобавить = 
		ТекущиеДанные.ГиперссылкаДобавить
		+ Макс(ТекущиеДанные.МинимальноеКоличество, ТекущиеДанные.КратностьУпаковки);
	
	Если ВыполнитьДобавлениеСЗадержкой Тогда
		ПодключитьОбработчикОжидания("ДобавитьПредложениеСпискаВКорзину", 0.5, Истина);
	Иначе
		ДобавитьПредложениеСпискаВКорзину();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзКорзины(Команда)
	
	СтрокиДляОбработки = Элементы.Список.ПолучитьСтрокиДляОбработки();
	Если СтрокиДляОбработки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ДанныеСтроки(СтрокиДляОбработки[0]);
	Если ТекущиеДанные = Неопределено  Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения(); 
	
	УдалитьПредложениеСпискаИзКорзины(ТекущиеДанные);
	НастроитьВидимостьЭлементовИКомандКраткойИнформации();
	НастроитьВидимостьКомандыОчиститьКорзину();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКорзину(Команда)
		
	Оповещение = Новый ОписаниеОповещения("УдалитьКорзинуЗавершение", ЭтотОбъект);
	ТорговыеПредложенияКлиент.УдалитьКорзинуДиалог(ЭтотОбъект, ОтборОрганизация, АдресКорзины, Оповещение);

КонецПроцедуры 

&НаКлиенте
Процедура ОтображатьЦеныБезНДС(Команда)
	
	ОтображатьЦеныБезНДС = Не ОтображатьЦеныБезНДС;
	
    УстановитьПометкуКомандыОтображатьЦеныБезНДСЕще();

	Направление = "";
	Для Каждого Кнопка Из Элементы.ГруппаСортировкаЕще.ПодчиненныеЭлементы Цикл
		Если Кнопка.Пометка Тогда
			Направление = Кнопка.Имя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьРежимСортировки(Элементы, Направление, Валюта, ОтображатьЦеныБезНДС);

	УстановитьЗаголовокИзменитьПредставлениеЦеныВСписке(); 
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПоказатьЕще(Команда)
	НайтиТорговыеПредложения(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуТорговогоПредложения(Команда)

	ОчиститьСообщения();

	ОткрытьТекущееТорговоеПредложение();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОрганизации(Команда)
	
	ОтборОрганизация = Организации.Получить(Число(СтрЗаменить(Команда.Имя, "ОрганизацияБизнесСети_", ""))).Значение;
	Для Каждого Организация Из Организации Цикл
		ИмяКоманды = СтрШаблон("ОрганизацияБизнесСети_%1", Организация.ПолучитьИдентификатор());
		Элементы[ИмяКоманды].Пометка = Организация.Значение = ОтборОрганизация;
	КонецЦикла;
	
	ПослеВыбораОрганизацииНаСервере();
	
	НайтиТорговыеПредложения();
	
КонецПроцедуры 
	
&НаКлиенте
Процедура УдалитьИзКорзиныТаблицыТоваров(Команда)  

	СтрокиТоваров = Элементы.Товары.ПолучитьСтрокиДляОбработки();
	Если СтрокиТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ДанныеСтроки(СтрокиТоваров[0]);
	
	УдалитьПредложениеИзКорзины(ТекущиеДанные.Идентификатор, ТекущиеДанные.АдресКомандыУдалить);

КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСоСтрокойПоиска

&НаКлиенте
Процедура ОчиститьОтборыНоменклатуры()

	ОтборНаименование = ""; 
	ОтборНоменклатураСервиса = "";
	ОтборНоменклатураСервисаПредставление = "";
	
КонецПроцедуры
	
#КонецОбласти

#Область РаботаСоСписком

// Если строка списка найдена, в ней меняется количество к заказу.
// 
// Параметры:
//  ИдентификаторПредложения - Строка - По данному идентификатору предложения происходит поиск в списке.
//  Количество - Число - Количество, которое нужно установить найденной строке.
// 
// Возвращаемое значение:
//  Неопределено, ДанныеФормыЭлементКоллекции - Найденная строка с измененным количеством, иначе - Неопределено.
&НаКлиенте
Функция ИзмененнаяСтрокаСписка(ИдентификаторПредложения, Количество)
	
	СтрокаСписка = Неопределено;
	
	ОтборСтрокСписка = Новый Структура("Идентификатор", ИдентификаторПредложения);
	СтрокиСписка = Список.НайтиСтроки(ОтборСтрокСписка);
	Если СтрокиСписка.Количество() Тогда
		СтрокаСписка = СтрокиСписка[0];
	КонецЕсли;
	
	Если СтрокаСписка = Неопределено Тогда
		Возврат СтрокаСписка;
	КонецЕсли;
	
	Если Количество > 0 Тогда
		СтрокаСписка.ГиперссылкаДобавить = Количество;
	КонецЕсли;
	
	Если СтрокаСписка.ГиперссылкаДобавить = 0 Тогда
		СтрокаСписка.ГиперссылкаДобавить = Макс(СтрокаСписка.МинимальноеКоличество, СтрокаСписка.КратностьУпаковки);
	КонецЕсли;
	
	Возврат СтрокаСписка;
	
КонецФункции

#КонецОбласти

#Область РаботаСКорзиной

&НаКлиенте
Процедура ОбработатьОповещениеЧтенияКорзины(АдресДанныхКорзины)

	ПоказатьНадписьДлительнойОперацииСводныхДанныхКорзины();
	ПоказатьСтраницуДлительнойОперацииТоваровВКорзине();

	ОчиститьТовары();

	Если ПустаяСтрока(АдресДанныхКорзины) Тогда
		УдалитьАдресКорзиныИзЛокальногоХранилища(АдресКомандыДобавитьТовар, АдресКорзины);
	Иначе
		ПрочитатьКорзинуОбновитьСписок(АдресДанныхКорзины);
	КонецЕсли;

	ОбновитьИтогиПоКорзине();
	
	ПоказатьКнопкуСводныхДанныхКорзины();
	ПоказатьСтраницуРезультатТоваровВКорзине();
	НастроитьВидимостьКомандыОчиститьКорзину();

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьКорзинуОбновитьСписок(Знач АдресДанныхКорзины)
	
	ПрочитатьКорзинуОбновитьСписокНаСервере(АдресДанныхКорзины);
	
	ТорговыеПредложенияСлужебныйКлиент.СформироватьАдресаВременныхХранилищДляРеквизита(
		Товары, "АдресИзображения", УникальныйИдентификатор);
		
	ЗагрузитьПредварительныеИзображенияКорзины(Товары);
	
	УстановитьКоличествоТорговыхПредложений(Список, Товары);
	
КонецПроцедуры 

&НаСервере
Процедура ПрочитатьКорзинуОбновитьСписокНаСервере(Знач АдресДанныхКорзины)

	ДанныеСервиса = ПолучитьИзВременногоХранилища(АдресДанныхКорзины);
	ДанныеКорзины = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСервиса, "ДанныеКорзины");
		
	ТорговыеПредложенияСлужебный.ПеречитатьКорзину(
		АдресКорзины, АдресКомандыДобавитьТовар, ДанныеКорзины, Товары, Валюта);
		
	КурсыВалютАктуальны = Истина;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Валюты") Тогда
		
		МодульВалюты = ОбщегоНазначения.ОбщийМодуль("РаботаСКурсамиВалют");
		КурсыВалютАктуальны = МодульВалюты.КурсыАктуальны();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗагрузитьПредварительныеИзображенияКорзины(Знач Товары)
	
	Для каждого СтрокаТовара Из Товары Цикл
		
		АдресИзображенияВСервисе = СтрокаТовара.АдресИзображенияВСервисе;
		АдресИзображения = СтрокаТовара.АдресИзображения;
		
		Если ПустаяСтрока(АдресИзображенияВСервисе) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ТорговыеПредложенияСлужебный.ПоместитьСкачанноеИзображениеПоАдресуХранилища(
				АдресИзображенияВСервисе, АдресИзображения);
		Исключение
			СтрокаТовара.АдресИзображения = "";
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьПредложениеСпискаИзКорзины(ДанныеСтрокиСписка) 
	
	СтрокаТовара = ТоварПоИдентификаторуПредложения(Товары, ДанныеСтрокиСписка.Идентификатор);
	Если СтрокаТовара <> Неопределено Тогда
		УдалитьПредложениеИзКорзины(СтрокаТовара.Идентификатор, СтрокаТовара.АдресКомандыУдалить);
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура УдалитьПредложениеИзКорзины(ИдентификаторПредложения, АдресКомандыУдалить)
	
	ПоказатьНадписьДлительнойОперацииСводныхДанныхКорзины();
	ПоказатьСтраницуДлительнойОперацииТоваровВКорзине();

	Если Не ПустаяСтрока(АдресКомандыУдалить) Тогда
		УдалитьТоварИзКорзиныВСервисе(ИдентификаторПредложения, АдресКомандыУдалить);
	КонецЕсли;
	
	ИдентификаторыПредложенийДляУдаления = 
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторПредложения);	
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторЗаказа", ИдентификаторЗаказа);
	ПараметрыОповещения.Вставить("ИдентификаторыПредложений", ИдентификаторыПредложенийДляУдаления);
	Оповестить("ТорговыеПредложения_УдалитьИзЗаказа", ПараметрыОповещения);
			
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТоварИзКорзиныВСервисе(ИдентификаторПредложения, АдресКоманды)
	
	ПараметрыОповещения = Новый Структура("Идентификатор", ИдентификаторПредложения);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействияНадТоваром", ЭтотОбъект, ПараметрыОповещения);
	
	ПараметрыРаботыСТоваром = ТорговыеПредложенияКлиент.ОписаниеПараметровРаботыСТоваромКорзины();
	
	ПараметрыРаботыСТоваром.Организация         = ОтборОрганизация;
	ПараметрыРаботыСТоваром.АдресКомандыУдалить = АдресКоманды;
	ПараметрыРаботыСТоваром.АдресКорзины        = АдресКорзины;
	ПараметрыРаботыСТоваром.ВидОперации         = "Удаление";
	ПараметрыРаботыСТоваром.ПрочитатьКорзину    = Истина;
	
	ТорговыеПредложенияКлиент.ВыполнитьДействиеСТоваромКорзины(ПараметрыРаботыСТоваром, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоВКорзинеОбработкаРегулирования(Направление)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	КоличествоНаФорме = ТекущиеДанные.ГиперссылкаДобавить;
	КратностьУпаковки = ТекущиеДанные.КратностьУпаковки;
	ОстатокОтДеления = КоличествоНаФорме % КратностьУпаковки;
	
	Если Направление = 1 Тогда
		Количество = КоличествоНаФорме + (КратностьУпаковки - ОстатокОтДеления);
		ТекущиеДанные.ГиперссылкаДобавить = Макс(ТекущиеДанные.МинимальноеКоличество, Количество);
	Иначе
		Если ТекущиеДанные.ГиперссылкаДобавить = ТекущиеДанные.МинимальноеКоличество Тогда
			ТекущиеДанные.ГиперссылкаДобавить = 0;
		Иначе
			ТекущиеДанные.ГиперссылкаДобавить = КоличествоНаФорме 
				- (?(ОстатокОтДеления = 0, КратностьУпаковки, ОстатокОтДеления));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаИзмененияКоличестваВКорзине()

	СтрокиДляОбработки = Элементы.Список.ПолучитьСтрокиДляОбработки();
	Если СтрокиДляОбработки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ДанныеСтроки(СтрокиДляОбработки[0]);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоНаФорме = ТекущиеДанные.ГиперссылкаДобавить;

	ОчиститьСообщения();
	
	Если КоличествоНаФорме = 0 Тогда
		УдалитьПредложениеСпискаИзКорзины(ТекущиеДанные);
	Иначе
		ДобавитьПредложениеСпискаВКорзину();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПереходаВКорзину()
	
	Если Товары.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствуют товары для заказа.'"));
		Возврат;
	КонецЕсли;
		
	ТорговыеПредложенияКлиент.ОткрытьФормуКорзины(ОтборОрганизация);
	
	ОчиститьСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуРезультатТоваровВКорзине()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницыТоварыВКорзине", "ТекущаяСтраница", Элементы.СтраницаТоварыВКорзинеРезультат);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуДлительнойОперацииТоваровВКорзине()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницыТоварыВКорзине", "ТекущаяСтраница", Элементы.СтраницаТоварыВКорзинеДлительнаяОперация);
КонецПроцедуры 
	
&НаКлиенте
Процедура ПоказатьНадписьДлительнойОперацииСводныхДанныхКорзины()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаДеталиКорзины", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаСводныеДанныеКорзиныДлительнаяОперация", "Видимость", Истина);
КонецПроцедуры  

&НаКлиенте
Процедура ПоказатьКнопкуСводныхДанныхКорзины()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаСводныеДанныеКорзиныДлительнаяОперация", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаДеталиКорзины", "Видимость", Истина);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПредложенияИзЭлементовКорзины(ИдентификаторыПредложений)
	
	Для Каждого Идентификатор Из ИдентификаторыПредложений Цикл
		
		СтрокаТовары = Товары.НайтиСтроки(Новый Структура("Идентификатор", Идентификатор));
		Если СтрокаТовары.Количество() Тогда
			Товары.Удалить(Товары.Индекс(СтрокаТовары[0]));
		КонецЕсли;
		
		СтрокаСписка = Список.НайтиСтроки(Новый Структура("Идентификатор", Идентификатор));
		Если СтрокаСписка.Количество() Тогда
			СтрокаСписка[0].ГиперссылкаДобавить = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоПредложенияВЭлементахКорзины(Идентификатор, Количество)
	
	НайденныеСтрокиТоваров = Товары.НайтиСтроки(Новый Структура("Идентификатор", Идентификатор));
	Если НайденныеСтрокиТоваров.Количество() > 0 Тогда
		НайденныеСтрокиТоваров[0].Количество = Количество;
	КонецЕсли;
	
	НайденныеСтрокиСписка = Список.НайтиСтроки(Новый Структура("Идентификатор", Идентификатор));
	Если НайденныеСтрокиСписка.Количество() > 0 Тогда
		НайденныеСтрокиСписка[0].ГиперссылкаДобавить = Количество;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область РаботаСКраткойИнформацией

&НаКлиенте
Процедура НастроитьВидимостьЭлементовИКомандКраткойИнформации() 
	
	Если Не ПоказыватьПравуюПанель
		Или Элементы.СтраницыПраваяПанель.ТекущаяСтраница <> Элементы.СтраницаДетали Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаКраткаяИнформацияОТовареПодвал", "Видимость", Ложь);
			
		Возврат; 
		
	КонецЕсли;
	
	ЕстьТоварВКорзине = ТекущиеДанные.ГиперссылкаДобавить > 0;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаКраткаяИнформацияОТовареПодвал", "Видимость", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДобавитьТоварВКорзину", "Видимость", Не ЕстьТоварВКорзине);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "КраткаяИнформацияКоличествоВКорзине", "Видимость", ЕстьТоварВКорзине);

	// Краткие характеристики - Цена
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "КраткиеХарактеристикиЦенаДоСкидки", "Видимость", ТекущиеДанные.ЦенаДоСкидки > 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "КраткиеХарактеристикиЦена", "Видимость", ТекущиеДанные.Цена > 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НадписьЦенаПоЗапросу", "Видимость", ПустаяСтрока(ТекущиеДанные.ПредставлениеЦены)); 
		
	ЦенаЗависитОтКоличества = ТекущиеДанные.ЦеныВВалютеПредложения.Количество() > 1;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НадписьЦенаЗависитОтКоличества", "Видимость", ЦенаЗависитОтКоличества); 
				
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущееТорговоеПредложение()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено  Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = ТорговыеПредложенияКлиент.НовыеПараметрыОткрытияФормыТорговогоПредложения();
	ПараметрыОткрытия.Идентификатор = ТекущиеДанные.Идентификатор;
	ПараметрыОткрытия.Валюта = Валюта;
	ПараметрыОткрытия.ИдентификаторЗаказа = ИдентификаторЗаказа;
	ПараметрыОткрытия.Организация = ОтборОрганизация;
	ТорговыеПредложенияКлиент.ОткрытьТорговоеПредложение(ПараметрыОткрытия, ЭтотОбъект, ТекущиеДанные.Идентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуИзображения(ТекущиеДанные)
	
	КоличествоИзображений = ТекущиеДанные.АдресаКартинок.Количество();
	
	Если КоличествоИзображений > 1 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СтраницыИзображения", "ТекущаяСтраница", Элементы.СтраницаПоказМножественныхИзображений);
	ИначеЕсли КоличествоИзображений = 1 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СтраницыИзображения", "ТекущаяСтраница", Элементы.СтраницаПоказИзображения);
	Иначе
		ПоказатьСтраницуНетИзображения();
	КонецЕсли;
		
КонецПроцедуры

#Область РаботаСКартинкойПредложения

&НаКлиенте
Процедура ПоказатьКартинкуПредложения()
	
	Если Не ПоказыватьПравуюПанель
		Или Элементы.СтраницыПраваяПанель.ТекущаяСтраница <> Элементы.СтраницаДетали Тогда
		Возврат;
	КонецЕсли; 
	
	АдресКартинки = "";
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ТекущиеДанные.АдресаКартинок.Количество() = 0 Тогда
		ПоказатьСтраницуНетИзображения();
		Возврат;
	КонецЕсли;
	
	ПоказатьСтраницуИзображенияДлительнаяОперация();
	Если ТекущиеДанные.ВзрослаяКатегория Тогда
		
		ИмяПроцедуры = "ПоказатьКартинкуПредложенияОтветНаВопрос";
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения(ИмяПроцедуры, ЭтотОбъект);
		ТорговыеПредложенияСлужебныйКлиент.ПользователюБольше18Лет(ЭтотОбъект, ОписаниеОповещенияОЗавершении);
		
	Иначе
		
		ПоказатьКартинкуПредложенияЗавершение();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКартинкуПредложенияОтветНаВопрос(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Значение = КодВозвратаДиалога.Да Тогда
		
		ПоказатьКартинкуПредложенияЗавершение();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКартинкуПредложенияЗавершение()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	АдресаТекущейКартинки = ТекущиеДанные.АдресаКартинок[0]; 
	
	Если Не ЭтоАдресВременногоХранилища(АдресаТекущейКартинки.АдресВХранилище) Тогда		
		ПодключитьОбработчикОжидания("ЗагрузитьИзображениеВФоне", 0.5, Истина);
	Иначе
		АдресКартинки = АдресаТекущейКартинки.АдресВХранилище;
		ПоказатьСтраницуИзображения(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзображениеВФоне()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.АдресаКартинок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	АдресаТекущейКартинки = ТекущиеДанные.АдресаКартинок[0];
	НовыйАдресВХранилище = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
	
	ЗагрузитьИзображениеВФонеНаСервере(
		АдресаТекущейКартинки.АдресВСервисе,
		НовыйАдресВХранилище,
		ФоновоеЗаданиеЗагрузкиИзображения, 
		УникальныйИдентификатор);
	
	Если ФоновоеЗаданиеЗагрузкиИзображения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("АдресВХранилище", НовыйАдресВХранилище);
				
	Если ФоновоеЗаданиеЗагрузкиИзображения.Статус = "Выполнено" Тогда
		ЗагрузитьИзображениеВФонеЗавершение(ФоновоеЗаданиеЗагрузкиИзображения, ДополнительныеПараметры);
	ИначеЕсли ФоновоеЗаданиеЗагрузкиИзображения.Статус = "Выполняется" Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьИзображениеВФонеЗавершение", 
			ЭтотОбъект, ДополнительныеПараметры);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ФоновоеЗаданиеЗагрузкиИзображения, ОповещениеОЗавершении, ПараметрыОжидания);
	Иначе
		АдресКартинки = "";
		ПоказатьСтраницуИзображения(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьИзображениеВФонеНаСервере(Знач АдресВСервисе, 
	АдресВХранилище, ФоновоеЗаданиеЗагрузкиИзображения, УникальныйИдентификатор)
		
	Если ФоновоеЗаданиеЗагрузкиИзображения <> Неопределено Тогда
		Если ЗначениеЗаполнено(ФоновоеЗаданиеЗагрузкиИзображения.ИдентификаторЗадания) Тогда
			ДлительныеОперации.ОтменитьВыполнениеЗадания(ФоновоеЗаданиеЗагрузкиИзображения.ИдентификаторЗадания);
		КонецЕсли;
		ФоновоеЗаданиеЗагрузкиИзображения = Неопределено;
	КонецЕсли; 
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = 
		НСтр("ru = '1С:Бизнес-сеть. Загрузка изображения.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = Неопределено;
	
	ФоновоеЗаданиеЗагрузкиИзображения = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		"ТорговыеПредложенияСлужебный.ПоместитьСкачанноеИзображениеПоАдресуХранилища",
		АдресВСервисе, 
		АдресВХранилище);

КонецПроцедуры
		
&НаКлиенте
Процедура ЗагрузитьИзображениеВФонеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ПоказыватьПравуюПанель
		Или Элементы.СтраницыПраваяПанель.ТекущаяСтраница <> Элементы.СтраницаДетали Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.АдресаКартинок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		АдресаТекущейКартинки = ТекущиеДанные.АдресаКартинок[0];
		АдресаТекущейКартинки.АдресВХранилище = ДополнительныеПараметры.АдресВХранилище;
		АдресКартинки = ДополнительныеПараметры.АдресВХранилище;
	КонецЕсли;
		
	ПоказатьСтраницуИзображения(ТекущиеДанные);
			
КонецПроцедуры   

&НаКлиенте
Процедура ПоказатьСтраницуИзображенияДлительнаяОперация()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницыИзображения", "ТекущаяСтраница", Элементы.СтраницаИзображенияДлительнаяОперация);	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьСтраницуНетИзображения()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницыИзображения", "ТекущаяСтраница", Элементы.СтраницаНетИзображения);	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

&НаСервере
Процедура ЗаполнитьПараметрыОтборов(АдресПараметровОтбора)

	Если Не ЭтоАдресВременногоХранилища(АдресПараметровОтбора) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНоменклатуры = БизнесСетьВызовСервера.ПолучитьУдалитьИзВременногоХранилища(АдресПараметровОтбора);
	
	Если ТипЗнч(ДанныеНоменклатуры) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;	

	Артикулы = Новый Массив;
	Штрихкоды = Новый Массив;
	
	Для каждого ЭлементКоллекции Из ДанныеНоменклатуры Цикл
		
		Если ЗначениеЗаполнено(ЭлементКоллекции.Артикул) Тогда
			Артикулы.Добавить(ЭлементКоллекции.Артикул);
		КонецЕсли;
		
		Для каждого Штрихкод Из ЭлементКоллекции.Штрихкоды Цикл
			Штрихкоды.Добавить(Штрихкод);
		КонецЦикла;
		
	КонецЦикла;
	
	Артикулы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Артикулы);
	Штрихкоды = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Штрихкоды);
		
	Если ЗначениеЗаполнено(Штрихкоды) Тогда
		ОтборШтрихКоды.ЗагрузитьЗначения(Штрихкоды);
	ИначеЕсли ЗначениеЗаполнено(Артикулы) Тогда
		ОтборАртикулы.ЗагрузитьЗначения(Артикулы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОрганизации()
	
	Организации.Очистить();
	ОтборОрганизация = Метаданные.ОпределяемыеТипы.Организация.Тип.ПривестиЗначение();
		
	ПодключенныеОрганизации = ИнтеграцияТорговыеПредложения.ПодключенныеОрганизации();
	Организации.ЗагрузитьЗначения(ПодключенныеОрганизации.ВыгрузитьКолонку("Организация"));
			
	Для Каждого ПодключеннаяОрганизация Из ПодключенныеОрганизации Цикл
		Если Не ПодключеннаяОрганизация.ТребуетсяПовторноеПодключение Тогда
			ОтборОрганизация = ПодключеннаяОрганизация.Организация;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если Не ОтборОрганизация.Пустая() Тогда
		СформироватьПредставлениеОрганизации();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ФормаГруппаПоискДляОрганизации", "Видимость", Не ОтборОрганизация.Пустая());
		
КонецПроцедуры

&НаСервере
Процедура СформироватьПредставлениеОрганизации()
	
	ШаблонПредставления = НСтр("ru = 'Поиск для %1'", ОбщегоНазначения.КодОсновногоЯзыка());
	ПредставлениеОрганизации = СтрШаблон(ШаблонПредставления, ОтборОрганизация);
	Если СтрДлина(ПредставлениеОрганизации) > 30 Тогда
		ПредставлениеОрганизации = СтрШаблон("%1...", Лев(ПредставлениеОрганизации, 30));
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаПредставлениеОрганизации", "Заголовок", ПредставлениеОрганизации);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораОрганизацииНаСервере()
	
	ЗаполнитьРегионыПоиска();
	СформироватьПредставлениеОрганизации();
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьКомандыПредставленияОрганизаций()
	
	Если ОтборОрганизация.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Организация Из Организации Цикл
		
		ИмяКоманды = СтрШаблон("ОрганизацияБизнесСети_%1", Организация.ПолучитьИдентификатор());
		
		КомандаОрганизация = Команды.Добавить(ИмяКоманды);
		КомандаОрганизация.Действие = "ВыборОрганизации";
		КомандаОрганизация.Заголовок = Организация.Значение;
		
		КнопкаОрганизация = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ГруппаПредставлениеОрганизации);
		КнопкаОрганизация.ИмяКоманды = КомандаОрганизация.Имя;
		КнопкаОрганизация.Пометка = Организация.Значение = ОтборОрганизация; 
		КнопкаОрганизация.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели; 
		КнопкаОрганизация.ВажностьПриОтображении = ВажностьПриОтображении.ОченьВысокая;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершениеПоиска(ДополнительныеПараметры = Неопределено)
	
	// Инициализация обработчик ожидания завершения.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения                  = НСтр("ru = 'Поиск торговых предложений.'");
	ПараметрыОжидания.ВыводитьОкноОжидания            = Ложь;
	ПараметрыОжидания.ВыводитьСообщения               = Истина;
	
	ОбработкаЗавершенияПоиска = Новый ОписаниеОповещения("НайтиТорговыеПредложенияЗавершение",
		ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗаданиеПоиска, ОбработкаЗавершенияПоиска, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтогиПоКорзине()
		
	ОформлениеКорзины = ОформлениеКорзиныНаСервере(Товары, Валюта, КурсыВалютАктуальны);
	
	Если ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Элементы, "ПерейтиВКорзину", "Заголовок") 
		<> ОформлениеКорзины.Заголовок Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ПерейтиВКорзину", "Заголовок", ОформлениеКорзины.Заголовок);
	КонецЕсли;
	
	Если ОформлениеКорзины.ВидимостьПодсказки Тогда
		ОтображениеПодсказкиКорзины = ОтображениеПодсказки.Кнопка;
	Иначе
		ОтображениеПодсказкиКорзины = ОтображениеПодсказки.Авто;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(
		Элементы, "ГруппаДеталиКорзины", "ОтображениеПодсказки") <> ОтображениеПодсказкиКорзины Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаДеталиКорзины", "ОтображениеПодсказки", ОтображениеПодсказкиКорзины);
	КонецЕсли;
		
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ОформлениеКорзиныНаСервере(Знач Товары, Знач Валюта, Знач КурсыАктуальны)
	
	Результат = Новый Структура("Заголовок, ВидимостьПодсказки", "", Ложь);
	
	ПозицийВКорзине = Товары.Количество();
	
	Если ПозицийВКорзине > 0 Тогда
		
		СклоненияПозиций = ПолучитьСклоненияСтрокиПоЧислу("позиция", ПозицийВКорзине, "", 
			"ЧС=Количественное", "ПД=Именительный; ПЧ=Число"); 
		
		ЕстьПредложенияВИностраннойВалюте = Ложь;
		СуммаКорзины = 0;
		
		Для Каждого СтрокаТовара Из Товары Цикл
			
			Если СтрокаТовара.Валюта = Валюта Тогда
				СуммаКорзины = СуммаКорзины + СтрокаТовара.Сумма;
			Иначе
				
				ЕстьПредложенияВИностраннойВалюте = Истина;
				
				СуммаКорзины = СуммаКорзины
					+ ПересчитатьВВалюту(
						СтрокаТовара.Сумма,
						СтрокаТовара.ВалютаПредложения,
						Валюта);
								
			КонецЕсли;
		
		КонецЦикла;
		
		Результат.ВидимостьПодсказки = ЕстьПредложенияВИностраннойВалюте 
			И Не КурсыАктуальны;
				
		ШаблонЗаголовкаКорзины = НСтр("ru = 'Корзина: %1 / %2 %3'", ОбщегоНазначения.КодОсновногоЯзыка());
		Результат.Заголовок = СтрШаблон(ШаблонЗаголовкаКорзины, СклоненияПозиций[0], СуммаКорзины, Валюта);
				
	Иначе 
		Результат.Заголовок = НСтр("ru = 'Корзина пуста'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НайтиТорговыеПредложения(ПолучитьДеревоКатегорий = Ложь, СледующаяСтраница = Ложь)
			
	ОтобразитьСостояниеДлительнаяОперация();
	ПоказатьНадписьДлительнойОперацииСводныхДанныхКорзины();
	ПоказатьСтраницуДлительнойОперацииТоваровВКорзине();
	
	АдресКартинки = "";
	НастроитьВидимостьЭлементовИКомандКраткойИнформации();
	
	ОчиститьСообщения();

	// Если стоит отбор по категории то получать дерево категории не нужно.
	Если ПолучитьДеревоКатегорий Тогда
		ПолучитьДеревоКатегорий = ПустаяСтрока(ТекущаяКатегория);
	КонецЕсли;
	
	ЗаполненныеПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(ПолучитьДеревоКатегорий);
	НайтиТорговыеПредложенияВФоне(ЗаполненныеПараметрыЗапроса, СледующаяСтраница);
	
	Если ЗаполненныеПараметрыЗапроса.Свойства.Количество() = 0 Тогда
		УдалитьНеФиксированныеОтборыДереваОтборов();
		Если Не ПустаяСтрока(ТекущаяКатегория) Тогда
			ЗаполнитьДополнительныеРеквизитыКатегории();
		КонецЕсли;
	КонецЕсли;
	
	Если Не СледующаяСтраница Тогда
		Список.Очистить();
	КонецЕсли;
	
	УстановитьВидимостьДоступность(ЭтотОбъект);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СледующаяСтраница", СледующаяСтраница);
	ДополнительныеПараметры.Вставить("ИдентификаторЗаданияПоиска", ФоновоеЗаданиеПоиска.ИдентификаторЗадания);
	
	ОжидатьЗавершениеПоиска(ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура НайтиТорговыеПредложенияВФоне(
			Знач ЗаполненныеПараметрыЗапроса, 
			Знач СледующаяСтраница = Ложь)
	
	ПараметрыЗапроса = ТорговыеПредложенияСлужебный.НовыеПараметрыПоискаТорговыхПредложенийСОтборами(ОтборОрганизация);
	
	Если ПараметрыЗапроса <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ЗаполненныеПараметрыЗапроса);
	КонецЕсли;
	
	ЗаполнитьПараметрыЗапросаПоискТорговыхПредложений(ПараметрыЗапроса, СледующаяСтраница);
	
	Если ФоновоеЗаданиеПоиска <> Неопределено 
		И ЗначениеЗаполнено(ФоновоеЗаданиеПоиска.ИдентификаторЗадания) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ФоновоеЗаданиеПоиска.ИдентификаторЗадания);
		ФоновоеЗаданиеПоиска.ИдентификаторЗадания = Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = 
		НСтр("ru = '1С:Бизнес-сеть. Поиск торговых предложений по отборам.'");
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение           = 0;
	
	ФоновоеЗаданиеПоиска = ДлительныеОперации.ВыполнитьВФоне(
		"ТорговыеПредложенияСлужебный.ПоискТорговыхПредложенийПоОтборуВФоне",
		ПараметрыЗапроса,
		ПараметрыВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиТорговыеПредложенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// Инициализация.
	Отказ = Ложь; 
		
	// Данное задание отменено или не является последним
	Если ФоновоеЗаданиеПоискаОтменено(ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Вывод сообщений из фонового задания.
	ТорговыеПредложенияКлиент.ОбработатьОшибкиФоновогоЗадания(Результат, Отказ);
	Если Результат = Неопределено Или ФоновоеЗаданиеПоиска = Неопределено Тогда
		УстановитьВидимостьДоступность(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	// Сохранение текущей строки для позиционирования после загрузки.
	ТекущаяСтрокаСписка = Неопределено;
	Если ДополнительныеПараметры <> Неопределено 
		И ДополнительныеПараметры.СледующаяСтраница
		И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ТекущаяСтрокаСписка = Элементы.Список.ТекущиеДанные.ПолучитьИдентификатор();
		
	КонецЕсли;
	
	// Проверка результата поиска.
	Если НЕ Отказ И Результат.Статус = "Выполнено" Тогда
		Если ЗначениеЗаполнено(Результат.АдресРезультата)
			И ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
				
				ЗаполнитьТаблицуТорговыхПредложений(Результат.АдресРезультата);
				ТорговыеПредложенияСлужебныйКлиент.СформироватьАдресаВременныхХранилищДляРеквизита(
					Товары, "АдресИзображения", УникальныйИдентификатор);
				ЗагрузитьПредварительныеИзображенияКорзины(Товары);	
				РазвернутьДеревоКатегорий();
				
				ФоновоеЗаданиеПоиска = Неопределено;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДоступность(ЭтотОбъект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьКнопкуСводныхДанныхКорзины();
 	ПоказатьСтраницуРезультатТоваровВКорзине();
	ОбновитьИтогиПоКорзине();
	НастроитьВидимостьЭлементовИКомандКраткойИнформации();
	НастроитьВидимостьКомандыОчиститьКорзину();
			
	// Позиционирование на текущей строке списка.
	Если ТекущаяСтрокаСписка <> Неопределено Тогда
		Элементы.Список.ТекущаяСтрока = ТекущаяСтрокаСписка;
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.Список;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияОрганизации()
	
	ЗаполнитьОрганизации();
	НайтиТорговыеПредложения(Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьПараметрыЗапроса(ПолучитьДеревоКатегорий = Ложь)
	
	ПараметрыЗапроса = НовыйПараметрыЗапросаПоискаНайтиТорговыеПредложения();
	ПараметрыЗапроса.ПолучитьДеревоКатегорий = ПолучитьДеревоКатегорий;
	ПараметрыЗапроса.ПолучитьДанныеКорзины = Истина;
	
	ПолучитьПараметрыИзДереваОтборов(ПараметрыЗапроса, ПолучитьДеревоКатегорий);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьПараметрыИзДереваОтборов(ПараметрыЗапроса, ПолучитьДеревоКатегорий = Ложь)
	
	ЭлементыОтборов = ДеревоОтборов.ПолучитьЭлементы();
	Для Каждого ЭлементОтбора Из ЭлементыОтборов Цикл
		
		Если ПолучитьДеревоКатегорий И ЭлементОтбора.Идентификатор = "Цена" Тогда
			ЭлементОтбора.МинимальноеЗначение = "";
			ЭлементОтбора.МаксимальноеЗначение = "";
		КонецЕсли;
		
		Если НЕ ЭлементОтбора.Отбор Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторОтбора = ЭлементОтбора.Идентификатор;
		
		Если ЭлементОтбора.ФиксированныйОтбор Тогда
			
			Если ПараметрыЗапроса.Свойство(ИдентификаторОтбора) Тогда
				ПараметрыЗапроса[ИдентификаторОтбора] = ЭлементОтбора.Отбор;
			КонецЕсли;
			
			Если ИдентификаторОтбора = "Цена" 
				И ЗначениеЗаполнено(ЭлементОтбора.ИнтервалОт) 
				И ЗначениеЗаполнено(ЭлементОтбора.ИнтервалДо) Тогда
				
				ПараметрыЗапроса.ЦенаОт = ЭлементОтбора.ИнтервалОт;
				ПараметрыЗапроса.ЦенаДо = ЭлементОтбора.ИнтервалДо;
				
			КонецЕсли;
			
		Иначе
			
			СтруктураАтрибутов        = Неопределено;
			ОбщегоНазначенияБЭДКлиент.ОбработатьЭлементыДереваОтборовПоДополнительнымРеквизитам(
				ЭлементОтбора, БыстрыеОтборы, СтруктураАтрибутов);
			
			ЗаполнитьМассивАтрибутов(ПараметрыЗапроса.Свойства, СтруктураАтрибутов, ЭлементОтбора);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМассивАтрибутов(МассивАтрибутов, СтруктураАтрибутов, ЭлементОтбора)
	
	Если СтруктураАтрибутов <> Неопределено Тогда
		Если ЭлементОтбора.ЗначениеОтбора = "Список" Тогда
			
			МассивИдентификаторовЗначений = СтруктураАтрибутов.ИдентификаторыЗначений;
			Для Каждого ЭлементМассива Из МассивИдентификаторовЗначений Цикл
				
				ПараметрыАтрибутов = ПолучитьПараметрыАтрибутов(
								СтруктураАтрибутов.Идентификатор, ЭлементМассива);
				МассивАтрибутов.Добавить(ПараметрыАтрибутов);
				
			КонецЦикла;
			
		Иначе
			
			Если ТипЗнч(ЭлементОтбора.ЗначениеОтбора) = Тип("Булево") Тогда
				Значение = СтруктураАтрибутов.Значение;
			Иначе
				
				ШаблонЗначения = "%1~%2";
				
				Если ТипЗнч(ЭлементОтбора.ЗначениеОтбора) = Тип("Дата") Тогда
					СтруктураАтрибутов.МинимальноеЗначение = Формат(СтруктураАтрибутов.МинимальноеЗначение,
						"ДФ=yyyy-MM-dd;");
					СтруктураАтрибутов.МаксимальноеЗначение = Формат(
									СтруктураАтрибутов.МаксимальноеЗначение, "ДФ=yyyy-MM-dd;");
				КонецЕсли;
				
				Значение = СтрШаблон(ШаблонЗначения, СтруктураАтрибутов.МинимальноеЗначение,
					СтруктураАтрибутов.МаксимальноеЗначение);
				
			КонецЕсли;
			
			ПараметрыАтрибутов = ПолучитьПараметрыАтрибутов(СтруктураАтрибутов.Идентификатор, Значение);
			МассивАтрибутов.Добавить(ПараметрыАтрибутов);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыАтрибутов(Идентификатор, Значение)
	
	ПараметрыАтрибутов = Новый Структура;
	ПараметрыАтрибутов.Вставить("Идентификатор", Идентификатор);
	ПараметрыАтрибутов.Вставить("Значение", Значение);
	
	Возврат ПараметрыАтрибутов;
	
КонецФункции

// Дозаполнить параметры запроса.
// 
// Параметры:
//  ПараметрыЗапроса - см. ТорговыеПредложенияСлужебный.НовыеПараметрыПоискаТорговыхПредложенийСОтборами
//  СледующаяСтраница - Булево
//
&НаСервере
Процедура ЗаполнитьПараметрыЗапросаПоискТорговыхПредложений(ПараметрыЗапроса, Знач СледующаяСтраница = Ложь)
	
	// Постраничный вывод.
	Если СледующаяСтраница Тогда
		Если Страницы.Страница < Страницы.КоличествоСтраниц - 1 Тогда
			Страницы.Страница = Страницы.Страница + 1;
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		Страницы.Страница = 0;
	КонецЕсли;
	
	ПараметрыЗапроса.Страница = Страницы.Страница;
	ПараметрыЗапроса.РазмерСтраницы = Страницы.РазмерСтраницы;
	ПараметрыЗапроса.Валюта = ТорговыеПредложенияПовтИсп.КодВалюты(Валюта);
	ПараметрыЗапроса.Сортировка = РежимСортировки;
	
	Если ПараметрыЗапроса.ПолучитьДанныеКорзины Тогда
		ПараметрыЗапроса.АдресКорзины = АдресКорзины;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяКатегория) Тогда
		ПараметрыЗапроса.ИдентификаторКатегории = ТекущаяКатегория;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборНаименование) Тогда
		СтрокаПоиска = ОтборНаименование;
		ПараметрыЗапроса.Наименование = ОтборНаименование;
	ИначеЕсли ЗначениеЗаполнено(СтрокаПоиска) Тогда
		ПараметрыЗапроса.Наименование = СтрокаПоиска;
	КонецЕсли;
	
	// Сброс наименования, если размер строки менее минимального значения.
	Если ЗначениеЗаполнено(ПараметрыЗапроса.Наименование) 
		И СтрДлина(ПараметрыЗапроса.Наименование) < 3 Тогда
		ПараметрыЗапроса.Наименование = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборАртикулы) Тогда
		ПараметрыЗапроса.Артикулы = ОтборАртикулы.ВыгрузитьЗначения();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборШтрихкоды) Тогда
		ПараметрыЗапроса.Штрихкоды = ОтборШтрихкоды.ВыгрузитьЗначения();
	КонецЕсли;
	
	// Регионы поиска.
	Если (ЗначениеЗаполнено(РегионПоиска) И РегионПоиска.РежимОтбора <> 0)
		И ИдентификаторыРегионов.Количество() Тогда
		
		ЗначениеИдентификаторыРегионов = РеквизитФормыВЗначение("ИдентификаторыРегионов", Тип("ТаблицаЗначений"));
		Для Каждого ЭлементКоллекции Из ЗначениеИдентификаторыРегионов Цикл
			НастройкиРегионов = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ЭлементКоллекции);
			Если ВозможенСамовывоз = ВозможнаДоставка Тогда 
				// Если выбраны обе опции или не выбрана ни одна - это одно и тоже, надо установить отбор по всем способам доставки.
				ПараметрыЗапроса.РегионыПоиска.Добавить(НастройкиРегионов);
			ИначеЕсли (ВозможенСамовывоз И ЭлементКоллекции.ДляСамовывоза)
				ИЛИ (ВозможнаДоставка И ЭлементКоллекции.ДляДоставки) Тогда
				// Если выбрана одна из опций - это осознанное решение и отбор делается по одному способу доставки.
				ПараметрыЗапроса.РегионыПоиска.Добавить(НастройкиРегионов);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		ПараметрыКонтрагента = ОбщегоНазначенияБЭД.ДанныеЮрФизЛица(Контрагент);
		
		ИННКонтрагента = ПараметрыКонтрагента.Инн;
		КППКонтрагента = ПараметрыКонтрагента.Кпп;
		НаименованиеКонтрагента = ПараметрыКонтрагента.ПолноеНаименование;
		
		СтрокаПараметрыКонтрагента = ПараметрыЗапроса.Контрагенты.Добавить();
		СтрокаПараметрыКонтрагента.ИНН = ИННКонтрагента;
		СтрокаПараметрыКонтрагента.КПП = КППКонтрагента;
		
	ИначеЕсли  ЗначениеЗаполнено(ИННКонтрагента) 
			ИЛИ ЗначениеЗаполнено(КППКонтрагента) 
			ИЛИ ЗначениеЗаполнено(НаименованиеКонтрагента) Тогда
		
		СтрокаПараметрыКонтрагента = ПараметрыЗапроса.Контрагенты.Добавить();
		СтрокаПараметрыКонтрагента.ИНН = ИННКонтрагента;
		СтрокаПараметрыКонтрагента.КПП = КППКонтрагента;
		
		ТипЧисло = Новый ОписаниеТипов("Число");
		Если ПустаяСтрока(ИННКонтрагента) И ТипЧисло.ПривестиЗначение(НаименованиеКонтрагента) <> 0 Тогда
			СтрокаПараметрыКонтрагента.ИНН = НаименованиеКонтрагента;
		Иначе
			СтрокаПараметрыКонтрагента.Наименование = НаименованиеКонтрагента;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборНоменклатураСервиса) Тогда
		НовыйОтбор = ПараметрыЗапроса.НоменклатураСервиса.Добавить();
		НовыйОтбор.ИдентификаторНоменклатуры = ОтборНоменклатураСервиса;
		НовыйОтбор.ИдентификаторХарактеристики = ОтборХарактеристикаСервиса;
		СтрокаПоиска = ОтборНоменклатураСервисаПредставление;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция МинимальноеКоличествоДляЗаказа(Цены)
	
	Результат = 0;
	
	Если Не ЗначениеЗаполнено(Цены) Тогда
		Результат = 1;
		Возврат Результат;
	КонецЕсли;
	
	Для каждого ЭлементКоллекции Из Цены Цикл
		
		Если ЭлементКоллекции.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;	
			
		Если Результат = 0 Тогда
			Результат = ЭлементКоллекции.Количество;
			Продолжить;
		КонецЕсли;
			
		Результат = Мин(Результат, ЭлементКоллекции.Количество);
		
	КонецЦикла;
	
	Если Результат = 0 Тогда
		Результат = 1;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПерсональнуюЦену(СтруктураПредложений, ЦелевыеКонтрагенты)
	
	Если ЦелевыеКонтрагенты = Неопределено Или ЦелевыеКонтрагенты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЮрФизЛица = ОбщегоНазначенияБЭД.ДанныеЮрФизЛица(ОтборОрганизация);
	
	ПоисковыеДанные = "";
	Если ИнтеграцияТорговыеПредложения.ЭтоФизЛицо(ОтборОрганизация) Тогда
		ПоисковыеДанные = ДанныеЮрФизЛица.ИНН;
	Иначе
		ШаблонПоисковыеДанные = "%1:%2";
		ПоисковыеДанные = СтрШаблон(ШаблонПоисковыеДанные, ДанныеЮрФизЛица.ИНН, ДанныеЮрФизЛица.КПП);
	КонецЕсли;
	
	Если ПустаяСтрока(ПоисковыеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаКонтрагента = ЦелевыеКонтрагенты.Найти(ПоисковыеДанные, "ИНН_КПП");
	Если СтрокаКонтрагента <> Неопределено Тогда
		СтруктураПредложений.ПерсональнаяЦена = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресаКартинок(СтруктураПредложений, АдресаКартинок)
	
	Если АдресаКартинок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаАдресКартинки Из АдресаКартинок Цикл
		
		НоваяСтрокаДанныхКартинки = СтруктураПредложений.АдресаКартинок.Добавить();
		НоваяСтрокаДанныхКартинки.АдресВСервисе = СтрокаАдресКартинки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТорговыхПредложений(Знач АдресРезультата)
	
	ДанныеПоискаИзСервиса = ОбработатьРезультатПоиска(АдресРезультата);
	
	Если ДанныеПоискаИзСервиса = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеПоискаИзСервиса.ДеревоКатегорий) Тогда
		НовыйДеревоКатегорийКонтрольнаяСуммаСтрокой = 
			ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ДанныеПоискаИзСервиса.ДеревоКатегорий);
		Если НовыйДеревоКатегорийКонтрольнаяСуммаСтрокой <> ДеревоКатегорийКонтрольнаяСуммаСтрокой Тогда
			ДеревоКатегорийКонтрольнаяСуммаСтрокой = НовыйДеревоКатегорийКонтрольнаяСуммаСтрокой;
			ЗначениеВРеквизитФормы(ДанныеПоискаИзСервиса.ДеревоКатегорий, "Категории");
			ОтобразитьСтраницуКатегорий();
 		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПоискаИзСервиса.ДанныеКорзины) Тогда
		НовыйДанныеКорзиныКонтрольнаяСуммаСтрокой = 
			ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ДанныеПоискаИзСервиса.ДанныеКорзины);
		Если НовыйДанныеКорзиныКонтрольнаяСуммаСтрокой <> ДанныеКорзиныКонтрольнаяСуммаСтрокой Тогда
			ДанныеКорзиныКонтрольнаяСуммаСтрокой = НовыйДанныеКорзиныКонтрольнаяСуммаСтрокой;
			ТорговыеПредложенияСлужебный.ПеречитатьКорзину(
				АдресКорзины, АдресКомандыДобавитьТовар, ДанныеПоискаИзСервиса.ДанныеКорзины, Товары, Валюта);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеПоискаИзСервиса.Свойство("Страницы") Тогда
		ЗаполнитьЗначенияСвойств(Страницы, ДанныеПоискаИзСервиса.Страницы);
	КонецЕсли;
	
	МассивТорговыхПредложений = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДанныеПоискаИзСервиса, "МассивПредложений", Новый Массив);
	
	КоличествоПредложений = МассивТорговыхПредложений.Количество();
	Если КоличествоПредложений = 0 Тогда
		ОчиститьСписокПредложений();
	Иначе
		// Если страница не равна 0 значит запрашивается следующая страница.
		Если Страницы.Страница = 0 Тогда
			ОчиститьСписокПредложений();
		КонецЕсли;
		
		Для Каждого ЭлементКоллекции Из МассивТорговыхПредложений Цикл
			
			НоваяСтрока = Список.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементКоллекции, , "АдресаКартинок, ЦеныВВалютеПредложения");
			
			// Изображения.
			Для Каждого СтрокаКартинки Из ЭлементКоллекции.АдресаКартинок Цикл
				НоваяСтрокаКартинки = НоваяСтрока.АдресаКартинок.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаКартинки, СтрокаКартинки);
			КонецЦикла;
			
			// Матрица цен в валюте предложения.
			Для Каждого СтрокаЦены Из ЭлементКоллекции.ЦеныВВалютеПредложения Цикл
				НоваяСтрокаЦеныВалютаПредложения = НоваяСтрока.ЦеныВВалютеПредложения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаЦеныВалютаПредложения, СтрокаЦены);
			КонецЦикла;
			
			УстановитьЦенуСтрокиСписка(НоваяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьКоличествоТорговыхПредложений(Список, Товары); 
	
	УстановитьВидимостьКнопкиЕще();
		
КонецПроцедуры 

&НаСервере
Процедура УстановитьВидимостьКнопкиЕще()	

	ЭтоПоследняяСтраница = Страницы.КоличествоСтраниц - Страницы.Страница <= 1;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПоказатьЕще", "Видимость", Не ЭтоПоследняяСтраница);		

КонецПроцедуры

&НаСервере
Процедура ОчиститьСписокПредложений()
	Для Каждого СтрокаСписка Из Список Цикл
		Для Каждого АдресХранилищаКартинки Из СтрокаСписка.АдресаКартинок Цикл
			Если ЭтоАдресВременногоХранилища(АдресХранилищаКартинки.АдресВХранилище) Тогда
				УдалитьИзВременногоХранилища(АдресХранилищаКартинки.АдресВХранилище);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Список.Очистить();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьКоличествоТорговыхПредложений(Список, Товары)
	
	Для Каждого СтрокаТовары Из Товары Цикл
		СтрокиСписка = Список.НайтиСтроки(Новый Структура("Идентификатор", СтрокаТовары.Идентификатор));
		Если СтрокиСписка.Количество() Тогда
			СтрокиСписка[0].ГиперссылкаДобавить = СтрокаТовары.Количество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УказатьНаличиеСкидки(СтрокаДанных) 
	СтрокаДанных.ЕстьСкидка = СтрокаДанных.ЦенаДоСкидки <> 0; 
КонецПроцедуры

&НаСервере
Процедура УказатьПредставлениеЦенаВключаетНДС(СтрокаДанных)
	
	Если СтрокаДанных.ЦенаВключаетНДС Тогда
		СтрокаДанных.ПредставлениеЦенаВключаетНДС = НСтр("ru = 'Входит
		|в стоимость'", ОбщегоНазначения.КодОсновногоЯзыка());	
	Иначе
		СтрокаДанных.ПредставлениеЦенаВключаетНДС = НСтр("ru = 'Не входит
		|в стоимость'", ОбщегоНазначения.КодОсновногоЯзыка());	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УказатьНаличиеПоКоличеству(СтрокаДанных)
	
	Если СтрокаДанных.Наличие <> Неопределено Тогда
		Возврат;	
	КонецЕсли;  
	
	Если СтрокаДанных.Количество = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДанных.Количество > 0 Тогда
		СтрокаДанных.Наличие = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммыСтрокиСписка(СтрокаДанных)
	
	Если Не ЗначениеЗаполнено(СтрокаДанных.Цена) Тогда
		Возврат;
	КонецЕсли;
	
	// Вычисление суммы НДС для основной цены.
	СуммыДаннымСтроки = СуммыПоЦенеКоличеству(
		СтрокаДанных.Цена, 
		1,
		СтрокаДанных.СтавкаНДС,
		СтрокаДанных.ЦенаВключаетНДС);
	
	СтрокаДанных.СуммаНДС = СуммыДаннымСтроки.СуммаНДС;
	
	// Вычисление суммы НДС для цены до скидки.
	Если СтрокаДанных.ЦенаДоСкидки > 0 Тогда
		СуммыДаннымСтроки = СуммыПоЦенеКоличеству(
			СтрокаДанных.ЦенаДоСкидки, 
			1,
			СтрокаДанных.СтавкаНДС,
			СтрокаДанных.ЦенаВключаетНДС);
			
		СтрокаДанных.СуммаНДСЦенаДоСкидки = СуммыДаннымСтроки.СуммаНДС;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СуммыПоЦенеКоличеству(Знач Цена, Знач Количество, Знач СтавкаНДС, Знач ЦенаВключаетНДС)
	Возврат ТорговыеПредложенияСлужебный.СуммыПоЦенеКоличеству(Цена, Количество, СтавкаНДС, ЦенаВключаетНДС);
КонецФункции

&НаСервереБезКонтекста
Функция ПересчитатьВВалюту(Знач Сумма, Знач ИсходнаяВалюта, Знач НоваяВалюта, Знач Дата = Неопределено)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Возврат ТорговыеПредложенияСлужебный.ПересчитатьВВалюту(Сумма, ИсходнаяВалюта, НоваяВалюта, Дата);
	
КонецФункции

&НаСервере
Процедура УстановитьЦенуСтрокиСписка(СтрокаДанных)
	
	// Объявление переменных.
	МассивСтрокПредставлениеЦены = Новый Массив;
	Приставка = "";
	ОписаниеПересчетаВалюты = "";
	
	ИтоговаяОсновнаяЦена = РассчитатьЦенуСУчетомСтавкиНДС(
		СтрокаДанных.ЦенаВключаетНДС, СтрокаДанных.Цена, СтрокаДанных.СуммаНДС);
	
	ПредставлениеЦены = ТорговыеПредложенияСлужебный.ПредставлениеЦены(ИтоговаяОсновнаяЦена);
	
	ИсточникЦен = СтрокаДанных.ЦеныВВалютеПредложения;
	Если ИсточникЦен.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникЦен.Сортировать("Цена Возр");
	
	// Торговое предложение в иностранной валюте
	Если СтрокаДанных.Валюта <> СтрокаДанных.ВалютаПредложения Тогда
		
		Приставка = "~ ";
		
		Цена = ИсточникЦен[0].Цена;
		СуммыСтроки = СуммыПоЦенеКоличеству(Цена, 1, СтрокаДанных.СтавкаНДС, СтрокаДанных.ЦенаВключаетНДС);
		Цена = РассчитатьЦенуСУчетомСтавкиНДС(
			СтрокаДанных.ЦенаВключаетНДС, Цена, СуммыСтроки.СуммаНДС);
		
		ОписаниеПересчетаВалютыШаблон = НСтр("ru = 'Цена %1 %2.
		|Цена в %3 рассчитана автоматически по курсу ЦБ и может не совпадать с курсом
		|поставщика.'");
		ОписаниеПересчетаВалюты = СтрШаблон(
			ОписаниеПересчетаВалютыШаблон, 
			Цена, 
			СтрокаДанных.ВалютаПредложения, 
			СтрокаДанных.Валюта);
		
	КонецЕсли;
	
	// Торговое предложение содержит матрицу цен.
	Если ИсточникЦен.Количество() > 1 Тогда
		Приставка = Приставка + "от ";
	КонецЕсли;
	
	// Торговое предложение по персональной цене.
	Если СтрокаДанных.ПерсональнаяЦена И ИтоговаяОсновнаяЦена > 0 Тогда
		ПредставлениеЦены = ПредставлениеЦены + "*";
	КонецЕсли;
	
	Если Не ПустаяСтрока(Приставка) Тогда
		ПредставлениеЦены = Приставка + ПредставлениеЦены;
	КонецЕсли;
	
	// Сборка текста преставления цены.
	МассивСтрокПредставлениеЦены.Добавить(СокрЛП(ПредставлениеЦены));
	
	Если Не ПустаяСтрока(ОписаниеПересчетаВалюты) Тогда
		МассивСтрокПредставлениеЦены.Добавить("");
		МассивСтрокПредставлениеЦены.Добавить(ОписаниеПересчетаВалюты);
	КонецЕсли;
	
	Если ИсточникЦен.Количество() > 1 Тогда
		
		МассивСтрокПредставлениеЦены.Добавить("");
		
		ОписаниеМатрицыШаблон = НСтр("ru = 'Цена %1 %2 от %3 %4'");
		ИсточникЦен.Сортировать("Количество ВОЗР");
		Для Каждого СтрокаМатрицы Из ИсточникЦен Цикл
			
			СуммыСтроки = СуммыПоЦенеКоличеству(
				СтрокаМатрицы.Цена, 1, СтрокаДанных.СтавкаНДС, СтрокаДанных.ЦенаВключаетНДС);
			
			Цена = РассчитатьЦенуСУчетомСтавкиНДС(
				СтрокаДанных.ЦенаВключаетНДС, СтрокаМатрицы.Цена, СуммыСтроки.СуммаНДС);
			
			ОписаниеМатрицыСтрока = СтрШаблон(
				ОписаниеМатрицыШаблон, 
				Цена, 
				СтрокаДанных.ВалютаПредложения, 
				СтрокаМатрицы.Количество, 
				СтрокаДанных.ЕдиницаИзмерения);
			
			МассивСтрокПредставлениеЦены.Добавить(СокрЛ(ОписаниеМатрицыСтрока));
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СтрокаДанных.ПерсональнаяЦена И ИтоговаяОсновнаяЦена > 0 Тогда
		МассивСтрокПредставлениеЦены.Добавить("");
		МассивСтрокПредставлениеЦены.Добавить(НСтр("ru = 'Ваша персональная цена установленная поставщиком'"));
	КонецЕсли;
	
	СтрокаДанных.ПредставлениеЦены = СтрСоединить(МассивСтрокПредставлениеЦены, Символы.ПС);
	
КонецПроцедуры

&НаСервере
Функция РассчитатьЦенуСУчетомСтавкиНДС(ЦенаВключаетНДС, Цена, СуммаНДС)
	
	// Расчет представления цены с учетом настроек НДС.
	Если ОтображатьЦеныБезНДС 
		И ЦенаВключаетНДС Тогда
		
		Результат = Цена - СуммаНДС;
		
	ИначеЕсли Не ОтображатьЦеныБезНДС 
		И НЕ ЦенаВключаетНДС Тогда
		
		Результат  = Цена + СуммаНДС;
		
	Иначе
		
		Результат = Цена;
		
	КонецЕсли;
	
	Возврат Окр(Результат, 2, РежимОкругления.Окр15как20);
	
КонецФункции

&НаКлиенте
Процедура УдалитьКорзинуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьАдресКорзиныИзЛокальногоХранилища(АдресКомандыДобавитьТовар, АдресКорзины);
	ОчиститьТовары();
	ОбновитьИтогиПоКорзине();
	НастроитьВидимостьКомандыОчиститьКорзину();
	
	ТорговыеПредложенияКлиент.ОповеститьОбИзмененииКорзины(Результат.АдресРезультата, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТовары()
	
	Для Каждого ПозицияТовары Из Товары Цикл
		СтрокаСписка = Список.НайтиСтроки(Новый Структура("Идентификатор", ПозицияТовары.Идентификатор));
		Если СтрокаСписка.Количество() Тогда
			СтрокаСписка[0].ГиперссылкаДобавить = 0;
		КонецЕсли;
	КонецЦикла;
	Товары.Очистить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьАдресКорзиныИзЛокальногоХранилища(АдресКомандыДобавитьТовар, АдресКорзины)
	
	ТорговыеПредложенияСлужебный.УдалитьАдресКорзиныИзЛокальногоХранилища();
	
	АдресКомандыДобавитьТовар = "";
	АдресКорзины = "";
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеВалютыПоиска()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ИзменитьВалютуПоиска", "Заголовок", СтрШаблон(НСтр("ru = '%1'"), Валюта));
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРежимСортировки(Элементы, Знач НовыйРежим, Знач Валюта, Знач ОтображатьЦеныБезНДС)
	
	// Установка пометки.
	Для Каждого Элемент Из Элементы.ГруппаСортировкаЕще.ПодчиненныеЭлементы Цикл
		Элемент.Пометка = СтрНайти(Элемент.Имя, НовыйРежим) > 0;
	КонецЦикла; 
	
	УстановитьЗаголовкиПодсказкиКолонокСЦенами(Элементы, Валюта, ОтображатьЦеныБезНДС);
	
	Стрелка = ?(СтрНайти(НовыйРежим, "Возрастание"), "↑", "↓");
	
	Если СтрНайти(НовыйРежим, "Цена") Тогда
		Элементы.СписокПредставлениеЦены.Заголовок = Элементы.СписокПредставлениеЦены.Заголовок + " " + Стрелка;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиПодсказкиКолонокСЦенами(Элементы, Валюта, ОтображатьЦеныБезНДС)
		
	Если ОтображатьЦеныБезНДС Тогда
		ПредставлениеСтатусаНДС = НСтр("ru = '(без НДС)'");
	Иначе
		ПредставлениеСтатусаНДС = НСтр("ru = '(с НДС)'");
	КонецЕсли;
	
	Элементы.СписокПредставлениеЦены.Заголовок = СтрШаблон(НСтр("ru = 'Цена %1'"), ПредставлениеСтатусаНДС);
	
	ШаблонПодсказки = 
		НСтр("ru = 'Цена %1
					|
					|~  - Цена рассчитана по курсу ЦБ
					|от - Скидки за опт
					|*  - Персональная цена'");
	
	Элементы.СписокПредставлениеЦены.Подсказка = СтрШаблон(ШаблонПодсказки, ПредставлениеСтатусаНДС);
		
	Элементы.СписокЦена.Заголовок = СтрШаблон(НСтр("ru = 'Цена предложения'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПредложениеВТабличнойЧастиТовары(ИдентификаторПредложения, СтрокаСписка, Количество, АдресаКоманд)
				
	Если СтрокаСписка = Неопределено Тогда
		
		ДанныеТорговогоПредложенияИзСервиса = 
			ДанныеТорговогоПредложенияИзСервиса(ОтборОрганизация, ИдентификаторПредложения, Валюта);
			
		Если ДанныеТорговогоПредложенияИзСервиса = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаСписка = ДанныеТорговогоПредложенияИзСервиса;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресаКоманд) Тогда
		ЗаполнитьЗначенияСвойств(СтрокаСписка, АдресаКоманд);
	КонецЕсли;

	СтрокаТоваров = ТоварПоИдентификаторуПредложения(Товары, ИдентификаторПредложения);
	Если СтрокаТоваров = Неопределено Тогда
		
		// Добавление новой строки
		СтрокаТоваров = Товары.Добавить();

		Если СтрокаСписка.АдресаКартинок.Количество() > 0 Тогда
			ЗагрузитьПредварительноеИзображениеВФоне(
				СтрокаСписка.АдресаКартинок[0].АдресВСервисе,
				СтрокаТоваров.АдресИзображенияВСервисе,
				СтрокаТоваров.АдресИзображения);
		КонецЕсли;
		
	КонецЕсли;

	Для Каждого СтрокаЦенВВалютеПредложения Из СтрокаСписка.ЦеныВВалютеПредложения Цикл
		Если СтрокаЦенВВалютеПредложения.Количество <= Количество Тогда
			СтрокаСписка.ЦенаДоСкидки = СтрокаЦенВВалютеПредложения.ЦенаДоСкидки;
			СтрокаСписка.Цена = СтрокаЦенВВалютеПредложения.Цена;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаСписка);
	
	СтрокаТоваров.НаименованиеТовара = СтрокаСписка.НаименованиеНоменклатуры;
	СтрокаТоваров.ОписаниеУпаковки   = СтрокаСписка.ЕдиницаИзмерения; 
	СтрокаТоваров.Количество         = Количество;

	Если СтрокаТоваров.ВалютаПредложения <> СтрокаТоваров.Валюта Тогда
		СтрокаТоваров.Цена = ПересчитатьВВалюту(
			СтрокаТоваров.Цена,
			СтрокаТоваров.ВалютаПредложения,
			СтрокаТоваров.Валюта);
	КонецЕсли;

	СтрокаТоваров.ЕстьСкидка = СтрокаТоваров.ЦенаДоСкидки <> 0; 

	ДанныеСуммСтроки = СуммыПоЦенеКоличеству(
			СтрокаТоваров.Цена,
			СтрокаТоваров.Количество, 
			СтрокаТоваров.СтавкаНДС, 
			СтрокаТоваров.ЦенаВключаетНДС);
	
	СтрокаТоваров.Сумма = ДанныеСуммСтроки.Сумма;
	СтрокаТоваров.СуммаНДС = ДанныеСуммСтроки.СуммаНДС;
	
	КодОсновногоЯзыка = ОбщегоНазначенияКлиент.КодОсновногоЯзыка();
	Если НулевыеСтавкиНДС.НайтиПоЗначению(СтрокаТоваров.СтавкаНДС) <> Неопределено Тогда
		ТекстВключенияНДС = "";
	ИначеЕсли СтрокаТоваров.ЦенаВключаетНДС Тогда
		ТекстВключенияНДС = НСтр("ru = ', включено'", КодОсновногоЯзыка);
	Иначе
		ТекстВключенияНДС = НСтр("ru = ', не включено'", КодОсновногоЯзыка);
	КонецЕсли;
	
	СтрокаТоваров.ПредставлениеДанныхСтроки = СтрШаблон(
		НСтр("ru = 'Кол-во: %1 %2 | Сумма: %3 %4%5НДС: %6%7'", КодОсновногоЯзыка), 
		СтрокаТоваров.Количество, 
		СтрокаТоваров.ОписаниеУпаковки, 
		СтрокаТоваров.Сумма, 
		СтрокаТоваров.Валюта, 
		Символы.ПС,
		СтрокаТоваров.СтавкаНДС,
		ТекстВключенияНДС);
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеТорговогоПредложенияИзСервиса(Знач ОтборОрганизация, Знач ИдентификаторПредложения, Знач Валюта)

	ТорговоеПредложение = Неопределено;

	Отказ = Ложь;
	ТорговоеПредложение = ТорговыеПредложенияСлужебный.ПолучитьТорговоеПредложение(
		ОтборОрганизация, ИдентификаторПредложения, Валюта, Отказ);
	Если Отказ ИЛИ ТорговоеПредложение = Неопределено Тогда
		Возврат ТорговоеПредложение;
	КонецЕсли;
	
	Если ТорговоеПредложение.Свойство("АдресаКартинок") = Неопределено Тогда
		ТорговоеПредложение.Вставить("АдресаКартинок", ТорговоеПредложение.АдресаКартинокСервиса);
	КонецЕсли;
	
	ТорговоеПредложение.Вставить("АдресКомандыИзменитьКоличество", "");
	ТорговоеПредложение.Вставить("АдресКомандыУдалить", "");
	ТорговоеПредложение.Вставить("ЦенаДоСкидки", 0);
	ЦеныВВалютеПредложения = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТорговоеПредложение.Цены);
	ТорговоеПредложение.Вставить("ЦеныВВалютеПредложения", ЦеныВВалютеПредложения);
	ТорговоеПредложение.Вставить("ЕдиницаИзмерения", ТорговоеПредложение.УпаковкаНаименование);
	ТорговоеПредложение.Вставить("ВалютаПредложения", ТорговоеПредложение.Валюта);
	ТорговоеПредложение.Вставить("Валюта", ТорговоеПредложение.ВалютаПоиска);
	
	ТорговоеПредложение.Удалить("РодительскиеКатегории");
	ТорговоеПредложение.Удалить("Цены");
	ТорговоеПредложение.Удалить("ЦеныПоВалюте");

	Возврат ТорговоеПредложение;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПредварительноеИзображениеВФоне(АдресИзображенияВСервисе,
	АдресПредварительногоИзображенияВСервисе, АдресХранилища)
	
	АдресПредварительногоИзображенияВСервисе = 
		ТорговыеПредложенияСлужебныйКлиентСервер.АдресПредварительногоИзображенияПоАдресуОсновногоИзображенияИзСервиса(
			АдресИзображенияВСервисе);
				
	АдресХранилища = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор); 
	
	ЗагрузитьИзображениеВФонеНаСервере(
		АдресПредварительногоИзображенияВСервисе, 
		АдресХранилища, 
		ФоновоеЗаданиеЗагрузкиПредварительногоИзображения, 
		УникальныйИдентификатор); 
		
	Если ФоновоеЗаданиеЗагрузкиПредварительногоИзображения = Неопределено Тогда
		АдресХранилища = "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление() 
			
	// Гиперссылка списка формы Добавить - предложение добавлено в корзину.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокГиперссылкаДобавить.Имя);
	
	ОтборГруппа = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОтборГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ГиперссылкаДобавить");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.ВторойБрендовый);
	
	// Цена в валюте публикации "по запросу".
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокПредставлениеЦены.Имя);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.СписокПредставлениеЦены.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'по запросу'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.Серый);
	
	// Цена в валюте поиска "по запросу".
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокЦена.Имя);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.СписокЦена.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'по запросу'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.Серый);
	
	// Наличие "нет на складе".
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокНаличиеТекстом.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.СписокНаличие.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.Серый);
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Оформление дерева отборов.
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОтборовПредставлениеОтбораГиперссылка.Имя);
	
	ОтборГруппа = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОтборГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ОтборЭлемента = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.ПредставлениеОтбора");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.ФиксированноеЗначение");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.ВторойБрендовый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ДействиеВКолонкеСпискаШрифт);
	
	// Оформление видимости колонок для строки Поставщик.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОтборовПредставлениеОтбораГиперссылка.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.ИмяРеквизита");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Поставщик";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОтборовПредставлениеОтбора.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.ИмяРеквизита");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = "Поставщик";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Скрытие пустой колонки для списочных отборов.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОтборовПредставлениеОтбораГиперссылка.Имя);
	
	ОтборГруппа = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОтборГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.ЗначениеОтбора");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Неопределено;
	
	ОтборЭлемента = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.ФиксированноеЗначение");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.ФиксированныйОтбор");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Скрытие пустой колонки для отборов типа булево, список.
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОтборовПредставлениеОтбора.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОтборовПредставлениеОтбораГиперссылка.Имя);
	
	ОтборГруппаИЛИ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОтборГруппаИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ОтборЭлемента = ОтборГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.ЗначениеОтбора");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ОтборГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.ЗначениеОтбора");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Список";

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	// Оформление представления строки Поставщик.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОтборовПредставлениеОтбора.Имя);
	
	ОтборГруппа = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОтборГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.ИмяРеквизита");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Поставщик";

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.ПредставлениеОтбора");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'ИНН, Наименование'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.Серый);
		
	// Выделение установленных отборов дерева жирным шрифтом.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОтборовПредставление.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОтборов.Отбор");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ВажнаяНадписьШрифт);    
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Оформление товаров в корзине
		
	// Установка представления строки
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличество.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Товары.Количество");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ПолеПредставление = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПредставлениеДанныхСтроки.ПутьКДанным);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ПолеПредставление);    
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(Знач Форма)
	
	Элементы = Форма.Элементы;
	ИдентификаторЗаданияОбработкиФильтровРубрикатора = Форма.ИдентификаторЗаданияОбработкиФильтровРубрикатора;
		
	// Установка видимости картинок длительных операций.	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"ДекорацияДлительнаяЗагрузкаСвойств", 
		"Видимость", 
		Не ПустаяСтрока(ИдентификаторЗаданияОбработкиФильтровРубрикатора));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СписокНаименованиеКонтрагента", "Видимость", 
			НЕ ЗначениеЗаполнено(Форма["Контрагент"])
			И НЕ ЗначениеЗаполнено(Форма["НаименованиеКонтрагента"]));
		
	ЕстьУстановленныеОтборы = ЕстьУстановленныеОтборы(Форма.ДеревоОтборов);
	УстановитьКартинкуОтборов(Элементы, ЕстьУстановленныеОтборы);
	УстановитьВидимостьКомандыОчисткиОтбора(Элементы, ЕстьУстановленныеОтборы);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСписка()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ТекущаяКолонка = Элементы.Список.ТекущийЭлемент;
	
	Если ТекущаяКолонка = Элементы.СписокГиперссылкаДобавить Тогда
		Если ТекущиеДанные.ГиперссылкаДобавить = 0 Тогда
			ТекущиеДанные.ГиперссылкаДобавить = 
				Макс(ТекущиеДанные.МинимальноеКоличество, ТекущиеДанные.КратностьУпаковки);
		КонецЕсли;
	Иначе
		ПараметрыОткрытия = ТорговыеПредложенияКлиент.НовыеПараметрыОткрытияФормыТорговогоПредложения();
		ПараметрыОткрытия.Идентификатор = ТекущиеДанные.Идентификатор;
		ПараметрыОткрытия.Валюта = Валюта;
		ПараметрыОткрытия.ИдентификаторЗаказа = ИдентификаторЗаказа;
		ПараметрыОткрытия.Организация = ОтборОрганизация;
		ТорговыеПредложенияКлиент.ОткрытьТорговоеПредложение(ПараметрыОткрытия, ЭтотОбъект, ТекущиеДанные.Идентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПредложениеСпискаВКорзину()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = ТекущиеДанные.Идентификатор;
	КоличествоВКорзине = ТекущиеДанные.ГиперссылкаДобавить;
	
	ДобавитьТоварИзменитьКоличество(Идентификатор, КоличествоВКорзине);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПредложениеТоваровВКорзину()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = ТекущиеДанные.Идентификатор;
	КоличествоВКорзине = ТекущиеДанные.Количество;
	
	ДобавитьТоварИзменитьКоличество(Идентификатор, КоличествоВКорзине);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииКоличестваВЗаказе(Идентификатор, КоличествоВКорзине, АдресаКоманд)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Идентификатор", Идентификатор);
	ПараметрыОповещения.Вставить("ИдентификаторЗаказа", ИдентификаторЗаказа);
	ПараметрыОповещения.Вставить("Количество", КоличествоВКорзине);
	ПараметрыОповещения.Вставить("АдресаКоманд", АдресаКоманд);
	
	Оповестить("ТорговыеПредложения_ИзменитьКоличествоВЗаказе", ПараметрыОповещения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьКорзинуИЗаполнитьКоманды(Знач Организация, АдресКорзины, АдресКомандыДобавитьТовар)
	ТорговыеПредложенияСлужебный.СоздатьКорзинуИЗаполнитьКоманды(Организация, АдресКорзины, АдресКомандыДобавитьТовар);
КонецПроцедуры

&НаКлиенте
Функция КоличествоТовараВЗаказе(ИдентификаторПредложения)
	
	Результат = 0;
	
	СтрокаЗаказа = Товары.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторПредложения));
	Если СтрокаЗаказа.Количество() Тогда
		Результат = СтрокаЗаказа[0].Количество;
	Иначе
		Результат = 0;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьТоварИзменитьКоличество(ИдентификаторПредложения, Количество)
	
	Если Не ЗначениеЗаполнено(АдресКорзины) Тогда
		
		СоздатьКорзинуИЗаполнитьКоманды(ОтборОрганизация, АдресКорзины, АдресКомандыДобавитьТовар);
		
		Если Не ЗначениеЗаполнено(АдресКорзины) Или Не ЗначениеЗаполнено(АдресКомандыДобавитьТовар) Тогда
			Шаблон = НСтр("ru = 'Ошибка при создании корзины. Подробности в журнале регистрации.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(Шаблон);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура("Идентификатор", ИдентификаторПредложения);
	ПараметрыОповещения.Вставить("ОповеститьОбИзмененииКоличестваВЗаказе", Истина);
	ПараметрыОповещения.Вставить("КоличествоВКорзине", Количество);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействияНадТоваром", ЭтотОбъект, ПараметрыОповещения);
	
	ПараметрыРаботыСТоваром = ТорговыеПредложенияКлиент.ОписаниеПараметровРаботыСТоваромКорзины();
	
	КомандыТорговогоПредложения = ТорговыеПредложенияКлиент.КомандыТорговогоПредложения(
		ИдентификаторПредложения, Товары);
	
	ПараметрыРаботыСТоваром.Организация                    = ОтборОрганизация;
	ПараметрыРаботыСТоваром.АдресКомандыИзменитьКоличество = КомандыТорговогоПредложения.ИзменитьКоличество;
	ПараметрыРаботыСТоваром.Количество                     = Количество;
	ПараметрыРаботыСТоваром.АдресКорзины                   = АдресКорзины;
	ПараметрыРаботыСТоваром.ПрочитатьКорзину               = Истина;
	
	Если Не ЗначениеЗаполнено(ПараметрыРаботыСТоваром.АдресКомандыИзменитьКоличество) Тогда
		ПараметрыРаботыСТоваром.АдресКомандыДобавить              = АдресКомандыДобавитьТовар;
		ПараметрыРаботыСТоваром.ИдентификаторТорговогоПредложения = ИдентификаторПредложения;
	КонецЕсли;
	
	ТорговыеПредложенияКлиент.ВыполнитьДействиеСТоваромКорзины(ПараметрыРаботыСТоваром, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияДействияНадТоваром(Результат, ДополнительныеПараметры) Экспорт
			
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		Возврат;
	КонецЕсли;

	РезультатыДействияНадТоваром = РезультатыДействияНадТоваром(Результат.АдресРезультата);
	
	Если РезультатыДействияНадТоваром.Отказ Тогда
		
		КоличествоИзЗагруженныхДанныхКорзины = КоличествоТовараИзЗагруженныхДанныхКорзины(
			ДополнительныеПараметры.Идентификатор, РезультатыДействияНадТоваром.ДанныеКорзины);
			
		Если КоличествоИзЗагруженныхДанныхКорзины = 0 Тогда
			ИдентификаторыПредложенийДляУдаления = 
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеПараметры.Идентификатор);
			УдалитьПредложенияИзЭлементовКорзины(ИдентификаторыПредложенийДляУдаления);
		Иначе
			ИзменитьКоличествоПредложенияВЭлементахКорзины(
				ДополнительныеПараметры.Идентификатор, КоличествоИзЗагруженныхДанныхКорзины);
		КонецЕсли;
		
	Иначе
		
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДополнительныеПараметры, "ОповеститьОбИзмененииКоличестваВЗаказе", Ложь) Тогда
			АдресаКоманд = АдресаКомандПредложенияИзЗагруженныхДанныхКорзины(ДополнительныеПараметры.Идентификатор,
				РезультатыДействияНадТоваром.ДанныеКорзины);
			ОповеститьОбИзмененииКоличестваВЗаказе(
				ДополнительныеПараметры.Идентификатор, ДополнительныеПараметры.КоличествоВКорзине, АдресаКоманд);
		КонецЕсли;
		
		ТорговыеПредложенияКлиент.ОповеститьОбИзмененииКорзины(Результат.АдресРезультата, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РезультатыДействияНадТоваром(Знач АдресРезультата)
		
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("ДанныеКорзины");
	
	РезультатыДействияНадТоваром = ПолучитьИзВременногоХранилища(АдресРезультата);
	Ошибка = РезультатыДействияНадТоваром.Ошибка;
	Если Ошибка <> Неопределено Тогда
		Если Не ПустаяСтрока(Ошибка.ТекстОшибкиСервиса) Тогда
			ОбщегоНазначения.СообщитьПользователю(Ошибка.ТекстОшибкиСервиса);
		ИначеЕсли Не ПустаяСтрока(Ошибка.ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(Ошибка.ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Результат.Отказ = РезультатыДействияНадТоваром.Отказ;
	
	Если ЗначениеЗаполнено(РезультатыДействияНадТоваром.ДанныеКорзины) Тогда
		
		ДанныеКорзиныДляКлиента = Новый Структура("Заказы", Новый Массив); // Массив Из Структура
	
		Для Каждого Заказ Из РезультатыДействияНадТоваром.ДанныеКорзины.Заказы Цикл
			ТоварыЗаказа = Новый Структура("Товары", Новый Массив); // Массив Из Структура
			ТоварыЗаказа.Товары = ОбщегоНазначения.ТаблицаЗначенийВМассив(Заказ.Товары);
			ДанныеКорзиныДляКлиента.Заказы.Добавить(ТоварыЗаказа);
		КонецЦикла;
		
		Результат.ДанныеКорзины = ДанныеКорзиныДляКлиента;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КоличествоТовараИзЗагруженныхДанныхКорзины(ИдентификаторПредложения, ДанныеКорзины)
	
	Результат = 0;
	
	Если ДанныеКорзины.Заказы = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого Заказ Из ДанныеКорзины.Заказы Цикл
		Для Каждого СтрокаТовара Из Заказ.Товары Цикл
			
			Если СтрокаТовара.Идентификатор <> ИдентификаторПредложения Тогда
				Продолжить;
			КонецЕсли;
			
			Результат = СтрокаТовара.Количество;
			Возврат Результат;
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция АдресаКомандПредложенияИзЗагруженныхДанныхКорзины(ИдентификаторПредложения, ДанныеКорзины)
	
	Результат = Новый Структура;

	Для Каждого Заказ Из ДанныеКорзины.Заказы Цикл
		Для Каждого СтрокаТовара Из Заказ.Товары Цикл
			
			Если СтрокаТовара.Идентификатор <> ИдентификаторПредложения Тогда
				Продолжить;
			КонецЕсли;
			
			Результат.Вставить("АдресКомандыИзменитьКоличество", СтрокаТовара.АдресаКоманд.УстановитьКоличество);
			Результат.Вставить("АдресКомандыУдалить", СтрокаТовара.АдресаКоманд.УдалитьТовар);
			Возврат Результат;
			
		КонецЦикла;
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТоварПоИдентификаторуПредложения(Товары, ИдентификаторПредложения)
	
	СтрокиТоваров = Товары.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторПредложения));
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(СтрокиТоваров) Тогда
		Результат = СтрокиТоваров[0];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СнятьПометкуОтбораСпособДоставки()
	
	СтрокиДереваОтборов = ДеревоОтборов.ПолучитьЭлементы();
	Для Каждого СтрокаОтбора Из СтрокиДереваОтборов Цикл
		Если СтрокаОтбора.Идентификатор = "СпособДоставки" Тогда
			ЭлементыСпискаСпособаДоставки = СтрокаОтбора.ПолучитьЭлементы();
			Для Каждого СтрокаСпособаДоставки Из ЭлементыСпискаСпособаДоставки Цикл
				Если СтрокаСпособаДоставки.Идентификатор = "Доставка" Тогда
					ВозможнаДоставка = Ложь;
				ИначеЕсли СтрокаСпособаДоставки.Идентификатор = "Самовывоз" Тогда
					ВозможенСамовывоз = Ложь;
				КонецЕсли;
				СтрокаСпособаДоставки.Отбор = Ложь;
			КонецЦикла;
			СтрокаОтбора.Отбор = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегионыПоиска()

	БизнесСеть.ЗаполнитьРегионыПоиска(
		"ТорговыеПредложения",
		ОтборОрганизация, 
		РегионПоиска, 
		РегионЗаголовок, 
		ИдентификаторыРегионов);
		
	УстановитьЗаголовокКомандИзмененияРегиона(Элементы, РегионЗаголовок);

КонецПроцедуры

&НаСервере
Процедура СохранитьПрочитатьНастройкиРегионовПоиска()
	
	БизнесСеть.СохранитьНастройкиРегионовПоиска(
		РегионПоиска,
		"ТорговыеПредложения",
		ОтборОрганизация,
		РегионЗаголовок,
		ИдентификаторыРегионов);

	УстановитьЗаголовокКомандИзмененияРегиона(Элементы, РегионЗаголовок);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИзменениеВалютыПоиска()
	
	Если Товары.Количество() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ИзменитьВалютуПоискаПродолжение", ЭтотОбъект),
			НСтр("ru = 'При изменении валюты, список товаров для заказа будет очищен.'"),
			РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ИзменитьВалютуПоискаПродолжение(КодВозвратаДиалога.ОК, Неопределено);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВалютуПоискаПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ПоказатьВводЗначения(Новый ОписаниеОповещения("ИзменитьВалютуПоискаЗавершение", ЭтотОбъект), Валюта,
			НСтр("ru = 'Валюта поиска'"), Тип("СправочникСсылка.Валюты"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВалютуПоискаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено
		Или Валюта = Результат Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьТовары();
	ОбновитьИтогиПоКорзине();
	
	Валюта = Результат; 
	Элементы.ИзменитьВалютуПоиска.Заголовок = СтрШаблон(НСтр("ru = '%1'"), Валюта); 
	УстановитьРежимСортировки(Элементы, РежимСортировки, Валюта, ОтображатьЦеныБезНДС);
	НайтиТорговыеПредложения();
	
КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьВыборРегионаПоиска(ДополнительныеПараметры = Неопределено)
	
	ОчиститьСообщения();
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("РегионРежимОтбора",   РегионПоиска.РежимОтбора);
	ПараметрыОткрытия.Вставить("РегионПредставление", РегионПоиска.Представление);
	ПараметрыОткрытия.Вставить("РегионЗначенияПолей", РегионПоиска.ЗначенияПолей);
	ПараметрыОткрытия.Вставить("Организация",         ОтборОрганизация);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборРегионаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.ТорговыеПредложения.Форма.ВыборРегионаПоиска", ПараметрыОткрытия,
		ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРегионаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЭлементОтбора = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ЭлементОтбора");
	
	Если Результат = Неопределено Тогда
		Если ЭлементОтбора <> Неопределено Тогда
			ОбработатьУстановкуСпособаДоставки(ЭлементОтбора, Ложь, Истина);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("РегионРежимОтбора") Тогда
		Результат.Свойство("РегионРежимОтбора"  , РегионПоиска.РежимОтбора);
		Результат.Свойство("РегионПредставление", РегионПоиска.Представление);
		Результат.Свойство("РегионЗначенияПолей", РегионПоиска.ЗначенияПолей);
	КонецЕсли;
	
	СохранитьПрочитатьНастройкиРегионовПоиска();
	
	Если ЭлементОтбора <> Неопределено Тогда
		ОбработатьУстановкуСпособаДоставки(ЭлементОтбора, Истина, Истина);
	КонецЕсли;
	
	Если РегионПоиска.РежимОтбора = 0
		И ВозможенСамовывоз + ВозможнаДоставка > 0 Тогда
		СнятьПометкуОтбораСпособДоставки();
	КонецЕсли;
	
	НайтиТорговыеПредложения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпособыДоставки()
	
	СпособыДоставки.Добавить("СпособДоставки", 
		НСтр("ru = 'Доставка и самовывоз'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СпособыДоставки.Добавить("Доставка", "Доставка");
	СпособыДоставки.Добавить("Самовывоз", "Самовывоз");
	СпособыДоставки.Добавить("Отменить", "Отменить", , БиблиотекаКартинок.Остановить);
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьНулевыеСтавкиНДС()
	
	Если НулевыеСтавкиНДС.Количество() > 0 Тогда
		НулевыеСтавкиНДС.Очистить();
	КонецЕсли;
	
	МассивНулевыхСтавок = ТорговыеПредложенияСлужебный.НулевыеСтавкиНДС(); 
	НулевыеСтавкиНДС.ЗагрузитьЗначения(МассивНулевыхСтавок);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФиксированныеОтборыДерева()
	
	ЭлементыОтбора = ДеревоОтборов.ПолучитьЭлементы();
	ЭлементыОтбора.Очистить();
	
	Если Элементы.СписокОтборПоКонтрагенту.Видимость Тогда
		
		// Поставщик.
		НовыйОтбор = ЭлементыОтбора.Добавить();
		НовыйОтбор.ФиксированныйОтбор            = Истина;
		НовыйОтбор.ФиксированноеЗначение         = Истина;
		НовыйОтбор.Идентификатор                 = "Поставщик";
		НовыйОтбор.ИмяРеквизита                  = "Поставщик";
		НовыйОтбор.Представление                 = НСтр("ru='Поставщик'");
		НовыйОтбор.ОтборДоступен                 = Истина;
		НовыйОтбор.ЗначениеОтбора                = "";
		
	КонецЕсли;
	
	// Цена.
	НовыйОтбор = ЭлементыОтбора.Добавить();
	НовыйОтбор.ФиксированныйОтбор           = Истина;
	НовыйОтбор.Идентификатор                = "Цена";
	НовыйОтбор.ИмяРеквизита                 = "Цена";
	НовыйОтбор.Представление                = НСтр("ru='Цена предложения'");
	НовыйОтбор.ЗначениеОтбора               = 0;
	НовыйОтбор.ФиксированноеЗначение        = Истина;
	НовыйОтбор.ПредставлениеОтбора          = НСтр("ru = '<не задано>'");
	НовыйОтбор.ОтборДоступен                = Истина;
	
	// Со скидкой.
	НовыйОтбор = ЭлементыОтбора.Добавить();
	НовыйОтбор.ФиксированныйОтбор           = Истина;
	НовыйОтбор.Идентификатор                = "СоСкидкой";
	НовыйОтбор.ИмяРеквизита                 = "СоСкидкой";
	НовыйОтбор.Представление                = НСтр("ru='Со скидкой'");
	НовыйОтбор.ЗначениеОтбора               = Истина;
	НовыйОтбор.ФиксированноеЗначение        = Истина;
	
	// С изображением.
	НовыйОтбор = ЭлементыОтбора.Добавить();
	НовыйОтбор.ФиксированныйОтбор           = Истина;
	НовыйОтбор.Идентификатор                = "СИзображением";
	НовыйОтбор.ИмяРеквизита                 = "СИзображением";
	НовыйОтбор.Представление                = НСтр("ru='С изображением'");
	НовыйОтбор.ЗначениеОтбора               = Истина;
	НовыйОтбор.ФиксированноеЗначение        = Истина;
	
	// В наличии.
	НовыйОтбор = ЭлементыОтбора.Добавить();
	НовыйОтбор.ФиксированныйОтбор           = Истина;
	НовыйОтбор.Идентификатор                = "ВНаличии";
	НовыйОтбор.ИмяРеквизита                 = "ВНаличии";
	НовыйОтбор.Представление                = НСтр("ru='В наличии'");
	НовыйОтбор.ЗначениеОтбора               = Истина;
	НовыйОтбор.ФиксированноеЗначение        = Истина;
	
	// Способ доставки.
	НовыйОтбор = ЭлементыОтбора.Добавить();
	НовыйОтбор.ФиксированныйОтбор           = Истина;
	НовыйОтбор.Идентификатор                = "СпособДоставки";
	НовыйОтбор.ИмяРеквизита                 = "СпособДоставки";
	НовыйОтбор.Представление                = НСтр("ru='Способ доставки'");
	НовыйОтбор.ЗначениеОтбора               = "Список";
	
	НоваяСтрока = НовыйОтбор.ПолучитьЭлементы().Добавить();
	НоваяСтрока.ФиксированныйОтбор           = Истина;
	НоваяСтрока.Идентификатор                = "Доставка";
	НоваяСтрока.ИмяРеквизита                 = "Доставка";
	НоваяСтрока.Представление                = НСтр("ru='доставка'");
	НоваяСтрока.ЗначениеОтбора               = "Список";
	
	НоваяСтрока = НовыйОтбор.ПолучитьЭлементы().Добавить();
	НоваяСтрока.ФиксированныйОтбор           = Истина;
	НоваяСтрока.Идентификатор                = "Самовывоз";
	НоваяСтрока.ИмяРеквизита                 = "Самовывоз";
	НоваяСтрока.Представление                = НСтр("ru='самовывоз'");
	НоваяСтрока.ЗначениеОтбора               = "Список";
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборИОбновитьСписок()
	
	СтрокиДереваОтборов = ДеревоОтборов.ПолучитьЭлементы();
	Для Каждого СтрокаОтбора Из СтрокиДереваОтборов Цикл
		Идентификатор = СтрокаОтбора.Идентификатор;
		Если СтрокаОтбора.ФиксированныйОтбор Тогда
			Если Идентификатор = "Поставщик" Тогда
				Если РазрешитьИзменениеКонтрагента Тогда
					ОчиститьДанныеПоКонтрагенту(ЭтотОбъект);
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		СтрокаОтбора.Отбор = Ложь;
		Если СтрокаОтбора.ЗначениеОтбора = "Список" Тогда
			ЭлементыСпискаОтборов = СтрокаОтбора.ПолучитьЭлементы();
			Для Каждого ЭлементОтбора Из ЭлементыСпискаОтборов Цикл
				ЭлементОтбора.Отбор = Ложь;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ВозможнаДоставка  = Ложь;
	ВозможенСамовывоз = Ложь; 
	ЭлементСпособовДоставки = СпособыДоставки.НайтиПоЗначению("Отменить");
	ПослеВыбораСпособаДоставки(ЭлементСпособовДоставки, Неопределено);
		
	НайтиТорговыеПредложения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКонтрагента(ДополнительныеПараметры)
	
	ПараметрыОткрытия   = Новый Структура("ТекущаяСтрока, РежимВыбора", Контрагент, Истина);
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ДеревоОтборовПриИзмененииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ИмяФормыВыбора = БизнесСетьВызовСервера.ИмяФормыВыбораПоОпределяемомуТипу("КонтрагентБЭД");
	ОчиститьСообщения();
	ОткрытьФорму(ИмяФормыВыбора, ПараметрыОткрытия, ЭтотОбъект,,,, ОбработкаОповещения);
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция ПараметрыКонтрагента(Знач Контрагент)
	Возврат ОбщегоНазначенияБЭД.ДанныеЮрФизЛица(Контрагент);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьДанныеПоКонтрагенту(Форма)
	Форма.Контрагент               = Неопределено;
	Форма.НаименованиеКонтрагента  = "";
	Форма.ИННКонтрагента           = "";
	Форма.КППКонтрагента           = "";
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатИзмененияФиксированногоОтбора(ТекущаяСтрокаДерева, ДанныеОтбораИзменены, Знач Результат)
	
	Идентификатор = ТекущаяСтрокаДерева.Идентификатор;
	
	Если Идентификатор = "Поставщик" Тогда
		
		ОчиститьДанныеПоКонтрагенту(ЭтотОбъект);
		
		Если ТипЗнч(Результат) = Тип("Булево") Тогда
			
			Если Результат Тогда // Поставлена галочка отбора или вручную введено наименование поставщика.
				
				НаименованиеКонтрагента = ТекущаяСтрокаДерева.ПредставлениеОтбора;
				ИННКонтрагента = ТекущаяСтрокаДерева.ЗначениеОтбора;
				
				Если Контрагент = Неопределено Тогда
					// Ввели наименование поставщика вручную.
					ЗаполнитьДанныеКонтрагентаПоВведенномуПолю(НаименованиеКонтрагента, ИННКонтрагента, Контрагент);
				КонецЕсли;
				
				ЗаполнитьЭлементОтбораПоПоставщику(ДеревоОтборов, НаименованиеКонтрагента, ИННКонтрагента)
				
			Иначе // Сняли галочку отбора
				
				// Поле выбора поставщика пустое
				Если НЕ ЗначениеЗаполнено(ТекущаяСтрокаДерева.ПредставлениеОтбора) Тогда
					
					ТекущаяСтрокаДерева.ПредставлениеБыстрогоОтбора = "";
					
					ПредставлениеОтбора = Элементы.ДеревоОтборовПредставлениеОтбора;
					ТекущаяСтрокаДерева.Отбор               = Ложь;
					ПредставлениеОтбора.ТолькоПросмотр      = Истина;
					ПредставлениеОтбора.ПодсказкаВвода      = НСтр("ru = 'ИНН, наименование - от 3 симв.'");
					Если ЗначениеЗаполнено(ТекущаяСтрокаДерева.ЗначениеОтбора) Тогда
						ТекущаяСтрокаДерева.ЗначениеОтбора  = НаименованиеКонтрагента;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе // Тип ОпределяемыйТип.КонтрагентБЭД или Строка
			
			ТекущаяСтрокаДерева.ПредставлениеБыстрогоОтбора = "";
			
			Контрагент = Результат;
			ПараметрыКонтрагента = ПараметрыКонтрагента(Результат);
			НаименованиеКонтрагента = ПараметрыКонтрагента.Наименование;
			ИННКонтрагента = ПараметрыКонтрагента.Инн;
			КППКонтрагента = ПараметрыКонтрагента.КПП;
			
			ТекущаяСтрокаДерева.Отбор = Истина;
			
			ЗаполнитьЭлементОтбораПоПоставщику(ДеревоОтборов, НаименованиеКонтрагента, ИННКонтрагента)
			
		КонецЕсли; 
		
	ИначеЕсли Идентификатор = "СпособДоставки" Тогда
		
		СтрокиСпособаДоставки = ТекущаяСтрокаДерева.ПолучитьЭлементы();
		Для Каждого СтрокаСпособаДоставки Из СтрокиСпособаДоставки Цикл
			Если СтрокаСпособаДоставки.Идентификатор = "Доставка" Тогда
				ВозможнаДоставка = ТекущаяСтрокаДерева.Отбор;
			ИначеЕсли СтрокаСпособаДоставки.Идентификатор = "Самовывоз" Тогда
				ВозможенСамовывоз = ТекущаяСтрокаДерева.Отбор;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли Идентификатор = "Доставка" Тогда
		
		ВозможнаДоставка = ТекущаяСтрокаДерева.Отбор;
		
	ИначеЕсли Идентификатор = "Самовывоз" Тогда
		
		ВозможенСамовывоз = ТекущаяСтрокаДерева.Отбор;
		
	ИначеЕсли Идентификатор = "Цена" Тогда
		
		ДанныеОтбораИзменены = Результат; 
						
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеКонтрагентаПоВведенномуПолю(НаименованиеКонтрагента, ИННКонтрагента, Контрагент)
	
	Контрагент = ТорговыеПредложенияСлужебный.НайтиКонтрагентаПоИНН(НаименованиеКонтрагента);
	Если Контрагент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЮрФизЛица = ОбщегоНазначенияБЭД.ДанныеЮрФизЛица(Контрагент);
	ИННКонтрагента = ДанныеЮрФизЛица.ИНН;
	НаименованиеКонтрагента = ДанныеЮрФизЛица.Наименование;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПараметрыФормы()
	
	// Установка полученных параметров и отборов.
	Параметры.Свойство("ИдентификаторКатегории",          ТекущаяКатегория);
	Параметры.Свойство("ОтборНаименование",               ОтборНаименование);
	Параметры.Свойство("ОтборНоменклатураСервиса",        ОтборНоменклатураСервиса);
	Параметры.Свойство("ОтборНоменклатураСервисаПредставление", ОтборНоменклатураСервисаПредставление);
	Параметры.Свойство("ОтборХарактеристикаСервиса",      ОтборХарактеристикаСервиса);
	Параметры.Свойство("Валюта",                          Валюта);
	
	ПараметрКонтрагент = Параметры.Контрагент;
	Если ЗначениеЗаполнено(ПараметрКонтрагент) Тогда
		ЗаполнитьДанныеПоКонтрагенту(ПараметрКонтрагент, ЭтотОбъект);
	КонецЕсли;
	
	РазрешитьИзменениеКонтрагента = 
		Не Параметры.ФиксированныйОтборПоКонтрагенту Или Не ЗначениеЗаполнено(ПараметрКонтрагент);
	Элементы.СписокОтборПоКонтрагенту.Видимость = РазрешитьИзменениеКонтрагента;
	
	Если Параметры.Свойство("АдресПараметровОтбора") Тогда
		ЗаполнитьПараметрыОтборов(Параметры.АдресПараметровОтбора);
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборШтрихКоды") И ЗначениеЗаполнено(Параметры.ОтборШтрихКоды) Тогда
		ОтборШтрихКоды.ЗагрузитьЗначения(Параметры.ОтборШтрихКоды);
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборАртикулы") И ЗначениеЗаполнено(Параметры.ОтборАртикулы) Тогда
		ОтборАртикулы.ЗагрузитьЗначения(Параметры.ОтборАртикулы);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборНаименование) Тогда
		СтрокаПоиска = ОтборНаименование;
	КонецЕсли;
	
	ИдентификаторЗаказа = Параметры.ИдентификаторЗаказа;
	Если НЕ ЗначениеЗаполнено(Параметры.ИдентификаторЗаказа) Тогда
		ИдентификаторЗаказа = УникальныйИдентификатор;
	ИначеЕсли Не ПустаяСтрока(Параметры.АдресТоваровВХранилище) Тогда
		ТоварыОбъект = БизнесСеть.ПолучитьУдалитьИзВременногоХранилища(АдресТоваровВХранилище);
		Если ЗначениеЗаполнено(ТоварыОбъект) Тогда
			Товары.Загрузить(ТоварыОбъект);
		КонецЕсли;
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Функция ФоновоеЗаданиеПоискаОтменено(ДополнительныеПараметры)
	
	Отменено = 
		ДополнительныеПараметры <> Неопределено
		И ФоновоеЗаданиеПоиска <> Неопределено 
		И ДополнительныеПараметры.Свойство("ИдентификаторЗаданияПоиска")
		И ФоновоеЗаданиеПоиска.ИдентификаторЗадания <> ДополнительныеПараметры.ИдентификаторЗаданияПоиска;
	
	Возврат Отменено;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокИзменитьПредставлениеЦеныВСписке()
		
	Для Каждого ТекущаяСтрокаТоваров Из Список Цикл
		УстановитьЦенуСтрокиСписка(ТекущаяСтрокаТоваров);
	КонецЦикла;
	
КонецПроцедуры

#Область НастройкиФормы

&НаКлиенте
Процедура УстановитьВидимостьПравойПанели()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаПраваяПанель", "Видимость", ПоказыватьПравуюПанель);	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкуКнопкиПоказатьСкрытьПравуюПанель()
	
	Если ПоказыватьПравуюПанель Тогда
		КартинкаПоказатьСкрытьПравуюПанель = БиблиотекаКартинок.СкрытьПароль;
	Иначе
		КартинкаПоказатьСкрытьПравуюПанель = БиблиотекаКартинок.ПоказатьПароль;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ФормаПоказатьСкрытьПравуюПанель", "Картинка", КартинкаПоказатьСкрытьПравуюПанель);	
		
КонецПроцедуры  
	
&НаКлиенте
Процедура УстановитьЗаголовокКнопкиПоказатьСкрытьПравуюПанель()
	
	Если ПоказыватьПравуюПанель Тогда
		ЗаголовокКнопкиПоказатьСкрытьПравуюПанель = НСтр("ru = 'Скрыть правую панель'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	Иначе
		ЗаголовокКнопкиПоказатьСкрытьПравуюПанель = НСтр("ru = 'Показать правую панель'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ФормаПоказатьСкрытьПравуюПанель", "Заголовок", ЗаголовокКнопкиПоказатьСкрытьПравуюПанель);	
	
КонецПроцедуры 
	
&НаКлиенте
Процедура УстановитьВидимостьКнопкиКорзиныВПодменю()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ФормаПерейтиВКорзину", "Видимость", Не ПоказыватьПравуюПанель);
КонецПроцедуры

#КонецОбласти

#Область Отборы 

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьУстановленныеОтборы(ДеревоОтборов)
	
	Результат = Ложь; 
	
	Для каждого ЭлементДерева Из ДеревоОтборов.ПолучитьЭлементы() Цикл
		Если ЭлементДерева.Отбор Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДанныеПоКонтрагенту(ПараметрКонтрагент, Форма)
	
	ОчиститьДанныеПоКонтрагенту(Форма);
	
	Если ТипЗнч(ПараметрКонтрагент) = Тип("Структура") Тогда
		ПараметрКонтрагент.Свойство("Ссылка",        Форма.Контрагент);
		ПараметрКонтрагент.Свойство("Наименование",  Форма.НаименованиеКонтрагента);
		ПараметрКонтрагент.Свойство("ИНН",           Форма.ИННКонтрагента);
		ПараметрКонтрагент.Свойство("КПП",           Форма.КППКонтрагента);
	Иначе
		Форма.Контрагент = ПараметрКонтрагент;
		ПараметрыКонтрагента = ПараметрыКонтрагента(ПараметрКонтрагент);
		Форма.НаименованиеКонтрагента = ПараметрыКонтрагента.ПолноеНаименование;
		Форма.ИННКонтрагента = ПараметрыКонтрагента.ИНН;
		Форма.КППКонтрагента = ПараметрыКонтрагента.Кпп;
	КонецЕсли; 
		
	ЗаполнитьЭлементОтбораПоПоставщику(Форма.ДеревоОтборов, Форма.НаименованиеКонтрагента, Форма.ИННКонтрагента);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЭлементОтбораПоПоставщику(ДеревоОтборов, НаименованиеКонтрагента, ИННКонтрагента)
	
	ЭлементОтбора = ДеревоОтборов.ПолучитьЭлементы()[0];
	ЭлементОтбора.Отбор               = Истина;
	
	Если ПустаяСтрока(ИННКонтрагента) Тогда
		ЭлементОтбора.ЗначениеОтбора      = "";
		ЭлементОтбора.ПредставлениеОтбора = НаименованиеКонтрагента;
		ПредставлениеБыстрогоОтбора = НаименованиеКонтрагента;
	Иначе
		ЭлементОтбора.ЗначениеОтбора      = ИННКонтрагента;
		ЭлементОтбора.ПредставлениеОтбора = ИННКонтрагента;
		ПредставлениеБыстрогоОтбора = 
			СтрШаблон("%1 (%2)", НаименованиеКонтрагента, ИННКонтрагента);
	КонецЕсли;
	
	ЭлементОтбора.ПредставлениеБыстрогоОтбора = ПредставлениеБыстрогоОтбора;
	
КонецПроцедуры 

&НаКлиенте
Функция ДанныеТекущегоОтбораСпособовДоставки(ЭлементОтбора)

	Результат = Новый Структура;
	Результат.Вставить("ЭлементОтбора", ЭлементОтбора);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокКомандИзмененияРегиона(Элементы, Знач РегионЗаголовок)
	
	Если СтрДлина(РегионЗаголовок) > 30 Тогда
		РегионЗаголовок = СтрШаблон("%1...", Лев(РегионЗаголовок, 30)); 
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ВыборРегиона", "Заголовок", РегионЗаголовок); 
				
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭлементОтбораДереваОтборовПоИдентификатору(ДеревоОтборов, Идентификатор)
	
	Результат = Неопределено;
	
	Для каждого ЭлементОтбора Из ДеревоОтборов.ПолучитьЭлементы() Цикл 
		
		Если Не ЭлементОтбора.ФиксированныйОтбор Тогда
			Продолжить;
		КонецЕсли;
				
		Если ЭлементОтбора.Идентификатор = Идентификатор Тогда
			Результат = ЭлементОтбора;
			Прервать;
		КонецЕсли;  
		
		Если ЭлементОтбора.Идентификатор = "СпособДоставки" Тогда
			
			Результат = ЭлементОтбораДереваОтборовПоИдентификатору(ЭлементОтбора, Идентификатор);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьКартинкуОтборов(Элементы, ЕстьУстановленныеОтборы)  
	
	Если ЕстьУстановленныеОтборы Тогда
		КартинкаОтборов = БиблиотекаКартинок.ОтборУстановленТорговыеПредложения;	
	Иначе
		КартинкаОтборов = БиблиотекаКартинок.Отборы;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницаОтборов", "Картинка", КартинкаОтборов);
		
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьКомандыОчисткиОтбора(Элементы, ЕстьУстановленныеОтборы)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОчиститьОтборы", "Видимость", ЕстьУстановленныеОтборы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПоставщику()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеКонтрагента  = ТекущиеДанные.НаименованиеКонтрагента;
	ИННКонтрагента           = ТекущиеДанные.ИННКонтрагента;
	КППКонтрагента           = ТекущиеДанные.КППКонтрагента;
	
	ЗаполнитьЭлементОтбораПоПоставщику(ДеревоОтборов, НаименованиеКонтрагента, ИННКонтрагента); 
	
	НайтиТорговыеПредложения();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНеФиксированныеОтборыДереваОтборов()
	
	МодульРаботаСНоменклатуройСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСНоменклатуройСлужебныйКлиент");
	МодульРаботаСНоменклатуройСлужебныйКлиент.УдалитьНеФиксированныеОтборыДереваОтборов(ДеревоОтборов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСпособаДоставки(Результат, ДополнительныеПараметры) 

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СпособДоставки = Результат;
	
	ЭлементОтбора = ЭлементОтбораДереваОтборовПоИдентификатору(ДеревоОтборов, СпособДоставки.Значение);
	Если ЭлементОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РегионПоиска.РежимОтбора = 0 Тогда
		
		ДанныеТекущегоОтбора = ДанныеТекущегоОтбораСпособовДоставки(ЭлементОтбора);
		ОткрытьВыборРегионаПоиска(ДанныеТекущегоОтбора); 
	
	Иначе
		
		ОбработатьУстановкуСпособаДоставки(ЭлементОтбора, Истина, Истина);
		
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьУстановкуСпособаДоставки(
	ЭлементОтбора, ЗначениеОтбора, ВыполнитьОбработкуДереваОтборов = Ложь)
		
	УстановитьЗначенияОтбораСпособовДоставки(ЭлементОтбора, ЗначениеОтбора);
		
	Если ВыполнитьОбработкуДереваОтборов Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущаяСтрокаДерева", ЭлементОтбора);
		ДеревоОтборовПриИзмененииЗавершение(ЗначениеОтбора, ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РаботаСКатегориями

&НаСервере
Процедура ОтобразитьСтраницуКатегорий()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаСтраницКатегорий", "ТекущаяСтраница", Элементы.ГруппаСтраницаКатегорий);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительныеРеквизитыКатегории()
	
	ПараметрыЗапроса = ТорговыеПредложенияСлужебныйКлиент.НовыйПараметрыЗапросаХарактеристикКатегорий();
	ПараметрыЗапроса.ИдентификаторКатегории = ТекущаяКатегория;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ПараметрыЗапроса.Контрагенты.Добавить(Контрагент);
	КонецЕсли;
	
	ПолучитьПараметрыИзДереваОтборов(ПараметрыЗапроса);
	
	// Регионы поиска.
	Если ЗначениеЗаполнено(РегионПоиска) И РегионПоиска.РежимОтбора = 2 Тогда
		
		ЭлементКоллекции = ИдентификаторыРегионов[0];
		
		ДанныеРегионаПоиска = Новый Структура;
		ДанныеРегионаПоиска.Вставить("КодСтраны", ЭлементКоллекции.КодСтраны);
		ДанныеРегионаПоиска.Вставить("Идентификатор", ЭлементКоллекции.Идентификатор);
		ДанныеРегионаПоиска.Вставить("ДляСамовывоза", ЭлементКоллекции.ДляСамовывоза);
		ДанныеРегионаПоиска.Вставить("ДляДоставки", ЭлементКоллекции.ДляДоставки);
		
		ПараметрыЗапроса.РегионыПоиска.Добавить(ДанныеРегионаПоиска);
		
	КонецЕсли;
	
	ДлительнаяОперацияКатегории = ТорговыеПредложенияВызовСервера.ПолучитьХарактеристикиКатегорииВФоне(
		ПараметрыЗапроса, 
		УникальныйИдентификатор, 
		ИдентификаторЗаданияОбработкиФильтровРубрикатора);
	
	ИдентификаторЗаданияОбработкиФильтровРубрикатора = ДлительнаяОперацияКатегории.ИдентификаторЗадания;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить(
		"ИдентификаторЗаданияОбработкиФильтровРубрикатора", ИдентификаторЗаданияОбработкиФильтровРубрикатора);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьСвойстваЛистовойКатегорииЗавершение", 
		ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияКатегории, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКатегорииСервиса(ИдентификаторКатегории = Неопределено)
	
	ПараметрыОповещения = Новый Структура;
	
	ПараметрыОповещения.Вставить("ИдентификаторКатегории", ИдентификаторКатегории);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьКатегорииСервисаЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	ТорговыеПредложенияКлиент.ПолучитьКатегорииТорговыхПредложенийВФоне(ЭтотОбъект, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКатегорииСервисаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	
	БизнесСетьСлужебныйКлиент.ВывестиСообщенияФоновогоЗадания(Результат, Отказ);
	
	Если Отказ Или Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьКатегорииСервисаНаСервере(Результат);
	
	ИдентификаторКатегории = ДополнительныеПараметры.ИдентификаторКатегории;
	Если ЗначениеЗаполнено(ИдентификаторКатегории) Тогда
		Элементы.Категории.ТекущаяСтрока = 
			ИдентификаторСтрокиПоИдентификаторуКатегории(Категории.ПолучитьЭлементы(), ИдентификаторКатегории);
		ТекущаяКатегория = ИдентификаторКатегории;
	КонецЕсли;
	
	РазвернутьДеревоКатегорий();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоКатегорий()
	
	Если Не ПоказыватьПравуюПанель Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоКатегорий = Категории.ПолучитьЭлементы();
	
	Если ДеревоКатегорий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Элементы.Категории.Развернут(ДеревоКатегорий[0].ПолучитьИдентификатор()) Тогда
		Элементы.Категории.Развернуть(ДеревоКатегорий[0].ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКатегорииСервисаНаСервере(Результат)
	
	ДеревоКатегорий = БизнесСеть.ПолучитьУдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если ТипЗнч(ДеревоКатегорий) <> Тип("ДеревоЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоКатегорий, "Категории");
		
КонецПроцедуры

#Область ХарактеристикиКатегорий

&НаКлиенте
Процедура ПолучитьСвойстваЛистовойКатегорииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ДополнительныеПараметры = Неопределено
		И ДополнительныеПараметры.Свойство("ИдентификаторЗаданияОбработкиФильтровРубрикатора")
		И Не ИдентификаторЗаданияОбработкиФильтровРубрикатора 
			= ДополнительныеПараметры.ИдентификаторЗаданияОбработкиФильтровРубрикатора Тогда
		Возврат; // Данное задание отменено или не является последним
	КонецЕсли;
	
	УдалитьНеФиксированныеОтборыДереваОтборов();
	
	Отказ = Ложь;
	
	// Вывод сообщений из фонового задания.
	ТорговыеПредложенияКлиент.ОбработатьОшибкиФоновогоЗадания(Результат, Отказ);
	Если Отказ Или Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьСвойстваЛистовойКатегории(Результат);
	
	ИдентификаторЗаданияОбработкиФильтровРубрикатора = "";
	
	УстановитьВидимостьДоступность(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСвойстваЛистовойКатегории(Результат)
	
	Если Не ЗначениеЗаполнено(Результат.АдресРезультата)
		Или Не ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		Возврат;
	КонецЕсли;
	
	АдресРезультата = Результат.АдресРезультата;
	
	// Проверка результата поиска.
	Если Результат.Статус = "Выполнено" Тогда
		
		ДанныеСервиса = ПолучитьИзВременногоХранилища(АдресРезультата);
		УдалитьИзВременногоХранилища(АдресРезультата);
		
		Если ДанныеСервиса = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ХарактеристикиКатегорийИзДанныхСервиса(ДанныеСервиса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиКатегорийИзДанныхСервиса(ДополнительныеРеквизитыКатегорий)
	
	ЭлементыОтбора = ДеревоОтборов.ПолучитьЭлементы();
	Для Каждого РеквизитКатегорий Из ДополнительныеРеквизитыКатегорий Цикл
		
		Если РеквизитКатегорий.СписокВыбора = Неопределено Тогда
			
			Если РеквизитКатегорий.Наименование = "ДиапазонЦен" Тогда
				
				Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
					
					Если ЭлементОтбора.ИмяРеквизита = "Цена" Тогда
						
						ЭлементОтбора.МинимальноеЗначение = РеквизитКатегорий.МинимальноеЗначение;
						ЭлементОтбора.МаксимальноеЗначение = РеквизитКатегорий.МаксимальноеЗначение;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Продолжить;
				
			КонецЕсли;
			
			ДобавитьЭлементОтбораИнтервал(ЭлементыОтбора, РеквизитКатегорий);
			
		ИначеЕсли РеквизитКатегорий.СписокВыбора.Количество() > 0 Тогда
			
			ТипЗначенияВыбора = ТипЗнч(РеквизитКатегорий.СписокВыбора[0]);
			Если ТипЗначенияВыбора = Тип("Булево") Тогда
				
				ДобавитьЭлементОтбораБулево(ЭлементыОтбора, РеквизитКатегорий);
				
			ИначеЕсли ТипЗначенияВыбора = Тип("Структура") Тогда
				
				ДобавитьЭлементОтбораСписок(ЭлементыОтбора, РеквизитКатегорий);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементОтбораИнтервал(ЭлементыОтбора, РеквизитКатегорий)
	
	НовыйОтбор = ЭлементыОтбора.Добавить();
	НовыйОтбор.ФиксированныйОтбор           = Ложь;
	НовыйОтбор.Идентификатор                = РеквизитКатегорий.Идентификатор;
	НовыйОтбор.ИмяРеквизита                 = РеквизитКатегорий.Наименование;
	НовыйОтбор.Представление                = РеквизитКатегорий.Наименование;
	НовыйОтбор.ФиксированноеЗначение        = Истина;// Форма ввода будет содержать подсказки.
	НовыйОтбор.ИнтервалОт                   = РеквизитКатегорий.ИнтервалОт;
	НовыйОтбор.ИнтервалДо                   = РеквизитКатегорий.ИнтервалДо;
	НовыйОтбор.МинимальноеЗначение          = РеквизитКатегорий.МинимальноеЗначение;
	НовыйОтбор.МаксимальноеЗначение         = РеквизитКатегорий.МаксимальноеЗначение;
	
	Если ТипЗнч(РеквизитКатегорий.МинимальноеЗначение) = Тип("Число") Тогда
		НовыйОтбор.ЗначениеОтбора               = 0;
	Иначе
		НовыйОтбор.ЗначениеОтбора               = Дата(1, 1, 1);
	КонецЕсли;
	
	НовыйОтбор.ПредставлениеОтбора          = НСтр("ru = '<не задано>'");
	НовыйОтбор.ОтборДоступен                = Истина;
	НовыйОтбор.Отбор                        = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементОтбораБулево(ЭлементыОтбора, РеквизитКатегорий)
	
	НовыйОтбор = ЭлементыОтбора.Добавить();
	НовыйОтбор.ФиксированныйОтбор           = Ложь;
	НовыйОтбор.Идентификатор                = РеквизитКатегорий.Идентификатор;
	НовыйОтбор.ИмяРеквизита                 = РеквизитКатегорий.Наименование;
	НовыйОтбор.Представление                = РеквизитКатегорий.Наименование;
	НовыйОтбор.ЗначениеОтбора               = Истина;
	НовыйОтбор.ОтборДоступен                = Истина;
	НовыйОтбор.Отбор                        = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементОтбораСписок(ЭлементыОтбора, РеквизитКатегорий)
	
	НовыйОтбор = ЭлементыОтбора.Добавить();
	НовыйОтбор.ФиксированныйОтбор           = Ложь;
	НовыйОтбор.Идентификатор                = РеквизитКатегорий.Идентификатор;
	НовыйОтбор.ИмяРеквизита                 = РеквизитКатегорий.Наименование;
	НовыйОтбор.Представление                = РеквизитКатегорий.Наименование;
	НовыйОтбор.ЗначениеОтбора               = "Список";
	НовыйОтбор.ОтборДоступен                = Истина;
	НовыйОтбор.Отбор                        = Ложь;
	
	Для Каждого ЗначениеВыбора Из РеквизитКатегорий.СписокВыбора Цикл
		
		НоваяСтрока = НовыйОтбор.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ФиксированныйОтбор           = Ложь;
		НоваяСтрока.ЗначениеОтбора               = "Список";
		
		Если ТипЗнч(ЗначениеВыбора) = Тип("Структура") Тогда
			
			НоваяСтрока.Идентификатор             = ЗначениеВыбора.Идентификатор;
			НоваяСтрока.ИмяРеквизита              = ЗначениеВыбора.Наименование;
			НоваяСтрока.Представление             = ЗначениеВыбора.Наименование;
			
		ИначеЕсли ТипЗнч(ЗначениеВыбора) = Тип("Булево") И ЗначениеВыбора Тогда
			
			НоваяСтрока.ИмяРеквизита              = "Да";
			НоваяСтрока.Представление             = НСтр("ru = 'Да'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
			
		ИначеЕсли ТипЗнч(ЗначениеВыбора) = Тип("Булево") И Не ЗначениеВыбора Тогда
			
			НоваяСтрока.ИмяРеквизита              = "Нет";
			НоваяСтрока.Представление             = НСтр("ru = 'Нет'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьЗаголовокФормы()
	
	// Заголовок формы.
	Если ЗначениеЗаполнено(ТекущаяКатегория) Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Торговые предложения - %1'"), ПредставлениеКатегории);
	Иначе
		Заголовок = НСтр("ru = 'Торговые предложения 1С:Бизнес-сеть'");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПредставлениеКатегории(СтрокаДереваТекущейКатегории) 
	
	Если СтрокаДереваТекущейКатегории = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеКатегории = СтрокаДереваТекущейКатегории.Наименование;
	
КонецПроцедуры
	
&НаКлиенте
Функция СтрокаДереваТекущейКатегории() 	
	
	ИдентификаторСтроки = 
		ИдентификаторСтрокиПоИдентификаторуКатегории(Категории.ПолучитьЭлементы(), ТекущаяКатегория);
		
	Возврат Категории.НайтиПоИдентификатору(ИдентификаторСтроки);
	
КонецФункции 

&НаКлиенте
Функция ИдентификаторСтрокиПоИдентификаторуКатегории(КоллекцияСтрок, ИдентификаторКатегории)
	
	Результат = 0;
	
	Если КоллекцияСтрок.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для каждого ЭлементКоллекции Из КоллекцияСтрок Цикл
		
		Если ЭлементКоллекции.Идентификатор = ИдентификаторКатегории Тогда
			Результат = ЭлементКоллекции.ПолучитьИдентификатор();
			Прервать;
		Иначе
			
			Результат = ИдентификаторСтрокиПоИдентификаторуКатегории(
				ЭлементКоллекции.ПолучитьЭлементы(), ИдентификаторКатегории);
				
			Если Результат <> 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииТекущейКатегории()
	
	СтрокаДереваТекущейКатегории = СтрокаДереваТекущейКатегории();
	ЗаполнитьПредставлениеКатегории(СтрокаДереваТекущейКатегории);
	ЗаполнитьЗаголовокФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПоискТорговыхПредложений

&НаСервере
Функция ОбработатьРезультатПоиска(АдресРезультата)
	
	Результат = БизнесСеть.ПолучитьУдалитьИзВременногоХранилища(АдресРезультата);
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеСервиса = Новый Структура;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "Список") 
		И ТипЗнч(Результат.Список) = Тип("ТаблицаЗначений") Тогда
		
		МассивПредложений  = Новый Массив;
		Для Каждого ЭлементКоллекции Из Результат.Список Цикл
			
			// Проверка единицы измерения, если есть упаковка.
			Если ЗначениеЗаполнено(ЭлементКоллекции.НаименованиеУпаковки)
				И ЭлементКоллекции.НаименованиеУпаковки <> ЭлементКоллекции.ЕдиницаИзмерения Тогда
				ЭлементКоллекции.ЕдиницаИзмерения = ЭлементКоллекции.НаименованиеУпаковки;
			КонецЕсли;
			
			// Проверка возврата описания.
			Если ЗначениеЗаполнено(ЭлементКоллекции.Заголовок) Тогда
				ЭлементКоллекции.НаименованиеНоменклатуры = ЭлементКоллекции.Заголовок;
			КонецЕсли;
			
			СтруктураПредложений = НовыйСтруктураСпискаПредложения();
			ЗаполнитьЗначенияСвойств(СтруктураПредложений, ЭлементКоллекции, , "АдресаКартинок");
			
			УказатьНаличиеСкидки(СтруктураПредложений); 
			УказатьПредставлениеЦенаВключаетНДС(СтруктураПредложений);
			УказатьНаличиеПоКоличеству(СтруктураПредложений);
			
			// Заполнение сумм НДС.
			РассчитатьСуммыСтрокиСписка(СтруктураПредложений);
			
			// Вычисление минимального количества заказа.
			СтруктураПредложений.МинимальноеКоличество = 
				МинимальноеКоличествоДляЗаказа(ЭлементКоллекции.ЦеныВВалютеПредложения);
			
			// Кратность упаковки для заказа.
			Если Не ЗначениеЗаполнено(СтруктураПредложений.КратностьУпаковки) Тогда
				СтруктураПредложений.КратностьУпаковки = 1;
			КонецЕсли;
			
			// Заполнение персональной цены.
			ЗаполнитьПерсональнуюЦену(СтруктураПредложений, ЭлементКоллекции.ЦелевыеКонтрагенты);
			
			// Заполнение адресов картинок, для отображения в списке торговых предложений.
			ЗаполнитьАдресаКартинок(СтруктураПредложений, ЭлементКоллекции.АдресаКартинок);
			
			ВзрослаяКатегория(СтруктураПредложений, ЭлементКоллекции.РодительскиеКатегории);
			
			МассивПредложений.Добавить(СтруктураПредложений);
			
		КонецЦикла;
		
		Если МассивПредложений.Количество() Тогда
			ДанныеСервиса.Вставить("МассивПредложений", МассивПредложений);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "Страницы") Тогда
		ДанныеСервиса.Вставить("Страницы", Результат.Страницы);
	КонецЕсли;
	
	ДанныеСервиса.Вставить("ДеревоКатегорий", Результат.ДеревоКатегорий);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "ДанныеКорзины") Тогда
		ДанныеСервиса.Вставить("ДанныеКорзины",   Результат.ДанныеКорзины);
	КонецЕсли;
	
	Возврат ДанныеСервиса;
	
КонецФункции

// Взрослая категория.
// 
// Параметры:
//  СтруктураПредложений - см. НовыйСтруктураСпискаПредложения
//  РодительскиеКатегории - Массив из Строка
//
&НаСервере
Процедура ВзрослаяКатегория(СтруктураПредложений, РодительскиеКатегории)
	
	Если Не ЗначениеЗаполнено(РодительскиеКатегории) Тогда
		Возврат;
	КонецЕсли;  
	
	СтруктураПредложений.ВзрослаяКатегория =
		ТорговыеПредложенияСлужебный.ЕстьВзрослаяКатегорияСредиРодительских(РодительскиеКатегории);
		
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСостояниеДлительнаяОперация()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницыРезультатаПоиска", "ТекущаяСтраница", Элементы.СтраницаРезультатаПоискаДлительнаяОперация);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеОбновленияПоискаПоОтборам(ПараметрыОповещения)
			
	ПолучитьДеревоКатегорий = Ложь;
	// ДеревоКатегорий
	Если ПараметрыОповещения.Свойство("ДеревоКатегорийКонтрольнаяСуммаСтрокой")
		И ДеревоКатегорийКонтрольнаяСуммаСтрокой <> ПараметрыОповещения.ДеревоКатегорийКонтрольнаяСуммаСтрокой Тогда
		ПолучитьДеревоКатегорий = Истина;
	КонецЕсли;
	
	// ТекущаяКатегория
	ПараметрыИзменены = Ложь;
	Если ПараметрыОповещения.Свойство("ИдентификаторКатегории") Тогда
		Если ТекущаяКатегория <> ПараметрыОповещения.ИдентификаторКатегории Тогда
			ПараметрыИзменены = Истина;
			ТекущаяКатегория = ПараметрыОповещения.ИдентификаторКатегории;
			
			ИдентификаторСтроки = ИдентификаторСтрокиПоИдентификаторуКатегории(
				Категории.ПолучитьЭлементы(), ТекущаяКатегория);
			
			Если ИдентификаторСтроки <> 0 Тогда
				Элементы.Категории.ТекущаяСтрока = ИдентификаторСтроки;
			Иначе
				ЗагрузитьКатегорииСервиса(ТекущаяКатегория);
			КонецЕсли;

			ПриИзмененииТекущейКатегории();
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ТекущаяКатегория) Тогда
			ПараметрыИзменены = Истина;
		КонецЕсли;
	КонецЕсли;
			
	// Наименование
	Если Не ПустаяСтрока(ОтборНаименование) И Не ПараметрыОповещения.Свойство("ОтборНаименование") Тогда
		ОтборНаименование = "";
		СтрокаПоиска = ОтборНаименование;
		ПараметрыИзменены = Истина;
	КонецЕсли;
	
	Если ПараметрыОповещения.Свойство("ОтборНаименование")
		И ПараметрыОповещения.ОтборНаименование <> СтрокаПоиска Тогда
		ПараметрыИзменены = Истина;
		ОтборНаименование = ПараметрыОповещения.ОтборНаименование;
		СтрокаПоиска = ОтборНаименование;
	КонецЕсли;
	
	// Артикул
	Если ОтборАртикулы.Количество() > 0 И Не ПараметрыОповещения.Свойство("ОтборАртикул") Тогда
		ОтборАртикулы.Очистить();
		ПараметрыИзменены = Истина;
	КонецЕсли;
	
	Если (ПараметрыОповещения.Свойство("ОтборАртикул") И ПараметрыОповещения.ОтборАртикул <> СтрокаПоиска) Тогда
		ТекущийОтборАртикул = ОтборАртикулы.НайтиПоЗначению(ПараметрыОповещения.ОтборАртикул);
		Если ТекущийОтборАртикул = Неопределено Тогда
			ОтборАртикулы.Добавить(ПараметрыОповещения.ОтборАртикул);
			ПараметрыИзменены = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Штрихкоды
	Если ОтборШтрихКоды.Количество() > 0 И Не ПараметрыОповещения.Свойство("ОтборШтрихКоды") Тогда
		ОтборШтрихКоды.Очистить();
		ПараметрыИзменены = Истина;
	КонецЕсли;
	
	Если ПараметрыОповещения.Свойство("ОтборШтрихКоды") И ТипЗнч(ПараметрыОповещения.ОтборШтрихКоды) = Тип("Массив")
		И ПараметрыОповещения.ОтборШтрихКоды.Количество() Тогда
		ТекущийОтборШтрихкод = ОтборШтрихКоды.НайтиПоЗначению(ПараметрыОповещения.ОтборШтрихКоды);
		Если ТекущийОтборШтрихкод = Неопределено Тогда
			ОтборШтрихКоды.ЗагрузитьЗначения(ПараметрыОповещения.ОтборШтрихКоды);
			ПараметрыИзменены = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Контрагент
	Если ПараметрыОповещения.Свойство("Контрагент") 
		И ПараметрыОповещения.Контрагент <> Контрагент Тогда
		
		ПараметрыИзменены = Истина;
		ЗаполнитьДанныеПоКонтрагенту(ПараметрыОповещения.Контрагент, ЭтотОбъект); 
		
	КонецЕсли;
	
	Если ПараметрыОповещения.Свойство("ОтборНоменклатураСервиса") 
		И ОтборНоменклатураСервиса <> ПараметрыОповещения.ОтборНоменклатураСервиса Тогда
		
		ОтборНоменклатураСервиса = ПараметрыОповещения.ОтборНоменклатураСервиса;
		ПараметрыОповещения.Свойство("ОтборНоменклатураСервисаПредставление", ОтборНоменклатураСервисаПредставление);
		Если Не ПустаяСтрока(ОтборНоменклатураСервисаПредставление) Тогда
			ПараметрыИзменены = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыИзменены Тогда
		НайтиТорговыеПредложения(ПолучитьДеревоКатегорий);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Конструкторы

// Новый параметры запроса поиска найти торговые предложения.
// 
// Возвращаемое значение:
//  Структура:
// * ЦенаОт - Число
// * ЦенаДо - Число
// * СИзображением - Булево
// * ВНаличии - Булево
// * СоСкидкой - Булево
// * Свойства - Массив из Строка
// * ПолучитьДеревоКатегорий - Булево
// * ПолучитьДанныеКорзины - Булево
// * Наименование - Строка
//
&НаКлиентеНаСервереБезКонтекста
Функция НовыйПараметрыЗапросаПоискаНайтиТорговыеПредложения()
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ЦенаОт", 0);
	ПараметрыЗапроса.Вставить("ЦенаДо", 0);
	ПараметрыЗапроса.Вставить("СИзображением", Ложь);
	ПараметрыЗапроса.Вставить("ВНаличии", Ложь);
	ПараметрыЗапроса.Вставить("СоСкидкой", Ложь);
	ПараметрыЗапроса.Вставить("Свойства", Новый Массив);
	ПараметрыЗапроса.Вставить("ПолучитьДеревоКатегорий", Ложь);
	ПараметрыЗапроса.Вставить("ПолучитьДанныеКорзины", Ложь);
	ПараметрыЗапроса.Вставить("Наименование", "");
	
	Возврат ПараметрыЗапроса
	
КонецФункции

&НаСервере
Функция НовыйСтруктураСпискаПредложения()
	
	СтруктураПредложений = Новый Структура;
	
	СтруктураПредложений.Вставить("Идентификатор",            "");
	СтруктураПредложений.Вставить("НаименованиеНоменклатуры", "");
	СтруктураПредложений.Вставить("ИдентификаторКатегории",   "");
	СтруктураПредложений.Вставить("НаименованиеКатегории",    "");
	СтруктураПредложений.Вставить("ПредставлениеЦены",        "");
	СтруктураПредложений.Вставить("ИдентификаторКонтрагента", "");
	СтруктураПредложений.Вставить("НаименованиеКонтрагента",  "");
	СтруктураПредложений.Вставить("АртикулПоставщика",        "");
	СтруктураПредложений.Вставить("ЕдиницаИзмерения",         "");
	СтруктураПредложений.Вставить("СрокПоставки",             0);
	СтруктураПредложений.Вставить("ИННКонтрагента",           "");
	СтруктураПредложений.Вставить("КППКонтрагента",           "");
	СтруктураПредложений.Вставить("КодЕдиницыИзмерения",      "");
	СтруктураПредложений.Вставить("Наличие",                   0);
	СтруктураПредложений.Вставить("ПредставлениеОстатков",    "");
	СтруктураПредложений.Вставить("Количество",               0);
	СтруктураПредложений.Вставить("СтавкаНДС",                "");
	СтруктураПредложений.Вставить("ЦенаВключаетНДС",          Ложь);
	СтруктураПредложений.Вставить("СуммаНДС",                 0);
	СтруктураПредложений.Вставить("СуммаНДСЦенаДоСкидки",     0);
	СтруктураПредложений.Вставить("Цена",                     0);
	СтруктураПредложений.Вставить("Валюта",                   Неопределено);
	СтруктураПредложений.Вставить("КратностьУпаковки",        0);
	СтруктураПредложений.Вставить("МинимальноеКоличество",    0);
	СтруктураПредложений.Вставить("ВалютаПредложения",        Неопределено);
	СтруктураПредложений.Вставить("ЦенаДоСкидки",             0);
	СтруктураПредложений.Вставить("ПерсональнаяЦена",         Ложь);
	СтруктураПредложений.Вставить("СнятоСПродажи",            Ложь);
	СтруктураПредложений.Вставить("ВзрослаяКатегория",        Ложь);
	СтруктураПредложений.Вставить("ЕстьСкидка",               Ложь);
	СтруктураПредложений.Вставить("ПредставлениеЦенаВключаетНДС", "");
	
	// Изображения торгового предложения.
	АдресаКартинок = Новый ТаблицаЗначений;
	АдресаКартинок.Колонки.Добавить("АдресВСервисе", Новый ОписаниеТипов("Строка"));
	АдресаКартинок.Колонки.Добавить("АдресВХранилище", Новый ОписаниеТипов("Строка"));
	СтруктураПредложений.Вставить("АдресаКартинок", АдресаКартинок);
	
	// Матрица цен в валюте предложения.
	ЦеныВВалютеПредложения = Новый ТаблицаЗначений;
	ЦеныВВалютеПредложения.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ЦеныВВалютеПредложения.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ЦеныВВалютеПредложения.Колонки.Добавить("ЦенаДоСкидки", Новый ОписаниеТипов("Число"));
	ЦеныВВалютеПредложения.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
	СтруктураПредложений.Вставить("ЦеныВВалютеПредложения", ЦеныВВалютеПредложения);
	
	Возврат СтруктураПредложений;
	
КонецФункции

&НаКлиенте
Функция НовыйНастройкиФормы()
	
	Настройки = Новый Соответствие;
	Настройки.Вставить("Валюта", 							Неопределено);
	Настройки.Вставить("РежимСортировки", 					"СортировкаРелевантность");
	Настройки.Вставить("ОтображатьЦеныБезНДС", 				Истина);
	Настройки.Вставить("ПоказыватьПравуюПанель",			Истина);
	
	Возврат Настройки;
	
КонецФункции	

#КонецОбласти

&НаКлиенте
Процедура УстановитьПометкуКомандыОтображатьЦеныБезНДСЕще()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОтображатьЦеныБезНДСЕще", "Пометка", ОтображатьЦеныБезНДС);
КонецПроцедуры
				
&НаСервере
Процедура ЗагрузитьСохраненныеНастройкиФормы()
	
	КлючНастроекФормы = КлючНастроекФормы();
	Настройки = ХранилищеСистемныхНастроек.Загрузить(КлючНастроекФормы);
	Если ТипЗнч(Настройки) = Тип("Соответствие") Тогда
		Валюта 								= Настройки.Получить("Валюта");
		РежимСортировки 					= Настройки.Получить("РежимСортировки");
		ОтображатьЦеныБезНДС 				= Настройки.Получить("ОтображатьЦеныБезНДС");
		Если Настройки.Получить("ПоказыватьПравуюПанель") <> Неопределено Тогда
			ПоказыватьПравуюПанель			= Настройки.Получить("ПоказыватьПравуюПанель");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СохранитьНастройкиФормы()
	
	КлючНастроекФормы = КлючНастроекФормы();
	НастройкиФормы = ТекущиеНастройкиФормы();
	СохранитьНастройкиФормыНаСервере(КлючНастроекФормы, НастройкиФормы);
	
КонецПроцедуры 

&НаКлиенте
Функция ТекущиеНастройкиФормы()
	
	НастройкиФормы = НовыйНастройкиФормы();
	
	Для каждого ЭлементНастроекФормы Из НастройкиФормы Цикл
		ЗначениеЭлементаНастройки = 
			ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтотОбъект, ЭлементНастроекФормы.Ключ);
		НастройкиФормы.Вставить(ЭлементНастроекФормы.Ключ, ЗначениеЭлементаНастройки);
	КонецЦикла;
	
	Возврат НастройкиФормы;
	
КонецФункции 

&НаСервереБезКонтекста
Процедура СохранитьНастройкиФормыНаСервере(КлючНастроекФормы, Настройки)
	ХранилищеСистемныхНастроек.Сохранить(КлючНастроекФормы,, Настройки);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючНастроекФормы()
	Возврат "Обработка.ТорговыеПредложения.Форма.ПоискПоОтборам85/ТекущиеДанные";
КонецФункции

#КонецОбласти
