#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Заявления о ввозе товаров'"));
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийВвозТоваровИзЕАЭС.ЗаявлениеОВвозе"));

	ОткрытьФорму("Документ.ЗаявлениеОВвозеТоваров.ФормаСписка", ПараметрыФормы, , "ФормаСписка_ЗаявлениеОВвозеТоваров");

КонецПроцедуры

#КонецОбласти
