
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ТипЗнч(Параметры.ПараметрыОткрытия) = Тип("Структура") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Параметры.ПараметрыОткрытия.ЭтоИтоги Тогда
		
		ШаблонЗаголовка = НСтр("ru = 'Расшифровка %1 за %2 - %3'");
		ЗаголовокНачалоПериода = ПоказателиБизнесаФормы.ЗаголовокКолонки(Параметры.ПараметрыОткрытия.НачалоПериода, Параметры.ПараметрыОткрытия.Периодичность);
		ЗаголовокКонецПериода  = ПоказателиБизнесаФормы.ЗаголовокКолонки(Параметры.ПараметрыОткрытия.КонецПериода, Параметры.ПараметрыОткрытия.Периодичность);

		Заголовок = СтрШаблон(ШаблонЗаголовка, ВРЕГ(Параметры.ПараметрыОткрытия.Показатель), ЗаголовокНачалоПериода, ЗаголовокКонецПериода);

	Иначе 
		
		ШаблонЗаголовка = НСтр("ru = 'Расшифровка %1 за %2'");
		ЗаголовокПериода = ПоказателиБизнесаФормы.ЗаголовокКолонки(Параметры.ПараметрыОткрытия.НачалоПериода, Параметры.ПараметрыОткрытия.Периодичность);
		
		Заголовок = СтрШаблон(ШаблонЗаголовка, ВРЕГ(Параметры.ПараметрыОткрытия.Показатель), ЗаголовокПериода);
		
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Отчеты.АнализБизнеса.ПолучитьМакет("МакетРасшифровкаЗначения");
	
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	СкрытьКолонкиПоВидуОтчета(Настройки, Параметры.ПараметрыОткрытия.ВыбранныйОтчет);
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки); 
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("РасшифровкаТаблица", ЗаполнитьТаблицуРасшифровкиПоПоказателю(Параметры.ПараметрыОткрытия));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	РасшифровкаТабличныйДокумент.Очистить();

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(РасшифровкаТабличныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ДанныеРасшифровкиАдресВХранилище = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РасшифровкаТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеРасшифровки = ПолучитьДанныеРасшифровки(Расшифровка, ДанныеРасшифровкиАдресВХранилище);
	
	Если (ДанныеРасшифровки.Поле = "Документ"
		ИЛИ ДанныеРасшифровки.Поле = "Аналитика"
		ИЛИ ДанныеРасшифровки.Поле = "Проект"
		ИЛИ ДанныеРасшифровки.Поле = "Подразделение")
		И ЗначениеЗаполнено(ДанныеРасшифровки.Значение) Тогда
		ПоказатьЗначение(, ДанныеРасшифровки.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СкрытьКолонкиПоВидуОтчета(Настройки, ВыбранныйОтчет)
		
	СкрываемыеПоля = Новый Массив;
	
	Если ВыбранныйОтчет <> Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток Тогда
		СкрываемыеПоля.Добавить("Аналитика");
	КонецЕсли;
	
	Если ВыбранныйОтчет = Перечисления.ВидыФинансовыхОтчетов.Баланс Тогда
		СкрываемыеПоля.Добавить("Аналитика");
		СкрываемыеПоля.Добавить("Проект");
		СкрываемыеПоля.Добавить("Подразделение");
		СкрываемыеПоля.Добавить("Сумма");
		СкрываемыеПоля.Добавить("Содержание");
	Иначе
		СкрываемыеПоля.Добавить("СуммаОборотДт");
		СкрываемыеПоля.Добавить("СуммаОборотКт");
		СкрываемыеПоля.Добавить("НачальноеСальдо");
		СкрываемыеПоля.Добавить("КонечноеСальдо");
	КонецЕсли;
	
	ЭлементыНастроек = Настройки.Выбор.Элементы;
	Для Каждого Элемент Из ЭлементыНастроек Цикл		
		Если СкрываемыеПоля.Найти(Строка(Элемент.Поле)) <> Неопределено Тогда
			Элемент.Использование = Ложь;
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

// Функция заполняет таблицу расшифровки по показателю.
//
// Параметры:
//  СтруктураПараметров - Структура - структура параметров, содержащая следующие ключи:
//   * ДанныеМеток - ТаблицаЗначений - таблица меток;
//   * Показатель - СправочникСсылка.ПоказателиБизнеса - показатель;
//   * СпособПолученияДанныхИсточника - ПеречислениеСсылка.СпособыПолученияДанныхИсточника - способ получения данных источника;
//   * ВыбранныйОтчет - Строка - выбранный отчет;
//   * СценарийПланирования - СправочникСсылка.СценарииПланирования - сценарий планирования;
//   * НачалоПериода - Дата - начало периода;
//   * КонецПериода - Дата - конец периода.
//
&НаСервере
Функция ЗаполнитьТаблицуРасшифровкиПоПоказателю(СтруктураПараметров)
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаРезультат.Колонки.Добавить("Документ", ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	ТаблицаРезультат.Колонки.Добавить("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(30, 2));
	ТаблицаРезультат.Колонки.Добавить("Аналитика", ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	ТаблицаРезультат.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	ТаблицаРезультат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
	ТаблицаРезультат.Колонки.Добавить("Содержание", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	
	ТаблицаРезультат.Колонки.Добавить("НачальноеСальдо", ОбщегоНазначения.ОписаниеТипаЧисло(30, 2));
	ТаблицаРезультат.Колонки.Добавить("СуммаОборотДт", ОбщегоНазначения.ОписаниеТипаЧисло(30, 2));
	ТаблицаРезультат.Колонки.Добавить("СуммаОборотКт", ОбщегоНазначения.ОписаниеТипаЧисло(30, 2));
	ТаблицаРезультат.Колонки.Добавить("КонечноеСальдо", ОбщегоНазначения.ОписаниеТипаЧисло(30, 2));
	
	ТаблицаМеток = СтруктураПараметров.ДанныеМеток.Выгрузить();
	
	ДополнитьМеткиПоТекущейАналитике(ТаблицаМеток, СтруктураПараметров);
	
	ДанныеПоказателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураПараметров.Показатель, "СпособПолученияДанныхИсточника, ВидОтчета");
	
	Если ДанныеПоказателя.СпособПолученияДанныхИсточника = Перечисления.СпособыПолученияДанныхИсточника.Расширение Тогда
		
		ТаблицаРасшифровка = ПоказателиБизнеса.ПолучитьРасшифровкуПодключаемогоПоказателя(СтруктураПараметров);
		Возврат ТаблицаРасшифровка;
		
	Иначе
		
		МассивПоказателей = Новый Массив;
		Справочники.ПоказателиБизнеса.ПолучитьЗависимыеПоказателиРекурсивно(СтруктураПараметров.Показатель, МассивПоказателей);
		МассивПоказателей = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПоказателей);
		
		ТекстЗапроса = ПоказателиБизнеса.ПолучитьТекстЗапросаРасшифровкаПоказателя(ДанныеПоказателя.ВидОтчета, СтруктураПараметров.СценарийПланирования);
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		
		ДобавитьПараметрыМетокВЗапрос(Запрос, СтруктураПараметров.ВыбранныйОтчет, ТаблицаМеток);
		
		Запрос.УстановитьПараметр("МассивПоказателей", МассивПоказателей);
		Запрос.УстановитьПараметр("СценарийПланирования", СтруктураПараметров.СценарийПланирования);
		Запрос.УстановитьПараметр("НачалоПериода", СтруктураПараметров.НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", СтруктураПараметров.КонецПериода);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
		Возврат ТаблицаРезультат;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ДобавитьПараметрыМетокВЗапрос(Запрос, ВидОтчета, ДанныеМеток)
	
	Если ДанныеМеток = Неопределено ИЛИ ДанныеМеток.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация
	ПараметрыЗапроса = Новый Структура;
	СхемаЗапроса     = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	НомерЗапроса     = 0;
	ПакетЗапроса 	 = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество()-1];
	ОператорыЗапроса = ПакетЗапроса.Операторы[НомерЗапроса];
	
	Если ВидОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		ИмяТаблицы = ОператорыЗапроса.Источники[НомерЗапроса].Источник.Псевдоним;
	ИначеЕсли ВидОтчета = Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток Тогда
		ИмяТаблицы = "ДвиженияДенежныхСредств"; // Не локализуется
	Иначе // Баланс
		ИмяТаблицы = "Управленческий"; // Не локализуется
	КонецЕсли;
	
	МассивОтборов = Новый Массив;
	
	Для каждого СтрокаМетки Из ДанныеМеток Цикл
		
		// Для Доходов и Расходов и Баланса - пока только отбор по организации
		Если ВидОтчета = Перечисления.ВидыФинансовыхОтчетов.Баланс И СтрокаМетки.ИмяПоляОтбора <> "Организация" Тогда // Не локализуется
			Продолжить;
		КонецЕсли;
		
		ИмяПоляОтбора = СтрокаМетки.ИмяПоляОтбора;
		Если ИмяПоляОтбора = "Подразделение" И ВидОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
			ИмяПоляОтбора= "СтруктурнаяЕдиница";
		КонецЕсли;
		
		Если ВидОтчета = Перечисления.ВидыФинансовыхОтчетов.Баланс Тогда
			СтрокаОтбора = СтрШаблон("%1 В (&%2)", ИмяПоляОтбора, СтрокаМетки.ИмяПоляОтбора);
		Иначе
			СтрокаОтбора = СтрШаблон("%1.%2 В (&%3)", ИмяТаблицы, ИмяПоляОтбора, СтрокаМетки.ИмяПоляОтбора);
		КонецЕсли;
		
		Если МассивОтборов.Найти(СтрокаОтбора) = Неопределено Тогда
			МассивОтборов.Добавить(СтрокаОтбора);
		КонецЕсли;
		
		Если НЕ ПараметрыЗапроса.Свойство(СтрокаМетки.ИмяПоляОтбора) Тогда
			ПараметрыЗапроса.Вставить(СтрокаМетки.ИмяПоляОтбора, Новый Массив);
		КонецЕсли;
		
		ПараметрыЗапроса[СтрокаМетки.ИмяПоляОтбора].Добавить(СтрокаМетки.Метка);
		
	КонецЦикла;
	
	Для каждого СтрокаОтбора Из МассивОтборов Цикл
		ОператорыЗапроса.Отбор.Добавить(СтрокаОтбора);
	КонецЦикла;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Для каждого КлючЗначение Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьМеткиПоТекущейАналитике(ТаблицаМеток, СтруктураПараметров)
	
	Если СтруктураПараметров.ВыбранныйОтчет = Перечисления.ВидыФинансовыхОтчетов.Баланс Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураПараметров.Группировка = Перечисления.ГруппировкаАнализаБизнеса.Проекты Тогда
		ИмяПоляОтбора = "Проект"; // Не локализуется
	ИначеЕсли СтруктураПараметров.Группировка = Перечисления.ГруппировкаАнализаБизнеса.Подразделения Тогда
		ИмяПоляОтбора = "Подразделение"; // Не локализуется
	Иначе // Дополнять метки не требуется
		Возврат;
	КонецЕсли;
	
	НоваяМетка = ТаблицаМеток.Добавить();
	НоваяМетка.ИмяПоляОтбора = ИмяПоляОтбора;
	НоваяМетка.Метка = СтруктураПараметров.Аналитика;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеРасшифровки(Расшифровка, ДанныеРасшифровкиАдресВХранилище)
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровкиАдресВХранилище);
	ПолеРасшифровки = ДанныеРасшифровки.Элементы.Получить(Расшифровка).ПолучитьПоля()[0];
	
	Результат = Новый Структура;
	Результат.Вставить("Поле", ПолеРасшифровки.Поле);
	Результат.Вставить("Значение", ПолеРасшифровки.Значение);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
