#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
		
	КлючиЗаписей = КлючиЗаписейПоДокументу(ПараметрКоманды);
	Если КлючиЗаписей.Количество() = 1 Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Ключ", КлючиЗаписей[0]);
		ОткрытьФорму("РегистрСведений.ФискальныеОперации.ФормаЗаписи", СтруктураПараметров);
	Иначе
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ДокументОснование", ПараметрКоманды);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
		ОткрытьФорму("РегистрСведений.ФискальныеОперации.ФормаСписка", СтруктураПараметров, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КлючиЗаписейПоДокументу(ДокументОснование)
	Результат = Новый Массив;
	ЗначенияКлючей = РегистрыСведений.ФискальныеОперации.ЗначенияКлючейПоДокументу(ДокументОснование);
	Для Каждого ЗначенияКлюча Из ЗначенияКлючей Цикл
		
		Ключ = РегистрыСведений.ФискальныеОперации.СоздатьКлючЗаписи(ЗначенияКлюча);
		Результат.Добавить(Ключ);
	КонецЦикла;
	Возврат Результат; 
	
КонецФункции

#КонецОбласти
