
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Цвет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "Цвет").Получить();
		Иначе
			Цвет = ЦветаПалитры.Серый;
		КонецЕсли;
		
	КонецЕсли;
	
	Параметры.Свойство("ЭтоСостояниеДляЗаявок", ЭтоСостояниеДляЗаявок);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Цвет = ТекущийОбъект.Цвет.Получить();
	
	Если Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		
		УдалитьЦвет = ТекущийОбъект.УдалитьЦветСтарый.Получить();
		Если УдалитьЦвет.ПолучитьАбсолютный() <> Новый Цвет(0, 0, 0) Тогда
			Элементы.Дополнительно.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(Цвет);
	ПараметрыЗаписи.Вставить("ЭтоНовый", Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("Ссылка", Объект.Ссылка);
	Если ЭтоСостояниеДляЗаявок Тогда
		ПараметрыЗаписи.Вставить("ЭтоСостояниеДляЗаявок");
	КонецЕсли;
	
	Оповестить("Запись_СостоянияЗаказовПокупателей", ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти