
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяРеквизита = Параметры.ИмяРеквизита;

	Если Параметры.ТипЗначения = Тип("Строка") Тогда
		
		Заголовок = НСтр("ru = 'Ввод значения'");
		Элементы.СтраницыВидовОтборов.ТекущаяСтраница = Элементы.СтраницаВводаСтроки;
		ЗначениеВыбораСтрока = Параметры.ЗначениеОтбора;
		Элементы.ЗначениеВыбораСтрока.ПодсказкаВвода = Параметры.ПодсказкаВвода;
		
	ИначеЕсли Параметры.ТипЗначения = Тип("СписокЗначений") Тогда
		
		Заголовок = НСтр("ru = 'Выбор значения'");
		Элементы.СтраницыВидовОтборов.ТекущаяСтраница = Элементы.СтраницаВводаСтроки;
		ЗначениеВыбораСтрока = Параметры.ЗначениеОтбора;
		
		Элементы.ЗначениеВыбораСтрока.РежимВыбораИзСписка     = Истина;
		Элементы.ЗначениеВыбораСтрока.КнопкаВыпадающегоСписка = Истина;
		
		Элементы.ЗначениеВыбораСтрока.СписокВыбора.Очистить();
		Для Каждого ЭлементСписка Из Параметры.СписокСтрокОтбора Цикл
			Элементы.ЗначениеВыбораСтрока.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
		
	Иначе
		
		Заголовок = НСтр("ru = 'Интервал значений'");
		Элементы.СтраницыВидовОтборов.ТекущаяСтраница = Элементы.СтраницаВводаИнтервала;
		
		Если Параметры.ТипЗначения = Тип("Дата") Тогда
			Элементы.СтраницыТиповИнтервалов.ТекущаяСтраница = Элементы.СтраницаТипаДата;
			ЗначениеДатаОт           = Параметры.ЗначениеОт;
			ЗначениеДатаДо           = Параметры.ЗначениеДо;
			ТипЗначенияДата          = Истина;
			
			ИспользованиеГраниц = Ложь;
			
			Если ЗначениеЗаполнено(Параметры.МинимальноеЗначение) Тогда
				МинимальноеЗначениеДата  = ПрочитатьДатуJSON(Параметры.МинимальноеЗначение, ФорматДатыJSON.ISO);
				ИспользованиеГраниц = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(Параметры.МаксимальноеЗначение) Тогда
				МаксимальноеЗначениеДата = ПрочитатьДатуJSON(Параметры.МаксимальноеЗначение, ФорматДатыJSON.ISO);
				ИспользованиеГраниц = Истина;
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы,
				Элементы.ЗначениеЧислоОт.Имя,
				"ОтображениеПодсказки",
				ОтображениеПодсказки.Нет);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы,
				Элементы.ЗначениеЧислоДо.Имя,
				"ОтображениеПодсказки",
				ОтображениеПодсказки.Нет);
			УстановитьРасширеннуюПодсказкуМинимальноеЗначение(
				Элементы.ЗначениеДатаОт, ИспользованиеГраниц, Символы.ПС + Формат(МинимальноеЗначениеДата, "ДЛФ=ДД"));
			УстановитьРасширеннуюПодсказкуМаксимальноеЗначение(
				Элементы.ЗначениеДатаДо, ИспользованиеГраниц, Символы.ПС + Формат(МаксимальноеЗначениеДата, "ДЛФ=ДД"));
				
		Иначе
			Элементы.СтраницыТиповИнтервалов.ТекущаяСтраница = Элементы.СтраницаТипаЧисло;
			ЗначениеЧислоОт           = Параметры.ЗначениеОт;
			ЗначениеЧислоДо           = Параметры.ЗначениеДо;
			МинимальноеЗначениеЧисло  = Параметры.МинимальноеЗначение;
			МаксимальноеЗначениеЧисло = Параметры.МаксимальноеЗначение;
			
			ИспользованиеГраниц = ЗначениеЗаполнено(МинимальноеЗначениеЧисло)
				Или ЗначениеЗаполнено(МаксимальноеЗначениеЧисло);
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы,
				Элементы.ЗначениеДатаОт.Имя,
				"ОтображениеПодсказки",
				ОтображениеПодсказки.Нет);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы,
				Элементы.ЗначениеДатаДо.Имя,
				"ОтображениеПодсказки",
				ОтображениеПодсказки.Нет);
			УстановитьРасширеннуюПодсказкуМинимальноеЗначение(
				Элементы.ЗначениеЧислоОт, ИспользованиеГраниц, МинимальноеЗначениеЧисло);
			УстановитьРасширеннуюПодсказкуМаксимальноеЗначение(
				Элементы.ЗначениеЧислоДо, ИспользованиеГраниц, МаксимальноеЗначениеЧисло);
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГруппаЗаголовок.Заголовок = ИмяРеквизита;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Элементы.СтраницыВидовОтборов.ТекущаяСтраница = Элементы.СтраницаВводаИнтервала Тогда
		
		НеверныйИнтервал = Ложь;
		
		СтруктураВозврата = Новый Структура("ИнтервалОт, ИнтервалДо");
		
		Если ТипЗначенияДата Тогда
			СтруктураВозврата.ИнтервалОт = ЗначениеДатаОт;
			СтруктураВозврата.ИнтервалДо = ЗначениеДатаДо;
			
			МаксимальноеЗначениеДатаЗаполнено = ЗначениеЗаполнено(МаксимальноеЗначениеДата);
			МинимальноеЗначениеДатаЗаполнено  = ЗначениеЗаполнено(МинимальноеЗначениеДата);
			ЗначениеДатаДоЗаполнено = ЗначениеЗаполнено(ЗначениеДатаДо);
			ЗначениеДатаОтЗаполнено = ЗначениеЗаполнено(ЗначениеДатаОт);
			
			НеверныйИнтервал = (ЗначениеДатаОт > ЗначениеДатаДо)И ЗначениеДатаДоЗаполнено;
			
			Если МаксимальноеЗначениеДатаЗаполнено И (ЗначениеДатаДоЗаполнено ИЛИ ЗначениеДатаОтЗаполнено) Тогда
				НеверныйИнтервал = НеверныйИнтервал
					ИЛИ (ЗначениеДатаДо > МаксимальноеЗначениеДата)
					ИЛИ (ЗначениеДатаОт > МаксимальноеЗначениеДата);
			КонецЕсли;
			
			Если МинимальноеЗначениеДатаЗаполнено Тогда
				НеверныйИнтервал = НеверныйИнтервал
					ИЛИ (ЗначениеДатаОт < МинимальноеЗначениеДата) И ЗначениеДатаОтЗаполнено
					ИЛИ (ЗначениеДатаДо < МинимальноеЗначениеДата) И ЗначениеДатаДоЗаполнено;
			КонецЕсли;
			
		Иначе
			СтруктураВозврата.ИнтервалОт = ЗначениеЧислоОт;
			СтруктураВозврата.ИнтервалДо = ЗначениеЧислоДо;
			
			МаксимальноеЗначениеЧислоЗаполнено = ЗначениеЗаполнено(МаксимальноеЗначениеЧисло);
			МинимальноеЗначениеЧислоЗаполнено  = ЗначениеЗаполнено(МинимальноеЗначениеЧисло);
			ЗначениеЧислоДоЗаполнено = ЗначениеЗаполнено(ЗначениеЧислоДо);
			ЗначениеЧислоОтЗаполнено = ЗначениеЗаполнено(ЗначениеЧислоОт);
			
			НеверныйИнтервал = (ЗначениеЧислоОт > ЗначениеЧислоДо) И ЗначениеЧислоДоЗаполнено;
			
			Если МаксимальноеЗначениеЧислоЗаполнено И (ЗначениеЧислоОтЗаполнено ИЛИ ЗначениеЧислоДоЗаполнено) Тогда
				НеверныйИнтервал = НеверныйИнтервал
					ИЛИ (ЗначениеЧислоДо > МаксимальноеЗначениеЧисло)
					ИЛИ (ЗначениеЧислоОт > МаксимальноеЗначениеЧисло);
			Иначе
				НеверныйИнтервал = НеверныйИнтервал ИЛИ ЗначениеЧислоДо < 0;
			КонецЕсли;
			
			Если МинимальноеЗначениеЧислоЗаполнено Тогда
				НеверныйИнтервал = НеверныйИнтервал
					ИЛИ (ЗначениеЧислоОт < МинимальноеЗначениеЧисло) И ЗначениеЧислоОтЗаполнено
					ИЛИ (ЗначениеЧислоДо < МинимальноеЗначениеЧисло) И ЗначениеЧислоДоЗаполнено;
			Иначе
				НеверныйИнтервал = НеверныйИнтервал ИЛИ ЗначениеЧислоОт < 0;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НеверныйИнтервал Тогда
			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Указан неверный диапазон значений'"));
			Возврат;
		КонецЕсли;
		
	Иначе
		
		СтруктураВозврата = Новый Структура("ЗначениеОтбора", ЗначениеВыбораСтрока);
		
	КонецЕсли;
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	РедактироватьПериод(ЭтаФорма,
		Новый Структура("ДатаНачала, ДатаОкончания", "ЗначениеДатаОт", "ЗначениеДатаДо"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура позволяет установить период через стандартный диалог выбора периода
//
// Параметры:
//  Объект                - Произвольный - Объект в котором устанавливается значения периода
//  ПараметрыПериода      - Структура - структура со свойствами "ДатаНачала", "ДатаОкончания" и в значениях имена полей
//                              объекта, для свойства "Вариант" - значение варианта стандартного периода.
//  ОповещениеПослеВыбора - ОписаниеОповещения - Описание оповещение которое выполняется после установки периода. 
//                              Может быть установлена пост-обработка в месте вызова после выбора периода.
&НаКлиенте
Процедура РедактироватьПериод(Объект, ПараметрыПериода = Неопределено, ОповещениеПослеВыбора = Неопределено)
	
	Если ПараметрыПериода = Неопределено Тогда
		ПараметрыПериода = Новый Структура("ДатаНачала, ДатаОкончания", "ДатаНачала", "ДатаОкончания");
	КонецЕсли;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Если ПараметрыПериода.Свойство("ДатаНачала") Тогда
		Диалог.Период.ДатаНачала = Объект[ПараметрыПериода.ДатаНачала];
	КонецЕсли; 
	Если ПараметрыПериода.Свойство("ДатаОкончания") Тогда
		Диалог.Период.ДатаОкончания = Объект[ПараметрыПериода.ДатаОкончания];
	КонецЕсли; 
	Если ПараметрыПериода.Свойство("Вариант") Тогда
		Диалог.Период.Вариант = ПараметрыПериода.Вариант;
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект",           Объект);
	ДополнительныеПараметры.Вставить("ПараметрыПериода", ПараметрыПериода);
	Если ОповещениеПослеВыбора <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("ОповещениеПослеВыбора", ОповещениеПослеВыбора);
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения(
		"РедактироватьПериодЗавершение",
		ЭтотОбъект,
		ДополнительныеПараметры);
	
	Диалог.Показать(Оповещение);

КонецПроцедуры

// Процедура завершения для РедактироватьПериод()
// см. подробней для процедуры РедактироватьПериод().
&НаКлиенте
Процедура РедактироватьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт 

	ПараметрыПериода = ДополнительныеПараметры.ПараметрыПериода;
	Объект           = ДополнительныеПараметры.Объект;
	Если Период <> Неопределено Тогда
		Если ПараметрыПериода.Свойство("ДатаНачала") Тогда
			Объект[ПараметрыПериода.ДатаНачала]= Период.ДатаНачала;
		КонецЕсли; 
		Если ПараметрыПериода.Свойство("ДатаОкончания") Тогда
			Объект[ПараметрыПериода.ДатаОкончания]= Период.ДатаОкончания;
		КонецЕсли; 
		Если ПараметрыПериода.Свойство("Вариант") Тогда
			Объект[ПараметрыПериода.Вариант]= Период.Вариант;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОповещениеПослеВыбора") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеВыбора, Период);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРасширеннуюПодсказкуМинимальноеЗначение(ЭлементФормы, Знач Использование, Знач Значение)
	УстановитьРасширеннуюПодсказку(
		ЭлементФормы, 
		Использование,
		Значение,
		НСтр(
			"ru = 'Минимальное значение: %1'", 
			ОбщегоНазначения.КодОсновногоЯзыка()));
КонецПроцедуры

&НаСервере
Процедура УстановитьРасширеннуюПодсказкуМаксимальноеЗначение(ЭлементФормы, Знач Использование, Знач Значение)
	УстановитьРасширеннуюПодсказку(
		ЭлементФормы, 
		Использование,
		Значение,
		НСтр(
			"ru = 'Максимальное значение: %1'", 
			ОбщегоНазначения.КодОсновногоЯзыка()));
КонецПроцедуры

&НаСервере
Процедура УстановитьРасширеннуюПодсказку(ЭлементФормы, Знач Использование, Знач Значение, Знач Шаблон)
	
	Если Использование Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			ЭлементФормы.РасширеннаяПодсказка.Имя,
			"Заголовок",
			СтрШаблон(Шаблон, Значение));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			ЭлементФормы.Имя,
			"ОтображениеПодсказки",
			ОтображениеПодсказки.Нет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


