///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "СПАРК".
// ОбщийМодуль.СПАРКРискиКлиентСерверПовтИсп.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Возвращает цвета стилей, используемых подсистемой.
//
// Возвращаемое значение:
//  Структура - См СПАРКРиски.ЦветаСтилей.
//
Функция ЦветаСтилей() Экспорт
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Возврат СПАРКРиски.ЦветаСтилей();
	#Иначе
		Возврат СПАРКРискиКлиент.ЦветаСтилей();
	#КонецЕсли
	
КонецФункции

#КонецОбласти
