
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Справочники.КлассификаторТНВЭД) Тогда
		Элементы.ПодборИзТНВЭД.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("СписокТНВЭД") Тогда
		
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			Список.Отбор.Элементы, "ОтборПоСписку",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		
		УправлениеНебольшойФирмойКлиентСервер.ИзменитьЭлементОтбораГруппыСписка(
				ГруппаОтбора, "Ссылка", Параметры.СписокТНВЭД,
				Истина, ВидСравненияКомпоновкиДанных.ВСписке);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	ДополнительныеПараметры = Новый Структура;
	Если Копирование Тогда
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Код", Элемент.ТекущиеДанные.Код);
		ЗначенияЗаполнения.Вставить("Наименование", Элемент.ТекущиеДанные.Наименование);
		ДополнительныеПараметры.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросПодобратьТНВЭДЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Есть возможность подобрать товарную номенклатуру ВЭД из классификатора.
		|Подобрать?'");
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборИзТНВЭД(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодборИзКлассификатораЗавершение", ЭтотОбъект);
	
	НастройкиРежима = Новый Структура;
	НастройкиРежима.Вставить("Владелец", ЭтотОбъект);
	НастройкиРежима.Вставить("РежимВыбораЭлемента", Истина);
	НастройкиРежима.Вставить("ОбработчикЗавершения", ОповещениеОЗакрытии);
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		НастройкиРежима.Вставить("КодВыбранногоЭлемента", Элементы.Список.ТекущиеДанные.Код);
	КонецЕсли;
	
	ОблачныеКлассификаторыКлиент.ПодобратьИзСервисаЭлементыТНВЭД(НастройкиРежима);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросПодобратьТНВЭДЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПодборИзТНВЭД(Неопределено);
	Иначе
		ОткрытьФорму("Справочник.КлассификаторТНВЭД.Форма.ФормаЭлемента", ДополнительныеПараметры, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзКлассификатораЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйЭлемент = ДобавитьЭлементКлассификатора(РезультатВыбора);
	
	ОповеститьОбИзменении(НовыйЭлемент);
	
	Элементы.Список.ТекущаяСтрока = НовыйЭлемент;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ДобавитьЭлементКлассификатора(СвойстваЭлемента)
	
	Если НЕ ЗначениеЗаполнено(СвойстваЭлемента.Код) Тогда
		Возврат Справочники.КлассификаторТНВЭД.ПустаяСсылка();
	КонецЕсли;
	
	ЭлементТНВЭД = Справочники.КлассификаторТНВЭД.СоздатьОбновитьЭлементКлассификатора(
		СвойстваЭлемента);
	
	Возврат ЭлементТНВЭД;
	
КонецФункции

#КонецОбласти