#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТоварнаяГруппа = Параметры.ТоварнаяГруппа;
	Организация    = Параметры.Организация;
	
	Для Каждого КлючИЗначение Из Параметры.ДоступныеЭлементы Цикл
		Элементы["Заполнять" + КлючИЗначение.Ключ].Видимость = КлючИЗначение.Значение;
		Элементы[КлючИЗначение.Ключ].Видимость               = КлючИЗначение.Значение;
	КонецЦикла;
	
	Элементы.Шаблон.СписокВыбора.Очистить();
	ДоступныеШаблоны = ИнтеграцияИСМПКлиентСервер.ШаблоныКодовПоВидуПродукции(ТоварнаяГруппа, 0);
	Если ДоступныеШаблоны.Количество() > 1 Тогда
		Для Каждого ЭлементСпискаЗначений Из ДоступныеШаблоны Цикл
			Элементы.Шаблон.СписокВыбора.Добавить(
				ЭлементСпискаЗначений.Значение, ЭлементСпискаЗначений.Представление);
		КонецЦикла;
	Иначе
		Элементы.ЗаполнятьШаблон.Видимость = Ложь;
		Элементы.Шаблон.Видимость          = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолноеОписаниеОстатковПриИзменении(Элемент)
	
	ИменаПолейУпрощенногоОписанияОстатков = ИменаПолейУпрощенногоОписанияОстатков();
	
	Для Каждого ИмяПоля Из ИменаПолейУпрощенногоОписанияОстатков Цикл
		Элементы["Заполнять" + ИмяПоля].ТолькоПросмотр = ПолноеОписаниеОстатков;
		Если ПолноеОписаниеОстатков Тогда
			ЭтотОбъект["Заполнять" + ИмяПоля] = Ложь;
			Элементы[ИмяПоля].ТолькоПросмотр  = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КодТНВЭДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ТекущаяСтрока",                           КодТНВЭД);
	ПараметрыФормы.Вставить("ВидПродукцииТоварнаяГруппа",              ТоварнаяГруппа);
	ПараметрыФормы.Вставить("РежимВыбора",                             Истина);
	ПараметрыФормы.Вставить("ВозвращатьСсылкуНаЭлементКлассификатора", Ложь);
	
	ОткрытьФорму(
		"РегистрСведений.КодыТНВЭДИСМП.Форма.ФормаСписка", ПараметрыФормы, Элемент,,,,,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КодТНВЭДПриИзменении(Элемент)
	
	ПриИзмененииКодаТНВЭД();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьКодТНВЭДПриИзменении(Элемент)
	
	УправлениеДоступностьюСвязанныхЭлементов(Элемент);
	
	Если ЗаполнятьКодТНВЭД Тогда
		ПриИзмененииКодаТНВЭД();
	Иначе
		Элементы.ЗаполнятьВозрастнаяКатегория.ТолькоПросмотр = Ложь;
		Элементы.ЗаполнятьЦелевойПол.ТолькоПросмотр          = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьЦелевойПолПриИзменении(Элемент)
	
	УправлениеДоступностьюСвязанныхЭлементов(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьМодельПриИзменении(Элемент)
	
	УправлениеДоступностьюСвязанныхЭлементов(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьТоварныйЗнакПриИзменении(Элемент)
	
	УправлениеДоступностьюСвязанныхЭлементов(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьВозрастнуюКатегориюПриИзменении(Элемент)
	
	УправлениеДоступностьюСвязанныхЭлементов(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьСпособВводаВОборотПриИзменении(Элемент)
	
	УправлениеДоступностьюСвязанныхЭлементов(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьНаименованиеПриИзменении(Элемент)
	
	УправлениеДоступностьюСвязанныхЭлементов(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьШаблонПриИзменении(Элемент)
	
	УправлениеДоступностьюСвязанныхЭлементов(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	СтруктураРезультата = Новый Структура();
	
	СтруктураРезультата.Вставить("ПолноеОписаниеОстатков", ПолноеОписаниеОстатков);
	
	ИменаПолейУпрощенногоОписанияОстатков = ИменаПолейУпрощенногоОписанияОстатков();
	
	Для Каждого ИмяПоля Из ИменаПолейУпрощенногоОписанияОстатков Цикл
		Если ЭтотОбъект["Заполнять" + ИмяПоля] Тогда
			СтруктураРезультата.Вставить(ИмяПоля, ЭтотОбъект[ИмяПоля]);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаполнятьШаблон Тогда
		СтруктураРезультата.Вставить("Шаблон", Шаблон);
	КонецЕсли;
	
	Закрыть(СтруктураРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИменаПолейУпрощенногоОписанияОстатков()
	
	Результат = Новый Массив;
	Результат.Добавить("КодТНВЭД");
	Результат.Добавить("ЦелевойПол");
	Результат.Добавить("ВозрастнаяКатегория");
	Результат.Добавить("Модель");
	Результат.Добавить("СпособВводаВОборот");
	Результат.Добавить("Наименование");
	Результат.Добавить("ТоварныйЗнак");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УправлениеДоступностьюСвязанныхЭлементов(Элемент)
	
	Элементы[СтрЗаменить(Элемент.Имя, "Заполнять", "")].ТолькоПросмотр = Не ЭтотОбъект[Элемент.Имя];
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКодаТНВЭД()
	
	Если ЗначениеЗаполнено(КодТНВЭД) Тогда
	
		КодТНВЭДТребуетВозрастнуюКатегорию = МаркировкаТоваровКлиентСервер.ДоступноПолеВозрастнаяКатегорияДляМаркировкиОстатков(
			ТоварнаяГруппа, КодТНВЭД);
			
		Элементы.ЗаполнятьВозрастнаяКатегория.ТолькоПросмотр = Не КодТНВЭДТребуетВозрастнуюКатегорию;
		Элементы.ЗаполнятьЦелевойПол.ТолькоПросмотр          = КодТНВЭДТребуетВозрастнуюКатегорию;
		
		Если КодТНВЭДТребуетВозрастнуюКатегорию Тогда
			ЗапрещенныйЭлемент = Элементы.ЗаполнятьЦелевойПол;
		Иначе
			ЗапрещенныйЭлемент = Элементы.ЗаполнятьВозрастнаяКатегория;
		КонецЕсли;
		
		ЭтотОбъект[ЗапрещенныйЭлемент.Имя] = Ложь;
		УправлениеДоступностьюСвязанныхЭлементов(ЗапрещенныйЭлемент);
		
	Иначе
		Элементы.ЗаполнятьВозрастнаяКатегория.ТолькоПросмотр = Ложь;
		Элементы.ЗаполнятьЦелевойПол.ТолькоПросмотр          = Ложь;
		
		УправлениеДоступностьюСвязанныхЭлементов(Элементы.ЗаполнятьВозрастнаяКатегория);
		УправлениеДоступностьюСвязанныхЭлементов(Элементы.ЗаполнятьЦелевойПол);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти