
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если МобильныйКлиентУНФ.ФункциональностьВременноНедоступна(Отказ) Тогда
		Возврат;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() <> Истина Тогда
		Элементы.Фото.Ширина = 10;	
	КонецЕсли;
	
	АссистентПодключен = АссистентУправления.Подключен();
	ИнформационнаяБазаПодключена = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	
	ТекущийЭлемент = Элементы.ИзмениСостояниеПриОплате;
	ТекущаяСтраница = "ИзмениСостояниеЗаказа";
	
	Элементы.ТекстПриветствие.Заголовок = "Привет!" + Символы.ПС + Символы.ПС 
		+ "Я могу быть полезна в различных сценариях, например:";
	
	
	ЦветаКнопок = ЦветаКнопок();
	
	Элементы.ИзмениСостояниеЗаказа.ЦветФона = ЦветаКнопок.ЦветАктивности;
	Элементы.ОповестиПользователя.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ОповестиКлиента.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.РекомендацииОтДаши.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиСНалогами.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиКонтролировать.ЦветФона = ЦветаКнопок.ЦветНеактивности;

	ИспользоватьПодсистемуПроизводство = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуПроизводство");
	ИспользоватьБонусныеПрограммы = ПолучитьФункциональнуюОпцию("ИспользоватьБонусныеПрограммы");
	ИспользоватьОтчетность = ПолучитьФункциональнуюОпцию("ИспользоватьОтчетность");
	ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи = ПолучитьФункциональнуюОпцию("ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи");
	ПланироватьЗагрузкуРесурсовПредприятияРаботы  = ПолучитьФункциональнуюОпцию("ПланироватьЗагрузкуРесурсовПредприятияРаботы");
	УчетПотребностиПоСкладам = ПолучитьФункциональнуюОпцию("УчетПотребностиПоСкладам");
	ИспользоватьРегулярныеПлатежи = ПолучитьФункциональнуюОпцию("ИспользоватьРегулярныеПлатежи");
	ИспользоватьМаршрутизациюЗаявок = ПолучитьФункциональнуюОпцию("ИспользоватьМаршрутизациюЗаявок");
	ИспользоватьПодсистемуCRM = ПолучитьФункциональнуюОпцию( "ИспользоватьПодсистемуCRM" );
	ИспользоватьПодсистемуЗакупки = ПолучитьФункциональнуюОпцию( "ИспользоватьПодсистемуЗакупки" );
	ИспользоватьАнализБизнеса = ПолучитьФункциональнуюОпцию( "ИспользоватьАнализБизнеса" );
	ИспользоватьЗадачиСотрудников = ПолучитьФункциональнуюОпцию("ИспользоватьЗадачиСотрудников");
	
	УстановитьПризнакиВРаботе();
	
	УстановитьВидимостьЭлементов();
	
	УправлениеФормой();
	
	ТестовыйФлаг = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредложитьВозможностьНажатие(Элемент)
	
	ТекстПисьма = НСтр("ru = 'Опишите, каких навыков не хватает ассистенту управления:'");
	Тег = НСтр("ru = 'Ассистент управления'");
	
	УправлениеНебольшойФирмойКлиент.ПредложитьВозможностьНажатие(Тег, ТекстПисьма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбсужденияНажатие(Элемент)
	НачатьПодключениеОбсуждений();
КонецПроцедуры

&НаКлиенте
Процедура ТекстОшибкиПодключениеНажатие(Элемент)
	ПодключитьАссистента();
КонецПроцедуры

&НаКлиенте
Процедура ТекстОшибкиОбсуждениеНажатие(Элемент)
	СоздатьОбсуждение();
КонецПроцедуры

&НаКлиенте
Процедура Декорация36Нажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзменениеСостоянияЗаказПокупателяРекомендацииНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамПоставщикам();
КонецПроцедуры

&НаКлиенте
Процедура Декорация42Нажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамПоставщикам();
КонецПроцедуры

&НаКлиенте
Процедура Декорация33Нажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаНаПроизводствоПриВыполнении();
КонецПроцедуры

&НаКлиенте
Процедура Декорация39Нажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриОплате();
КонецПроцедуры

&НаКлиенте
Процедура Декорация47Нажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриОплатеИПоставке();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзменениеСостоянияПоставкаРекомендацииНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриПоставке();
КонецПроцедуры

&НаКлиенте
Процедура Декорация45Нажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриПоставке();
КонецПроцедуры

&НаКлиенте
Процедура Декорация51Нажатие(Элемент)
	ОбработкаИзмененияСостоянияПриОплате();
КонецПроцедуры

&НаКлиенте
Процедура Декорация55Нажатие(Элемент)
	ОбработкаИзмененияСостоянияПриОплатеИОтгрузке();
КонецПроцедуры

&НаКлиенте
Процедура Декорация53Нажатие(Элемент)
	ОбработкаИзмененияСостоянияПриОтгрузке();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповестиКлиентаОБонусахПриПродажеНажатие(Элемент)
	ОповещениеКлиентаОБонусахПриПродаже();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеКлиентаОБонусахПриУсловияхНажатие(Элемент)
	ОповещениеКлиентаОБонусахПриУсловиях();
КонецПроцедуры

&НаКлиенте
Процедура Декорация59Нажатие(Элемент)
	ОповещениеКлиентаОбИзмененииСостоянияЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура Декорация71Нажатие(Элемент)
	СообщениеЗаказуПокупателяПоЗаказамНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура Декорация63Нажатие(Элемент)
	СообщениеЗаказуПокупателяПоЗаказамПоставщикам();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзмениСостояниеПриОплатеНажатие(Элемент)
	ОбработкаИзмененияСостоянияПриОплате();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзменениеСостоянияОплатаИОтгрузкаНажатие(Элемент)
	ОбработкаИзмененияСостоянияПриОплатеИОтгрузке();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзменениеСостоянияОтгрузкаНажатие(Элемент)
	ОбработкаИзмененияСостоянияПриОтгрузке();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеПользователяПриОплатеЗаказаНажатие(Элемент)
	СообщениеПриОплатеЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеПользователяПриОтгрузкеЗаказаНажатие(Элемент)
	СообщениеПриОтгрузкеЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеПользователяПриОтгрузкеОплатеЗаказаНажатие(Элемент)
	СообщениеПриОтгрузкеИОплате();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзмениСостояниеЗаказПокупателяЗаказПоставщикуНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамПоставщикам();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзмениСостояниеЗаказПокупателяЗаказНаПроизводствоНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзмениСостояниеЗаказПоставщикуПриОплатеНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриОплате();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзменениеСостоянияПоставкаНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриПоставке();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзменениеСостоянияОплатаИПоставкаНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриОплатеИПоставке();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеПользователяПриОплатеЗаказаПоставщикуНажатие(Элемент)
	ОповещениеПользователяПриОплатеЗаказаПоставщику();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеПользователяПриПоставкеЗаказаПоставщикуНажатие(Элемент)
	ОповещениеПользователяПриПоставкеЗаказаПоставщику();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеПользователяПриОплатеИПоставкеЗаказаНажатие(Элемент)
	ОповещениеПользователяПриОплатеИПоставкеЗаказаПоставщику();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзмениСостояниеЗаказПокупателяЗаказПоставщикуИНаПроизводствоНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамПоставщикамНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеЗаказаПокупателяПоЗаказамПоставщикамНажатие(Элемент)
	СообщениеЗаказуПокупателяПоЗаказамПоставщикам();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеЗаказаПокупателяПоЗаказамНаПроизводствоНажатие(Элемент)
	СообщениеЗаказуПокупателяПоЗаказамНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеЗаказаПокупателяПоЗаказамПоставщикамИНаПроизводствоНажатие(Элемент)
	СообщениеЗаказуПокупателяПоЗаказамПоставщикамИНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзменениеСостоянияЗаказПоставщикуЗаказПокупателяНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказПоставщикуПоЗаказамПокупателей();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеЗаказаПоставщикуПоЗаказуПокупателяНажатие(Элемент)
	СообщениеЗаказуПоставщикуПоЗаказамПокупателей();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзмениСостояниеЗаказаНаПроизводствоПриВыполненииНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаНаПроизводствоПриВыполнении();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзменениеСостоянияЗаказНаПроизводствоЗаказПокупателяНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаНаПроизводствоПоЗаказуПокупателя();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеПользователяПриВыполненииЗаказаНаПроизводствоНажатие(Элемент)
	ОповещениеПользователяПриВыполненииЗаказаНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеЗаказаНаПроизводствоПоЗаказуПокупателяНажатие(Элемент)
	СообщениеЗаказуНаПроизводствоПоЗаказамПокупателей();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповестиПользователяОбИзмененииБонусовПриПродажеНажатие(Элемент)
	ОповещениеСотрудникаОбИзмененииБонусовПриПродаже();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповестиКлиентаОбИзмененииСостоянияЗаказаНажатие(Элемент)
	ОповещениеКлиентаОбИзмененииСостоянияЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповестиКлиентаОНачисленииНалогаНажатие(Элемент)
	ОповещениеКлиентаОНачисленныхНалогах();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеКлиентаОбОтчетностиНажатие(Элемент)
	ОповещениеКлиентаОбОтчетности();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеКлиентаОЗаписиНажатие(Элемент)
	ОповещениеКлиентаОЗаписиНаУслугу();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеПользователяИзменениеСостоянияЗаказаПокупателяНажатие(Элемент)
	ОповещениеОбИзмененииСостоянияЗаказаПокупателя();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеПользователяИзменениеОтветственногоЗаказПокупателяНажатие(Элемент)
	СообщениеПользователюПриИзмененииОтветственного();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповещениеПользователяОбОстатковНажатие(Элемент)
	ОповещениеОМинимальномУровнеОстатков();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОповестиПользователяОбИзмененииПоказателяНажатие(Элемент)
	ОповещениеПользователяОбИзмененииПоказателя();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаРегулярноОповещайПользователяОПоказателеНажатие(Элемент)
	РегулярноеОповещениеПользователяОПоказателе();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаРегулярноОповещайПользователяОРегулярномПлатежеНажатие(Элемент)
	РегулярноеОповещениеПользователяОРегулярномПлатеже();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаРегулярноОповещайПользователяОСогласованииЗаявокНажатие(Элемент)
	РегулярноеОповещениеПользователяОСогласованииЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияОплатаЗаказПокупателяНажатие(Элемент)
	ОбработкаИзмененияСостоянияПриОплате();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияОтгрузкаНажатие(Элемент)
	ОбработкаИзмененияСостоянияПриОтгрузке();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияОплатаИОтгрузкаНажатие(Элемент)
	ОбработкаИзмененияСостоянияПриОплатеИОтгрузке();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияЗаказПокупателяЗаказПоставщикамНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамПоставщикам();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияЗаказПокупателяЗаказНаПроизводствоНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияЗаказПокупателяЗаказПоставщикуИНаПроизводствоНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамПоставщикамНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияОплатаЗаказПоставщикуНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриОплате();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияПоставкаНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриПоставке();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияОплатаИПоставкаНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриОплатеИПоставке();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияЗаказПоставщикуЗаказПокупателяНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказПоставщикуПоЗаказамПокупателей();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияВыполнениеЗаказНаПроизводствоНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаНаПроизводствоПриВыполнении();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзменениеСостоянияЗаказНаПроизводствоЗаказПокупателяНажатие(Элемент)
	ОбработкаИзмененияСостоянияЗаказаНаПроизводствоПоЗаказуПокупателя();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяПриОплатеЗаказаНажатие(Элемент)
	СообщениеПриОплатеЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяПриОтгрузкеЗаказаНажатие(Элемент)
	СообщениеПриОтгрузкеЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяПриОтгрузкеОплатеЗаказаНажатие(Элемент)
	СообщениеПриОтгрузкеИОплате();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеЗаказаПокупателяПоЗаказамПоставщикамНажатие(Элемент)
	СообщениеЗаказуПокупателяПоЗаказамПоставщикам();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеЗаказаПокупателяПоЗаказамНаПроизводствоНажатие(Элемент)
	СообщениеЗаказуПокупателяПоЗаказамНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеЗаказаПокупателяПоЗаказамПоставщикамИНаПроизводствоНажатие(Элемент)
	СообщениеЗаказуПокупателяПоЗаказамПоставщикамИНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяИзменениеСостоянияЗаказаПокупателяНажатие(Элемент)
	ОповещениеОбИзмененииСостоянияЗаказаПокупателя();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяИзменениеОтветственногоЗаказаПокупателяНажатие(Элемент)
	СообщениеПользователюПриИзмененииОтветственного();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяПриОплатеЗаказаПоставщикуНажатие(Элемент)
	ОповещениеПользователяПриОплатеЗаказаПоставщику();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяПриПоставкеЗаказаПоставщикуНажатие(Элемент)
	ОповещениеПользователяПриПоставкеЗаказаПоставщику();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяПриОплатеИПоставкеЗаказаНажатие(Элемент)
	ОповещениеПользователяПриОплатеИПоставкеЗаказаПоставщику();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеЗаказаПоставщикуПоЗаказуПокупателяНажатие(Элемент)
	СообщениеЗаказуПоставщикуПоЗаказамПокупателей();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяПриВыполненииЗаказаНаПроизводствоНажатие(Элемент)
	ОповещениеПользователяПриВыполненииЗаказаНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеЗаказаНаПроизводствоПоЗаказуПокупателяНажатие(Элемент)
	СообщениеЗаказуНаПроизводствоПоЗаказамПокупателей();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяОбИзмененииБонусовПриПродажеНажатие(Элемент)
	ОповещениеСотрудникаОбИзмененииБонусовПриПродаже();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеКлиентаОБонусахПриПродажеНажатие(Элемент)
	ОповещениеКлиентаОБонусахПриПродаже();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеКлиентаОБонусахПриУсловияхНажатие(Элемент)
	ОповещениеКлиентаОБонусахПриУсловиях();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеКлиентаОЗаписиНажатие(Элемент)
	ОповещениеКлиентаОЗаписиНаУслугу();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеКлиентаОбИзмененииСостоянияЗаказаПокупателяНажатие(Элемент)
	ОповещениеКлиентаОбИзмененииСостоянияЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеКлиентаОНачисленииНалогаНажатие(Элемент)
	ОповещениеКлиентаОНачисленныхНалогах();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеКлиентаОбОтчетностиНажатие(Элемент)
	ОповещениеКлиентаОбОтчетности();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяОМинимальномУровнеОстатковНажатие(Элемент)
	ОповещениеОМинимальномУровнеОстатков();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОповещениеПользователяОбИзмененииПоказателяБизнесаНажатие(Элемент)
	ОповещениеПользователяОбИзмененииПоказателя();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРегулярноеОповещениеПользователяОПоказателеБизнесаНажатие(Элемент)
	РегулярноеОповещениеПользователяОПоказателе();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРегулярноеОповещениеПользователяОРегулярномПлатежеНажатие(Элемент)
	РегулярноеОповещениеПользователяОРегулярномПлатеже();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРегулярноеОповещениеПользователяОСогласованииЗаявокНажатие(Элемент)
	РегулярноеОповещениеПользователяОСогласованииЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРегулярноеОповещениеОСтатусеЗадачНажатие(Элемент)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОСтатусеЗадач");
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОбИзмененииОтветственногоВЗадачахНажатие(Элемент)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователейОбИзмененияхВЗадачах"); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РегулярноОповещайПользователяОСтатусеЗадач(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОСтатусеЗадач");
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователяПриИзмененииПоЗадаче(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователейОбИзмененияхВЗадачах"); 
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеПриОплате(Команда)
	ОбработкаИзмененияСостоянияПриОплате();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеПриОплатеИОтгрузке(Команда)
	ОбработкаИзмененияСостоянияПриОплатеИОтгрузке();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеПриОтгрузке(Команда)
	ОбработкаИзмененияСостоянияПриОтгрузке();
КонецПроцедуры

&НаКлиенте
Процедура СообщиПриОплатеЗаказа(Команда)
	СообщениеПриОплатеЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура СообщиПриОтгрузкеЗаказа(Команда)
	СообщениеПриОтгрузкеЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура СообщиПриОтгрузкеИОплате(Команда)
	СообщениеПриОтгрузкеИОплате();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказПокупателяПоЗаказамПоставщикам(Команда)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамПоставщикам();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказПокупателяПоЗаказамНаПроизводство(Команда)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказаПоставщикуПриОплате(Команда)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриОплате();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказаПоставщикуПриПоставке(Команда)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриПоставке();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказаПоставщикуПриОплатеИПоставке(Команда)
	ОбработкаИзмененияСостоянияЗаказаПоставщикуПриОплатеИПоставке();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователяПриОплатеЗаказаПоставщику(Команда)
	ОповещениеПользователяПриОплатеЗаказаПоставщику();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователяПриПоставкеЗаказаПоставщику(Команда)
	ОповещениеПользователяПриПоставкеЗаказаПоставщику();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователяПриОплатеИПоставкеЗаказаПоставщику(Команда)
	ОповещениеПользователяПриОплатеИПоставкеЗаказаПоставщику();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказПокупателяПоЗаказамПоставщикамНаПроизводство(Команда)
	ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамПоставщикамНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура СообщиЗаказуПокупателяПоЗаказамПоставщикам(Команда)
	СообщениеЗаказуПокупателяПоЗаказамПоставщикам();
КонецПроцедуры

&НаКлиенте
Процедура СообщиЗаказуПокупателяПоЗаказамНаПроизводство(Команда)
	СообщениеЗаказуПокупателяПоЗаказамНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура СообщиЗаказуПокупателяПоЗаказамПоставщикамИНаПроизводство(Команда)
	СообщениеЗаказуПокупателяПоЗаказамПоставщикамИНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказПоставщикуПоЗаказамПокупателей(Команда)
	ОбработкаИзмененияСостоянияЗаказПоставщикуПоЗаказамПокупателей();
КонецПроцедуры

&НаКлиенте
Процедура СообщиЗаказуПоставщикуПоЗаказамПокупателей(Команда)
	СообщениеЗаказуПоставщикуПоЗаказамПокупателей();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказаНаПроизводствоПриВыполнении(Команда)
	ОбработкаИзмененияСостоянияЗаказаНаПроизводствоПриВыполнении();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказаНаПроизводствоПоЗаказуПокупателя(Команда)
	ОбработкаИзмененияСостоянияЗаказаНаПроизводствоПоЗаказуПокупателя();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователяПриВыполненииЗаказаНаПроизводство(Команда)
	ОповещениеПользователяПриВыполненииЗаказаНаПроизводство();
КонецПроцедуры

&НаКлиенте
Процедура СообщиЗаказуНаПроизводствоПоЗаказамПокупателей(Команда)
	СообщениеЗаказуНаПроизводствоПоЗаказамПокупателей();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОБонусахПриУсловиях(Команда)
	ОповещениеКлиентаОБонусахПриУсловиях();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОБонусахПриПродаже(Команда)
	ОповещениеКлиентаОБонусахПриПродаже();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиСотрудникаОбИзмененииБонусовПриПродаже(Команда)
	ОповещениеСотрудникаОбИзмененииБонусовПриПродаже();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОбИзмененииСостоянияЗаказа(Команда)
	ОповещениеКлиентаОбИзмененииСостоянияЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОНачисленныхНалогах(Команда)
	ОповещениеКлиентаОНачисленныхНалогах();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОбОтчетности(Команда)
	ОповещениеКлиентаОбОтчетности();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОЗаписиНаУслугу(Команда)
	ОповещениеКлиентаОЗаписиНаУслугу();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиОбИзмененииСостоянияЗаказаПокупателя(Команда)
	ОповещениеОбИзмененииСостоянияЗаказаПокупателя();
КонецПроцедуры

&НаКлиенте
Процедура СообщиПользователюПриИзмененииОтветственного(Команда)
	СообщениеПользователюПриИзмененииОтветственного();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиОМинимальномУровнеОстатков(Команда)
	ОповещениеОМинимальномУровнеОстатков();
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователяОбИзмененииПоказателя(Команда)
	ОповещениеПользователяОбИзмененииПоказателя();
КонецПроцедуры

&НаКлиенте
Процедура РегулярноОповещайПользователяОПоказателе(Команда)
	РегулярноеОповещениеПользователяОПоказателе();
КонецПроцедуры

&НаКлиенте
Процедура РегулярноОповещайПользователяОРегулярномПлатеже(Команда)
	РегулярноеОповещениеПользователяОРегулярномПлатеже();
КонецПроцедуры

&НаКлиенте
Процедура РегулярноОповещайПользователяОСогласованииЗаявок(Команда)
	РегулярноеОповещениеПользователяОСогласованииЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказа(Команда)
	
	ТекущаяСтраница = "ИзмениСостояниеЗаказа";
	
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Истина;
	Элементы.Группа_ОповещениеПользователя.Видимость = Ложь;
	Элементы.Группа_ОповещениеКлиента.Видимость = Ложь;
	Элементы.Группа_РекомендацииДаши.Видимость = Ложь;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Ложь;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Ложь;
	
	ЦветаКнопок = ЦветаКнопок();
	
	Элементы.ИзмениСостояниеЗаказа.ЦветФона = ЦветаКнопок.ЦветАктивности;
	Элементы.ОповестиПользователя.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ОповестиКлиента.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.РекомендацииОтДаши.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиСНалогами.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиКонтролировать.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователя(Команда)
	ТекущаяСтраница = "ОповестиПользователя";
	
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Ложь;
	Элементы.Группа_ОповещениеПользователя.Видимость = Истина;
	Элементы.Группа_ОповещениеКлиента.Видимость = Ложь;
	Элементы.Группа_РекомендацииДаши.Видимость = Ложь;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Ложь;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Ложь;
	
	ЦветаКнопок = ЦветаКнопок();
	
	Элементы.ИзмениСостояниеЗаказа.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ОповестиПользователя.ЦветФона = ЦветаКнопок.ЦветАктивности;
	Элементы.ОповестиКлиента.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.РекомендацииОтДаши.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиСНалогами.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиКонтролировать.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиента(Команда)
	ТекущаяСтраница = "ОповестиКлиента";
	
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Ложь;
	Элементы.Группа_ОповещениеПользователя.Видимость = Ложь;
	Элементы.Группа_ОповещениеКлиента.Видимость = Истина;
	Элементы.Группа_РекомендацииДаши.Видимость = Ложь;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Ложь;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Ложь;
	
	ЦветаКнопок = ЦветаКнопок();
	
	Элементы.ИзмениСостояниеЗаказа.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ОповестиПользователя.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ОповестиКлиента.ЦветФона = ЦветаКнопок.ЦветАктивности;
	Элементы.РекомендацииОтДаши.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиСНалогами.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиКонтролировать.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомогиСНалогами(Команда)
	
	ТекущаяСтраница = "ПомогиСНалогами";
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Ложь;
	Элементы.Группа_ОповещениеПользователя.Видимость = Ложь;
	Элементы.Группа_ОповещениеКлиента.Видимость = Ложь;
	Элементы.Группа_РекомендацииДаши.Видимость = Ложь;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Истина;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Ложь;
	
	ЦветаКнопок = ЦветаКнопок();
	
	Элементы.ИзмениСостояниеЗаказа.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ОповестиПользователя.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ОповестиКлиента.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.РекомендацииОтДаши.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиСНалогами.ЦветФона = ЦветаКнопок.ЦветАктивности;
	Элементы.ПомогиКонтролировать.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	
КонецПроцедуры

&НаКлиенте
Процедура РекомендацииОтДаши(Команда)
	
	ТекущаяСтраница = "РекомендацииДаши";
	
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Ложь;
	Элементы.Группа_ОповещениеПользователя.Видимость = Ложь;
	Элементы.Группа_ОповещениеКлиента.Видимость = Ложь;
	Элементы.Группа_РекомендацииДаши.Видимость = Истина;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Ложь;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Ложь;
	
	ЦветаКнопок = ЦветаКнопок();
	
	Элементы.ИзмениСостояниеЗаказа.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ОповестиПользователя.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ОповестиКлиента.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.РекомендацииОтДаши.ЦветФона = ЦветаКнопок.ЦветАктивности;
	Элементы.ПомогиСНалогами.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиКонтролировать.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомогиКонтролировать(Команда)
	
	ТекущаяСтраница = "ПомогиКонтролировать";
	
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Ложь;
	Элементы.Группа_ОповещениеПользователя.Видимость = Ложь;
	Элементы.Группа_ОповещениеКлиента.Видимость = Ложь;
	Элементы.Группа_РекомендацииДаши.Видимость = Ложь;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Ложь;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Истина;
	
	ЦветаКнопок = ЦветаКнопок();
	
	Элементы.ИзмениСостояниеЗаказа.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ОповестиПользователя.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ОповестиКлиента.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.РекомендацииОтДаши.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиСНалогами.ЦветФона = ЦветаКнопок.ЦветНеактивности;
	Элементы.ПомогиКонтролировать.ЦветФона = ЦветаКнопок.ЦветАктивности;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсОперУправление(Команда)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("http://1c.ru/rus/partners/training/uc1/course.jsp?id=286");
КонецПроцедуры

&НаКлиенте
Процедура ЭкзаменСпециалист(Команда)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("http://1c.ru/rus/partners/training/uc1/course.jsp?id=657");
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВыполненияЗадач(Команда)
	
	ОткрытьФорму("РегистрСведений.ВыполненныеЗадачиАссистентаУправления.Форма.ВыполненныеЗадачи");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЦветаКнопок()
	
	Результат = Новый Структура;
	//@skip-check new-color
	Результат.Вставить("ЦветАктивности", ЦветаПалитры.ПервыйБрендовый);
	Результат.Вставить("ЦветНеактивности", Новый Цвет());
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияПриОплате()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ИзменениеСостоянияЗаказаПриОплате");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияПриОплатеИОтгрузке()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ИзменениеСостоянияЗаказаПриОплатеИОтгрузке");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияПриОтгрузке()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ИзменениеСостоянияЗаказаПриОтгрузке");
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПриОплатеЗаказа()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяПриОплатеЗаказа");
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПриОтгрузкеЗаказа()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяПриОтгрузкеЗаказа");
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПриОтгрузкеИОплате()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяПриОтгрузкеИОплатеЗаказа");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамПоставщикам()
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовПоставщикам";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамНаПроизводство()
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовНаПроизводство";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияЗаказаПоставщикуПриОплате()
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПриОплате";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияЗаказаПоставщикуПриПоставке()
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПриПоставке";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияЗаказаПоставщикуПриОплатеИПоставке()
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПриОплатеИПоставке";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПользователяПриОплатеЗаказаПоставщику()
	
	ИдентификаторГруппы = "ОповещениеПользователюПриОплатеЗаказаПоставщику";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПользователяПриПоставкеЗаказаПоставщику()
	
	ИдентификаторГруппы = "ОповещениеПользователюПриПоставкеЗаказаПоставщику";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПользователяПриОплатеИПоставкеЗаказаПоставщику()
	
	ИдентификаторГруппы = "ОповещениеПользователюПриОплатеИПоставкеЗаказаПоставщику";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияЗаказПокупателяПоЗаказамПоставщикамНаПроизводство()
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовПоставщикамИНаПроизводство";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеЗаказуПокупателяПоЗаказамПоставщикам()
	
	ИдентификаторГруппы = "ОповещениеЗаказуПокупателяПоСостояниюЗаказовПоставщикам";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеЗаказуПокупателяПоЗаказамНаПроизводство()
	
	ИдентификаторГруппы = "ОповещениеЗаказуПокупателяПоСостояниюЗаказовНаПроизводство";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеЗаказуПокупателяПоЗаказамПоставщикамИНаПроизводство()
	
	ИдентификаторГруппы = "ОповещениеЗаказуПокупателяПоСостояниюЗаказовПоставщикамИНаПроизводство";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияЗаказПоставщикуПоЗаказамПокупателей()
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПоСостояниюЗаказовПокупателей";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеЗаказуПоставщикуПоЗаказамПокупателей()
	
	ИдентификаторГруппы = "ОповещениеЗаказаПоставщикуПоСостояниюЗаказовПокупателей";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияЗаказаНаПроизводствоПриВыполнении()
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаНаПроизводствоПриВыполнении";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомНаПроизводствоПриВыполнении", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСостоянияЗаказаНаПроизводствоПоЗаказуПокупателя()
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаНаПроизводствоПоСостояниюЗаказовПокупателей";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомНаПроизводствоПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПользователяПриВыполненииЗаказаНаПроизводство()
	
	ИдентификаторГруппы = "ОповещениеПользователюПриВыполненииЗаказаНаПроизводство";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомНаПроизводствоПриВыполнении", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеЗаказуНаПроизводствоПоЗаказамПокупателей()
	
	ИдентификаторГруппы = "ОповещениеЗаказаНаПроизводствоПоСостояниюЗаказовПокупателей";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомНаПроизводствоПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеКлиентаОБонусахПриУсловиях()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеКлиентаОБонусахПриУсловиях");
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеКлиентаОБонусахПриПродаже()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеКлиентаОБонусахПриПродаже");
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеСотрудникаОбИзмененииБонусовПриПродаже()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОбИзмененииНачисленияСписанияБаллов");
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеКлиентаОбИзмененииСостоянияЗаказа()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеКлиентаОбИзмененииСостоянияЗаказа");
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеКлиентаОНачисленныхНалогах()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.РасчетИОповещениеПользователяОНачисленныхНалогах");
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеКлиентаОбОтчетности()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ФормированиеИОповещениеПользователяОНеобходимостиСдачиОтчетности");
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеКлиентаОЗаписиНаУслугу()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеКлиентаНаВсехЭтапахЗаписи");
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОбИзмененииСостоянияЗаказаПокупателя()
	
	ИдентификаторГруппы = "ОповещениеПользователяОбИзмененииСостоянияЗаказаПокупателя";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОбИзмененииСостоянияЗП", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПользователюПриИзмененииОтветственного()
	
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОбИзмененииОтветственного");
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОМинимальномУровнеОстатков()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОбОстатках");
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПользователяОбИзмененииПоказателя()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОбИзмененииПоказателя");
КонецПроцедуры

&НаКлиенте
Процедура РегулярноеОповещениеПользователяОПоказателе()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОПоказателе");
КонецПроцедуры

&НаКлиенте
Процедура РегулярноеОповещениеПользователяОРегулярномПлатеже()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОРегулярномПлатеже");
КонецПроцедуры

&НаКлиенте
Процедура РегулярноеОповещениеПользователяОСогласованииЗаявок()
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОСогласованииЗаявок");
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьАссистента()
	
	Если АссистентПодключен Тогда
		Возврат;
	КонецЕсли;

	ПодключитьАссистентаНаСервере();
	АссистентУправленияКлиент.Подключить();
	
КонецПроцедуры

&НаСервере
Процедура ПодключитьАссистентаНаСервере()
	
	Если АссистентПодключен Тогда
		Возврат;
	КонецЕсли;
	
	АссистентУправления.Подключить();
	
	АссистентПодключен = АссистентУправления.Подключен();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакиВРаботе(ИдентификаторГруппы = Неопределено)
	
	ОтборПоГруппе = Ложь;
	
	Если ИдентификаторГруппы = Неопределено Тогда
		ОтборПоГруппе = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиАссистента.Родитель КАК Родитель,
	|	ЗадачиАссистента.Используется КАК Используется
	|ПОМЕСТИТЬ ИспользуемыеГруппыЗадач
	|ИЗ
	|	Справочник.ЗадачиАссистентаУправления КАК ЗадачиАссистента
	|ГДЕ
	|	ЗадачиАссистента.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадачиАссистента.Родитель,
	|	ЗадачиАссистента.Используется
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачиАссистента.ИдентификаторГруппы КАК ИдентификаторГруппы,
	|	ИспользуемыеГруппыЗадач.Используется КАК Используется
	|ИЗ
	|	ИспользуемыеГруппыЗадач КАК ИспользуемыеГруппыЗадач
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиАссистентаУправления КАК ЗадачиАссистента
	|		ПО ИспользуемыеГруппыЗадач.Родитель = ЗадачиАссистента.Ссылка
	|ГДЕ
	|	(&ОтборПоГруппе
	|			ИЛИ ЗадачиАссистента.ИдентификаторГруппы = &ИдентификаторГруппы)";
	
	Запрос.УстановитьПараметр("ОтборПоГруппе", ОтборПоГруппе);
	Запрос.УстановитьПараметр("ИдентификаторГруппы", ИдентификаторГруппы);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ЭлементВРаботе = Элементы.Найти("ВРаботе_"+Выборка.ИдентификаторГруппы);
		
		Если ЭлементВРаботе = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ЭлементВРаботе.Видимость = Выборка.Используется;
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПриОплате" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзмениСостояниеПриОплате.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОплате85Цвет;	
			Иначе
				Элементы.КартинкаИзмениСостояниеПриОплате.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОплате85ЧБ;	
			КонецЕсли;
			Продолжить;				
		КонецЕсли;
		
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПриОтгрузке" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзменениеСостоянияОтгрузка.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОтгрузке85Цвет;	
			Иначе
				Элементы.КартинкаИзменениеСостоянияОтгрузка.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОтгрузке85ЧБ;	
			КонецЕсли;
			Продолжить;				
		КонецЕсли;
		
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПриОплатеИОтгрузке" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзменениеСостоянияОплатаИОтгрузка.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОплатеИОтгрузке85Цвет;	
			Иначе
				Элементы.КартинкаИзменениеСостоянияОплатаИОтгрузка.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОплатеИОтгрузке85ЧБ;	
			КонецЕсли;
			Продолжить;				
		КонецЕсли;
		
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовПоставщикам" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзмениСостояниеЗаказПокупателяЗаказПоставщику.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеЗакупки85Цвет;	
			Иначе
				Элементы.КартинкаИзмениСостояниеЗаказПокупателяЗаказПоставщику.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеЗакупки85ЧБ;	
			КонецЕсли;
			Продолжить;				
		КонецЕсли;
		
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовНаПроизводство" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзмениСостояниеЗаказПокупателяЗаказНаПроизводство.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПроизводство85Цвет;	
			Иначе
				Элементы.КартинкаИзмениСостояниеЗаказПокупателяЗаказНаПроизводство.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПроизводство85ЧБ;	
			КонецЕсли; 
			Продолжить;				
		КонецЕсли;
		
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовПоставщикамИНаПроизводство" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзмениСостояниеЗаказПокупателяЗаказПоставщикуИНаПроизводство.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПроизводствоИЗакупки85Цвет;	
			Иначе
				Элементы.КартинкаИзмениСостояниеЗаказПокупателяЗаказПоставщикуИНаПроизводство.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПроизводствоИЗакупки85ЧБ;	
			КонецЕсли;
			Продолжить;				
		КонецЕсли;
		
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПриОплате" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзмениСостояниеЗаказПоставщикуПриОплате.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОплате85Цвет;	
			Иначе
				Элементы.КартинкаИзмениСостояниеЗаказПоставщикуПриОплате.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОплате85ЧБ;	
			КонецЕсли;
			Продолжить;				
		КонецЕсли;                
		            
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПриПоставке" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзменениеСостоянияПоставка.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОтгрузке85Цвет;	
			Иначе
				Элементы.КартинкаИзменениеСостоянияПоставка.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОтгрузке85ЧБ;	
			КонецЕсли;
			Продолжить;				
		КонецЕсли;
		
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПриОплатеИПоставке" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзменениеСостоянияОплатаИПоставка.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОплатеИОтгрузке85Цвет;	
			Иначе
				Элементы.КартинкаИзменениеСостоянияОплатаИПоставка.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПриОплатеИОтгрузке85ЧБ;	
			КонецЕсли; 
			Продолжить;				
		КонецЕсли;      
		
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПоСостояниюЗаказовПокупателей" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзменениеСостоянияЗаказПоставщикуЗаказПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПродажи85Цвет;	
			Иначе
				Элементы.КартинкаИзменениеСостоянияЗаказПоставщикуЗаказПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПродажи85ЧБ;	
			КонецЕсли;
			Продолжить;	
		КонецЕсли;   
		
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаНаПроизводствоПриВыполнении" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзмениСостояниеЗаказаНаПроизводствоПриВыполнении.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПроизводство85Цвет;	
			Иначе
				Элементы.КартинкаИзмениСостояниеЗаказаНаПроизводствоПриВыполнении.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПроизводство85ЧБ;	
			КонецЕсли;
			Продолжить;						
		КонецЕсли;   
		
		Если Выборка.ИдентификаторГруппы = "ИзменениеСостоянияЗаказаНаПроизводствоПоСостояниюЗаказовПокупателей" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаИзменениеСостоянияЗаказНаПроизводствоЗаказПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПродажи85Цвет;	
			Иначе
				Элементы.КартинкаИзменениеСостоянияЗаказНаПроизводствоЗаказПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПродажи85ЧБ;	
			КонецЕсли;  
			Продолжить;						
		КонецЕсли;                
		            
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователяПриОплатеЗаказа" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеПользователяПриОплатеЗаказа.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОплатеЗаказа85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеПользователяПриОплатеЗаказа.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОплатеЗаказа85ЧБ;	
			КонецЕсли;
			Продолжить;						
		КонецЕсли; 
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователяПриОтгрузкеЗаказа" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеПользователяПриОтгрузкеЗаказа.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОтгрузкеЗаказа85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеПользователяПриОтгрузкеЗаказа.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОтгрузкеЗаказа85ЧБ;	
			КонецЕсли;
			Продолжить;						
		КонецЕсли;      
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователяПриОтгрузкеИОплатеЗаказа" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеПользователяПриОтгрузкеОплатеЗаказа.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОтгрузкеИОплате85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеПользователяПриОтгрузкеОплатеЗаказа.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОтгрузкеИОплате85ЧБ;	
			КонецЕсли;
			Продолжить;						
		КонецЕсли;  
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеЗаказуПокупателяПоСостояниюЗаказовПоставщикам" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеЗаказаПокупателяПоЗаказамПоставщикам.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеЗакупки85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеЗаказаПокупателяПоЗаказамПоставщикам.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеЗакупки85ЧБ;	
			КонецЕсли; 
			Продолжить;						
		КонецЕсли;   
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеЗаказуПокупателяПоСостояниюЗаказовНаПроизводство" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеЗаказаПокупателяПоЗаказамНаПроизводство.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПроизводство85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеЗаказаПокупателяПоЗаказамНаПроизводство.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПроизводство85ЧБ;	
			КонецЕсли;  
			Продолжить;						
		КонецЕсли;      
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеЗаказуПокупателяПоСостояниюЗаказовПоставщикамИНаПроизводство" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеЗаказаПокупателяПоЗаказамПоставщикамИНаПроизводство.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеЗакупкиИПроизводство85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеЗаказаПокупателяПоЗаказамПоставщикамИНаПроизводство.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеЗакупкиИПроизводство85ЧБ;	
			КонецЕсли;
			Продолжить;			
		КонецЕсли;  
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователяОбИзмененииСостоянияЗаказаПокупателя" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеПользователяИзменениеСостоянияЗаказаПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОбИзмененииСостояния85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеПользователяИзменениеСостоянияЗаказаПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОбИзмененииСостояния85ЧБ;	
			КонецЕсли;
			Продолжить;						
		КонецЕсли;  
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователяОбИзмененииОтветственногоЗаказПокупателя" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеПользователяИзменениеОтветственногоЗаказПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОбИзмененииОтветственного85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеПользователяИзменениеОтветственногоЗаказПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОбИзмененииОтветственного85ЧБ;	
			КонецЕсли; 
			Продолжить;			
		КонецЕсли; 
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователюПриОплатеЗаказаПоставщику" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеПользователяПриОплатеЗаказаПоставщику.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОплатеЗаказа85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеПользователяПриОплатеЗаказаПоставщику.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОплатеЗаказа85ЧБ;	
			КонецЕсли;  
			Продолжить;			
		КонецЕсли;     
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователюПриПоставкеЗаказаПоставщику" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеПользователяПриПоставкеЗаказаПоставщику.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОтгрузкеЗаказа85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеПользователяПриПоставкеЗаказаПоставщику.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОтгрузкеЗаказа85ЧБ;	
			КонецЕсли; 
			Продолжить;			
		КонецЕсли;                
		            
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователюПриОплатеИПоставкеЗаказаПоставщику" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеПользователяПриОплатеИПоставкеЗаказа.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОтгрузкеИОплате85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеПользователяПриОплатеИПоставкеЗаказа.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОтгрузкеИОплате85ЧБ;	
			КонецЕсли;  
			Продолжить;			
		КонецЕсли; 
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеЗаказаПоставщикуПоСостояниюЗаказовПокупателей" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеЗаказаПоставщикуПоЗаказуПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПродажи85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеЗаказаПоставщикуПоЗаказуПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПродажи85ЧБ;	
			КонецЕсли;
			Продолжить;			
		КонецЕсли;  
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователюПриВыполненииЗаказаНаПроизводство" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеПользователяПриВыполненииЗаказаНаПроизводство.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПроизводство85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеПользователяПриВыполненииЗаказаНаПроизводство.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПроизводство85ЧБ;	
			КонецЕсли;
			Продолжить;			
		КонецЕсли;  
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеЗаказаНаПроизводствоПоСостояниюЗаказовПокупателей" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеЗаказаНаПроизводствоПоЗаказуПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПродажи85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеЗаказаНаПроизводствоПоЗаказуПокупателя.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПродажи85ЧБ;	
			КонецЕсли;   
			Продолжить;			
		КонецЕсли;  
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователяОбИзмененииБонусовПриПродаже" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповестиПользователяОбИзмененииБонусовПриПродаже.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОБонусахПриПродаже85Цвет;	
			Иначе
				Элементы.КартинкаОповестиПользователяОбИзмененииБонусовПриПродаже.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОБонусахПриПродаже85ЧБ;	
			КонецЕсли;
			Продолжить;			
		КонецЕсли;  
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователяОбИзмененииБонусовПриПродаже" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповестиПользователяОбИзмененииБонусовПриПродаже.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОБонусахПриПродаже85Цвет;	
			Иначе
				Элементы.КартинкаОповестиПользователяОбИзмененииБонусовПриПродаже.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОБонусахПриПродаже85ЧБ;	
			КонецЕсли;
			Продолжить;			
		КонецЕсли; 
		
		Если Выборка.ИдентификаторГруппы = "РасчетИОповещениеПользователяОНачисленныхНалогах" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповестиКлиентаОНачисленииНалога.Картинка = БиблиотекаКартинок.АссистентУправленияРассчитайНалоги85Цвет;	
			Иначе
				Элементы.КартинкаОповестиКлиентаОНачисленииНалога.Картинка = БиблиотекаКартинок.АссистентУправленияРассчитайНалоги85ЧБ;	
			КонецЕсли; 
			Продолжить;
		КонецЕсли;  
		
		Если Выборка.ИдентификаторГруппы = "ФормированиеИОповещениеПользователяОНеобходимостиСдачиОтчетности" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеКлиентаОбОтчетности.Картинка = БиблиотекаКартинок.АссистентУправленияПодготовьОтчетность85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеКлиентаОбОтчетности.Картинка = БиблиотекаКартинок.АссистентУправленияПодготовьОтчетность85ЧБ;	
			КонецЕсли;  
			Продолжить;
		КонецЕсли;                
		         
		Если Выборка.ИдентификаторГруппы = "ОповещениеКлиентаОБонусахПриПродаже" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповестиКлиентаОБонусахПриПродаже.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОБонусахПриПродаже85Цвет;	
			Иначе
				Элементы.КартинкаОповестиКлиентаОБонусахПриПродаже.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОБонусахПриПродаже85ЧБ;	
			КонецЕсли; 
			Продолжить;			
		КонецЕсли;     
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеКлиентаОБонусахПриУсловиях" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеКлиентаОБонусахПриУсловиях.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОБонусахНачисленныхАвтоматически85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеКлиентаОБонусахПриУсловиях.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеОБонусахНачисленныхАвтоматически85ЧБ;	
			КонецЕсли;  
			Продолжить;			
		КонецЕсли;    
		
		Если Выборка.ИдентификаторГруппы = "ОповещениеКлиентаОбИзмененииСостоянияЗаказа" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповестиКлиентаОбИзмененииСостоянияЗаказа.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПродажи85Цвет;	
			Иначе
				Элементы.КартинкаОповестиКлиентаОбИзмененииСостоянияЗаказа.Картинка = БиблиотекаКартинок.АссистентУправленияИзменитьСостояниеПродажи85ЧБ;	
			КонецЕсли;   
			Продолжить;
		КонецЕсли;
		Если Выборка.ИдентификаторГруппы = "ОповещениеПользователяОбИзмененииЗадачаСотрудника" Тогда
			Если Выборка.Используется = Истина Тогда    
				Элементы.КартинкаОповещениеОбИзмененииВЗадачах.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеИзменениеЗадачи85Цвет;	
			Иначе
				Элементы.КартинкаОповещениеОбИзмененииВЗадачах.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеИзменениеЗадачи85ЧБ;	
			КонецЕсли;   
			Продолжить;
		КонецЕсли;
	КонецЦикла;      
	
	Если Справочники.ЗадачиАссистентаПоНапоминаниямОЗаписи.ЕстьЗадачиВРаботе() = Истина Тогда    
		Элементы.КартинкаОповещениеКлиентаОЗаписи.Картинка = БиблиотекаКартинок.АссистентУправленияОповещениеКлиентаОЗаписиНаУслугу85Цвет;	
	Иначе
		Элементы.КартинкаОповещениеКлиентаОЗаписи.Картинка = БиблиотекаКартинок.АссистентУправленияОповещениеКлиентаОЗаписиНаУслугу85ЧБ;	
	КонецЕсли;
	
	Если Справочники.ЗадачиАссистентаПоРаботеСОстатками.ЕстьЗадачиВРаботе() = Истина Тогда    
		Элементы.КартинкаОповещениеПользователяОбОстатков.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОтгрузкеЗаказа85Цвет;	
	Иначе
		Элементы.КартинкаОповещениеПользователяОбОстатков.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеПриОтгрузкеЗаказа85ЧБ;	
	КонецЕсли;
	
	Если Справочники.ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.ЕстьЗадачиВРаботе(Ложь) = Истина Тогда    
		Элементы.КартинкаОповестиПользователяОбИзмененииПоказателя.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеИзменениеКлючевыхПоказателей85Цвет;	
	Иначе
		Элементы.КартинкаОповестиПользователяОбИзмененииПоказателя.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеИзменениеКлючевыхПоказателей85ЧБ;	
	КонецЕсли;
	
	Если Справочники.ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.ЕстьЗадачиВРаботе(Истина) = Истина Тогда    
		Элементы.КартинкаРегулярноОповещайПользователяОПоказателе.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеРегулярнаяСводкаПоКлючевымПоказателям85Цвет;	
	Иначе
		Элементы.КартинкаРегулярноОповещайПользователяОПоказателе.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеРегулярнаяСводкаПоКлючевымПоказателям85ЧБ;	
	КонецЕсли;
	
	Если Справочники.ЗадачиАссистентаПоРегулярнымПлатежам.ЕстьЗадачиВРаботе() = Истина Тогда    
		Элементы.КартинкаРегулярноОповещайПользователяОРегулярномПлатеже.Картинка = БиблиотекаКартинок.АссистентУправленияРегулярныеПлатежи85Цвет;	
	Иначе
		Элементы.КартинкаРегулярноОповещайПользователяОРегулярномПлатеже.Картинка = БиблиотекаКартинок.АссистентУправленияРегулярныеПлатежи85ЧБ;	
	КонецЕсли;
	
	Если Справочники.ЗадачиАссистентаПоСогласованиюЗаявок.ЕстьЗадачиВРаботе() = Истина Тогда    
		Элементы.КартинкаРегулярноОповещайПользователяОСогласованииЗаявок.Картинка = БиблиотекаКартинок.АссистентУправленияСогласованиеЗаявок85Цвет;
	Иначе
		Элементы.КартинкаРегулярноОповещайПользователяОСогласованииЗаявок.Картинка = БиблиотекаКартинок.АссистентУправленияСогласованиеЗаявок85ЧБ;	
	КонецЕсли;
	
	Если Справочники.ЗадачиАссистентаПоЗадачамСотрудника.ЕстьЗадачиВРаботеСтатус() = Истина Тогда    
		Элементы.КартинкаРегулярноеОповещениеОСтатусеЗадач.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеСтатистикаПоЗадачамСегодня85Цвет;	
	Иначе
		Элементы.КартинкаРегулярноеОповещениеОСтатусеЗадач.Картинка = БиблиотекаКартинок.АссистентУправленияСообщениеСтатистикаПоЗадачамСегодня85ЧБ;	
	КонецЕсли;

	Элементы.КартинкаОповестиКлиентаОНачисленииНалога.Картинка = БиблиотекаКартинок.АссистентУправленияРассчитайНалоги85ЧБ;	
	Элементы.КартинкаОповещениеКлиентаОбОтчетности.Картинка = БиблиотекаКартинок.АссистентУправленияПодготовьОтчетность85ЧБ;	
	
	УстановитьПризнакиВРаботеЗадачПоНалогам(ОтборПоГруппе, ИдентификаторГруппы);
	Элементы.ВРаботе_ОповещениеКлиентаОЗаписиНаУслугу.Видимость =
		Справочники.ЗадачиАссистентаПоНапоминаниямОЗаписи.ЕстьЗадачиВРаботе(); 
		
	Элементы.ВРаботе_ОповещениеПользователяОМинимальномУровнеОстатков.Видимость =
		Справочники.ЗадачиАссистентаПоРаботеСОстатками.ЕстьЗадачиВРаботе();
	Элементы.ВРаботе_ОповещениеПользователяОПоказателе.Видимость = 
		Справочники.ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.ЕстьЗадачиВРаботе(Истина);
	Элементы.ВРаботе_ОповещениеПользователяОбИзмененииПоказателя.Видимость = 
		Справочники.ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.ЕстьЗадачиВРаботе(Ложь);
	Элементы.ВРаботе_ОповещениеПользователяОРегулярномПлатеже.Видимость = 
		Справочники.ЗадачиАссистентаПоРегулярнымПлатежам.ЕстьЗадачиВРаботе();
	Элементы.ВРаботе_ОповещениеПользователяОСогласованииЗаявок.Видимость = 
		Справочники.ЗадачиАссистентаПоСогласованиюЗаявок.ЕстьЗадачиВРаботе();
	Элементы.ВРаботе_ОповещениеПользователяОСтатусеЗадач.Видимость = 
		Справочники.ЗадачиАссистентаПоЗадачамСотрудника.ЕстьЗадачиВРаботеСтатус();    
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакиВРаботеЗадачПоНалогам(ОтборПоГруппе, ИдентификаторГруппы) 
	
	Если (ИдентификаторГруппы <> "РасчетИОповещениеПользователяОНачисленныхНалогах"
		И ИдентификаторГруппы <> "ФормированиеИОповещениеПользователяОНеобходимостиСдачиОтчетности") И НЕ ОтборПоГруппе Тогда
		Возврат;
	КонецЕсли;
	
	ВключенныеЗадачиНалогов = Справочники.ЗадачиАссистентаПоРасчетуНалогов.ИдентификаторыВключенныхЗадач();
	
	Если ВключенныеЗадачиНалогов.Найти(ИдентификаторГруппы) = Неопределено Тогда
		
		ЭлементВРаботе = Элементы.Найти("ВРаботе_"+ИдентификаторГруппы);
		
		Если ЭлементВРаботе <> Неопределено Тогда
			ЭлементВРаботе.Видимость = Ложь;
		КонецЕсли;

	КонецЕсли;
	
	Для Каждого ИдентификаторЗадачи Из ВключенныеЗадачиНалогов Цикл 
		
		ЭлементВРаботе = Элементы.Найти("ВРаботе_"+ИдентификаторЗадачи);
		
		Если ЭлементВРаботе = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИдентификаторЗадачи = "РасчетИОповещениеПользователяОНачисленныхНалогах" Тогда
			Элементы.КартинкаОповестиКлиентаОНачисленииНалога.Картинка = БиблиотекаКартинок.АссистентУправленияРассчитайНалоги85Цвет;	
		КонецЕсли;
		Если ИдентификаторЗадачи = "ФормированиеИОповещениеПользователяОНеобходимостиСдачиОтчетности" Тогда
			Элементы.КартинкаОповещениеКлиентаОбОтчетности.Картинка = БиблиотекаКартинок.АссистентУправленияПодготовьОтчетность85Цвет;	
		КонецЕсли;
		
		ЭлементВРаботе.Видимость = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодключениеОбсуждений()
	
	Продолжение = Новый ОписаниеОповещения("ЗавершитьПодключениеОбсуждений", ЭтотОбъект);
	ОбсужденияКлиент.ПоказатьПодключение(Продолжение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПодключениеОбсуждений(Результат, ДополнительныеПараметры) Экспорт
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	// Переключаем отображаемые декорации или кнопки-гиперссылки
	МассивИменКнопок = Новый Массив;
	МассивИменКнопок.Добавить("ИзмениСостояниеПриОплате");
	МассивИменКнопок.Добавить("ИзмениСостояниеПриОтгрузке");
	МассивИменКнопок.Добавить("ИзмениСостояниеПриОплатеИОтгрузке");
	МассивИменКнопок.Добавить("ИзмениСостояниеЗаказПокупателяЗаказПоставщику");
	МассивИменКнопок.Добавить("ИзмениСостояниеЗаказПокупателяЗаказНаПроизводство");
	МассивИменКнопок.Добавить("ИзмениСостояниеЗаказПокупателяЗаказПоставщикуИНаПроизводство");
	МассивИменКнопок.Добавить("ИзмениСостояниеЗаказаПоставщикуПриОплате");
	МассивИменКнопок.Добавить("ИзмениСостояниеПриПоставке");
	МассивИменКнопок.Добавить("ИзмениСостояниеОплатаИПоставка");
	МассивИменКнопок.Добавить("ИзмениСостояниеЗаказПоставщикуЗаказПокупателя");
	МассивИменКнопок.Добавить("ИзмениСостояниеЗаказаНаПроизводствоПриВыполнении");
	МассивИменКнопок.Добавить("ИзмениСостояниеЗаказаНаПроизводствоПоЗаказуПокупателя");
	МассивИменКнопок.Добавить("СообщиПриОплатеЗаказа");
	МассивИменКнопок.Добавить("СообщиПриОтгрузкеЗаказа");
	МассивИменКнопок.Добавить("СообщиПриОплатеИОтгрузкеЗаказа");
	МассивИменКнопок.Добавить("СообщиЗаказуПокупателяПоЗаказамПоставщикам");
	МассивИменКнопок.Добавить("СообщиЗаказуПокупателяПоЗаказамНаПроизводство");
	МассивИменКнопок.Добавить("СообщиЗаказуПокупателяПоЗаказамПоставщикамИНаПроизводство");
	МассивИменКнопок.Добавить("СообщиПользователюОбИзмененииСостоянияЗаказаПокупателя");
	МассивИменКнопок.Добавить("СообщиПользователюОбИзмененииОтветственногоЗаказПокупателя");
	МассивИменКнопок.Добавить("СообщиПриОплатеЗаказаПоставщику");
	МассивИменКнопок.Добавить("СообщиПриПоставкеЗаказаПоставщику");
	МассивИменКнопок.Добавить("СообщиПриОплатеИПоставкеЗаказа");
	МассивИменКнопок.Добавить("СообщиЗаказуПоставщикуПоЗаказуПокупателя");
	МассивИменКнопок.Добавить("СообщиПриВыполненииЗаказаНаПроизводство");
	МассивИменКнопок.Добавить("СообщиЗаказуНаПроизводствоПоЗаказуПокупателя");
	МассивИменКнопок.Добавить("ОповестиПользователяОбИзмененииБонусовПриПродаже");
	МассивИменКнопок.Добавить("ОповестиКлиентаОБонусахПриПродаже");
	МассивИменКнопок.Добавить("ОповестиКлиентаОБонусахПриУсловиях");
	МассивИменКнопок.Добавить("ОповестиКлиентаОЗаписи");
	МассивИменКнопок.Добавить("ОповестиКлиентаПриИзмененииСостоянияЗаказа");
	МассивИменКнопок.Добавить("ОповестиКлиентаОНачисленииНалога");
	МассивИменКнопок.Добавить("ОповестиКлиентаОбОтчетности");
	МассивИменКнопок.Добавить("СообщиПриМинимальныхОстатках");
	МассивИменКнопок.Добавить("ОповестиПользователяОбИзмененииПоказателя");
	МассивИменКнопок.Добавить("РегулярноОповещайПользователяОПоказателе");
	МассивИменКнопок.Добавить("РегулярноОповещайПользователяОРегулярномПлатеже");
	МассивИменКнопок.Добавить("РегулярноОповещайПользователяОСогласованииЗаявок");
	МассивИменКнопок.Добавить("РегулярноОповещайПользователяОСтатусеЗадач");
	МассивИменКнопок.Добавить("ОповестиПользователяПриИзмененииПоЗадаче");  
	Это85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Для Каждого ИмяКнопки Из МассивИменКнопок Цикл
		Если Это85 = Истина Тогда
			Элементы[ИмяКнопки].Видимость = Ложь;
			Элементы["Декорация" + ИмяКнопки].Видимость = Истина;
		Иначе
			Элементы[ИмяКнопки].Видимость = Истина;
			Элементы["Декорация" + ИмяКнопки].Видимость = Ложь;
		КонецЕсли;          		
	КонецЦикла;
	
	// Даша, измени состояние заказа…
	Элементы.ИзмениСостояниеЗаказа.Видимость = ИспользоватьПодсистемуCRM ИЛИ ИспользоватьПодсистемуЗакупки ИЛИ ИспользоватьПодсистемуПроизводство;
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = ИспользоватьПодсистемуCRM ИЛИ ИспользоватьПодсистемуЗакупки ИЛИ ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияЗаказаПокупателя.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ИзменениеСостоянияЗаказаПокупателяОплатаОтгрузка.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ИзменениеСостоянияОплатаЗаказПокупателя.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ИзменениеСостоянияОтгрузка.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ИзменениеСостоянияОплатаИОтгрузка.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ИзменениеСостоянияЗаказаПокупателяСвязанныеЗаказы.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказПокупателяЗаказПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказПокупателяЗаказНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияЗаказыПокупателяЗаказПоставщикуИНаПроизводство.Видимость = ИспользоватьПодсистемуЗакупки И ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияЗаказаПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказаПоставщикуОплатаПоставка.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияОплатаЗаказПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияПоставка.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказаПоставщикуСвязанныеЗаказы.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияОплатаИПоставка.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказПоставщикуЗаказПокупателя.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказаНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияЗаказаНаПроизводствоВыполнение.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияВыполнениеЗаказНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияЗаказНаПроизводствоЗаказПокупателя.Видимость = ИспользоватьПодсистемуПроизводство;

	// Даша, оповести сотрудника...
	Элементы.ОповестиПользователя.Видимость = ИСТИНА;
	Элементы.Группа_ОповещениеПользователя.Видимость = ИСТИНА;
	Элементы.ОповещениеПользователяОСтатусеЗаказаПокупателя.Видимость = ИСТИНА;
	Элементы.ОповещениеЗаказПокупателяПриОплатеОтгрузке.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ОповещениеПользователяПриОплатеЗаказа.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ОповещениеПользователяПриОтгрузкеЗаказа.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ОповещениеПользователяПриОтгрузкеОплатеЗаказа.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ОповещениеЗаказаПокупателяСвязанныеЗаказы.Видимость = ИспользоватьПодсистемуЗакупки ИЛИ ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеЗаказаПокупателяПоЗаказамПоставщикам.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеЗаказаПокупателяПоЗаказамНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеЗаказаПокупателяПоЗаказамПоставщикамИНаПроизводство.Видимость = ИспользоватьПодсистемуЗакупки И ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеПользователяИзменениеРеквизитовЗаказаПокупателя.Видимость = ИСТИНА;
	Элементы.ОповещениеПользователяИзменениеСостоянияЗаказаПокупателя.Видимость = ИСТИНА;
	Элементы.ОповещениеПользователяИзменениеОтветственногоЗаказПокупателя.Видимость = ИСТИНА;
	Элементы.ОповещениеПользователяОСтатусеЗаказаПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеЗаказПокупателяПриОплатеИПоставке.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеПользователяПриОплатеЗаказаПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеПользователяПриПоставкеЗаказаПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеЗаказаПоставщикуСвязанныеЗаказы.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеПользователяПриОплатеИПоставкеЗаказа.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеЗаказаПоставщикуПоЗаказуПокупателя.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеПользователяОСтатусеЗаказаНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеЗаказНаПроизводствоВыполнение.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеПользователяПриВыполненииЗаказаНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеЗаказаНаПроизводствоПоЗаказуПокупателя.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеПользователяОбИзмененииБонусов.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ГруппаИзменениеНачисленияСписанияБонусов.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ОповещениеПользователяОбИзмененииБонусовПриПродаже.Видимость = ИспользоватьБонусныеПрограммы;

	// Даша, оповести клиента...
	Элементы.ОповестиКлиента.Видимость = ИспользоватьПодсистемуCRM ИЛИ ИспользоватьБонусныеПрограммы ИЛИ ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи ИЛИ ПланироватьЗагрузкуРесурсовПредприятияРаботы;
	Элементы.Группа_ОповещениеКлиента.Видимость = ИспользоватьПодсистемуCRM ИЛИ ИспользоватьБонусныеПрограммы ИЛИ ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи ИЛИ ПланироватьЗагрузкуРесурсовПредприятияРаботы;
	Элементы.ОповещениеКлиентаОБонусах.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ГруппаОповещениеКлиентаОБонусах.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ОповещениеКлиентаОБонусахПриПродаже.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ОповещениеКлиентаОБонусахПриУсловиях.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ОповещениеКлиентаОЗаписиНаУслугу.Видимость =  ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи ИЛИ ПланироватьЗагрузкуРесурсовПредприятияРаботы;
	Элементы.ГруппаОповещениеКлиентаОЗаписиНаУслугу.Видимость =  ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи ИЛИ ПланироватьЗагрузкуРесурсовПредприятияРаботы;
	Элементы.ОповещениеКлиентаОбИзмененииСостоянияЗаказа.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ГруппаОповещениеКлиентаОбИзмененииСостояния.Видимость = ИспользоватьПодсистемуCRM;

	// Даша, помоги с налогами...
	Элементы.ПомогиСНалогами.Видимость = ИспользоватьОтчетность;
	Элементы.Группа_ОповещениеОНалогах.Видимость = ИспользоватьОтчетность;
	Элементы.ГруппаОповещениеКлиентаОНалогах.Видимость = ИспользоватьОтчетность;
	Элементы.ОповещениеКлиентаОНачисленныхНалогах.Видимость = ИспользоватьОтчетность;
	Элементы.ОповещениеКлиентаОбОтчетности.Видимость = ИспользоватьОтчетность;

	// Даша, помоги контролировать...
	Элементы.ПомогиКонтролировать.Видимость = УчетПотребностиПоСкладам ИЛИ ИспользоватьАнализБизнеса ИЛИ ИспользоватьРегулярныеПлатежи ИЛИ ИспользоватьМаршрутизациюЗаявок;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = УчетПотребностиПоСкладам ИЛИ ИспользоватьАнализБизнеса ИЛИ ИспользоватьРегулярныеПлатежи ИЛИ ИспользоватьМаршрутизациюЗаявок;
	Элементы.ОповещениеПользователяОМинимальномУровнеОстатков.Видимость = УчетПотребностиПоСкладам;
	Элементы.ОповещениеМинимальномУровеньОстатков.Видимость = УчетПотребностиПоСкладам;
	Элементы.ОповещениеОСостоянииКомпании.Видимость = ИспользоватьАнализБизнеса;
	Элементы.ГруппаОповещениеОСостоянииКомпании.Видимость = ИспользоватьАнализБизнеса;
	Элементы.ОповещениеПользователяОбИзмененииПоказателяБизнеса.Видимость = ИспользоватьАнализБизнеса;
	Элементы.РегулярноеОповещениеПользователяОПоказателеБизнеса.Видимость = ИспользоватьАнализБизнеса;
	Элементы.ГруппаОповещениеОРегулярныхПлатежах.Видимость = ИспользоватьРегулярныеПлатежи;
	Элементы.РегулярноеОповещениеПользователяОРегулярномПлатеже.Видимость = ИспользоватьРегулярныеПлатежи;
	Элементы.ГруппаОповещениеОСогласованииЗаявок.Видимость = ИспользоватьМаршрутизациюЗаявок;
	Элементы.РегулярноеОповещениеПользователяОСогласованииЗаявок.Видимость = ИспользоватьМаршрутизациюЗаявок;
	Элементы.ОповещениеОЗадачах.Видимость = ИспользоватьЗадачиСотрудников;
	Элементы.ГруппаОповещениеОПросроченныхЗадачах.Видимость = ИспользоватьЗадачиСотрудников;
	Элементы.ГруппаОповещениеОбИзмененииВЗадачах.Видимость = ИспользоватьЗадачиСотрудников;

	// Рекомендации Даши
	Элементы.Группа_РекомендацииДаши.Видимость = ИспользоватьПодсистемуCRM ИЛИ ИспользоватьПодсистемуЗакупки ИЛИ ИспользоватьПодсистемуПроизводство;
	Элементы.ОплатаОтгрузкаПоЗаказуПокупателя.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа31.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа29.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа32.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа33.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа30.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ПроизводствоПоЗаказуПокупателя.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.Группа25.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.Группа26.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОтменаПроизводстваИлиПоставки.Видимость = ИспользоватьПодсистемуЗакупки ИЛИ ИспользоватьПодсистемуПроизводство;
	Элементы.Группа36.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа44.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОплатаОтгрузкаПоЗаказуПокупателяКлиент.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.Группа35.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.Группа37.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.Группа38.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.Группа39.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.Группа40.Видимость = ИспользоватьПодсистемуCRM;
   
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	РазрешеноИзменятьЗадачи = Обработки.АссистентУправления.РазрешеноИзменятьЗадачи();
	ИнформационнаяБазаПодключена = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	
	Элементы.ИмяОбсуждения.Видимость = ИнформационнаяБазаПодключена ИЛИ НЕ РазрешеноИзменятьЗадачи;
	Элементы.ПодключитьОбсуждения.Видимость = НЕ ИнформационнаяБазаПодключена И РазрешеноИзменятьЗадачи;
	
	ЕстьОшибкиПодключения = ЕстьОшибкиПодключения();
	ЕстьОшибкиСозданияОбсуждения = ЕстьОшибкиСозданияОбсуждения();
	
	Элементы.ПанельОшибки.Видимость = (ЕстьОшибкиПодключения ИЛИ ЕстьОшибкиСозданияОбсуждения) И РазрешеноИзменятьЗадачи;
	Элементы.ОшибкаОбсуждения.Видимость  = ЕстьОшибкиСозданияОбсуждения И НЕ ЕстьОшибкиПодключения И РазрешеноИзменятьЗадачи;
	Элементы.ОшибкаПодключения.Видимость = ЕстьОшибкиПодключения И РазрешеноИзменятьЗадачи;
	ДобавитьБаннерСообщенияОшибки(Элементы.ОшибкаПодключения.Видимость, Элементы.ОшибкаОбсуждения.Видимость);

	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = ТекущаяСтраница = "ИзмениСостояниеЗаказа";
	Элементы.Группа_ОповещениеПользователя.Видимость   = ТекущаяСтраница = "ОповестиПользователя";
	Элементы.Группа_ОповещениеКлиента.Видимость        = ТекущаяСтраница = "ОповестиКлиента";
	Элементы.Группа_РекомендацииДаши.Видимость         = ТекущаяСтраница = "РекомендацииДаши";
	Элементы.Группа_ОповещениеОНалогах.Видимость       = ТекущаяСтраница = "ПомогиСНалогами";
	Элементы.Группа_ОповещениеОБизнесе.Видимость       = ТекущаяСтраница = "ПомогиКонтролировать";

	РазмерыЭкрана = ПолучитьИнформациюЭкрановКлиента();
	
	Если РазмерыЭкрана = Неопределено ИЛИ (ТипЗнч(РазмерыЭкрана) = Тип("ФиксированныйМассив") И РазмерыЭкрана.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;
	
	ШиринаЭкрана = 1280;
	ВысотаЭкрана = 1024;
	
	Если РазмерыЭкрана[0].Ширина > ШиринаЭкрана И РазмерыЭкрана[0].Высота > ВысотаЭкрана Тогда
		Элементы.Переместить(Элементы.ОповестиКлиента, Элементы.Строка_1);
	Иначе
		Элементы.Переместить(Элементы.ОповестиКлиента, Элементы.Строка_2, Элементы.ПомогиСНалогами);
	КонецЕсли;
	
	// Для интерфейса Такси включаем фон группы-рамки 
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() <> Истина Тогда
		МассивГрупп = Новый Массив;
		МассивГрупп.Добавить("ИзменениеСостоянияОплатаЗаказПокупателя");
		МассивГрупп.Добавить("ИзменениеСостоянияОтгрузка");
		МассивГрупп.Добавить("ИзменениеСостоянияОплатаИОтгрузка");
		МассивГрупп.Добавить("ИзменениеСостоянияЗаказПокупателяЗаказПоставщику");
		МассивГрупп.Добавить("ИзменениеСостоянияЗаказПокупателяЗаказНаПроизводство");
		МассивГрупп.Добавить("ИзменениеСостоянияЗаказыПокупателяЗаказПоставщикуИНаПроизводство");
		МассивГрупп.Добавить("ИзменениеСостоянияОплатаЗаказПоставщику");
		МассивГрупп.Добавить("ИзменениеСостоянияПоставка");
		МассивГрупп.Добавить("ИзменениеСостоянияОплатаИПоставка");
		МассивГрупп.Добавить("ИзменениеСостоянияЗаказПоставщикуЗаказПокупателя");
		МассивГрупп.Добавить("ИзменениеСостоянияВыполнениеЗаказНаПроизводство");
		МассивГрупп.Добавить("ИзменениеСостоянияЗаказНаПроизводствоЗаказПокупателя");
		МассивГрупп.Добавить("ОповещениеПользователяПриОплатеЗаказа");
		МассивГрупп.Добавить("ОповещениеПользователяПриОтгрузкеЗаказа");
		МассивГрупп.Добавить("ОповещениеПользователяПриОтгрузкеОплатеЗаказа");    
		МассивГрупп.Добавить("ОповещениеПользователяПриОплатеИПоставкеЗаказа");    
		МассивГрупп.Добавить("ОповещениеЗаказаПокупателяПоЗаказамПоставщикам");
		МассивГрупп.Добавить("ОповещениеЗаказаПокупателяПоЗаказамНаПроизводство");
		МассивГрупп.Добавить("ОповещениеЗаказаПокупателяПоЗаказамПоставщикамИНаПроизводство");
		МассивГрупп.Добавить("ОповещениеПользователяИзменениеСостоянияЗаказаПокупателя");
		МассивГрупп.Добавить("ОповещениеПользователяИзменениеОтветственногоЗаказПокупателя");
		МассивГрупп.Добавить("ОповещениеПользователяПриОплатеЗаказаПоставщику");
		МассивГрупп.Добавить("ОповещениеПользователяПриПоставкеЗаказаПоставщику");
		МассивГрупп.Добавить("ОповещениеЗаказаПоставщикуПоЗаказуПокупателя");
		МассивГрупп.Добавить("ОповещениеПользователяПриВыполненииЗаказаНаПроизводство");
		МассивГрупп.Добавить("ОповещениеЗаказаНаПроизводствоПоЗаказуПокупателя");
		МассивГрупп.Добавить("ОповещениеПользователяОбИзмененииБонусовПриПродаже");
		МассивГрупп.Добавить("ОповещениеКлиентаОБонусахПриПродаже");
		МассивГрупп.Добавить("ОповещениеКлиентаОБонусахПриУсловиях");
		МассивГрупп.Добавить("ОповещениеКлиентаОЗаписи");
		МассивГрупп.Добавить("ОповещениеКлиентаОбИзмененииСостоянияЗаказаПокупателя");
		МассивГрупп.Добавить("ОповещениеКлиентаОНачисленныхНалогах");
		МассивГрупп.Добавить("ОповещениеКлиентаОбОтчетности");
		МассивГрупп.Добавить("ОповещениеМинимальномУровеньОстатков");
		МассивГрупп.Добавить("ОповещениеПользователяОбИзмененииПоказателяБизнеса");
		МассивГрупп.Добавить("РегулярноеОповещениеПользователяОПоказателеБизнеса");
		МассивГрупп.Добавить("РегулярноеОповещениеПользователяОРегулярномПлатеже");
		МассивГрупп.Добавить("РегулярноеОповещениеПользователяОСогласованииЗаявок");
		МассивГрупп.Добавить("РегулярноеОповещениеОСтатусеЗадач");
		МассивГрупп.Добавить("ГруппаОповещениеОбИзмененииВЗадачахКоманда");
		Для Каждого ГруппаОбертка Из МассивГрупп Цикл
			Если Элементы.Найти(ГруппаОбертка) <> Неопределено Тогда
				Элементы[ГруппаОбертка].ЦветФона = ЦветаПалитры.Серый;
			КонецЕсли;
		КонецЦикла;
	Иначе
		МассивГрупп = Новый Массив;
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияОплатаЗаказПокупателя");
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияОтгрузка");
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияОплатаИОтгрузка");
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияЗаказПокупателяЗаказПоставщикам");
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияЗаказПокупателяЗаказНаПроизводство");
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияЗаказПокупателяЗаказПоставщикуИНаПроизводство");
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияОплатаЗаказПоставщику");
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияПоставка");
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияОплатаИПоставка");
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияЗаказПоставщикуЗаказПокупателя");
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияВыполнениеЗаказНаПроизводство");
		МассивГрупп.Добавить("ГруппаИзменениеСостоянияЗаказНаПроизводствоЗаказПокупателя");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяПриОплатеЗаказа");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяПриОтгрузкеЗаказа");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяПриОтгрузкеОплатеЗаказа");
		МассивГрупп.Добавить("ГруппаОповещениеЗаказаПокупателяПоЗаказамПоставщикам");
		МассивГрупп.Добавить("ГруппаОповещениеЗаказаПокупателяПоЗаказамНаПроизводство");
		МассивГрупп.Добавить("ГруппаОповещениеЗаказаПокупателяПоЗаказамПоставщикамИНаПроизводство");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяИзменениеСостоянияЗаказаПокупателя");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяИзменениеОтветственногоЗаказаПокупателя");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяПриОплатеЗаказаПоставщику");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяПриПоставкеЗаказаПоставщику");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяПриОплатеИПоставкеЗаказа");
		МассивГрупп.Добавить("ГруппаОповещениеЗаказаПоставщикуПоЗаказуПокупателя");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяПриВыполненииЗаказаНаПроизводство");
		МассивГрупп.Добавить("ГруппаОповещениеЗаказаНаПроизводствоПоЗаказуПокупателя");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяОбИзмененииБонусовПриПродаже");
		МассивГрупп.Добавить("ГруппаОповещениеКлиентаОБонусахПриПродаже");
		МассивГрупп.Добавить("ГруппаОповещениеКлиентаОБонусахПриУсловиях");
		МассивГрупп.Добавить("ГруппаОповещениеКлиентаОЗаписи");
		МассивГрупп.Добавить("ГруппаОповещениеКлиентаОбИзмененииСостоянияЗаказаПокупателя");
		МассивГрупп.Добавить("ГруппаОповещениеКлиентаОНачисленииНалога");
		МассивГрупп.Добавить("ГруппаОповещениеКлиентаОбОтчетности");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяОМинимальномУровнеОстатков");
		МассивГрупп.Добавить("ГруппаОповещениеПользователяОбИзмененииПоказателяБизнеса");
		МассивГрупп.Добавить("ГруппаРегулярноеОповещениеПользователяОПоказателеБизнеса");
		МассивГрупп.Добавить("ГруппаРегулярноеОповещениеПользователяОРегулярномПлатеже");
		МассивГрупп.Добавить("ГруппаРегулярноеОповещениеПользователяОСогласованииЗаявок");
		МассивГрупп.Добавить("ГруппаРегулярноеОповещениеОСтатусеЗадач");
		МассивГрупп.Добавить("ОповещениеОбИзмененииОтветственногоВЗадачах");
		Для Каждого ГруппаОбертка Из МассивГрупп Цикл
			Если Элементы.Найти(ГруппаОбертка) <> Неопределено Тогда
				Элементы[ГруппаОбертка].ЦветФона = Новый Цвет;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОбсуждение()
	
	Если АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АссистентУправления.СоздатьОбсуждениеЖурналРаботыАссистента();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗадачи(ИмяФормы, ИдентификаторГруппы = "")
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗадачи",ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторГруппы", ИдентификаторГруппы);
	ОткрытьФорму(ИмяФормы, ПараметрыФормы ,,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗадачи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьЗакрытиеФормыЗадачиСервер(Результат);
	
	Если НЕ ИнформационнаяБазаПодключена Тогда
		Возврат;
	КонецЕсли;
	
	Если АссистентПодключен Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьАссистента();
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьЗакрытиеФормыЗадачиСервер(Результат)
	
	ИнформационнаяБазаПодключена = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ИзмененПризнакВРаботе Тогда
		УстановитьПризнакиВРаботе(Результат.ГруппаЗадач);
		ОпределитьИспользованиеЗадачАссистентаУправления();
	КонецЕсли;
	
	Если НЕ ИнформационнаяБазаПодключена Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ АссистентПодключен Тогда
		Возврат;
	КонецЕсли;
	
	ОбсуждениеСоздано = АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено;
	
	Если НЕ ОбсуждениеСоздано Тогда
		Попытка
			СоздатьОбсуждение();
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ассистент управления'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Обработки.АссистентУправления, ,
			ТекстОшибки);
		КонецПопытки;
	КонецЕсли;
	
	УправлениеФормой();
	
	Если ЗначениеЗаполнено(Результат.АвторИзменений) И Результат.НужноДобавитьВОбсуждение Тогда
		Попытка
			АссистентУправления.ОбновитьУчастниковЖурналРаботыАссистента(Результат.АвторИзменений);
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ассистент управления'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Обработки.АссистентУправления, ,
			ТекстОшибки);
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЕстьОшибкиПодключения()
	
	Возврат НЕ АссистентУправления.Подключен() И ПолучитьФункциональнуюОпцию("ИспользованиеЗадачАссистентаУправления");
	
КонецФункции

&НаСервере
Функция ЕстьОшибкиСозданияОбсуждения()
	
	ОбсуждениеСоздано = АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено;
	
	Возврат НЕ ОбсуждениеСоздано И ПолучитьФункциональнуюОпцию("ИспользованиеЗадачАссистентаУправления");
	
КонецФункции

&НаСервере
Процедура ОпределитьИспользованиеЗадачАссистентаУправления()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачиАссистентаУправления.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЗадачиАссистентаУправления КАК ЗадачиАссистентаУправления
	|ГДЕ
	|	НЕ ЗадачиАссистентаУправления.ПометкаУдаления
	|	И ЗадачиАссистентаУправления.Используется
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.Ссылка
	|ИЗ
	|	Справочник.ЗадачиАссистентаПоРаботеСПоказателямиБизнеса КАК ЗадачиАссистентаПоРаботеСПоказателямиБизнеса
	|ГДЕ
	|	НЕ ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.ПометкаУдаления
	|	И ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.Используется";
	
	Константы.ИспользованиеЗадачАссистентаУправления.Установить(Запрос.Выполнить().Выбрать().Количество() <> 0);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьБаннерСообщенияОшибки(ЕстьОшибкиПодключенияБазы, ЕстьОшибкиСозданияОбсуждения)
	
	ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(ЭтотОбъект, "ИБНеЗарегистрирована"); 
	
	Если ЕстьОшибкиПодключенияБазы <> Истина И ЕстьОшибкиСозданияОбсуждения <> Истина Тогда
		Возврат;
	КонецЕсли;  
	
	Сообщение = "";
	Если ЕстьОшибкиПодключенияБазы = Истина Тогда
		Сообщение = Сообщение + "Не удалось подключить ассистента. Обратитесь к администратору.";	
  	КонецЕсли;
	Если ЕстьОшибкиСозданияОбсуждения = Истина Тогда
		Сообщение = Сообщение + "Настройка завершена с ошибками";	
  	КонецЕсли;
 
	ПараметрыБаннера = ОбщегоНазначения.ПараметрыВажногоСообщения();      
	ПараметрыБаннера.Сообщение = Сообщение;
	ПараметрыБаннера.ТипСообщения = "Предупреждение";
	ПараметрыБаннера.Скрываемый = Ложь;
	ПараметрыБаннера.КраткоеПредставление = "Ошибка подключения";
	ПараметрыБаннера.Идентификатор = "ИБНеЗарегистрирована";
	
	ПараметрыДействияМассив = Новый Массив;
	
	Если ЕстьОшибкиПодключенияБазы = Истина Тогда
		ПараметрыДействия = ОбщегоНазначения.ПараметрыДействияВажногоСообщения(); 
		ПараметрыДействия.ИмяКоманды = "ТекстОшибкиПодключениеНажатие";
		ПараметрыДействия.Обработчик = "ТекстОшибкиПодключениеНажатие";
		ПараметрыДействия.Заголовок  = "Повторить подключение";
		ПараметрыДействияМассив.Добавить(ПараметрыДействия);
 	КонецЕсли;
	
	Если ЕстьОшибкиСозданияОбсуждения = Истина Тогда
		ПараметрыДействия = ОбщегоНазначения.ПараметрыДействияВажногоСообщения(); 
		ПараметрыДействия.ИмяКоманды = "ТекстОшибкиОбсуждениеНажатие";
		ПараметрыДействия.Обработчик = "ТекстОшибкиОбсуждениеНажатие";
		ПараметрыДействия.Заголовок  = "Повторить настройку";
		ПараметрыДействияМассив.Добавить(ПараметрыДействия);
	КонецЕсли;
	
	ПараметрыБаннера.ПараметрыДействия = ПараметрыДействияМассив;
	ПараметрыБаннера.Родитель = "ПанельОшибки";   
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект,ПараметрыБаннера);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);

КонецПроцедуры

#Область БольшеВозможностей

#КонецОбласти

#КонецОбласти
