#Область ОписаниеПеременных

// Таблица клиентская (массив структур) с иерархией построения плитки для текущего типа построения.
&НаКлиенте
Перем ДанныеДляПлитки Экспорт;

// Структура с возможными вариантами типов построения плитки: 0 - по палитре, 1 - весовой товар,
// 3 - распознанный весовой товар.
&НаКлиенте
Перем ТипыПостроенияПлитки Экспорт;

// Текущий тип построения плитки.
&НаКлиенте
Перем ТипПостроенияПлитки Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЦветаФормы = ОбщегоНазначенияРМК.ЦветаФормыРМК();
	ПредставлениеВалюты = ОбщегоНазначенияРМК.ПредставлениеВалюты();
	
	Параметры.Свойство("ТекущийТорговыйОбъект", ТекущийТорговыйОбъект);
	
	Если Не ЗначениеЗаполнено(ТекущийТорговыйОбъект) Тогда
		ТекущийТорговыйОбъект = ОбщегоНазначенияРМК.ТекущийТорговыйОбъект();
	КонецЕсли;
	
	Параметры.Свойство("СтруктураПлиточногоИнтерфейса", СтруктураПлиточногоИнтерфейсаПодбора);
	Если ЗначениеЗаполнено(СтруктураПлиточногоИнтерфейсаПодбора) Тогда
		ЗначенияОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураПлиточногоИнтерфейсаПодбора,
			"СкрыватьЦену,Наименование");
		СкрыватьЦену = ЗначенияОбъекта.СкрыватьЦену;
		Заголовок = ЗначенияОбъекта.Наименование;
		НаименованиеПалитры = ЗначенияОбъекта.Наименование;
	КонецЕсли;
	
	ПодготовитьПлиточныйИнтерфейсПодбора();
	ОбщегоНазначенияРМК.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнтерфейсРМКСлужебныйКлиент.ИнициализироватьТипыПостроенияПлитки(ЭтотОбъект);
	ДанныеДляПлитки = Новый Массив;
	ТипПостроенияПлитки = ТипыПостроенияПлитки.ПоПалитре;
	ИнтерфейсРМКСлужебныйКлиент.ПодготовитьДанныеДляПлитки(ЭтотОбъект);
	ЗаполнитьКнопкиПлиток();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПлиткаДомой(Команда)
	ПерейтиНаСтраницуДомой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ПлиткаНазад(Элемент, СтандартнаяОбработка)
	
	ПереключитьСтраницуПлитки(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПлиткаВперед(Элемент, СтандартнаяОбработка)
	
	ПереключитьСтраницуПлитки(1);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ПлиткаВыбор(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомерНажатой = Число(ИнтерфейсРМКСлужебныйКлиент.ПолучитьНомерНажатойПлитки(Элемент));
	ТекущийЭлемент = Элементы.ЗавершитьПодборТоваров;
	СтрокаНажатойКнопки = ДанныеКнопокПлиток.Получить(НомерНажатой);
	
	Если СтрокаНажатойКнопки.ЭтоКатегория ИЛИ СтрокаНажатойКнопки.ЭтоТекущаяКатегория
			ИЛИ СтрокаНажатойКнопки.ИмеетсяВложенность Тогда
			
		ТекущийПервыйИндексПлитки = СтрокаНажатойКнопки.ПервыйИндексПлитки;
		ТекущийВторойИндексПлитки = СтрокаНажатойКнопки.ВторойИндексПлитки;
		ЗаполнитьКнопкиПлиток();
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПлиточныйИнтерфейсПодбора()
	
	ЗагрузитьИсходныеДанные();
	Если ОпорныеДанные.Количество() > 0 Тогда
		ИнтерфейсРМКСлужебный.СформироватьЭлементыПлиток(ЭтотОбъект);
	Иначе
		Элементы.ГруппаУведомленияОПустойСтруктуре.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницуПлитки(Дельта)
	
	КоличествоПлиток = КоличествоЭлементовВРяду * КоличествоРядовНаСтранице;
	СтрокаДанных = ДанныеДляПлитки[ТекущийПервыйИндексПлитки];
	ТекущаяКатегорияРамещения = СтрокаДанных.НомерКатегорииРазмещенияЭлемента;
	Если ТекущаяКатегорияРамещения = 0 Тогда
		ТекущийПервыйИндексПлитки = ТекущийПервыйИндексПлитки + Дельта * (КоличествоПлиток - 1);
		ТекущийВторойИндексПлитки = 0;
	Иначе
		ТекущийВторойИндексПлитки = ТекущийВторойИндексПлитки + Дельта * (КоличествоПлиток - 2);
	КонецЕсли;
	ЗаполнитьКнопкиПлиток();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуДомой()
	
	ТекущийПервыйИндексПлитки = 0;
	ТекущийВторойИндексПлитки = 0;
	ЗаполнитьКнопкиПлиток();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИсходныеДанные()
	
	Если ЗначениеЗаполнено(СтруктураПлиточногоИнтерфейсаПодбора) Тогда
		
		ИнтерфейсРМКСлужебный.ЗаполнитьОпорныеДанныеПанелиПлиточногоИнтерфейса(ЭтотОбъект);
		ОбщегоНазначенияРМК.ДополнитьОпорныеДанныеПанелиДляПостроенияПлиточногоИнтерфейса(ЭтотОбъект);
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКнопкиПлиток()
	
	ИнтерфейсРМКСлужебныйКлиент.ЗаполнитьКнопкиПлиток(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти



