		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() = Ложь Тогда
		Элементы.Переместить(Элементы.ФормаВыполнитьОчередь, КоманднаяПанель);   
		Элементы.Переместить(Элементы.ФормаВыполнитьОчередьСообщений, КоманднаяПанель);   
	КонецЕсли;          
	
КонецПроцедуры

#КонецОбласти
		
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОчередь(Команда)
	
	ВыполнитьОчередьНаСервере();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОчередьСообщений(Команда)
	ВыполнитьОчередьСообщенийНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОчередьНаСервере()
	
	АссистентУправления.ВыполнитьРегулярныеЗадачиСейчас();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОчередьСообщенийНаСервере()
	
	ОбсужденияУНФ.ЗаписатьОтложенныеСообщенияВСистемуВзаимодействия();
	
КонецПроцедуры

#КонецОбласти
