#Область ОписаниеПеременных

&НаКлиенте
Перем ЗапущеноЗаданиеОбновленияСкладов;

&НаКлиенте
Перем ТекущийСклад;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если МобильныйКлиентУНФ.ФункциональностьВременноНедоступна(Отказ) Тогда
    	Возврат;
  	КонецЕсли;

    // служебный вызов для удаления устаревших записей в логе
    ОбменСВнешнимиСистемамиЛогирование.ЛогЗаписиСтарыеПоВсемУчетнымЗаписямОчиститьЧерезФоновоеЗадание();
    
	Если ЗначениеЗаполнено( Параметры.УчетнаяЗапись ) Тогда
		ЗначениеВРеквизитФормы( Параметры.УчетнаяЗапись.ПолучитьОбъект(), "Объект" );
	КонецЕсли;

	УчетнаяЗапись = Объект.Ссылка;
	
	Если Не ЗначениеЗаполнено(Объект.ВалютаУчета) Тогда
		Объект.ВалютаУчета = ИнтеграцияСМаркетплейсомOzonСервер.ВалютаРегламентированногоУчетаОрганизации( Объект.Организация );
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидМаркетплейса) Тогда
		Объект.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсWildberries;
	КонецЕсли;
	ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсWildberries;
	
	МенюСтраницПараметры = КаналыПродажКлиентСервер.МенюСтраницПараметрыНовый();
	МенюСтраницПараметры.СтрокиОтмечатьКорректноЗаполненные = Не Объект.НастройкаЗавершена;
	МенюСтраницПараметры.КнопкаНазадИспользование = Ложь;
	МенюСтраницПараметры.КнопкаВпередИспользование = Ложь;
	МенюСтраницПараметры.ВысотаВСтрокахТаблицы = 7;
	
	КаналыПродажСервер.МенюСтраницИнициализация( ЭтотОбъект, МенюСтраницПараметры );
    
    Если Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
    	ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Верх;
    	КоманднаяПанель.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
    КонецЕсли;

	БаннерыДобавитьИПоказать();
    
	РазделениеВключено = РаботаВМоделиСервиса.РазделениеВключено();
	НастроитьРасписаниеРегламентногоЗадания = НСтр("ru = 'Настроить расписание регламентного задания'");

	ФормаЭлементыОтборыУстановить(УчетнаяЗапись);
	
	НастройкиУчетнойЗаписи = Справочники.УчетныеЗаписиМаркетплейсов.НастройкиУчетнойЗаписи(УчетнаяЗапись);
	НастройкиУчетнойЗаписи.ВидыЦен.Свойство(ИнтеграцияСМаркетплейсамиКлиентСервер.ИмяВидЦеныДоСкидок(), ВидЦеныДоСкидок);
	НастройкиУчетнойЗаписи.ВидыЦен.Свойство(ИнтеграцияСМаркетплейсамиКлиентСервер.ИмяВидЦеныСоСкидкойПродавца(), ВидЦеныСУчетомСкидок);
	НастройкиУчетнойЗаписи.ВидыЦен.Свойство(ИнтеграцияСМаркетплейсамиКлиентСервер.ИмяВидЦеныКлубная(), ВидЦеныМинимальныхЦен);

	Если СостояниеНастроек.Количество() = 0 Тогда
		ДобавитьНастройкиСоздания();
	КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
    	ТекПользователь = Пользователи.ТекущийПользователь();
		ОсновнаяОрганизация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация");
		Если НЕ ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
			ОсновнаяОрганизация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
		Объект.Организация = ОсновнаяОрганизация;
	КонецЕсли;

	ШрифтыИзЭлементовСтиля = ШрифтыЭлементовСтиляПолучить();

	Элементы.НастроитьРасписаниеРегламентногоЗадания.Доступность = Объект.ИспользоватьРегламентныеЗадания;
	
	ОбновитьОтображениеНаСервере();

    ФормаКнопкиПоУмолчаниюЗаполнить();
	
	НовыйКэшированныеЗначения();
	УстановитьУсловноеОформление();
	ИнициализацияЦеныОстаткиТоваровМП();
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ВыполнитьДлительныеОперацииПолучитьОсновныеДанныеУчетнойЗаписи();
	КонецЕсли;

	НоменклатураПартнеров.Параметры.УстановитьЗначениеПараметра("УчетнаяЗапись", УчетнаяЗапись);
	ЦеныОстаткиТоваровМП.Параметры.УстановитьЗначениеПараметра("УчетнаяЗаписьМаркетплейса", УчетнаяЗапись);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьОтображениеНаКлиенте();
	
	Если Объект.НастройкаЗавершена Тогда
		КаналыПродажКлиент.МенюСтраницПерейти( ЭтотОбъект, "СтраницаТовары" );
	КонецЕсли;
	
	ЗапущеноЗаданиеОбновленияСкладов = Ложь;
	
	// Если новая настройка интеграции, то скроем видимость 
	// некоторых элементов для исключения скроллинга начальной формы
	Если НЕ Объект.НастройкаЗавершена Тогда
		Если Объект.СостояниеНастроек.Количество() > 0 Тогда
			СостояниеНастроекСтрока = Объект.СостояниеНастроек[0];
			Если СостояниеНастроекСтрока.ИмяСтраницы = "Приветствие"
			И СостояниеНастроекСтрока.Статус = 1 Тогда
				ФормаЭлементыДляНовойНастройкиИнтеграцииВидимостьУстановить( Ложь );
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
    
    Если Объект.НастройкаЗавершена Тогда
		ПодключитьОбработчикОжидания("Подключаемый_СинхронизироватьОстатки", 180, Истина);
		ПодключитьОбработчикОжидания("Подключаемый_СинхронизироватьЦены", 180, Истина);
		
		Обработчик = Новый ОписаниеОповещения("Подключаемый_ЦеныОжиданиеПолученияСтраницыДанных", ЭтотОбъект);
		УведомленияКлиента.ПодключитьОбработчик("Маркетплейсы_ЗавершениеМенеджерДлительныхОпераций", Обработчик);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Кэш.ПараметрыМенеджераДлительныхОпераций) Тогда
		НачатьВыполнениеДлительныхОперацийПродолжение(Истина, Кэш.ПараметрыМенеджераДлительныхОпераций, Неопределено);
		Кэш.ПараметрыМенеджераДлительныхОпераций = Неопределено;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокПодключений" Тогда
		УчетнаяЗапись = Объект.Ссылка;
	ИначеЕсли ИмяСобытия = "Маркетплейсы_ЗавершениеМенеджерДлительныхОпераций" Тогда
		
		Если Источник.ИдентификаторНазначения = УникальныйИдентификатор Тогда
			ОбработатьРезультатДлительныхОпераций(Параметр, Источник);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Wildberries_ОбновлениеНастроек" Тогда
		
		ПолучитьУчетныеЗаписи("ОбновленыНастройки");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	УчетнаяЗапись = Объект.Ссылка;
	
	ФормаЭлементыОтборыУстановить(ТекущийОбъект.Ссылка);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	НоменклатураПартнеров.Параметры.УстановитьЗначениеПараметра("УчетнаяЗапись", УчетнаяЗапись);
	ЦеныОстаткиТоваровМП.Параметры.УстановитьЗначениеПараметра("УчетнаяЗаписьМаркетплейса", УчетнаяЗапись);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПриЗаписиНаСервере(Знач ОписаниеУчетнойЗаписи, Знач ДанныеФормы, УзелОбмена)
	
	Если Не ЗначениеЗаполнено(ОписаниеУчетнойЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УзелОбмена) Тогда
		
		// Создадим узел для сервиса интеграции по учетной записи
		УзелОбмена = НайтиСоздатьУзелОбменаСИ(ОписаниеУчетнойЗаписи.УчетнаяЗапись, ОписаниеУчетнойЗаписи.Представление,
			Истина);
		
		// Всю иерархию групп складов сразу зафиксируем на плане обмена.
		// Элементы будем фиксировать по мере их сопоставления со складами маркетплейсов
		Склады = Новый Массив;
		ПолучитьИерархиюСкладов(Склады);
		Если Склады.Количество() > 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Склады);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьРегламентныеЗаданияПриИзменении(Элемент)
	Элементы.НастроитьРасписаниеРегламентногоЗадания.Доступность = Объект.ИспользоватьРегламентныеЗадания;
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьОстаткиПриИзменении(Элемент)
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьЦеныПриИзменении(Элемент)
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеВыгрузкиОстатковТоваровНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите учетную запись.'"), , "УчетнаяЗапись");
		Возврат;
	КонецЕсли;
	
	ОписаниеУчетнойЗаписи = Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись);
	
	Если ОписаниеУчетнойЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчетнаяЗаписьМаркетплейса", УчетнаяЗапись);
	ПараметрыФормы.Вставить("Наименование", ИнтеграцияСМаркетплейсамиСИКлиентСервер.ПредставлениеЗаданияРасчетОстатковТоваров(ВидМаркетплейса));
	ПараметрыФормы.Вставить("ИмяМетаданных", "ВыгрузкаОстатковНаМаркетплейсы");
	ПараметрыФормы.Вставить("Префикс", ИнтеграцияСМаркетплейсамиСИКлиентСервер.ПрефиксЗаданияРасчетОстатковТоваров(ВидМаркетплейса));
	ПараметрыФормы.Вставить("ОткрыватьПодОграниченнымиПравами", Истина);
	
	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.Форма.РегламентноеЗадание", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеВыгрузкиЦенТоваровНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите учетную запись.'"), , "УчетнаяЗапись");
		Возврат;
	КонецЕсли;
	
	ОписаниеУчетнойЗаписи = Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись);
	
	Если ОписаниеУчетнойЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчетнаяЗаписьМаркетплейса", УчетнаяЗапись);
	ПараметрыФормы.Вставить("Наименование", ИнтеграцияСМаркетплейсамиСИКлиентСервер.ПредставлениеЗаданияВыгрузкаЦенНаМаркетплейсы(ВидМаркетплейса));
	ПараметрыФормы.Вставить("ИмяМетаданных", "ВыгрузкаЦенНаМаркетплейсы");
	ПараметрыФормы.Вставить("Префикс", ИнтеграцияСМаркетплейсамиСИКлиентСервер.ПрефиксЗаданияВыгрузкаЦенНаМаркетплейсы(ВидМаркетплейса));
	ПараметрыФормы.Вставить("ОткрыватьПодОграниченнымиПравами", Истина);
	
	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.Форма.РегламентноеЗадание", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоКоррекцияОстатковПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Объект.АвтоКоррекцияОстатков = Ложь;
	Иначе
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоКоррекцияЦенПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Объект.АвтоКоррекцияЦен = Ложь;
	Иначе
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СостояниеВСервисеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Показать" Тогда
		ПоказатьПредупреждение( , Элементы.СостояниеВСервисе.Подсказка);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОткрытьНастройкиWildberriesНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю( НСтр("ru = 'Заполните поле ""Организация""'"),, "Организация", "Объект");
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Объект.ИдентификаторКлиента = Объект.Организация.УникальныйИдентификатор();
	Если ПустаяСтрока( Объект.Наименование ) Тогда
		Объект.Наименование = Строка(Объект.Организация) + " ( " + Строка(Объект.ИдентификаторКлиента) + " )";
	КонецЕсли;
	Если Не ЗначениеЗаполнено( Объект.ДатаСоздания ) Тогда
		Объект.ДатаСоздания = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;
	
	Записать();
	
	УчетнаяЗапись = Объект.Ссылка;
	
	ПараметрыФормы = ИнтеграцияСМаркетплейсамиСИКлиент.НовыеПараметрыФормыСервисаМаркетплейсы();
	ПараметрыФормы.ИмяФормы = "Обработка.МаркетплейсWildberries.Форма.ПодключениеКСервису";
	ПараметрыФормы.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсWildberries");
	ПараметрыФормы.РежимОткрытияОкнаФормы = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	ПараметрыФормы.Организация = Объект.Организация;
	
	ПараметрыФормы.УчетнаяЗапись = Объект.Ссылка;
	
	ДополнительныеПараметры = ИнтеграцияСМаркетплейсамиСИКлиент.НовыеДополнительныеПараметрыФормыСервисаМаркетплейсы();
	ДополнительныеПараметры.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения( "НастройкиПодключенияПослеЗакрытия", ЭтотОбъект );
	
	ИнтеграцияСМаркетплейсамиСИКлиент.ОткрытьФормуСервисаМаркетплейсы(ПараметрыФормы, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    
    СтандартнаяОбработка = Ложь;
    
	Если НавигационнаяСсылка = "seller_wildberries_ru" Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку( "https://seller.wildberries.ru/" );
	Иначе
		ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УчетнаяЗаписьПодключена = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеРегламентногоЗаданияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ВыполнитьНастройкуРасписания(ПолучитьРасписаниеРегламентногоЗадания());
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныДоСкидокПриИзменении(Элемент)
	ЗаполнитьВидыЦенВОбъектУчетнаяЗапись();
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныСУчетомСкидокПриИзменении(Элемент)
	ЗаполнитьВидыЦенВОбъектУчетнаяЗапись();
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныМинимальныхЦенПриИзменении(Элемент)
	ЗаполнитьВидыЦенВОбъектУчетнаяЗапись();
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьВозможностьНажатие(Элемент)
	
	ТекстДляПисьма = НСтр("ru = 'Опишите, каких возможностей не хватает для приложения ""Wildberries"":'");
	Тег = НСтр("ru = 'Wildberries'");
	
	УправлениеНебольшойФирмойКлиент.ПредложитьВозможностьНажатие(Тег, ТекстДляПисьма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНоменклатураПартнеров

&НаКлиенте
Процедура НоменклатураПартнеровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.НоменклатураПартнеров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
    
    УчетнаяЗапись = Объект.Ссылка;
    
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияНоменклатурыМаркетплейса", ЭтотОбъект);
	
	Если Поле.Имя = "НоменклатураПартнеровНоменклатура" Тогда
		
		ПараметрыФормы.Вставить("ВидМаркетплейса", ПредопределенноеЗначение( "Перечисление.ВидыМаркетплейсов.МаркетплейсWildberries" ));
		ПараметрыФормы.Вставить("НоменклатураПартнера", ТекущиеДанные.НоменклатураПартнера);
		ПараметрыФормы.Вставить("ОписаниеУчетнойЗаписи", Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись));
		
		ОткрытьФорму("Обработка.МаркетплейсWildberries.Форма.НоменклатураМаркетплейса", ПараметрыФормы,
			ЭтотОбъект, , , , ОписаниеОповещения, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
		
	Иначе
		
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.НоменклатураПартнера);
		ОткрытьФорму("Справочник.НоменклатураКонтрагентов.ФормаОбъекта", ПараметрыФормы,
			ЭтотОбъект, , , , ОписаниеОповещения, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкаОграниченийВыгрузкиОстатковТоваров

&НаКлиенте
Процедура НастройкаОграниченийВыгрузкиОстатковТоваровПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОграниченийВыгрузкиОстатковТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите учетную запись.'"), , "УчетнаяЗапись");
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйКарточкаНастройкиОграниченияОстаткаТоваров();
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущиеДанные);
	ПараметрыФормы.Вставить("ВидМаркетплейса", Объект.ВидМаркетплейса);
	ПараметрыФормы.Вставить("ОписаниеУчетнойЗаписи", Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись));

	ДопПараметры = Новый Структура("Добавление, Копирование, ИдентификаторСтроки", Ложь, Ложь, Элемент.ТекущаяСтрока);

	ОткрытьФорму("Обработка.МаркетплейсWildberries.Форма.ОграниченияВыгрузкиОстатков", ПараметрыФормы,
		ЭтотОбъект, , , , Новый ОписаниеОповещения("ЗавершениеРедактированияОграниченияВыгрузкиОстатков", ЭтотОбъект,
		ДопПараметры), РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаОграниченийВыгрузкиОстатковТоваровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель,
	ЭтоГруппа, Параметр)

	Отказ = Истина;
    
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите учетную запись.'"), , "УчетнаяЗапись");
		Возврат;
	КонецЕсли;

	ПараметрыФормы = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйКарточкаНастройкиОграниченияОстаткаТоваров();
	ПараметрыФормы.Вставить("ВидМаркетплейса", Объект.ВидМаркетплейса);
	ПараметрыФормы.Вставить("ОписаниеУчетнойЗаписи", Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись));

	Если Копирование Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормы, Элемент.ТекущиеДанные,,"Код, Наименование");
	КонецЕсли;

	ДопПараметры = Новый Структура("Добавление, Копирование, ИдентификаторСтроки", Истина, Копирование, Неопределено);

	ОткрытьФорму("Обработка.МаркетплейсWildberries.Форма.ОграниченияВыгрузкиОстатков", ПараметрыФормы,
		ЭтотОбъект, , , , Новый ОписаниеОповещения("ЗавершениеРедактированияОграниченияВыгрузкиОстатков", ЭтотОбъект,
		ДопПараметры), РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаОграниченийВыгрузкиОстатковТоваровПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите учетную запись.'"), , "УчетнаяЗапись");
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйКарточкаНастройкиОграниченияОстаткаТоваров();
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущиеДанные);
	ПараметрыФормы.Вставить("ВидМаркетплейса", Объект.ВидМаркетплейса);
	ПараметрыФормы.Вставить("ОписаниеУчетнойЗаписи", Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись));

	ДопПараметры = Новый Структура("Добавление, Копирование, ИдентификаторСтроки", Ложь, Ложь, Элемент.ТекущаяСтрока);

	ОткрытьФорму("Обработка.МаркетплейсWildberries.Форма.ОграниченияВыгрузкиОстатков", ПараметрыФормы,
		ЭтотОбъект, , , , Новый ОписаниеОповещения("ЗавершениеРедактированияОграниченияВыгрузкиОстатков", ЭтотОбъект,
		ДопПараметры), РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаОграниченийВыгрузкиОстатковТоваровПередУдалением(Элемент, Отказ)

	Отказ = Истина;

	Для Каждого ВыделеннаяСтрока Из Элементы.НастройкаОграниченийВыгрузкиОстатковТоваров.ПолучитьСтрокиДляОбработки() Цикл

		ТекущиеДанные = НастройкаОграниченийВыгрузкиОстатковТоваров.НайтиПоИдентификатору(ВыделеннаяСтрока);

		ТекущиеДанные.Удаление = Не ТекущиеДанные.Удаление;
		ТекущиеДанные.Изменение = Истина;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОстаткиТоваровМП

&НаКлиенте
Процедура ОстаткиТоваровМПВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено( ТекущиеДанные.НоменклатураПартнера ) Тогда
		Номенклатура = ИнтеграцияСМаркетплейсамиСИВызовСервера.НоменклутураСсылкаПолучить( ТекущиеДанные.НоменклатураПартнера );
		Если ЗначениеЗаполнено( Номенклатура ) Тогда
			ПоказатьЗначение( , Номенклатура );
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСкладыМаркетплейса

&НаКлиенте
Процедура СкладыМаркетплейсаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СкладыМаркетплейсаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СкладыМаркетплейсаПередНачаломИзменения(Элемент, Отказ)

	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		ТекущийСклад = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка");
	Иначе
		ТекущийСклад = ТекущиеДанные.Склад;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладыМаркетплейсаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если ОтменаРедактирования Тогда
		ТекущиеДанные.Склад = ТекущийСклад;
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.Склад <> ТекущийСклад Тогда
		ТекущиеДанные.Изменение = Истина;
		ТекущийСклад = ТекущиеДанные.Склад;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкладыМаркетплейсаСкладПриИзменении(Элемент)

	ТекущиеДанные = Элементы.СкладыМаркетплейса.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПроверкаПройдена = Истина;

	Если ПроверкаПройдена Тогда
		Если ЗначениеЗаполнено(ТекущийСклад) Тогда
			ИсключаемыеСклады = Кэш.ИсключаемыеСклады; // Массив
			
			ОписаниеСклада = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйКарточкаСкладаМаркетплейса();
			ОписаниеСклада.ИдентификаторСкладаСервиса = ТекущиеДанные.ИдентификаторСкладаСервиса;
			ОписаниеСклада.Склад = ТекущийСклад;
			ИсключаемыеСклады.Добавить(ОписаниеСклада);
			
		КонецЕсли;
	Иначе
		ТекущиеДанные.Склад = ТекущийСклад;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкладыМаркетплейсаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Элемент.ТекущийЭлемент = Элементы.СкладыМаркетплейсаСклад Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элементы.СкладыМаркетплейса.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ПараметрыФормы.Вставить("УчетнаяЗапись", Неопределено);
	Иначе
		ПараметрыФормы.Вставить("ОписаниеУчетнойЗаписи", Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись));
	КонецЕсли;
	ПараметрыФормы.Вставить("ИдентификаторСкладаСервиса", ТекущиеДанные.ИдентификаторСкладаСервиса);
	ПараметрыФормы.Вставить("НаименованиеСкладаМП", ТекущиеДанные.НаименованиеСкладаМП);
	ПараметрыФормы.Вставить("Склад", ТекущиеДанные.Склад);

	ПараметрыОписания = Новый Структура("ТекущаяСтрока", Элементы.СкладыМаркетплейса.ТекущаяСтрока);
	ОписаниеПриИзмененииСкладаОтдельнаяФорма = Новый ОписаниеОповещения("ЗавершениеРедактированияСоответствияСкладов",
		ЭтотОбъект, ПараметрыОписания);

	ОткрытьФорму("Обработка.МаркетплейсWildberries.Форма.СкладМаркетплейса", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеПриИзмененииСкладаОтдельнаяФорма, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);

КонецПроцедуры

&НаКлиенте
Процедура СкладыМаркетплейсаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЦеныОстаткиТоваровМП

&НаКлиенте
Процедура ЦеныОстаткиТоваровМПВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено( ТекущиеДанные.Объект1С ) Тогда
		Номенклатура = ИнтеграцияСМаркетплейсамиСИВызовСервера.НоменклутураСсылкаПолучить( ТекущиеДанные.Объект1С );
		Если ЗначениеЗаполнено( Номенклатура ) Тогда
			ПоказатьЗначение( , Номенклатура );
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЦеныОстаткиТоваровМППриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	ДополнительныеСвойства = ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
	ПолеПорядок = Новый ПолеКомпоновкиДанных("НаименованиеМП");
	Для Каждого ЭлементНастройки Из Настройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ПорядокКомпоновкиДанных") Тогда
			Для Каждого ЭлементПорядка Из ЭлементНастройки.Элементы Цикл
				Если ЭлементПорядка.Поле = ПолеПорядок И ЭлементПорядка.Использование Тогда
					Если ЭлементПорядка.ТипУпорядочивания <> ДополнительныеСвойства.НаправлениеСортировкиКД Тогда
						ДополнительныеСвойства.НаправлениеСортировкиКД = ЭлементПорядка.ТипУпорядочивания;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЦеныОстаткиТоваровМППриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	ДополнительныеСвойства = ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
	ТекущаяСтрока = Элементы.ЦеныОстаткиТоваровМП.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Запись = РегистрыСведений.СоответствияОбъектовМаркетплейсов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ТекущаяСтрока);
		
		Запись.Прочитать();
		
		ЧастиКлюча = Новый Массив;
		ЧастиКлюча.Добавить(Запись.НаименованиеОбъектаМаркетплейса);
		ЧастиКлюча.Добавить(Запись.ИдентификаторОбъектаМаркетплейса);
		
		ТекущийКлюч = СтрСоединить(ЧастиКлюча, "_");
	КонецЕсли;
	
	ПолеПорядок = Новый ПолеКомпоновкиДанных("НаименованиеМП");
	Для Каждого ЭлементНастройки Из Настройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ПорядокКомпоновкиДанных") Тогда
			Для Каждого ЭлементПорядка Из ЭлементНастройки.Элементы Цикл
				Если ЭлементПорядка.Поле = ПолеПорядок И ЭлементПорядка.Использование Тогда
					Если ЭлементПорядка.ТипУпорядочивания <> ДополнительныеСвойства.НаправлениеСортировкиКД Тогда
						ДополнительныеСвойства.НаправлениеСортировкиКД = ЭлементПорядка.ТипУпорядочивания;
						ДополнительныеСвойства.АдресаСтраницКэша.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
						
						// Сбросим кэш
						СтраницыКУдалению = Новый Массив;
						Для Каждого КэшСтраницы Из ДополнительныеСвойства.АдресаСтраницКэша Цикл
							Если КэшСтраницы.Значение.Первая Или КэшСтраницы.Значение.Последняя Тогда
								Продолжить;
							ИначеЕсли ТекущийКлюч >= КэшСтраницы.Значение.ПервыйКлюч И ТекущийКлюч <= КэшСтраницы.Значение.ПоследнийКлюч Тогда
								Продолжить;
							КонецЕсли;
							
							СтраницыКУдалению.Добавить(КэшСтраницы);
						КонецЦикла;
						
						Для Каждого УдаляемаяСтраница Из СтраницыКУдалению Цикл
							ДополнительныеСвойства.АдресаСтраницКэша.Удалить(УдаляемаяСтраница);
						КонецЦикла;
						
						ДополнительныеСвойства.ВерсияКэша = Новый УникальныйИдентификатор;
						ПоместитьВоВременноеХранилище(Новый Соответствие, ДополнительныеСвойства.АдресДействующихЗапросов);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЦеныОстаткиТоваровМППриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
		"Обработка.МаркетплейсWildberries.Форма.ВыгрузкаТоварногоКаталога.ПриПолученииДанныхНаСервере");
	
	ИнтеграцияСМаркетплейсамиСИ.ЦеныОстаткиТоваровМПЗаполнитьПоДаннымСИ(Настройки, Строки);
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, Строки.Количество() / 100);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОстаткиТоваровМПОбновить(Команда)
	ПолучитьОсновныеДанныеУчетнойЗаписи();
	Элементы.ОстаткиТоваровМП.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЦеныОстаткиТоваровМПОбновить(Команда)
	ПолучитьОсновныеДанныеУчетнойЗаписи();
	Элементы.ЦеныОстаткиТоваровМП.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОстаткиИзменения(Команда)
	ОчиститьСообщения();
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПодготовитьОстаткиТоваров());
	ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьПодготовленныеОстаткиТоваров());
	ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОстаткиТоваровМаркетплейса());
	
	НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЦеныИзменения(Команда)
	ОчиститьСообщения();
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьЦены());
	
	НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСклады(Команда)
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите учетную запись.'"), , "УчетнаяЗапись");
		Возврат;
	КонецЕсли;
	
	ТекущийСклад = Неопределено;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ЗапроситьДанныеСМаркетплейса", Истина);
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.Очередь.Добавить(ПараметрыМетода , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьСкладыМаркетплейса());
	НачатьВыполнениеДлительныхОпераций2(ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСклады(Команда)
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите учетную запись.'"), , "УчетнаяЗапись");
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.Очередь.Добавить(, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьСклады());
	НачатьВыполнениеДлительныхОпераций2(ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПартнеровПолучитьИзСервиса(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиПустойУчетнойЗаписи(), , "УчетнаяЗапись");
		Возврат;
	КонецЕсли;
	
	Партнер = Объект.Партнер;
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Укажите контрагента в настройках учетной записи.'") );
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ЗапроситьДанныеСМаркетплейса", Истина);
	ПараметрыМетода.Вставить("ТолькоНесопоставленные", Истина);
	
	ПараметрыОперации.Очередь.Добавить(ПараметрыМетода ,
		ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьНоменклатуруМаркетплейса());
	
	НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПартнеровСопоставитьДанные(Команда)
	
	ОчиститьСообщения();
	
	Ссылки = Новый Массив;
	Для Каждого СтрокаСписка Из Элементы.НоменклатураПартнеров.ПолучитьСтрокиДляОбработки() Цикл
		ДанныеСтроки = Элементы.НоменклатураПартнеров.ДанныеСтроки(СтрокаСписка);
		Ссылки.Добавить(ДанныеСтроки.НоменклатураПартнера);
	КонецЦикла;
	
	НоменклатураДляСопоставления = НоменклатураКонтрагентовПоСсылкам(Ссылки);
	
	Если Не ЗначениеЗаполнено(НоменклатураДляСопоставления) Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Сопоставление номенклатуры не требуется.'"));
		Возврат;
	КонецЕсли;
	
	// Недопущение исключения чисел длиной менее 3-х символов из алгоритма сопоставления
	Для Каждого ОписаниеНК Из НоменклатураДляСопоставления Цикл
		Если СтрДлина(ОписаниеНК.Характеристика) <= 3 И ЭтоЧисло(ОписаниеНК.Характеристика) Тогда
			ОписаниеНК.Характеристика = "р. " + ОписаниеНК.Характеристика;
		КонецЕсли;
	КонецЦикла;
	
	Настройки = Новый Структура;
	Настройки.Вставить("РежимОткрытияОкна", РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	Настройки.Вставить("ВладелецФормы", Неопределено); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьСопоставлениеНоменклатуры", ЭтотОбъект, Ссылки);
	
	СопоставлениеНоменклатурыКонтрагентовКлиент.ОткрытьСопоставлениеНоменклатуры(НоменклатураДляСопоставления, Настройки,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПартнеровВыгрузитьВСервис(Команда)
	
	ВыгрузитьСопоставлениеНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПартнеровВыгрузитьВСервисВыделенные(Команда)
	
	ВыгрузитьСопоставлениеНоменклатуры(Элементы.НоменклатураПартнеров.ПолучитьСтрокиДляОбработки());
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТоваровМПРассчитать(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПодготовитьОстаткиТоваров());
	ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьПодготовленныеОстаткиТоваров());
	ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОстаткиТоваровМаркетплейса());
	
	НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныТоваровМПРассчитать(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьЦены());
	
	НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТоваровМППолныйПересчет(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПодготовитьОстаткиТоваров());
	ПараметрыОперации.Очередь.Добавить(Новый Структура("ВсеТовары", Истина),
		ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьОстаткиТоваров());
	ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОстаткиТоваровМаркетплейса());
	
	НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьПоказатьВсе(Команда)
	
	ОчиститьСообщения();
	МаркерыСтатусов = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МаркерыСтатусовЦен();
	УстановитьОтборЦенПоДаннымСервисаИнтеграции(МаркерыСтатусов.Все, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьПоМаркеруГотовы(Команда)
	
	ОчиститьСообщения();
	МаркерыСтатусов = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МаркерыСтатусовЦен();
	УстановитьОтборЦенПоДаннымСервисаИнтеграции(МаркерыСтатусов.БезОшибок, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьПоМаркеруОшибка(Команда)
	
	ОчиститьСообщения();
	МаркерыСтатусов = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МаркерыСтатусовЦен();
	УстановитьОтборЦенПоДаннымСервисаИнтеграции(МаркерыСтатусов.Ошибка, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьНаКарантине(Команда)
	
	ОчиститьСообщения();
	МаркерыСтатусов = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МаркерыСтатусовЦен();
	УстановитьОтборЦенПоДаннымСервисаИнтеграции(МаркерыСтатусов.НаКарантине, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьПроизвольно(Команда)
	
	Если УчетнаяЗапись.Пустая() Тогда
		Возврат;
	КонецЕсли;

	ОчиститьСообщения();
	
	ПараметрыФормы = Новый Структура("АдресПараметров", ПолучитьНастройкиДляОтбораДС("ЦеныОстаткиТоваровМП"));
	
	ДополнительныеПараметры = Новый Структура("ИмяДинамическогоСписка", "ЦеныОстаткиТоваровМП");
	ПриЗавершенииОтбора = Новый ОписаниеОповещения("ПриЗавершенииНастройкиОтбораДС", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.МаркетплейсWildberries.Форма.НастройкаПроизвольныхОтборов", ПараметрыФормы, ЭтотОбъект,,,,
	ПриЗавершенииОтбора, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЦеныТоваровМППолныйПересчет(Команда)

	ОчиститьСообщения();
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Всех позиций'"));
	Кнопки.Добавить("Выделенные", НСтр("ru = 'Выделенных позиций'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Выполнить полную выгрузку цен:'"), Кнопки);
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	НоменклатураМП = Новый Массив;
	
	Если Ответ = "Выделенные" Тогда
		ЗаполнитьНоменклатураМП(НоменклатураМП, Элементы.ЦеныОстаткиТоваровМП.ПолучитьСтрокиДляОбработки());
	КонецЕсли;
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ВсяНоменклатураМП", Истина);
	ПараметрыЗапроса.Вставить("НоменклатураМП", НоменклатураМП);
	
	ПараметрыОперации.Очередь.Добавить(ПараметрыЗапроса, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьЦены());
	
	НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
	
КонецПроцедуры


&НаКлиенте
Процедура КнопкаДалее2(Команда)
	
	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю( НСтр("ru = 'Заполните поле ""Организация""'"),, "Организация", "Объект", Отказ);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю( НСтр("ru = 'Заполните поле ""Контрагент""'"),, "Партнер", "Объект", Отказ);
	КонецЕсли;
	
	Если Не УчетнаяЗаписьПодключена Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю( НСтр( "ru = 'Учетная запись не подключена. Нажмите ""Настройки подключения"".'"), , , , Отказ);
	КонецЕсли;
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Склады", 1);
	
	ОбновитьОтображениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНазад2(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",1);
	ДобавитьНастройкуНаКлиенте("Дополнительно",0);
	ОбновитьОтображениеНаКлиенте();
	
	ЭтотОбъект.МенюСтраницТекущаяСтрокаДоПереключения = 0;
	КаналыПродажКлиент.МенюСтраницПерейти( ЭтотОбъект );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее3(Команда)
	
	Отказ = Ложь;
	

	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Склады",2);
	ДобавитьНастройкуНаКлиенте("Цены",1);
	
	ОбновитьОтображениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНазад3(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",1);
	ДобавитьНастройкуНаКлиенте("Склады",0);
	
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее4(Команда)
	
	Отказ = Ложь;
	
	Если Объект.ВыгружатьЦены Тогда
		Если НЕ ЗначениеЗаполнено(ВидЦеныДоСкидок) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю( НСтр( "ru = 'Заполните поле ""Цена до скидок""'"),, "ВидЦеныДоСкидок", , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидЦеныСУчетомСкидок) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю( НСтр( "ru = 'Заполните поле ""Цена с учетом скидок""'"),, "ВидЦеныСУчетомСкидок", , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидЦеныМинимальныхЦен) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю( НСтр( "ru = 'Заполните поле ""Минимальная цена""'" ),, "ВидЦеныМинимальныхЦен", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Склады",2);
	ДобавитьНастройкуНаКлиенте("Цены",2);
	ДобавитьНастройкуНаКлиенте("Товары",1);
	
	ОбновитьОтображениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНазад4(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Склады",1);
	ДобавитьНастройкуНаКлиенте("Цены",0);
	
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее5(Команда)
	
	Отказ = Ложь;
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;

	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Склады",2);
	ДобавитьНастройкуНаКлиенте("Цены",2);
	ДобавитьНастройкуНаКлиенте("Товары",2);
	ДобавитьНастройкуНаКлиенте("Расписания",2);
	
	ОбновитьОтображениеНаКлиенте();
	
	ЗаписатьИзмененияНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНазад5(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Склады",2);
	ДобавитьНастройкуНаКлиенте("Цены",1);
	ДобавитьНастройкуНаКлиенте("Товары",0);

	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЛогОткрыть(Команда)
  	ПараметрыФормы = Новый Структура( "УчетнаяЗапись", Объект.Ссылка );
	ОткрытьФорму( "РегистрСведений.ОбменСВнешнимиСистемамиЛогирование.ФормаСписка", ПараметрыФормы );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОстаткиТоваровМаркетплейсовОткрыть(Команда)
	ОткрытьФорму( "РегистрСведений.ОстаткиТоваровМаркетплейсов.ФормаСписка" );
КонецПроцедуры

&НаКлиенте
Процедура НачатьНастройку(Команда)
	
	ФормаЭлементыДляНовойНастройкиИнтеграцииВидимостьУстановить( Истина );
	
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",1);
	Элементы.КнопкаНачатьНастройку.КнопкаПоУмолчанию = Ложь;
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЗаписатьИзмененияНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияИЗакрыть(Команда)
	ЗаписатьИзмененияНаКлиенте();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПартнеровПолучитьИзСервисаВсе(Команда)
	
	ОчиститьСообщения();
	
	УчетнаяЗапись = Объект.Ссылка;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиПустойУчетнойЗаписи(), , "УчетнаяЗапись");
		Возврат;
	КонецЕсли;
	
	Партнер = Объект.Партнер;
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Укажите партнера в настройках учетной записи.'") );
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ЗапроситьДанныеСМаркетплейса", Истина);
	ПараметрыМетода.Вставить("ТолькоНесопоставленные", Ложь);
	
	ПараметрыОперации.Очередь.Добавить(ПараметрыМетода ,
		ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьНоменклатуруМаркетплейса());
	
	НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСоставВыгрузкиТовары(Кнопка)
	
	Если Не ЗначениеЗаполнено( УзелОбмена ) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("УзелОбмена", УзелОбмена);
	
	ОткрытьФорму("Обработка.РегистрацияИзмененийДляОбменаДанными.Форма.Форма",
	ПараметрыФормы,	ЭтотОбъект,	УникальныйИдентификатор, , , , РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать );
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#Область ДлительныеОперации

#Область ИнициализацияДлительныхОпераций

&НаКлиенте
Процедура НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации)
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("ИмяФормы", "Обработка.МаркетплейсWildberries.Форма.ФормаНастройки");
	ПараметрыОбъекта.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыОбъекта.Вставить("Кэш", Новый Структура("УчетныеЗаписи", Кэш.УчетныеЗаписи));
	ПараметрыОбъекта.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыОбъекта.Вставить("ВидМаркетплейса", ВидМаркетплейса);
	
	ДополнитьНаСервере = Ложь;
	Для Каждого Операция Из ПараметрыОперации.Очередь Цикл	
		Если Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи() Тогда
			ДополнитьНаСервере = Истина;
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьПоказателиНоменклатурыМаркетплейса() Тогда
			ДополнитьНаСервере = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ИнтернетПоддержкаПодключена = Ложь;
	ПараметрыОперации.ВидМаркетплейса = ВидМаркетплейса;
	
	Если ДополнитьНаСервере Тогда
		ВыполнитьДлительныеОперации(ИнтернетПоддержкаПодключена, ПараметрыОперации, ПараметрыОбъекта);
	Иначе
		ВыполнитьДлительныеОперацииБезКонтекста(ИнтернетПоддержкаПодключена, ПараметрыОперации, ПараметрыОбъекта);
	КонецЕсли;
	
	Если ИнтернетПоддержкаПодключена Тогда
		НачатьВыполнениеДлительныхОперацийПродолжение(Истина, ПараметрыОперации, ПараметрыОбъекта);
	Иначе
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеДлительныхОперацийПродолжение", ЭтотОбъект, ПараметрыОперации);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(Оповещение, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачатьВыполнениеДлительныхОперацийПродолжение(Результат, ПараметрыОперации, ПараметрыОбъекта) Экспорт
	
	ФоновоеЗадание = ПараметрыОперации.ФоновоеЗадание;
	
	Если Результат = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Отсутствует подключение к Интернет-поддержке пользователей.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
		// Повторный вызов метода после подключения к Интернет-поддержке.
		ВыполнитьДлительныеОперации(Ложь, ПараметрыОперации, ПараметрыОбъекта);
		ФоновоеЗадание = ПараметрыОперации.ФоновоеЗадание;
	КонецЕсли;
	
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ФоновоеЗадание.Статус = "Выполняется" Тогда
		ОжидатьЗавершениеДлительныхОпераций(ПараметрыОперации);
	ИначеЕсли ФоновоеЗадание.Статус = "Выполнено" Тогда
		ОбработатьРезультатДлительныхОпераций(ФоновоеЗадание, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершениеДлительныхОпераций(ПараметрыОперации)
	
	Если Не ПараметрыОперации.ВыводитьОкноОжидания Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	ИнтеграцияСМаркетплейсамиСИКлиент.ОжидатьЗавершениеДлительныхОпераций(ЭтотОбъект, ПараметрыОперации);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДлительныеОперацииПолучитьОсновныеДанныеУчетнойЗаписи()
	
	ИмяМетодаПолучитьУчетныеЗаписи = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи();
	ВерсияКэша = ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВерсияКэша;
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОжидатьЗавершение = 0;
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	ПараметрыОперации.ВидМаркетплейса = ВидМаркетплейса;
	ПараметрыОперации.ОтменитьМодифицированность = Истина;
	ПараметрыОперации.Очередь.Добавить(?(ЗначениеЗаполнено(УчетнаяЗапись), УчетнаяЗапись, Неопределено), ИмяМетодаПолучитьУчетныеЗаписи);
	
	// Методы, зависимые от МетодПолучитьУчетныеЗаписи
	ЗависимыеПоля = Новый Соответствие;
	ЗависимыеПоля.Вставить("УчетнаяЗапись", "Ответ.УчетныеЗаписи.0.УчетнаяЗапись");
	ПараметрыМетода = Новый Структура("ЗависитОт, ЗависимыеПоля", ИмяМетодаПолучитьУчетныеЗаписи, ЗависимыеПоля);
	ПараметрыМетода.Вставить("ВерсияКэша", ВерсияКэша);
	ПараметрыМетода.Вставить("НаправлениеСортировки", "asc");
	
	ПараметрыОперации.Очередь.Добавить(ПараметрыМетода , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОстаткиТоваровМаркетплейса());
	ПараметрыОперации.Очередь.Добавить(ПараметрыМетода , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьБренды());
	ПараметрыОперации.Очередь.Добавить(ПараметрыМетода , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьКатегории());
	
	ПараметрыОперации.Очередь.Добавить( ПараметрыМетода, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьСкладыМаркетплейса());
	ПараметрыОперации.Очередь.Добавить( ПараметрыМетода, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОграниченияОстатковТоваров());
	
	ПараметрыОперации.Очередь.Добавить(ПараметрыМетода, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьПоказателиНоменклатурыМаркетплейса());
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("ИмяФормы", ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ИмяФормы);
	ПараметрыОбъекта.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыОбъекта.Вставить("Элементы", Элементы);
	ПараметрыОбъекта.Вставить("Кэш", Кэш);
	ПараметрыОбъекта.Вставить("ВидМаркетплейса", ВидМаркетплейса);
	ПараметрыОбъекта.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыОбъекта.Вставить("ЦеныОстаткиТоваровМП_КомпоновщикНастроек", ЦеныОстаткиТоваровМП.КомпоновщикНастроек);
	ПараметрыОбъекта.Вставить("ЦеныОстаткиТоваровМП_Параметры", ЦеныОстаткиТоваровМП.Параметры);

	ВыполнитьДлительныеОперации(Ложь, ПараметрыОперации, ПараметрыОбъекта);
	Кэш.ПараметрыМенеджераДлительныхОпераций = ПараметрыОперации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьУчетныеЗаписи(Действие)
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	
	Если Действие = "Выбор" Тогда
		
		ПараметрыМетода = Новый Структура("УчетнаяЗапись, ОбновлениеСостояния", УчетнаяЗапись, Истина);
		ПараметрыОперации.Очередь.Добавить(ПараметрыМетода, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи());
		
		ПараметрыОперации.Очередь.Добавить(, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОстаткиТоваровМаркетплейса());
		ПараметрыОперации.Очередь.Добавить(, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьБренды());
		ПараметрыОперации.Очередь.Добавить(, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьКатегории());
		
		ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВерсияКэша = Новый УникальныйИдентификатор;
		ПоместитьВоВременноеХранилище(Новый Соответствие, ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.АдресДействующихЗапросов);
		
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("ВерсияКэша", ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВерсияКэша);
		ПараметрыМетода.Вставить("НаправлениеСортировки", "asc");
		ПараметрыОперации.Очередь.Добавить(ПараметрыМетода , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьПоказателиНоменклатурыМаркетплейса());
		
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("ВерсияКэша", ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВерсияКэша);
		ПараметрыМетода.Вставить("НаправлениеСортировки", "desc");
		ПараметрыОперации.Очередь.Добавить(ПараметрыМетода , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьПоказателиНоменклатурыМаркетплейса());
		
	Иначе
		ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи());
	КонецЕсли;
	
	НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДлительныеОперации(ИнтернетПоддержкаПодключена, ПараметрыОперации, ПараметрыОбъекта = Неопределено)
	
	Если ПараметрыОбъекта = Неопределено Тогда

		Если Не ИнтеграцияСМаркетплейсамиСИ.ВозможенЗапускФоновогоЗадания(ЭтотОбъект, ПараметрыОперации,
			ИнтернетПоддержкаПодключена) Тогда
			Возврат;
		КонецЕсли;

		Отказ = Ложь;

		ПередВыполнениемДлительныхОпераций(ПараметрыОперации, Ложь, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;

		ЗаполнитьПараметрыДлительныхОпераций(ПараметрыОперации, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;

		ПередВыполнениемДлительныхОпераций(ПараметрыОперации, Истина, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;

		ИнтеграцияСМаркетплейсамиСИ.ВыполнитьДлительныеОперации(ЭтотОбъект, ПараметрыОперации);
	
	Иначе
		ИзменитьВерсиюКэша = Истина;
		
		ЗаполнитьПараметрыДлительныхОпераций(ПараметрыОперации, Отказ);
		
		Для Каждого Операция Из ПараметрыОперации.Очередь Цикл
			
			Если Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи() Тогда
				
			ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьПоказателиНоменклатурыМаркетплейса() Тогда
				
				Если ИзменитьВерсиюКэша Тогда
					ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВерсияКэша = Новый УникальныйИдентификатор;
					ИзменитьВерсиюКэша = Ложь;
				КонецЕсли;
				
				Операция.Значение.Вставить("ВерсияКэша", ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВерсияКэша);
				ПоместитьВоВременноеХранилище(Новый Соответствие, ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.АдресДействующихЗапросов);
				
				// Сбросим кэшированные страницы
				ДополнительныеСвойстваСКД = ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
				Для Каждого ОписаниеСтраницы Из ДополнительныеСвойстваСКД.АдресаСтраницКэша Цикл
					УдалитьИзВременногоХранилища(ОписаниеСтраницы.Значение.АдресСтраницы);
				КонецЦикла;
				ДополнительныеСвойстваСКД.АдресаСтраницКэша.Очистить();
				
				// Сбросим отбор по номенклатуре
				ПараметрНоменклатураВключение = ЦеныОстаткиТоваровМП.Параметры.Элементы.Найти("НоменклатураВключение");
				Если ПараметрНоменклатураВключение <> Неопределено И ПараметрНоменклатураВключение.Значение <> Неопределено Тогда
					ПараметрНоменклатураВключение.Значение.Очистить();
				КонецЕсли;
				
				ПараметрыОбъекта.Вставить("НастройкиСКД", ЦеныОстаткиТоваровМП.КомпоновщикНастроек.ПолучитьНастройки());
				ПараметрыОбъекта.Вставить("ЦеныОстаткиТоваровМП_КомпоновщикНастроек", ЦеныОстаткиТоваровМП.КомпоновщикНастроек);
				ПараметрыОбъекта.Вставить("ЦеныОстаткиТоваровМП_Параметры", ЦеныОстаткиТоваровМП.Параметры);
				
			КонецЕсли;
		КонецЦикла;
		
		ВыполнитьДлительныеОперацииБезКонтекста(ИнтернетПоддержкаПодключена, ПараметрыОперации, ПараметрыОбъекта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьДлительныеОперацииБезКонтекста(ИнтернетПоддержкаПодключена, ПараметрыОперации, ПараметрыОбъекта)
	
	Если Не ИнтеграцияСМаркетплейсамиСИ.ВозможенЗапускФоновогоЗадания(ПараметрыОбъекта, ПараметрыОперации,
		ИнтернетПоддержкаПодключена) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ЗаполнитьПараметрыДлительныхОперацийБезКонтекста(ПараметрыОперации, Отказ, ПараметрыОбъекта);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияСМаркетплейсамиСИ.ВыполнитьДлительныеОперации(ПараметрыОбъекта, ПараметрыОперации);
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыДлительныхОпераций

&НаСервереБезКонтекста
Процедура ЗаполнитьПараметрыДлительныхОперацийБезКонтекста(ПараметрыОперации, Отказ, ПараметрыОбъекта)
    
	Для Каждого Операция Из ПараметрыОперации.Очередь Цикл
		
		Если Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи() Тогда
			ПараметрыЗапросаПолучитьУчетныеЗаписиБезКонтекста(ПараметрыОбъекта, Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНастройкиУчетнойЗаписи() Тогда
			ПараметрыЗапросаОбновитьНастройкиУчетнойЗаписиБезКонтекста(ПараметрыОбъекта, Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьНоменклатуруМаркетплейса() Тогда
			ПараметрыЗапросаПолучитьНоменклатуруМаркетплейса(ПараметрыОбъекта, Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНоменклатуруМаркетплейса() Тогда
			//@skip-check query-in-loop - в массиве только одна такая операция
			ПараметрыЗапросаОбновитьНоменклатуруМаркетплейса(ПараметрыОбъекта, Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОстаткиТоваровМаркетплейса() Тогда
			ПараметрыЗапросаПолучитьОстаткиТоваровМаркетплейса(ПараметрыОбъекта, Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПодготовитьОстаткиТоваров() Тогда
			ПараметрыЗапросаПодготовитьОстаткиТоваров(ПараметрыОбъекта, Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьОстаткиТоваров() Тогда
			ПараметрыЗапросаВыгрузитьОстаткиТоваров(ПараметрыОбъекта, Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьПодготовленныеОстаткиТоваров() Тогда
			ПараметрыЗапросаВыгрузитьПодготовленныеОстаткиТоваров(ПараметрыОбъекта, Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьЦены() Тогда
			ПараметрыЗапросаВыгрузитьЦены(ПараметрыОбъекта, Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьПоказателиНоменклатурыМаркетплейса() Тогда
			ПараметрыЗапросаПолучитьПоказателиНоменклатурыМаркетплейса(ПараметрыОбъекта, Операция.Значение);
		ИначеЕсли  Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьБренды() Тогда
			ПараметрыЗапросаПолучитьБренды(ПараметрыОбъекта, Операция.Значение);
		ИначеЕсли  Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьКатегории() Тогда
			ПараметрыЗапросаПолучитьКатегории(ПараметрыОбъекта, Операция.Значение);
		КонецЕсли;

	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыДлительныхОпераций(ПараметрыОперации, Отказ)
	
	Для Каждого Операция Из ПараметрыОперации.Очередь Цикл
		
		Если Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи() Тогда
			ПараметрыЗапросаПолучитьУчетныеЗаписи(Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНастройкиУчетнойЗаписи() Тогда
			ПараметрыЗапросаОбновитьНастройкиУчетнойЗаписи(Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьСкладыМаркетплейса() Тогда
			ПараметрыЗапросаПолучитьСкладыМаркетплейса(Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьСкладыМаркетплейса() Тогда
			ПараметрыЗапросаОбновитьСкладыМаркетплейса(Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьСклады() Тогда
			//@skip-check query-in-loop - в массиве только одна такая операция
			ПараметрыЗапросаВыгрузитьСклады(Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОграниченияОстатковТоваров() Тогда
			ПараметрыЗапросаПолучитьОграниченияОстатковТоваров(Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьОграниченияОстатковТоваров() Тогда
			ПараметрыЗапросаВыгрузитьОграниченияОстатковТоваров(Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодУдалитьОграниченияОстатковТоваров() Тогда
			ПараметрыЗапросаУдалитьОграниченияОстатковТоваров(Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПеренестиНоменклатуруПартнера() Тогда
			ПараметрыЗапросаПеренестиНоменклатуруПартнера(Операция.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОперации.ВидМаркетплейса = ВидМаркетплейса;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаПолучитьУчетныеЗаписиБезКонтекста(ПараметрыОбъекта, Значение)
	
	ЗначениеДо = Значение;
	
	Значение = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьУчетныеЗаписи();
	Если ТипЗнч(ЗначениеДо) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Значение, ЗначениеДо);
	Иначе
		Значение.УчетнаяЗапись = ЗначениеДо;
	КонецЕсли;
	Значение.ВсеУчетныеЗаписи = Не ЗначениеЗаполнено(Значение.УчетнаяЗапись);
	Значение.ВидМаркетплейса = ПараметрыОбъекта.ВидМаркетплейса;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаОбновитьНастройкиУчетнойЗаписиБезКонтекста(ПараметрыОбъекта, ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаОбновитьНастройкиУчетнойЗаписи();
	
	ОписаниеУчетнойЗаписи = ПараметрыОбъекта.Кэш.УчетныеЗаписи.Получить(ПараметрыОбъекта.УчетнаяЗапись);
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ОписаниеУчетнойЗаписи);
	
	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
	ПараметрыЗапроса.ВидМаркетплейса = ПараметрыОбъекта.ВидМаркетплейса;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаПолучитьНоменклатуруМаркетплейса(ПараметрыОбъекта, ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьНоменклатуруМаркетплейса();
	
	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
	ПараметрыЗапроса.ВидМаркетплейса = ПараметрыОбъекта.ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = ПараметрыОбъекта.УчетнаяЗапись;
	//@skip-check reading-attribute-from-database
	ПараметрыЗапроса.Партнер = ПараметрыОбъекта.УчетнаяЗапись.Партнер;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаОбновитьНоменклатуруМаркетплейса(ПараметрыОбъекта, ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаОбновитьНоменклатуруМаркетплейса();
	
	Если ВходящиеПараметры <> Неопределено Тогда
		
		НоменклатураПартнера = Новый Массив;
		Для Каждого Запись Из ВходящиеПараметры.НоменклатураПартнера Цикл
			НоменклатураПартнера.Добавить(Запись.Объект1С);
		КонецЦикла;
		
		Если НоменклатураПартнера.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СоответствияОбъектовМаркетплейсов.ИдентификаторОбъектаМаркетплейса КАК ИдентификаторНоменклатурыСервиса,
			|	СоответствияОбъектовМаркетплейсов.Объект1С КАК НоменклатураКонтрагента
			|ИЗ
			|	РегистрСведений.СоответствияОбъектовМаркетплейсов КАК СоответствияОбъектовМаркетплейсов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
			|		ПО НоменклатураКонтрагентов.Идентификатор = СоответствияОбъектовМаркетплейсов.ИдентификаторОбъектаМаркетплейса
			|		И НоменклатураКонтрагентов.Ссылка = СоответствияОбъектовМаркетплейсов.Объект1С
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1С
			|		ПО НоменклатураКонтрагентов.Номенклатура = Номенклатура1С.Ссылка
			|ГДЕ
			|	СоответствияОбъектовМаркетплейсов.УчетнаяЗаписьМаркетплейса = &УчетнаяЗаписьМаркетплейса
			|	И СоответствияОбъектовМаркетплейсов.ВидОбъектаМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовМаркетплейсов.Товар)
			|	И СоответствияОбъектовМаркетплейсов.Объект1С В (&НоменклатураПартнера)";
			
			Запрос.УстановитьПараметр("УчетнаяЗаписьМаркетплейса", ПараметрыОбъекта.УчетнаяЗапись);
			Запрос.УстановитьПараметр("НоменклатураПартнера", НоменклатураПартнера);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Карточка = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйКарточкаНоменклатурыМаркетплейса();
				ЗаполнитьЗначенияСвойств(Карточка, Выборка);
				ПараметрыЗапроса.НоменклатураМаркетплейса.Добавить(Карточка);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗапроса.НоменклатураМаркетплейса) Тогда
		Узел = ПланыОбмена.МаркетплейсыСИ.НайтиСоздатьУзел(ПараметрыОбъекта.УчетнаяЗапись);
	
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НоменклатураКонтрагентов.Идентификатор КАК ИдентификаторНоменклатурыСервиса,
		|	НоменклатураКонтрагентов.Ссылка КАК НоменклатураКонтрагента
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов.Изменения КАК ДанныеУзла
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|		ПО НоменклатураКонтрагентов.Ссылка = ДанныеУзла.Ссылка
		|ГДЕ
		|	ДанныеУзла.Узел = &Узел
		|	И НоменклатураКонтрагентов.Ссылка ЕСТЬ НЕ NULL";
		
		Запрос.УстановитьПараметр("Узел", Узел);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Карточка = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйКарточкаНоменклатурыМаркетплейса();
			ЗаполнитьЗначенияСвойств(Карточка, Выборка);
			ПараметрыЗапроса.НоменклатураМаркетплейса.Добавить(Карточка);
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыЗапроса.ВидМаркетплейса = ПараметрыОбъекта.ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = ПараметрыОбъекта.УчетнаяЗапись;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаПолучитьОстаткиТоваровМаркетплейса(ПараметрыОбъекта, ПараметрыЗапроса)

	ВходящиеПараметры = ПараметрыЗапроса;

	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьОстаткиТоваровМаркетплейса();

	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;

	ПараметрыЗапроса.ВидМаркетплейса = ПараметрыОбъекта.ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = ПараметрыОбъекта.УчетнаяЗапись;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаПолучитьПоказателиНоменклатурыМаркетплейса(ПараметрыОбъекта, ПараметрыЗапроса)
	ИнтеграцияСМаркетплейсамиСИ.ПараметрыЗапросаПолучитьПоказателиНоменклатурыМаркетплейса(ПараметрыОбъекта, ПараметрыЗапроса);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаПодготовитьОстаткиТоваров(ПараметрыОбъекта, ПараметрыЗапроса)
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьОстаткиТоваровМаркетплейса();
	ПараметрыЗапроса.ВидМаркетплейса = ПараметрыОбъекта.ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = ПараметрыОбъекта.УчетнаяЗапись;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаВыгрузитьОстаткиТоваров(ПараметрыОбъекта, ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаВыгрузитьОстаткиТоваров();
	
	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
	ПараметрыЗапроса.ВидМаркетплейса = ПараметрыОбъекта.ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = ПараметрыОбъекта.УчетнаяЗапись;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаВыгрузитьПодготовленныеОстаткиТоваров(ПараметрыОбъекта, ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаВыгрузитьПодготовленныеОстаткиТоваров();
	
	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
	ПараметрыЗапроса.ВидМаркетплейса = ПараметрыОбъекта.ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = ПараметрыОбъекта.УчетнаяЗапись;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаВыгрузитьЦены(ПараметрыОбъекта, ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаВыгрузитьЦены();
	
	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
	ПараметрыЗапроса.ВидМаркетплейса = ПараметрыОбъекта.ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = ПараметрыОбъекта.УчетнаяЗапись;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаПолучитьБренды(ПараметрыОбъекта, ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьБренды();
	
	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
	ПараметрыЗапроса.ВидМаркетплейса = ПараметрыОбъекта.ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = ПараметрыОбъекта.УчетнаяЗапись;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаПолучитьКатегории(ПараметрыОбъекта, ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьКатегории();
	
	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
	ПараметрыЗапроса.ВидМаркетплейса = ПараметрыОбъекта.ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = ПараметрыОбъекта.УчетнаяЗапись;
	
КонецПроцедуры

#КонецОбласти

#Область РезультатыДлительныхОпераций

&НаКлиенте
Процедура ОбработатьРезультатДлительныхОпераций(Результат, ДополнительныеПараметры)
	
	Отказ = ТипЗнч(Результат) <> Тип("Структура");
	
	Если Отказ Или Результат.Статус <> "Выполнено" Тогда
	
		Если ТипЗнч( Результат ) = Тип( "Структура" ) Тогда
			Если Результат.Свойство( "ПодробноеПредставлениеОшибки" ) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю( Результат.ПодробноеПредставлениеОшибки );
			КонецЕсли;
		КонецЕсли;
		
		ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры, Отказ);
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОбработкаРезультатаНаСервере Тогда
		РезультатМенеджера = ОбработатьРезультатМенеджераДлительныхОпераций(Результат.АдресРезультата, Кэш);
	ИначеЕсли ДополнительныеПараметры.ОбработкаРезультатаНаСервереБезКонтекста Тогда
		
		Источники = Новый Структура;
		Источники.Вставить("ПоказателиНоменклатурыМП", ИсточникПоказателиНоменклатурыМП(ЭтотОбъект));
		Источники.Вставить("Бренды", ИсточникБрендыМП(ЭтотОбъект));
		Источники.Вставить("Категории", ИсточникКатегорииМП(ЭтотОбъект));
		
		// Обработка результата на сервере
		РезультатМенеджера = ОбработатьРезультатМенеджераДлительныхОперацийБезКонтекста(Результат.АдресРезультата, Источники);
		
		// Постобработка на клиенте
		ЗаполнитьЗначенияСвойств(ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства, Источники.ПоказателиНоменклатурыМП.ДополнительныеСвойства, "АдресаСтраницКэша");
		
		Если Источники.ПоказателиНоменклатурыМП.ДополнительныеСвойства.ОтобратьПоНоменклатуреСИ Тогда
			
			Если Источники.ПоказателиНоменклатурыМП.НоменклатураВключение.Количество() > 0 Тогда
				ЦеныОстаткиТоваровМП.Параметры.УстановитьЗначениеПараметра("НоменклатураВключение", Источники.ПоказателиНоменклатурыМП.НоменклатураВключение);
			Иначе
				ЦеныОстаткиТоваровМП.Параметры.УстановитьЗначениеПараметра("НоменклатураВключение", Новый СписокЗначений);
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Очередь = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатМенеджера, "Очередь", Новый СписокЗначений);
	
	Для Каждого Операция Из Очередь Цикл
		
		ИмяМетода = Операция.Представление;
		РезультатОперации = Операция.Значение;
		
		Если ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьНоменклатуруМаркетплейса() Тогда
			Если РезультатОперации Тогда
				Элементы.НоменклатураПартнеров.Обновить();
			КонецЕсли;
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНастройкиУчетнойЗаписи() Тогда
			Если РезультатОперации Тогда
				Оповестить("Wildberries_ОбновлениеНастроек");
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры, Отказ);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИсточникПоказателиНоменклатурыМП(ДанныеФормы)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДополнительныеСвойства", ДанныеФормы.ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства);
	Результат.Вставить("НоменклатураВключение", ДанныеФормы.ЦеныОстаткиТоваровМП.Параметры.Элементы.Найти("НоменклатураВключение").Значение);
	
	Порядок = ?(ДанныеФормы.ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.НаправлениеСортировкиКД
				= НаправлениеСортировкиКомпоновкиДанных.Возр, НаправлениеСортировки.Возр, НаправлениеСортировки.Убыв);
	
	Результат.Вставить("НаправлениеСортировки", Порядок);
	
	// Типизируем параметр НоменклатураВключение
	Параметр = ДанныеФормы.ЦеныОстаткиТоваровМП.Параметры.Элементы.Найти("НоменклатураВключение");
	Если Параметр <> Неопределено Тогда
		Если Параметр.Значение = Неопределено Тогда
			Параметр.Значение = Новый СписокЗначений;
		ИначеЕсли ТипЗнч(Параметр.Значение) = Тип("Строка") Тогда
			ЗначениеПараметра = Параметр.Значение;
			Параметр.Значение = Новый СписокЗначений;	// СписокЗначений Из Строка
			Если Не ПустаяСтрока(ЗначениеПараметра) Тогда
				Параметр.Значение.Добавить(ЗначениеПараметра);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИсточникБрендыМП(ДанныеФормы)
	
	Результат = Новый Структура;
	Результат.Вставить("ДополнительныеСвойства", ДанныеФормы.ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства);

	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИсточникКатегорииМП(ДанныеФормы)
	
	Результат = Новый Структура;
	Результат.Вставить("ДополнительныеСвойства", ДанныеФормы.ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИсточникОстаткиТоваровМП()
	
	Результат = Новый Структура;
	Результат.Вставить("ОстаткиТоваровМП", ОстаткиТоваровМП);
	
	Возврат Результат;
	
КонецФункции

// Обрабатывает результат менеджера длительных операций на сервере.
// 
// Параметры:
//  АдресРезультата - Строка - Адрес результата
//  Кэш - Структура - Кэш
// 
// Возвращаемое значение:
//  Структура - Результат обработки:
//   * Очередь - СписокЗначений Из Произвольный - Результаты обработки методов
&НаСервере
Функция ОбработатьРезультатМенеджераДлительныхОпераций(Знач АдресРезультата, Кэш)
	
	РезультатМенеджера = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Очередь = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатМенеджера, "Очередь", Новый СписокЗначений);
	РезультатМенеджера.Вставить("КодСостояния", 200);

	Для Каждого Операция Из Очередь Цикл
		
		ИмяМетода = Операция.Представление;
		РезультатОперации = Операция.Значение;
		РезультатОбработки = Истина;
		
		Если ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи() Тогда
		
			Кэш = ОбработатьРезультатПолучитьУчетныеЗаписи(РезультатОперации, РезультатОбработки);
			УстановитьЗаголовкиТаблицыЦенТоваров(УчетнаяЗапись, Элементы.ЦеныОстаткиТоваровМПЦена1С, Элементы.ЦеныОстаткиТоваровМПЦенаМП);
			Операция.Значение = РезультатОбработки;
			
			ОписаниеУчетнойЗаписи = Кэш.УчетныеЗаписи.Получить( УчетнаяЗапись );
			УчетнаяЗаписьПодключена = Ложь;
			Если ТипЗнч( ОписаниеУчетнойЗаписи ) = Тип( "Структура" ) Тогда
				Если ПустаяСтрока( ОписаниеУчетнойЗаписи.Ошибки ) Тогда
					УчетнаяЗаписьПодключена = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьНоменклатуруМаркетплейса() Тогда
			ОбработатьРезультатПолучитьНоменклатуруМаркетплейса(РезультатОперации, РезультатОбработки);
			Операция.Значение = РезультатОбработки;
			
			Элементы.НоменклатураПартнеров.Обновить();
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОстаткиТоваровМаркетплейса() Тогда
			ОбработатьРезультатПолучитьОстаткиТоваровМаркетплейса(РезультатОперации, ИсточникОстаткиТоваровМП(), РезультатОбработки);
			Операция.Значение = РезультатОбработки;
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьОстаткиТоваров() Тогда
			ОбработатьРезультатВыгрузитьОстаткиТоваров(РезультатОперации, РезультатОбработки);
			Операция.Значение = РезультатОбработки;
			
			Элементы.ОстаткиТоваровМП.Обновить();
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьПодготовленныеОстаткиТоваров() Тогда
			ОбработатьРезультатВыгрузитьПодготовленныеОстаткиТоваров(РезультатОперации, РезультатОбработки);
			Операция.Значение = РезультатОбработки;
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНоменклатуруМаркетплейса() Тогда
			//@skip-check query-in-loop - в массиве только одна такая операция
			ОбработатьРезультатОбновитьНоменклатуруМаркетплейса(РезультатОперации, РезультатОбработки);
			Операция.Значение = РезультатОбработки;
			
			Элементы.НоменклатураПартнеров.Обновить();
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьЦены() Тогда
			ОбработатьРезультатВыгрузитьЦены(РезультатОперации, РезультатОбработки);
			Операция.Значение = РезультатОбработки;
			
			Элементы.ЦеныОстаткиТоваровМП.Обновить();
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьПоказателиНоменклатурыМаркетплейса() Тогда
			ОбработатьРезультатПолучитьПоказателиНоменклатурыМаркетплейса(РезультатОперации, РезультатОбработки);
			Операция.Значение = РезультатОбработки;
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьБренды() Тогда
			ОбработатьРезультатПолучитьБренды(РезультатОперации, ИсточникБрендыМП(ЭтотОбъект), РезультатОбработки);
			Операция.Значение = РезультатОбработки;
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьКатегории() Тогда
			ОбработатьРезультатПолучитьКатегории(РезультатОперации, ИсточникКатегорииМП(ЭтотОбъект), РезультатОбработки);
			Операция.Значение = РезультатОбработки;
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНастройкиУчетнойЗаписи() Тогда
			//@skip-check query-in-loop
			Кэш = ОбработатьРезультатОбновитьНастройкиУчетнойЗаписи(РезультатОперации, РезультатОбработки);
			Операция.Значение = РезультатОбработки;
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьСкладыМаркетплейса() Тогда
			ОбработатьРезультатПолучитьСкладыМаркетплейса(РезультатОперации, РезультатОбработки);
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОграниченияОстатковТоваров() Тогда
			ОбработатьРезультатПолучитьОграниченияОстатковТоваров(РезультатОперации, РезультатОбработки);
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьОграниченияОстатковТоваров() Тогда
			ОбработатьРезультатВыгрузитьОграниченияОстатковТоваров(РезультатОперации, РезультатОбработки);
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодУдалитьОграниченияОстатковТоваров() Тогда
			ОбработатьРезультатУдалитьОграниченияОстатковТоваров(РезультатОперации, РезультатОбработки);
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьСкладыМаркетплейса() Тогда
			//@skip-check query-in-loop
			ОбработатьРезультатОбновитьСкладыМаркетплейса(РезультатОперации, РезультатОбработки);
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПеренестиНоменклатуруПартнера() Тогда
			ОбработатьРезультатПеренестиНоменклатуруПартнера(РезультатОперации, РезультатОбработки);
		Иначе
			Операция.Значение = Ложь;
		КонецЕсли;

		Если РезультатОперации.КодСостояния <> 200 Тогда
			РезультатМенеджера.КодСостояния = РезультатОперации.КодСостояния;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатМенеджера;
	
КонецФункции

// Обрабатывает результат менеджера длительных операций на сервере без контекста.
// 
// Параметры:
//  АдресРезультата - Строка - Адрес результата
//  Источники - Структура - данные для обработки:
//   * ПоказателиНоменклатурыМП - Структура - источник показателей номенклатуры маркетплейса
//   * БрендыМП - Структура - источник брендов маркетплейса
//   * КатегорииМП - Структура - источник категорий маркетплейса
// 
// Возвращаемое значение:
//  Структура - Результат обработки:
//   * Очередь - СписокЗначений Из Произвольный - Результаты обработки методов
&НаСервереБезКонтекста
Функция ОбработатьРезультатМенеджераДлительныхОперацийБезКонтекста(Знач АдресРезультата, Источники)
	
	РезультатМенеджера = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Очередь = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатМенеджера, "Очередь", Новый СписокЗначений);

	Для Каждого Операция Из Очередь Цикл
		
		ИмяМетода = Операция.Представление;
		РезультатОперации = Операция.Значение;
		
		Если ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьПоказателиНоменклатурыМаркетплейса() Тогда
			РезультатОбработки = Истина;
			ОбработатьРезультатПолучитьПоказателиНоменклатурыМаркетплейсаБезКонтекста(РезультатОперации, Источники.ПоказателиНоменклатурыМП, РезультатОбработки);
			Операция.Значение = РезультатОбработки;
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьБренды() Тогда
			РезультатОбработки = Истина;
			ОбработатьРезультатПолучитьБренды(РезультатОперации, Источники.Бренды, РезультатОбработки);
			Операция.Значение = РезультатОбработки;
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьКатегории() Тогда
			РезультатОбработки = Истина;
			ОбработатьРезультатПолучитьКатегории(РезультатОперации, Источники.Категории, РезультатОбработки);
			Операция.Значение = РезультатОбработки;
		Иначе
			Операция.Значение = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатМенеджера;
	
КонецФункции

&НаКлиенте
Процедура ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры, Отказ)
	
	ТолькоПросмотр = Ложь;
	
	УстановитьВидимостьДоступность();
	
	Если ДополнительныеПараметры.Свойство("ИмяКомандыОтбораПоСтатусу") Тогда
		ОбновитьКнопкуОтбораПоСтатусу(ДополнительныеПараметры.ИмяКомандыОтбораПоСтатусу);
	КонецЕсли;

	ОписаниеУчетнойЗаписи = Неопределено;
	
	Если ДополнительныеПараметры.ОтменитьМодифицированность Тогда
		Модифицированность = Ложь;
		Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
			ОписаниеУчетнойЗаписи = Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись);
			Если ОписаниеУчетнойЗаписи <> Неопределено Тогда
				ЗаполнитьФормуПоУчетнойЗаписи(ОписаниеУчетнойЗаписи);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДоступностьПоУчетнойЗаписи(ОписаниеУчетнойЗаписи);
	
	ИнтеграцияСМаркетплейсамиСИКлиент.ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

// Обработать результат получить учетные записи.
// 
// Параметры:
//  РезультатОперации - Структура - Результат операции
//  РезультатОбработки - Булево - Результат обработки
// 
// Возвращаемое значение:
//  Структура - Кэш
&НаСервере
Функция ОбработатьРезультатПолучитьУчетныеЗаписи(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации.Ответ.ОбновлениеСостояния Тогда
		Если РезультатОперации.КодСостояния = 200 И РезультатОперации.Ответ.УчетныеЗаписи.Количество() = 1 Тогда
			ОписаниеУчетнойЗаписи = РезультатОперации.Ответ.УчетныеЗаписи[0];
			Кэш.УчетныеЗаписи.Вставить(ОписаниеУчетнойЗаписи.УчетнаяЗапись, ОписаниеУчетнойЗаписи);
		Иначе
		    
		    ОшибкаПрефикс = НСтр( "ru = 'Получение учетных записей'" ) + ": ";
			Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
				ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
			КонецЦикла;
			
		КонецЕсли;
		Возврат Кэш;
	КонецЕсли;
	
	Если РезультатОперации.КодСостояния <> 200 Тогда
		Возврат Кэш;
	КонецЕсли;
	
	Кэш.УчетныеЗаписи.Очистить();
	
	Для Каждого ОписаниеУчетнойЗаписи Из РезультатОперации.Ответ.УчетныеЗаписи Цикл
		Кэш.УчетныеЗаписи.Вставить(ОписаниеУчетнойЗаписи.УчетнаяЗапись, ОписаниеУчетнойЗаписи);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОписаниеУчетнойЗаписи = Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись);
	ИначеЕсли Кэш.УчетныеЗаписи.Количество() <> 1 Тогда
		ОписаниеУчетнойЗаписи = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеУчетнойЗаписи) Тогда
		
		УчетнаяЗапись = ОписаниеУчетнойЗаписи.УчетнаяЗапись;
		НоменклатураПартнеров.Параметры.УстановитьЗначениеПараметра("УчетнаяЗапись", УчетнаяЗапись);
		ЦеныОстаткиТоваровМП.Параметры.УстановитьЗначениеПараметра("УчетнаяЗаписьМаркетплейса", УчетнаяЗапись);
		
		ОпределитьСостоянияРегламентныхЗаданий(ВидМаркетплейса, ОписаниеУчетнойЗаписи, ОстаткиТоваровМПРЗВключено);
		
		ЦеныТоваровМПРЗВключено = ОписаниеУчетнойЗаписи.РазрешенаВыгрузкаЦенНаМаркетплейс;
		
	Иначе
		
		НоменклатураПартнеров.Параметры.УстановитьЗначениеПараметра("УчетнаяЗапись", Неопределено);
		ЦеныОстаткиТоваровМП.Параметры.УстановитьЗначениеПараметра("УчетнаяЗаписьМаркетплейса", Неопределено);
		
		ОстаткиТоваровМПРЗВключено = Ложь;
		ЦеныТоваровМПРЗВключено = Ложь;
		
	КонецЕсли;
	
	Возврат Кэш;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьЗаголовкиТаблицыЦенТоваров(УчетнаяЗапись, ЦеныОстаткиТоваровМПЦена1С, ЦеныОстаткиТоваровМПЦенаМП)
	
	Валюта = "";
	
	Если УчетнаяЗапись <> Неопределено Тогда
		Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ВалютаУчета.Наименование");
	КонецЕсли;
	
	Цена1С = Новый Массив; // Массив Из Строка
	ЦенаМП = Новый Массив; // Массив Из Строка
	
	ЗаголовокЦена1С = СтрРазделить(ЦеныОстаткиТоваровМПЦена1С.Заголовок, ",", Ложь);
	Если ЗаголовокЦена1С.Количество() > 0 Тогда
		Цена1С.Добавить(ЗаголовокЦена1С.Получить(0));
	КонецЕсли;
	ЗаголовокЦенаМП = СтрРазделить(ЦеныОстаткиТоваровМПЦенаМП.Заголовок, ",", Ложь);
	Если ЗаголовокЦенаМП.Количество() > 0 Тогда
		ЦенаМП.Добавить(ЗаголовокЦенаМП.Получить(0));
	КонецЕсли;
	
	Если ТипЗнч(Валюта) = Тип("Строка") И ЗначениеЗаполнено(Валюта) Тогда
		Цена1С.Добавить(Валюта);
		ЦенаМП.Добавить(Валюта);
	КонецЕсли;
	
	ЦеныОстаткиТоваровМПЦена1С.Заголовок = СтрСоединить(Цена1С, ", ");
	ЦеныОстаткиТоваровМПЦенаМП.Заголовок = СтрСоединить(ЦенаМП, ", ");
	
КонецПроцедуры

// Обработать результат получить номенклатуру маркетплейса.
// 
// Параметры:
//  РезультатОперации - Структура - Результат операции
//  РезультатОбработки - Булево - Результат обработки
&НаСервере
Процедура ОбработатьРезультатПолучитьНоменклатуруМаркетплейса(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Получение номенклатуры маркетплейса'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Результат = РезультатОперации.Ответ;
	
	МассивСообщений = Новый Массив;
	МассивСообщений.Добавить(СтрШаблон(НСтр("ru = 'Импортировано: %1 из %2'"), Результат.Добавлено, Результат.Получено));
	Если Результат.Получено <> 0 Тогда
		МассивСообщений.Добавить(СтрШаблон(НСтр("ru = 'Обновлено: %1 из %2'"), Результат.Обновлено, Результат.Получено));
	КонецЕсли;
	ОбщегоНазначения.СообщитьПользователю(СтрСоединить(МассивСообщений, ", "));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьРезультатПолучитьОстаткиТоваровМаркетплейса(РезультатОперации, Источники, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Получение остатков товаров маркетплейса'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 Тогда
		Если РезультатОперации.Ошибки.Количество() > 0 Тогда
			Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
				ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
			КонецЦикла;
		КонецЕсли;
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Источники.ОстаткиТоваровМП.Очистить();
	
	Для Каждого ОписаниеОстатка Из РезультатОперации.ОстаткиТоваров Цикл
		НоваяСтрока = Источники.ОстаткиТоваровМП.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОстатка);
		НоваяСтрока.СкладМП = ОписаниеОстатка.НаименованиеСклада;
		НоваяСтрока.КоличествоМП = ОписаниеОстатка.КоличествоМаркетплейса;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыгрузитьПодготовленныеОстаткиТоваров(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Выгрузка подготовленных остатков товаров'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьРезультатВыгрузитьОстаткиТоваров(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Выгрузка остатков товаров'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьРезультатОбновитьНоменклатуруМаркетплейса(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Обновление номенклатуры маркетплейса'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	УзелОбмена = ПланыОбмена.МаркетплейсыСИ.НайтиСоздатьУзел(РезультатОперации.УчетнаяЗапись);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствиеНК.УчетнаяЗаписьМаркетплейса КАК УчетнаяЗаписьМаркетплейса,
	|	СоответствиеНК.ВидОбъектаМаркетплейса КАК ВидОбъектаМаркетплейса,
	|	СоответствиеНК.ИдентификаторОбъектаМаркетплейса КАК ИдентификаторОбъектаМаркетплейса,
	|	СоответствиеНК.ИдентификаторВладельцаОбъектаМаркетплейса КАК ИдентификаторВладельцаОбъектаМаркетплейса,
	|	СоответствиеНК.Объект1С КАК Объект1С
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовМаркетплейсов КАК СоответствиеНК
	|ГДЕ
	|	СоответствиеНК.УчетнаяЗаписьМаркетплейса = &УчетнаяЗаписьМаркетплейса
	|	И СоответствиеНК.ВидОбъектаМаркетплейса = &ВидОбъектаМаркетплейса
	|	И СоответствиеНК.Объект1С В(&Объект1С)";
	
	Запрос.УстановитьПараметр("УчетнаяЗаписьМаркетплейса", РезультатОперации.УчетнаяЗапись);
	Запрос.УстановитьПараметр("ВидОбъектаМаркетплейса", Перечисления.ВидыОбъектовМаркетплейсов.Товар);
	Запрос.УстановитьПараметр("Объект1С", РезультатОперации.НоменклатураКонтрагентов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.СоответствияОбъектовМаркетплейсов.СоздатьНаборЗаписей();
		Для Каждого Измерение Из Метаданные.РегистрыСведений.СоответствияОбъектовМаркетплейсов.Измерения Цикл
			НаборЗаписей.Отбор[Измерение.Имя].Установить(Выборка[Измерение.Имя]);
		КонецЦикла;

		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, НаборЗаписей);
	КонецЦикла;
	
	Если РезультатОперации.НоменклатураКонтрагентов.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, РезультатОперации.НоменклатураКонтрагентов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьРезультатВыгрузитьЦены(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Выгрузка цен'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		РезультатОбработки = Ложь;
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатПолучитьПоказателиНоменклатурыМаркетплейса(РезультатОперации, РезультатОбработки)
	
	Настройки = ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки;
	
	Источники = ИсточникПоказателиНоменклатурыМП(ЭтотОбъект);
	
	ОбработатьРезультатПолучитьПоказателиНоменклатурыМаркетплейсаБезКонтекста(РезультатОперации, Источники, РезультатОбработки);
	
	Если Не РезультатОбработки Тогда
		Возврат;
	КонецЕсли;
	
	Если Настройки.ДополнительныеСвойства.ОтобратьПоНоменклатуреСИ Тогда
		
		Если Источники.НоменклатураВключение.Количество() > 0 Тогда
		
			ЦеныОстаткиТоваровМП.Параметры.УстановитьЗначениеПараметра("НоменклатураВключение", Источники.НоменклатураВключение);
			
		Иначе
			ЦеныОстаткиТоваровМП.Параметры.УстановитьЗначениеПараметра("НоменклатураВключение", Новый СписокЗначений);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьРезультатПолучитьПоказателиНоменклатурыМаркетплейсаБезКонтекста(РезультатОперации, Источники, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства = Источники.ДополнительныеСвойства;

	Если РезультатОперации.Свойство("Курсор") Тогда
		Если РезультатОперации.Курсор <> "" Тогда
			
			ДействующиеЗапросы = ПолучитьИзВременногоХранилища(ДополнительныеСвойства.АдресДействующихЗапросов);
			
			НеобходимоЗаписать = Ложь;
			Пока Истина Цикл
				РезультатПоиска = ДействующиеЗапросы.Получить(РезультатОперации.Курсор);
				Если РезультатПоиска <> Неопределено Тогда
					ДействующиеЗапросы.Удалить(РезультатОперации.Курсор);
					НеобходимоЗаписать = Истина;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НеобходимоЗаписать Тогда
				ПоместитьВоВременноеХранилище(ДействующиеЗапросы, ДополнительныеСвойства.АдресДействующихЗапросов);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Получение показателей номенклатуры маркетплейса'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 Тогда
		Если РезультатОперации.Ошибки.Количество() > 0 Тогда
			Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
				ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
			КонецЦикла;
		КонецЕсли;
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ВерсияКэша <> РезультатОперации.ВерсияКэша Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	ПерваяСтраница = Неопределено;
	ПоследняяСтраница = Неопределено;
	// Удаление существующей страницы при обновлении
	Для Каждого ЭлементАдресаСтраницКэша Из ДополнительныеСвойства.АдресаСтраницКэша Цикл
		Если ЭлементАдресаСтраницКэша.Представление = РезультатОперации.СтраницаКэша.ПервыйКлюч Тогда
			ДополнительныеСвойства.АдресаСтраницКэша.Удалить(ЭлементАдресаСтраницКэша);
		Иначе
			Если ЭлементАдресаСтраницКэша.Значение.Первая Тогда
				ПерваяСтраница = ЭлементАдресаСтраницКэша;
			КонецЕсли;
			Если ЭлементАдресаСтраницКэша.Значение.Последняя Тогда
				ПоследняяСтраница = ЭлементАдресаСтраницКэша;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Пришла пустая страница - можно не продолжать
	Если РезультатОперации.Показатели.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Первая страница должна быть одна. Объединим
	Если ПерваяСтраница <> Неопределено И РезультатОперации.СтраницаКэша.Первая Тогда
		
		ДанныеКэша = ПолучитьИзВременногоХранилища(ПерваяСтраница.Значение.АдресСтраницы);
		Для Каждого ПоказателиНоменклатуры Из РезультатОперации.Показатели Цикл
			ДанныеКэша.Вставить(ПоказателиНоменклатуры.Ключ, ПоказателиНоменклатуры.Значение);
		КонецЦикла;
		ПоместитьВоВременноеХранилище(ДанныеКэша, ПерваяСтраница.Значение.АдресСтраницы);
		
		Возврат;
	КонецЕсли;
	
	// Последняя страница должна быть одна. Объединим
	Если ПоследняяСтраница <> Неопределено И РезультатОперации.СтраницаКэша.Последняя Тогда
		
		ДанныеКэша = ПолучитьИзВременногоХранилища(ПоследняяСтраница.Значение.АдресСтраницы);
		Для Каждого ПоказателиНоменклатуры Из РезультатОперации.Показатели Цикл
			ДанныеКэша.Вставить(ПоказателиНоменклатуры.Ключ, ПоказателиНоменклатуры.Значение);
		КонецЦикла;
		ПоместитьВоВременноеХранилище(ДанныеКэша, ПоследняяСтраница.Значение.АдресСтраницы);
		
		Возврат;
	КонецЕсли;
	
	РезультатОперации.СтраницаКэша.АдресСтраницы = ПоместитьВоВременноеХранилище(РезультатОперации.Показатели, ДополнительныеСвойства.УникальныйИдентификатор);
	ДополнительныеСвойства.АдресаСтраницКэша.Добавить(РезультатОперации.СтраницаКэша, РезультатОперации.СтраницаКэша.ПервыйКлюч);
	ДополнительныеСвойства.АдресаСтраницКэша.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
	Если ДополнительныеСвойства.ОтобратьПоНоменклатуреСИ Тогда
		Если РезультатОперации.Показатели.Количество() > 0 Тогда
			
			Если Источники.НоменклатураВключение = Неопределено Тогда
				Источники.НоменклатураВключение = Новый СписокЗначений;
				
			ИначеЕсли ТипЗнч(Источники.НоменклатураВключение) <> Тип("СписокЗначений") Тогда
				Источники.НоменклатураВключение = Новый СписокЗначений;
			КонецЕсли;
			ЗначенияПараметра = Источники.НоменклатураВключение;	// СписокЗначений Из Строка
			
			Для Каждого ОписаниеПоказателя Из РезультатОперации.Показатели Цикл
				ЗначенияПараметра.Добавить(ОписаниеПоказателя.Значение.идНоменклатурыСИ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьРезультатПолучитьБренды(РезультатОперации, Источники, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Получение брендов'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 Тогда
		Если РезультатОперации.Ошибки.Количество() > 0 Тогда
			Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
				ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
			КонецЦикла;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	БрендыМП = ПолучитьИзВременногоХранилища(Источники.ДополнительныеСвойства.БрендыМП);
	БрендыМП.Очистить();
	
	Для Каждого ОписаниеБренда Из РезультатОперации.Бренды Цикл
		БрендыМП.Добавить(ОписаниеБренда.Идентификатор, ОписаниеБренда.Наименование);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(БрендыМП, Источники.ДополнительныеСвойства.БрендыМП);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьРезультатПолучитьКатегории(РезультатОперации, Источники, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Получение категорий'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 Тогда
		Если РезультатОперации.Ошибки.Количество() > 0 Тогда
			Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
				ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
			КонецЦикла;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	КатегорииМП = ПолучитьИзВременногоХранилища(Источники.ДополнительныеСвойства.КатегорииМП);
	КатегорииМП.Очистить();
	
	Для Каждого ОписаниеКатегории Из РезультатОперации.Категории Цикл
		КатегорииМП.Добавить(ОписаниеКатегории.Идентификатор, ОписаниеКатегории.Наименование);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(КатегорииМП, Источники.ДополнительныеСвойства.КатегорииМП);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныеНоменклатураПартнеров

&НаКлиенте
Процедура ОбработкаИзмененияНоменклатурыМаркетплейса(Результат, ДополнительныеПараметры) Экспорт
	Элементы.НоменклатураПартнеров.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСопоставлениеНоменклатуры(РезультатСопоставления, ДополнительныеПараметры) Экспорт
	
	Если РезультатСопоставления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СопоставленнаяНоменклатураКонтрагентов = Новый Массив;
	НесопоставленнаяНоменклатураКонтрагентов = ДополнительныеПараметры;
	Для Каждого ЭлементСопоставления Из РезультатСопоставления Цикл
		НоменклатураКонтрагентаИзСопоставления = ЭлементСопоставления.НоменклатураКонтрагента.НоменклатураКонтрагента;
		Если ЗначениеЗаполнено(НоменклатураКонтрагентаИзСопоставления) Тогда
			СопоставленнаяНоменклатураКонтрагентов.Добавить(НоменклатураКонтрагентаИзСопоставления);
			
			ИндексСопоставленногоЭлемента = 
				НесопоставленнаяНоменклатураКонтрагентов.Найти(НоменклатураКонтрагентаИзСопоставления);
			Если ИндексСопоставленногоЭлемента <> Неопределено Тогда
				НесопоставленнаяНоменклатураКонтрагентов.Удалить(ИндексСопоставленногоЭлемента);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НесопоставленнаяНоменклатураКонтрагентов) Тогда
		ТекстОшибки = УдалитьСопоставлениеНоменклатурыКонтрагентов(НесопоставленнаяНоменклатураКонтрагентов, УчетнаяЗапись);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
		
	Если СопоставленнаяНоменклатураКонтрагентов.Количество() > 0 Тогда
		Ошибки = ЗаполнитьКоличествоУпаковок(ВидМаркетплейса, СопоставленнаяНоменклатураКонтрагентов);
		Если Ошибки.Количество() > 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрСоединить(Ошибки, Символы.ПС));
		КонецЕсли;
	КонецЕсли;
	
	Элементы.НоменклатураПартнеров.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УдалитьСопоставлениеНоменклатурыКонтрагентов(СписокНоменклатуры, УчетнаяЗапись)

	Возврат ИнтеграцияСМаркетплейсамиСИ.УдалитьСопоставлениеНоменклатурыКонтрагентов(СписокНоменклатуры, 
		УчетнаяЗапись);

КонецФункции

&НаКлиенте
Процедура ВыгрузитьСопоставлениеНоменклатуры(НоменклатураКонтрагентов = Неопределено)

	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиПустойУчетнойЗаписи(), , "УчетнаяЗапись");
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	
	Если НоменклатураКонтрагентов <> Неопределено Тогда
		ПараметрыМетода = Новый Структура("НоменклатураПартнера", НоменклатураКонтрагентов);
	Иначе
		ПараметрыМетода = Неопределено;
	КонецЕсли;
	ПараметрыОперации.Очередь.Добавить(ПараметрыМетода , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНоменклатуруМаркетплейса());
	
	// Методы, зависимые от МетодОбновитьНоменклатуруМаркетплейса 
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ЗависитОт", ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНоменклатуруМаркетплейса());
	ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВерсияКэша = Новый УникальныйИдентификатор;
	ПоместитьВоВременноеХранилище(Новый Соответствие, ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.АдресДействующихЗапросов);
	ПараметрыМетода.Вставить("ВерсияКэша", ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВерсияКэша);
	ПараметрыОперации.Очередь.Добавить(ПараметрыМетода , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьПоказателиНоменклатурыМаркетплейса());
	
	НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
	
КонецПроцедуры

// Заполнить количество упаковок.
// 
// Параметры:
//  ВидМаркетплейса - ПеречислениеСсылка.ВидыМаркетплейсов - Вид маркетплейса
//  НоменклатураКонтрагентов - Массив из СправочникСсылка.НоменклатураКонтрагентов - Номенклатура контрагентов
// 
// Возвращаемое значение:
//  Массив из Строка - Ошибки записи
&НаСервереБезКонтекста
Функция ЗаполнитьКоличествоУпаковок(Знач ВидМаркетплейса, Знач НоменклатураКонтрагентов)
	
	МассивОшибок = Новый Массив; // Массив из Строка
	
	Для Каждого НоменклатураСсылка Из НоменклатураКонтрагентов Цикл
		
		Если НоменклатураСсылка.КоличествоБазовойЕдиницыИзмерения <> 0
			И НоменклатураСсылка.КоличествоУпаковок <> 0
			И НоменклатураСсылка.НаименованиеБазовойЕдиницыИзмерения = НоменклатураСсылка.Упаковка.ПолноеНаименование() Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = Блокировка.Добавить("Справочник.НоменклатураКонтрагентов");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", НоменклатураСсылка);
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Номенклатура = НоменклатураСсылка.ПолучитьОбъект(); // СправочникОбъект
			
			Номенклатура.НаименованиеБазовойЕдиницыИзмерения = Номенклатура.Упаковка;
			Если Номенклатура.КоличествоБазовойЕдиницыИзмерения = 0 Тогда
				Номенклатура.КоличествоБазовойЕдиницыИзмерения = 1;
			КонецЕсли;
			
			Номенклатура.НаименованиеУпаковки = Номенклатура.Упаковка;
			Если Номенклатура.КоличествоУпаковок = 0 Тогда
				Номенклатура.КоличествоУпаковок = 1;
			КонецЕсли;
			
			Номенклатура.Записать();
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				ИнтеграцияСМаркетплейсамиСИ.СобытиеЖурналаРегистрации(ВидМаркетплейса),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
			МассивОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка при записи ""%1"". Возможно, объект уже редактируется.'"), НоменклатураСсылка));
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат МассивОшибок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеОстаткиТоваровМП

&НаКлиенте
Процедура Подключаемый_СинхронизироватьОстатки()
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		
		ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
		ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
		ПараметрыОперации.ВыводитьОкноОжидания = Ложь;
		ПараметрыОперации.ВыводитьСообщения = Ложь;
		
		ПараметрыОперации.Очередь.Добавить(,
			ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОстаткиТоваровМаркетплейса());
		
		НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_СинхронизироватьОстатки", 120, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеЦеныОстаткиТоваровМП

&НаСервере
Процедура ИнициализацияЦеныОстаткиТоваровМП()
	
	НоменклатураПартнеров.Параметры.УстановитьЗначениеПараметра("УчетнаяЗапись", Неопределено);
	
	ЦеныОстаткиТоваровМП.Параметры.УстановитьЗначениеПараметра("УчетнаяЗаписьМаркетплейса", Неопределено);
	
	ДопСвойстваСКД = ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	// Настройки для менеджера длительных операций
	ДопСвойстваСКД.Вставить("ИмяФормы", Метаданные.Имя);
	ДопСвойстваСКД.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ДопСвойстваСКД.Вставить("НомерСеансаИБ", НомерСеансаИнформационнойБазы());
	ДопСвойстваСКД.Вставить("ВерсияКэша", Новый УникальныйИдентификатор);
	ДопСвойстваСКД.Вставить("АдресДействующихЗапросов", ПоместитьВоВременноеХранилище(Новый Соответствие, УникальныйИдентификатор));
	
	ПользовательскиеНастройки = ЦеныОстаткиТоваровМП.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	ПолеПорядок = Новый ПолеКомпоновкиДанных("НаименованиеМП");
	Порядок = НаправлениеСортировкиКомпоновкиДанных.Возр;
	Для Каждого ЭлементНастройки Из ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ПорядокКомпоновкиДанных") Тогда
			Для Каждого ЭлементПорядка Из ЭлементНастройки.Элементы Цикл
				Если ЭлементПорядка.Поле = ПолеПорядок И ЭлементПорядка.Использование Тогда
					Порядок = ЭлементПорядка.ТипУпорядочивания;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	ДопСвойстваСКД.Вставить("НаправлениеСортировкиКД", Порядок);
	
	// Отбор по данным сервиса интеграции
	ДопСвойстваСКД.Вставить("ОтобратьПоНоменклатуреСИ", Ложь);
	
	// Кэширование данных из сервиса интеграции. Данные хранятся страницами
	ДопСвойстваСКД.Вставить("АдресаСтраницКэша", Новый СписокЗначений);
	ДопСвойстваСКД.Вставить("РазмерСтраницы", 1100);	// Немного больше платформенной страницы
	
	ДопСвойстваСКД.Вставить("БрендыМП", ПоместитьВоВременноеХранилище(Новый СписокЗначений, УникальныйИдентификатор));
	ДопСвойстваСКД.Вставить("КатегорииМП", ПоместитьВоВременноеХранилище(Новый СписокЗначений, УникальныйИдентификатор));
	
	МаркерыСтатусов = Новый СписокЗначений;
	МаркерыСтатусов.Добавить(8, НСтр("ru = 'Все'"));
	МаркерыСтатусов.Добавить(3, НСтр("ru = 'Ошибок нет'"));
	МаркерыСтатусов.Добавить(0, НСтр("ru = 'Требуют исправления'"));
	Если ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоWildberries(ВидМаркетплейса) Тогда
		МаркерыСтатусов.Добавить(5, НСтр("ru = 'На карантине'"));
	КонецЕсли;	
	ДопСвойстваСКД.Вставить("МаркерыСтатусов", ПоместитьВоВременноеХранилище(МаркерыСтатусов, УникальныйИдентификатор));
	
	// Запрет платформенного поиска в списке цен
	ПоляДС = "НаименованиеМП,БрендМП,КатегорияМП";
	ЦеныОстаткиТоваровМП.УстановитьОграниченияИспользованияВОтборе(СтрРазделить(ПоляДС, ",", Ложь));
	
	// Условное оформление
	// Дата выгрузки остатков
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "ОстаткиТоваровМП.ДатаВыгрузки", Элементы.ОстаткиТоваровМПДатаВыгрузки.Имя);
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат",
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ДП='<%1>'", НСтр("ru = 'не выгружалось'")));
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОстаткиТоваровМПДатаВыгрузки.Имя);
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОстаткиТоваровМП.ДатаВыгрузки");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Представление данных, которые не выгружались.
	ЭлементОформления = ЦеныОстаткиТоваровМП.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат",
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ДП='<%1>'", НСтр("ru = 'не выгружалось'")));
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДатаВыгрузкиЦен");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДатаВыгрузкиЦен");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СинхронизироватьЦены(Знач КомпоновщикНастроек, Знач КлючНоменклатурыМП, ВидМаркетплейса)
	
	ИнтеграцияСМаркетплейсамиСИ.СинхронизироватьЦены(КомпоновщикНастроек, КлючНоменклатурыМП, ВидМаркетплейса);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборЦенПоДаннымСервисаИнтеграции(Значение, ИмяКоманды)
	
	ОчиститьСообщения();
	
	// Сохраним настроенный отбор динамического списка
	Если Значение <> Неопределено Тогда
		
		Для Каждого ЭлементОтбора Из ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
			Если СтрНайти(ЭлементОтбора.Параметр, "Использовать") > 0 И ЭлементОтбора.Значение = Истина Тогда
				ЭлементОтбора.Значение = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		ДопСвойстваСКД = ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
		
		Если Значение = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МаркерыСтатусовЦен().Все Тогда

			НоменклатураВключение = ЦеныОстаткиТоваровМП.Параметры.Элементы.Найти("НоменклатураВключение");
			Если НоменклатураВключение <> Неопределено Тогда
				НоменклатураВключение.Использование = Ложь;
				НоменклатураВключение.Значение = Новый СписокЗначений;
			КонецЕсли;
			
			ДопСвойстваСКД.Вставить("ОтобратьПоНоменклатуреСИ", Ложь);
			
		Иначе
			
			ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьМаркерСтатуса", Истина);
			ПользовательскиеНастройкиДС = ЦеныОстаткиТоваровМП.КомпоновщикНастроек.ПользовательскиеНастройки;
	
			Для Каждого ЭлементНастройки Из ПользовательскиеНастройкиДС.Элементы Цикл
				Если ТипЗнч(ЭлементНастройки) = Тип("ОтборКомпоновкиДанных") Тогда
					ЭлементНастройки.Элементы.Очистить();
					
					ЭлементОтбора = ЭлементНастройки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МаркерСтатуса");
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ЭлементОтбора.ПравоеЗначение = Значение;
					ЭлементОтбора.Использование = Ложь;
					
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ДопСвойстваСКД.Вставить("ОтобратьПоНоменклатуреСИ", Истина);
			
			ЦеныОстаткиТоваровМП.Параметры.Элементы.Найти("НоменклатураВключение").Использование = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	// Получим данные из сервиса интеграции
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиПустойУчетнойЗаписи(), , "УчетнаяЗапись");
		Возврат;
	КонецЕсли;
	
	Партнер = Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись).Партнер;
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Укажите партнера в настройках учетной записи.'"),,, "ОбщиеНастройки");
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.Вставить("ИмяКомандыОтбораПоСтатусу", ИмяКоманды);
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	
	ПараметрыМетода = Новый Структура("ВерсияКэша", ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВерсияКэша);
	ПараметрыОперации.Очередь.Добавить(ПараметрыМетода, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьПоказателиНоменклатурыМаркетплейса());
	
	НачатьВыполнениеДлительныхОпераций1(ПараметрыОперации);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиДляОтбораДС(ИмяДинамическогоСписка)
	
	НастройкиСКД = Новый Структура;
	НастройкиСКД.Вставить("СхемаКомпоновкиДанных", Элементы[ИмяДинамическогоСписка].ПолучитьИсполняемуюСхемуКомпоновкиДанных());
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(НастройкиСКД.СхемаКомпоновкиДанных));
	Компоновщик.ЗагрузитьНастройки(ЭтотОбъект[ИмяДинамическогоСписка].КомпоновщикНастроек.ПолучитьНастройки());
	
	НастройкиСКД.Вставить("Настройки", Компоновщик.ПолучитьНастройки());
	
	Возврат ИнтеграцияСМаркетплейсамиСИ.ПолучитьНастройкиДляОтбораСпискаЦеныОстаткиТоваровМП(НастройкиСКД);

КонецФункции

&НаКлиенте
Процедура ПриЗавершенииНастройкиОтбораДС(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНастройкиОтбораДС(Результат, ДополнительныеПараметры.ИмяДинамическогоСписка);
	УстановитьОтборЦенПоДаннымСервисаИнтеграции(Неопределено, Команды.ОтобратьПроизвольно.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиОтбораДС(НастройкиСКД, ИмяДинамическогоСписка)
	
	ПользовательскиеНастройкиДС = ЭтотОбъект[ИмяДинамическогоСписка].КомпоновщикНастроек.ПользовательскиеНастройки;	// ПользовательскиеНастройкиКомпоновкиДанных
	НастройкиДС = ЭтотОбъект[ИмяДинамическогоСписка].КомпоновщикНастроек.Настройки;	// НастройкиКомпоновкиДанных
	НастройкиОтбораСКД = НастройкиСКД.Отбор;	// ОтборКомпоновкиДанных
	
	ПолеБрендМП = Новый ПолеКомпоновкиДанных("БрендМП");
	ПолеКатегорияМП = Новый ПолеКомпоновкиДанных("КатегорияМП");
	ПолеТолькоВНаличии = Новый ПолеКомпоновкиДанных("ТолькоВНаличии");
	ПолеНаименованиеМП = Новый ПолеКомпоновкиДанных("НаименованиеМП");
	ПолеМаркерСтатуса = Новый ПолеКомпоновкиДанных("МаркерСтатуса");
	
	НастройкиДС.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьБрендыМП", Ложь);
	НастройкиДС.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьКатегорииМП", Ложь);
	НастройкиДС.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьТолькоВНаличии", Ложь);
	НастройкиДС.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьНаименованиеМП", Ложь);
	НастройкиДС.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьМаркерСтатуса", Ложь);
	
	Для Каждого ЭлементНастройки Из ПользовательскиеНастройкиДС.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ОтборКомпоновкиДанных") Тогда
			ЭлементНастройки.Элементы.Очистить();
			
			Для Каждого ЭлементОтбораСКД Из НастройкиОтбораСКД.Элементы Цикл
				Если ТипЗнч(ЭлементОтбораСКД) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
					Если ЭлементОтбораСКД.ЛевоеЗначение = ПолеБрендМП Тогда
						НастройкиДС.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьБрендыМП", ЭлементОтбораСКД.Использование);
						ЭлементОтбораСКД.Использование = Ложь;
					ИначеЕсли ЭлементОтбораСКД.ЛевоеЗначение = ПолеКатегорияМП Тогда
						НастройкиДС.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьКатегорииМП", ЭлементОтбораСКД.Использование);
						ЭлементОтбораСКД.Использование = Ложь;
					ИначеЕсли ЭлементОтбораСКД.ЛевоеЗначение = ПолеТолькоВНаличии Тогда
						НастройкиДС.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьТолькоВНаличии", ЭлементОтбораСКД.Использование);
						ЭлементОтбораСКД.Использование = Ложь;
					ИначеЕсли ЭлементОтбораСКД.ЛевоеЗначение = ПолеНаименованиеМП Тогда
						НастройкиДС.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьНаименованиеМП", ЭлементОтбораСКД.Использование);
						ЭлементОтбораСКД.Использование = Ложь;
					ИначеЕсли ЭлементОтбораСКД.ЛевоеЗначение = ПолеМаркерСтатуса Тогда
						НастройкиДС.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьМаркерСтатуса", ЭлементОтбораСКД.Использование);
						ЭлементОтбораСКД.Использование = Ложь;
					КонецЕсли;
					
					ЭлементОтбора = ЭлементНастройки.Элементы.Добавить(Тип(ЭлементОтбораСКД));
					ЗаполнитьЗначенияСвойств(ЭлементОтбора, ЭлементОтбораСКД);
				КонецЕсли;
			КонецЦикла;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЭтотОбъект[ИмяДинамическогоСписка].КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ОтобратьПоНоменклатуреСИ", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СинхронизироватьЦены()
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		
		Настройки = ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки;
		
		ДействующиеЗапросы = ПолучитьИзВременногоХранилища(Настройки.ДополнительныеСвойства.АдресДействующихЗапросов);
		Если ДействующиеЗапросы.Количество() = 0 Тогда
			// Актуализируем данные только в случае, если на них есть фокус
			ТекущиеДанные = Элементы.ЦеныОстаткиТоваровМП.ТекущиеДанные;
			Если ТекущиеДанные <> Неопределено Тогда
				КлючНоменклатурыМП = СтрШаблон("%1_%2", ТекущиеДанные.НаименованиеМП, ТекущиеДанные.ИдентификаторМП);
				СинхронизироватьЦены(ЦеныОстаткиТоваровМП.КомпоновщикНастроек, КлючНоменклатурыМП, ВидМаркетплейса);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_СинхронизироватьЦены", 120, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЦеныОжиданиеПолученияСтраницыДанных(ДанныеСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ФоновоеЗадание = ДанныеСообщения.ФоновоеЗадание;
	
	Если ФоновоеЗадание.Статус = "Выполняется" Тогда
		ОжидатьЗавершениеДлительныхОпераций(ДанныеСообщения);
	ИначеЕсли ФоновоеЗадание.Статус = "Выполнено" Тогда
		ОбработатьРезультатДлительныхОпераций(ФоновоеЗадание, ДанныеСообщения);
	КонецЕсли;
	
	Элементы.ЦеныОстаткиТоваровМП.Обновить();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура НастройкиПодключенияПослеЗакрытия( РезультатЗакрытия, ДополнительныеПараметры ) Экспорт
	
	Если ТипЗнч( РезультатЗакрытия ) <> Тип( "Структура" ) Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяЗаписьПодключенаДоИзменения = УчетнаяЗаписьПодключена;
	Объект.Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры( РезультатЗакрытия, "Организация" );
	УчетнаяЗаписьПодключена = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры( РезультатЗакрытия, "УчетнаяЗаписьПодключена" );
	УчетнаяЗапись = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры( РезультатЗакрытия, "УчетнаяЗапись" );
	
	Если УчетнаяЗаписьПодключена = Истина И УчетнаяЗаписьПодключенаДоИзменения = Ложь Тогда
	
		ПолучитьОсновныеДанныеУчетнойЗаписи();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоЧисло(Знач СтрокаПроверки)
	
	Для НомерСимвола = 1 По СтрДлина(СтрокаПроверки) Цикл
		
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, НомерСимвола, 1));
		
		Если НЕ ((КодСимвола >= 48 И КодСимвола <= 57)
			ИЛИ КодСимвола = 44 ИЛИ КодСимвола = 46) Тогда
			Возврат Ложь;
		КонецЕсли;

	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция НоменклатураКонтрагентовПоСсылкам(Знач Ссылки)
	Возврат ИнтеграцияСМаркетплейсамиВызовСервера.НоменклатураКонтрагентовПоСсылкам(Ссылки);
КонецФункции

// Заполнить массив НоменклатураМП выделенными элементами номенклатура контрагента.
// 
// Параметры:
//  НоменклатураМП - массив из СправочникСсылка.НоменклатураКонтрагентов - Учетная запись маркетплейса
//  ВыделенныеСтроки - Неопределено, Массив из Число - Выделенные строки
// 
&НаСервереБезКонтекста
Процедура ЗаполнитьНоменклатураМП(НоменклатураМП, Знач ВыделенныеСтроки)
	Для Каждого КлючЗаписи Из ВыделенныеСтроки Цикл
		НоменклатураМП.Добавить(КлючЗаписи.Объект1С);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	// Выделение цветом измененных складов
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.НаклонныйШрифтБЭД);

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СкладыМаркетплейсаНаименованиеСкладаСервиса.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СкладыМаркетплейсаСклад.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СкладыМаркетплейсаСхемаРаботыСклада.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СкладыМаркетплейсаНаименованиеСкладаМП.Имя);

	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СкладыМаркетплейса.Изменение");
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	// Выделение цветом измененных ограничений
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.НаклонныйШрифтБЭД);

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровИспользуется.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровОбластьДействия.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровПроцентОстатка.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровСтраховойЗапас.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровМинимальныйОстаток.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровМаксимальныйОстаток.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровНаименование.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровКод.Имя);

	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкаОграниченийВыгрузкиОстатковТоваров.Изменение");
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	// Выделение цветом отмеченных к удалению ограничений на остатки
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровИспользуется.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровОбластьДействия.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровПроцентОстатка.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровСтраховойЗапас.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровМинимальныйОстаток.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровМаксимальныйОстаток.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровНаименование.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаОграниченийВыгрузкиОстатковТоваровКод.Имя);

	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкаОграниченийВыгрузкиОстатковТоваров.Удаление");
	ОтборЭлемента.ПравоеЗначение = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьПоУчетнойЗаписи(ОписаниеУчетнойЗаписи = Неопределено)
	
	ДоступностьПоУчетнойЗаписи = ЗначениеЗаполнено(УчетнаяЗапись);
	
	Элементы.Партнер.ТолькоПросмотр = Не ДоступностьПоУчетнойЗаписи;
	
	Если ОписаниеУчетнойЗаписи = Неопределено И ДоступностьПоУчетнойЗаписи Тогда
		ОписаниеУчетнойЗаписи = Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуПоУчетнойЗаписи(ОписаниеУчетнойЗаписи)
	
	УзелОбмена = НайтиСоздатьУзелОбменаСИ(УчетнаяЗапись, ОписаниеУчетнойЗаписи.Представление, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРедактированияСоответствияСкладов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = СкладыМаркетплейса.НайтиПоИдентификатору(ДополнительныеПараметры["ТекущаяСтрока"]);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаПройдена = Истина;
	
	Если ПроверкаПройдена Тогда
		Если ТекущиеДанные.Склад <> Результат.Склад Тогда
			Если ЗначениеЗаполнено(ТекущийСклад) Тогда
				ИсключаемыеСклады = Кэш.ИсключаемыеСклады; // Массив

				ОписаниеСклада = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйКарточкаСкладаМаркетплейса();
				ОписаниеСклада.ИдентификаторСкладаСервиса = ТекущиеДанные.ИдентификаторСкладаСервиса;
				ОписаниеСклада.Склад = ТекущийСклад;
				ИсключаемыеСклады.Добавить(ОписаниеСклада);
				
			КонецЕсли;
			ТекущиеДанные.Склад = Результат.Склад;
			ТекущиеДанные.Изменение = Истина;
		КонецЕсли;
		Модифицированность = Истина;
	Иначе
		ТекущиеДанные.Склад = ТекущийСклад;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьИерархиюСкладов(Склады)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК Склады
	|ГДЕ
	|	Склады.Ссылка В ИЕРАРХИИ(&Склады)
	|ИТОГИ ПО
	|	Склад ИЕРАРХИЯ";
    
	Запрос.УстановитьПараметр("Склады", Склады);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Склады.Найти(Выборка.Склад) = Неопределено Тогда
			Склады.Добавить(Выборка.Склад);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройкиНаКлиенте(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНастройкиИнтеграции();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройкиИнтеграции()
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОтменитьМодифицированность = Истина;
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНастройкиУчетнойЗаписи());
	
	Отбор = Новый Структура("Изменение", Истина);
	НайденныеСтроки = СкладыМаркетплейса.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьСклады());
		ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьСкладыМаркетплейса());
		ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьСкладыМаркетплейса());
	КонецЕсли;
		
	ПолучитьОграниченияОстатковТоваров = Ложь;
	
	Отбор = Новый Структура("Изменение, Удаление", Истина, Ложь);
	НайденныеСтроки = НастройкаОграниченийВыгрузкиОстатковТоваров.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ПолучитьОграниченияОстатковТоваров = Истина;
		ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьОграниченияОстатковТоваров());
	КонецЕсли;
	
	Отбор = Новый Структура("Удаление", Истина);
	НайденныеСтроки = НастройкаОграниченийВыгрузкиОстатковТоваров.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ПолучитьОграниченияОстатковТоваров = Истина;
		ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодУдалитьОграниченияОстатковТоваров());
	КонецЕсли;
	
	Если ПолучитьОграниченияОстатковТоваров Тогда
		ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьОграниченияОстатковТоваров());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредыдущийПартнер) И ПредыдущийПартнер <> Объект.Партнер Тогда
		ПараметрыМетода = Новый Структура("ЗависитОт, ЗависимыеПоля", ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНастройкиУчетнойЗаписи(), "");
		ПараметрыОперации.Очередь.Добавить(ПараметрыМетода , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПеренестиНоменклатуруПартнера());
	КонецЕсли;
	
	НачатьВыполнениеДлительныхОпераций2(ПараметрыОперации);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПартнерУказанДляРазныхУчетныхЗаписей(Партнер)
	УчетныеЗаписиПартнера = Справочники.УчетныеЗаписиМаркетплейсов.УчетныеЗаписиПоПартнеру(Партнер);
	Возврат УчетныеЗаписиПартнера.Количество() > 1;
КонецФункции

&НаКлиенте
Процедура НачатьВыполнениеДлительныхОпераций2(ПараметрыОперации)
	
	ИнтернетПоддержкаПодключена = Ложь;
	ВыполнитьДлительныеОперации(ИнтернетПоддержкаПодключена, ПараметрыОперации, Неопределено);
	
	Если ИнтернетПоддержкаПодключена Тогда
		НачатьВыполнениеДлительныхОперацийПродолжение(Истина, ПараметрыОперации, Неопределено);
	Иначе
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеДлительныхОперацийПродолжение", ЭтотОбъект, ПараметрыОперации);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(Оповещение, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередВыполнениемДлительныхОпераций(ПараметрыОперации, ПараметрыЗаполнены, Отказ)

	КоличествоОпераций = ПараметрыОперации.Очередь.Количество() - 1;

	ПорядокОперации = 0;

	Пока ПорядокОперации <= КоличествоОпераций Цикл

		Операция = ПараметрыОперации.Очередь[ПорядокОперации];

		Метод = Операция.Представление;

		Если ПараметрыЗаполнены
			И Метод = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьСкладыМаркетплейса() Тогда

			Если Операция.Значение.СкладыМаркетплейса.Количество() > 0 Тогда
				Склады = Новый Массив;
				Для Каждого Карточка Из Операция.Значение.СкладыМаркетплейса Цикл
					Если ЗначениеЗаполнено(Карточка.Склад) Тогда
						Склады.Добавить(Карточка.Склад);
					КонецЕсли;
				КонецЦикла;
				Если Склады.Количество() > 0 Тогда
					Если Не ЗначениеЗаполнено(УзелОбмена) Тогда
						ОписаниеУчетнойЗаписи = Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись);
						УзелОбмена = НайтиСоздатьУзелОбменаСИ(УчетнаяЗапись,
							ОписаниеУчетнойЗаписи.Представление, Истина);
					КонецЕсли;
					Если ЗначениеЗаполнено(УзелОбмена) Тогда
						ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Склады);
					Иначе
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли Не ПараметрыЗаполнены
			И Метод = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьОграниченияОстатковТоваров() Тогда

			МаксимальныйКод = 0;

			КодыОграничений = НастройкаОграниченийВыгрузкиОстатковТоваров.Выгрузить( , "Код");
			КодыОграничений.Сортировать("Код");

			МаксимальныйКод = Макс(МаксимальныйКод, КодыОграничений[КодыОграничений.Количество() - 1].Код);

			ОтборСтрок = Новый Структура("Изменение, Код", Истина, 0);
			ОтмеченныеСтрокиБезНомера = НастройкаОграниченийВыгрузкиОстатковТоваров.НайтиСтроки(ОтборСтрок);

			Для Каждого СтрокаБезНомера Из ОтмеченныеСтрокиБезНомера Цикл
				МаксимальныйКод = МаксимальныйКод + 1;
				СтрокаБезНомера.Код = МаксимальныйКод;
			КонецЦикла;

		ИначеЕсли Не ПараметрыЗаполнены И Метод = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьСклады() Тогда
			
			Если Не ЗначениеЗаполнено(УзелОбмена) Тогда
				УзелОбмена = НайтиСоздатьУзелОбменаСИ(УчетнаяЗапись, Объект.Наименование, Истина);
				Если Не ЗначениеЗаполнено(УзелОбмена) Тогда
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;

		ПорядокОперации = ПорядокОперации + 1;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаПолучитьУчетныеЗаписи(Значение)
	
	ЗначениеДо = Значение;
	
	Значение = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьУчетныеЗаписи();
	ЗаполнитьЗначенияСвойств(Значение, ЭтотОбъект, , "УчетнаяЗапись");
	Если ТипЗнч(ЗначениеДо) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Значение, ЗначениеДо);
	Иначе
		Значение.УчетнаяЗапись = ЗначениеДо;
	КонецЕсли;
	Значение.ВсеУчетныеЗаписи = Не ЗначениеЗаполнено(Значение.УчетнаяЗапись);
	Значение.ВидМаркетплейса = ВидМаркетплейса;
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаОбновитьНастройкиУчетнойЗаписи(ПараметрыЗапроса)

	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаОбновитьНастройкиУчетнойЗаписи();
	ПараметрыЗапроса.ВидМаркетплейса = ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = УчетнаяЗапись;
	ПараметрыЗапроса.Партнер = Объект.Партнер;
	ПараметрыЗапроса.АвтоКоррекцияОстатков = Объект.АвтоКоррекцияОстатков;
	ПараметрыЗапроса.ИспользоватьИнтеграциюПоОстаткам = Объект.ВыгружатьОстатки;
	ПараметрыЗапроса.АвтоКоррекцияЦен = Объект.АвтоКоррекцияЦен;
	ПараметрыЗапроса.ИспользоватьИнтеграциюПоЦенам = Объект.ВыгружатьЦены;
	ПараметрыЗапроса.РазрешенаВыгрузкаЦенНаМаркетплейс = Объект.ВыгружатьЦены;

КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаПолучитьСкладыМаркетплейса(ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьСкладыМаркетплейса();
	ПараметрыЗапроса.ВидМаркетплейса = ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = УчетнаяЗапись;

	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаОбновитьСкладыМаркетплейса(ПараметрыЗапроса)

	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаОбновитьСкладыМаркетплейса();
	ПараметрыЗапроса.ВидМаркетплейса = ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = УчетнаяЗапись;

	Отбор = Новый Структура("Изменение", Истина);
	ОтмеченныеСтроки = СкладыМаркетплейса.НайтиСтроки(Отбор);

	Для Каждого Данные Из ОтмеченныеСтроки Цикл

		ОписаниеСклада = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйКарточкаСкладаМаркетплейса();

		ЗаполнитьЗначенияСвойств(ОписаниеСклада, Данные);

		ПараметрыЗапроса.СкладыМаркетплейса.Добавить(ОписаниеСклада);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаВыгрузитьСклады(ПараметрыЗапроса)

	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаВыгрузитьСклады();
	ПараметрыЗапроса.ВидМаркетплейса = ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = УчетнаяЗапись;

	Склады = ПараметрыЗапроса.Склады;
	Для Каждого СкладМаркетплейса Из СкладыМаркетплейса Цикл
		Если Не ЗначениеЗаполнено(СкладМаркетплейса.Склад) Тогда
			Продолжить;
		КонецЕсли;
		Если Склады.Найти(СкладМаркетплейса.Склад) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Склады.Добавить(СкладМаркетплейса.Склад);
	КонецЦикла;

	ПолучитьИерархиюСкладов(Склады);

КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаПолучитьОграниченияОстатковТоваров(ПараметрыЗапроса)
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьОграниченияОстатковТоваров();
	ПараметрыЗапроса.ВидМаркетплейса = ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = УчетнаяЗапись;
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаВыгрузитьОграниченияОстатковТоваров(ПараметрыЗапроса)

	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаВыгрузитьОграниченияОстатковТоваров();
	ПараметрыЗапроса.ВидМаркетплейса = ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = УчетнаяЗапись;

	Отбор = Новый Структура("Изменение, Удаление", Истина, Ложь);

	ОтмеченныеСтроки = НастройкаОграниченийВыгрузкиОстатковТоваров.НайтиСтроки(Отбор);

	Для Каждого Данные Из ОтмеченныеСтроки Цикл

		Ограничение = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйКарточкаНастройкиОграниченияОстаткаТоваров();

		ЗаполнитьЗначенияСвойств(Ограничение, Данные);

		ПараметрыЗапроса.ОграниченияОстатковТоваров.Добавить(Ограничение);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаУдалитьОграниченияОстатковТоваров(ПараметрыЗапроса)

	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаУдалитьОграниченияОстатковТоваров();
	ПараметрыЗапроса.ВидМаркетплейса = ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = УчетнаяЗапись;

	Отбор = Новый Структура("Удаление", Истина);

	ОтмеченныеСтроки = НастройкаОграниченийВыгрузкиОстатковТоваров.НайтиСтроки(Отбор);

	Для Каждого Данные Из ОтмеченныеСтроки Цикл
		
		Если Данные.Код = 0 Тогда
			Продолжить;
		КонецЕсли;

		Если Данные.Код = 0 Тогда
			Продолжить;
		КонецЕсли;

		Ограничение = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйКарточкаНастройкиОграниченияОстаткаТоваров();

		ЗаполнитьЗначенияСвойств(Ограничение, Данные);

		ПараметрыЗапроса.ОграниченияОстатковТоваров.Добавить(Ограничение);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаПеренестиНоменклатуруПартнера(ПараметрыЗапроса)

	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПеренестиНоменклатуруПартнера();
	ПараметрыЗапроса.ВидМаркетплейса = ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = УчетнаяЗапись;
	ПараметрыЗапроса.ТекущийВладелец = ПредыдущийПартнер;
	ПараметрыЗапроса.НовыйВладелец = Объект.Партнер;

КонецПроцедуры

// Обработать результат обновить настройки учетной записи.
// 
// Параметры:
//  РезультатОперации - Структура - Результат операции
//  РезультатОбработки - Булево - Результат обработки
// 
// Возвращаемое значение:
//  Структура - Кэш
&НаСервере
Функция ОбработатьРезультатОбновитьНастройкиУчетнойЗаписи(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат Кэш;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Обновление настроек учетной записи'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
		РезультатОбработки = Ложь;
	КонецЕсли;
	
	ОписаниеУчетнойЗаписи = Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись);
	Если ОписаниеУчетнойЗаписи = Неопределено Тогда
		Возврат Кэш;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ОписаниеУчетнойЗаписи, ЭтотОбъект);
	
	Если РезультатОперации.КодСостояния <> 200 Тогда
		Возврат Кэш;
	КонецЕсли;
	
	// При необходимости создадим узлы плана обмена и зарегистрируем склады к выгрузке
	ДанныеФормы = Новый Структура;
	ДанныеФормы.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ДанныеФормы.Вставить("Партнер", Объект.Партнер);
	ДанныеФормы.Вставить("ВалютаУчета", Объект.ВалютаУчета);
	ДанныеФормы.Вставить("ВидЦеныДоСкидок", ВидЦеныДоСкидок);
	ДанныеФормы.Вставить("ВидЦеныСоСкидкойПродавца", ВидЦеныСУчетомСкидок);
	ДанныеФормы.Вставить("ВидЦеныКлубная", ВидЦеныМинимальныхЦен);
	ДанныеФормы.Вставить("ЭтоWildberries", Истина);
	
	ПриЗаписиНаСервере(ОписаниеУчетнойЗаписи, ДанныеФормы, УзелОбмена);
	
	ИнтеграцияСМаркетплейсамиСИ.ИзменитьИспользованиеРегламентногоЗадания(ОписаниеУчетнойЗаписи,
		ИнтеграцияСМаркетплейсамиСИКлиентСервер.ПрефиксЗаданияСинхронизацияССервисомИнтеграции(ВидМаркетплейса), УчетнаяЗаписьПодключена );
	
	Возврат Кэш;
	
КонецФункции

&НаСервере
Процедура ОбработатьРезультатПолучитьСкладыМаркетплейса(РезультатОперации, РезультатОбработки)
	
	СкладыМаркетплейса.Очистить();
	
	Если РезультатОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Получение складов маркетплейса'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Для Каждого ОписаниеСкладаМаркетплейса Из РезультатОперации.СкладыМаркетплейса Цикл
		НоваяСтрока = СкладыМаркетплейса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеСкладаМаркетплейса);
		НоваяСтрока.НаименованиеСкладаМП = ОписаниеСкладаМаркетплейса.НаименованиеСкладаМаркетплейса;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатОбновитьСкладыМаркетплейса(Знач РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	 
	ОшибкаПрефикс = НСтр( "ru = 'Обновление складов маркетплейса'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РезультатОперации.УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	// Зарегистрируем склады в регистре соответствий
	ИспользуемыеСклады = Новый ТаблицаЗначений;
	ИспользуемыеСклады.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
	ИспользуемыеСклады.Колонки.Добавить("ИдентификаторСкладаСервиса", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ИспользуемыеСклады.Колонки.Добавить("НаименованиеСкладаСервиса", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	
	Для Каждого ОписаниеСклада Из РезультатОперации.Склады Цикл
		Если ЗначениеЗаполнено(ОписаниеСклада.Склад) Тогда
			НоваяСтрока = ИспользуемыеСклады.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеСклада);
		КонецЕсли;
	КонецЦикла;
	
	ИсключаемыеСклады = ИспользуемыеСклады.СкопироватьКолонки();
	
	Для Каждого ОписаниеСклада Из Кэш.ИсключаемыеСклады Цикл
		Если ЗначениеЗаполнено(ОписаниеСклада.Склад) Тогда
			НоваяСтрока = ИсключаемыеСклады.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеСклада);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	//@skip-check bsl-ql-hub
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИспользуемыеСклады.Склад КАК Склад,
	|	ИспользуемыеСклады.ИдентификаторСкладаСервиса КАК ИдентификаторСкладаСервиса,
	|	ИспользуемыеСклады.НаименованиеСкладаСервиса КАК НаименованиеСкладаСервиса
	|ПОМЕСТИТЬ врИспользуемыеСклады
	|ИЗ
	|	&ИспользуемыеСклады КАК ИспользуемыеСклады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсключаемыеСклады.Склад КАК Склад,
	|	ИсключаемыеСклады.ИдентификаторСкладаСервиса КАК ИдентификаторСкладаСервиса,
	|	ИсключаемыеСклады.НаименованиеСкладаСервиса КАК НаименованиеСкладаСервиса
	|ПОМЕСТИТЬ врИсключаемыеСклады
	|ИЗ
	|	&ИсключаемыеСклады КАК ИсключаемыеСклады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад,
	|	врИспользуемыеСклады.ИдентификаторСкладаСервиса КАК ИдентификаторСклада,
	|	врИспользуемыеСклады.НаименованиеСкладаСервиса КАК НаименованиеСклада,
	|	&КодВключить КАК Действие,
	|	Ложь КАК ЭтоГруппа
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ врИспользуемыеСклады КАК врИспользуемыеСклады
	|		ПО (врИспользуемыеСклады.Склад = Склады.Ссылка)
	|ГДЕ
	|	Склады.Ссылка В ИЕРАРХИИ(&ИспользуемыеСклады)
	|	И НЕ Склады.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Склады.Ссылка,
	|	врИсключаемыеСклады.ИдентификаторСкладаСервиса,
	|	врИсключаемыеСклады.НаименованиеСкладаСервиса,
	|	&КодИсключить,
	| Ложь
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ врИсключаемыеСклады КАК врИсключаемыеСклады
	|		ПО (врИсключаемыеСклады.Склад = Склады.Ссылка)
	|ГДЕ
	|	Склады.Ссылка В ИЕРАРХИИ(&ИсключаемыеСклады)
	|	И НЕ Склады.ПометкаУдаления
	|ИТОГИ
	|	МАКСИМУМ(ИдентификаторСклада),
	|	МАКСИМУМ(НаименованиеСклада)
	|ПО
	|	Действие,
	|	Склад ИЕРАРХИЯ";

	Запрос.УстановитьПараметр("ИспользуемыеСклады", ИспользуемыеСклады);
	Запрос.УстановитьПараметр("ИсключаемыеСклады", ИсключаемыеСклады);
	Запрос.УстановитьПараметр("КодВключить", 1);
	Запрос.УстановитьПараметр("КодИсключить", 0);
	
	ЕстьОшибки = Ложь;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		НаборВключить = РегистрыСведений.СоответствияОбъектовМаркетплейсов.СоздатьНаборЗаписей();
		НаборИсключить = РегистрыСведений.СоответствияОбъектовМаркетплейсов.СоздатьНаборЗаписей();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СоответствияОбъектовМаркетплейсов");
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.УстановитьЗначение("УчетнаяЗаписьМаркетплейса", РезультатОперации.УчетнаяЗапись);
		ЭлементБлокировки.УстановитьЗначение("ВидОбъектаМаркетплейса", Перечисления.ВидыОбъектовМаркетплейсов.Склад);
		ЭлементБлокировки.УстановитьЗначение("Объект1С", "Склад");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ИдентификаторСклада = "";
		НаименованиеСклада = "";
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			
			ВыборкаДействие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Действие");
			Пока ВыборкаДействие.Следующий() Цикл
			
				Выборка = ВыборкаДействие.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.ИдентификаторСклада <> NULL Тогда
						ИдентификаторСклада = Выборка.ИдентификаторСклада;
						НаименованиеСклада = Выборка.НаименованиеСклада;
					КонецЕсли;
					
					Если Выборка.ТипЗаписи() <> ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
						Продолжить;
					КонецЕсли;
					
					Если Выборка.ЭтоГруппа Тогда
						Продолжить;
					КонецЕсли;
					
					Если ВыборкаДействие.Действие = Запрос.Параметры.КодВключить Тогда
						Запись = НаборВключить.Добавить();
						Запись.НаименованиеОбъектаМаркетплейса = НаименованиеСклада;
					ИначеЕсли ВыборкаДействие.Действие = Запрос.Параметры.КодИсключить Тогда
						Запись = НаборИсключить.Добавить();
					Иначе
						Продолжить;
					КонецЕсли;
					
					Запись.УчетнаяЗаписьМаркетплейса = РезультатОперации.УчетнаяЗапись;
					Запись.ВидОбъектаМаркетплейса = Перечисления.ВидыОбъектовМаркетплейсов.Склад;
					Запись.ИдентификаторОбъектаМаркетплейса = ИдентификаторСклада;
					Запись.Объект1С = Выборка.Склад;
					
				КонецЦикла;
			КонецЦикла;
			
			// Сначала очистим без отбора по идентификаторам объектов маркетплейса
			Если НаборИсключить.Количество() > 0 Тогда
				НаборИсключить.ОбменДанными.Получатели.Добавить(УзелОбмена);
				НаборИсключить.Записать(РежимЗамещения.Удаление);
			КонецЕсли;
			
			// Добавим записи по определенным идентификаторам объектов маркетплейса
			Если НаборВключить.Количество() > 0 Тогда
				НаборВключить.ОбменДанными.Получатели.Добавить(УзелОбмена);
				НаборВключить.Записать(РежимЗамещения.Слияние);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИнтеграцияСМаркетплейсамиСИ.СобытиеЖурналаРегистрации(ВидМаркетплейса),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
		
	КонецЕсли;

	Если Не ЕстьОшибки Тогда
		Кэш.ИсключаемыеСклады.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатПолучитьОграниченияОстатковТоваров(РезультатОперации, РезультатОбработки)

	НастройкаОграниченийВыгрузкиОстатковТоваров.Очистить();

	Если РезультатОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
    
    ОшибкаПрефикс = НСтр( "ru = 'Получение ограничений остатков товаров'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
		Возврат;
	КонецЕсли;

	Для Каждого ОписаниеОграничения Из РезультатОперации.ОграниченияОстатковТоваров Цикл
		НоваяСтрока = НастройкаОграниченийВыгрузкиОстатковТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОграничения);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыгрузитьОграниченияОстатковТоваров(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Выгрузка ограничений остатков товаров'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатПеренестиНоменклатуруПартнера(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Перенос номенклатуры партнера'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатУдалитьОграниченияОстатковТоваров(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОшибкаПрефикс = НСтр( "ru = 'Удаление ограничений остатков товаров'" ) + ": ";
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ОшибкаПрефикс + Ошибка);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРедактированияОграниченияВыгрузкиОстатков(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Добавление Тогда
		ИдентификаторСтроки = 0;
	Иначе
		ИдентификаторСтроки = ДополнительныеПараметры.ИдентификаторСтроки;
	КонецЕсли;
	
	Если ЕстьДублиОграничения(Результат, ИдентификаторСтроки) > 0 Тогда
		ТекстСообщение = СтрШаблон(НСтр("ru = 'Запись невозможна. Существует ограничение для области действия %1.'"), Результат.ОбластьДействия);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщение);
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Добавление Тогда
		РедактируемаяСтрока = НастройкаОграниченийВыгрузкиОстатковТоваров.Добавить();
	Иначе
		РедактируемаяСтрока = НастройкаОграниченийВыгрузкиОстатковТоваров.НайтиПоИдентификатору(
			ДополнительныеПараметры.ИдентификаторСтроки);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РедактируемаяСтрока, Результат);
	
	РедактируемаяСтрока.Изменение = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ЕстьДублиОграничения(Результат, ИдентификаторСтроки)
	
	ПараметрыОтбора = Новый Структура("ОбластьДействия", Результат.ОбластьДействия);
	НайденныеОграничения = НастройкаОграниченийВыгрузкиОстатковТоваров.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеОграничения.Количество() = 0 Тогда
		ЕстьДубли = Ложь;
	ИначеЕсли НайденныеОграничения.Количество() > 1 Тогда
		ЕстьДубли = Истина;
	Иначе
		ЕстьДубли = НайденныеОграничения[0].ПолучитьИдентификатор() <> ИдентификаторСтроки;
	КонецЕсли;
	
	Возврат ЕстьДубли;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиСоздатьУзелОбменаСИ(УчетнаяЗапись, ИмяУзла, СоздатьПриОтсутствии)
	Возврат ПланыОбмена.МаркетплейсыСИ.НайтиСоздатьУзел(УчетнаяЗапись, СоздатьПриОтсутствии, ИмяУзла);
КонецФункции

&НаСервере
Процедура НовыйКэшированныеЗначения()
	
	Кэш = Новый Структура;
	Кэш.Вставить("ПараметрыМенеджераДлительныхОпераций");
	Кэш.Вставить("УчетныеЗаписи", Новый Соответствие);
	Кэш.Вставить("ИсключаемыеСклады", Новый Массив);
	Кэш.Вставить("ПравоНаОстатки", Истина);
	Кэш.Вставить("ПравоНаЦены", Истина);
	Кэш.Вставить("ЭтоWildberries", Истина);
	
КонецПроцедуры

// Текст ошибки пустой учетной записи.
// 
// Возвращаемое значение:
//  Строка - Текст ошибки пустой учетной записи
&НаКлиентеНаСервереБезКонтекста
Функция ТекстОшибкиПустойУчетнойЗаписи()
	Возврат НСтр("ru = 'Укажите учетную запись.'");
КонецФункции

// Определение состояния регламентных заданий, которыми можно управлять на форме
// 
// Параметры:
//  ВидМаркетплейса - ПеречислениеСсылка.ВидыМаркетплейсов - Вид маркетплейса
//  ОписаниеУчетнойЗаписи - Структура - Описание учетной записи. Свойства:
//  * УчетнаяЗаписьИдентификатор - Строка - Идентификатор учетной записи
//  ОстаткиТоваровМПРЗВключено - Булево - текущее состояние регламентного задания
&НаСервереБезКонтекста
Процедура ОпределитьСостоянияРегламентныхЗаданий(Знач ВидМаркетплейса, Знач ОписаниеУчетнойЗаписи, ОстаткиТоваровМПРЗВключено)
	
	Ключ = ИнтеграцияСМаркетплейсамиСИКлиентСервер.КлючЗаданияРасчетОстатковТоваров(
		ВидМаркетплейса,
		ОписаниеУчетнойЗаписи.УчетнаяЗаписьИдентификатор);

	ОстаткиТоваровМПРЗВключено = ИнтеграцияСМаркетплейсамиСИ.ОпределитьСостояниеРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ВыгрузкаОстатковНаМаркетплейсы, Ключ);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность(ОписаниеУчетнойЗаписи = Неопределено)
	ИнтеграцияСМаркетплейсамиСИКлиент.УстановитьВидимостьДоступность(ЭтотОбъект, ОписаниеУчетнойЗаписи);
	#Если ВебКлиент Тогда
		Элементы.ГруппаСтраницы.Видимость = Истина;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКнопкуОтбораПоСтатусу(ИмяКоманды, Информация = "")
	
	Если ПустаяСтрока(Информация) Тогда
		ОтборыЗаголовок = Элементы[ИмяКоманды].Заголовок;
	Иначе
		ОтборыЗаголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 (%2)", ИмяКоманды, Информация);
	КонецЕсли;
	
	Элементы.ГруппаЦеныОстаткиТоваровПодменюОтборы.Заголовок = ОтборыЗаголовок;
	Элементы.ГруппаЦеныОстаткиТоваровПодменюОтборы.Картинка = Элементы[ИмяКоманды].Картинка;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройкиСоздания()
	
	СостояниеНастроек.Очистить();
	
	Если Объект.Ссылка.Пустая() Тогда
		Статус = 0;
	Иначе
		Статус = 2;
	КонецЕсли;
	ДобавитьНастройку("Приветствие", 2);
	ДобавитьНастройку("Дополнительно", 2);
	ДобавитьНастройку("Склады", Статус);
	ДобавитьНастройку("Цены", Статус);
	ДобавитьНастройку("Товары", Статус);
	ДобавитьНастройку("Расписания", Статус);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаЭлементыДляНовойНастройкиИнтеграцииВидимостьУстановить( Значение )

	Элементы.ГруппаЭтапыПодключения.Видимость = Значение;
	Элементы.ГруппаДополнительно.Видимость = Значение;
	Элементы.ГруппаПодсказкаАссистента6.Видимость = Значение;
	Элементы.ГруппаСклады2.Видимость = Значение;
	Элементы.ГруппаОграничениеОстатков2.Видимость = Значение;
	Элементы.ГруппаВидыЦен.Видимость = Значение;
	Элементы.ГруппаПодсказкаАссистента2.Видимость = Значение;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройку(ИмяСтраницы, Статус)
	
	МассивСтрок = СостояниеНастроек.НайтиСтроки(Новый Структура("ИмяСтраницы", ИмяСтраницы));
	
	Если МассивСтрок.Количество() Тогда
		ТекНастройка = МассивСтрок[0];
	Иначе
		ТекНастройка = СостояниеНастроек.Добавить();
	КонецЕсли;
	
	ТекНастройка.ИмяСтраницы = ИмяСтраницы;
	ТекНастройка.Статус = Статус;
	
КонецПроцедуры

&НаСервере
Функция ФормаЭлементыОтборыУстановить(УчетнаяЗапись)

	Возврат Истина;
КонецФункции

&НаСервере
Процедура ОбновитьОтображениеНаСервере()
	
	КаналыПродажКлиентСервер.ФормаКоманднаяПанельВидимостьУстановить( ЭтотОбъект, Объект.НастройкаЗавершена );
	
	Если Объект.НастройкаЗавершена Тогда
	
		Для Каждого Стр Из Объект.СостояниеНастроек Цикл
			Элементы["ГруппаНижнееМеню" + Стр.ИмяСтраницы].Видимость = Ложь;
		КонецЦикла;
	
		КаналыПродажКлиентСервер.МенюСтраницПараметрЗначениеУстановить( ЭтотОбъект, "СтрокиОтмечатьКорректноЗаполненные", Ложь );
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ДобавитьНастройкуНаСервере("Приветствие",1);
		ДобавитьНастройкуНаСервере("Дополнительно");
		ДобавитьНастройкуНаСервере("Склады");
		ДобавитьНастройкуНаСервере("Цены");
		ДобавитьНастройкуНаСервере("Товары");
		ДобавитьНастройкуНаСервере("Расписания");
		
	Иначе
		НастроитьРасписаниеРегламентногоЗадания = ПолучитьРасписаниеРегламентногоЗадания();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройкуНаСервере(ИмяСтраницы, Статус = 0)
	
	МассивСтрок = Объект.СостояниеНастроек.НайтиСтроки(Новый Структура("ИмяСтраницы", ИмяСтраницы));
	
	Если МассивСтрок.количество() Тогда
		ТекНастройка = МассивСтрок[0];
	Иначе
		ТекНастройка = Объект.СостояниеНастроек.Добавить();
	КонецЕсли;
	
	ТекНастройка.ИмяСтраницы = ИмяСтраницы;
	ТекНастройка.Статус = Статус;
	
	КаналыПродажКлиентСервер.МенюСтраницДоступностьСтраницыДляПереключенияУстановить( ЭтотОбъект, "Страница" + ИмяСтраницы, Статус > 0 );
КонецПроцедуры

&НаСервереБезКонтекста
Функция ШрифтыЭлементовСтиляПолучить()
	Шрифты = Новый Структура;
	Шрифты.Вставить( "Обычный", ШрифтыСтиля.ОбычныйШрифтТекста );
	Шрифты.Вставить( "Полужирный", ШрифтыСтиля.НадписьШрифтПолужирный8 );
	Возврат Шрифты; 
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеНаКлиенте()
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		
		ЕстьПереходПоСтранице = Ложь;
		Для Каждого Стр Из Объект.СостояниеНастроек Цикл
			
			Если Стр.Статус = 1 Тогда
				ЕстьПереходПоСтранице = Истина;
				Элементы.СтраницыПунктыМеню.ТекущаяСтраница = Элементы["Страница" + Стр.ИмяСтраницы];
			КонецЕсли;
			
		КонецЦикла;
		
		ТекущаяСтраницаИмя = Элементы.СтраницыПунктыМеню.ТекущаяСтраница.Имя;
		КаналыПродажКлиентСервер.МенюСтраницТекущаяСтрокаУстановить( ЭтотОбъект, ТекущаяСтраницаИмя );
		
		ФормаКнопкаПоУмолчаниюВключить( ТекущаяСтраницаИмя );
		
		Если Не ЕстьПереходПоСтранице Тогда
			Объект.НастройкаЗавершена = Истина;
			Записать();
			ОбновитьОтображениеНаСервере();
		КонецЕсли;
	КонецЕсли;

	Если Объект.НастройкаЗавершена Тогда
		Элементы.ФормаЗаписатьИзмененияИЗакрыть.КнопкаПоУмолчанию = Истина;
		Элементы.ФормаЗаписатьИзмененияИЗакрыть.Важность = ВажностьКнопки.Главная;
	КонецЕсли;
	
	// остатки
	Элементы.ГруппаНастройкиСкладов.Доступность = Объект.ВыгружатьОстатки;
	Элементы.ОстаткиТоваровМПРассчитать.Доступность = Объект.ВыгружатьОстатки;
	Элементы.ОстаткиТоваровМППолныйПересчет.Доступность = Объект.ВыгружатьОстатки;
	
	// цены
	Элементы.ГруппаВидыЦен.Доступность = Объект.ВыгружатьЦены;
	Элементы.ЦеныТоваровМППолныйПересчет.Доступность = Объект.ВыгружатьЦены;
	Элементы.ЦеныТоваровМПРассчитать.Доступность = Объект.ВыгружатьЦены;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНастройкуНаКлиенте(ИмяСтраницы, Статус = 0)
	
	МассивСтрок = Объект.СостояниеНастроек.НайтиСтроки(Новый Структура("ИмяСтраницы", ИмяСтраницы));
	
	Если МассивСтрок.Количество() Тогда
		ТекНастройка = МассивСтрок[0];
	Иначе
		ТекНастройка = Объект.СостояниеНастроек.Добавить();
	КонецЕсли;
	
	ТекНастройка.ИмяСтраницы = ИмяСтраницы;
	ТекНастройка.Статус = Статус;
	
	КаналыПродажКлиентСервер.МенюСтраницДоступностьСтраницыДляПереключенияУстановить( ЭтотОбъект, "Страница" + ИмяСтраницы, Статус > 0 );
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияНаКлиенте()
    
    Если ПустаяСтрока( Объект.Наименование ) Тогда
		Объект.Наименование = Строка(Объект.Организация) + " ( " + Строка(Объект.ИдентификаторКлиента) + " )";
	КонецЕсли;
	
	Записать();
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаписатьНастройкиНаКлиенте", ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ПредыдущийПартнер) И ПредыдущийПартнер <> Объект.Партнер Тогда
		ТекстУточнение = 
		НСтр("ru = 'Для корректной работы функции импорта необходимо обновить данные о контрагенте в информации о загружаемых товарах.'");
		Если ПартнерУказанДляРазныхУчетныхЗаписей(ПредыдущийПартнер) Тогда
			ТекстУточнение = НСтр("ru = 'Прежний контрагент связан с разными учетными записями и будет изменен во всех соответствующих товарных каталогах.'");
		КонецЕсли;
		
		ПоказатьВопрос(ОповещениеОЗавершении, 
			СтрШаблон(НСтр("ru = 'Данные о контрагенте используются в процессе импорта товарного каталога. %1
						|Процесс обновления может занять продолжительное время. 
						|Продолжить?'"), ТекстУточнение), 
			РежимДиалогаВопрос.ДаНет, 
			, 
			КодВозвратаДиалога.Нет, 
			НСтр("ru = 'Запись данных'"),
			КодВозвратаДиалога.Нет);
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьВидыЦенВОбъектУчетнаяЗапись()

	УчетнаяЗаписьОбъект = Объект;
	
	УчетнаяЗаписьОбъект.ВидыЦен.Очистить();
	
	НоваяСтрока = УчетнаяЗаписьОбъект.ВидыЦен.Добавить();
	НоваяСтрока.ИмяНастройки = ИнтеграцияСМаркетплейсамиКлиентСервер.ИмяВидЦеныДоСкидок();
	НоваяСтрока.ВидЦены = ВидЦеныДоСкидок;
	
	НоваяСтрока = УчетнаяЗаписьОбъект.ВидыЦен.Добавить();
	НоваяСтрока.ИмяНастройки = ИнтеграцияСМаркетплейсамиКлиентСервер.ИмяВидЦеныСоСкидкойПродавца();
	НоваяСтрока.ВидЦены = ВидЦеныСУчетомСкидок;
	
	НоваяСтрока = УчетнаяЗаписьОбъект.ВидыЦен.Добавить();
	НоваяСтрока.ИмяНастройки = ИнтеграцияСМаркетплейсамиКлиентСервер.ИмяВидЦеныКлубная();
	НоваяСтрока.ВидЦены = ВидЦеныМинимальныхЦен;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеФормыПослеВыполненияФоновогоЗадания( Результат, ДополнительныеПараметры ) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если Результат.Свойство("АдресРезультата") И ЗначениеЗаполнено(Результат.АдресРезультата) Тогда
			
			РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			Если ТипЗнч( РезультатВыполнения ) = Тип( "Структура" ) Тогда
				
				Если РезультатВыполнения.Свойство( "Код" ) И ЗначениеЗаполнено( РезультатВыполнения.Код ) Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатВыполнения.Описание);
				КонецЕсли;
				
				Если РезультатВыполнения.Свойство( "КодОшибки" ) И ЗначениеЗаполнено( РезультатВыполнения.КодОшибки ) Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если Результат.Свойство( "ПодробноеПредставлениеОшибки" ) Тогда
			Если Не ПустаяСтрока( Результат.ПодробноеПредставлениеОшибки ) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю( Результат.ПодробноеПредставлениеОшибки );
			КонецЕсли;
		КонецЕсли;
		
		Если Результат.Свойство( "Сообщения" ) Тогда
			Для Каждого СообщениеЭлемент Из Результат.Сообщения Цикл
				ОбщегоНазначенияКлиент.СообщитьПользователю( СообщениеЭлемент.Текст );
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Товары.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписания(РасписаниеЗадания)
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеЗадания);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Расписание", РасписаниеЗадания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьНастройкуРасписанияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписанияЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		ВыполнитьНастройкуРасписанияЗавершениеНаСервере(ДополнительныеПараметры.Расписание);
		
		НастроитьРасписаниеРегламентногоЗадания = ДополнительныеПараметры.Расписание;
		
	Иначе
		ВыполнитьНастройкуРасписанияЗавершениеНаСервере(Расписание);
		
		НастроитьРасписаниеРегламентногоЗадания = Расписание;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасписаниеРегламентногоЗадания()
	
	РасписаниеРегламентногоЗадания = Неопределено;
	
	Если Объект.РасписаниеРегламентногоЗадания <> "" Тогда
		Попытка
			РасписаниеРегламентногоЗадания = ЗначениеИзСтрокиВнутр(Объект.РасписаниеРегламентногоЗадания);
		Исключение
			РасписаниеРегламентногоЗадания = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Если ТипЗнч(РасписаниеРегламентногоЗадания) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		РасписаниеРегламентногоЗадания =
		ИнтеграцияСМаркетплейсомOzonСервер.ПолучитьРасписаниеРегламентногоЗаданияПоУмолчанию();
	КонецЕсли;
	
	Возврат РасписаниеРегламентногоЗадания;

КонецФункции

&НаСервере
Процедура ВыполнитьНастройкуРасписанияЗавершениеНаСервере(Расписание)
	                                         	
		Если РазделениеВключено И Расписание.ПериодПовтораВТечениеДня < 300 Тогда
			Расписание.ПериодПовтораВТечениеДня = 300;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Минимальное время запуска фонового задания 5 минут.'"));
		КонецЕсли;
		
		Объект.РасписаниеРегламентногоЗадания = ЗначениеВСтрокуВнутр(Расписание);

КонецПроцедуры

// Определяет подчиненные элементы.
//
// Параметры:
//   Элемент - ЭлементыФормы - родительский элемент.
//
// Возвращаемое значение:
//   Массив Из ЭлементыФормы - подчиненные элементы.
//
&НаСервере
Функция ПолучитьПодчиненныеЭлементыФормы(Знач Элемент)
	
	Результат = Новый Массив;
	
	Для Каждого ЭлементКоллекции Из Элемент.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ЭлементКоллекции) = Тип("ГруппаФормы") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ПолучитьПодчиненныеЭлементыФормы(ЭлементКоллекции));
		Иначе
			Результат.Добавить(ЭлементКоллекции);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//@skip-check module-unused-method
&НаКлиенте
Процедура МенюСтраницПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания( "МенюСтраницПриАктивизацииСтрокиПерейти", 0.1, Истина );
КонецПроцедуры

//@skip-check export-method-in-command-form-module
&НаСервере
Процедура МенюСтраницЗаполнить() Экспорт

	//@skip-check bsl-legacy-check-string-literal
	РеквизитМенюСтраниц = ЭтотОбъект[ "МенюСтраниц" ];
	МенюСтраницСтрока = РеквизитМенюСтраниц.Добавить();
	МенюСтраницСтрока.Наименование = "Приветствие";
	МенюСтраницСтрока.ИмяСтраницы = "СтраницаПриветствие";
	МенюСтраницСтрока.НомерКартинки = 0;
	МенюСтраницСтрока.ДоступностьСтраницы = Истина;
	МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Истина;
	МенюСтраницСтрока.ПоляСтраницыЗаполненыКорректно = Истина;
	МенюСтраницСтрока.ВтораяКартинкаСтроки = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();
	
	МенюСтраницСтрока = РеквизитМенюСтраниц.Добавить();
	МенюСтраницСтрока.Наименование = "Авторизация";
	МенюСтраницСтрока.ИмяСтраницы = "СтраницаДополнительно";
	МенюСтраницСтрока.НомерКартинки = 1;
	МенюСтраницСтрока.ДоступностьСтраницы = Истина;
	МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Истина;
	МенюСтраницСтрока.ПоляСтраницыЗаполненыКорректно = Истина;
	МенюСтраницСтрока.ВтораяКартинкаСтроки = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();

	МенюСтраницСтрока = РеквизитМенюСтраниц.Добавить();
	МенюСтраницСтрока.Наименование = "Склады";
	МенюСтраницСтрока.ИмяСтраницы = "СтраницаСклады";
	МенюСтраницСтрока.НомерКартинки = 10;
	МенюСтраницСтрока.ДоступностьСтраницы = Истина;
	МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Истина;
	МенюСтраницСтрока.ПоляСтраницыЗаполненыКорректно = Истина;
	МенюСтраницСтрока.ВтораяКартинкаСтроки = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();

	МенюСтраницСтрока = РеквизитМенюСтраниц.Добавить();
	МенюСтраницСтрока.Наименование = "Цены";
	МенюСтраницСтрока.ИмяСтраницы = "СтраницаЦены";
	МенюСтраницСтрока.НомерКартинки = 7;
	МенюСтраницСтрока.ДоступностьСтраницы = Истина;
	МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Истина;
	МенюСтраницСтрока.ПоляСтраницыЗаполненыКорректно = Истина;
	МенюСтраницСтрока.ВтораяКартинкаСтроки = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();
	
	МенюСтраницСтрока = РеквизитМенюСтраниц.Добавить();
	МенюСтраницСтрока.Наименование = "Товары";
	МенюСтраницСтрока.ИмяСтраницы = "СтраницаТовары";
	МенюСтраницСтрока.НомерКартинки = 3;
	МенюСтраницСтрока.ДоступностьСтраницы = Истина;
	МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Истина;
	МенюСтраницСтрока.ПоляСтраницыЗаполненыКорректно = Истина;
	МенюСтраницСтрока.ВтораяКартинкаСтроки = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();

	МенюСтраницСтрока = РеквизитМенюСтраниц.Добавить();
	МенюСтраницСтрока.Наименование = "Расписание";
	МенюСтраницСтрока.ИмяСтраницы = "СтраницаРасписания";
	МенюСтраницСтрока.НомерКартинки = 8;
	МенюСтраницСтрока.ДоступностьСтраницы = Истина;
	МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Истина;
	МенюСтраницСтрока.ПоляСтраницыЗаполненыКорректно = Истина;
	МенюСтраницСтрока.ВтораяКартинкаСтроки = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();
	
КонецПроцедуры

&НаКлиенте
Процедура МенюСтраницПриАктивизацииСтрокиПерейти()
	КаналыПродажКлиент.МенюСтраницПерейти( ЭтотОбъект );
КонецПроцедуры

&НаКлиенте
Процедура МенюСтраницНастройкиФормыОбновить( ИмяСтраницы ) Экспорт
	Если ИмяСтраницы = "СтраницаСклады" Тогда
		Если УчетнаяЗаписьПодключена 
		И СкладыМаркетплейса.Количество() = 0
		Тогда
			ПолучитьСклады(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция МенюСтраницПоляСтраницыЗаполненыКорректно( ИмяСтраницы ) Экспорт
	
	Результат = Истина;
	
	Если ИмяСтраницы = "СтраницаДополнительно" Тогда
	
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Результат = Ложь;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
			Результат = Ложь;
		КонецЕсли;
		
		Если Не УчетнаяЗаписьПодключена Тогда
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницы = "СтраницаСклады" Тогда

	
	ИначеЕсли ИмяСтраницы = "СтраницаЦены" Тогда
		
		Если Объект.ВыгружатьЦены Тогда
			Если НЕ ЗначениеЗаполнено(ВидЦеныДоСкидок)
				Или НЕ ЗначениеЗаполнено(ВидЦеныСУчетомСкидок)
				Или НЕ ЗначениеЗаполнено(ВидЦеныМинимальныхЦен) Тогда
				
				Результат = Ложь;
				
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли ИмяСтраницы = "СтраницаТовары" Тогда
	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ФормаКнопкиПоУмолчаниюЗаполнить()
	КнопкиПоУмолчанию = Новый Структура;
	КнопкиПоУмолчанию.Вставить( "СтраницаПриветствие", "КнопкаНачатьНастройку" );
	КнопкиПоУмолчанию.Вставить( "СтраницаДополнительно", "КнопкаДалее2" );
	КнопкиПоУмолчанию.Вставить( "СтраницаСклады", "КнопкаДалее3" );
	КнопкиПоУмолчанию.Вставить( "СтраницаЦены", "КнопкаДалее4" );
	КнопкиПоУмолчанию.Вставить( "СтраницаТовары", "КнопкаДалее5" );
КонецПроцедуры

&НаКлиенте
Процедура ФормаКнопкаПоУмолчаниюВключить( СтраницаИмя )
	КнопкаИмя = КнопкиПоУмолчанию[ СтраницаИмя ];
	Кнопка = Элементы[ КнопкаИмя ];
	Кнопка.Важность = ВажностьКнопки.Главная;
	Кнопка.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

&НаСервере
Процедура БаннерыДобавитьИПоказать()

	КаналыПродажСервер.ФормаДобавитьВажноеСообщениеПоДекорации( ЭтотОбъект, "ДекорацияТекстПодсказкиАвторизация", , , "Подключаемый_ОбработатьДействиеИнформационногоСообщения" );
	КаналыПродажСервер.ФормаДобавитьВажноеСообщениеПоДекорации( ЭтотОбъект, "ДекорацияТекстПодсказкиСклады", , , "Подключаемый_ОбработатьДействиеИнформационногоСообщения" );
	КаналыПродажСервер.ФормаДобавитьВажноеСообщениеПоДекорации( ЭтотОбъект, "ДекорацияТекстПодсказкиЦены", , , "Подключаемый_ОбработатьДействиеИнформационногоСообщения" );
	КаналыПродажСервер.ФормаДобавитьВажноеСообщениеПоДекорации( ЭтотОбъект, "ДекорацияТекстПодсказкиРасписания", , , "Подключаемый_ОбработатьДействиеИнформационногоСообщения" );
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму( ЭтотОбъект );

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОсновныеДанныеУчетнойЗаписи()

	Если УчетнаяЗаписьПодключена = Истина Тогда
		
		ЦеныОстаткиТоваровМП.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВерсияКэша = Новый УникальныйИдентификатор;
		
		ВыполнитьДлительныеОперацииПолучитьОсновныеДанныеУчетнойЗаписи();
		
		Если ЗначениеЗаполнено(Кэш.ПараметрыМенеджераДлительныхОпераций) Тогда
			НачатьВыполнениеДлительныхОперацийПродолжение(Истина, Кэш.ПараметрыМенеджераДлительныхОпераций, Неопределено);
			Кэш.ПараметрыМенеджераДлительныхОпераций = Неопределено;
		КонецЕсли;		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
