
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();
	
	АдаптацияТакси();
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Контрагент" Тогда
		
		Элементы.Список.Обновить();
		УправлениеФормой();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоискИПроверкаКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭтоСтрокаИНН = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Элемент.ТекстРедактирования);
	
	Если НЕ ЭтоСтрокаИНН Тогда
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Наименование", Элемент.ТекстРедактирования);
		ПоискКонтрагентовКлиент.НайтиКонтрагентов(ЭтотОбъект, , ПараметрыПоиска);
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(СокрЛП(Элемент.ТекстРедактирования)) <> 10 ИЛИ СтрДлина(СокрЛП(Элемент.ТекстРедактирования)) <> 12 Тогда
		ПредупреждениеАсинх(НСтр("ru = 'Организация с таким наименованием не найдена. Для поиска организации по ИНН необходимо указать его полностью'"));
		Возврат;
	КонецЕсли;
	
	ПоискИПроверкаКонтрагента = "";
	ПроверкаКонтрагентаКлиент.Проверить(Элемент.ТекстРедактирования, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискИПроверкаКонтрагентаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ЭтоСтрокаИНН = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Элемент.ТекстРедактирования);
	
	Если НЕ ЭтоСтрокаИНН Тогда
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Наименование", Элемент.ТекстРедактирования);
		ПоискКонтрагентовКлиент.НайтиКонтрагентов(ЭтотОбъект,,ПараметрыПоиска);
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(СокрЛП(Элемент.ТекстРедактирования)) = 10 ИЛИ СтрДлина(СокрЛП(Элемент.ТекстРедактирования)) = 12 Тогда
		ПоискИПроверкаКонтрагента = "";
		ПроверкаКонтрагентаКлиент.Проверить(Элемент.ТекстРедактирования, ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ПредупреждениеАсинх(НСтр("ru = 'Организация с таким наименованием не найдена. Для поиска организации по ИНН необходимо указать его полностью'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискИПроверкаКонтрагентаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	БизнесПриложениеПоискИПроверкаКлиент.АвтоПодборПоиск(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискИПроверкаКонтрагентаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Контрагенты") Тогда
		Элементы.Список.ТекущаяСтрока = ВыбранноеЗначение;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ЭтоСтрокаИНН = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ВыбранноеЗначение);
	
	Если НЕ ЭтоСтрокаИНН Тогда
		ПроверкаКонтрагентаКлиент.Проверить(ВыбранноеЗначение, ЭтотОбъект);
		ПоискИПроверкаКонтрагента = "";
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(СокрЛП(ВыбранноеЗначение)) = 10 ИЛИ СтрДлина(СокрЛП(ВыбранноеЗначение)) = 12 Тогда
		ПроверкаКонтрагентаКлиент.Проверить(ВыбранноеЗначение, ЭтотОбъект);
		ПоискИПроверкаКонтрагента = "";
		Возврат;
	КонецЕсли;
	
	ПоказатьПредупреждение(,НСтр("ru = 'Организация с таким наименованием не найдена. Для поиска организации по ИНН необходимо указать его полностью'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контрагент = Элементы.Список.ТекущиеДанные.Ссылка;
	ПроверкаКонтрагентаКлиент.Проверить(Контрагент, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоискПоОКВЭД(Команда)
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Наименование", ПоискИПроверкаКонтрагента);
	ПоискКонтрагентовКлиент.НайтиКонтрагентов(ЭтотОбъект, , ПараметрыПоиска);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	ЕстьКонтрагентыВСправочнике = ЕстьКонтрагентыВСправочнике();
	Элементы.Список.Видимость = ЕстьКонтрагентыВСправочнике;
	Элементы.ГруппаНетДанных.Видимость = НЕ ЕстьКонтрагентыВСправочнике;
	
КонецПроцедуры

&НаСервере
Функция ЕстьКонтрагентыВСправочнике()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Покупатель = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

&НаСервере
Процедура АдаптацияТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПоискИПроверкаКонтрагента.КартинкаКнопкиВыбора = БиблиотекаКартинок.СтрелкаВправоБольшаяУзкая;
	
	Элементы.КартинкаПоискКлиентов.Картинка = БиблиотекаКартинок.ПульсБизнесаCRMЛидыЦвет2;
	Элементы.КартинкаОценкаКонтрагентов.Картинка = БиблиотекаКартинок.ПульсБизнесаCRMКонтрагентыЦвет2;
	Элементы.КартинкаИсторияИзменения.Картинка = БиблиотекаКартинок.ПульсБизнесаСчетаЗаказыЦвет2;
	Элементы.КартинкаОценкаКонтрагентов.ОтображениеФона = ОтображениеФонаКартинки.НеОтображать;
	Элементы.КартинкаПоискКлиентов.ОтображениеФона = ОтображениеФонаКартинки.НеОтображать;
	Элементы.КартинкаИсторияИзменения.ОтображениеФона = ОтображениеФонаКартинки.НеОтображать;
	
	Элементы.ГруппаПоискИПроверкаИсторияИзменения.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Авто;
	Элементы.ГруппаПоискИПроверкаОценкаКонтрагентов.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Авто;
	Элементы.ГруппаПоискИПроверкаПоискКлиентов.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Авто;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПраваяПанельПоискИПроверкаКонтрагента.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти
