////////////////////////////////////////////////////////////////////////////////
// БАЗОВАЯ ФУНКЦИОНАЛЬНОСТЬ
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает представление программы (конфигурации) в именительном падеже.
// 
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеПрограммы() Экспорт
	
	Если ОбщегоНазначенияУНФ.ЭтоРозница() Тогда
		ИмяПрограммы = НСтр("ru = 'Розница'");
	Иначе
		ИмяПрограммы = НСтр("ru = 'Управление нашей фирмой'");
	КонецЕсли;

	Возврат ИмяПрограммы;
	
КонецФункции

#Область СериализацияJSON

// Преобразует значение даты, сериализованное по ISO 8601, в значение типа Дата
//
// Параметры:
//  ДатаСтрокой - Строка - дата в формате ISO 8601
// 
// Возвращаемое значение:
//  Дата - десериализованная дата; при невозможности десериализовать - пустая дата
//
Функция ДесериализоватьДатуISO(ДатаСтрокой) Экспорт
	
	Попытка
		Дата = ПрочитатьДатуJSON(ДатаСтрокой, ФорматДатыJSON.ISO);
	Исключение
		Возврат '0001-01-01';
	КонецПопытки;
	
	Возврат Дата;
	
КонецФункции

#КонецОбласти

#Область ОчередьЗаданий

// Планирует отложенное выполнение метода с использованием подсистемы ОчередьЗаданий.
// Метод должен быть зарегистрирован в подсистеме ОчередьЗаданий -
// см. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
//
// Следует применять для событий, вызванных действиями пользователя:
// задания планируются в эксклюзивную очередь.
//
// Предполагается однократное выполнение в течение указанного интервала:
// если выполнение уже запланировано на более ранний срок, то повторно запланировано не будет.
//
// Параметры:
//  ИмяМетода - Строка
//  Интервал  - Число - число секунд, через который можно выполнять метод.
//
Процедура ЗапланироватьВыполнение(ИмяМетода, Интервал) Экспорт
	
	ОписаниеЗадания = Новый Структура;
	ОписаниеЗадания.Вставить("ОбластьДанных", РаботаВМоделиСервиса.ЗначениеРазделителяСеанса());
	ОписаниеЗадания.Вставить("ИмяМетода",     ИмяМетода);
	ОписаниеЗадания.Вставить("Использование", Истина);
	
	Задания = ОчередьЗаданий.ПолучитьЗадания(ОписаниеЗадания);
	Если Задания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапланированныйМоментЗапуска = ТекущаяДатаСеанса() + Интервал;
	
	Для Каждого Задание Из Задания Цикл
		Если Задание.ЗапланированныйМоментЗапуска <= ЗапланированныйМоментЗапуска
			И Задание.СостояниеЗадания = Перечисления.СостоянияЗаданий.Запланировано Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеЗадания.Вставить("ЗапланированныйМоментЗапуска", ЗапланированныйМоментЗапуска);
	ОписаниеЗадания.Вставить("ЭксклюзивноеВыполнение", Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	ОчередьЗаданий.ДобавитьЗадание(ОписаниеЗадания);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

// Возвращает расписание для регламентного задания с ежедневным повтором. Время начала устанавливается случайным образом
// в заданном временном интервале
//
// Параметры:
//  ПараметрыРасписания - Структура - см. ПараметрыРасписанияЕжедневногоРегламентногоЗадания, через данный параметр
//                        задается временной интервал, в рамках которого должно запускаться регламентное задание
//
// Возвращаемое значение:
//  РасписаниеРегламентногоЗадания
//
Функция РасписаниеЗаданияЕжедневноВСлучайноеВремя(ПараметрыРасписания)
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ПериодПовтораДней = 1; 
	
	Если ЗначениеЗаполнено(ПараметрыРасписания.ВремяНачалаПериода)
		 Или ЗначениеЗаполнено(ПараметрыРасписания.ВремяКонцаПериода) Тогда
		ДлительностьПериода = 
			?(ЗначениеЗаполнено(ПараметрыРасписания.ВремяКонцаПериода), ПараметрыРасписания.ВремяКонцаПериода, Дата(1,1,1,23,59,59))
			- ПараметрыРасписания.ВремяНачалаПериода;
	Иначе
		ДлительностьПериода = 3600 * 24; // полные сутки
	КонецЕсли;
	
	ГенераторЧисел = Новый ГенераторСлучайныхЧисел();
	Расписание.ВремяНачала = ПараметрыРасписания.ВремяНачалаПериода + ГенераторЧисел.СлучайноеЧисло(0, ДлительностьПериода);
	
	Возврат Расписание;
	
КонецФункции

// Включить регламентное задание с ежедневным расписанием в случайное время.
// 
// Параметры:
//  РегламентноеЗадание - ОбъектМетаданныхРегламентноеЗадание - регламентное задание.
//  ПараметрыРасписания - Структура - см. ПараметрыРасписанияЕжедневногоРегламентногоЗадания()
//  
Процедура ВключитьРегламентноеЗаданиеЕжедневно(РегламентноеЗадание, ПараметрыРасписания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура("Метаданные", РегламентноеЗадание);
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Использование", Истина);
	Расписание = РасписаниеЗаданияЕжедневноВСлучайноеВремя(ПараметрыРасписания);
	ПараметрыЗадания.Вставить("Расписание", Расписание);
	
	Для Каждого Задание Из Задания Цикл
		Если Не Задание.Использование Тогда
			РегламентныеЗаданияСервер.ИзменитьЗадание(Задание.УникальныйИдентификатор, ПараметрыЗадания);
		КонецЕсли;
		Возврат;
	КонецЦикла;
	
	ПараметрыЗадания.Вставить("Метаданные", РегламентноеЗадание);
	РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	
КонецПроцедуры

// Конструктор параметров для подключения ежедневного регламентного задания.
// Предполагается генерация случайного времени суток и дальнейший запуск задания ежедневно в указанное время.
// Параметры позволяют ограничить интервал случайного времени запуска (например, с 9 до 17, если предполагаем,
// что в файловой ИБ будет активный клиент в данном интервале времени).
// 
// Возвращаемое значение:
//  Структура - Параметры ежедневного регламентного задания:
// * ВремяНачалаПериода - Дата - время суток, не ранее которого будет установлен момент ежедневного запуска
// * ВремяКонцаПериода - Дата - время суток, не позднее которого будет установлен момент ежедневного запуска
//
Функция ПараметрыРасписанияЕжедневногоРегламентногоЗадания() Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("ВремяНачалаПериода", '00010101000000');
	Параметры.Вставить("ВремяКонцаПериода", '00010101000000');
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#КонецОбласти
