#Область ОписаниеПеременных

&НаКлиенте
Перем ЭлементВФокусе;

&НаКлиенте
Перем ТекстДатыРожденияСозданиеКарты;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗакрытьБезИзмененияФормы = Ложь;
	РежимКассыСамообслуживания = Ложь;
	ТекущаяНастройкаРМК = Параметры.ТекущаяНастройкаРМК;
	ЗаполнитьТекущуюНастройкуРМК();
	ИнтерфейсРМКСлужебный.ПрименитьНаФормеМасштабИзПараметров(ЭтотОбъект, Параметры);
	ЗапоминатьНомерКартыЛояльности = Параметры.ЗапоминатьНомерКартыЛояльности;
	РазрешитьЗаменуДисконтнойКарты = Параметры.РазрешитьЗаменуДисконтнойКарты И НЕ РежимКассыСамообслуживания;
	Контрагент = Параметры.Контрагент;
	Организация = Параметры.Организация;
	РазрешитьРедактированиеДисконтнойКарты = Ложь;
	ПродолжатьБезКарты = Параметры.ПродолжатьБезКарты;
	СуммаДокумента = Параметры.СуммаДокумента;
	ВключеноРедактировниеКарты = РазрешитьРедактированиеДисконтнойКарты И Параметры.РедактироватьКарту;
	ЭлектронныйЧек = Параметры.ЭлектронныйЧек;
	ПодключенаОблачнаяККТ = Параметры.ПодключенаОблачнаяККТ;
	ИспользоватьДисконтныеКарты = Параметры.ИспользоватьДисконтныеКарты;
	ТорговыйОбъект = Параметры.ТорговыйОбъект;
	Если Параметры.Свойство("ТаблицаВидыКарт")
		И Параметры.ТаблицаВидыКарт <> Неопределено
		И Параметры.ТаблицаВидыКарт.Количество() Тогда
		ТаблицаВидыКарт.Загрузить(Параметры.ТаблицаВидыКарт.Выгрузить());
		Для Каждого ОписаниеВидаКарт Из ТаблицаВидыКарт Цикл
			Элементы.НоваяКартаВидКарты.СписокВыбора.Добавить(ОписаниеВидаКарт.Идентификатор, ОписаниеВидаКарт.Наименование);
		КонецЦикла;
		Элементы.НоваяКартаВидКарты.Доступность = Истина;
	КонецЕсли;
	
	Если Параметры.ВидСоздаваемойКарты <> Неопределено 
		И Параметры.НомерСоздаваемойКарты <> Неопределено Тогда
		ТекущееДействие = "СозданиеКарты";
		НоваяКартаВидКарты = Параметры.ВидСоздаваемойКарты;
		НоваяКартаНомер = Параметры.НомерСоздаваемойКарты;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ДисконтнаяКарта) Тогда
		ТекущееДействие = "Просмотр";
		МассивКарт = Новый Массив;
		МассивКарт.Добавить(Параметры.ДисконтнаяКарта);
		ЗаполнитьДанныеТаблицыКарт(МассивКарт);
		Если ТаблицаДанных.Количество() > 0 Тогда
			СтрокаКарты = ТаблицаДанных[0];
			Если Параметры.Свойство("ОстатокБалловНаКарте")Тогда
				СтрокаКарты.ОстатокБонусныхБаллов = Параметры.ОстатокБалловНаКарте;
			КонецЕсли;
			Если Параметры.Свойство("СуммаПродажПоКарте") Тогда
				СтрокаКарты.НайденнаяКартаСуммаПродаж = Параметры.СуммаПродажПоКарте;
			КонецЕсли;
			Если Параметры.Свойство("КурсБаллов") Тогда
				СтрокаКарты.КурсБонусов = Параметры.КурсБаллов;
			Иначе
				СтрокаКарты.КурсБонусов = 0;
			КонецЕсли;
		КонецЕсли;
		ЗакрытьБезИзмененияФормы = Истина;
		
		Если ОтправлятьSMSКодПриПродаже Тогда
			ПараметрыВводаКодаSMS = ПараметрыПроверкиПоSMSКоду();
			ПараметрыВводаКодаSMS.ВариантПроверки = "ПриПродаже";
			НомерТелефонаПодтвержден = Истина;		
			ОбновитьСостояниеПроверкиСМСНаФорме();
		КонецЕсли;
	ИначеЕсли Параметры.ПараметрыКартыЛояльности <> Неопределено Тогда
		ТекущееДействие = ?(РежимКассыСамообслуживания, "Просмотр", "Подтверждение");
		ДанныеИмеющейсяКарты = Параметры.ПараметрыКартыЛояльности;
		СтрокаКарты = ТаблицаДанных.Добавить();
		ЗаполнитьПараметрыСтрокиКартыПоДаннымРМК(СтрокаКарты, Параметры.ПараметрыКартыЛояльности);
		СтрокаКарты.ОстатокБонусныхБаллов = Параметры.ОстатокБалловНаКарте;
		СтрокаКарты.КурсБонусов = Параметры.КурсБаллов;
		СтрокаКарты.ОстатокБалловРуб = СтрокаКарты.ОстатокБонусныхБаллов * СтрокаКарты.КурсБонусов;
		ЗакрытьБезИзмененияФормы = Истина;
		Если ОтправлятьSMSКодПриПродаже Тогда
			ПараметрыВводаКодаSMS = ПараметрыПроверкиПоSMSКоду();
			ПараметрыВводаКодаSMS.ВариантПроверки = "ПриПродаже";
			НомерТелефонаПодтвержден = Истина;		
			ОбновитьСостояниеПроверкиСМСНаФорме();
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ШтрхикодДляПоиска) Тогда
		ТекущееДействие = "Поиск";
		СтрокаПоиска = Параметры.ШтрхикодДляПоиска;
	ИначеЕсли ЗначениеЗаполнено(Параметры.Контрагент)
		И ИспользоватьДисконтныеКарты Тогда
		ТекущееДействие = "Поиск";
	ИначеЕсли НЕ ИспользоватьДисконтныеКарты
		И (ЭлектронныйЧек Или ПодключенаОблачнаяККТ) Тогда
		ТекущееДействие = "ОтправкаЧека";
	Иначе
		ТекущееДействие = "Поиск";
	КонецЕсли;
	Если Параметры.РежимВыбораКонтрагента Тогда
		РежимВыбораКонтрагента = Параметры.РежимВыбораКонтрагента;
		БаннерОткрыт = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокФормы") Тогда
		НачальныйЗаголовокФормы = Параметры.ЗаголовокФормы;
	КонецЕсли;
	Если ТекущееДействие = "Просмотр" Тогда
		ИспользоватьЦифровуюКлавиатуру = Ложь;
	КонецЕсли;
	
	Если ИспользоватьЦифровуюКлавиатуру Тогда
		
		ВидыКлавиатуры = ИнтерфейсРМКСлужебный.ВидыЦифровойКлавиатуры();
		ПараметрыПостроения = Новый Структура();
		ПараметрыПостроения.Вставить("ВидКлавиатуры", ВидыКлавиатуры.Стандартный);
		ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиГоризонтальный", ИнтервалМеждуЭлементамиФормы.Одинарный);
		ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиВертикальный", ИнтервалМеждуЭлементамиФормы.Половинный);
		ПараметрыПостроения.Вставить("РастягиватьПоШирине", Истина);
		ПараметрыПостроения.Вставить("ЦветКнопок", ИнтерфейсРМКСлужебный.ЦветУправляющейКнопки(Истина));
		
		ТекстОшибки = ИнтерфейсРМКСлужебный.ПостроитьПанельЦифровойКлавиатуры(ЭтотОбъект, Элементы.ГруппаЦифроваяПанель,
			ПараметрыПостроения);
			
		Если ТекстОшибки = "" Тогда
			Элементы.ПоискСтраницы.Видимость = Ложь;
			Элементы.ЗапятаяУниверсальнаяКлавиатура.Доступность = Не РежимКассыСамообслуживания;
		Иначе
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
	ЦветаФормы = ОбщегоНазначенияРМК.ЦветаФормыРМК();

	ЗаголовокКнопкиДействия = НСтр("ru = 'Выбрать карту'");
	НастроитьТиповыеГорячиеКлавиши();
	НастроитьГорячиеКлавиши();
	ОбщегоНазначенияРМК.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

	НоваяКартаКодСтраны = "+7";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульРасширенныйВводКонтактнойИнформации = ОбщегоНазначения.ОбщийМодуль("Обработки.РасширенныйВводКонтактнойИнформации");
		ПодсказкиПриВводеТелефона = МодульРасширенныйВводКонтактнойИнформации.ПодсказкиПриВводеТелефона();
		НоваяКартаКодСтраны = ПодсказкиПриВводеТелефона.КодСтраны;	
	КонецЕсли;
	
	ЗаполнитьПервоначальныеДанныеЛокально();
	НастроитьКомандыВРежимеКассыСамообслуживания();
	
	БезЗаменяемыхКарт = Новый ФиксированнаяСтруктура("ОтметкаЗамена", Ложь);
	Элементы.ТаблицаДанных.ОтборСтрок = БезЗаменяемыхКарт;
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыСтрокиКартыПоДаннымРМК(СтрокаКарты, ДанныеРМК)
	ЗаполнитьЗначенияСвойств(СтрокаКарты, ДанныеРМК);
	СтрокаКарты.ПокупательФИО = ДанныеРМК.ФИО;
	СтрокаКарты.ПокупательПочта = ДанныеРМК.АдресЭПВладельцаКарты;
	СтрокаКарты.ДатаРождения = ДанныеРМК.ДатаРождения;
	СтрокаКарты.НомерТелефона = ДанныеРМК.НомерТелефонаВладельцаКарты;
	СтрокаКарты.ПродажиОборот = ДанныеРМК.СуммаПродаж;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если (ТекущееДействие = "Подтверждение" Или ТекущееДействие = "Просмотр")
		И ТаблицаДанных.Количество() = 1 Тогда
		СтрокаТаблицы = ТаблицаДанных.Получить(0);
		ЗаполнитьДанныеВыбраннойКарты(СтрокаТаблицы);
		НастроитьЭлементыФормыКлиент();
	ИначеЕсли ТекущееДействие = "ОтправкаЧека" Тогда
		НастроитьЭлементыФормыКлиент();
	ИначеЕсли ЗначениеЗаполнено(Контрагент) Тогда
		ТекущееДействие = "Поиск";
		УстановитьВыбранногоКонтрагента(Контрагент, Неопределено);
	Иначе
		ПереключитьНаСтраницуПоискаКарты();
		ЗаполнитьНастройкиВидаКарты();
	КонецЕсли;
	
	ОбновитьМаскуВводаНомераТелефона();
	Если ИспользоватьЦифровуюКлавиатуру Тогда
		Элементы.ЗапятаяУниверсальнаяКлавиатура.Заголовок = ИнтерфейсРМКСлужебныйКлиент.ПолучитьСимволЗвездочка();
	КонецЕсли;
	
	Если ИспользоватьСерверЛояльностиПолучательДанных 
		И ТаблицаВидыКарт.Количество() = 0 Тогда
		ЗаполнитьПервоначальныеДанныеСерверЛояльности();
	ИначеЕсли ТаблицаВидыКарт.Количество() = 1 Тогда		
		НоваяКартаВидКарты = ТаблицаВидыКарт[0].Идентификатор;
		ЗаполнитьНастройкиВидаКарты();
	КонецЕсли;
	
	Если ТекущееДействие = "Поиск"
		И ЗначениеЗаполнено(СтрокаПоиска) Тогда
		ВыполнитьПоискКарты(СтрокаПоиска);
	КонецЕсли;
	

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" Тогда
		
		Если ИмяСобытия = "ScanData" Тогда
			
			Штрихкод = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			Если ТекущееДействие = "СозданиеКарты" Тогда
				НоваяКартаНомер = Штрихкод;
			ИначеЕсли ПоискДоступен() Тогда
				СтрокаПоиска = Штрихкод;
				ВыполнитьПоискКарты(Штрихкод);
			КонецЕсли;
			
		ИначеЕсли ИмяСобытия = "ScanDataBase64" Тогда
			
			ШтрихкодBase64 = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			МенеджерОборудованияРМККлиентСервер.Base64ВШтрихкод(ШтрихкодBase64, Штрихкод);
			Если ТекущееДействие = "СозданиеКарты" Тогда
				НоваяКартаНомер = Штрихкод;
			ИначеЕсли ПоискДоступен() Тогда
				СтрокаПоиска = Штрихкод;
				ВыполнитьПоискКарты(Штрихкод);
			КонецЕсли;
			
		ИначеЕсли ИмяСобытия = "TracksData" И ИспользуетсяСчитывательМагнитныхКарт Тогда
			Если ТекущееДействие = "СозданиеКарты" Тогда
				НоваяКартаНомер = Параметр[0];
			ИначеЕсли ПоискДоступен() Тогда
				СтрокаПоиска = Параметр[0];
				ВыполнитьПоискКарты(СтрокаПоиска);
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
				
	Иначе
		
		ОбработатьОповещениеНаСервере = Ложь;
		ОбщегоНазначенияРМККлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник,
			ОбработатьОповещениеНаСервере);
		
		Если ОбработатьОповещениеНаСервере Тогда
			ОбработкаОповещенияНаСервере(ИмяСобытия, Параметр, Источник);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ОбщегоНазначенияРМККлиент.ИспользоватьВнешнееСобытие() И ПоискДоступен() Тогда
		
		Если Событие = "Штрихкод" Или Событие = "ПолученШтрихкод" Или Событие = "ScanData" Тогда
			ВыполнитьПоискКарты(Данные);
		ИначеЕсли Событие = "TracksData" Или Событие = "ДанныеКарты" Тогда
			ВыполнитьПоискКарты(Данные);
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоваяКартаВидКартыПриИзменении(Элемент)
	ЗаполнитьНастройкиВидаКарты();
	НастроитьЭлементыФормыКлиент();
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаВидКартыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьПотерюФокусаДатыРождения();
	ЭлементВФокусе = Элемент;
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаНомерАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СменитьЭлементВводаДанныхПокупателя(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаТелефонАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СменитьЭлементВводаДанныхПокупателя(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаФИОАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Не НеИспользоватьПодборФИО 
		И ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПодборФИО") Тогда
		АвтоПодбор(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;

	ОбработатьПотерюФокусаДатыРождения();
	ЭлементВФокусе = Элемент;
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаПочтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ОбработатьПотерюФокусаДатыРождения();
	ЭлементВФокусе = Элемент;
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаДатаРожденияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СменитьЭлементВводаДанныхПокупателя(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НайденнаяКартаВидКартыПриИзменении(Элемент)
	ЗаполнитьНастройкиВидаКарты();
КонецПроцедуры

&НаКлиенте
Процедура НайденнаяКартаВидКартыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьПотерюФокусаДатыРождения();
	ЭлементВФокусе = Элемент;
КонецПроцедуры

&НаКлиенте
Процедура НайденнаяКартаНомерАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СменитьЭлементВводаДанныхПокупателя(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НайденнаяКартаТелефонАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СменитьЭлементВводаДанныхПокупателя(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НайденнаяКартаФИОАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Не НеИспользоватьПодборФИО 
		И ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПодборФИО") Тогда
		АвтоПодбор(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;

	ОбработатьПотерюФокусаДатыРождения();
	ЭлементВФокусе = Элемент;
	
КонецПроцедуры

&НаКлиенте
Процедура НайденнаяКартаПочтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ОбработатьПотерюФокусаДатыРождения();
	ЭлементВФокусе = Элемент;
КонецПроцедуры

&НаКлиенте
Процедура НайденнаяКартаДатаРожденияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СменитьЭлементВводаДанныхПокупателя(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СогласиеПолученоПриИзменении(Элемент)
	НастроитьЭлементыФормыКлиент();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	ПоискВыполнен = Ложь;
	Если НЕ РежимВыбораКонтрагента
		И НЕ ЗначениеЗаполнено(Контрагент) Тогда
		ЗакрытьБаннерПриНеобходимости();
	КонецЕсли;
	НастроитьЭлементыФормыКлиент();
КонецПроцедуры

&НаКлиенте
Процедура НайденнаяКартаКодПодтвержденияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПроверитьВведенныйКодПроверки(Текст)
КонецПроцедуры

&НаКлиенте
Процедура НайденнаяКартаДатаРожденияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ДатаРожденияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаКодПодтвержденияВведенныйИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПроверитьВведенныйКодПроверки(Текст)
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаДатаРожденияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ДатаРожденияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КодПроверкиИзSMSНайденнойКартыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СформироватьСообщениеИОтправитьSMS();
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаТелефонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ЗначениеДляВставки = ИнтерфейсРМКСлужебныйКлиентСервер.ТолькоЦифры(СтрокаПоиска);
	Если Лев(ЗначениеДляВставки, 1) = "7" Тогда
		ЗначениеДляВставки = Прав(ЗначениеДляВставки, СтрДлина(ЗначениеДляВставки) - 1);
	КонецЕсли;
	
	ВставитьСимволыВРедактируемоеПоле(Элемент, ЗначениеДляВставки);
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаФИОНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ЗначениеДляВставки = СтрокаПоиска;
	ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, Элемент,
		ЗначениеДляВставки);
	Если Не НеИспользоватьПодборФИО 
		И ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПодборФИО") Тогда
		АвтоПодбор(Элемент, НоваяКартаФИО, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЭлементВФокусе = Элемент;
	Если ПоискВыполнен Тогда
		ПоискВыполнен = Ложь;
		ЗакрытьБаннерПриНеобходимости();
		НастроитьЭлементыФормыКлиент();
		СтрокаПоиска = Текст;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаНомерНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ЗначениеДляВставки = ИнтерфейсРМКСлужебныйКлиентСервер.ТолькоЦифры(СтрокаПоиска);
	
	ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, Элемент,
		ЗначениеДляВставки);
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если ТребуетсяНастройкаКнопокЦифровойПанели(Текст) И ИспользоватьЦифровуюКлавиатуру Тогда
		НастроитьКнопкиЦифровойПанели(Текст);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаНомерПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(НоваяКартаВидКарты) Тогда
		ВидКартыЗаполнен = Ложь;
		ЗаполнитьВидКарты(НоваяКартаНомер, ВидКартыЗаполнен);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБаннерНажатие(Элемент)
	БаннерОткрыт = Ложь;
	НастроитьЭлементыФормыКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаЧекаТелефонАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СменитьЭлементВводаДанныхПокупателя(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаЧекаПочтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СменитьЭлементВводаДанныхПокупателя(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтправитьСМСНажатие(Элемент)
	СформироватьСообщениеИОтправитьSMS();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДанных

&НаКлиенте
Процедура ТаблицаДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ОбработатьВыборСтроки(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхПриИзмененииСоставаВыделенныхСтрок(Элемент)
	
	ВыделенныеСтроки = Элементы.ТаблицаДанных.ПолучитьСтрокиДляОбработки();
	Если ВыделенныеСтроки = Неопределено Тогда
		ВыделенныеСтроки = Новый Массив;
	КонецЕсли;
	ВыделенаКартаНачисления = Ложь;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		СтрокаДанных = ТаблицаДанных.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если СтрокаДанных.Отметка Тогда
			ВыделенаКартаНачисления = Истина;
		КонецЕсли;
	КонецЦикла;
	ОбъединениеДоступно = ОдинВладелец 
		И ВыделенныеСтроки.Количество() > 1
		И ВыделенаКартаНачисления;
	Элементы.ТаблицаДанныхОбъединитьИВыбрать.Видимость = ОбъединениеДоступно;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоискНаСервереЛояльности(Команда)
	
	ВыполнитьПоискКарты(СтрокаПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКарту(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаДанных.ТекущиеДанные;
	
	Если Не ОдинВладелец Тогда
		ОбработатьВыборСтроки(ТекущиеДанные);
		Возврат;
	КонецЕсли;
	
	СтрокиТаблицы = ТаблицаДанных.НайтиСтроки(Новый Структура("Отметка", Истина));
	Если СтрокиТаблицы.Количество() > 0 Тогда
		СтрокаНачисления = СтрокиТаблицы[0];
	КонецЕсли;
	
	Если НЕ СтрокаНачисления = ТекущиеДанные
		И ИспользоватьОплатуБонусами Тогда
		ОбработатьВыборСтроки(СтрокаНачисления, ТекущиеДанные);
	Иначе
		ОбработатьВыборСтроки(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Объединить(Команда)
	
	ВыполнитьОбъединение();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбъединение(СтрокиДляОбработки = Неопределено)
	
	Если ИспользоватьСерверЛояльностиПолучательДанных Тогда
		ОбъединитьДисконтныеКартыСерверЛояльности(СтрокиДляОбработки);
	Иначе
		СтруктураОтвета = Новый Структура("Error, ErrorMessage", Ложь, "");
		ОбъединитьДисконтныеКартыЛокально(СтруктураОтвета);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьНаНовуюКарту(Команда)
	РежимЗаменыКарты = Истина;
	СтрокиУдалить = Новый Массив;
	Для Каждого СуществующиеСтрока Из ТаблицаДанных Цикл
		Если СуществующиеСтрока.Отметка Тогда
			СуществующиеСтрока.Отметка = Ложь;
		Иначе
			СтрокиУдалить.Добавить(СуществующиеСтрока);
		КонецЕсли;
	КонецЦикла;
	НоваяКартаДатаРождения = НайденнаяКартаДатаРождения;
	МаскаТелефона = ИнтерфейсРМКСлужебныйКлиентСервер.МаскаВводаТелефона();
	Телефон = ИнтерфейсРМКСлужебныйКлиентСервер.ПривестиЗначениеКМаскеТелефона(НайденнаяКартаТелефон,
				МаскаТелефона);
	НоваяКартаТелефон = Телефон;
	НоваяКартаПочта = НайденнаяКартаПочта;
	НоваяКартаФИО = НайденнаяКартаФИО;
	
	ПереключитьНаСтраницуСозданияКарты();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартуНачисления(Команда)
 	УстановитьОсновнуюКарту();
КонецПроцедуры

&НаКлиенте
Процедура ВыборКонтрагента(Команда)
	ОткрытьФормуВыбораКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСогласияНаОбработкуПД(Команда) 
	
	ТабличныйДокументСогласиеПД = ПолучитьТабличныйДокументСогласияПДНаСервере();
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ПереданныйТабличныйДокумент", ТабличныйДокументСогласиеПД);
	ПараметрыОткрытия.Вставить("ПредставлениеДокумента", НСтр("ru = 'Согласие на обработку персональных данных'"));
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаПечатногоДокумента", 
		ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьТекущееДействие(Команда)
	ВыполнитьДействиеГлавнойКоманды();
КонецПроцедуры
	
&НаКлиенте
Процедура ПерейтиКСозданиюКарты(Команда)
	ПереключитьНаСтраницуСозданияКарты();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьSMSСКодомПроверки(Команда)
	СформироватьСообщениеИОтправитьSMS();
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если ТекущееДействие = "СозданиеКарты" Тогда
		Если ТекущийШагСозданияКарты <= 0 Тогда
			ПереключитьНаСтраницуПоискаКарты();
		Иначе
			ТекущийШагСозданияКарты = Макс(ТекущийШагСозданияКарты - 1, 0);
		КонецЕсли;
	Иначе
		ОчиститьДанныеКарты();
		ПереключитьНаСтраницуПоискаКарты();
	КонецЕсли;
	БаннерОткрыт = Ложь;
	ЭлементВФокусе = Неопределено;
	НастроитьЭлементыФормыКлиент();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтменить(Команда)
	Если ЭлектронныйЧек Или ПодключенаОблачнаяККТ Тогда
		ТекущееДействие = "ОтправкаЧека";
		НастроитьЭлементыФормыКлиент();
	Иначе
		ВернутьРезультатОтказаОтВвода();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВернутьРезультатОтказаОтВвода()
	Результат = Новый Структура("ОтказОтВводаКарты, Контрагент", Истина, Контрагент);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьКарту(Команда)
	ВключеноРедактировниеКарты = Истина;
	НастроитьЭлементыФормыКлиент();
КонецПроцедуры

#Область ЦифроваяКлавиатура

&НаКлиенте
Процедура Подключаемый_ЦифраУниверсальнаяКлавиатура(Команда)
	ОбработатьЦифруЦифровойКлавиатуры(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыОчистить();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьПоследнееУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДваНуляУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуДваНуляЦифровойКлавиатуры();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапятаяУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыЗвездочкаЗапятая();
КонецПроцедуры

&НаКлиенте
Процедура ПоискУниверсальнаяКлавиатура(Команда)
	ВыполнитьПоискКарты(СтрокаПоиска);
КонецПроцедуры


&НаКлиенте
Процедура ГорячаяКлавишаEnter(Команда)
	
	ОбработатьГорячуюКлавишуEnter();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ХочуБумажныйЧек(Команда)
	ЗаполнитьРезультатОтправкаЧека(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВводыКарты(Команда)
	Результат = Новый Структура;
	Результат.Вставить("ОтменитьВводыКарты", Истина);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСозданиеКарты(Команда)
	ОтменитьСозданиеКартыКлиент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьДействиеГлавнойКоманды()
	ОшибкаСервераЛояльности = "";
	Если ТекущееДействие = "Поиск" Тогда
		Если РежимКассыСамообслуживания Тогда
			СтрокаПоиска = СтрЗаменить(СтрокаПоиска, "*", "");
		КонецЕсли;
		СтрокиНеЗамена = ТаблицаДанных.НайтиСтроки(Новый Структура("ОтметкаЗамена", Ложь));
		
		Если СохранитьТолькоНомерКарты Тогда
			РезультатПоиска = ПолучитьРезультатПоискаКарты();
			Закрыть(РезультатПоиска);
		ИначеЕсли СтрокиНеЗамена.Количество() = 0 Тогда
			ВыполнитьПоискКарты(СтрокаПоиска);
		Иначе
			ВыбратьТекущуюКарту();
		КонецЕсли;
	ИначеЕсли ТекущееДействие = "Подтверждение" Тогда
		
		Если ОтправлятьSMSКодПриПродаже И ЭтоИменнаяКарта И НЕ НомерТелефонаПодтвержден Тогда
			СформироватьСообщениеИОтправитьSMS();
		ИначеЕсли РежимЗаменыКарты Тогда
			Оповещение = Новый ОписаниеОповещения("ВыполнитьЗаменуИЗакрытьФрму", ЭтотОбъект);
			
		Иначе
			РезультатПоиска = ПолучитьРезультатПоискаКарты();
			Закрыть(РезультатПоиска);
		КонецЕсли;
		
	ИначеЕсли ТекущееДействие = "СозданиеКарты" Тогда
		ИнтерфейсРМКСлужебныйКлиент.СкорректироватьДатуРожденияПриНеобходимости(ЭтотОбъект, "НоваяКартаДатаРождения");
		
		Если ОтправлятьSMSКодПриЗаведенииКарты И ЭтоИменнаяКарта И НЕ НомерТелефонаПодтвержден Тогда
			СформироватьСообщениеИОтправитьSMS();
		Иначе
			ОписаниеОшибок = ОшибкиЗаполненияПриСозданииКартыЛояльности();
			Если ОписаниеОшибок.ЕстьОшибки Тогда
				ОшибкаСервераЛояльности = ОписаниеОшибок.ТекстПояснения;
				БаннерОткрыт = Истина;
			Иначе
				ВсегоШагов = ?(СогласиеТребуется, 2, 1);
				ЭтоПоследняяСтраница = ТекущийШагСозданияКарты >= ВсегоШагов - 1;
				Если ЭтоПоследняяСтраница Тогда
					СоздатьКарту();
				Иначе
					ТекущийШагСозданияКарты = ТекущийШагСозданияКарты + 1;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТекущееДействие = "ОтправкаЧека" Тогда
		ЗаполнитьРезультатОтправкаЧека();
	КонецЕсли;
	НастроитьЭлементыФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураРеквизитовФормыРМК()
	ИменаРеквизитовФормыРМК = "ИмяФормы, ФильтрПоискаПоШтрихкоду";
	
	СтруктураРеквизитовФормыРМК = Новый Структура(ИменаРеквизитовФормыРМК);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормыРМК, ЭтотОбъект, ИменаРеквизитовФормыРМК);
	Возврат СтруктураРеквизитовФормыРМК;
КонецФункции

&НаКлиенте
Процедура ВыполнитьПоискКарты(СтрокаПоискаШтрихкод)
	
	ШтрихкодПоиска = СтрокаПоискаШтрихкод;
	БаннерОткрыт = Ложь;
	СтрокиКромеЗамены = ТаблицаДанных.НайтиСтроки(Новый Структура("ОтметкаЗамена", Ложь));
	Для Каждого Строка Из СтрокиКромеЗамены Цикл
		ТаблицаДанных.Удалить(Строка);
	КонецЦикла;
	НомерТелефонаПодтвержден = Ложь;
	КодПроверкиИзSMS = Неопределено;
	ПараметрыДляОбработкиШтрихкода = Новый Структура();
	
	ФильтрПоискаПоШтрихкоду = Новый Структура;
	
	ПоследниеЦифрыТелефона = Сред(ШтрихкодПоиска, 2);
	Если СтрНачинаетсяС(ШтрихкодПоиска, ИнтерфейсРМКСлужебныйКлиент.ПолучитьСимволЗвездочка())
		И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПоследниеЦифрыТелефона) Тогда
		
		Если ИспользоватьСерверЛояльностиПолучательДанных Тогда
			ФильтрПоискаПоШтрихкоду.Вставить("ШаблонНомерТелефонаСЛ");
			ФильтрПоискаПоШтрихкоду.Вставить("ПоследниеЦифрыТелефонаСЛ");
		Иначе
			ФильтрПоискаПоШтрихкоду.Вставить("ШаблонНомерТелефона");
			ФильтрПоискаПоШтрихкоду.Вставить("ПоследниеЦифрыТелефона");
		КонецЕсли;
		ШтрихкодПоиска = "%" + ПоследниеЦифрыТелефона;
		
	Иначе
		ФильтрПоискаПоШтрихкоду.Вставить("ИнформационныеКарты");
	КонецЕсли;
	
	Если ИспользоватьСерверЛояльностиПолучательДанных Тогда
		ФильтрПоискаПоШтрихкоду.Вставить("ДанныеПокупателя");
	КонецЕсли;
	ФильтрПоискаПоШтрихкоду.Вставить("Покупатель", Контрагент);
	
	ИменаРеквизитовОбъектаФормыРМК = ОбщегоНазначенияРМККлиент.ИменаРеквизитовОбъектаФормыРМКДляДобавленияСтроки();
	СтруктураРеквизитовОбъектаФормыРМК = Новый Структура(ИменаРеквизитовОбъектаФормыРМК);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовОбъектаФормыРМК, Объект, ИменаРеквизитовОбъектаФормыРМК);

	СтруктураПараметровКлиента = ДанныеПоискаПоШтрихкодуСерверБезКонтекста(ШтрихкодПоиска, СтруктураРеквизитовФормыРМК());

	ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента, ПараметрыДляОбработкиШтрихкода);
	
	ПоискВыполнен = Истина;
	СтрокиКромеЗамены = ТаблицаДанных.НайтиСтроки(Новый Структура("ОтметкаЗамена", Ложь));
	ОтображатьОшибку = ОшибкаСервераЛояльности <> "";
	
	Если ОтображатьОшибку
		И СтрокиКромеЗамены.Количество() = 0 Тогда
		ПереключитьНаСтраницуСообщения();
		Если СохранятьНомерКартыЛояльности() Тогда
			СохранитьТолькоНомерКарты = Истина;
		КонецЕсли;
	ИначеЕсли СтрокиКромеЗамены.Количество() = 0 Тогда
		ПереключитьНаСтраницуСообщения();
	ИначеЕсли СтрокиКромеЗамены.Количество() = 1
		Или РежимКассыСамообслуживания Тогда
		ПереключитьНаСтраницуПодтвержденияДанныхПокупателя();
	ИначеЕсли СтрокиКромеЗамены.Количество() > 1 Тогда
		БаннерОткрыт = Истина;
		ПереключитьНаСтраницуПоискаКарты();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПоискаПоШтрихкодуСерверБезКонтекста(Знач Штрихкод, Знач РеквизитыФормыРМК)
	
	ДанныеШтрихкода = Новый Структура;
	РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьДанныеПоискаПоШтрихкоду(Штрихкод, РеквизитыФормыРМК, ДанныеШтрихкода);	
	Возврат ДанныеШтрихкода;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораКонтрагента()
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗавершитьВыборПокупателя", ЭтотОбъект);
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОписаниеОповещенияОЗакрытии", ОповещениеОЗакрытии);
	
	СтандартнаяОбработка = Истина;
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуВыбораКонтрагента(СтруктураПараметров, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("ИсключитьФизЛиц", ЭтоРаботаСАвансом);
		ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаВыбораПокупателя", ПараметрыФормыВыбора, ЭтотОбъект,,,,
			ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца,РежимОтображенияОкнаФормы.ВОсновномОкне);
			
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокументСогласияПДНаСервере()
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ДанныеПокупателя = Новый Структура();
	ДанныеПокупателя.Вставить("Организация", Объект.Организация);
	ДанныеПокупателя.Вставить("Ответственный", Объект.ПользовательБД);
	ДанныеПокупателя.Вставить("ФИО", НоваяКартаФИО);
	ДанныеПокупателя.Вставить("Телефон", НоваяКартаТелефон);
	ДанныеПокупателя.Вставить("Почта", НоваяКартаПочта);
	ДанныеПокупателя.Вставить("ДатаРождения", НоваяКартаДатаРождения);
	ОбщегоНазначенияРМКПереопределяемый.СформироватьТабличныйДокументСогласияНаОбработкуПерсональныхДанных(ТабличныйДокумент, ДанныеПокупателя);
	Возврат ТабличныйДокумент;
КонецФункции

&НаКлиенте
Процедура ВыбратьТекущуюКарту()
	
	ТекущиеДанные = Элементы.ТаблицаДанных.ТекущиеДанные;
	ВыделенныеСтроки = Элементы.ТаблицаДанных.ПолучитьСтрокиДляОбработки();
	Если ВыделенныеСтроки = Неопределено Тогда
		ВыделенныеСтроки = Новый Массив;
	КонецЕсли;
	СтрокиДляНачисления = ТаблицаДанных.НайтиСтроки(Новый Структура("Отметка", Истина));
	
	Если ТекущиеДанные <> Неопределено Тогда		
		ОбработатьВыборСтроки(ТекущиеДанные);
		Возврат;
	ИначеЕсли ТекущиеДанные = Неопределено 
		И ТаблицаДанных.Количество() = 1 Тогда
		ТекущиеДанные = ТаблицаДанных[0];
		ОбработатьВыборСтроки(ТекущиеДанные);
		Возврат;
	ИначеЕсли ТекущиеДанные = Неопределено 
		И ВыделенныеСтроки.Количество() = 1 Тогда
		ТекущиеДанные = ТаблицаДанных.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
		ОбработатьВыборСтроки(ТекущиеДанные);
		Возврат;
	ИначеЕсли ТекущиеДанные = Неопределено 
		И ВыделенныеСтроки.Количество() = 0
		И СтрокиДляНачисления.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для продолжения требуется выделить одну из найденных карт'"),,"ТаблицаДанных");
		Возврат;
	КонецЕсли;
	
	Если СтрокиДляНачисления.Количество() > 0 Тогда
		СтрокаНачисления = СтрокиДляНачисления[0];
	КонецЕсли;
	
	МассивСтрокСписания = Новый Массив;
	СписаниеСНесколькихКарт = Ложь;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		ОписаниеКарты = ТаблицаДанных.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ОписаниеКарты.Покупатель = СтрокаНачисления.Покупатель Тогда
			Продолжить;
		КонецЕсли;
		МассивСтрокСписания.Добавить(ОписаниеКарты);
		Если НЕ ОписаниеКарты = СтрокаНачисления Тогда
			СписаниеСНесколькихКарт = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если СписаниеСНесколькихКарт Тогда
		ОбработатьВыборСтроки(СтрокаНачисления, МассивСтрокСписания);
	Иначе
		ОбработатьВыборСтроки(СтрокаНачисления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРезультатПоискаКарты(СтрокаДляНачисления = Неопределено, СтрокиДляСписания = Неопределено)
	
	
	Если ЗакрытьБезИзмененияФормы Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДисконтнойКарты = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыКартыЛояльности();
	РеквизитыДисконтнойКарты.Вставить("БонуснаяПрограмма",Неопределено);
	РеквизитыДисконтнойКарты.Вставить("МаксимальныйПроцентОплаты",0);
	РеквизитыДисконтнойКарты.Вставить("Контрагент", Контрагент);
	РеквизитыДисконтнойКарты.Вставить("СуммаПродаж", 0);
	РеквизитыДисконтнойКарты.Вставить("КартаНедействительна", Ложь);
	
	РеквизитыДисконтнойКарты.Вставить("КурсБонусов", 1);
	РеквизитыДисконтнойКарты.Вставить("Карта", Неопределено);
	РеквизитыДисконтнойКарты.Вставить("НомерКарты", "");
	РеквизитыДисконтнойКарты.Вставить("СписатьБаллыПоВладельцу",Ложь);
	РеквизитыДисконтнойКарты.Вставить("ОстатокБонусныхБаллов",0);
	РеквизитыДисконтнойКарты.Вставить("КоличествоБонусовОграничение",0); 
	
	СтруктураВозврата = Новый Структура("ОтказОтВводаКарты, Контрагент", Ложь, Контрагент);
	Если СохранитьТолькоНомерКарты Тогда
		
		РеквизитыДисконтнойКарты.КодКарты = СтрокаПоиска;
		СтруктураВозврата.Вставить("РеквизитыДисконтнойКарты", РеквизитыДисконтнойКарты);
		Возврат СтруктураВозврата;
	КонецЕсли;
	ЗапроситьДанныеБонусов();
	СтрокаНачисления = СтрокаДляНачисления;
	Если СтрокаДляНачисления = Неопределено Тогда 
		СтрокиНачисления = ТаблицаДанных.НайтиСтроки(Новый Структура("Отметка", Истина));
		Если СтрокиНачисления.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		СтрокаНачисления = СтрокиНачисления[0];
	КонецЕсли;
	
	СтрокиСписания = СтрокиДляСписания;
	Если СтрокиДляСписания = Неопределено Тогда
		СтрокиСписания = Новый Массив; 
		ВыбранныеСтроки = Элементы.ТаблицаДанных.ПолучитьСтрокиДляОбработки();
		Если ВыбранныеСтроки = Неопределено Тогда
			ВыбранныеСтроки = Новый Массив;
		КонецЕсли;
		Для Каждого ИдентификаторСтроки Из ВыбранныеСтроки Цикл
			СтрокаТаблицы = ТаблицаДанных.НайтиПоИдентификатору(ИдентификаторСтроки);
			Если СтрокаТаблицы.ОстатокБонусныхБаллов > 0
				И НЕ СтрокаТаблицы.КартаНедействительна Тогда
				СтрокиСписания.Добавить(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РеквизитыДисконтнойКарты = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыКартыЛояльности();
	
	РеквизитыДисконтнойКарты.ИдентификаторКарты 	= СтрокаНачисления.ИдентификаторКарты;
	РеквизитыДисконтнойКарты.КодКарты 			= СтрокаНачисления.КодКарты;
	РеквизитыДисконтнойКарты.ФИО 					= СтрокаНачисления.ПокупательФИО;
	РеквизитыДисконтнойКарты.НомерТелефонаВладельцаКарты = СтрокаНачисления.НомерТелефона;
	РеквизитыДисконтнойКарты.АдресЭПВладельцаКарты = СтрокаНачисления.ПокупательПочта;
	РеквизитыДисконтнойКарты.ДатаРождения 		= СтрокаНачисления.ДатаРождения;
	РеквизитыДисконтнойКарты.ЭтоКомпания 			= Не СтрокаНачисления.ФизическоеЛицо;

	Если СтрокиСписания.Количество() = 1 Тогда
		РеквизитыДисконтнойКарты.Вставить("БонуснаяПрограмма",СтрокиСписания[0].ИдентификаторБонуснойПрограммы);
		РеквизитыДисконтнойКарты.Вставить("МаксимальныйПроцентОплаты",СтрокиСписания[0].МаксимальныйПроцентОплаты);
	Иначе
		РеквизитыДисконтнойКарты.Вставить("БонуснаяПрограмма",СтрокаНачисления.ИдентификаторБонуснойПрограммы);
		РеквизитыДисконтнойКарты.Вставить("МаксимальныйПроцентОплаты",СтрокаНачисления.МаксимальныйПроцентОплаты);
	КонецЕсли;
	РеквизитыДисконтнойКарты.ЭтоБонуснаяКарта = ЗначениеЗаполнено(РеквизитыДисконтнойКарты.БонуснаяПрограмма);

	Если ЗначениеЗаполнено(СтрокаНачисления.ДисконтнаяКарта) Тогда
		РеквизитыДисконтнойКарты.Вставить("КартаЛояльности", СтрокаНачисления.ДисконтнаяКарта);
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаНачисления.Покупатель) Тогда
		РеквизитыДисконтнойКарты.Вставить("Контрагент", СтрокаНачисления.Покупатель);
	ИначеЕсли ЗначениеЗаполнено(Контрагент) Тогда
		РеквизитыДисконтнойКарты.Вставить("Контрагент", Контрагент);
	КонецЕсли;

	РеквизитыДисконтнойКарты.Вставить("СуммаПродаж", СтрокаНачисления.ПродажиОборот);
	РеквизитыДисконтнойКарты.Вставить("КартаНедействительна", СтрокаНачисления.КартаНедействительна);
	
	РеквизитыДисконтнойКарты.Вставить("КурсБонусов", СтрокаНачисления.КурсБонусов);
	РеквизитыДисконтнойКарты.Вставить("Карта", СтрокаНачисления.ДисконтнаяКарта);
	РеквизитыДисконтнойКарты.Вставить("НомерКарты", СтрокаНачисления.КодКарты);
	РеквизитыДисконтнойКарты.Вставить("СписатьБаллыПоВладельцу",СписатьБаллыПоВладельцу);
	РеквизитыДисконтнойКарты.Вставить("ОстатокБонусныхБаллов",СтрокаНачисления.ОстатокБонусныхБаллов);
	РеквизитыДисконтнойКарты.Вставить("КоличествоБонусовОграничение",СтрокаНачисления.КоличествоОстатокЛимит);
	

	МассивВыбранныхКарт = Новый Массив;
	Для Каждого СтрокаТаблицы Из СтрокиСписания Цикл
		СтруктураСтрокиКарты = ЗаполнитьДанныеСтрокиМассива(СтрокаТаблицы);
		МассивВыбранныхКарт.Добавить(СтруктураСтрокиКарты);
	КонецЦикла;
	Если МассивВыбранныхКарт.Количество() > 0 Тогда
		РеквизитыДисконтнойКарты.СписатьБаллыПоВладельцу = Истина;
	КонецЕсли;	
	СтруктураВозврата.Вставить("РеквизитыДисконтнойКарты", РеквизитыДисконтнойКарты);
	СтруктураВозврата.Вставить("МассивВыбранныхКарт", МассивВыбранныхКарт);
	Если РеквизитыДисконтнойКарты.Свойство("КартаЛояльности") Тогда
		СтруктураВозврата.Вставить("КартаЛояльности", РеквизитыДисконтнойКарты.КартаЛояльности);
	КонецЕсли;
	Если РеквизитыДисконтнойКарты.Свойство("Контрагент") Тогда
		СтруктураВозврата.Вставить("Контрагент", РеквизитыДисконтнойКарты.Контрагент);
	Иначе
		СтруктураВозврата.Вставить("Контрагент", Контрагент);
	КонецЕсли;
	
	ОбщегоНазначенияРМККлиентПереопределяемый.ДополнитьРезультатПоискаКарты(ЭтотОбъект, СтруктураВозврата);
	
	Возврат СтруктураВозврата;
КонецФункции

&НаКлиенте
Процедура СоздатьКарту()
		
	Если ОтправлятьSMSКодПриЗаведенииКарты 
		И НЕ НомерТелефонаПодтвержден Тогда
		ТекстСообщения = НСтр("ru = 'Требуется ввести корректный проверочный код из SMS'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"КодПроверкиИзSMSНовойКарты", "КодПроверкиИзSMS");
	Иначе
		СоздатьКартуКлиент();
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПереключитьНаСтраницуСозданияКарты()
	
	ЗакрытьБезИзмененияФормы = Ложь;
	ТекущееДействие = "СозданиеКарты";
	Контрагент = Неопределено;
	ТекущийШагСозданияКарты = 0;
	Если ВидыКартЗаполнены Тогда
		БаннерОткрыт = Истина;
	КонецЕсли;

	ЭлементВФокусе = Элементы.НоваяКартаТелефон;
	Если ОтправлятьSMSКодПриЗаведенииКарты Тогда
		ПараметрыВводаКодаSMS = ПараметрыПроверкиПоSMSКоду();
		ПараметрыВводаКодаSMS.ВариантПроверки = "ПриЗаведенииКарты";
		НомерТелефонаПодтвержден = Ложь;
		КодПроверкиИзSMS = Неопределено;
		ОбновитьСостояниеПроверкиСМСНаФорме();
	КонецЕсли;
	НастроитьЭлементыФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНаСтраницуСообщения()
	
	БаннерОткрыт = Истина;
	НастроитьЭлементыФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНаСтраницуПодтвержденияДанныхПокупателя()
	
	ТекущееДействие = "Подтверждение";
	Если РежимЗаменыКарты Тогда
		БаннерОткрыт = Истина;
	ИначеЕсли РежимВыбораКонтрагента 
		И НЕ ЗначениеЗаполнено(Контрагент) Тогда
		БаннерОткрыт = Истина;
	КонецЕсли;
	Если ОтправлятьSMSКодПриПродаже Тогда
		ПараметрыВводаКодаSMS = ПараметрыПроверкиПоSMSКоду();
		ПараметрыВводаКодаSMS.ВариантПроверки = "ПриВыборе";
		СформироватьСообщениеИОтправитьSMS();
	Иначе
		НастроитьЭлементыФормыКлиент();
	КонецЕсли;
	
	ОбщегоНазначенияРМККлиентПереопределяемый.УправлениеДоступностьюПоляДоговор(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНаСтраницуПоискаКарты()
	
	ЗакрытьБезИзмененияФормы = Ложь;
	ТекущееДействие = "Поиск";
	Элементы.ДействияНаФорме.ТекущаяСтраница = Элементы.СтраницаВыбора;
	НастроитьЭлементыФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеКарты()
	ТаблицаДанных.Очистить();
	
	ПустаяСтрока = НСтр("ru = ''");
	
	НайденнаяКартаДатаРождения		= ПустаяСтрока;
	НайденнаяКартаНомер				= ПустаяСтрока;
	НайденнаяКартаПочта				= ПустаяСтрока;
	НайденнаяКартаТелефон			= ПустаяСтрока;
	НайденнаяКартаФИО				= ПустаяСтрока;
	НайденнаяКартаСуммаПродаж		= ПустаяСтрока;
	
	СписатьБаллыПоВладельцу = Ложь;
	БонуснаяПрограмма = ПустаяСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыФормыКлиент()

	Если НачальныйЗаголовокФормы = "" Тогда
		ЗаголовокФормы = НСтр("ru = 'Поиск карты лояльности'");
	Иначе
		ЗаголовокФормы = НачальныйЗаголовокФормы;
	КонецЕсли;
	БлокироватьПоиск = НЕ ПоискДоступен();
	ЗаблокироватьОсновнуюКнопку = Ложь;
	ВажностьОсновнойКнопки = ВажностьКнопки.Главная;
	ОформлениеБаннера = "Ошибка";
	ОтображатьОшибку = ОшибкаСервераЛояльности <> "";
	ДоступноСозданиеКартыВНижнейПанели = НЕ ОтображатьОшибку;
	СкрытьВсеДействия = Ложь;
	БумажныйЧекДоступен = Не ПодключенаОблачнаяККТ;

	СтрокиБезЗаменяемойКарты = ТаблицаДанных.НайтиСтроки(Новый Структура("ОтметкаЗамена", Ложь));
	ТребуетсяВыборКарты = ПоискВыполнен И СтрокиБезЗаменяемойКарты.Количество() > 1 И НЕ ОтображатьОшибку;
	ВидимостьКлавиатуры = ИспользоватьЦифровуюКлавиатуру;
	ВидимостьСпецСимволовКлавиатуры = Ложь;
	ВидимостьКнопкиНазад = Ложь;
	ВидимостьДополнительнойКнопкиПечатьПД = Ложь;
	ВидимостьЗаменыКартыНаНовую = Ложь;
	ВидимостьЗаменыКартыНаСуществующую = Ложь;
	ВидимостьРедактироватьКарту = Ложь;
	ВозможностьСоздатьКарту = (ОбщегоНазначенияРМККлиент.СоздаватьЛокальноКартуЛояльности()
		ИЛИ ИспользоватьСерверЛояльностиПолучательДанных) И НЕ РежимКассыСамообслуживания;
	ВидимостьКнопкиОтмена = Ложь;
	ВидимостьКонтрагента = Ложь;
	ВидимостьСтрокиПоиска = Истина;
	ВидимостьБудетЗамененаКарта = Ложь;
	ВидимостьКартаНеНайдена = Ложь;
	ВидимостьСохранитьКарту = Ложь;
	ВидимостьБудетСохраненНомерКарты = Ложь;
	ВидимостьОшибкаСервера  = Ложь;
	ВидимостьКонтрольРеквизитовСоздания = Ложь;
	ВидимостьНесколькоКарт = Ложь;
	ВидимостьНужноВыбратьКонтрагента = Ложь;
	ВидимостьКартаДолжнаБытьИменная = Ложь;
	ВертикальнаяГруппировка = ВертикальнаяОриентация;
	УбратьСимволыВвода = Ложь;
	ОтменитьВводыКарты = Ложь;
	ОтменитьСозданиеКарты = Ложь;
	
	Если ТекущееДействие = "Поиск" Тогда
		ВидимостьСпецСимволовКлавиатуры = Истина;
		Элементы.ДействияНаФорме.ТекущаяСтраница = Элементы.СтраницаВыбора;
		Если ТребуетсяВыборКарты Тогда 
			ЗаголовокКнопкиДействия = НСтр("ru = 'Выбрать карту'");
			ВидимостьКлавиатуры = НЕ ПоискВыполнен;
			ТекущийЭлемент = Элементы.ТаблицаДанных;
			Если ТаблицаДанных.Количество() > 0 Тогда
				Элементы.ТаблицаДанных.ТекущаяСтрока = ТаблицаДанных[0].ПолучитьИдентификатор();
			КонецЕсли;
		Иначе
			ЗаголовокКнопкиДействия = НСтр("ru = 'Найти карту'");
			СкрытьВсеДействия = Истина;
			ЭлементВФокусе = Элементы.СтрокаПоиска;
		КонецЕсли;
		Если РежимЗаменыКарты Тогда
			ЗаголовокФормы = НСтр("ru = 'Поиск карты лояльности на замену'");
		КонецЕсли;
		Если СохранитьТолькоНомерКарты Тогда
			ЗаголовокКнопкиДействия = НСтр("ru = 'Сохранить номер карты'");
		ИначеЕсли ПродолжатьБезКарты Тогда
			ВидимостьКнопкиОтмена = Истина;
		КонецЕсли;
		ВидимостьКонтрагента = Истина;
	ИначеЕсли ТекущееДействие = "Подтверждение" Тогда
		Элементы.ДействияНаФорме.ТекущаяСтраница = Элементы.СтраницаПодтверждения;
		ЭлементВФокусе = Неопределено;		
		ЗаголовокКнопкиДействия = НСтр("ru = 'Подтвердить выбор'");
		ЗаголовокФормы = НСтр("ru = 'Подтверждение выбора карты'");
		Если РежимЗаменыКарты Тогда
			ЗаголовокФормы = НСтр("ru = 'Подтверждение выбора карты на замену'");
		КонецЕсли;
		
		Если ДоступнаОтправкаSMS
			И НЕ НомерТелефонаПодтвержден 
			И ОтправлятьSMSКодПриПродаже Тогда
			Если ПараметрыВводаКодаSMS <> Неопределено 
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыВводаКодаSMS, "КодПодтверждения")
				И ЗначениеЗаполнено(ПараметрыВводаКодаSMS.КодПодтверждения) Тогда
				ЗаголовокКнопкиДействия = НСтр("ru = 'Отправить SMS-код повторно'");
				ЭлементВФокусе = Элементы.КодПроверкиИзSMSНайденнойКарты;
			Иначе
				ЗаголовокКнопкиДействия = НСтр("ru = 'Отправить SMS-код'");
			КонецЕсли;
			ВажностьОсновнойКнопки = ВажностьКнопки.Обычная;
		ИначеЕсли ДоступнаОтправкаSMS
			И ОтправлятьSMSКодПриПродаже Тогда
			ВидимостьЗаменыКартыНаНовую = РазрешитьЗаменуДисконтнойКарты И ВозможностьСоздатьКарту;
			ВидимостьЗаменыКартыНаСуществующую = РазрешитьЗаменуДисконтнойКарты;
			ВидимостьРедактироватьКарту = РазрешитьРедактированиеДисконтнойКарты;
		Иначе
			ВидимостьКлавиатуры = Ложь;
			ВидимостьЗаменыКартыНаНовую = РазрешитьЗаменуДисконтнойКарты 
				И ВозможностьСоздатьКарту
				И НЕ РежимЗаменыКарты;
			ВидимостьЗаменыКартыНаСуществующую = РазрешитьЗаменуДисконтнойКарты
				И НЕ РежимЗаменыКарты;
			ВидимостьРедактироватьКарту = РазрешитьРедактированиеДисконтнойКарты
				И НЕ РежимЗаменыКарты;
		КонецЕсли;
		
		ВидимостьДополнительнойКнопкиПечатьПД = СогласиеТребуется;
		ВидимостьКнопкиНазад = Истина;
		ВидимостьСтрокиПоиска = Ложь;
		ОтменитьВводыКарты = РежимКассыСамообслуживания;
		ДоступноСозданиеКартыВНижнейПанели = Ложь;
		ВидимостьКнопкиОтмена = ПродолжатьБезКарты И ЗначениеЗаполнено(НайденнаяКартаНомер);
	ИначеЕсли ТекущееДействие = "Просмотр" Тогда
		
		Элементы.ДействияНаФорме.ТекущаяСтраница = Элементы.СтраницаПодтверждения;
		УстановитьВидимостьЭлементаФормы(Элементы.ВыбратьКарту, Ложь);
		ЭлементВФокусе = Неопределено;
		ЗаголовокФормы = НСтр("ru = 'Данные карты лояльности'");
		
		ВидимостьДополнительнойКнопкиПечатьПД = СогласиеТребуется;
		ВидимостьКнопкиНазад = Ложь;
		ВидимостьСтрокиПоиска = Ложь;
		ОтменитьВводыКарты = Истина;
		ВидимостьКлавиатуры = Ложь;
		ДоступноСозданиеКартыВНижнейПанели = Ложь;
		
	ИначеЕсли ТекущееДействие = "СозданиеКарты" Тогда
		ЭлементВФокусе = Неопределено;
		ВсегоШагов = ?(СогласиеТребуется, 2, 1);
		Элементы.ДействияНаФорме.ТекущаяСтраница = Элементы.СтраницаСоздания;		
		ЗаголовокФормы = НСтр("ru = 'Создание карты лояльности'");
		ДоступноСозданиеКартыВНижнейПанели = Ложь;
		Если ТекущийШагСозданияКарты < ВсегоШагов - 1 Тогда
			ЗаголовокКнопкиДействия = НСтр("ru = 'Далее'");
		Иначе
			ЗаголовокКнопкиДействия = НСтр("ru = 'Создать карту'");
		КонецЕсли;
		
		Если ТекущийШагСозданияКарты = 0 Тогда
			ЗаголовокКнопкиНазад = НСтр("ru = 'Вернуться к поиску'");
		Иначе
			ЗаголовокКнопкиНазад = НСтр("ru = 'Назад'");
		КонецЕсли;
		
		Если ТекущийШагСозданияКарты = 0
			И ДоступнаОтправкаSMS
			И НЕ НомерТелефонаПодтвержден
			И ОтправлятьSMSКодПриЗаведенииКарты
			И ЭтоИменнаяКарта Тогда
			Если ПараметрыВводаКодаSMS <> Неопределено 
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыВводаКодаSMS, "КодПодтверждения")
				И ЗначениеЗаполнено(ПараметрыВводаКодаSMS.КодПодтверждения) Тогда
				ЗаголовокКнопкиДействия = НСтр("ru = 'Отправить SMS-код повторно'");
				ЭлементВФокусе = Элементы.КодПроверкиИзSMSНовойКарты;
				ВажностьОсновнойКнопки = ВажностьКнопки.Обычная;
			Иначе
				ЗаголовокКнопкиДействия = НСтр("ru = 'Отправить SMS-код'");
				ВажностьОсновнойКнопки = ВажностьКнопки.Обычная;
			КонецЕсли;
		ИначеЕсли ТекущийШагСозданияКарты = 0
			И ДоступнаОтправкаSMS
			И ОтправлятьSMSКодПриЗаведенииКарты
			И ЭтоИменнаяКарта Тогда
		ИначеЕсли ТекущийШагСозданияКарты = 0 Тогда

		Иначе
			ЗаблокироватьОсновнуюКнопку = СогласиеТребуется И НЕ СогласиеПолучено;
			ВидимостьКлавиатуры = Ложь;
		КонецЕсли;
		ВидимаяСтраница = Элементы.ГруппаШагиСоздания.ПодчиненныеЭлементы[ТекущийШагСозданияКарты];
		Элементы.ГруппаШагиСоздания.ТекущаяСтраница = ВидимаяСтраница;
		ВидимостьДополнительнойКнопкиПечатьПД = СогласиеТребуется;
		БлокироватьПоиск = Истина;
		ВидимостьКнопкиНазад = Истина;
		ВидимостьСтрокиПоиска = Ложь;
		ОтменитьСозданиеКарты = Истина;
		Элементы.Назад.Заголовок = ЗаголовокКнопкиНазад;
		
	ИначеЕсли ТекущееДействие = "ОтправкаЧека" Тогда
		Элементы.ДействияНаФорме.ТекущаяСтраница = Элементы.СтраницаВводаОтправкиЧека;
		Элементы.ОтправкаЧекаПочта.Видимость = Не РежимКассыСамообслуживания;
		ЗаголовокКнопкиДействия = НСтр("ru = 'Отправить чек'");
		Элементы.ХочуБумажныйЧек.Видимость = БумажныйЧекДоступен;
		ЗаголовокФормы = НСтр("ru = 'Отправка чека'");
		ВидимостьСтрокиПоиска = Ложь;
		МаскаТелефона = ИнтерфейсРМКСлужебныйКлиентСервер.МаскаВводаТелефона();
		Элементы.ОтправкаЧекаТелефон.Маска = МаскаТелефона;
		ВертикальнаяГруппировка = Истина;
		УбратьСимволыВвода = Истина;
		Элементы.ГруппаБерегитеЛес.Видимость = РежимКассыСамообслуживания И БумажныйЧекДоступен;
		Для Каждого ЭлементСтраница Из Элементы.ДействияНаФорме.ПодчиненныеЭлементы Цикл
			Если НЕ ЭлементСтраница = Элементы.СтраницаВводаОтправкиЧека Тогда
				ЭлементСтраница.Видимость = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
			УстановитьВыбранногоКонтрагента(Контрагент, Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущееДействие = "Подтверждение" 
		И РежимЗаменыКарты
		И НЕ ОтображатьОшибку Тогда
		ОформлениеБаннера = "Предупреждение";
		ВидимостьБудетЗамененаКарта = Истина;
	ИначеЕсли ТекущееДействие = "СозданиеКарты"
		И ЗначениеЗаполнено(ОшибкаСервераЛояльности) Тогда
		ВидимостьКонтрольРеквизитовСоздания = Истина;
		Элементы.ДекорацияНеЗаполненыРеквизитыКарты.Заголовок = 
			СтрШаблон(НСтр("ru = 'Ошибка контроля заполненности данных карты: %1'"), Символы.ПС + ОшибкаСервераЛояльности);
	ИначеЕсли ТекущееДействие = "Поиск" 
		И СохранитьТолькоНомерКарты Тогда
		ВидимостьБудетСохраненНомерКарты = Истина;
		ОформлениеБаннера = "Предупреждение";
	ИначеЕсли ТекущееДействие = "Поиск"
		И ОтображатьОшибку Тогда
		ОформлениеБаннера = "Ошибка";
		ВидимостьОшибкаСервера = Истина;
	ИначеЕсли ТекущееДействие = "Поиск" 
		И ТребуетсяВыборКарты Тогда
		ВидимостьНесколькоКарт = Истина;
		ОформлениеБаннера = "Информация";
	ИначеЕсли ТекущееДействие = "Поиск"
		И ПоискВыполнен Тогда
		ВидимостьКартаНеНайдена = СтрокиБезЗаменяемойКарты.Количество() = 0;
		ОформлениеБаннера = "Предупреждение";
	ИначеЕсли ТекущееДействие = "Поиск" 
		И РежимВыбораКонтрагента Тогда
		ВидимостьНужноВыбратьКонтрагента = Истина;
		ОформлениеБаннера = "Информация";
	ИначеЕсли ТекущееДействие = "Подтверждение" 
		И РежимВыбораКонтрагента
		И НЕ ЗначениеЗаполнено(Контрагент) Тогда
		ВидимостьКартаДолжнаБытьИменная = Истина;
		ОформлениеБаннера = "Ошибка";
		ЗаблокироватьОсновнуюКнопку = Истина;
	ИначеЕсли ТекущееДействие = "ОтправкаЧека" Тогда
		ВидимостьКонтрагента = Истина;
	ИначеЕсли ОтображатьОшибку Тогда
		ВидимостьОшибкаСервера = Истина;
		ОформлениеБаннера = "Ошибка";
		Если НЕ ЗначениеЗаполнено(ДисконтнаяКарта) Тогда
			ЗаблокироватьОсновнуюКнопку = Истина;
		КонецЕсли;
	Иначе
		БаннерОткрыт = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ЗаголовокФормы = СтрШаблон("%1: %2", ЗаголовокФормы, Контрагент);
	КонецЕсли;
	
	Если ВертикальнаяГруппировка Тогда
		Элементы.ФреймДействия.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Иначе
		Элементы.ФреймДействия.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	КонецЕсли;
	
	Если РежимКассыСамообслуживания И ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		Элементы.ЗаголовокФормы.Заголовок = ЗаголовокФормы;
	Иначе
		Заголовок = ЗаголовокФормы;
	КонецЕсли;
	Если ВидимостьСтрокиПоиска Тогда
		УстановитьДоступностьЭлементаФормы(Элементы.СтрокаПоиска, НЕ БлокироватьПоиск);
		УстановитьВидимостьЭлементаФормы(Элементы.СтрокаПоиска, Истина);
	Иначе
		УстановитьВидимостьЭлементаФормы(Элементы.СтрокаПоиска, Ложь);
	КонецЕсли;
	УстановитьВидимостьЭлементаФормы(Элементы.ДействияНаФорме,  НЕ СкрытьВсеДействия);
		
	Элементы.ГруппаНайденнойКартыНомер.ТолькоПросмотр = НЕ ВключеноРедактировниеКарты;
	Элементы.ГруппаНайденнойКартыВидКарты.ТолькоПросмотр = НЕ ВключеноРедактировниеКарты;
	Элементы.ГруппаНайденнойКартыФИО.ТолькоПросмотр = НЕ ВключеноРедактировниеКарты;
	Элементы.ГруппаГоризонтальная.ТолькоПросмотр = НЕ ВключеноРедактировниеКарты;
	Элементы.ГруппаНайденнойКартыПочта.ТолькоПросмотр = НЕ ВключеноРедактировниеКарты;
	УстановитьВидимостьЭлементаФормы(Элементы.СерверНедоступен, ОтображатьОшибку);
	УстановитьВидимостьЭлементаФормы(Элементы.НесколькоКарт, ВидимостьНесколькоКарт);
	УстановитьВидимостьЭлементаФормы(Элементы.БудетЗамененаКарта, ВидимостьБудетЗамененаКарта);
	Элементы.ДекорацияЗаменаКарты.Заголовок = ПредставлениеКартыЗамены();
	УстановитьВидимостьЭлементаФормы(Элементы.БудетСохраненНомерКарты, ВидимостьБудетСохраненНомерКарты);
	Элементы.ДекорацияСохраненныйНомер.Заголовок = ПредставлениеСохранениеКарты();
	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаСохранитьКарту, ВидимостьСохранитьКарту);
	УстановитьВидимостьЭлементаФормы(Элементы.НеЗаполненыРеквизитыКарты, ВидимостьКонтрольРеквизитовСоздания);
	УстановитьВидимостьЭлементаФормы(Элементы.КартаНеНайдена, ВидимостьКартаНеНайдена);
	УстановитьВидимостьЭлементаФормы(Элементы.НужноВыбратьКонтрагента, ВидимостьНужноВыбратьКонтрагента);
	УстановитьВидимостьЭлементаФормы(Элементы.КартаДолжнаБытьИменная, ВидимостьКартаДолжнаБытьИменная);
	УстановитьВидимостьЭлементаФормы(Элементы.Баннер, БаннерОткрыт);
	УстановитьВидимостьЭлементаФормы(Элементы.ОтменитьВводыКарты, ОтменитьВводыКарты);
	УстановитьВидимостьЭлементаФормы(Элементы.ОтменитьСозданиеКарты, ОтменитьСозданиеКарты);
	УстановитьВидимостьЭлементаФормы(Элементы.ВыборКонтрагента, ВидимостьКонтрагента);
	
	Если ОформлениеБаннера = "Ошибка" Тогда
		Элементы.Баннер.ЦветФона = ЦветаФормы.БаннерКрасныйРМК;
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераОшибка, Истина);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераВнимание, Ложь);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераИнформация, Ложь);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераУспех, Ложь);
	ИначеЕсли ОформлениеБаннера = "Предупреждение" Тогда
		Элементы.Баннер.ЦветФона = ЦветаФормы.БаннерЖелтыйРМК;
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераОшибка, Ложь);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераВнимание, Истина);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераИнформация, Ложь);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераУспех, Ложь);
	ИначеЕсли ОформлениеБаннера = "Информация" Тогда
		Элементы.Баннер.ЦветФона = ЦветаФормы.БаннерГолубойРМК;
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераОшибка, Ложь);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераВнимание, Ложь);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераИнформация, Истина);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераУспех, Ложь);
	ИначеЕсли ОформлениеБаннера = "Успех" Тогда
		Элементы.Баннер.ЦветФона = ЦветаФормы.БаннерЗеленыйРМК;
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераОшибка, Ложь);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераВнимание, Ложь);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераИнформация, Ложь);
		УстановитьВидимостьЭлементаФормы(Элементы.КартинкаБаннераУспех, Истина);
	КонецЕсли;
	
	Если ТекущееДействие = "Поиск"
		И ТребуетсяВыборКарты Тогда
		Элементы.ДействияНаФорме.ТекущаяСтраница = Элементы.СтраницаВыбора;
	ИначеЕсли ТекущееДействие = "Поиск" Тогда
		Элементы.ДействияНаФорме.ТекущаяСтраница = Элементы.СтраницаПоиск;
	ИначеЕсли ТекущееДействие = "Подтверждение" Тогда
		Элементы.ДействияНаФорме.ТекущаяСтраница = Элементы.СтраницаПодтверждения;
	ИначеЕсли ТекущееДействие = "СозданиеКарты" Тогда
		Элементы.ДействияНаФорме.ТекущаяСтраница = Элементы.СтраницаСоздания;
	КонецЕсли;
	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаГоризонтальноКлавиатура, ВидимостьКлавиатуры);
	КодОтправлен = Ложь;
	Если НЕ ПараметрыВводаКодаSMS = Неопределено Тогда
		КодОтправлен = ПараметрыВводаКодаSMS.СообщениеОтправлено;
	КонецЕсли;
	
	УстановитьДоступностьЭлементаФормы(Элементы.КодПроверкиИзSMSНайденнойКарты, КодОтправлен И НЕ НомерТелефонаПодтвержден);
	УстановитьДоступностьЭлементаФормы(Элементы.КодПроверкиИзSMSНовойКарты, КодОтправлен И НЕ НомерТелефонаПодтвержден);
	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаВводКодаПодтвержденияНайденнойКарты, ОтправлятьSMSКодПриПродаже И ЭтоИменнаяКарта);
	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаПодтверждениеСМСНовойКарты, ОтправлятьSMSКодПриЗаведенииКарты И ЭтоИменнаяКарта);
	УстановитьВидимостьЭлементаФормы(Элементы.ДекорацияОтправитьСМС, ОтправлятьSMSКодПриЗаведенииКарты И ЭтоИменнаяКарта);

	Элементы.ВыбратьКарту.Заголовок = ЗаголовокКнопкиДействия;
	УстановитьДоступностьЭлементаФормы(Элементы.ВыбратьКарту, НЕ ЗаблокироватьОсновнуюКнопку);
	Элементы.ВыбратьКарту.Важность = ВажностьОсновнойКнопки;
	УстановитьВидимостьЭлементаФормы(Элементы.ОтказатьсяОтВводаКарты, ВидимостьКнопкиОтмена);
	УстановитьВидимостьЭлементаФормы(Элементы.ЗакрытьФорму, РежимКассыСамообслуживания И Не ВидимостьКнопкиОтмена);
	УстановитьВидимостьЭлементаФормы(Элементы.Назад, Не ОтменитьВводыКарты И ВидимостьКнопкиНазад);
	УстановитьВидимостьЭлементаФормы(Элементы.СоздатьКарту, ДоступноСозданиеКартыВНижнейПанели И ВозможностьСоздатьКарту);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаЗаменитьНаНовуюКарту, ВидимостьЗаменыКартыНаНовую);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаЗаменитьНаСуществующую, ВидимостьЗаменыКартыНаСуществующую);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаРедактироватьКарту, ВидимостьРедактироватьКарту);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаПечатьСогласияПД, ВидимостьДополнительнойКнопкиПечатьПД);
	УстановитьВидимостьЭлементаФормы(Элементы.ДекорацияТекстШаг2, СогласиеТребуется);
	УстановитьВидимостьЭлементаФормы(Элементы.ДекорацияТекстШаг1, СогласиеТребуется);
		
	Если ИспользоватьЦифровуюКлавиатуру Тогда
		УстановитьВидимостьЭлементаФормы(Элементы.ЗапятаяУниверсальнаяКлавиатура, НЕ УбратьСимволыВвода);
		УстановитьВидимостьЭлементаФормы(Элементы.Цифра00УниверсальнаяКлавиатура, НЕ УбратьСимволыВвода);
	КонецЕсли;
	ВыполнитьСерверныеДействияПриНастройке(ИспользоватьЦифровуюКлавиатуру, УбратьСимволыВвода);
	Если ЭлементВФокусе <> Неопределено И ЭлементВФокусе <> ТекущийЭлемент Тогда
		ПодключитьОбработчикОжидания("ПереместитьФокус",0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСерверныеДействияПриНастройке(ИспользоватьЦифровуюКлавиатуру, УбратьСимволыВвода)
	Если ИспользоватьЦифровуюКлавиатуру
		И УбратьСимволыВвода Тогда
		Элементы.Переместить(Элементы.УдалитьПоследнееУниверсальнаяКлавиатура, Элементы.ГруппаЦифры0УниверсальнаяКлавиатура,
			Элементы.Цифра0УниверсальнаяКлавиатура);
		Элементы.Переместить(Элементы.ОчиститьУниверсальнаяКлавиатура, Элементы.ГруппаЦифры0УниверсальнаяКлавиатура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПредставлениеКартыЗамены()
	ЗаменяемаяСтрока = Неопределено;
	Карта = Неопределено;
	СтрокиКартНаЗамену = ТаблицаДанных.НайтиСтроки(Новый Структура("ОтметкаЗамена", Истина));
	Если СтрокиКартНаЗамену.Количество() > 0 Тогда
		ЗаменяемаяСтрока = СтрокиКартНаЗамену[0];
	КонецЕсли;
	Если ЗаменяемаяСтрока = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	КартаФИО = ЗаменяемаяСтрока.ПокупательФИО;
	ЧастиФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(КартаФИО),
		СтрШаблон(НСтр("ru = '%1'"), " "));
	ПредставлениеФИО = КартаФИО;
	Если ЧастиФИО.Количество() > 2 Тогда
		ПредставлениеФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЗаменяемаяСтрока.ПокупательФИО);
	КонецЕсли;
	
	ПредставлениеКарты = "";
	Если ЗначениеЗаполнено(ЗаменяемаяСтрока.КодКарты) Тогда
		ПредставлениеКарты = СтрШаблон(НСтр("ru = '№ %1'"), ЗаменяемаяСтрока.КодКарты);
	ИначеЕсли ЗначениеЗаполнено(ЗаменяемаяСтрока.НомерТелефона) Тогда
		ПредставлениеКарты = СтрШаблон(НСтр("ru = 'тел. %1'"), ЗаменяемаяСтрока.НомерТелефона);
	ИначеЕсли ЗначениеЗаполнено(ПредставлениеФИО) Тогда
		ПредставлениеКарты = ПредставлениеФИО;
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = 'Будет выполнена замена карты: %1'"), ПредставлениеКарты);
КонецФункции

&НаКлиенте
Функция ПредставлениеСохранениеКарты()
	Возврат СтрШаблон(НСтр("ru = 'Будет сохранен номер карты: %1'"), СтрокаПоиска);
КонецФункции

&НаКлиенте
Процедура ПереместитьФокус()
	Если НЕ ЭлементВФокусе = Неопределено Тогда
		ТекущийЭлемент = ЭлементВФокусе;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущуюНастройкуРМК()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.ОтправлятьSMSКодПриЗаведенииКарты КАК ОтправлятьSMSКодПриЗаведенииКарты,
	|	НастройкиРабочегоМестаКассира.ОтправлятьSMSКодПриПродаже КАК ОтправлятьSMSКодПриПродаже,
	|	НастройкиРабочегоМестаКассира.СкрытьЦифровуюКлавиатуру КАК СкрытьЦифровуюКлавиатуру,
	|	НастройкиРабочегоМестаКассира.ВертикальнаяОриентация КАК ВертикальнаяОриентация,
	|	НастройкиРабочегоМестаКассира.ИспользоватьСерверЛояльностиПолучательДанных КАК ИспользоватьСерверЛояльностиПолучательДанных,
	|	НастройкиРабочегоМестаКассира.ИспользоватьОплатуБонусами КАК ИспользоватьОплатуБонусами,
	|	НастройкиРабочегоМестаКассира.РазрешитьЗаменуДисконтнойКарты КАК РазрешитьЗаменуДисконтнойКарты,
	|	НастройкиРабочегоМестаКассира.ШаблонSMSПриЗаведенииКарты КАК ШаблонSMSПриЗаведенииКарты,
	|	НастройкиРабочегоМестаКассира.ШаблонSMSПриПродаже КАК ШаблонSMSПриПродаже,
	|	НастройкиРабочегоМестаКассира.СценарийИспользования КАК СценарийИспользования
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира
	|ГДЕ
	|	НастройкиРабочегоМестаКассира.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ТекущаяНастройкаРМК);
	
	ВыборкаНастроек = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаНастроек.Следующий() Тогда
		
		ИспользоватьСерверЛояльностиПолучательДанных = ВыборкаНастроек.ИспользоватьСерверЛояльностиПолучательДанных;
		ПараметрыПодключенияКСерверуЛояльности = ОбщегоНазначенияРМКВызовСервера.ЗначенияПараметровСервераЛояльности(ТекущаяНастройкаРМК);
		
		ОбщегоНазначенияРМКПереопределяемый.ПроверитьВозможностьОтправкиSMS(ДоступнаОтправкаSMS);
		ОтправлятьSMSКодПриЗаведенииКарты = ВыборкаНастроек.ОтправлятьSMSКодПриЗаведенииКарты И ДоступнаОтправкаSMS;
		ОтправлятьSMSКодПриПродаже 		= ВыборкаНастроек.ОтправлятьSMSКодПриПродаже = ПредопределенноеЗначение("Перечисление.ВариантыОтправкиSMSПриПродаже.ПриВыборе");
		ШаблонSMSПриЗаведенииКарты 		= ВыборкаНастроек.ШаблонSMSПриЗаведенииКарты;
		ШаблонSMSПриПродаже 			= ВыборкаНастроек.ШаблонSMSПриПродаже;

		Если Не ВертикальнаяОриентация 	= ВыборкаНастроек.ВертикальнаяОриентация Тогда
			ВертикальнаяОриентация 		= ВыборкаНастроек.ВертикальнаяОриентация;
		КонецЕсли;
		ИспользоватьЦифровуюКлавиатуру 	= НЕ ВыборкаНастроек.СкрытьЦифровуюКлавиатуру;
		ИспользоватьОплатуБонусами 		= ВыборкаНастроек.ИспользоватьОплатуБонусами;		
		РазрешитьЗаменуДисконтнойКарты 	= ВыборкаНастроек.РазрешитьЗаменуДисконтнойКарты;
		РежимКассыСамообслуживания = ВыборкаНастроек.СценарийИспользования = Перечисления.СценарииИспользованияРМК.ТерминалСамообслуживания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЦифруЦифровойКлавиатуры(ИмяКомандыКлавиатуры)

	СимволКлавиатуры = ИнтерфейсРМКСлужебныйКлиент.ПолучитьСимволКоманды(ИмяКомандыКлавиатуры);	
	Если ЭлементВФокусе <> Неопределено Тогда
		ВставитьСимволыВРедактируемоеПоле(ЭлементВФокусе, СимволКлавиатуры);
	КонецЕсли;
	Если ЭлементВФокусе = Элементы.КодПроверкиИзSMSНайденнойКарты
		ИЛИ ЭлементВФокусе = Элементы.КодПроверкиИзSMSНовойКарты Тогда
			
			Введено4Цифры = СтрДлина(СокрЛП(КодПроверкиИзSMS)) = 4;
			Если Введено4Цифры Тогда
				ПроверитьВведенныйКодИзSMS();
			КонецЕсли;
			
		Иначе
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСимволыВРедактируемоеПоле(Знач РедактируемыйЭлемент, СимволыКлавиатуры)
	
	Если (Не РедактируемыйЭлемент = Неопределено) И РедактируемыйЭлемент.Доступность Тогда
	
		НачалоВыделения = 0;
		НачалоСтроки = 0;
		КонецВыделения = 0;
		КонецСтроки = 0;
		
		РедактируемыйЭлемент.ПолучитьГраницыВыделения(НачалоСтроки, НачалоВыделения, КонецСтроки, КонецВыделения);
		РедактируемыйТекст = РедактируемыйЭлемент.ТекстРедактирования;
		
		ТекущийЭлемент = РедактируемыйЭлемент;
		РедактируемыйЭлемент.ВыделенныйТекст = СимволыКлавиатуры;
		ОбновитьОтображениеДанных(РедактируемыйЭлемент);
		
		НовыйКонецВыделения = ВычислитьПозициюВыделенияПослеВставки(РедактируемыйЭлемент, РедактируемыйТекст,
			НачалоВыделения, КонецВыделения, СимволыКлавиатуры);
			
		ТекущийЭлемент = РедактируемыйЭлемент;
		РедактируемыйЭлемент.УстановитьГраницыВыделения(НовыйКонецВыделения, НовыйКонецВыделения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВычислитьПозициюВыделенияПослеВставки(РедактируемыйЭлемент, ТекстДоРедактирования,
		НачалоВыделения, КонецВыделения, СимволыКлавиатуры)
	
	РезультатФункции = 0;
	
	ДлинаТекста = СтрДлина(РедактируемыйЭлемент.ТекстРедактирования);
	ДлинаВставки = СтрДлина(СимволыКлавиатуры);	
	Если ИнтерфейсРМКСлужебныйКлиентСервер.ЭтоПолеТелефонаСМаской(РедактируемыйЭлемент) Тогда
		Если НачалоВыделения < 3 Тогда
			НачалоВыделения = 3;
		КонецЕсли;
		РезультатФункции = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПозициюКурсораСУчетомФорматирования(ТекстДоРедактирования,
		РедактируемыйЭлемент.ТекстРедактирования, НачалоВыделения, ДлинаВставки, " ");
	ИначеЕсли ИнтерфейсРМКСлужебныйКлиентСервер.ЭтоПолеДатыСМаской(РедактируемыйЭлемент) Тогда
		РезультатФункции = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПозициюКурсораСУчетомФорматирования(ТекстДоРедактирования,
		РедактируемыйЭлемент.ТекстРедактирования, НачалоВыделения, ДлинаВставки, ".");
	Иначе
		РезультатФункции = НачалоВыделения + ДлинаВставки;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыОчистить()
	
	Если ЭлементВФокусе <> Неопределено Тогда
		ИнтерфейсРМКСлужебныйКлиент.ОчиститьТекстРедактированияВПолеФормы(ЭтотОбъект, ЭлементВФокусе);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее()
	
	Если ЭлементВФокусе <> Неопределено Тогда
		ИнтерфейсРМКСлужебныйКлиент.УдалитьСимволыВРедактируемомПоле(ЭтотОбъект, ЭлементВФокусе, Символы.НПП);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуДваНуляЦифровойКлавиатуры()
	
	СимволыКлавиатуры = ИнтерфейсРМКСлужебныйКлиент.ПолучитьТекстКнопкиДваНуля();
	ПрименитьСимволыЦифровойКлавиатуры(СимволыКлавиатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьСимволыЦифровойКлавиатуры(СимволыКлавиатуры)
	
	ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, ЭлементВФокусе, СимволыКлавиатуры);
	Если ЭлементВФокусе = Элементы.КодПроверкиИзSMSНовойКарты
		ИЛИ ЭлементВФокусе = Элементы.КодПроверкиИзSMSНайденнойКарты Тогда
		ПроверитьВведенныйКодПроверки(ЭлементВФокусе.ТекстРедактирования);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыВводПоиск()
	
	ВыполнитьДействиеГлавнойКоманды();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыЗвездочкаЗапятая()
	
	Если ЭлементВФокусе = Неопределено Тогда
		Возврат;
	ИначеЕсли ЭтоЧисловоеПоле(ЭлементВФокусе) Тогда 
		ПеревестиКурсорНаВводДробнойЧасти();
	Иначе
		РедактируемыйТекст = ЭлементВФокусе.ТекстРедактирования;
		Если СокрЛП(РедактируемыйТекст) = "" Тогда
			ТекущийЭлемент = ЭлементВФокусе;
			ЭлементВФокусе.ВыделенныйТекст = ИнтерфейсРМКСлужебныйКлиент.ПолучитьСимволЗвездочка();
			ОбновитьОтображениеДанных(ЭлементВФокусе);
			ЭлементВФокусе.УстановитьГраницыВыделения(2, 2);
			НастроитьКнопкиЦифровойПанели();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКнопкиЦифровойПанели(ТекстСтрокиПоискаКарты = Неопределено)
	
	ДоступностьЗвездочки = ТекущееДействие = "Поиск";
	Элементы.ЗапятаяУниверсальнаяКлавиатура.Доступность = ДоступностьЗвездочки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиКурсорНаВводДробнойЧасти()
	
	Если Не ЭлементВФокусе = Неопределено Тогда
		НачалоВыделения = 0;
		НачалоСтроки = 0;
		КонецВыделения = 0;
		КонецСтроки = 0;
		ЭлементВФокусе.ПолучитьГраницыВыделения(НачалоСтроки, НачалоВыделения, КонецСтроки, КонецВыделения);
		СимволРазделителя = ИнтерфейсРМКСлужебныйКлиентСервер.РазделительДробнойЧасти();
		ПозицияРазделителя = СтрНайти(ЭлементВФокусе.ТекстРедактирования, СимволРазделителя);
		Если ПозицияРазделителя > 0 И ПозицияРазделителя >= НачалоВыделения Тогда
			НоваяПозицияКурсора = ПозицияРазделителя + 1;
			ЭлементВФокусе.УстановитьГраницыВыделения(НоваяПозицияКурсора, НоваяПозицияКурсора);
		Иначе
			ЭлементВФокусе.УстановитьГраницыВыделения(НачалоВыделения, КонецВыделения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТиповыеГорячиеКлавиши()
	
	СочетаниеКлавишиEnter = ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,{0,13,0}}");
	Если Не СочетаниеКлавишиEnter = Неопределено Тогда
		Элементы.ГорячаяКлавишаEnter.СочетаниеКлавиш = СочетаниеКлавишиEnter;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьГорячуюКлавишуEnter()
	
	Если ТекущийЭлемент = Элементы.СтрокаПоиска Тогда
		ОбработатьКомандуЦифровойКлавиатурыВводПоиск()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБаннерПриНеобходимости()
	Если БаннерОткрыт Тогда
		БаннерОткрыт = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СменитьЭлементВводаДанныхПокупателя(Элемент)
	Если Не ЭлементВФокусе = Элемент Тогда
		Если (ЭлементВФокусе = Элементы.КодПроверкиИзSMSНайденнойКарты
			ИЛИ ЭлементВФокусе = Элементы.КодПроверкиИзSMSНовойКарты) Тогда
			ПроверитьВведенныйКодИзSMS();
		КонецЕсли;
		ОбработатьПотерюФокусаДатыРождения();
		ЭлементВФокусе = Элемент;
	КонецЕсли;
КонецПроцедуры

#Область SMSПодтверждениеНомераТелефона

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыПроверкиПоSMSКоду()
	
	ПараметрыПроверкиПоSMS = Новый Структура();
	ПараметрыПроверкиПоSMS.Вставить("КодПодтверждения", "");
	ПараметрыПроверкиПоSMS.Вставить("ВариантПроверки", "");
	ПараметрыПроверкиПоSMS.Вставить("СообщениеОтправлено", Ложь);
	ПараметрыПроверкиПоSMS.Вставить("ПопытокВвода", 0);
	
	Возврат ПараметрыПроверкиПоSMS;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВведенныйКодПроверки(Текст)
	Введено4Цифры = СтрДлина(СокрЛП(Текст)) = 4;
	


	Если Введено4Цифры Тогда
		
		КодПроверкиИзSMS = Текст;
		ПроверитьВведенныйКодИзSMS();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВведенныйКодИзSMS()
	
	Если ПараметрыВводаКодаSMS = Неопределено
		ИЛИ КодПроверкиИзSMS = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыВводаКодаSMS.СообщениеОтправлено
		И КодПроверкиИзSMS = ПараметрыВводаКодаSMS.КодПодтверждения Тогда
		ОбработатьУспешноВведенныйКодИзSMS();
	Иначе
		ОбработатьОшибочноВведенныйКодИзSMS();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьУспешноВведенныйКодИзSMS()

	НомерТелефонаПодтвержден = Истина;
	ОбновитьСостояниеПроверкиСМСНаФорме();
	НастроитьЭлементыФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОшибочноВведенныйКодИзSMS()

	Попыток = ПараметрыВводаКодаSMS.ПопытокВвода;
	Попыток = Попыток + 1;
	ПараметрыВводаКодаSMS.ПопытокВвода = Попыток;
	
	ОбновитьСостояниеПроверкиСМСНаФорме();
	
	Если ТекущееДействие = "Подтверждение" Тогда
		ТекущийЭлемент = Элементы.КодПроверкиИзSMSНайденнойКарты;
		ЭлементВФокусе = ТекущийЭлемент;
	ИначеЕсли ТекущееДействие = "СозданиеКарты" Тогда
		ТекущийЭлемент = Элементы.КодПроверкиИзSMSНовойКарты;
		ЭлементВФокусе = ТекущийЭлемент;
	КонецЕсли;
	КодПроверкиИзSMS = "";
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСообщениеИОтправитьSMS()
	
	РезультатОтправкиSMS = СформироватьСообщениеИОтправитьSMSСервер();
	ПараметрыВводаКодаSMS.СообщениеОтправлено = РезультатОтправкиSMS.Результат;
	ОбновитьСостояниеПроверкиСМСНаФорме();
	НастроитьЭлементыФормыКлиент();
	ОбработатьПотерюФокусаДатыРождения();
	
КонецПроцедуры

&НаСервере
Функция СформироватьСообщениеИОтправитьSMSСервер()
	
	НомерТелефонаПодтвержден = Ложь;
	
	КодПодтверждения = СлучайноеЧетырехзначноеЧисло();
		
	ПараметрыВводаКодаSMS.КодПодтверждения = КодПодтверждения;
	ПараметрыВводаКодаSMS.ПопытокВвода = 0;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КодПодтверждения", КодПодтверждения);
	
	Если ПараметрыВводаКодаSMS.ВариантПроверки = "ПриЗаведенииКарты" Тогда
		
		ШаблонСообщения = ШаблонSMSПриЗаведенииКарты;
		НомерТелефонаПолучателя = НоваяКартаТелефон;
		
	ИначеЕсли ПараметрыВводаКодаSMS.ВариантПроверки = "ПриВыборе" Тогда
		
		ШаблонСообщения = ШаблонSMSПриПродаже;
		НомерТелефонаПолучателя = НайденнаяКартаТелефон;
		
	КонецЕсли;
	
	ТекстСообщения = "";
	ОбщегоНазначенияРМКПереопределяемый.СформироватьТекстСообщения(ШаблонСообщения,
		ДополнительныеПараметры,
		ТекстСообщения);
	
	РезультатОтправки = ОтправитьSMS(ТекстСообщения, НомерТелефонаПолучателя);
	Если РезультатОтправки.Результат Тогда
		Элементы.КодПроверкиИзSMSНайденнойКарты.КартинкаКнопкиВыбора = БиблиотекаКартинок.Обновить;
	КонецЕсли;	
	Возврат РезультатОтправки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтправитьSMS(ТекстСообщения, НомерТелефона)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатОтправки = Новый Структура;
	РезультатОтправки.Вставить("Результат", Ложь);
	РезультатОтправки.Вставить("ОписаниеОшибки", "");
	РезультатОтправки.Вставить("НомерТелефона", НомерТелефона);
	
	Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда
		РезультатОтправки.ОписаниеОшибки =
			НСтр("ru = 'Не сформирован текст сообщения для отправки.'");
		Возврат РезультатОтправки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		
		МассивНомеров = Новый Массив;
		МассивНомеров.Добавить(НомерТелефона);
		ОбщегоНазначенияРМКПереопределяемый.ОтправитьSMS(МассивНомеров, ТекстСообщения, РезультатОтправки);
		
	Иначе
		РезультатОтправки.ОписаниеОшибки =
			НСтр("ru = 'Для владельца карты не задан номер телефона. Выслать код подтверждения не удалось'");
	КонецЕсли;
	
	Возврат РезультатОтправки;
	
КонецФункции

&НаСервереБезКонтекста
Функция СлучайноеЧетырехзначноеЧисло()
	
	Генератор = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	СлучайноеЧисло = Генератор.СлучайноеЧисло(0, 9999);
	
	Если СлучайноеЧисло < 1000 Тогда
		СлучайноеЧислоСтрокой = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка(СлучайноеЧисло), 4, "0");
	Иначе
		СлучайноеЧислоСтрокой = Формат(СлучайноеЧисло, "ЧГ=0");
	КонецЕсли;
	
	Возврат СлучайноеЧислоСтрокой;
	
КонецФункции

Процедура ОбновитьСостояниеПроверкиСМСНаФорме()
	СменитьФокус = Ложь;
	Если НомерТелефонаПодтвержден Тогда
		ТекстСостояния = СтрШаблон(НСтр("ru='Номер подтвержден'"));
		КартинкаСообщения = БиблиотекаКартинок.ОформлениеФлажок;
	ИначеЕсли ПараметрыВводаКодаSMS.СообщениеОтправлено 
		И ЗначениеЗаполнено(ПараметрыВводаКодаSMS.КодПодтверждения) 
		И ПараметрыВводаКодаSMS.ПопытокВвода = 0 Тогда	
		ТекстСостояния = СтрШаблон(НСтр("ru='Код отправлен'"));
		КартинкаСообщения = БиблиотекаКартинок.Сообщение;
		СменитьФокус = Истина;
	ИначеЕсли ПараметрыВводаКодаSMS.СообщениеОтправлено 
		И ЗначениеЗаполнено(ПараметрыВводаКодаSMS.КодПодтверждения) Тогда
		ТекстСостояния = СтрШаблон(НСтр("ru='Ошибочный код'"));
		КартинкаСообщения = БиблиотекаКартинок.ЗнакПредупреждение;
	ИначеЕсли НЕ ПараметрыВводаКодаSMS.СообщениеОтправлено
		И ПараметрыВводаКодаSMS.КодПодтверждения = "" Тогда 
		ТекстСостояния = "";
		КартинкаСообщения = Новый Картинка;
	ИначеЕсли НЕ ПараметрыВводаКодаSMS.СообщениеОтправлено Тогда 
		ТекстСостояния = СтрШаблон(НСтр("ru='Ошибка отправки'"));
		КартинкаСообщения = БиблиотекаКартинок.Ошибка32;
	КонецЕсли;
	Элементы.НоваяКартаДекорацияКартинкаСостоянияОтправкиСМС.Картинка = КартинкаСообщения;
	Элементы.НайденнаяКартаДекорацияКартинкаСостоянияОтправкиСМС.Картинка = КартинкаСообщения;
	СостояниеОтправкиКода = ТекстСостояния;

	Если ТекущееДействие = "СозданиеКарты" И СменитьФокус Тогда
		ТекущийЭлемент = Элементы.КодПроверкиИзSMSНовойКарты;
		ЭлементВФокусе = ТекущийЭлемент;
	ИначеЕсли СменитьФокус Тогда
		ТекущийЭлемент = Элементы.КодПроверкиИзSMSНайденнойКарты;
		ЭлементВФокусе = ТекущийЭлемент;
	Иначе
	КонецЕсли;
	Если ПараметрыВводаКодаSMS <> Неопределено И ПараметрыВводаКодаSMS.СообщениеОтправлено Тогда
		Элементы.КодПроверкиИзSMSНовойКарты.КартинкаКнопкиВыбора = БиблиотекаКартинок.Обновить;
		Элементы.КодПроверкиИзSMSНайденнойКарты.КартинкаКнопкиВыбора = БиблиотекаКартинок.Обновить;
	Иначе
		Элементы.КодПроверкиИзSMSНовойКарты.КартинкаКнопкиВыбора = БиблиотекаКартинок.ОтправитьСообщение;
		Элементы.КодПроверкиИзSMSНайденнойКарты.КартинкаКнопкиВыбора = БиблиотекаКартинок.ОтправитьСообщение;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбработатьПотерюФокусаДатыРождения()
	Если (Не ЭлементВФокусе = Неопределено)
			И ЭлементВФокусе = Элементы.НоваяКартаДатаРождения Тогда
		ИнтерфейсРМКСлужебныйКлиент.СкорректироватьДатуРожденияПриНеобходимости(ЭтотОбъект, "НоваяКартаДатаРождения");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписанияТиповИскомыхДанных()
	ОписаниеТипаДисконтнаяКарта = Метаданные.ОпределяемыеТипы.ДисконтнаяКартаРМК.Тип;
	ОписаниеТипаКонтрагент = Метаданные.ОпределяемыеТипы.КонтрагентРМК.Тип;
	ОписаниеТипаБонуснаяПрограмма = Метаданные.ОпределяемыеТипы.БонуснаяПрограммаРМК.Тип;
	Возврат Новый Структура("Покупатель, КартаЛояльности, БонуснаяПрограмма", ОписаниеТипаКонтрагент, ОписаниеТипаДисконтнаяКарта, ОписаниеТипаБонуснаяПрограмма);
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДанныеВыбраннойКарты(СтрокаДанных)

	СтрокаДанных.Отметка = Истина;

	ДисконтнаяКарта = СтрокаДанных.ДисконтнаяКарта;
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = СтрокаДанных.Покупатель;
	КонецЕсли;
	НайденнаяКартаДатаРождения = СтрокаДанных.ДатаРождения;
	НайденнаяКартаТелефон = СтрокаДанных.НомерТелефона;
	НайденнаяКартаФИО = СтрокаДанных.ПокупательФИО;
	НайденнаяКартаНомер = СтрокаДанных.КодКарты;
	НайденнаяКартаПочта = СтрокаДанных.ПокупательПочта;
	КурсБонусов = СтрокаДанных.КурсБонусов;
	КоличествоБонусов = СтрокаДанных.ОстатокБонусныхБаллов;
	НайденнаяКартаСуммаПродаж = СтрокаДанных.ПродажиОборот;
	БонуснаяПрограмма = СтрокаДанных.БонуснаяПрограмма;
	ЭтоИменнаяКарта = ЗначениеЗаполнено(СтрокаДанных.ИдентификаторПокупателя) 
		ИЛИ ЗначениеЗаполнено(СтрокаДанных.Покупатель);

КонецПроцедуры 

&НаКлиенте
Функция ДобавитьСозданнуюКартуВТаблицу(ДанныеОтвета)
	СтрокаДанных = ТаблицаДанных.Добавить();
	ЗаполнитьСтрокуСозданнойКартыПоДаннымСЛ(СтрокаДанных, ДанныеОтвета);
	СтрокаДанных.Отметка = Истина;
	Возврат СтрокаДанных;
КонецФункции

&НаСервере
Процедура ЗапроситьЛокальныеДанныеКарты(Строка)
	Если ИспользоватьОплатуБонусами Тогда
		ЗапроситьДанныеБонусовЛокально();
	КонецЕсли;
	ЗаполнитьДанныеПродажЛокально(Строка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПродажЛокально(Строка)
	Если НЕ ЗначениеЗаполнено(Строка.ДисконтнаяКарта) Тогда
		Возврат;
	КонецЕсли;
	ВладелецШтрихкода = Строка.ДисконтнаяКарта;
	НайденнаяКартаЛояльности = Неопределено;
	ШтрихкодированиеРМКПереопределяемый.ЗаполнитьДанныеНайденнойКартыЛояльности(ВладелецШтрихкода,НайденнаяКартаЛояльности);
	Если НайденнаяКартаЛояльности.Свойство("СуммаПродаж") Тогда
		Строка.ПродажиОборот = НайденнаяКартаЛояльности.СуммаПродаж;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗапроситьДанныеБонусовЛокально()
	
	ОбщегоНазначенияРМКПереопределяемый.НайтиБонусыЛокально(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТаблицыКарт(МассивКарт, МассивПокупателей = Неопределено, Контрагент = Неопределено)
	Если МассивПокупателей = Неопределено Тогда
		МассивПокупателей = Новый Массив;
	КонецЕсли;
	ОписаниеКарт = Новый Массив;
	СтруктураПараметровЗапроса = Новый Структура;
	СтруктураПараметровЗапроса.Вставить("МассивКарт", МассивКарт);
	СтруктураПараметровЗапроса.Вставить("МассивПокупателей", МассивПокупателей);
	СтруктураПараметровЗапроса.Вставить("Контрагент", Контрагент);
	
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьДанныеРеквизитовПокупателя(ОписаниеКарт, СтруктураПараметровЗапроса);
	Для Каждого СтрокаМассива Из ОписаниеКарт Цикл
		ЗаполнитьСтрокуТаблицыДанныхКарт(СтрокаМассива);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуТаблицыДанныхКарт(СтрокаДанных)
	НоваяСтрока = ТаблицаДанных.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
	Если ЗначениеЗаполнено(НоваяСтрока.ДисконтнаяКарта) Тогда
		НоваяСтрока.ИдентификаторКарты = Строка(НоваяСтрока.ДисконтнаяКарта.УникальныйИдентификатор());
	КонецЕсли;
	НоваяСтрока.ОстатокБалловРуб = НоваяСтрока.ОстатокБонусныхБаллов * НоваяСтрока.КурсБонусов;
	Если ЗначениеЗаполнено(НоваяСтрока.Покупатель) Тогда
		НоваяСтрока.ИдентификаторПокупателя = Строка(НоваяСтрока.Покупатель.УникальныйИдентификатор());
	КонецЕсли;
	Если ЗначениеЗаполнено(НоваяСтрока.БонуснаяПрограмма) Тогда
		НоваяСтрока.ИдентификаторБонуснойПрограммы = Строка(НоваяСтрока.БонуснаяПрограмма.УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКартуВТаблицуЗамена(КартаНачисления = Ложь)
	ПолученаКарта = ЗначениеЗаполнено(Объект.ДисконтнаяКарта)
		Или ИнтерфейсРМКСлужебныйКлиентСервер.ПолученИдентификаторКартыЛояльности(ПараметрыКартыЛояльности);
	Если Не ПолученаКарта Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДисконтнаяКарта) Тогда
		СтруктураОтбора = Новый Структура("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	Иначе
		СтруктураОтбора = Новый Структура("ИдентификаторКарты", ПараметрыКартыЛояльности.ИдентификаторКарты);
	КонецЕсли;
	СтрокиТаблицы = ТаблицаДанных.НайтиСтроки(СтруктураОтбора);
	Если СтрокиТаблицы.Количество() > 0 Тогда
		РежимЗаменыКарты = Ложь;
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	Если ЗначениеЗаполнено(Объект.ДисконтнаяКарта) Тогда
		НоваяСтрока.ДисконтнаяКарта = Объект.ДисконтнаяКарта;
	Иначе
		НоваяСтрока.ИдентификаторКарты = ПараметрыКартыЛояльности.ИдентификаторКарты;
	КонецЕсли;
	НоваяСтрока.ОстатокБонусныхБаллов = КоличествоБонусов;
	НоваяСтрока.КодКарты = НайденнаяКартаНомер;
	НоваяСтрока.КурсБонусов = КурсБонусов;
	НоваяСтрока.КартаНачисления = КартаНачисления;
	Если НЕ КартаНачисления Тогда
		ШаблонКарты = НСтр("ru = '%1(%2)'");
		ПредставлениеКартыЗамена = СтрШаблон(ШаблонКарты, НайденнаяКартаФИО, НайденнаяКартаНомер);
		НоваяСтрока.ДисконтнаяКартаПредставление = ПредставлениеКартыЗамена;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводКартыЛояльностиПоШтрихкоду(ЗапросКСерверуЛояльности = Истина)
	
	Если РежимЗаменыКарты Тогда
		ДобавитьКартуВТаблицуЗамена(Истина);
	КонецЕсли;

	ПереключитьНаСтраницуПодтвержденияДанныхПокупателя();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучениеКартССервераЛояльности(РезультатЗапросаКарт)
	
	СтрокаСМаксимальнымКоличествомБалов = Неопределено;
	МаксимальноеКоличествоБаллов = 0;
	
	Если ЗначениеЗаполнено(РезультатЗапросаКарт.ТекстОшибки) Тогда
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(РезультатЗапросаКарт.ТекстОшибки);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыОткрытияОшибки);
		БаннерОткрыт = Истина;
		ОшибкаСервераЛояльности = РезультатЗапросаКарт.ТекстОшибки;
		Возврат;
	КонецЕсли;		

			
	Для Каждого ОписаниеКарты Из РезультатЗапросаКарт.ДанныеКарт Цикл
		Если НЕ ОписаниеКарты.Valid Тогда
			Продолжить;
		КонецЕсли;
		СтрокаНаВыбор = ТаблицаДанных.Добавить();
		
		ЗаполнитьСтрокуКартыПоДаннымСЛ(СтрокаНаВыбор, ОписаниеКарты);
		
		Если НЕ СтрокаНаВыбор.КартаНедействительна
			И МаксимальноеКоличествоБаллов <= СтрокаНаВыбор.ОстатокБонусныхБаллов Тогда
			МаксимальноеКоличествоБаллов = СтрокаНаВыбор.ОстатокБонусныхБаллов;
			СтрокаСМаксимальнымКоличествомБалов = СтрокаНаВыбор;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьСсылкиПоИдентификаторам();
	
	Если НЕ СтрокаСМаксимальнымКоличествомБалов = Неопределено Тогда
		УстановитьОсновнуюКарту(СтрокаСМаксимальнымКоличествомБалов);
	КонецЕсли;
	ОбновитьИтогиТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтогиТаблицы()
	МассивКонтрагентов = Новый Массив;
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Если МассивКонтрагентов.Найти(СтрокаДанных.ИдентификаторПокупателя) = Неопределено Тогда
			МассивКонтрагентов.Добавить(СтрокаДанных.ИдентификаторПокупателя);
		КонецЕсли;		
	КонецЦикла;
	ОдинВладелец = МассивКонтрагентов.Количество() = 1;
	ОбщийОстатокБаллов = ТаблицаДанных.Итог("ОстатокБонусныхБаллов");
	ОбщийОстатокБалловРуб = ТаблицаДанных.Итог("ОстатокБалловРуб");
	ТаблицаДанных.Сортировать("Отметка Убыв, ОстатокБонусныхБаллов Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтрокуКартыПоДаннымСЛ(СтрокаНаВыбор, ОписаниеКарты)
    ОписаниеКартыДляИнтерфейса = ИнтерфейсРМКСлужебныйКлиентСервер.ОписаниеКартыДляИнтерфейса(ОписаниеКарты);
	ЗаполнитьЗначенияСвойств(СтрокаНаВыбор, ОписаниеКартыДляИнтерфейса);
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСсылкиПоИдентификаторам()
	
	ТипыДанных = ОписанияТиповИскомыхДанных();
	ТипСсылкиПокупатель = ТипыДанных.Покупатель.Типы()[0];
	ТипСсылкиКартаЛояльности = ТипыДанных.КартаЛояльности.Типы()[0];
	ТипСсылкиБонуснаяПрограмма = ТипыДанных.БонуснаяПрограмма.Типы()[0];
	МетаданныеПокупатель = Метаданные.НайтиПоТипу(ТипСсылкиПокупатель);
	МетаданныеКартаЛояльности = Метаданные.НайтиПоТипу(ТипСсылкиКартаЛояльности);
	МетаданныеБонуснаяПрограмма = Метаданные.НайтиПоТипу(ТипСсылкиБонуснаяПрограмма);
	
	МенеджерПокупатель = Неопределено;
	Если МетаданныеПокупатель <> Неопределено Тогда
		ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеПокупатель.ПолноеИмя());
	КонецЕсли;
	МенеджерКартаЛояльности = Неопределено;
	Если МетаданныеКартаЛояльности <> Неопределено Тогда
		МенеджерКартаЛояльности = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеКартаЛояльности.ПолноеИмя());
	КонецЕсли;
	МенеджерБонуснаяПрограмма = Неопределено;
	Если МетаданныеБонуснаяПрограмма <> Неопределено Тогда
		МенеджерБонуснаяПрограмма = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеБонуснаяПрограмма.ПолноеИмя());
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Покупатель = Неопределено;
		ДисконтнаяКарта = Неопределено;
		БонуснаяПрограмма = Неопределено;
		Если МенеджерПокупатель <> Неопределено 
			И ЗначениеЗаполнено(СтрокаДанных.ИдентификаторПокупателя) Тогда
			УИД = Новый УникальныйИдентификатор(СтрокаДанных.ИдентификаторПокупателя);
			Покупатель = МенеджерПокупатель.ПолучитьСсылку(УИД);
		КонецЕсли;
		Если МенеджерКартаЛояльности <> Неопределено 
			И ЗначениеЗаполнено(СтрокаДанных.ИдентификаторКарты) Тогда
			УИД = Новый УникальныйИдентификатор(СтрокаДанных.ИдентификаторКарты);
			ДисконтнаяКарта = МенеджерКартаЛояльности.ПолучитьСсылку(УИД);
		КонецЕсли;
		Если МенеджерБонуснаяПрограмма <> Неопределено 
			И ЗначениеЗаполнено(СтрокаДанных.ИдентификаторБонуснойПрограммы) Тогда
			УИД = Новый УникальныйИдентификатор(СтрокаДанных.ИдентификаторБонуснойПрограммы);
			БонуснаяПрограмма = МенеджерБонуснаяПрограмма.ПолучитьСсылку(УИД);
		КонецЕсли;
		Если ЗначениеЗаполнено(Покупатель) И ОбщегоНазначения.СсылкаСуществует(Покупатель) Тогда
			СтрокаДанных.Покупатель = Покупатель;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДисконтнаяКарта) И ОбщегоНазначения.СсылкаСуществует(ДисконтнаяКарта) Тогда
			СтрокаДанных.ДисконтнаяКарта = ДисконтнаяКарта;
		КонецЕсли;
		Если ЗначениеЗаполнено(БонуснаяПрограмма) И ОбщегоНазначения.СсылкаСуществует(БонуснаяПрограмма) Тогда
			СтрокаДанных.БонуснаяПрограмма = БонуснаяПрограмма;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьСтрокуСозданнойКартыПоДаннымСЛ(СтрокаНаВыбор, ОписаниеКарты)
	
	СтрокаНаВыбор.КодКарты = ОписаниеКарты.CardID;
	СтрокаНаВыбор.ПокупательФИО = ОписаниеКарты.Client;
	СтрокаНаВыбор.НомерТелефона = ОписаниеКарты.PhoneNumber;
	СтрокаНаВыбор.ПокупательПочта = ОписаниеКарты.EMail;
	СтрокаНаВыбор.ФизическоеЛицо = Истина;
	Если ТипЗнч(ОписаниеКарты.DateOfBirth) = Тип("Дата") Тогда
		ДатаРожденияКлиента = ОписаниеКарты.DateOfBirth;
	Иначе
		СтрокаXMLТолькоЧастьДата = Лев(ОписаниеКарты.DateOfBirth, 10);
		СтрокаДатыДляПреобразования = СтрЗаменить(СтрокаXMLТолькоЧастьДата, "-", "");
		ДатаРожденияКлиента = Дата(СтрокаДатыДляПреобразования);
	КонецЕсли;
	СтрокаНаВыбор.ДатаРождения = ДатаРожденияКлиента;
	СтрокаНаВыбор.ВидДисконтнойКарты = НоваяКартаВидКарты;
	СтрокаНаВыбор.КартаНедействительна = Ложь;
	СтрокаНаВыбор.ИдентификаторКарты = ОписаниеКарты.CardRef;
	СтрокаНаВыбор.ОстатокБонусныхБаллов = ОписаниеКарты.BonusCount;
	СтрокаНаВыбор.КурсБонусов = ОписаниеКарты.BonusRate;
	СтрокаНаВыбор.ОстатокБалловРуб = СтрокаНаВыбор.ОстатокБонусныхБаллов * СтрокаНаВыбор.КурсБонусов;
	СтрокаНаВыбор.ПродажиОборот = 0;
	СтрокаНаВыбор.МаксимальныйПроцентОплаты = ОписаниеКарты.PaymentPercent;
	
КонецПроцедуры

&НаКлиенте
Функция СохранятьНомерКартыЛояльности()
	
	РезультатФункции = ЗапоминатьНомерКартыЛояльности 
		И ОшибкаСервераЛояльности <> ""
		И Не ОтправлятьSMSКодПриПродаже;

	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ЗапроситьКартыССервераЛояльности()
	
	ПустойМассив = Новый Массив;
	РезультатФункции = Новый Структура("ДанныеКарт,ТекстОшибки", ПустойМассив, "");
	
	ЗначенияПараметровМетода = ПараметрыМетодаНайтиКартуКлиента();
	ПараметрыВыполненияЗапроса = СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыЗапросаНайтиКартуКлиента(ПараметрыПодключенияКСерверуЛояльности, ЗначенияПараметровМетода);
	Результат = СерверЛояльностиПолучательДанныхКлиентСервер.ВыполнитьЗапросКСерверуЛояльности(ПараметрыВыполненияЗапроса);
	
	ТекстОшибки = "";
	ТекстОшибкиПоУмолчанию = НСтр("ru = 'Не удалось подключиться к серверу лояльности. Обратитесь к администратору'");
	Если Результат.ЕстьОшибки Тогда
		
		ДополнительноеПояснение = "";
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "ТекстОшибки") Тогда
			ДополнительноеПояснение = СтрШаблон(" %1 %2", НСтр("ru = 'по причине:'"), Результат.ТекстОшибки);
		КонецЕсли;
		ТекстОшибки = СтрШаблон("%1 %2",
		НСтр("ru = 'Не удалось получить карты клиента'"),
			ДополнительноеПояснение);
		
		
	Иначе
		СтрокаJSON = Результат.ДанныеОтвета;
		Если СтрНачинаетсяС(СокрЛ(СтрокаJSON), "{") Тогда
			
			ДанныеОтвета = Неопределено;
			СерверЛояльностиПолучательДанныхКлиентСервер.ОбработатьJSON(СтрокаJSON, ДанныеОтвета);
			РезультатФункции.Вставить("ДанныеКарт", ДанныеОтвета.LoyaltyCardsList);
			
		КонецЕсли;
	КонецЕсли;
	РезультатФункции.Вставить("ТекстОшибки", ТекстОшибки);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ПараметрыМетодаНайтиКартуКлиента()
	
	ПараметрыПоискаКарт = СерверЛояльностиПолучательДанныхКлиентСервер.СтруктураПараметровНайтиКартуКлиента();
	ПараметрыПоискаКарт.ClientCardID = СтрокаПоиска;
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ПараметрыПоискаКарт.ClientGUID = Строка(Контрагент.УникальныйИдентификатор());
	Иначе
		ПараметрыПоискаКарт.ClientID = СтрокаПоиска;
	КонецЕсли;
	Если СтрНайти(СтрокаПоиска, "@") <> 0 Тогда
		ПараметрыПоискаКарт.Email = СтрокаПоиска;
	КонецЕсли;
	ПараметрыПоискаКарт.Phone = СтрокаПоиска;
	ПараметрыПоискаКарт.BlockBonuses = "0"; // Бонусы не блокируем, если только заполняем список карт

	Возврат ПараметрыПоискаКарт;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьМаскуВводаНомераТелефона()
	
	НоваяКартаТелефон = "";
	ЭкранированныйКодСтраны = СтрЗаменить(НоваяКартаКодСтраны, "9", "\9");
	Если СтрДлина(СокрЛП(НоваяКартаКодСтраны)) = 2 Тогда
		Элементы.НоваяКартаТелефон.Маска = ЭкранированныйКодСтраны + " 999 999 99 99";
	ИначеЕсли СтрДлина(СокрЛП(НоваяКартаКодСтраны)) = 3 Тогда
		Элементы.НоваяКартаТелефон.Маска = ЭкранированныйКодСтраны + " 99 999 99 99";
	ИначеЕсли СтрДлина(СокрЛП(НоваяКартаКодСтраны)) = 4 Тогда
		Элементы.НоваяКартаТелефон.Маска = ЭкранированныйКодСтраны + " 9 999 99 99";
	ИначеЕсли СтрДлина(СокрЛП(НоваяКартаКодСтраны)) = 5 Тогда
		Элементы.НоваяКартаТелефон.Маска = ЭкранированныйКодСтраны + " 999 99 99";
	Иначе
		Элементы.НоваяКартаТелефон.Маска = "";
	КонецЕсли;
	
	ПозицияРедактирования = СтрДлина(НоваяКартаКодСтраны) + 1;
	Элементы.НоваяКартаТелефон.УстановитьГраницыВыделения(ПозицияРедактирования, ПозицияРедактирования);
	
КонецПроцедуры	

&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, Параметр, Источник)
	
	ОбщегоНазначенияРМКПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Функция ПоискДоступен()
	Результат = ТекущееДействие = "Подтверждение"
		ИЛИ ТекущееДействие = "Поиск";
		
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СоздатьКартуКлиент()
	
	СтруктураРезультат = Неопределено;
	
	Если ИспользоватьСерверЛояльностиПолучательДанных Тогда
		ЗначенияПараметровМетода = ПараметрыМетодовБонуснойПодсистемы(Истина);
		ПараметрыВыполненияЗапроса = СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыЗапросаВыдатьКартуКлиенту(ПараметрыПодключенияКСерверуЛояльности, ЗначенияПараметровМетода);
		СтруктураРезультат = СерверЛояльностиПолучательДанныхКлиентСервер.ВыполнитьЗапросКСерверуЛояльности(ПараметрыВыполненияЗапроса);
		ОбработатьРезультатСозданияКартыНаКлиенте(СтруктураРезультат);
	ИначеЕсли ОбщегоНазначенияРМККлиент.СоздаватьЛокальноКартуЛояльности() Тогда
		СтруктураРезультат = ПараметрыЛокальногоСозданияКартыЛояльности();
		СоздатьЛокальноКартуЛояльности(СтруктураРезультат);
		ОбработатьРезультатСозданияКартыНаКлиенте(СтруктураРезультат);
	Иначе
		ОшибкаСервераЛояльности = НСтр("ru = 'Не предусмотрено локальное создание карт лояльности в этой базе.'");
		БаннерОткрыт = Истина;
	КонецЕсли;
	Если РежимЗаменыКарты Тогда
		ВыполнитьЗаменуКарты();
	КонецЕсли;
	Если СтруктураРезультат.ЕстьОшибки Тогда
		Пояснение = "";
		СтруктураРезультат.Свойство("Пояснение", Пояснение);
		ПоказатьОповещениеПользователя(СтруктураРезультат.ТекстОшибки, , Пояснение,
			БиблиотекаКартинок.Ошибка32);
		
	Иначе
		ТекущееДействие = "Подтверждение";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыМетодовБонуснойПодсистемы(ЭтоСозданиеНовойКарты = Ложь)
	
	СтатичныеПараметры	= СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы();
	ПрефиксПоля = ?(ЭтоСозданиеНовойКарты, "НоваяКарта", "НайденнаяКарта");
	
	Если ЭтоСозданиеНовойКарты Тогда 
		СтатичныеПараметры.Вставить("Client", ЭтотОбъект[ПрефиксПоля + "ФИО"]);
	КонецЕсли;
	
	СтатичныеПараметры.ClientCardTypeUID = НоваяКартаВидКарты;
	ДанныеКарты = ДанныеВидаКарты(НоваяКартаВидКарты);
	СтатичныеПараметры.GenerateNumber = ДанныеКарты.ГенерироватьНомер;
	
	Если ИнтерфейсРМКСлужебныйКлиентСервер.ПолученИдентификаторКартыЛояльности(ПараметрыКартыЛояльности) Тогда
		СтатичныеПараметры.Email		= "";
		СтатичныеПараметры.ClientCardID = ПараметрыКартыЛояльности.КодКарты;
		СтатичныеПараметры.Phone		= "";
		СтатичныеПараметры.DateOfBirth 	= ПараметрыКартыЛояльности.ДатаРождения;
		СтатичныеПараметры.CardGUID 	= ПараметрыКартыЛояльности.ИдентификаторКарты;
	Иначе
		СтатичныеПараметры.Email			= ЭтотОбъект[ПрефиксПоля + "Почта"];
		СтатичныеПараметры.ClientCardID		= ЭтотОбъект[ПрефиксПоля + "Номер"];
		СтатичныеПараметры.Phone			= ЭтотОбъект[ПрефиксПоля + "Телефон"];
		ТекстДаты = ЭтотОбъект[ПрефиксПоля + "ДатаРождения"];
		СтатичныеПараметры.DateOfBirth
			= ИнтерфейсРМКСлужебныйКлиентСервер.ПреобразоватьДатуИзСтроковогоПредставления(ТекстДаты);
		СтатичныеПараметры.CardGUID 	= Строка(Объект.ДисконтнаяКарта.УникальныйИдентификатор());
	КонецЕсли;
	СтатичныеПараметры.Store 			= Строка(Объект.ТорговыйОбъект.УникальныйИдентификатор());
	СтатичныеПараметры.GiftCardNumber	= "";
	СтатичныеПараметры.GiftCardUID		= "";
	СтатичныеПараметры.Promocode		= "";
	СтатичныеПараметры.Currency			= КодВалютыЦены;
	СтатичныеПараметры.Replacement		= Ложь;
	
	Возврат СтатичныеПараметры;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатСозданияКартыНаКлиенте(СтруктураРезультат)
	
	Если НЕ СтруктураРезультат.ЕстьОшибки Тогда
		
		Если ЗначениеЗаполнено(СтруктураРезультат.ДанныеОтвета) Тогда
			Если ТипЗнч(СтруктураРезультат.ДанныеОтвета) = Тип("Структура") Тогда
				ДанныеОтвета = СтруктураРезультат.ДанныеОтвета;
			Иначе
				ДанныеОтвета = Неопределено;
				СтрокаJSON = СтруктураРезультат.ДанныеОтвета;
				СерверЛояльностиПолучательДанныхКлиентСервер.ОбработатьJSON(СтрокаJSON, ДанныеОтвета);
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(ДанныеОтвета) = Тип("Структура") И ДанныеОтвета.Свойство("Error") И ДанныеОтвета.Error Тогда
			
			ТекстПредупреждения = НСтр("ru = 'Не удалось создать карту'");
			Если ДанныеОтвета.Свойство("ErrorMessage") Тогда
				ТекстПредупреждения = ДанныеОтвета.ErrorMessage;
			КонецЕсли;
			СтруктураРезультат.ЕстьОшибки = Истина;
			ОшибкаСервераЛояльности = ТекстПредупреждения;
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПредупреждения);
			
		ИначеЕсли ТипЗнч(ДанныеОтвета) = Тип("Структура") И ДанныеОтвета.Свойство("ElseClient") И ДанныеОтвета.ElseClient Тогда
			
			ТекстСообщения = НСтр("ru = 'Клиент с таким e-mail, но другим телефоном уже существует'");
			ВывестиДанныеСервераЛояльностиОСуществующейКарте(ДанныеОтвета, ТекстСообщения, Истина);
			ОшибкаСервераЛояльности = ТекстСообщения;
			
		ИначеЕсли ТипЗнч(ДанныеОтвета) = Тип("Структура") И ДанныеОтвета.Свойство("ExistingCard")
				И ДанныеОтвета.ExistingCard Тогда
			
			ТекстСообщения = НСтр("ru = 'Карта уже существует'");
			ВывестиДанныеСервераЛояльностиОСуществующейКарте(ДанныеОтвета, ТекстСообщения);
			ОшибкаСервераЛояльности = ТекстСообщения;
			
		Иначе
			ДобавленнаяСтрока = ДобавитьСозданнуюКартуВТаблицу(ДанныеОтвета);
			ЗаполнитьДанныеВыбраннойКарты(ДобавленнаяСтрока);
		КонецЕсли;
		
	Иначе
		
		ДополнительноеПояснение = "";
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураРезультат, "ТекстОшибки") Тогда
			ДополнительноеПояснение = СтрШаблон(НСтр("ru = 'по причине: %1'"), СтруктураРезультат.ТекстОшибки);
		КонецЕсли;
		ТекстПредупреждения = СтрШаблон("%1 %2", НСтр("ru = 'Не удалось создать карту'"), ДополнительноеПояснение);
		ОшибкаСервераЛояльности = ТекстПредупреждения;
		ПереключитьНаСтраницуСообщения();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиДанныеСервераЛояльностиОСуществующейКарте(ДанныеОтвета, ТекстСообщения, ТолькоКлиент = Ложь)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Если (Не ТолькоКлиент) И ДанныеОтвета.Свойство("CardID") Тогда
			НоваяКартаНомер = ДанныеОтвета.CardID;
		Иначе
			НоваяКартаНомер = "";
		КонецЕсли;
				
		Если ДанныеОтвета.Свойство("Client") Тогда
			НоваяКартаФИО = ДанныеОтвета.Client;
		Иначе
			НоваяКартаФИО = "";
		КонецЕсли;
				
		Если ДанныеОтвета.Свойство("PhoneNumber") Тогда
			МаскаТелефона = ИнтерфейсРМКСлужебныйКлиентСервер.МаскаВводаТелефона();
			НоваяКартаТелефон = ИнтерфейсРМКСлужебныйКлиентСервер.ПривестиЗначениеКМаскеТелефона(ДанныеОтвета.PhoneNumber,
				МаскаТелефона);
		КонецЕсли;
				
		Если ДанныеОтвета.Свойство("Email") Тогда
			НоваяКартаПочта = ДанныеОтвета.Email;
		Иначе
			НоваяКартаПочта = "";
		КонецЕсли;
		
		СтрокаXMLТолькоЧастьДата = Лев(ДанныеОтвета.DateOfBirth, 10);
		СтрокаДатыДляПреобразования = СтрЗаменить(СтрокаXMLТолькоЧастьДата, "-", "");
		ДатаРожденияКлиента = Дата(СтрокаДатыДляПреобразования);
		Если ДанныеОтвета.Свойство("DateOfBirth") Тогда
			НоваяКартаДатаРождения = ?(ЗначениеЗаполнено(ДатаРожденияКлиента),
				Формат(ДатаРожденияКлиента, "ДЛФ=D"), "");
		Иначе
			НоваяКартаДатаРождения = "";
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыЛокальногоСозданияКартыЛояльности()
	
	ПараметрыСоздания = СерверЛояльностиПолучательДанныхКлиентСервер.РезультатВыполненияЗапросаПоУмолчанию();
	ПараметрыСоздания.Вставить("ТекстСообщения", "");
	ПараметрыСоздания.Вставить("КартинкаСообщения");
	ПараметрыСоздания.Вставить("Пояснение", "");
	
	Возврат ПараметрыСоздания;
	
КонецФункции

&НаСервере
Процедура СоздатьЛокальноКартуЛояльности(СтруктураРезультат)
	ОбщегоНазначенияРМКПереопределяемый.СоздатьЛокальноКартуЛояльности(СтруктураРезультат, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидыДисконтныхКартФоновое()
	
	ИспользоватьВидКартыСЛ = Истина;
	ВидыКартЗаполнены = Ложь;
	ТаблицаВидыКарт.Очистить();
	
	ЗначениеПараметровВидовКарт = СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодаЗаполненияВидовКарт();
	ЗаполнитьПараметрыВидовКарт(ЗначениеПараметровВидовКарт);
		
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ПараметрыПодключенияКСерверуЛояльности", ПараметрыПодключенияКСерверуЛояльности);
	ПараметрыЗапуска.Вставить("ЗначенияПараметровМетода", ЗначениеПараметровВидовКарт);
	
	СтруктураПараметровВыполнения = Новый Структура;
	СтруктураПараметровВыполнения.Вставить("ВыполняемыйМетод", "ОбщегоНазначенияРМК.ПолучитьСписокВидовКарт");
	СтруктураПараметровВыполнения.Вставить("НаименованиеФоновогоЗадания", НСтр("ru = 'Заполнение списка видов дисконтных карт'"));
	СтруктураФоновогоЗадания				= ЗаполнитьСтруктуруФоновогоЗадания(ПараметрыЗапуска, СтруктураПараметровВыполнения);
	
	ДополнительныеПараметры = Новый Структура("ИмяОтложенногоМетода", "ОбработатьРезультатПолученияСпискаВидовКарт");
	ПараметрыОжидания 	= ЗаполнитьПараметрыОжидания();
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанныеССервераЛояльности", ЭтотОбъект, ДополнительныеПараметры), ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыВидовКарт(ЗначенияПараметровМетода)
	ЗначенияПараметровМетода.Store = СерверЛояльностиПолучательДанныхКлиентСервер.ПолучитьПараметрыСсылки(ТорговыйОбъект).Ref;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтруктуруФоновогоЗадания(ПараметрыЗапуска, СтруктураПараметровВыполнения)
	
	РезультатВыполнения 		= Неопределено;
	АдресРезультатаВыполнения	= ПоместитьВоВременноеХранилище(РезультатВыполнения, УникальныйИдентификатор);
	
	ПараметрыВыполнения 							= ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтруктураПараметровВыполнения.НаименованиеФоновогоЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.АдресРезультата 			= АдресРезультатаВыполнения;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	
	Если ПараметрыЗапуска.ЗначенияПараметровМетода = Неопределено Тогда
		СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, СтруктураПараметровВыполнения.ВыполняемыйМетод,
			ПараметрыЗапуска.ПараметрыПодключенияКСерверуЛояльности);
	Иначе
		СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, СтруктураПараметровВыполнения.ВыполняемыйМетод,
			ПараметрыЗапуска.ПараметрыПодключенияКСерверуЛояльности, ПараметрыЗапуска.ЗначенияПараметровМетода);
	КонецЕсли;
	
	Возврат СтруктураФоновогоЗадания;
КонецФункции

&НаКлиенте
Функция ЗаполнитьПараметрыОжидания()
	ПараметрыОжидания 	= ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОтменятьПриЗакрытииФормыВладельца = Истина;
	Возврат ПараметрыОжидания;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПервоначальныеДанныеСерверЛояльности()
	
	ЗаполнитьВидыДисконтныхКартФоновое();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПервоначальныеДанныеЛокально()
	Если ИспользоватьСерверЛояльностиПолучательДанных Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьТаблицуВидовКарт();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуВидовКарт()
	
	ТаблицаВидыКарт.Очистить();
	Элементы.НоваяКартаВидКарты.СписокВыбора.Очистить();
	ПараметрыВидовКарт = Новый Структура();
	ЗаполнитьПараметрыВидовКартЛокально(ПараметрыВидовКарт);
	СерверЛояльностиПолучательДанныхКлиентСерверПереопределяемый.ЗаполнитьТаблицуВидовКарт(ТаблицаВидыКарт, ПараметрыВидовКарт);
	
	ОбработатьРезультатПолученияВидовКарт(ТаблицаВидыКарт);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыВидовКартЛокально(ПараметрыВидовКарт)
	ПараметрыВидовКарт.Вставить("Магазин", Строка(ТорговыйОбъект.УникальныйИдентификатор()));
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатПолученияВидовКарт(ДанныеОтвета)
	Для каждого СтрокаМассива Из ДанныеОтвета Цикл
		Элементы.НоваяКартаВидКарты.СписокВыбора.Добавить(СтрокаМассива.Идентификатор, СтрокаМассива.Наименование);
	КонецЦикла;
	Элементы.НоваяКартаВидКарты.Доступность = Истина;
	ВидыКартЗаполнены = Истина;

	Если ТаблицаВидыКарт.Количество() = 1 Тогда
		ДанныеВидаКарты = ТаблицаВидыКарт[0];
		Если НЕ ЗначениеЗаполнено(НоваяКартаВидКарты) Тогда
			НоваяКартаВидКарты = ДанныеВидаКарты.Идентификатор;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиВидаКарты()
	
	Если НоваяКартаВидКарты <> "" Тогда
		ДанныеВидаКарты = ДанныеВидаКарты(НоваяКартаВидКарты);
		ЭтоИменнаяКарта = ДанныеВидаКарты.ЭтоИменнаяКарта;
		ПроверкаЗаполненностиНомера = ДанныеВидаКарты.ГенерироватьНомер ИЛИ ДанныеВидаКарты.ПрисваиватьНомерКартыКНомеруТелефона
			И ЭтоИменнаяКарта;
			
		УстановитьДоступностьЭлементаФормы(Элементы.НоваяКартаФИО, ЭтоИменнаяКарта);
		УстановитьДоступностьЭлементаФормы(Элементы.НоваяКартаТелефон, ЭтоИменнаяКарта);
		УстановитьДоступностьЭлементаФормы(Элементы.НоваяКартаПочта, ЭтоИменнаяКарта);
		УстановитьДоступностьЭлементаФормы(Элементы.НоваяКартаДатаРождения, ЭтоИменнаяКарта);
		
		Элементы.НоваяКартаФИО.ОтметкаОбязательногоЗаполнения = ЭтоИменнаяКарта;
		Элементы.НоваяКартаФИО.ОтметкаНезаполненного = ЭтоИменнаяКарта;
		Элементы.НоваяКартаФИО.АвтоОтметкаНезаполненного = ЭтоИменнаяКарта;
		
		Элементы.НоваяКартаТелефон.ОтметкаОбязательногоЗаполнения = ЭтоИменнаяКарта И ОтправлятьSMSКодПриЗаведенииКарты;
		Элементы.НоваяКартаТелефон.ОтметкаНезаполненного = ЭтоИменнаяКарта И ОтправлятьSMSКодПриЗаведенииКарты;
		Элементы.НоваяКартаТелефон.АвтоОтметкаНезаполненного = ЭтоИменнаяКарта И ОтправлятьSMSКодПриЗаведенииКарты;
		
		Элементы.НоваяКартаНомер.ОтметкаОбязательногоЗаполнения = НЕ ПроверкаЗаполненностиНомера;
		Элементы.НоваяКартаНомер.ОтметкаНезаполненного = НЕ ПроверкаЗаполненностиНомера;
		Элементы.НоваяКартаНомер.АвтоОтметкаНезаполненного = НЕ ПроверкаЗаполненностиНомера;
		
		Элементы.НоваяКартаНомер.Доступность = Истина;
		Элементы.НоваяКартаНомер.КнопкаВыбора = НЕ ПроверкаЗаполненностиНомера;
		СогласиеТребуется = ЭтоИменнаяКарта;
		
		Если ПроверкаЗаполненностиНомера Тогда
			Если ДанныеВидаКарты.ПрисваиватьНомерКартыКНомеруТелефона Тогда
				Элементы.НоваяКартаНомер.ПодсказкаВвода = НСтр("ru = 'Номер телефона'");
				Элементы.НоваяКартаНомер.Доступность = Ложь;
			Иначе
				Если ПустаяСтрока(ДанныеВидаКарты.ПредставлениеШаблона) Тогда
					Элементы.НоваяКартаНомер.ПодсказкаВвода = НСтр("ru = 'Сгенерированный номер'");
				Иначе
					Элементы.НоваяКартаНомер.ПодсказкаВвода = ДанныеВидаКарты.ПредставлениеШаблона;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Элементы.НоваяКартаНомер.ПодсказкаВвода = НСтр("ru = 'Номер карты'");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСтроки(ДанныеСтроки, СтрокиСписания = Неопределено)
	
	Если ДанныеСтроки.КартаНедействительна Тогда
		ТекстСообщения = НСтр("ru = 'Дисконтная карта %1 недействительна'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДанныеСтроки.ДисконтнаяКартаПредставление);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	УстановитьОсновнуюКарту(ДанныеСтроки);
	
	ЗаполнитьДанныеВыбраннойКарты(ДанныеСтроки);
	ПереключитьНаСтраницуПодтвержденияДанныхПокупателя(); 

КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьДанныеСтрокиМассива(СтрокаТаблицы)
	СтруктураСтрокиКарты = Новый Структура;
	СтруктураСтрокиКарты.Вставить("ДисконтнаяКарта", СтрокаТаблицы.ДисконтнаяКарта);
	СтруктураСтрокиКарты.Вставить("ИдентификаторКарты", СтрокаТаблицы.ИдентификаторКарты);
	СтруктураСтрокиКарты.Вставить("КодКарты", СтрокаТаблицы.КодКарты);
	СтруктураСтрокиКарты.Вставить("ОстатокБонусныхБаллов", СтрокаТаблицы.ОстатокБонусныхБаллов);
	СтруктураСтрокиКарты.Вставить("КурсБонусов", СтрокаТаблицы.КурсБонусов);
	Возврат СтруктураСтрокиКарты;
КонецФункции

&НаКлиенте
Процедура УстановитьОсновнуюКарту(ВыбраннаяСтрока = Неопределено)
	ТекущаяСтрока = ВыбраннаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = Элементы.ТаблицаДанных.ТекущиеДанные;
	КонецЕсли;
	Если ТекущаяСтрока.КартаНедействительна Тогда
		ТекстСообщения = НСтр("ru = 'Дисконтная карта %1 недействительна'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ТекущаяСтрока.ДисконтнаяКартаПредставление);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаКарты Из ТаблицаДанных Цикл
		СтрокаКарты.Отметка = СтрокаКарты = ТекущаяСтрока;
		Если СтрокаКарты.Отметка Тогда
			КурсБонусов = ?(СтрокаКарты.КурсБонусов = 0, 1, СтрокаКарты.КурсБонусов);
		КонецЕсли;
	КонецЦикла;
	ТаблицаДанных.Сортировать("Отметка Убыв, ОстатокБонусныхБаллов Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаменуКарты()
	
	Если ИспользоватьСерверЛояльностиПолучательДанных Тогда
		ОбъединитьДисконтныеКартыСерверЛояльности();
	Иначе
		СтруктураОтвета = Новый Структура("Error, ErrorMessage", Ложь, "");
		ОбъединитьДисконтныеКартыЛокально(СтруктураОтвета);
	КонецЕсли;
	
	ВыполнитьПоискКарты(СтрокаПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьДисконтныеКартыСерверЛояльности(СтрокиДляОбработки = Неопределено)
	ЗначенияПараметровМетода = Неопределено;
	СтруктураПараметров = СерверЛояльностиПолучательДанныхКлиентСервер.СтруктураПараметровОбъединенияКарт();
	СтруктураПараметров.BonusProgramm = БонуснаяПрограмма;
	ОбщийОстатокБонуснов = 0;
	ВыделенныеСтроки = Элементы.ТаблицаДанных.ПолучитьСтрокиДляОбработки();
	Если СтрокиДляОбработки = Неопределено И ВыделенныеСтроки <> Неопределено Тогда
		СтрокиДляОбработки = Новый Массив;
		Для Каждого ИндексСтроки Из ВыделенныеСтроки Цикл
			Если СтрокиДляОбработки = Неопределено Тогда
				СтрокиДляОбработки = Новый Массив;
			КонецЕсли;
			СтрокаДляОбъединения = ТаблицаДанных.НайтиПоИдентификатору(ИндексСтроки);
			Если НЕ СтрокаДляОбъединения = Неопределено Тогда
				СтрокиДляОбработки.Добавить(СтрокаДляОбъединения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если СтрокиДляОбработки = Неопределено Тогда
		СтрокиДляОбработки = ТаблицаДанных;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из СтрокиДляОбработки Цикл
		Если НЕ СтрокаТаблицы.Отметка Тогда
			Если КурсБонусов = 0 Тогда
				ОбщийОстатокБонуснов = 0;
			Иначе
				ОбщийОстатокБонуснов = ОбщийОстатокБонуснов + СтрокаТаблицы.ОстатокБонусныхБаллов * СтрокаТаблицы.КурсБонусов / КурсБонусов;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	МассивКарт = Новый Массив;
	Для Каждого СтрокаТаблицы Из СтрокиДляОбработки Цикл
		Если СтрокаТаблицы.Отметка Тогда
			СтруктураПараметров.BonusCardGUID = СтрокаТаблицы.ИдентификаторКарты;
			СтруктураПараметров.BonusCardNumber = СтрокаТаблицы.КодКарты;
			СтрокаПоиска = СтрокаТаблицы.КодКарты;
			Продолжить;
		КонецЕсли;
		СтруктураСтроки = СерверЛояльностиПолучательДанныхКлиентСервер.СтруктураСтрокиБонуснойКарты();
		СтруктураСтроки.CardGUID = СтрокаТаблицы.ИдентификаторКарты;
		СтруктураСтроки.CardNumber = СтрокаТаблицы.КодКарты;
		СтруктураСтроки.BonusesCount = СтрокаТаблицы.ОстатокБонусныхБаллов;
		МассивКарт.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	СтруктураПараметров.BonusCards = МассивКарт;
	
	ПараметрыВыполненияЗапроса = СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыЗапросаОбъединитьБонусныеКарты(ПараметрыПодключенияКСерверуЛояльности, СтруктураПараметров);
	Результат = СерверЛояльностиПолучательДанныхКлиентСервер.ВыполнитьЗапросКСерверуЛояльности(ПараметрыВыполненияЗапроса);
	Если Результат.ЕстьОшибки Тогда
		ТекстЗаголовка = НСтр("ru = 'Ошибка объединения бонусных карт.'");
			ОшибкаСервераЛояльности = СтрШаблон("%1: 
			|%2", ТекстЗаголовка, Результат.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ДанныеОтвета = Неопределено;
	СтрокаJSON = Результат.ДанныеОтвета;
	СерверЛояльностиПолучательДанныхКлиентСервер.ОбработатьJSON(СтрокаJSON, ДанныеОтвета);
	
	Если НЕ ДанныеОтвета = Неопределено Тогда 
		Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			Если НЕ СтрокаТаблицы.Отметка Тогда
				ЗаполнитьДанныеБонуснойКарты(СтрокаТаблицы, ЗначенияПараметровМетода);
				РазблокироватьБонусыКартыСерверЛояльности(ЗначенияПараметровМетода);
			КонецЕсли;
		КонецЦикла;

		Если ДанныеОтвета.Свойство("Error") И ДанныеОтвета.Error Тогда 
			
			ТекстЗаголовка = НСтр("ru = 'Ошибка объединения бонусных карт.'");
			ТекстОшибки = СтрШаблон(НСтр("ru = '%1'"), ДанныеОтвета.ErrorMessage);
			ОшибкаСервераЛояльности = СтрШаблон("%1: 
			|%2", ТекстЗаголовка,ТекстОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбъединитьДисконтныеКартыЛокально(СтруктураОтвета, СтрокиДляОбработки = Неопределено)
	
	Если СтрокиДляОбработки = Неопределено Тогда
		ТаблицаВыбранныхКарт = ТаблицаДанных.Выгрузить();
	Иначе
		ТаблицаВыбранныхКарт = СтрокиДляОбработки;
	КонецЕсли;
	
	СтрокиНачисления = ТаблицаДанных.НайтиСтроки(Новый Структура("Отметка", Истина));
	Если СтрокиНачисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СтрокаПоиска = СтрокиНачисления[0].КодКарты;
	ОбщегоНазначенияРМКПереопределяемый.ОбъединитьБонусныеБаллы(СтрокиНачисления[0].БонуснаяПрограмма, СтрокиНачисления[0].ДисконтнаяКарта,
		ТаблицаВыбранныхКарт, СтруктураОтвета);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеБонуснойКарты(ПараметрыКартыЛояльности, ПараметрыВыполненияМетода)
	ПараметрыВыполненияМетода	= СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы();
	ПараметрыВыполненияМетода.CardGUID 	= ПараметрыКартыЛояльности.ИдентификаторКарты;
	ПараметрыВыполненияМетода.ClientCardID = ПараметрыКартыЛояльности.КодКарты;
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьБонусыКартыСерверЛояльности(ЗначенияПараметровМетода)
	ИмяРесурса = "unlockclientbonuses3_0";
	ПараметрыВыполненияЗапроса = СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыЗапросаРазблокироватьБонусыКлиента(ПараметрыПодключенияКСерверуЛояльности,
			ЗначенияПараметровМетода, ИмяРесурса);
	Результат = СерверЛояльностиПолучательДанныхКлиентСервер.ВыполнитьЗапросКСерверуЛояльности(ПараметрыВыполненияЗапроса);
	
	ОшибкаРазблокировки = Ложь;
	СтрокаJSON = Результат.ДанныеОтвета;
	СообщениеОбОшибке = "";
	Если НЕ СтрНачинаетсяС(СокрЛ(СтрокаJSON), "{")
		И Не СтрокаJSON = НСтр("ru = 'Бонусы разблокированы'") Тогда
		ОшибкаРазблокировки = Истина;
		СообщениеОбОшибке = НСтр("ru = 'Не удалось разблокировать бонусы. Пожалуйста, обратитесь к администратору'");
	КонецЕсли;
	
	ДанныеОтвета = Неопределено;
	СерверЛояльностиПолучательДанныхКлиентСервер.ОбработатьJSON(СтрокаJSON, ДанныеОтвета);
	Если НЕ ДанныеОтвета = Неопределено Тогда
		ОшибкаРазблокировки = ДанныеОтвета.Error;
		СообщениеОбОшибке = ДанныеОтвета.ErrorMessage;
	КонецЕсли;

	Если ОшибкаРазблокировки Тогда
		ТекстЗаголовка = НСтр("ru = 'Ошибка разблокировки бонусов.'");
		ОшибкаСервераЛояльности = СтрШаблон("%1: 
		|%2", ТекстЗаголовка, СообщениеОбОшибке);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ОшибкиЗаполненияПриСозданииКартыЛояльности()
	
	ЕстьОшибки = Ложь;
	Результат = Новый Структура("ЕстьОшибки, ТекстПояснения, ИменаНезаполненныхПолей", Ложь, "", "");
	
	ИменаНезаполненныхПолей = "";
	
	ТекстПояснения = "";
	Если ИспользоватьСерверЛояльностиПолучательДанных И ИспользоватьВидКартыСЛ Тогда
		ДанныеВидаКарты = ДанныеВидаКарты(НоваяКартаВидКарты); 
		Если НЕ ЗначениеЗаполнено(ДанныеВидаКарты.Идентификатор) Тогда
			ТекстШаблон = НСтр("ru = '%1""Вид карты"" %2'");
			ИменаНезаполненныхПолей = СтрШаблон(ТекстШаблон, ИменаНезаполненныхПолей, Символы.ПС);
			ТекстПояснения = НСтр("ru = 'Укажите вид карты'");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ИменаНезаполненныхПолей) Тогда
		ЕстьОшибки = Истина;
		Результат.Вставить("ИменаНезаполненныхПолей", ИменаНезаполненныхПолей);
		Результат.Вставить("ЕстьОшибки", ЕстьОшибки);
		Результат.Вставить("ТекстПояснения", ТекстПояснения);
		Возврат Результат;
	КонецЕсли;
	
	ИменаНезаполненныхПолей = "";
	
	ЭтоИменнаяКарта = Истина;
	ПроверкаЗаполненностиНомера = Истина;
	Если ЗначениеЗаполнено(НоваяКартаВидКарты) Тогда
		ДанныеВидаКарты = ДанныеВидаКарты(НоваяКартаВидКарты);
		Если ЗначениеЗаполнено(ДанныеВидаКарты.Идентификатор) Тогда
			ЭтоИменнаяКарта = ДанныеВидаКарты.ЭтоИменнаяКарта;
			ГенерироватьНомер = ДанныеВидаКарты.ГенерироватьНомер;
			ПроверкаЗаполненностиНомера = НЕ (ГенерироватьНомер ИЛИ(ДанныеВидаКарты.ПрисваиватьНомерКартыКНомеруТелефона И ЭтоИменнаяКарта)) ;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НоваяКартаНомер) И ПроверкаЗаполненностиНомера Тогда
		
		ТекстШаблон = НСтр("ru = '%1""Номер карты"" %2'");
		ИменаНезаполненныхПолей = СтрШаблон(ТекстШаблон, ИменаНезаполненныхПолей, Символы.ПС);
		
	ИначеЕсли ЗначениеЗаполнено(НоваяКартаНомер) Тогда
		
		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(НоваяКартаНомер, Ложь, "1234567890") Тогда
			ТекстПояснения = ТекстПояснения
				+ НСтр("ru = 'Доступные символы поля ""Номер карты"" - цифры и латинские буквы'") + Символы.ПС;
		КонецЕсли;
			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НоваяКартаТелефон) И (ЭтоИменнаяКарта И ОтправлятьSMSКодПриЗаведенииКарты) Тогда
		
		ТекстШаблон = НСтр("ru = '%1""Телефон"" %2'");
		ИменаНезаполненныхПолей = СтрШаблон(ТекстШаблон, ИменаНезаполненныхПолей, Символы.ПС);
		ТекстПояснения = НСтр("ru = 'Заполните номер телефона владельца карты'");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НоваяКартаФИО) И ЭтоИменнаяКарта Тогда
		
		ТекстШаблон = НСтр("ru = '%1""Имя и фамилия"" %2'");
		ИменаНезаполненныхПолей = СтрШаблон(ТекстШаблон, ИменаНезаполненныхПолей, Символы.ПС);
		ТекстПояснения = НСтр("ru = 'Заполните имя и фамилию владельца карты'");
		
	КонецЕсли;
	
	МассивЦифрДаты = ИнтерфейсРМКСлужебныйКлиентСервер.СформироватьМассивЦифрДаты(НоваяКартаДатаРождения);
	Если Не (ИнтерфейсРМКСлужебныйКлиентСервер.МассивЦифрПустой(МассивЦифрДаты)
		Или ИнтерфейсРМКСлужебныйКлиентСервер.МассивЦифрЗаполненПолностью(МассивЦифрДаты)) Тогда
			ТекстПояснения = ТекстПояснения
				+ НСтр("ru = 'Неверно указана дата рождения клиента. Пожалуйста, введите корректные данные.'") + Символы.ПС;
				
	КонецЕсли;
	
	НомерТелефонаНовогоКлиента = ОбщегоНазначенияРМККлиентСервер.ПодготовитьНомерТелефона(НоваяКартаТелефон);
	
	НомерТелефонаВведенКорректно = ЗначениеЗаполнено(НомерТелефонаНовогоКлиента) ИЛИ НЕ ЭтоИменнаяКарта;
	
	Если НЕ НомерТелефонаВведенКорректно Тогда
		ТекстПояснения = ТекстПояснения + НСтр("ru = 'Номер телефона введен не корректно'");
	КонецЕсли;
	
	ПроверятьАдресЭлектроннойПочты = ЗначениеЗаполнено(НоваяКартаПочта);
	АдресЭлектроннойПочтыВведенКорректно = Истина;
	
	Если ПроверятьАдресЭлектроннойПочты Тогда
		
		АдресЭлектроннойПочтыВведенКорректно =
			ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(НоваяКартаПочта);
		
		Если НЕ АдресЭлектроннойПочтыВведенКорректно Тогда
			ТекстПояснения = ТекстПояснения + НСтр("ru = 'Адрес электронной почты введен не корректно'");
		КонецЕсли;
		
	КонецЕсли;
	
		
	Если НЕ (ПустаяСтрока(ТекстПояснения) И ПустаяСтрока(ИменаНезаполненныхПолей)) Тогда
		
		Если НЕ ПустаяСтрока(ИменаНезаполненныхПолей) Тогда
			
			ТекстШаблон = НСтр("ru = 'Пожалуйста, заполните следующие поля: %1%2'");
			ТекстПояснения = СтрШаблон(ТекстШаблон, Символы.ПС, ИменаНезаполненныхПолей);
			
		КонецЕсли;
		
		Результат.Вставить("ТекстПояснения", ТекстПояснения);
		ЕстьОшибки = Истина;
		
	КонецЕсли;
	
	Результат.Вставить("ЕстьОшибки", ЕстьОшибки);

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗапроситьДанныеБонусов()
	
	Если Не ИспользоватьОплатуБонусами Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьСерверЛояльностиПолучательДанных Тогда
		
		Если (ЗначениеЗаполнено(Объект.ДисконтнаяКарта) Или ЗначениеЗаполнено(Объект.Контрагент)
				Или ИнтерфейсРМКСлужебныйКлиентСервер.ПолученИдентификаторКартыЛояльности(ПараметрыКартыЛояльности)) Тогда
				
			ЗначенияПараметровМетода = ПараметрыМетодовБонуснойПодсистемы();
			ПараметрыВыполненияЗапроса
				= СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыЗапросаПолучитьБонусыКлиента(ПараметрыПодключенияКСерверуЛояльности,
					ЗначенияПараметровМетода);
			Результат = СерверЛояльностиПолучательДанныхКлиентСервер.ВыполнитьЗапросКСерверуЛояльности(ПараметрыВыполненияЗапроса);
			
			Если Результат.ЕстьОшибки Тогда
				
				ДополнительноеПояснение = "";
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "ТекстОшибки") Тогда
					ДополнительноеПояснение = СтрШаблон(НСтр("ru = ' по причине: %1'"), Результат.ТекстОшибки);
				КонецЕсли;
				
				ТекстПредупреждения = СтрШаблон("%1 %2",
					НСтр("ru = 'Не удалось получить сведения о бонусном балансе клиента'"),
						ДополнительноеПояснение);
				ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстПредупреждения);
				ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
				ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыОткрытияОшибки);
			
				Возврат;
				
			КонецЕсли;
			
			СтрокаJSON = Результат.ДанныеОтвета;
			Если НЕ СтрНачинаетсяС(СокрЛ(СтрокаJSON), "{") Тогда
				Элементы.ДекорацияПодсказкаОплатаБонусами.Заголовок = СтрокаJSON;
				Возврат;
			КонецЕсли;
			
			ДанныеОтвета = Неопределено;
			СерверЛояльностиПолучательДанныхКлиентСервер.ОбработатьJSON(СтрокаJSON, ДанныеОтвета);
			
			Если НЕ ДанныеОтвета = Неопределено И ДанныеОтвета.Свойство("ClientNotFound") 
				И НЕ ДанныеОтвета.ClientNotFound Тогда
				
			КонецЕсли;
			
		КонецЕсли;
			
	ИначеЕсли ОбщегоНазначенияРМККлиент.ИспользоватьЗапросБонусовЛокально() Тогда
		
		ДобавитьЛокальнуюКартуКонтрагентаПриНеобходимости();
		ЗапроситьДанныеБонусовЛокально();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЛокальнуюКартуКонтрагентаПриНеобходимости()

	Если ЗначениеЗаполнено(Объект.Контрагент)
			И Не ИнтерфейсРМКСлужебныйКлиентСервер.ДанныеДисконтнойКартыЗаполнены(ЭтотОбъект) Тогда
		ЗаполнитьДанныеТаблицыКарт(Новый Массив, Новый Массив, Объект.Контрагент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоЧисловоеПоле(ЭлементВводаСуммы)
	
	РезультатФункции = Ложь;
	
	ЧисловыеПоляДанныхПокупателя = Новый Массив;
	Если Не ЧисловыеПоляДанныхПокупателя.Найти(ЭлементВводаСуммы) = Неопределено Тогда
		РезультатФункции = Истина;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ВернутьПредыдущееЗначениеТекстаДаты(ЭлементВводаДаты)
	ДлинаТекстаДаты = 10;
	ЭлементВводаДаты.УстановитьГраницыВыделения(1,ДлинаТекстаДаты + 1);
	ЭлементВводаДаты.ВыделенныйТекст = ТекстДатыРожденияСозданиеКарты;
КонецПроцедуры

&НаКлиенте
Функция ТребуетсяНастройкаКнопокЦифровойПанели(Текст)
	
	РезультатФункции = Ложь;
	Если (Не РежимКассыСамообслуживания) И (СтрокаПоиска = "" И Не Текст = "")
			Или Текст = "" Тогда
		
		РезультатФункции = Истина;
		
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьВидКарты(Штрихкод, Результат)
	ДлинаКода = СтрДлина(Штрихкод);
	ИдентификаторВидаКарты = "";
	СтрокиТаблицы = ТаблицаВидыКарт.НайтиСтроки(Новый Структура("ДлинаДиапазона", ДлинаКода));
	Для Каждого СтрокаМассив Из СтрокиТаблицы Цикл
		Если СтрокаМассив.НачалоДиапазона <= Штрихкод
			И СтрокаМассив.КонецДиапазона >= Штрихкод Тогда
				ИдентификаторВидаКарты = СтрокаМассив.Идентификатор;
		КонецЕсли;
	КонецЦикла;
	Если Не ПустаяСтрока(ИдентификаторВидаКарты) Тогда
		НоваяКартаВидКарты = ИдентификаторВидаКарты;
		ЗаполнитьНастройкиВидаКарты();
		Результат = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ОписаниеТипаДата = Новый ОписаниеТипов("Дата");
	МассивЦифрДаты = ИнтерфейсРМКСлужебныйКлиентСервер.СформироватьМассивЦифрДаты(Текст);
	Если ИнтерфейсРМКСлужебныйКлиентСервер.МассивЦифрЗаполненПолностью(МассивЦифрДаты) Тогда
		ДатаКаноническаяСтрока = ИнтерфейсРМКСлужебныйКлиентСервер.СформироватьКаноническуюСтрокуДатыИзМассиваЦифр(МассивЦифрДаты);
		ПолученнаяДата = ОписаниеТипаДата.ПривестиЗначение(ДатаКаноническаяСтрока);
		Если Не ЗначениеЗаполнено(ПолученнаяДата) Тогда
			ВернутьПредыдущееЗначениеТекстаДаты(Элемент);
		Иначе
			ТекстДатыРожденияСозданиеКарты = Текст;
		КонецЕсли;
	Иначе
		Если ИнтерфейсРМКСлужебныйКлиент.НекорректноВведеныЦифрыДаты(МассивЦифрДаты) Тогда
			ВернутьПредыдущееЗначениеТекстаДаты(Элемент);
		Иначе
			ТекстДатыРожденияСозданиеКарты = Текст;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяКартаТелефонПриИзменении(Элемент)
	НомерТелефонаЗаполнен = ЗначениеЗаполнено(НоваяКартаТелефон);
	Элементы.КодПроверкиИзSMSНовойКарты.Доступность = НомерТелефонаЗаполнен;
КонецПроцедуры

&НаКлиенте
Процедура КодПроверкиИзSMSНовойКартыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СменитьЭлементВводаДанныхПокупателя(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КодПроверкиИзSMSНайденнойКартыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СменитьЭлементВводаДанныхПокупателя(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьНаСуществующуюКарту(Команда)
	РежимЗаменыКарты = Истина;
	
	СтрокиСОтметкой = ТаблицаДанных.НайтиСтроки(Новый Структура("Отметка", Истина));
	Для Каждого СтрокаНаЗамену Из СтрокиСОтметкой Цикл
		СтрокаНаЗамену.Отметка = Ложь;
		СтрокаНаЗамену.ОтметкаЗамена = Истина;
	КонецЦикла;
	СтрокиУдалить = Новый Массив;
	Для Каждого СтрокаУдалить Из ТаблицаДанных Цикл
		Если СтрокиСОтметкой.Найти(СтрокаУдалить) = Неопределено Тогда
			СтрокиУдалить.Добавить(СтрокаУдалить);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
		ТаблицаДанных.Удалить(СтрокаУдалить);
	КонецЦикла;
	ПереключитьНаСтраницуПоискаКарты();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСохранитьТолькоНомерКартыНажатие(Элемент)
	СохранитьТолькоНомерКарты = Истина;
	НастроитьЭлементыФормыКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСохранитьТолькоНомерКартыОтменаНажатие(Элемент)
	СохранитьТолькоНомерКарты = Ложь;
	НастроитьЭлементыФормыКлиент();
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Интерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ИнтерфейсТакси = Не Интерфейс85;
	
КонецПроцедуры 

&НаКлиенте
Процедура ГиперссылкаКартаДолжнаБытьИменнаяВернутьсяНажатие(Элемент)
	ПереключитьНаСтраницуПоискаКарты();
КонецПроцедуры

#Область ОтправкаЧека
&НаКлиенте
Процедура ЗаполнитьРезультатОтправкаЧека(ХочуБумажныйЧек = Ложь)
	
	Если ЗначениеЗаполнено(ОтправкаЧекаТелефон) Тогда
		МаскаТелефона = ИнтерфейсРМКСлужебныйКлиентСервер.МаскаВводаТелефона();
		ДлинаМаски = СтрДлина(МаскаТелефона);
		ДлинаВведенногоНомера = СтрДлина(СокрЛП(ОтправкаЧекаТелефон));
		Если ДлинаМаски <> ДлинаВведенногоНомера Тогда
			Если ХочуБумажныйЧек Тогда
				ОтправкаЧекаТелефон = "";
			Иначе
				ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(НСтр("ru = 'Проверьте корректность введенного номера телефона.'"));
				ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
				ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыОткрытияОшибки);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтправкаЧекаПочта)
		И НЕ ЗначениеЗаполнено(ОтправкаЧекаТелефон)
		И НЕ ХочуБумажныйЧек Тогда
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(НСтр("ru = 'Не заполнены данные для отправки'"));
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыОткрытияОшибки);
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ОтправкаЧекаПочта", ОтправкаЧекаПочта);
	Результат.Вставить("ОтправкаЧекаТелефон", ОтправкаЧекаТелефон);
	Результат.Вставить("ХочуБумажныйЧек", ХочуБумажныйЧек);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура НастроитьГорячиеКлавиши()
	
	Если РежимКассыСамообслуживания Или НЕ ЗначениеЗаполнено(ТекущаяНастройкаРМК) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Команда Из ТекущаяНастройкаРМК.ГорячиеКлавиши Цикл
		
		КомандаНаФорме = Элементы.Найти(Команда.ИмяКнопки);
		Если НЕ КомандаНаФорме = Неопределено Тогда
			
			СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша[Команда.Клавиша],
				Команда.АкселераторAlt,
				Команда.АкселераторCtrl,
				Команда.АкселераторShift);
			
			КомандаНаФорме.СочетаниеКлавиш = СочетаниеКлавиш;
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКомандыВРежимеКассыСамообслуживания()
	
	Если РежимКассыСамообслуживания Тогда
		ЭтотОбъект.ОтображатьКоманднуюПанель = Ложь;
		Элементы.ВыборКонтрагента.Видимость = Ложь;
		Элементы.СоздатьКарту.Видимость = Ложь;
		
		Элементы.КомандыФормы.Высота = 3;
		Элементы.КомандыФормы.РастягиватьПоВертикали = Ложь;
		Для Каждого ЭлементГруппы Из Элементы.КомандыФормы.ПодчиненныеЭлементы Цикл
			Если ТипЗнч(ЭлементГруппы) = Тип("КнопкаФормы") Тогда
				ЭлементГруппы.РастягиватьПоВертикали = Истина;
			КонецЕсли;
		КонецЦикла;
		Элементы.ГруппаНайденнойКартыФИО.Видимость = Ложь;
		Элементы.ГруппаНайденнойКартыДатаРождения.Видимость = Ложь;
		Элементы.ГруппаНайденнойКартыПочта.Видимость = Ложь;
		Элементы.ГруппаДанныеНайденнойКартыСтатистикаПраво.Видимость = Ложь;
		Элементы.СтраницаСоздания.Видимость = Ложь;
		Элементы.СтраницаВыбора.Видимость = Ложь;
		Элементы.СтрокаПоиска.ПодсказкаВвода = НСтр("ru = 'Телефон, номер карты'");
		ЭтотОбъект.ОтображатьКнопкуЗакрытия = Ложь;
		Если ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
			ЭтотОбъект.ОтображатьЗаголовок = Ложь;
			Элементы.ЗаголовокФормы.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементаФормы(Элемент, Видимость)
	Элемент.Видимость = Видимость;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементаФормы(Элемент, Доступность)
	Элемент.Доступность = Доступность;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСозданиеКартыКлиент()
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОповещениеОтменитьСозданиеКарты", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'При закрытии данные будут потеряны. Продолжить?'");
	ПоказатьВопрос(ОповещениеОЗакрытии,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуДаннымиКонтрагента()
	НайденнаяКартаЛояльности = Неопределено;
	Если ЗначениеЗаполнено(Объект.Контрагент) И Не ЗначениеЗаполнено(Объект.ДисконтнаяКарта) Тогда
		ШтрихкодированиеРМКПереопределяемый.ЗаполнитьДанныеНайденнойКартыЛояльности(
			Объект.Контрагент, НайденнаяКартаЛояльности);
	КонецЕсли;
	
	Если Не НайденнаяКартаЛояльности = Неопределено Тогда
		
		Если ЗначениеЗаполнено(НайденнаяКартаЛояльности.АдресЭПВладельцаКарты) Тогда
			ОтправкаЧекаПочта = НайденнаяКартаЛояльности.АдресЭПВладельцаКарты;
			НоваяКартаПочта = НайденнаяКартаЛояльности.АдресЭПВладельцаКарты;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяКартаЛояльности.НомерТелефонаВладельцаКарты) Тогда
			
			МаскаТелефона = ИнтерфейсРМКСлужебныйКлиентСервер.МаскаВводаТелефона();
			ИсходныйНомер = НайденнаяКартаЛояльности.НомерТелефонаВладельцаКарты;
			ОтправкаЧекаТелефон
				= ИнтерфейсРМКСлужебныйКлиентСервер.ПривестиЗначениеКМаскеТелефона(ИсходныйНомер, МаскаТелефона);
			НоваяКартаТелефон = НайденнаяКартаЛояльности.НомерТелефонаВладельцаКарты;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СокрЛП(НайденнаяКартаЛояльности.ФИО)) Тогда
			НоваяКартаФИО = НайденнаяКартаЛояльности.ФИО;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс
&НаКлиенте
Процедура ВыполнитьЗаменуИЗакрытьФрму(Результат, ДополнительныеПараметры) Экспорт
	
	СтрокиДляОбработки = Новый Массив;
	Для Каждого СтрокаЗаменить Из ТаблицаДанных.НайтиСтроки(Новый Структура("Отметка", Истина)) Цикл
		СтрокиДляОбработки.Добавить(СтрокаЗаменить);
	КонецЦикла;
	Для Каждого СтрокаНаЗамену Из ТаблицаДанных.НайтиСтроки(Новый Структура("ОтметкаЗамена", Истина)) Цикл
		СтрокиДляОбработки.Добавить(СтрокаНаЗамену);
	КонецЦикла;
	ВыполнитьОбъединение(СтрокиДляОбработки);
	РезультатПоиска = ПолучитьРезультатПоискаКарты();
	Закрыть(РезультатПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборПокупателя(Результат, ДополнительныеПараметры) Экспорт
	
	УстановитьВыбранногоКонтрагента(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыбранногоКонтрагента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Контрагент = Результат;
	Контрагент = Результат;
	ПродолжатьБезКарты = Истина;
	Если НЕ ТекущееДействие = "ОтправкаЧека" Тогда
		ТекущееДействие = "Поиск";
		ВыполнитьПоискКарты(СтрокаПоиска);
	КонецЕсли;
	ЗаполнитьФормуДаннымиКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборКартыКлиентаСервераЛояльности(ВыбранноеОписаниеКарты, ШтрихкодОригинал,
		ЗапросНаБлокировку = Истина) Экспорт
	Если ВыбранноеОписаниеКарты.Свойство("Valid") Тогда
		Если НЕ ВыбранноеОписаниеКарты.Valid Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если ЗапросНаБлокировку И ВыбранноеОписаниеКарты.BonusData.BonusCount <= 0 Тогда
		ЗапросНаБлокировку = Ложь;
	КонецЕсли;
	ЗавершитьВводКартыЛояльностиПоШтрихкоду(ЗапросНаБлокировку);
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоПодбор(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, Пол = 0) Экспорт
	
	ТекстДляАвтоПодбора = СокрЛП(Текст);
	Если СтрДлина(ТекстДляАвтоПодбора) < 1 Тогда
		Возврат;
	КонецЕсли;

	ДанныеВыбора 			= Новый СписокЗначений;    
	ДанныеКлассификатора    = Новый Массив;
	ДанныеФИО  				= Новый Структура;
	
	ДанныеФИО.Вставить("Фамилия",       "");
	ДанныеФИО.Вставить("Имя",           "");
	ДанныеФИО.Вставить("Отчество",      "");
	ДанныеФИО.Вставить("Представление", Текст);
	
	ДанныеПредставления = СтрРазделить(ТРег(Текст), " ", Ложь);
	
	Если ДанныеПредставления.Количество() > 2 Тогда

		ДанныеФИО.Имя      = ДанныеПредставления[0];
		ДанныеФИО.Фамилия  = ДанныеПредставления[1];
		ДанныеФИО.Отчество = ДанныеПредставления[2];
		
		ВидДанных          = "Отчество";
		
	ИначеЕсли ДанныеПредставления.Количество() = 2 И Прав(Текст, 1) = " " Тогда

		ДанныеФИО.Имя      = ДанныеПредставления[0];
		ДанныеФИО.Фамилия  = ДанныеПредставления[1];
		
		ВидДанных          = "Отчество";
		
	ИначеЕсли ДанныеПредставления.Количество() = 2 Тогда

		ДанныеФИО.Имя      = ДанныеПредставления[0];
		ДанныеФИО.Фамилия  = ДанныеПредставления[1];
		
		ВидДанных          = "Фамилия";
		
	ИначеЕсли ДанныеПредставления.Количество() = 1 И Прав(Текст, 1) = " " Тогда

		ДанныеФИО.Имя  	   = ДанныеПредставления[0];
		ДанныеПредставления.Добавить("");
		
		ВидДанных          = "Фамилия";
		
	Иначе

		ВидДанных          = "Имя";
		ДанныеФИО.Имя  	   = ТРег(СокрЛП(Текст));
		
	КонецЕсли;
	

	МодульПодборФИОКлиент 	= ОбщегоНазначенияКлиент.ОбщийМодуль("ПодборФИОКлиент");
	ДанныеВидаДанных 		= МодульПодборФИОКлиент.Подобрать(ВидДанных, ДанныеФИО, 0);
	
	Для Каждого ЗначениеВидаДанных Из ДанныеВидаДанных Цикл
		ДанныеПредставления[ДанныеПредставления.Количество()-1] = ЗначениеВидаДанных;
		ДанныеКлассификатора.Добавить(СтрСоединить(ДанныеПредставления, " "));
	КонецЦикла;
	
	Для Каждого ЗначениеКлассификатора Из ДанныеКлассификатора Цикл
		ДанныеВыбора.Добавить(ЗначениеКлассификатора, ЗначениеКлассификатора);
	КонецЦикла;
	
	Если ДанныеВыбора.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента, ПараметрыДляОбработкиШтрихкода = Неопределено) Экспорт
	
	ТипыДанных = ОписанияТиповИскомыхДанных();
	
	Если ИспользоватьСерверЛояльностиПолучательДанных Тогда
		
		РезультатЗапросаКарт = ЗапроситьКартыССервераЛояльности();
		ОбработатьПолучениеКартССервераЛояльности(РезультатЗапросаКарт);
	КонецЕсли;
	
	СтрокиДляОбработки = ТаблицаДанных.НайтиСтроки(Новый Структура("ОтметкаЗамена", Ложь));
	
	Если СтрокиДляОбработки.Количество() = 0 Тогда
		МассивКарт = Новый Массив;
		МассивПокупателей = Новый Массив;
		Для Каждого НайденныйЭлемент Из СтруктураПараметровКлиента.ЗначенияПоиска Цикл
			Если ТипыДанных.Покупатель.СодержитТип(ТипЗнч(НайденныйЭлемент.Владелец)) Тогда
				МассивПокупателей.Добавить(НайденныйЭлемент.Владелец);
			ИначеЕсли ТипыДанных.КартаЛояльности.СодержитТип(ТипЗнч(НайденныйЭлемент.Владелец))
				И ЗначениеЗаполнено(СтруктураПараметровКлиента.ПараметрыШтрихкода.ШтрихкодПоиска) Тогда
				МассивКарт.Добавить(НайденныйЭлемент.Владелец);
			КонецЕсли;
		КонецЦикла;
		ЗаполнитьДанныеТаблицыКарт(МассивКарт, МассивПокупателей);
		ОбновитьИтогиТаблицы();
		СтрокиДляОбработки = ТаблицаДанных.НайтиСтроки(Новый Структура("ОтметкаЗамена", Ложь));
	КонецЕсли;
	
	ПустойРезультат = СтрокиДляОбработки.Количество() = 0 И ЗначениеЗаполнено(Контрагент);
	
	Если ПустойРезультат Тогда
		ДобавитьЛокальнуюКартуКонтрагентаПриНеобходимости();
		СтрокиДляОбработки = ТаблицаДанных.НайтиСтроки(Новый Структура("ОтметкаЗамена", Ложь));
	КонецЕсли;

	Если СтрокиДляОбработки.Количество() = 0 Тогда
		БаннерОткрыт = Истина;
	ИначеЕсли СтрокиДляОбработки.Количество() = 1 Тогда
		СтрокаДанных = СтрокиДляОбработки[0];
		УстановитьОсновнуюКарту(СтрокаДанных);
		ЗаполнитьДанныеВыбраннойКарты(СтрокаДанных);
		ТекущееДействие = "Подтверждение";
	ИначеЕсли РежимКассыСамообслуживания Тогда
		СтрокаДанных = СтрокиДляОбработки[0];
		УстановитьОсновнуюКарту(СтрокиДляОбработки[0]);
		ЗаполнитьДанныеВыбраннойКарты(СтрокаДанных);
		ТекущееДействие = "Подтверждение";
	Иначе
		УстановитьОсновнуюКарту(СтрокиДляОбработки[0]);
		ТекущееДействие = "Поиск";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводШтрихкодаНайденаКарта(Результат, ЗапросДанныхБонусов = Истина) Экспорт
	
	ПереключитьНаСтраницуПоискаКарты();
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеВидаКарты(ИдентификаторВидаКарты) Экспорт
	ДанныеВидаКарты = Новый Структура;
	ДанныеВидаКарты.Вставить("Идентификатор", "");
	ДанныеВидаКарты.Вставить("Наименование", "");
	ДанныеВидаКарты.Вставить("ЭтоИменнаяКарта", Истина);
	ДанныеВидаКарты.Вставить("ГенерироватьНомер", Ложь);
	ДанныеВидаКарты.Вставить("ПрисваиватьНомерКартыКНомеруТелефона", Ложь);
	ДанныеВидаКарты.Вставить("ПредставлениеШаблона", "");
	ПараметрыПоиска = Новый Структура("Идентификатор", ИдентификаторВидаКарты);
	НайденныеВиды = ТаблицаВидыКарт.НайтиСтроки(ПараметрыПоиска);
	Если НайденныеВиды.Количество() <> 0 Тогда
		ЗаполнитьЗначенияСвойств(ДанныеВидаКарты, НайденныеВиды[0]);
	КонецЕсли;
	
	Возврат ДанныеВидаКарты;
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатПолученияСпискаВидовКарт(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Свойство("ЕстьОшибки")
		И НЕ РезультатВыполнения.ЕстьОшибки Тогда
		СтрокаJSON = РезультатВыполнения.ДанныеОтвета;
		ДанныеОтвета = Неопределено;
		Если СтрокаJSON <> Неопределено Тогда
			СерверЛояльностиПолучательДанныхКлиентСервер.ОбработатьJSON(СтрокаJSON, ДанныеОтвета);
			Если ДанныеОтвета <> Неопределено И ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
				Для каждого СтрокаМассива Из ДанныеОтвета Цикл
					ВидКарты = ТаблицаВидыКарт.Добавить();
					
					Если СтрокаМассива.Свойство("CardTypeID") Тогда
						ВидКарты.Идентификатор = СтрокаМассива.CardTypeID;
						ВидКарты.Наименование = СтрокаМассива.CardTypeDescription;
						ВидКарты.ЭтоИменнаяКарта = СтрокаМассива.IsPerson;
						Если СтрокаМассива.Свойство("GenerateNumer") Тогда
							ВидКарты.ГенерироватьНомер = СтрокаМассива.GenerateNumer;
						КонецЕсли;
						Если СтрокаМассива.Свойство("NumberToPhone") Тогда
							ВидКарты.ПрисваиватьНомерКартыКНомеруТелефона = СтрокаМассива.NumberToPhone;
						КонецЕсли;
						Если СтрокаМассива.Свойство("TemplateRepresentation") Тогда
							ВидКарты.ПредставлениеШаблона = СтрокаМассива.TemplateRepresentation;
						КонецЕсли;
						Если СтрокаМассива.Свойство("LengthRange") Тогда
							ВидКарты.НачалоДиапазона = СтрокаМассива.BeginRange;
							ВидКарты.КонецДиапазона = СтрокаМассива.EndRange;
							ВидКарты.ДлинаДиапазона = СтрокаМассива.LengthRange;
						КонецЕсли;
					Иначе
						ЗаполнитьЗначенияСвойств(ВидКарты, СтрокаМассива);
					КонецЕсли;
					
					Элементы.НоваяКартаВидКарты.СписокВыбора.Добавить(ВидКарты.Идентификатор, ВидКарты.Наименование);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Элементы.НоваяКартаВидКарты.Доступность = Истина;
	КонецЕсли;
	
	Если ТаблицаВидыКарт.Количество() = 1 Тогда
		НоваяКартаВидКарты = ТаблицаВидыКарт[0].Идентификатор;
		ЗаполнитьНастройкиВидаКарты();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеССервераЛояльности(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
		ОтложенноеОповещение = Новый ОписаниеОповещения(ДополнительныеПараметры.ИмяОтложенногоМетода, ЭтотОбъект, ДополнительныеПараметры);
		ВыполнитьОбработкуОповещения(ОтложенноеОповещение, РезультатВыполнения);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = СтрШаблон("%1 %2",
			НСтр("ru = 'Не удалось установить досутпные типы карт: " + Символы.ПС + "%1'"),
				Результат.ПодробноеПредставлениеОшибки);
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстПредупреждения);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыОткрытияОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВыбораДанныхПоиска(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.СтруктураПараметровКлиента.Свойство("ВыборКонтрагента") Тогда
		
		ДанныеКартыКлиента = Результат.ЗначенияПоиска[0];
		
		Если ДанныеКартыКлиента.КартаНедействительна Тогда
			ШтрихкодУрезанный = СтрШаблон("%1%2", Лев(ДанныеКартыКлиента.НомерКарты, 25),
				?(СтрДлина(ДанныеКартыКлиента.НомерКарты) > 25, "...", ""));
			ОшибкаСервераЛояльности = СтрШаблон(НСтр("ru = 'Дисконтная карта недействительна: %1'"), ШтрихкодУрезанный);
			ПереключитьНаСтраницуСообщения();
		Иначе
			НайденнаяКарта = ТаблицаДанных.Добавить();
			НайденнаяКарта.ДисконтнаяКарта = ДанныеКартыКлиента.Карта;
			НайденнаяКарта.КодКарты = ДанныеКартыКлиента.НомерКарты;
			НайденнаяКарта.ПродажиОборот = ДанныеКартыКлиента.ПродажиОборот;
			НайденнаяКарта.ДатаРождения = ДанныеКартыКлиента.ДатаРождения;
			НайденнаяКарта.НомерТелефона = ДанныеКартыКлиента.НомерТелефона;
			НайденнаяКарта.ПокупательПочта = ДанныеКартыКлиента.ЭлектроннаяПочта;
			НайденнаяКарта.ПокупательФИО = ДанныеКартыКлиента.ФИО;
			НайденнаяКарта.Покупатель = ДанныеКартыКлиента.Контрагент;
			ЗапроситьЛокальныеДанныеКарты(НайденнаяКарта);
		КонецЕсли;
			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОтменитьСозданиеКарты(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
КонецПроцедуры

#КонецОбласти


