#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияОтветаНаВопросОЗагрузкеНастроек", ЭтотОбъект);
		
	ЗаголовокВопроса = НСтр("ru = 'Обновление настроек'");
	ТекстВопроса = НСтр("ru = 'Загрузить настройки?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да);
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , Кнопки[0].Значение, ЗаголовокВопроса);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеПолученияОтветаНаВопросОЗагрузкеНастроек(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ОбновитьНастройкиПодключенияКРРМЧДНаСервере();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьДанныеНастроекЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьНастройкиПодключенияКРРМЧДНаСервере()
	
	ПараметрыОперации = СинхронизацияЭДО.ПараметрыСинхронизацииНастроекПодключенияКРРМЧД();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Синхронизация настроек подключения к распределенному реестру МЧД.'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"СинхронизацияЭДО.СинхронизироватьНастройкиПодключенияКРРМЧДИзСервисаНастроек", ПараметрыОперации, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеНастроекЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если РезультатВыполнения <> Неопределено Тогда 
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Загрузка настроек завершена успешно.'"));
			Элементы.Список.Обновить(); 
			
		Иначе 
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Загрузка настроек не выполнялась.'"));
			
		КонецЕсли;
			
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Ошибка синхронизации. Подробности см. в журнале регистрации.'"));
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти