
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗапретитьОтправкуОбратнойСвязи = Константы.ЗапретитьОтправкуОбратнойСвязи.Получить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНастройкиОбратнойСвязи();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНастройкиОбратнойСвязи()
	
	Константы.ЗапретитьОтправкуОбратнойСвязи.Установить(ЗапретитьОтправкуОбратнойСвязи);
	
КонецПроцедуры

#КонецОбласти