#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	// УНФ.ОтборыСписка
	ИменаНетиповыхОтборов = "ОтборДействуетНа";
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список);
	// Конец УНФ.ОтборыСписка
	
	АдаптацияФормыТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(ОтборДействуетНа) Тогда
		УстановитьОтборДействуетНа();
		РаботаСОтборамиКлиентСервер.УстановитьОтображениеКомандыСброситьВсеОтборы(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		// УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		// Конец УНФ.ОтборыСписка
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборДействуетНа = Настройки.Получить("ОтборДействуетНа");
	
	Если ЗначениеЗаполнено(ОтборДействуетНа) Тогда
		РаботаСОтборами.СвернутьРазвернутьОтборыНаСервере(ЭтотОбъект, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;

КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаОчистка(Элемент, СтандартнаяОбработка)

	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаТаксиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборАвторОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Автор", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДействуетНаПриИзменении(Элемент)
	УстановитьОтборДействуетНа();
	РаботаСОтборамиКлиентСервер.УстановитьОтображениеКомандыСброситьВсеОтборы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВариантИспользованияПоложенияДляМагазинаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ВариантИспользованияПоложенияДляМагазина", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

	Для Каждого Строка Из Строки Цикл
		Строка = Строки[Строка.Ключ];
		Если Строка.Оформление.Получить("ВыбранныеМагазины") = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Прервать;
	КонецЦикла;

	Ключи = Строки.ПолучитьКлючи();
	Ссылки = Новый Массив;
	Для Каждого Ключ Из Ключи Цикл
		Ссылки.Добавить(Ключ.Ссылка);
	КонецЦикла;

	ВыбранныеМагазины = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Магазины.Ссылка КАК ДокументСсылка,
	|	Магазины.Магазин.Наименование КАК НаименованиеМагазина
	|ИЗ
	|	Документ.ПоложениеОПремировании.Магазины КАК Магазины
	|ГДЕ
	|	Магазины.Ссылка В(&Ссылки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Магазины.НомерСтроки";
	Запрос.УстановитьПараметр("Ссылки", Ссылки);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ВыбранныеМагазины[Выборка.ДокументСсылка] = Неопределено Тогда
			
			ВыбранныеМагазины[Выборка.ДокументСсылка] = Новый Массив;
			
		КонецЕсли;
		
		ВыбранныеМагазины[Выборка.ДокументСсылка].Добавить(Выборка.НаименованиеМагазина);
		
	КонецЦикла;

	ИмяКолонкиМагазины = "ВыбранныеМагазины";
	Для Каждого Строка Из Строки Цикл
		
		Строка = Строки[Строка.Ключ];
		Если ВыбранныеМагазины[Строка.Данные["Ссылка"]] = Неопределено Тогда 
			
			Строка.Данные[ИмяКолонкиМагазины] = НСтр("ru = 'Общее положение для всех подразделений'");
			
		Иначе
			
			Строка.Данные[ИмяКолонкиМагазины] = СтрСоединить(ВыбранныеМагазины[Строка.Данные["Ссылка"]], ", ");
			
		КонецЕсли;
		
		Строка.Оформление[ИмяКолонкиМагазины].УстановитьЗначениеПараметра("ЦветТекста",
				ЦветаПалитры.НедоступныеДанныеЦветУНФ);
				
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	
	ИмяРеквизитаСписка = "Список";
	ИмяТЧДанныеМеток = "ДанныеМеток";
	ИмяТЧДанныеОтборов = "ДанныеОтборов";
	ИмяГруппыОтборов = "ГруппаОтборы";
	ИмяПредопределенныеОтборыПоУмолчанию = "ПредопределенныеОтборыПоУмолчанию";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизитаСписка", ИмяРеквизитаСписка);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеОтборов", ИмяТЧДанныеОтборов);
	ДополнительныеПараметры.Вставить("ИмяГруппыОтборов", ИмяГруппыОтборов);
	ДополнительныеПараметры.Вставить("ИмяПредопределенныеОтборыПоУмолчанию", ИмяПредопределенныеОтборыПоУмолчанию);
	
	РаботаСОтборамиКлиент.НастроитьОтборыНажатие(ЭтотОбъект,
		ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры), ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеОтборы(Команда)
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "Список", "Дата");
	
	ОтборДействуетНа = Неопределено;
	УстановитьОтборДействуетНа();
	
	СброситьВсеМеткиОтбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ИндексФильтры.Видимость = Ложь;
	Элементы.ИндексФильтрыТакси.Видимость = Истина;
	Элементы.ПредставлениеПериода.Видимость = Ложь;
	Элементы.ПредставлениеПериодаТакси.Видимость = Истина;
	Элементы.Переместить(Элементы.КоманднаяПанель, КоманднаяПанель);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);
	
КонецПроцедуры

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область Отбор

&НаСервере
Процедура УстановитьМеткуИОтборСписка(Знач ИмяПоляОтбораСписка, Знач ГруппаРодительМетки, Знач ВыбранноеЗначение,
	Знач ПредставлениеЗначения = "")
	
	Если ПредставлениеЗначения = "" Тогда
		ПредставлениеЗначения = Строка(ВыбранноеЗначение);
	КонецЕсли;
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение,
		ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, ИмяПоляОтбораСписка);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
	УдалитьМеткуОтбора(МеткаИД);

КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, МеткаИД);

КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры)
	
	Возврат РаботаСОтборами.ПараметрыДляОткрытияФормыСНастройкамиОтборов(ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Процедура НастройкаОтборовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтборовЗавершениеНаСервере(Результат.АдресВыбранныеОтборы, Результат.АдресУдаленныеОтборы,
		ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаОтборовЗавершениеНаСервере(Знач АдресВыбранныеОтборы, Знач АдресУдаленныеОтборы,
	Знач ДополнительныеПараметры)
	
	РаботаСОтборами.НастройкаОтборовЗавершение(ЭтотОбъект, АдресВыбранныеОтборы, АдресУдаленныеОтборы,
		ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДействуетНа()
	
	КоличествоДопФильтров = ?(ЗначениеЗаполнено(ОтборДействуетНа), 1, 0);
	РаботаСОтборамиКлиентСервер.ОбновитьКоличествоФильтров(ЭтотОбъект);
	
	ЧислоИзмененныхДатаНачалаДействия = ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(
		Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
		"ДатаНачалаДействия",
		,
		ОтборДействуетНа,
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
		ЗначениеЗаполнено(ОтборДействуетНа),
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	ЧислоИзмененныхДатаОкончанияДействия = ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(
		Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
		"ДатаОкончанияДействия",
		,
		ОтборДействуетНа,
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
		ЗначениеЗаполнено(ОтборДействуетНа),
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ЧислоИзмененныхДействуетБессрочно = ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(
		Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
		"ДействуетБессрочно",
		,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно,
		ЗначениеЗаполнено(ОтборДействуетНа),
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	Если ЧислоИзмененныхДатаНачалаДействия = 0 
		ИЛИ ЧислоИзмененныхДатаОкончанияДействия = 0 
		ИЛИ ЧислоИзмененныхДействуетБессрочно = 0 Тогда
		
		ГруппаДействуетИЛИ = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(
			Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы, "ГруппаДействуетИЛИ");
			
		Если ГруппаДействуетИЛИ = Неопределено Тогда
			
			ГруппаДействуетИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
				Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы,
				"ГруппаДействуетИЛИ",
				ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ);
				
			ГруппаДействуетИПериод = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
				ГруппаДействуетИЛИ,
				"ГруппаДействуетИПериод",
				ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
				
			ГруппаДействуетИБессрочно = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
				ГруппаДействуетИЛИ,
				"ГруппаДействуетИБессрочно",
				ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
				
		Иначе
			
			ГруппаДействуетИПериод = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(
				ГруппаДействуетИЛИ.Элементы, "ГруппаДействуетИПериод");
			
			ГруппаДействуетИБессрочно = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(
				ГруппаДействуетИЛИ.Элементы, "ГруппаДействуетИБессрочно");
			
		КонецЕсли;
		
		// ГруппаДействуетИПериод
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДействуетИПериод,
			"ДатаНачалаДействия",
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
			ОтборДействуетНа,
			,
			ЗначениеЗаполнено(ОтборДействуетНа),
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
			
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДействуетИПериод,
			"ДатаОкончанияДействия",
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
			ОтборДействуетНа,
			,
			ЗначениеЗаполнено(ОтборДействуетНа),
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
			
		// ГруппаДействуетИБессрочно
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДействуетИБессрочно,
			"ДатаНачалаДействия",
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
			ОтборДействуетНа,
			,
			ЗначениеЗаполнено(ОтборДействуетНа),
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДействуетИБессрочно,
			"ДействуетБессрочно",
			ВидСравненияКомпоновкиДанных.Равно,
			Истина,
			,
			ЗначениеЗаполнено(ОтборДействуетНа),
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	КонецЕсли;
		
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборПриИзменении(Элемент)
	
	Подключаемый_ОтборПриИзмененииНаСервере(Элемент.Имя, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборПриИзмененииНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборПриИзменении(ЭтотОбъект, ЭлементИмя, ЭлементРодительИмя);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборОчистка(Элемент)
	
	Подключаемый_ОтборОчисткаНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборОчисткаНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборОчистка(ЭтотОбъект, ЭлементИмя);

КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере()
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, Список);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
