////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинет85: методы, специфичные для платформы 1С:Предприятие 8.5
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	Если Не ЭтоИнтерфейс85() Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Элемент Из Форма.Элементы.ГруппаМенюДекорацииРазделов.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
			Элемент.Ширина = Элемент.Ширина + 2;
		КонецЕсли;
	КонецЦикла;
	
	ЗаменитьЦветФонаГрупп(Форма);
	
КонецПроцедуры

Процедура УстановитьКрасныйЦветТекста(ТекущийЦвет) Экспорт
	
	Если Не ЭтоИнтерфейс85() Тогда
		Возврат;
	КонецЕсли;
	ТекущийЦвет = ЦветаПалитры.Красный;
	
КонецПроцедуры

Процедура УстановитьЗеленыйЦветТекста(ТекущийЦвет) Экспорт
	
	Если Не ЭтоИнтерфейс85() Тогда
		Возврат;
	КонецЕсли;
	ТекущийЦвет = ЦветаПалитры.Зеленый;
	
КонецПроцедуры

Процедура УстановитьЦветГиперссылки(ТекущийЦвет) Экспорт
	
	Если Не ЭтоИнтерфейс85() Тогда
		Возврат;
	КонецЕсли;
	ТекущийЦвет = ЦветаПалитры.Синий;
	
КонецПроцедуры

Процедура УстановитьЦветАктивногоРазделаМеню(ТекущийЦвет) Экспорт
	
	Если Не ЭтоИнтерфейс85() Тогда
		Возврат;
	КонецЕсли;
	ТекущийЦвет = ЦветаПалитры.Серый;
	
КонецПроцедуры

Процедура УстановитьГлавнуюКнопку(Кнопка) Экспорт
	
	Если Не ЭтоИнтерфейс85() Тогда
		Возврат;
	КонецЕсли;
	Кнопка.Важность = ВажностьКнопки.Главная;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоИнтерфейс85()
	
	ТекущийВариант = КлиентскоеПриложение.ТекущийВариантИнтерфейса();
	
	Возврат ТекущийВариант <> ВариантИнтерфейсаКлиентскогоПриложения.Такси
		И ТекущийВариант <> ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2;
		
КонецФункции

Процедура ЗаменитьЦветФонаГрупп(Форма)
	
	ЗаменыФона85 = ПравилаЗаменыЦвета();
	
	Для каждого Элемент Из Форма.Элементы Цикл
		ТекущийЦветФона = ЦветФонаГруппы(Элемент);
		Если ТекущийЦветФона = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЦветФона85 = ЗаменыФона85[ТекущийЦветФона];
		Если ЦветФона85 = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Элемент.ЦветФона = ЦветФона85;
	КонецЦикла;
	
КонецПроцедуры

Функция ПравилаЗаменыЦвета()
	
	Правила = Новый Соответствие;
	// Ключ - цвет в Такси, значение - цвет в "8.5"
	Правила.Вставить(ЦветаСтиля.ЕдиныйНалоговыйСчетБыстрыеОтборыФонГруппы, ЦветаПалитры.Желтый);
	Правила.Вставить(ЦветаСтиля.ЕдиныйНалоговыйСчетЖелтыйЦветФона, ЦветаПалитры.Желтый);
	Правила.Вставить(ЦветаСтиля.ЕдиныйНалоговыйСчетКрасныйЦветФона, ЦветаПалитры.Красный);
	Правила.Вставить(ЦветаСтиля.ЕдиныйНалоговыйСчетСветлоЖелтыйЦветФона, ЦветаПалитры.Желтый);
	Правила.Вставить(ЦветаСтиля.ЕдиныйНалоговыйСчетСветлоЗеленыйЦвет, ЦветаПалитры.Зеленый);
	Правила.Вставить(ЦветаСтиля.ЕдиныйНалоговыйСчетСерыйЦвет, ЦветаПалитры.Серый);
	Правила.Вставить(ЦветаСтиля.ЕдиныйНалоговыйСчетЦветТехническиеРаботы, ЦветаПалитры.Серый);
	Правила.Вставить(ЦветаСтиля.ЕдиныйНалоговыйСчетЦветФонаАктивнойЗакладки, ЦветаПалитры.Серый);
	Возврат Правила;
	
КонецФункции

Функция ЦветФонаГруппы(Элемент)
	
	Если ТипЗнч(Элемент) <> Тип("ГруппаФормы") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элемент, "ЦветФона") Тогда
		Возврат Элемент.ЦветФона;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти