// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийВариантИнтерфейса = КлиентскоеПриложение.ТекущийВариантИнтерфейса();
	Элементы.ФормаОтмена.Видимость = ТекущийВариантИнтерфейса <> ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Принять(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Закрыть(ТекстПричиныНесоответствияПолномочий);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
