
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Справочники.СтавкиНДС.ЗаполнитьСписокВыбораСтавокНДСНаУСН(ЭтотОбъект, "СтавкаНалогообложенияПриУСН");	
	ИнициализироватьТекстПодсказок();
	
	ИсходныеДанные = Новый Структура("Организация, Период");
	ЗаполнитьЗначенияСвойств(ИсходныеДанные, Запись.ИсходныйКлючЗаписи);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьНастройкиУчетаНДС",Новый Структура("Организация", Запись.Организация));
	Оповестить("ИзменениеУчетнойПолитики", Запись.Организация);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьСистемыНалогообложения" Тогда
		
		ОрганизацияОповещения = Неопределено;
		Если Параметр.Свойство("Организация", ОрганизацияОповещения) И ОрганизацияОповещения = Запись.Организация Тогда
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если (ИсходныеДанные.Период <> Запись.Период ИЛИ ИсходныеДанные.Организация <> Запись.Организация)
		И ЗаписьСуществует(Запись.Организация, Запись.Период) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Запись с указанной организацией и периодом уже существует'"), , , , Отказ);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьТекстПодсказок()
	
	ПараметрыПроверитьНастройки = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыПроверитьНастройки.Идентификатор = ИдентификаторСообщенияПроверитьНастройки();
	ПараметрыПроверитьНастройки.ТипСообщения = "Ошибка";
	ПараметрыПроверитьНастройки.Скрываемый = Ложь;
	ПараметрыПроверитьНастройки.Сообщение = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Проверьте настройки <a href=""СистемыНалогообложения"">системы налогообложения</a>'"));
	ПараметрыПроверитьНастройки.КраткоеПредставление = НСтр("ru = 'Проверьте налогообложение'");
	ПараметрыПроверитьНастройки.Обработчик = "Подключаемый_ПроверкаСистемыНалогообложенияОбработкаСсылки";
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыПроверитьНастройки);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторСообщенияПроверитьНастройки()
	Возврат "ПроверкаСистемыНалогообложения";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяГруппыСообщениеПроверитьНастройки()
	Возврат ОбщегоНазначенияКлиентСервер.ПрефиксГруппыВажногоСообщения() + ИдентификаторСообщенияПроверитьНастройки();
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Запись = Форма.Запись;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяГруппыСообщениеПроверитьНастройки(),
		"Видимость", Не ПлательщикНДС(Запись.Организация, Запись.Период));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверкаСистемыНалогообложенияОбработкаСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "СистемыНалогообложения" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация", Запись.Организация));
		
		ОткрытьФорму("РегистрСведений.СистемыНалогообложенияОрганизаций.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПлательщикНДС(Знач Организация, Знач Период)
	
	Возврат УчетнаяПолитика.ПлательщикНДС(Организация, Период)
		Или УчетнаяПолитика.ПлательщикНДСПрименяющийУСН(Организация, Период);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаписьСуществует(Знач Организация, Знач Период)
	
	Отбор = Новый Структура("Организация", Организация);
	ПериодЗаписи = НачалоМесяца(Период);
	Выборка = РегистрыСведений.НастройкиУчетаНДС.Выбрать(ПериодЗаписи, ПериодЗаписи, Отбор);
	
	Возврат Выборка.Следующий();
	
КонецФункции

#КонецОбласти
