
#Область ПрограммныйИнтерфейс

// Возвращает признак разрешения отправки обратной связи.
//
// Параметры:
//  ИмяФормы - Строка - имя формы, для которой проверяется разрешение отправки обратной связи.
//  ИмяСобытия - Строка - имя события, для которого проверяется разрешение отправки обратной связи.
//  ПолучатьРазрешениеОтСервиса - Булево - обращаться в сервис за разрешением на вывод опроса
//
// Возвращаемое значение:
//  Булево - Истина, если отправка обратной связи разрешена.
//
Функция ОтправкаОбратнойСвязиРазрешена(ИмяФормы, ИмяСобытия, ПолучатьРазрешениеОтСервиса = Ложь) Экспорт
	
	Результат = ОбратнаяСвязь.ОтправкаОбратнойСвязиРазрешена(ИмяФормы, ИмяСобытия, ПолучатьРазрешениеОтСервиса);
	Возврат Результат;
	
КонецФункции

// Отправляет обратную связь
//
// Параметры:
//  ДанныеДляОтправки - Структура - данные для отправки обратной связи.
//
Процедура ОтправитьОбратнуюСвязь(ДанныеДляОтправки) Экспорт
	
	ОбратнаяСвязь.ОпросОтправить(ДанныеДляОтправки);
	
КонецПроцедуры

// Сохраняет настройку опроса.
//
// Параметры:
//  ИмяФормы - Строка - имя формы, для которой сохраняется настройка опроса.
//  Событие - Строка - событие, для которого сохраняется настройка опроса.
//  Значение - Произвольный - значение настройки опроса.
//  ИдентификаторОпроса - Строка - идентификатор опроса
//
Процедура СохранитьНастройкуОпроса(ИмяФормы, Событие, Значение, ИдентификаторОпроса) Экспорт
	
	ОбратнаяСвязь.СохранитьНастройкуОпроса(ИмяФормы, Событие, Значение, ИдентификаторОпроса);
	
КонецПроцедуры

// Снимает флаг выполнения условий опроса. Флаг будет взведен снова при следующем выполнении регламентного задания
// Параметры:
//  ИмяПользователя - Строка
//
Процедура ОпросНачалоРаботыОтложить(ИмяПользователя = "") Экспорт

	ОбратнаяСвязь.ОпросНачалоРаботыОтложить(ИмяПользователя);

КонецПроцедуры

#КонецОбласти