// @strict-types


#Область СлужебныеПроцедурыИФункции

#Область КонтрактМенеджераДействийЭДО

// Возвращаемое значение:
//  Строка -  Идентификатор обработчика действий по ЭДО
Функция ИдентификаторМенеджераДействийЭДО() Экспорт
	Возврат "ИнтеграцияОблачногоЭДО";
КонецФункции

#КонецОбласти

#Область ОбработкаРезультатовВыполненияДействийЭДО

// Возвращаемое значение:
//  Структура:
//  * Сертификаты - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * НаборДанных - Массив из см. ЭлектронныеДокументыЭДОИнтеграцияОблака.НовыеДанныеСообщенияДляИнтерактивногоПодписания
//  * ИспользоватьБазовыйТипПодписи - Булево - определяет необходимость использования базового типа подписи (CAdES-BES)
//                                             независимо от пользовательской настройки.
Функция НовоеОписаниеНабораДанныхДляИнтерактивногоПодписания() Экспорт
	ОписаниеНабораДанных = Новый Структура;
	ОписаниеНабораДанных.Вставить("Сертификаты", Новый Массив);
	ОписаниеНабораДанных.Вставить("НаборДанных", Новый Массив);
	ОписаниеНабораДанных.Вставить("ИспользоватьБазовыйТипПодписи", Ложь);
	Возврат ОписаниеНабораДанных;
КонецФункции

#КонецОбласти

#КонецОбласти
