#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ПараметрыОшибки = Новый Соответствие;
	Если Параметры.Свойство("ПараметрыОшибки", ПараметрыОшибки) Тогда
		Порядок = 0;
		Для Каждого Ошибка из ПараметрыОшибки Цикл
			СтрОшибка = ТаблицаСравнения.Добавить();
			СтрОшибка.Атрибут = Ошибка.Ключ;
			Порядок = Порядок + 1;
			СтрОшибка.Порядок = Порядок;
			ЗаполнитьЗначенияСвойств(СтрОшибка, Ошибка.Значение); 
		КонецЦикла;
		ТаблицаСравнения.Сортировать("Порядок Убыв");
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если ИнтерфейсПользователяБЭДКлиентСервер.ЭтоИнтерфейсВерсия8_5() Тогда
		Элементы.Продолжить.Важность = ВажностьКнопки.Главная;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьЗагрузку(Команда)
	Закрыть("Продолжить");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗагрузку(Команда)
	Закрыть("Отменить");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветОтметки", ЦветаПалитры.Красный);
		
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТаблицаСравненияВЗагружаемомДокументе");
		
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаСравнения.ВЗагружаемомДокументе");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветОтметки", ЦветаПалитры.Зеленый);
		
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТаблицаСравненияВИсходномДокументе");
		
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаСравнения.ВИсходномДокументе");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;

КонецПроцедуры

#КонецОбласти