
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	РежимВыбора = Параметры.РежимВыбора;
	
	Элементы.СписокВыбратьИзСправочника.Видимость = РежимВыбора;
	Элементы.ВыбратьИзКлассификатора.Видимость = РежимВыбора;
	
	КлассификаторУпаковок.Загрузить(ИнтеграцияВЕТИСПовтИсп.Упаковки());
	ОпределитьНаличиеСсылокВБазе();
	
	УстановитьВидимостьЭлементовДляИнтерфейса85();
	
	ЦветГиперссылки = ЦветаСтиля.ЦветГиперссылкиГосИС;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьКнопкиВыбрать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_УпаковкиВЕТИС" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗагружено;
		Элементы.Список.Обновить();
		Элементы.Список.ТекущаяСтрока = Параметр;
		ОпределитьНаличиеСсылокВБазе();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИзСправочника(Команда)
	
	СтандартнаяОбработка = Ложь;
	ПриВыбореИзЗагруженных();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзКлассификатора(Команда)
	
	СтандартнаяОбработка = Ложь;
	ПриВыбореИзДанныхКлассификатора();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзТекущегоСписка(Команда)
	
	ИмяЭлементаСписок = ИмяСпискаПоТекущейСтранице(ЭтотОбъект);
	Если ИмяЭлементаСписок = Неопределено Тогда
		Возврат;
	ИначеЕсли ИмяЭлементаСписок = "Список"
		И Не ОбщегоНазначенияИСКлиент.ВыборСтрокиСпискаКорректен(Элементы.Список, Истина, Ложь) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы[ИмяЭлементаСписок].ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбработкаВыбораЗначенияСписка(ТекущиеДанные, ИмяЭлементаСписок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОпределитьНаличиеСсылокВБазе();
	УстановитьВидимостьДоступностьКнопкиВыбрать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ПриСменеОсновнойСтраницы();
	УстановитьВидимостьДоступностьКнопкиВыбрать();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПриВыбореИзЗагруженных();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	УстановитьВидимостьДоступностьКнопкиВыбрать();
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторУпаковокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПриВыбореИзДанныхКлассификатора();
	
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторУпаковокПриАктивизацииСтроки(Элемент)
	УстановитьВидимостьДоступностьКнопкиВыбрать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьЭлементКлассификатора(ИдентификаторЭлемента, КодЭлемента)
	
	ЭлементДанных = Новый Структура("guid, globalID",
		ИдентификаторЭлемента, 
		КодЭлемента);
	Возврат ИнтеграцияВЕТИС.Упаковка(ЭлементДанных);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекущаяСтрокаСтруктурой(ТекущиеДанные)
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("Наименование",  ТекущиеДанные.Наименование);
	СтруктураЗаполнения.Вставить("Идентификатор", ТекущиеДанные.Идентификатор);
	СтруктураЗаполнения.Вставить("КодЕЭК",        ТекущиеДанные.Код);
	
	Возврат СтруктураЗаполнения
	
КонецФункции

&НаКлиенте
Процедура ПриСменеОсновнойСтраницы()
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗагружено Тогда
		Элементы.СписокВыбратьИзСправочника.КнопкаПоУмолчанию = Истина;
		Элементы.ВыбратьИзКлассификатора.КнопкаПоУмолчанию    = Ложь;
	Иначе
		Элементы.СписокВыбратьИзСправочника.КнопкаПоУмолчанию = Ложь;
		Элементы.ВыбратьИзКлассификатора.КнопкаПоУмолчанию    = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОпределитьНаличиеСсылокВБазе()
	
	ТаблицаФормы = ЭтаФорма.КлассификаторУпаковок;
	Если ТаблицаФормы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивИдентификаторов = ТаблицаФормы.Выгрузить(, "Идентификатор").ВыгрузитьКолонку("Идентификатор");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УпаковкиВЕТИС.Идентификатор КАК Идентификатор,
	|	УпаковкиВЕТИС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УпаковкиВЕТИС КАК УпаковкиВЕТИС
	|ГДЕ
	|	УпаковкиВЕТИС.Идентификатор В(&МассивИдентификаторов)";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыПоиска = Новый Структура("Идентификатор");
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыПоиска.Идентификатор = Выборка.Идентификатор;
		
		НайденныеСтроки = ТаблицаФормы.НайтиСтроки(ПараметрыПоиска);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.ЕстьВБазе = 1;
			НайденнаяСтрока.СсылкаВБазе = Выборка.Ссылка;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореИзДанныхКлассификатора()

	ТекущиеДанные = Элементы.КлассификаторУпаковок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимВыбора Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаВБазе) Тогда
			ОповеститьОВыборе(ТекущиеДанные.СсылкаВБазе);
		Иначе
			ОповеститьОВыборе(ЗагрузитьЭлементКлассификатора(ТекущиеДанные.Идентификатор, ТекущиеДанные.Код));
		КонецЕсли;
	Иначе
		ПараметрыОткрытия = Новый Структура;
		Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаВБазе) Тогда
			ПараметрыОткрытия.Вставить("Ключ", ТекущиеДанные.СсылкаВБазе);
		Иначе
			ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ТекущаяСтрокаСтруктурой(ТекущиеДанные));
		КонецЕсли;
		ОткрытьФорму("Справочник.УпаковкиВЕТИС.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореИзЗагруженных()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимВыбора Тогда
		ОповеститьОВыборе(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьКнопкиВыбрать()
	
	Если Не ЭтоИнтерфейс85 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаВыбратьИзТекущегоСписка.Видимость = РежимВыбора;
	Если РежимВыбора Тогда
		
		ИмяЭлементаСписок = ИмяСпискаПоТекущейСтранице(ЭтотОбъект);
		Если ИмяЭлементаСписок = Неопределено Тогда
			ДоступностьКоманды = Ложь;
		Иначе
			ТекущиеДанные = Элементы[ИмяЭлементаСписок].ТекущиеДанные;
			ДоступностьКоманды = ТекущиеДанные <> Неопределено;
		КонецЕсли;
		
		Элементы.ФормаВыбратьИзТекущегоСписка.Доступность = ДоступностьКоманды;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяСпискаПоТекущейСтранице(Форма)
	
	Элементы = Форма.Элементы;
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗагружено Тогда
		Возврат "Список";
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаКлассификатор Тогда
		Возврат "КлассификаторУпаковок";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораЗначенияСписка(ВыбраннаяСтрока, ИмяСписка)
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("ДанныеФормыСтруктура")
		Или ТипЗнч(ВыбраннаяСтрока) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		ДанныеСтроки = ВыбраннаяСтрока;
	Иначе
		ДанныеСтроки = Элементы[ИмяСписка].ДанныеСтроки(ВыбраннаяСтрока);
	КонецЕсли;
	
	Если ИмяСписка = "Список" Тогда
		ОповеститьОВыборе(ДанныеСтроки.Ссылка);
	Иначе
		Если ЗначениеЗаполнено(ДанныеСтроки.СсылкаВБазе) Тогда
			ОповеститьОВыборе(ДанныеСтроки.СсылкаВБазе);
		Иначе
			ОповеститьОВыборе(ЗагрузитьЭлементКлассификатора(ДанныеСтроки.Идентификатор, ДанныеСтроки.Код));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовДляИнтерфейса85()
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85();
	ИнтеграцияИС.УстановитьВидимостьЭлементовТакси85(ЭтотОбъект);
	ОтображатьКоманднуюПанель = ЭтоИнтерфейс85;
	
	Если РежимВыбора Тогда
		
		Элементы.СписокВыбратьИзСправочника.Видимость = Не ЭтоИнтерфейс85;
		Элементы.ВыбратьИзКлассификатора.Видимость    = Не ЭтоИнтерфейс85;
		
		Элементы.Список.РежимВыделения                = РежимВыделенияТаблицы.Одиночный;
		Элементы.КлассификаторУпаковок.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		
	Иначе
		
		Элементы.СписокВыбратьИзСправочника.Видимость = Ложь;
		Элементы.ВыбратьИзКлассификатора.Видимость    = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
