
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуФайловОтработанныхКонтейнеров();
	
	Если ИнтерфейсПользователяБЭДКлиентСервер.ЭтоИнтерфейсВерсия8_5() Тогда
		
		ДопМеню = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
		КартинкаИТекст = ОтображениеКнопки.КартинкаИТекст;
		
		Элементы.ВыделитьВсеПЭД.Видимость = Ложь;
		Элементы.СнятьВсеПЭД.Видимость = Ложь;
		Элементы.ОбновитьТаблицыПЭД.Отображение = КартинкаИТекст;
		Элементы.ОтработанныеПакетыНайти.Отображение = КартинкаИТекст;
		Элементы.ОтработанныеПакетыНайти.ПоложениеВКоманднойПанели = ДопМеню;
		Элементы.ОтработанныеПакетыОтменитьПоиск.Отображение = КартинкаИТекст;
		Элементы.ОтработанныеПакетыОтменитьПоиск.ПоложениеВКоманднойПанели = ДопМеню;
		Элементы.ОтработанныеПакетыСправка.Видимость = Ложь;
		Элементы.ОтработанныеКонтейнерыВыбран.Видимость = Ложь;
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Авто;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтработанныеКонтейнерыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.Документ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	УстановитьЗначенияФлажков(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	УстановитьЗначенияФлажков(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеОтмеченныеКонтейнеры(Команда)
	
	УдалитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоТаблицам(Команда)
	
	ЗаполнитьТаблицуФайловОтработанныхКонтейнеров();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуФайловОтработанныхКонтейнеров()
	
	ОтработанныеТранспортныеКонтейнеры.Очистить();
	
	ЗапросКонтейнеров = Новый Запрос;
	УдаляемыеСтатусы = Новый СписокЗначений;
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыТранспортныхСообщенийБЭД.Отменен);
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыТранспортныхСообщенийБЭД.Доставлен);
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыТранспортныхСообщенийБЭД.Распакован);
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыТранспортныхСообщенийБЭД.Отправлен);
	ЗапросКонтейнеров.УстановитьПараметр("Статус", УдаляемыеСтатусы);
	
	ЗапросКонтейнеров.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.Ссылка КАК Документ,
	|	ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.ВладелецФайла.Статус КАК Статус,
	|	ЛОЖЬ КАК Выбран,
	|	ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.ДатаСоздания КАК ДатаПолучения,
	|	ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.ВладелецФайла.Организация КАК Организация,
	|	ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.ВладелецФайла.Контрагент КАК Контрагент,
	|	ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.ВладелецФайла.Направление КАК Направление
	|ИЗ
	|	Справочник.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы КАК ТранспортныйКонтейнерЭДОПрисоединенныеФайлы
	|ГДЕ
	|	ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.ВладелецФайла ССЫЛКА Документ.ТранспортныйКонтейнерЭДО
	|	И ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
	|	И ВЫРАЗИТЬ(ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.ВладелецФайла КАК Документ.ТранспортныйКонтейнерЭДО).Статус В (&Статус)";
	
	ЗначениеВРеквизитФормы(ЗапросКонтейнеров.Выполнить().Выгрузить(), "ОтработанныеТранспортныеКонтейнеры");
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДанные()
	
	Если ИнтерфейсПользователяБЭДКлиентСервер.ЭтоИнтерфейсВерсия8_5() Тогда
		
		КонтейнерыКУдалению = Новый Массив;
		Для каждого ИдентификаторСтрокиКУдалению Из Элементы.ОтработанныеКонтейнеры.ПолучитьСтрокиДляОбработки() Цикл
			КонтейнерыКУдалению.Добавить(ОтработанныеТранспортныеКонтейнеры.НайтиПоИдентификатору(ИдентификаторСтрокиКУдалению));
		КонецЦикла;
		
	Иначе
		
		ОтборВыбранных = Новый Структура("Выбран", Истина);
		КонтейнерыКУдалению = ОтработанныеТранспортныеКонтейнеры.НайтиСтроки(ОтборВыбранных);
		
	КонецЕсли;
	
	Для Каждого СтрокаУдаления Из КонтейнерыКУдалению Цикл
		НачатьТранзакцию();
		Попытка
			ТранспортныеКонтейнерыЭДО.ЗаблокироватьКонтейнер(СтрокаУдаления.Документ);
				
			ОбъектУдаления = СтрокаУдаления.Документ.ПолучитьОбъект();
			ОбъектУдаления.ПометкаУдаления = Истина;
			ОбъектУдаления.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
	ЗаполнитьТаблицуФайловОтработанныхКонтейнеров();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияФлажков(ПараметрУстановки)
	
	Для Каждого Строка Из ОтработанныеТранспортныеКонтейнеры Цикл
		Строка.Выбран = ПараметрУстановки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
