
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначенияДляВыбора = Параметры.ЗначенияДляВыбора;
	
	Для каждого ЭлементКоллекции Из ЗначенияДляВыбора Цикл
		
		НоваяСтрока = Список.Добавить();
		
		НоваяСтрока.Пометка               = ЭлементКоллекции.Пометка;
		НоваяСтрока.ПредставлениеЗначения = ЭлементКоллекции.Представление;
		НоваяСтрока.ИдентификаторЗначения = ЭлементКоллекции.Значение;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьПометку(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьПометку(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбранныеЗначения = Новый СписокЗначений;
	
	Для каждого ЭлементКоллекции Из Список Цикл
		Если ЭлементКоллекции.Пометка Тогда
			ВыбранныеЗначения.Добавить(
				ЭлементКоллекции.ИдентификаторЗначения, 
				ЭлементКоллекции.ПредставлениеЗначения,
				ЭлементКоллекции.Пометка);
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(Новый Структура("ВыбранныеЗначения", ВыбранныеЗначения));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПометку(Знач ЗначениеПометки)
	Для каждого ЭлементКоллекции Из Список Цикл
		ЭлементКоллекции.Пометка = ЗначениеПометки;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти