
#Область ПрограммныйИнтерфейс

// См. ВидыПриложенийПереопределяемый.ПриОпределенииВидовПриложенийКонфигурации
Процедура ПриОпределенииВидовПриложенийКонфигурации(ВидыПриложений) Экспорт
	
	Если СтрНачинаетсяС(Метаданные.Имя, "Розница") Тогда
		Возврат;
	КонецЕсли;
	
	// Розница
	НовыйВидПриложенияРозница = ВидыПриложений.Добавить();
	НовыйВидПриложенияРозница.Имя = "Розница";
	НовыйВидПриложенияРозница.Представление = НСтр("ru='Розница'");
	
	УслугаВидаПриложенияРозница = ВидыПриложенийСервер.НоваяУслуга();
	УслугаВидаПриложенияРозница.ИдентификаторПоставщика = ТарификацияУНФ.ИдентификаторПоставщикаУНФ();
	УслугаВидаПриложенияРозница.ИдентификаторУслуги = ТарификацияУНФ.ИдентификаторУслугиРозница();
	НовыйВидПриложенияРозница.Услуги.Добавить(УслугаВидаПриложенияРозница);
	
	ДополнительныеСвойства = НовыйВидПриложенияРозница.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("ИмяМакетаРасширения", "ЗаставкаРозница");
	ДополнительныеСвойства.Вставить("ИдентификаторИнтернетПоддержки", "Retail");
	
	НовыйВидПриложенияРозница.Процедура = "ВидыПриложенийУНФ.УстановитьВидПриложенияРозница";
	
	// Розница (базовая)
	НовыйВидПриложенияРозницаБазовая = ВидыПриложений.Добавить();
	НовыйВидПриложенияРозницаБазовая.Имя = "РозницаБазовая";
	НовыйВидПриложенияРозницаБазовая.Представление = НСтр("ru='Розница (базовая)'");
	
	УслугаВидаПриложенияРозницаБазовая = ВидыПриложенийСервер.НоваяУслуга();
	УслугаВидаПриложенияРозницаБазовая.ИдентификаторПоставщика = ТарификацияУНФ.ИдентификаторПоставщикаУНФ();
	УслугаВидаПриложенияРозницаБазовая.ИдентификаторУслуги = ТарификацияУНФ.ИдентификаторУслугиРозницаБазовая();
	НовыйВидПриложенияРозницаБазовая.Услуги.Добавить(УслугаВидаПриложенияРозницаБазовая);
	
	ДополнительныеСвойства = НовыйВидПриложенияРозницаБазовая.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("ИмяМакетаРасширения", "ЗаставкаРозница");
	ДополнительныеСвойства.Вставить("ИдентификаторИнтернетПоддержки", "Retail");
	
	НовыйВидПриложенияРозницаБазовая.Процедура = "ВидыПриложенийУНФ.УстановитьВидПриложенияРозница";
	
	// Бизнес
	НовыйВидПриложенияБизнес = ВидыПриложений.Добавить();
	НовыйВидПриложенияБизнес.Имя = "Бизнес";
	НовыйВидПриложенияБизнес.Представление = НСтр("ru='Бизнес'");
	
	УслугаВидаПриложенияБизнес = ВидыПриложенийСервер.НоваяУслуга();
	УслугаВидаПриложенияБизнес.ИдентификаторПоставщика = ТарификацияУНФ.ИдентификаторПоставщикаУНФ();
	УслугаВидаПриложенияБизнес.ИдентификаторУслуги = ТарификацияУНФ.ИдентификаторУслугиБизнес();
	НовыйВидПриложенияБизнес.Услуги.Добавить(УслугаВидаПриложенияБизнес);
	
	ДополнительныеСвойства = НовыйВидПриложенияБизнес.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("ИмяМакетаРасширения", "");
	ДополнительныеСвойства.Вставить("ИдентификаторИнтернетПоддержки", "SmallBusiness");
	
	НовыйВидПриложенияБизнес.Процедура = "ВидыПриложенийУНФ.УстановитьВидПриложенияБизнесПриложение";
	
КонецПроцедуры

// См. ВидыПриложенийПереопределяемый.ПриОпределенииДопСвойствБазовогоВидаПриложения
Процедура ПриОпределенииДопСвойствБазовогоВидаПриложения(ДополнительныеСвойства) Экспорт
	
	ДополнительныеСвойства.Вставить("ИмяМакетаРасширения", "");
	ДополнительныеСвойства.Вставить("ИдентификаторИнтернетПоддержки",
		ОбщегоНазначения.ИдентификаторИнтернетПоддержкиКонфигурации());
	
КонецПроцедуры

// См. ВидыПриложенийПереопределяемый.ПриДобавленииОбработчиковПереходаВидовПриложений
Процедура ПриДобавленииОбработчиковПереходаВидовПриложений(Обработчики) Экспорт
	
	ОбработчикПереходаНаУНФ = Обработчики.Добавить();
	ОбработчикПереходаНаУНФ.ИсходноеИмяВидаПриложения = "Розница";
	ОбработчикПереходаНаУНФ.ИмяВидаПриложения = ВидыПриложенийСервер.БазовыйВидПриложения().Имя;
	ОбработчикПереходаНаУНФ.Процедура = "ВозможностиПриложения.ОбновлениеРозницыДоУНФ";
	
	ОбработчикПереходаРозницаБазоваяНаРозница = Обработчики.Добавить();
	ОбработчикПереходаРозницаБазоваяНаРозница.ИсходноеИмяВидаПриложения = "РозницаБазовая";
	ОбработчикПереходаРозницаБазоваяНаРозница.ИмяВидаПриложения = "Розница";
	ОбработчикПереходаРозницаБазоваяНаРозница.Процедура = "ВозможностиПриложения.ОбновлениеРозницыБазовойДоРозницы";
	
	ОбработчикПереходаРозницаБазоваяНаУНФ = Обработчики.Добавить();
	ОбработчикПереходаРозницаБазоваяНаУНФ.ИсходноеИмяВидаПриложения = "РозницаБазовая";
	ОбработчикПереходаРозницаБазоваяНаУНФ.ИмяВидаПриложения = ВидыПриложенийСервер.БазовыйВидПриложения().Имя;
	ОбработчикПереходаРозницаБазоваяНаУНФ.Процедура = "ВозможностиПриложения.ОбновлениеРозницыДоУНФ";

КонецПроцедуры

// См. ВидыПриложенийПереопределяемый.ПриУстановкеБазовогоВидаПриложения
// 
Процедура ПриУстановкеБазовогоВидаПриложения(РезультатОбработки) Экспорт
	
	Если ВозможностиПриложения.БазовыйВидПриложенияЭтоУНФ() Тогда
		ВозможностиПриложения.УстановитьВидПриложенияУНФ(РезультатОбработки);
	ИначеЕсли ВозможностиПриложения.БазовыйВидПриложенияЭтоРозница() Тогда
		ВозможностиПриложения.УстановитьВидПриложенияРозница(РезультатОбработки);
	Иначе
		ТекстОшибки = НСтр("ru='Неизвестен метод установки базового вида приложения для конфигурации %1'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Метаданные.Имя);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

// Установить вид приложения "Управление нашей фирмой"
//
// Параметры:
//  РезультатОбработки - см. НовыйРезультатОбработки
//
Процедура УстановитьВидПриложенияУНФ(РезультатОбработки)  Экспорт
	
	ВидПриложенияСиноним = НСтр("ru='Управление нашей фирмой'");
	
	ТекстСообщения = НСтр("ru='Процедура установки вида приложения ""%1"".'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ВидПриложенияСиноним);
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	
	Попытка
		
		ВозможностиПриложения.УстановитьВидПриложенияУНФ(РезультатОбработки);
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ТекстСообщения = НСтр("ru='Ошибка при установке вида приложения ""%1"":
		|%2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ВидПриложенияСиноним, ПодробноеПредставлениеОшибки);
		
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = ТекстСообщения;
		
	КонецПопытки;
	
КонецПроцедуры

// Установить вид приложения "Розница"
//
// Параметры:
//  РезультатОбработки - см. НовыйРезультатОбработки
//
Процедура УстановитьВидПриложенияРозница(РезультатОбработки) Экспорт
	
	ВидПриложенияСиноним = НСтр("ru='Розница'");
	
	ТекстСообщения = НСтр("ru='Процедура установки вида приложения ""%1"".'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ВидПриложенияСиноним);
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	
	Попытка
		
		// ВозможностиПриложения.ПриПодключенииУслугиРозница();
		ВозможностиПриложения.УстановитьВидПриложенияРозница(РезультатОбработки);
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ТекстСообщения = НСтр("ru='Ошибка при установке вида приложения ""%1"":
		|%2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ВидПриложенияСиноним, ПодробноеПредставлениеОшибки);
		
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = ТекстСообщения;
		
	КонецПопытки;

КонецПроцедуры

// Установить вид приложения Бизнес приложение
//
// Параметры:
//  РезультатОбработки - см. НовыйРезультатОбработки
//
Процедура УстановитьВидПриложенияБизнесПриложение(РезультатОбработки) Экспорт
	
	ВидПриложенияСиноним = НСтр("ru='Бизнес'");
	
	ТекстСообщения = НСтр("ru='Процедура установки вида приложения ""%1"".'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ВидПриложенияСиноним);
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	
	Попытка
		
		ВозможностиПриложения.УстановитьВидПриложенияБизнесПриложение(РезультатОбработки);
		// ничего делать не требуется, приложение должно быть пустым, все опции выключены
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ТекстСообщения = НСтр("ru='Ошибка при установке вида приложения ""%1"":
		|%2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ВидПриложенияСиноним, ПодробноеПредставлениеОшибки);
		
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = ТекстСообщения;
		
	КонецПопытки;

КонецПроцедуры

// См. ВидыПриложенийПереопределяемый.ПослеУстановкиВидаПриложения
Процедура ПослеУстановкиВидаПриложения(ВидПриложения, РезультатОбработки) Экспорт
	
	СвойстваВидаПриложения = ВидыПриложенийСервер.СвойстваВидаПриложенияПоИмени(ВидПриложения);
	ИмяМакетаРасширения = СвойстваВидаПриложения.ДополнительныеСвойства.ИмяМакетаРасширения;
	
	Если ЗначениеЗаполнено(ИмяМакетаРасширения) Тогда
		УстановитьРасширениеВидаПриложения(ИмяМакетаРасширения, РезультатОбработки);
	КонецЕсли;
	
КонецПроцедуры

// См. ВидыПриложенийПереопределяемый.ПослеПереходаНаВидПриложения
Процедура ПослеПереходаНаВидПриложения(ВидПриложения, ЦелевойВидПриложения, РезультатОбработки) Экспорт
	
	СвойстваВидаПриложения = ВидыПриложенийСервер.СвойстваВидаПриложенияПоИмени(ВидПриложения);
	ИмяМакетаРасширенияВидаПриложения = СвойстваВидаПриложения.ДополнительныеСвойства.ИмяМакетаРасширения;

	СвойстваЦелевогоВидаПриложения = ВидыПриложенийСервер.СвойстваВидаПриложенияПоИмени(ЦелевойВидПриложения);
	ИмяМакетаРасширенияЦелевогоВидаПриложения = СвойстваЦелевогоВидаПриложения.ДополнительныеСвойства.ИмяМакетаРасширения;

	// удаление, при необходимости, расширения прошлого вида приложения
	Если ЗначениеЗаполнено(ИмяМакетаРасширенияВидаПриложения) Тогда
		УдалитьРасширениеВидаПриложения(ИмяМакетаРасширенияВидаПриложения, РезультатОбработки);
	КонецЕсли;

	Если РезультатОбработки.Ошибка Тогда
		Возврат;
	КонецЕсли;

	// установка, при необходимости, расширения целевого вида приложения
	Если ЗначениеЗаполнено(ИмяМакетаРасширенияЦелевогоВидаПриложения) Тогда
		УстановитьРасширениеВидаПриложения(ИмяМакетаРасширенияЦелевогоВидаПриложения, РезультатОбработки);
	КонецЕсли;

КонецПроцедуры

// См. ВидыПриложенийПереопределяемый.ПриОпределенииПараметровУведомления
Процедура ПриОпределенииПараметровУведомления(ПараметрыУведомления) Экспорт
	
	ПараметрыУведомления.Показывать = Истина;
	
КонецПроцедуры

// См. ВидыПриложенийПереопределяемый.ПриОпределенииИменРасширенийВидовПриложений
Процедура ПриОпределенииИменРасширенийВидовПриложений(ИменаРасширений) Экспорт
	
	ВидыПриложений = ВидыПриложенийСервер.ВидыПриложенийКонфигурации();
	
	Для Каждого ВидПриложения Из ВидыПриложений Цикл
		ИмяМакетаРасширения = ВидПриложения.ДополнительныеСвойства.ИмяМакетаРасширения;
			
		Если ЗначениеЗаполнено(ИмяМакетаРасширения) Тогда
			ОписаниеРасширения = Новый ОписаниеКонфигурации(ПолучитьОбщийМакет(ИмяМакетаРасширения));
			ИменаРасширений.Добавить(ОписаниеРасширения.Имя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// См. ВидыПриложенийПереопределяемый.ПриПолученииИмениТекущегоВидаПриложения
Процедура ПриПолученииИмениТекущегоВидаПриложения(НовоеИмяВидаПриложения, ИмяТекущегоВидаПриложения) Экспорт
	
	ИмяТекущегоВидаПриложения = НовоеИмяВидаПриложения;
	
КонецПроцедуры

// Установлен режим запуска комбинированное приложение.
// 
// Возвращаемое значение:
//  Булево - Установлен режим запуска комбинированное приложение
Функция УстановленРежимЗапускаКомбинированноеПриложение() Экспорт
	
	ПараметрЗапускаКлиента = СтандартныеПодсистемыСервер.ПараметрыКлиентаНаСервере().Получить("ПараметрЗапуска");
	Возврат СтрНайти(ПараметрЗапускаКлиента, "РежимЗапускаКомбинированноеПриложение") <> 0;
	
КонецФункции

// Возвращает шаблон описания результата обработки
// 
// Возвращаемое значение:
//  Структура:
//   * Ошибка - Булево - признак ошибки обработки. По умолчанию, Ложь.
//   * Сообщение - Строка - сообщение об ошибке обработки.
//
Функция НовыйРезультатОбработки() Экспорт
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("Ошибка", Ложь);
	РезультатОбработки.Вставить("Сообщение", "");
	
	Возврат РезультатОбработки;
	
КонецФункции

#Область УстаревшиеПроцедурыИФункции
// Устарела. Следует использовать см. ВидыПриложенийСервер.ИмяТекущегоВидаПриложения
// Параметры:
//  ОбластьДанных - Неопределено - не используется
// Возвращаемое значение:
//  см. ВидыПриложенийСервер.ИмяТекущегоВидаПриложения
Функция ИмяТекущегоВидаПриложения(ОбластьДанных = Неопределено) Экспорт
	Возврат ВидыПриложенийСервер.ИмяТекущегоВидаПриложения();
КонецФункции
#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Переустановить расширение вида приложения.
// 
// Параметры:
//  Параметры - Структура - используется для вызова в качестве обработчика обновления
Процедура ПереустановитьРасширениеВидаПриложения(Параметры) Экспорт
	
	ИмяТекущегоВидаПриложения = ВидыПриложенийСервер.ИмяТекущегоВидаПриложения();
	Если Не ЗначениеЗаполнено(ИмяТекущегоВидаПриложения) Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваВидаПриложения = ВидыПриложенийСервер.СвойстваВидаПриложенияПоИмени(ИмяТекущегоВидаПриложения);
	ИмяМакетаРасширения = СвойстваВидаПриложения.ДополнительныеСвойства.ИмяМакетаРасширения;
	Если Не ЗначениеЗаполнено(ИмяМакетаРасширения) Тогда
		Возврат;
	КонецЕсли;
	
	Расширение = УстановленноеРасширение(ИмяМакетаРасширения);
	Если Расширение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатОбработки = НовыйРезультатОбработки();
	
	УдалитьРасширениеВидаПриложения(ИмяМакетаРасширения, РезультатОбработки);
	
	Если РезультатОбработки.Ошибка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьРасширениеВидаПриложения(ИмяМакетаРасширения, РезультатОбработки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьРасширениеВидаПриложения(ИмяМакетаРасширения, РезультатОбработки)
	
	Расширение = УстановленноеРасширение(ИмяМакетаРасширения);
	Если Расширение <> Неопределено Тогда
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = СтрШаблон(
			НСтр("ru = 'Нельзя добавить расширение макета ""%1"", т.к. расширение с таким именем уже установлено.'"),
			ИмяМакетаРасширения);
		
		Возврат;
	КонецЕсли;
	
	Расширение = РасширенияКонфигурации.Создать();
	
	Расширение.Активно = Истина;
	Расширение.БезопасныйРежим = Ложь;
	Расширение.ЗащитаОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий();
	Расширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
	Расширение.ИспользоватьОсновныеРолиДляВсехПользователей = Ложь;
	Расширение.Записать(ПолучитьОбщийМакет(ИмяМакетаРасширения));
	
КонецПроцедуры

Процедура УдалитьРасширениеВидаПриложения(ИмяМакетаРасширения, РезультатОбработки)
	
	Расширение = УстановленноеРасширение(ИмяМакетаРасширения);
	Если Расширение = Неопределено Тогда
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = СтрШаблон(
			НСтр("ru = 'Нельзя удалить расширение макета ""%1"", т.к. расширение в приложении не установлено.'"),
			ИмяМакетаРасширения);
		
		Возврат;
	КонецЕсли;
	
	Расширение.Удалить();
	
КонецПроцедуры

Функция УстановленноеРасширение(ИмяМакетаРасширения)
	
	ОписаниеРасширения = Новый ОписаниеКонфигурации(ПолучитьОбщийМакет(ИмяМакетаРасширения));
	Отбор = Новый Структура("Имя", ОписаниеРасширения.Имя);
	Расширения = РасширенияКонфигурации.Получить(Отбор);
	
	Если Расширения.Количество() > 0 Тогда
		Возврат Расширения[0];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ИмяСобытияЖР()
	
	Возврат НСтр("ru='ВидыПриложенийУНФ'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти
