
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПрайсЛист", ПрайсЛист);
	
	ПараметрПозицииТорговыхПредложений = Параметры.ПозицииТорговыхПредложений;
	Если ЗначениеЗаполнено(ПараметрПозицииТорговыхПредложений) Тогда
		ПозицииТорговыхПредложений = ПоместитьВоВременноеХранилище(ПараметрПозицииТорговыхПредложений, УникальныйИдентификатор);
		МножественныйРежим = НЕ ПараметрПозицииТорговыхПредложений.Количество() = 1;
	Иначе
		МножественныйРежим = Истина;
	КонецЕсли;
	
	Параметры.Свойство("ТребуетсяВыполнитьПроверкуДанных", ТребуетсяВыполнитьПроверкуДанных);
	
	АвтоНавигационнаяСсылка = Ложь;
	НавигационнаяСсылка = "e1cib/app/" + ИмяФормы;
	
	ЦветФонаШапкиТаблицы = ЦветаСтиля.ЦветФонаШапкиТаблицы;
	ЦветФонаФормы = ЦветаСтиля.ЦветФонаФормы;
	
	ДлительнаяОперацияОбновлениеДанных = ЗапуститьОбновлениеДанных(
		ПозицииТорговыхПредложений, ПрайсЛист, ТребуетсяВыполнитьПроверкуДанных, УникальныйИдентификатор); 
		
	УстановитьУсловноеОформление();
	
	ВывестиПримечание();
	
	ЭтоИнтерфейс85 = ТорговыеПредложенияСлужебныйКлиентСервер.ЭтоИнтерфейс85();
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ФормаПовторитьПроверку", "Видимость", ЭтоИнтерфейс85);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПовторитьПроверку", "Видимость", Не ЭтоИнтерфейс85); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОжидатьОбновлениеДанных();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазделПриИзменении(Элемент)
	ПерезаполнитьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено 
		Или ТекущиеДанные.ЭтоРаздел
		Или НЕ ТекущиеДанные.ДоступенПереход Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПолноеИмяМетаданных = "ОшибкиПубликацииСервиса" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Ошибка при получении данных сервисом 1С:Бизнес-сеть.
			|Пожалуйста, попробуйте отправить данные позже.'"));
	ИначеЕсли ТекущиеДанные.ОбработкаПричиныИсключения Тогда
		
		Если ПустаяСтрока(ПозицииТорговыхПредложений) Тогда
			
			ПозицииТорговыхПредложенийИсключения = 
				ПозицииТорговыхПредложенийПоПричинеИсключения(ПрайсЛист, ТекущиеДанные.Ссылка);
			
		Иначе
			
			ПозицииТорговыхПредложенийИсключения = 
				ПолучитьИзВременногоХранилища(ПозицииТорговыхПредложений);
			
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаУчетныхДанных", ЭтотОбъект);
		ТорговыеПредложенияКлиентПереопределяемый.ОбработатьНажатиеПоГиперссылкеПричиныИсключенияИзПубликации(
			ТекущиеДанные.Ссылка,
			ПрайсЛист, 
			ПозицииТорговыхПредложенийИсключения, 
			ЭтотОбъект, 
			Элемент, 
			ОписаниеОповещения);
		
	Иначе
		
		ТекущиеДанные.ВыполненПереход = Истина;
		
		ПараметрыОткрытияФормы = Новый Структура;
		Если СтрНайти(ТекущиеДанные.ПолноеИмяМетаданных, "Форма") > 0 Тогда
			ИмяОткрываемойФормы = ТекущиеДанные.ПолноеИмяМетаданных;
			ПараметрыОткрытияФормы.Вставить("ТорговоеПредложение", ТекущиеДанные.Ссылка);
			РежимОткрытияФормы = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Иначе
			ИмяОткрываемойФормы = ТекущиеДанные.ПолноеИмяМетаданных + ".ФормаОбъекта";
			ПараметрыОткрытияФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);
			РежимОткрытияФормы = РежимОткрытияОкнаФормы.Независимый;
		КонецЕсли;
		
		Форма = ОткрытьФорму(
			ИмяОткрываемойФормы, 
			ПараметрыОткрытияФормы, ЭтотОбъект, , , , , 
			РежимОткрытияФормы);
		
		Если Форма = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого Реквизит Из ТекущиеДанные.Реквизиты Цикл
			
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.ИдентификаторНазначения = Форма.УникальныйИдентификатор;
			СообщениеПользователю.Поле = Реквизит.Значение;
			СообщениеПользователю.Текст = Реквизит.Представление;
			СообщениеПользователю.Сообщить();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПовторитьПроверку(Команда)
	ТребуетсяВыполнитьПроверкуДанных = Истина;
	ОбновитьДанные()
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область РаботаСФормой

&НаСервере
Процедура УстановитьУсловноеОформление()

	#Область ОтображениеГиперссылки
	
	// Оформление строк гиперссылок
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = НСтр("ru = 'Оформление строк гиперссылок'");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовИндексКартинкиБезГиперссылки");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовПредставлениеБезГиперссылки");
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.ЭтоРаздел");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Оформление строк разделов
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = НСтр("ru = 'Оформление строк разделов'");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовИндексКартинкиГиперссылка");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовПредставлениеГиперссылка");
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.ЭтоРаздел");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Оформление НЕ отработанных гиперссылок
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = НСтр("ru = 'Оформление отработанных гиперссылок'");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовПредставлениеГиперссылка");
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.ВыполненПереход");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.ВторойБрендовый);
	
	// Оформление отработанных гиперссылок
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = НСтр("ru = 'Оформление отработанных гиперссылок'");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовПредставлениеГиперссылка");
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.ВыполненПереход");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаИспользованнаяГиперссылкаБЭД);
	
	// Оформление недоступных гиперссылок
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = НСтр("ru = 'Оформление отработанных гиперссылок'");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовПредставлениеГиперссылка");
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.ДоступенПереход");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветПустойГиперссылки);
	
	#КонецОбласти 

	#Область ОтображениеОшибокИПредупреждений
	
	// Оформление ошибок и предупреждений
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = НСтр("ru = 'Оформление ошибок и предупреждений'");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоОшибокПустая");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовПустоеКоличество");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовНомерКартинкиОшибкиПравая");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоОшибокПравая");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоОшибокПустаяПравая");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовПустоеКоличествоПраво");
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.КоличествоОшибок");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.КоличествоПредупреждений");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Оформление ошибок
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = НСтр("ru = 'Оформление ошибок'");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовНомерКартинкиОшибки");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоОшибок");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовНомерКартинкиПредупреждения");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоПредупреждений");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоОшибокПустаяПравая");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовПустоеКоличествоПраво");
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.КоличествоОшибок");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.КоличествоПредупреждений");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Оформление предупреждений
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = НСтр("ru = 'Оформление предупреждений'");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовНомерКартинкиОшибки");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоОшибок");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовНомерКартинкиОшибкиПравая");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоОшибокПравая");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоОшибокПустаяПравая");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовПустоеКоличествоПраво");
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.КоличествоОшибок");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.КоличествоПредупреждений");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Оформление отсутствия ошибок и предупреждений
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = НСтр("ru = 'Оформление отсутствия ошибок и предупреждений'");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовНомерКартинкиОшибки");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоОшибок");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовНомерКартинкиОшибкиПравая");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоОшибокПравая");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовНомерКартинкиПредупреждения");
	
	Поле                         = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	Поле.Поле                    = Новый ПолеКомпоновкиДанных("ДеревоОбъектовКоличествоПредупреждений");
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.КоличествоОшибок");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ЭлементОтбора                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОбъектов.КоличествоПредупреждений");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	#КонецОбласти
		
КонецПроцедуры
 
#КонецОбласти

#Область ОбновлениеДанных

&НаСервереБезКонтекста
Функция ЗапуститьОбновлениеДанных(АдресПозицийТорговыхПредложенийВХранилище,
	 ПрайсЛист, ТребуетсяВыполнитьПроверкуДанных, УникальныйИдентификатор)

	НаименованиеЗадания = НСтр(
		"ru = 'Формирование списка объектов для диагностики проблем обмена с 1С:Бизнес-сеть.'");
	
	ПараметрыОтбораПредложений = ОбрабатываемыеТорговыеПредложения(ПрайсЛист, АдресПозицийТорговыхПредложенийВХранилище);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Отбор"                            , ПараметрыОтбораПредложений);
	ПараметрыПроцедуры.Вставить("ТребуетсяВыполнитьПроверкуДанных" , ТребуетсяВыполнитьПроверкуДанных);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение           = 0;
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ТорговыеПредложения.ПолучитьДанныеДиагностики",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);

КонецФункции

&НаКлиенте
Процедура ОжидатьОбновлениеДанных()

	Если ДлительнаяОперацияОбновлениеДанных.Статус = "Выполнено" Тогда
		ПослеПолученияДанных(ДлительнаяОперацияОбновлениеДанных, Неопределено);
	Иначе
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбновлениеДанных;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияДанных", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения      = Ложь;
		ПараметрыОжидания.ВыводитьОкноОжидания            = Ложь;
		ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
		ПараметрыОжидания.ВыводитьСообщения               = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияОбновлениеДанных, 
			ОписаниеОповещения, ПараметрыОжидания);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияДанных(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	БизнесСетьСлужебныйКлиент.ВывестиСообщенияФоновогоЗадания(РезультатВыполнения);
	
	Если Не РезультатВыполнения.Статус = "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = ОбрабатываемыеТорговыеПредложения(ПрайсЛист, ПозицииТорговыхПредложений);
	ПараметрыОповещения.Вставить("ВыполненаПроверкаДанных", ТребуетсяВыполнитьПроверкуДанных);
		
	Оповестить("ТорговыеПредложения_ОбновлениеСостоянийТорговыхПредложений", ПараметрыОповещения, ЭтотОбъект);

	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДанные;
	АдресДанныхДиагностики = РезультатВыполнения.АдресРезультата;
	ПерезаполнитьДерево();
	
	Если ДеревоОбъектов.ПолучитьЭлементы().Количество() = 0 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДанныеЗаполненыКорректно;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные()
	
	ДлительнаяОперацияОбновлениеДанных = ЗапуститьОбновлениеДанных(
		ПозицииТорговыхПредложений, ПрайсЛист, ТребуетсяВыполнитьПроверкуДанных, УникальныйИдентификатор);
	ОжидатьОбновлениеДанных();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Разделы()
	
	Результат = Новый Структура;
	
	ТекстВсе = НСтр("ru = 'Все'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСведенияОТоваре = НСтр("ru = 'Сведения о товаре'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстКонтактнаяИнформация = НСтр("ru = 'Контактная информация'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстУчетныеДанные = НСтр("ru = 'Учетные данные'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстОшибкаПубликацииСервиса = НСтр("ru = 'Ошибки публикации'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Результат.Вставить("Все", НовыйЭлементРаздела("", ТекстВсе));
	Результат.Вставить("СведенияОТоваре", НовыйЭлементРаздела("СведенияОТоваре", ТекстСведенияОТоваре));
	Результат.Вставить("КонтактнаяИнформация", НовыйЭлементРаздела("КонтактнаяИнформация", ТекстКонтактнаяИнформация));
	Результат.Вставить("УчетныеДанные", НовыйЭлементРаздела("УчетныеДанные", ТекстУчетныеДанные));
	Результат.Вставить("ОшибкаПубликацииСервиса",
		НовыйЭлементРаздела("ОшибкаПубликацииСервиса", ТекстОшибкаПубликацииСервиса));
	
	Возврат Результат;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция НовыйЭлементРаздела(Идентификатор, Представление) 
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("Представление", Представление);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ДобавитьРазделВСписокВыбора(ДанныеРаздела, Количество)
	
	Если Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбораРазделов =  Элементы.Раздел.СписокВыбора;
	СписокВыбораРазделов.Добавить(ДанныеРаздела.Идентификатор, 
		СтрШаблон("%1 (%2)", ДанныеРаздела.Представление, Количество));
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьДеревоНаСервере()

	Дерево = РеквизитФормыВЗначение("ДеревоОбъектов");
	Дерево.Строки.Очистить();
	
	Элементы.Раздел.СписокВыбора.Очистить();
	
	ДанныеДиагностики = ПолучитьИзВременногоХранилища(АдресДанныхДиагностики);
	
	Если ДанныеДиагностики = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ ПустаяСтрока(Раздел) И ДанныеДиагностики.Разделы.Найти(Раздел) = Неопределено Тогда
		Раздел = "";
	КонецЕсли;
	
	Разделы = Разделы();
	ДобавитьРазделВСписокВыбора(
		Разделы.Все,  ДанныеДиагностики.СтатистикаДиагностики.КоличествоВсе);
	ДобавитьРазделВСписокВыбора(
		Разделы.СведенияОТоваре,  ДанныеДиагностики.СтатистикаДиагностики.КоличествоСведенияОТоваре);
	ДобавитьРазделВСписокВыбора(
		Разделы.КонтактнаяИнформация,  ДанныеДиагностики.СтатистикаДиагностики.КоличествоКонтактнаяИнформация);
	ДобавитьРазделВСписокВыбора(
		Разделы.УчетныеДанные,  ДанныеДиагностики.СтатистикаДиагностики.КоличествоУчетныеДанные);
	ДобавитьРазделВСписокВыбора(
		Разделы.ОшибкаПубликацииСервиса,  ДанныеДиагностики.СтатистикаДиагностики.КоличествоОшибокПубликацииСервиса);
	
	Элементы.Раздел.Видимость = ДанныеДиагностики.Разделы.Количество() > 1;
	
	ОбрабатываемыеПричиныИсключенияИзПубликации = Новый Массив;
	ТорговыеПредложенияПереопределяемый.ОпределитьОбрабатываемыеПричиныИсключенияИзПубликации(ОбрабатываемыеПричиныИсключенияИзПубликации);
	
	Если МножественныйРежим Тогда
		Для Каждого ЭлементМетаданных Из ДанныеДиагностики.ОбъектыМетаданных Цикл
			
			НоваяСтрока = Дерево.Строки.Добавить();
			НоваяСтрока.ПолноеИмяМетаданных = ЭлементМетаданных.Значение;
			НоваяСтрока.Представление       = ЭлементМетаданных.Представление;
			НоваяСтрока.ИндексКартинки      = 0;
			НоваяСтрока.ЭтоРаздел           = Истина;
			НоваяСтрока.НомерКартинкиОшибки = -1;
			НоваяСтрока.НомерКартинкиПредупреждения = -1;
			
			ДобавитьЭлементыВКонтекст(ДанныеДиагностики, НоваяСтрока.Строки, ОбрабатываемыеПричиныИсключенияИзПубликации, 
				ЭлементМетаданных.Значение);
			
			Если НоваяСтрока.Строки.Количество() = 0 Тогда
				Дерево.Строки.Удалить(НоваяСтрока);
			Иначе
				НоваяСтрока.Представление = 
					СтрШаблон("%1 (%2)", ЭлементМетаданных.Представление, НоваяСтрока.Строки.Количество());
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		ДобавитьЭлементыВКонтекст(ДанныеДиагностики, Дерево.Строки, ОбрабатываемыеПричиныИсключенияИзПубликации);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоОбъектов");
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеСсылки(ДанныеДиагностики, СтрокаДиагностики)
	Возврат СтрокаДиагностики.Ссылка;
КонецФункции
 
&НаСервере
Процедура ДобавитьЭлементыВКонтекст(ДанныеДиагностики, КонтекстДобавления, ОбрабатываемыеПричиныИсключенияИзПубликации,
		ПолноеИмяМетаданных = Неопределено)

	СтруктураОтбора = Новый Структура;
	
	Если НЕ ПустаяСтрока(Раздел) Тогда
		СтруктураОтбора.Вставить("ИмяРаздела", Раздел);
	КонецЕсли;

	Если НЕ ПолноеИмяМетаданных = Неопределено Тогда
		СтруктураОтбора.Вставить("ПолноеИмяМетаданных", ПолноеИмяМетаданных);
	КонецЕсли;
	
	Если СтруктураОтбора.Количество() = 0 Тогда
		НайденныеСтроки = ДанныеДиагностики.ТаблицаДиагностики;
	Иначе
		НайденныеСтроки = ДанныеДиагностики.ТаблицаДиагностики.НайтиСтроки(СтруктураОтбора);
	КонецЕсли;
	
	ОписаниеТипаПричиныИсключения = Метаданные.ОпределяемыеТипы.ПричинаИсключенияИзПубликацииТорговыеПредложения.Тип;
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Ссылка", НайденнаяСтрока.Ссылка);
		
		СтрокиДерева = КонтекстДобавления.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиДерева.Количество() = 0 Тогда
			
			ОбработкаПричиныИсключения = ОписаниеТипаПричиныИсключения.СодержитТип(ТипЗнч(НайденнаяСтрока.Ссылка));
			
			СтрокаДерева = КонтекстДобавления.Добавить();
			СтрокаДерева.Ссылка                      = НайденнаяСтрока.Ссылка;
			СтрокаДерева.ПредставлениеСсылки         = ПредставлениеСсылки(ДанныеДиагностики, НайденнаяСтрока);
			СтрокаДерева.ИндексКартинки              = 1;
			СтрокаДерева.ПолноеИмяМетаданных         = НайденнаяСтрока.ПолноеИмяМетаданных;
			СтрокаДерева.ИмяРаздела                  = НайденнаяСтрока.ИмяРаздела;
			СтрокаДерева.ДоступенПереход             = 
				Не (ОбработкаПричиныИсключения И ОбрабатываемыеПричиныИсключенияИзПубликации.Найти(НайденнаяСтрока.Ссылка) = Неопределено);
			СтрокаДерева.ОбработкаПричиныИсключения  = ОбработкаПричиныИсключения;
			СтрокаДерева.НомерКартинкиОшибки         = -1;
			СтрокаДерева.НомерКартинкиПредупреждения = -1;
			
		Иначе
		
			СтрокаДерева = СтрокиДерева[0];
		
		КонецЕсли;
		
		НайденныйРеквизит = СтрокаДерева.Реквизиты.НайтиПоЗначению(НайденнаяСтрока.ПутьКДанным);
		Если НайденныйРеквизит = Неопределено 
			ИЛИ НайденныйРеквизит.Представление <> НайденнаяСтрока.ТекстСообщения Тогда
			
			СтрокаДерева.Реквизиты.Добавить(НайденнаяСтрока.ПутьКДанным, НайденнаяСтрока.ТекстСообщения);
			
			Если НайденнаяСтрока.ЯвляетсяОшибкой Тогда
				СтрокаДерева.НомерКартинкиОшибки = 0;
				СтрокаДерева.КоличествоОшибок = СтрокаДерева.КоличествоОшибок + 1;
			ИначеЕсли НайденнаяСтрока.ЯвляетсяПредупреждением Тогда
				СтрокаДерева.НомерКартинкиПредупреждения = 0;
				СтрокаДерева.КоличествоПредупреждений = СтрокаДерева.КоличествоПредупреждений + 1;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьДерево()
	
	ПерезаполнитьДеревоНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаУчетныхДанных(Результат, ДополнительныеПараметры) Экспорт
	ТребуетсяВыполнитьПроверкуДанных = Истина;
	ОбновитьДанные();
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ВывестиПримечание()
	
	КраткоеПредставление = НСтр("ru = 'Примечание'", ОбщегоНазначения.КодОсновногоЯзыка());
		
	Сообщение =
		НСтр("ru = 'При проверке торговых предложений были выявлены позиции, которые не могут быть опубликованы в 1С:Бизнес-сеть или публикация данных позиций не дает полной информации о товаре, продавце. Для публикации исчерпывающей информации о товаре заполните информацию об указанных ниже объектах.
		|
		|Для просмотра проблем нажмите на гиперссылку.'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.ТипСообщения = "Информация";
	ПараметрыСообщения.Идентификатор = ИдентификаторПримечания();
	ПараметрыСообщения.КраткоеПредставление = КраткоеПредставление;
	ПараметрыСообщения.Сообщение = Сообщение;
	ПараметрыСообщения.Скрываемый = Истина;
	ПараметрыСообщения.ОбработчикЗакрытия = "Подключаемый_УдалитьПримечание";
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(
		ЭтотОбъект,
		ПараметрыСообщения);

	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьПримечание()
	ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(ЭтотОбъект, ИдентификаторПримечания());
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторПримечания()
	Возврат "ПримечаниеОшибкиПубликации";
КонецФункции

&НаСервереБезКонтекста
Функция ПозицииТорговыхПредложенийПоПричинеИсключения(ПрайсЛист, Причина)
	
	Результат = РегистрыСведений.ТорговыеПредложенияТорговойПлощадки.ПозицииТорговыхПредложенийПоПричинеИсключения(
		ПрайсЛист, Причина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОбрабатываемыеТорговыеПредложения(ПрайсЛист, АдресПозицийТорговыхПредложенийВХранилище)
		
	Результат = Новый Структура;
	
	Если ЗначениеЗаполнено(АдресПозицийТорговыхПредложенийВХранилище) Тогда
		Результат.Вставить("ПозицииТорговыхПредложений",
			ПолучитьИзВременногоХранилища(АдресПозицийТорговыхПредложенийВХранилище));
	КонецЕсли;

	Если ЗначениеЗаполнено(ПрайсЛист) Тогда
		Результат.Вставить("ПрайсЛист", ПрайсЛист);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти