
#Область ПрограммныйИнтерфейс

// Процедура - Обработчик нажатия на представление периода в панели отборов. Открывает форму выбора стандартного периода
//             и обрабатывает результат.
//
// Параметры:
//  Форма							 - УправляемаяФорма		 - Форма с панелью отборов
//  ИмяСпискаОтбора					 - Строка				 - Имя элемента формы - списка
//  ИмяПоляОтбора					 - Строка				 - Имя поля отбора периода
//  СтруктураИменЭлементов			 - Структура			 - Структура соответствия имен полей и фильтров  
//  УстановитьОтбор					 - Булево				 - Признак необходимости установки отбора списка
//  ОписаниеОповещенияОВыбореПериода - ОписаниеОповещения	 - Описание оповещения завершения выбора периода, если требуется нестандартная обработка
//
Процедура ПредставлениеПериодаВыбратьПериод(Форма, ИмяСпискаОтбора="Список", ИмяПоляОтбора="Дата", СтруктураИменЭлементов = Неопределено, УстановитьОтбор = Истина, ОписаниеОповещенияОВыбореПериода = Неопределено) Экспорт
	
	Параметры = Новый Структура("Форма, ИмяСпискаОтбора, ИмяПоляОтбора", Форма, ИмяСпискаОтбора, ИмяПоляОтбора);
	Если НЕ (СтруктураИменЭлементов = Неопределено) Тогда
		Параметры.Вставить("СтруктураИменЭлементов", СтруктураИменЭлементов);
	КонецЕсли;
	
	Если ОписаниеОповещенияОВыбореПериода <> Неопределено Тогда
		Параметры.Вставить("ОписаниеОповещенияОВыбореПериода",ОписаниеОповещенияОВыбореПериода);
	КонецЕсли;
	
	Если ТипЗнч(СтруктураИменЭлементов) <> Тип("Структура") Или Не СтруктураИменЭлементов.Свойство("ИмяТЧДанныеМеток") Тогда
		ИмяТЧДанныеМеток = СтрЗаменить(ИмяСпискаОтбора, "Список", "ДанныеМеток");
	Иначе
		ИмяТЧДанныеМеток = СтруктураИменЭлементов.ИмяТЧДанныеМеток;
	КонецЕсли;
	
	Параметры.Вставить("УстановитьОтбор", УстановитьОтбор);
	Параметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	
	Оповещение = Новый ОписаниеОповещения("ПредставлениеПериодаНажатиеЗавершение", ЭтотОбъект, Параметры);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Если СтруктураИменЭлементов = Неопределено Тогда
		Диалог.Период = Форма.ОтборПериод;
	Иначе
		Диалог.Период = Форма[СтруктураИменЭлементов.ОтборПериод];
	КонецЕсли;
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

// Процедура - Сворачивает или разворачивает панель отборов формы
//
// Параметры:
//  Форма					 - УправляемаяФорма	 - Форма с панелью отборов
//  Видимость				 - Булево			 - Новое значение видимости панели
//  СтруктураИменЭлементов	 - Структура		 - Структура соответствия имен полей и фильтров
//  пШирина					 - Число			 - Ширина панели
//
Процедура СвернутьРазвернутьПанельОтборов(Форма, Видимость, СтруктураИменЭлементов = Неопределено) Экспорт
	
	Если СтруктураИменЭлементов = Неопределено Тогда
		СтруктураЭлементовДляПоиска = РаботаСОтборамиКлиентСервер.ИменаЭлементовПравойПанели();
	Иначе
		СтруктураЭлементовДляПоиска = СтруктураИменЭлементов;
	КонецЕсли;
	
	ГруппаПраваяПанель = Форма.Элементы.Найти(СтруктураЭлементовДляПоиска.ПраваяПанель);
	ГруппаПраваяПанельСтраницы = Форма.Элементы.Найти(СтруктураЭлементовДляПоиска.ПраваяПанельСтраницы);
	ПраваяПанельСвернутая = Форма.Элементы.Найти(СтруктураЭлементовДляПоиска.ПраваяПанельСвернутая);
	ИндексыФильтры = Форма.Элементы.Найти(СтруктураЭлементовДляПоиска.ИндексыФильтры);
	ИндексФильтрыТакси = Форма.Элементы.Найти(СтруктураЭлементовДляПоиска.ИндексФильтрыТакси);
	ИндексыИерархия = Форма.Элементы.Найти(СтруктураЭлементовДляПоиска.ИндексыИерархия);
	ИндексИерархияТакси = Форма.Элементы.Найти(СтруктураЭлементовДляПоиска.ИндексИерархияТакси);
	ГруппаОтступ = Форма.Элементы.Найти(СтруктураЭлементовДляПоиска.ГруппаОтступ);
	СвернутьПравуюПанель = Форма.Элементы.Найти(СтруктураЭлементовДляПоиска.СвернутьПравуюПанель);
	
	Если ГруппаПраваяПанельСтраницы <> Неопределено Тогда
		ГруппаПраваяПанельСтраницы.Видимость = Видимость;
	КонецЕсли;
	Если ПраваяПанельСвернутая <> Неопределено Тогда
		ПраваяПанельСвернутая.Видимость = Не Видимость;
	КонецЕсли;
	
	ФильтрыИспользуются = (ИндексыФильтры <> Неопределено);
	ИерархияИспользуется = (ИндексыИерархия <> Неопределено);
	
	Если ФильтрыИспользуются Тогда
		
		Если СтруктураЭлементовДляПоиска.Свойство("ИмяТЧДанныеМеток") Тогда
			ИмяТЧДанныеМеток = СтруктураЭлементовДляПоиска.ИмяТЧДанныеМеток;
		Иначе
			ИмяТЧДанныеМеток = "ДанныеМеток";
		КонецЕсли;
		
		РаботаСОтборамиКлиентСервер.ОбновитьКоличествоФильтров(Форма, ИмяТЧДанныеМеток);
		
	КонецЕсли;
	
	Если СтруктураЭлементовДляПоиска.Свойство("ИмяРеквизитаКоличествоФильтров") Тогда
		ИмяРеквизитаКоличествоФильтров = СтруктураЭлементовДляПоиска.ИмяРеквизитаКоличествоФильтров;
	Иначе
		ИмяРеквизитаКоличествоФильтров = "КоличествоФильтров";
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаКоличествоФильтров) Тогда
		КоличествоФильтров = Форма[ИмяРеквизитаКоличествоФильтров];
	КонецЕсли;
	
	Если СтруктураЭлементовДляПоиска.Свойство("ИмяРеквизитаИерархияИндекс") Тогда
		ИмяРеквизитаИерархияИндекс = СтруктураЭлементовДляПоиска.ИмяРеквизитаИерархияИндекс;
	Иначе
		ИмяРеквизитаИерархияИндекс = "ИерархияИндекс";
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаИерархияИндекс) Тогда
		ИерархияИндекс = Форма[ИмяРеквизитаИерархияИндекс];
	КонецЕсли;
	
	Если СвернутьПравуюПанель <> Неопределено Тогда
		
		Если Видимость Тогда
			Отображение = ОтображениеКнопки.КартинкаИТекст;
			Заголовок = НСтр("ru = 'Свернуть'");
			РасширеннаяПодсказкаЗаголовок = НСтр("ru = 'Свернуть правую панель'");
		Иначе
			Отображение = ОтображениеКнопки.Картинка;
			Заголовок = НСтр("ru = 'Развернуть'");
			РасширеннаяПодсказкаЗаголовок = НСтр("ru = 'Развернуть правую панель'");
		КонецЕсли;
		
		СвернутьПравуюПанель.Отображение = Отображение;
		СвернутьПравуюПанель.Заголовок = Заголовок;
		СвернутьПравуюПанель.РасширеннаяПодсказка.Заголовок = РасширеннаяПодсказкаЗаголовок;
		
	КонецЕсли;
	
	Если Не Видимость Тогда
		
		Если ФильтрыИспользуются И ИндексФильтрыТакси <> Неопределено Тогда
			ИндексФильтрыТакси.Заголовок = СтрШаблон("(%1)", КоличествоФильтров);
		КонецЕсли;
		
		Если ИерархияИспользуется И ИндексИерархияТакси <> Неопределено Тогда
			ИндексИерархияТакси.Заголовок = СтрШаблон("(%1)", ИерархияИндекс);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИндексыФильтры <> Неопределено Тогда
		ИндексыФильтры.Видимость = Не Видимость И КоличествоФильтров <> 0;
	КонецЕсли;
	Если ИндексыИерархия <> Неопределено Тогда
		ИндексыИерархия.Видимость = Не Видимость И ИерархияИндекс <> 0;
	КонецЕсли;
	
	// ОбратнаяСвязь
	 ОбратнаяСвязьКлиентСервер.УстановитьВидимостьПанелиОбратнойСвязи(Форма, Видимость); 
	// Конец ОбратнаяСвязь
	
	#Если МобильныйКлиент Тогда
		
		Если ГруппаПраваяПанель <> Неопределено Тогда
			
			ГруппаПраваяПанель.ОтображатьКакКарточку = Видимость;
			
			Если Видимость Тогда
				Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			Иначе
				Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			КонецЕсли;
			
			ГруппаПраваяПанель.Группировка = Группировка;
			
		КонецЕсли;
		
		Если СвернутьПравуюПанель <> Неопределено Тогда
			
			СвернутьПравуюПанель.Отображение = ОтображениеКнопки.КартинкаИТекст;
			
			Если Видимость Тогда
				Картинка = БиблиотекаКартинок.СтрелкаРазвернутьГруппу;
			Иначе
				Картинка = БиблиотекаКартинок.СтрелкаСвернутьГруппу;
			КонецЕсли;
			
			СвернутьПравуюПанель.Картинка = Картинка;
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

Процедура НастроитьОтборыНажатие(Форма, СтруктураПараметров, ДополнительныеПараметры = Неопределено) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("НастройкаОтборовЗавершение", Форма, ДополнительныеПараметры);
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураПараметров, ДополнительныеПараметры);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкиФильтров", СтруктураПараметров, Форма,,,,Оповещение);
	
КонецПроцедуры

Процедура СброситьОтборПоПериоду(Форма, ИмяСпискаОтбора="Список", ИмяПоляОтбора="Дата", СтруктураИменЭлементов = Неопределено, УстановитьОтбор = Истина, ОписаниеОповещенияОВыбореПериода = Неопределено) Экспорт

	Параметры = Новый Структура("Форма, ИмяСпискаОтбора, ИмяПоляОтбора", Форма, ИмяСпискаОтбора, ИмяПоляОтбора);
	Если НЕ (СтруктураИменЭлементов = Неопределено) Тогда
		Параметры.Вставить("СтруктураИменЭлементов", СтруктураИменЭлементов);
	КонецЕсли;
	
	Если ОписаниеОповещенияОВыбореПериода <> Неопределено Тогда
		Параметры.Вставить("ОписаниеОповещенияОВыбореПериода",ОписаниеОповещенияОВыбореПериода);
	КонецЕсли;
	
	Параметры.Вставить("УстановитьОтбор", УстановитьОтбор);
	
	НастроитьОтображениеПериода(Новый СтандартныйПериод, Параметры);
	
КонецПроцедуры

#Область ИерархияВСправочниках

// Функция - Названия элементов для работы с иерархией
// 
// Возвращаемое значение:
//  Структура:
//   * КонтекстноеМенюИзменить - Строка
//   * КонтекстноеМенюСкопировать - Строка
//   * КонтекстноеМенюУстановитьПометкуУдаления - Строка
//
Функция НазванияЭлементовДляРаботыСИерархией() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Изменить", "ОтборИерархияИерархияИзменить");
	Результат.Вставить("Скопировать", "ОтборИерархияИерархияСкопировать");
	Результат.Вставить("УстановитьПометкуУдаления", "ОтборИерархияИерархияУстановитьПометкуУдаления");
	
	Результат.Вставить("КонтекстноеМенюИзменить", "ОтборИерархияКонтекстноеМенюИерархияИзменить");
	Результат.Вставить("КонтекстноеМенюСкопировать", "ОтборИерархияКонтекстноеМенюИерархияСкопировать");
	Результат.Вставить("КонтекстноеМенюУстановитьПометкуУдаления", "ОтборИерархияКонтекстноеМенюИерархияУстановитьПометкуУдаления");
	Результат.Вставить("КонтекстноеМенюВключаяВложенные", "ОтборИерархияКонтекстноеМенюИерархияВключаяВложенные");
	
	Возврат Результат;
	
КонецФункции

// Устанавливает отбор в списке согласно выбранной группе в иерархии
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Тип - Тип - тип справочника
//  ПустаяСсылка - СправочникСсылка - пустая ссылка на справочник
//  НазваниеРеквизитаГруппы - Строка - например, "ГруппаКонтрагентов"
//  НазванияЭлементов - см НазванияЭлементовДляРаботыСИерархией
//
Процедура УстановитьОтборПоИерархии(
	Форма, ТипСправочника, ПустаяСсылка, НазваниеРеквизитаГруппы = "Группа", НазванияЭлементов = Неопределено) Экспорт
	
	Элементы = Форма.Элементы;
	ТекущиеДанные = Элементы.ОтборИерархия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НазванияЭлементов = Неопределено Тогда
		НазванияЭлементов = НазванияЭлементовДляРаботыСИерархией();
	КонецЕсли;
	
	ЗначениеГруппы = ТекущиеДанные[НазваниеРеквизитаГруппы];
	ЭтоОтборПоГруппе = (ТипЗнч(ЗначениеГруппы) = ТипСправочника);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазванияЭлементов.КонтекстноеМенюИзменить, "Доступность", ЭтоОтборПоГруппе);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазванияЭлементов.КонтекстноеМенюСкопировать, "Доступность", ЭтоОтборПоГруппе);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазванияЭлементов.КонтекстноеМенюУстановитьПометкуУдаления, "Доступность", ЭтоОтборПоГруппе);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазванияЭлементов.Изменить, "Доступность", ЭтоОтборПоГруппе);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазванияЭлементов.Скопировать, "Доступность", ЭтоОтборПоГруппе);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазванияЭлементов.УстановитьПометкуУдаления, "Доступность", ЭтоОтборПоГруппе);
	
	ПравоеЗначение = Неопределено;
	Сравнение = ВидСравненияКомпоновкиДанных.Равно;
	Использование = Истина;
	
	Если ЭтоОтборПоГруппе Тогда
		
		Если Элементы.Найти(НазванияЭлементов.КонтекстноеМенюВключаяВложенные) <> Неопределено
			И Элементы[НазванияЭлементов.КонтекстноеМенюВключаяВложенные].Пометка Тогда
			
			Сравнение = ВидСравненияКомпоновкиДанных.ВИерархии;
			
		КонецЕсли;
		
		ПравоеЗначение = ЗначениеГруппы;
		
	ИначеЕсли ЗначениеГруппы = "Все" Тогда
		
		Использование = Ложь;
		
	ИначеЕсли ЗначениеГруппы = "БезГруппы" Тогда
		
		ПравоеЗначение = ПустаяСсылка;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список,
	"Родитель", ПравоеЗначение, Сравнение, , Использование);
	
	Форма.ИерархияИндекс = Использование;
	
КонецПроцедуры

Процедура ИерархияПриНаведении(
	Элемент, Форма, Строка, ТипСправочника, НазваниеРеквизитаГруппы = "Группа", НазванияЭлементов = Неопределено) Экспорт
	
	Если Строка = Неопределено Тогда
		Если ТипЗнч(Элемент.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Возврат;
		КонецЕсли;
		ДанныеСтроки = Элемент.ТекущиеДанные;
	ИначеЕсли ТипЗнч(Строка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	Иначе
		ДанныеСтроки = Форма.ОтборИерархия.НайтиПоИдентификатору(Строка);
	КонецЕсли;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НазванияЭлементов = Неопределено Тогда
		НазванияЭлементов = НазванияЭлементовДляРаботыСИерархией();
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	ЭтоОтборПоГруппе = (ТипЗнч(ДанныеСтроки[НазваниеРеквизитаГруппы]) = ТипСправочника);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазванияЭлементов.Изменить, "Доступность", ЭтоОтборПоГруппе);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазванияЭлементов.Скопировать, "Доступность", ЭтоОтборПоГруппе);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазванияЭлементов.УстановитьПометкуУдаления, "Доступность", ЭтоОтборПоГруппе);
	
КонецПроцедуры

// Осуществляет переход в списке иерархии панели отборов и и устанавливает текущей страницей страницу иерархии.
// Для вызова из форм списков иерархического справочника с присутствующей панелью отборов и списком иерархии.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, содержащая панель отборов и список иерархии
//  ЗначениеСписка - СправочникСсылка - Значение родителя текущих данных списка элементов
//  ПараметрыПерехода - см. РаботаСОтборамиКлиентСервер.ПараметрыПереходаКГруппеВИерархии
//  ПерейтиНаСтраницуИерархии - Булево - Признак необходимости перехода на страницу иерархии
//
Процедура ПерейтиВВИерархии(Форма, ЗначениеСписка, ПараметрыПерехода, ПерейтиНаСтраницуИерархии = Истина) Экспорт

	Элементы = Форма.Элементы;
	СписокИерархии = Форма[ПараметрыПерехода.ИмяРеквизитаИерархии];
	
	ИдентификаторСтроки = 0;
	Если ЗначениеСписка = ПараметрыПерехода.ЗначениеЭлементаСпискаБезРодителя Тогда
		ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля(
			ПараметрыПерехода.ИмяКолонкиИерархии, ИдентификаторСтроки,
			СписокИерархии.ПолучитьЭлементы(),
			ПараметрыПерехода.ЗначениеИерархииБезРодителя, Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля(ПараметрыПерехода.ИмяКолонкиИерархии,
			ИдентификаторСтроки, СписокИерархии.ПолучитьЭлементы(),
			ЗначениеСписка, Ложь);
	КонецЕсли;
	
	Элементы[ПараметрыПерехода.ИмяЭлементаИерархии].ТекущаяСтрока = ИдентификаторСтроки;
	Если ПерейтиНаСтраницуИерархии Тогда
		Элементы[ПараметрыПерехода.ИмяГрупппыСтраницОтборов].ТекущаяСтраница = Элементы[ПараметрыПерехода.ИмяСтраницыИерархии];
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПредставлениеПериодаНажатиеЗавершение(НовыйПериод, Параметры) Экспорт
	
	НастроитьОтображениеПериода(НовыйПериод, Параметры);
	
	РаботаСОтборамиКлиентСервер.УстановитьОтображениеКомандыСброситьВсеОтборы(Параметры.Форма, Параметры.ИмяТЧДанныеМеток);
	
КонецПроцедуры

Процедура НастроитьОтображениеПериода(НовыйПериод, Параметры)

	Если НовыйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Форма			= Параметры.Форма;
	ИмяСпискаОтбора = Параметры.ИмяСпискаОтбора;
	ИмяПоляОтбора	= Параметры.ИмяПоляОтбора;
	
	Если Параметры.Свойство("СтруктураИменЭлементов") Тогда
	
		Если ТипЗнч(НовыйПериод)=Тип("СтандартныйПериод") Тогда
			Форма[Параметры.СтруктураИменЭлементов.ОтборПериод] = НовыйПериод;
		ИначеЕсли ТипЗнч(НовыйПериод)=Тип("Дата") Тогда
			Форма[Параметры.СтруктураИменЭлементов.ОтборПериод].ДатаОкончания = НовыйПериод;
		КонецЕсли;
		
		Форма[Параметры.СтруктураИменЭлементов.ПредставлениеПериода] = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(Форма[Параметры.СтруктураИменЭлементов.ОтборПериод]);
		Если Параметры.УстановитьОтбор Тогда
			РаботаСОтборамиКлиентСервер.УстановитьОтборПоПериоду(
				Форма[ИмяСпискаОтбора].КомпоновщикНастроек.Настройки.Отбор, 
				Форма[Параметры.СтруктураИменЭлементов.ОтборПериод].ДатаНачала, 
				Форма[Параметры.СтруктураИменЭлементов.ОтборПериод].ДатаОкончания, ИмяПоляОтбора);
		КонецЕсли;
		
		Если Параметры.СтруктураИменЭлементов.Свойство("СобытиеОповещения") Тогда
			Оповестить(Параметры.СтруктураИменЭлементов.СобытиеОповещения);
		КонецЕсли;
			
	Иначе
		
		Если ТипЗнч(НовыйПериод)=Тип("СтандартныйПериод") Тогда
			Форма.ОтборПериод = НовыйПериод;
		ИначеЕсли ТипЗнч(НовыйПериод)=Тип("Дата") Тогда
			Форма.ОтборПериод.ДатаОкончания = НовыйПериод;
		КонецЕсли;
		
		Форма.ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(Форма.ОтборПериод);
		Если Параметры.УстановитьОтбор Тогда
			РаботаСОтборамиКлиентСервер.УстановитьОтборПоПериоду(Форма[ИмяСпискаОтбора].КомпоновщикНастроек.Настройки.Отбор, Форма.ОтборПериод.ДатаНачала, Форма.ОтборПериод.ДатаОкончания, ИмяПоляОтбора);
		КонецЕсли;
		
		Если Параметры.Свойство("ОписаниеОповещенияОВыбореПериода") Тогда
			Оповестить(Параметры.ОписаниеОповещенияОВыбореПериода);
		КонецЕсли;
	КонецЕсли;
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		Форма.ОбновитьОтображениеДанных();
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Элементы, "ПраваяПанель") Тогда
			Если Параметры.Свойство("СтруктураИменЭлементов") Тогда
				ИмяПараметраОтборПериод = Параметры.СтруктураИменЭлементов.ОтборПериод;
			Иначе
				ИмяПараметраОтборПериод = "ОтборПериод";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Форма[ИмяПараметраОтборПериод]) Тогда
				Форма.Элементы.ПраваяПанель.Заголовок = НСтр("ru = 'Отборы (установлены)'");
			Иначе
				Форма.Элементы.ПраваяПанель.Заголовок = НСтр("ru = 'Отборы'");
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	Если Параметры.Свойство("СтруктураИменЭлементов") И Параметры.СтруктураИменЭлементов.Свойство("ИмяТЧДанныеМеток") Тогда
		ИмяТЧДанныеМеток = Параметры.СтруктураИменЭлементов.ИмяТЧДанныеМеток;
	ИначеЕсли Параметры.Свойство("ИмяТЧДанныеМеток") Тогда
		ИмяТЧДанныеМеток = Параметры.ИмяТЧДанныеМеток;
	Иначе
		ИмяТЧДанныеМеток = "ДанныеМеток";
	КонецЕсли;
	РаботаСОтборамиКлиентСервер.ОбновитьКоличествоФильтров(Форма, ИмяТЧДанныеМеток);
	
КонецПроцедуры

#КонецОбласти



