
#Область СлужебныйПрограммныйИнтерфейс

#Область ВыполнениеОперацииАсинх

Асинх Функция ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации) Экспорт
	
	// 1. Подготовить контекст
	Если Не ЗначениеЗаполнено(Контекст.ОсновноеУстройство) Тогда
		Контекст.Ошибки.Добавить(НСтр("ru='Устройство для подключения не выбрано.'"));
		РезультатВыполненияКоманды = ОтрицательныйРезультатВыполненияКоманды(Контекст);
		Возврат РезультатВыполненияКоманды;
	КонецЕсли;
	ПодготовитьКонтекстОперации(Контекст);
	Контекст.Команда = Команда;
	
	// 2. Подключить основное устройство и дополнительные устройства
	Если Не (Ждать ВыполнитьПодключенияУстройствКомандыАсинх(Контекст)) Тогда
		РезультатВыполненияКоманды = ОтрицательныйРезультатВыполненияКоманды(Контекст);
		Возврат РезультатВыполненияКоманды;
	КонецЕсли;
	ДобавитьПодключенныеУстройстваВКонтекст(Контекст);
	
	// 3. Подготовить данные
	Если Не (Ждать ПодготовитьДанные(Контекст, Команда, ПараметрыОперации)) Тогда
		Ждать ЗавершитьВыполнениеКомандыАсинх(Контекст);
		РезультатВыполненияКоманды = ОтрицательныйРезультатВыполненияКоманды(Контекст);
		Ждать ВыполнитьАнализОшибки(Контекст, РезультатВыполненияКоманды);
		Возврат РезультатВыполненияКоманды;
	КонецЕсли;
	
	ДанныеОперации = Контекст.ДанныеОперации;
	Если Не ЗначениеЗаполнено(ДанныеОперации) 
		И ТипЗнч(ПараметрыОперации) = Тип("Структура") Тогда
		ДанныеОперации = ПараметрыОперации;
	КонецЕсли;
	
	// 4. Выполнение операции
	ОбработчикКомандОборудования = ОбработчикКомандОборудования();
	ПараметрыПодключения = ПараметрыПодключенияКлиент(Контекст);
	
	Если ПустаяСтрока(Контекст.ПроцессорОперации) Тогда
		РезультатОперации = Ждать ОбработчикКомандОборудования.ВыполнениеКоманды(
			ПараметрыПодключения.ПодключениеОсновногоУстройства, Команда, ДанныеОперации);
	Иначе
		МодульПроцессорОперации = ОбщегоНазначенияБПОКлиент.ОбщийМодуль(Контекст.ПроцессорОперации);
		РезультатОперации = Ждать МодульПроцессорОперации.ВыполнитьОперациюАсинх(
			ПараметрыПодключения, Команда, ДанныеОперации);
		Контекст.ДанныеОперации = ДанныеОперации;
	КонецЕсли;
			
	Если Не ЗначениеЗаполнено(РезультатОперации.ИдентификаторУстройства) Тогда
		РезультатОперации.ИдентификаторУстройства = Контекст.ОсновноеУстройство;
	КонецЕсли;
		
	// 5. Обработать результат
	РезультатОперации = Ждать ОбработатьРезультат(Контекст, Команда, РезультатОперации);
	
	// 6. Завершить выполнение операции
	Ждать ЗавершитьВыполнениеКомандыАсинх(Контекст);
	Если Не РезультатОперации.Результат Тогда
		Ждать ВыполнитьАнализОшибки(Контекст, РезультатОперации);
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыполнениеОперацииАсинх

Процедура ПодготовитьКонтекстОперации(Контекст)
	
	Если ЗначениеЗаполнено(Контекст.ДополнительныеПараметры) Тогда
		ДополнительныеПараметры = Контекст.ДополнительныеПараметры;
		
		ОставитьПодключенным = Неопределено;
		Если ДополнительныеПараметры.Свойство("ОставитьПодключенным", ОставитьПодключенным) Тогда
			Контекст.ОставитьПодключенным = ОставитьПодключенным;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет подключение устройств если они не подключены.
// 
// Параметры:
//  КонтекстВыполненияКоманды - см. КонтекстВыполненияПакетнойКоманды
// 
// Возвращаемое значение:
//   Соответствие Из КлючИЗначение:
//    Ключ - СправочникСсылка.ПодключаемоеОборудование
//    Значение - Неопределено, см. МенеджерОборудованияКлиент.ПараметрыПодключенияУстройства
Асинх Функция ВыполнитьПодключенияУстройствКомандыАсинх(Контекст) Экспорт
	
	МассивУстройств = Новый Массив;
	МассивУстройств.Добавить(Контекст.ОсновноеУстройство);
	МассивДополнительныхУстройств = 
		ОбщегоНазначенияБПОКлиентСервер.УпаковатьВМассив(Контекст.ДополнительныеУстройства);
	ОбщегоНазначенияБПОКлиентСервер.ДополнитьМассив(
		МассивУстройств, МассивДополнительныхУстройств, Истина);
	
	ПодключенияУстройствКлиент = Контекст.ПодключенияУстройствКлиент;
	ПодключенияУстройствСервер = Контекст.ПодключенияУстройствСервер;
	
	ТребуетсяПодключить = Новый Массив();
	Для Каждого УстройствоСсылка Из МассивУстройств Цикл
		ПодключениеКлиент = МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(УстройствоСсылка);
		Если ЗначениеЗаполнено(ПодключениеКлиент) Тогда
			ПодключениеСервер = МенеджерОборудованияКлиентСервер.ПараметрыПодключения(ПодключениеКлиент);
			ПодключенияУстройствКлиент.Вставить(УстройствоСсылка, ПодключениеКлиент);
			ПодключенияУстройствСервер.Вставить(УстройствоСсылка, ПодключениеСервер);
		Иначе
			ТребуетсяПодключить.Добавить(УстройствоСсылка);
		КонецЕсли;
	КонецЦикла;
	
	Если ТребуетсяПодключить.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// есть неподключенные устройства, требуется выполнить их подключение
	РезультатыПодключений = Ждать МенеджерОборудованияКлиент.ПодключениеОборудованияАсинх(Контекст.Клиент, , ТребуетсяПодключить);
	Для Каждого РезультатПодключения Из РезультатыПодключений Цикл
		УстройствоСсылка = РезультатПодключения.ИдентификаторУстройства;
		Если РезультатПодключения.Результат Тогда
			ПодключениеКлиент = РезультатПодключения.ПодключенноеУстройство;
			ПодключениеСервер = МенеджерОборудованияКлиентСервер.ПараметрыПодключения(ПодключениеКлиент);
			ПодключенияУстройствКлиент.Вставить(УстройствоСсылка, ПодключениеКлиент);
			ПодключенияУстройствСервер.Вставить(УстройствоСсылка, ПодключениеСервер);
			Контекст.ПодключеныАвтоматически.Добавить(УстройствоСсылка);
		Иначе
			Контекст.Ошибки.Добавить(РезультатПодключения.ОписаниеОшибки);
			ПодключенияУстройствКлиент.Вставить(УстройствоСсылка, Неопределено);
			ПодключенияУстройствСервер.Вставить(УстройствоСсылка, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Контекст.Ошибки.Количество() = 0;
	
КонецФункции

Процедура ДобавитьПодключенныеУстройстваВКонтекст(Контекст)
	
	ПодключенияУстройствКлиент = Контекст.ПодключенияУстройствКлиент;
	ПодключенияУстройствСервер = Контекст.ПодключенияУстройствСервер;
	
	ПодключенныеУстройства = МенеджерОборудованияКлиент.ПодключаемоеОборудование().ПараметрыПодключенияПО;
	Для Каждого ПодключениеКлиент Из ПодключенныеУстройства Цикл
		Если ПодключенияУстройствКлиент.Получить(ПодключениеКлиент.Ссылка) = Неопределено Тогда
			ПодключениеСервер = МенеджерОборудованияКлиентСервер.ПараметрыПодключения(ПодключениеКлиент);
			ПодключенияУстройствКлиент.Вставить(ПодключениеКлиент.Ссылка, ПодключениеКлиент);
			ПодключенияУстройствСервер.Вставить(ПодключениеКлиент.Ссылка, ПодключениеСервер);
		КонецЕсли;
	КонецЦикла
	
КонецПроцедуры

Функция ОбработчикКомандОборудования() Экспорт
	
	Возврат ПодключаемоеОборудованиеДрайверКлиент;
	
КонецФункции

// Возвращает идентификаторы устройств и сами подключения устройств
//
// Параметры:
//  Контекст - Структура
//
// Возвращаемое значение:
//  Структура:
//   * ОсновноеУстройство - СправочникСсылка.ПодключаемоеОборудование
//   * ДополнительныеУстройства - Массив из СправочникСсылка.ПодключаемоеОборудование
//   * ПодключениеОсновногоУстройства - см. МенеджерОборудованияКлиентСервер.ПараметрыПодключения
//   * ПодключенияУстройств - Массив из см. МенеджерОборудованияКлиентСервер.ПараметрыПодключения
// 
Функция ПараметрыПодключенияСервер(Контекст)
	
	Параметры = Новый Структура();
	Параметры.Вставить("ОсновноеУстройство", Контекст.ОсновноеУстройство);
	Параметры.Вставить("ДополнительныеУстройства", Контекст.ДополнительныеУстройства);
	Параметры.Вставить("ПодключенияУстройств", Контекст.ПодключенияУстройствСервер);
	Параметры.Вставить(
		"ПодключениеОсновногоУстройства", 
		Параметры.ПодключенияУстройств.Получить(Параметры.ОсновноеУстройство)
	);
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыПодключенияКлиент(Контекст)
	
	Параметры = Новый Структура();
	Параметры.Вставить("ОсновноеУстройство", Контекст.ОсновноеУстройство);
	Параметры.Вставить("ДополнительныеУстройства", Контекст.ДополнительныеУстройства);
	Параметры.Вставить("ПодключенияУстройств", Контекст.ПодключенияУстройствКлиент);
	Параметры.Вставить(
		"ПодключениеОсновногоУстройства", 
		Параметры.ПодключенияУстройств.Получить(Параметры.ОсновноеУстройство)
	);
	Возврат Параметры;
	
КонецФункции

Асинх Функция ПодготовитьДанные(Контекст, Команда, ПараметрыОперации)
	
	Если Контекст.ПодготовитьДанныеКлиент Тогда
		
		МодульПроцессорДанных = ОбщегоНазначенияБПОКлиент.ОбщийМодуль(Контекст.ПроцессорДанныхКлиент);
		ПараметрыПодключенияКлиент = ПараметрыПодключенияКлиент(Контекст);
		Ждать МодульПроцессорДанных.ПриПодготовкеДанныхОперацииАсинх(
			Контекст.ДанныеОперации, 
			ПараметрыПодключенияКлиент, 
			Команда, 
			ПараметрыОперации);
			
		ДанныеОперации = Контекст.ДанныеОперации;
		Если ДанныеОперации.Свойство("Результат") И Не ДанныеОперации.Результат Тогда
			Контекст.Ошибки.Добавить(ДанныеОперации.ТекстОшибки);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Контекст.ПодготовитьДанныеСервер Тогда
		ПараметрыПодключенияСервер = ПараметрыПодключенияСервер(Контекст);
		МенеджерОборудованияВызовСервера.ПриПодготовкеДанныхОперации(
			Контекст.ПроцессорДанныхСервер, 
			Контекст.ДанныеОперации, 
			ПараметрыПодключенияСервер, 
			Команда, 
			ПараметрыОперации);
			
		ДанныеОперации = Контекст.ДанныеОперации;
		Если ДанныеОперации.Свойство("Результат") И Не ДанныеОперации.Результат Тогда
			Контекст.Ошибки.Добавить(ДанныеОперации.ТекстОшибки);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Асинх Функция ОбработатьРезультат(Контекст, Команда, РезультатОперации)
	
	
	РезультатОперации.Вставить("ТестовоеПолеСозданноеНаКлиенте", Новый Структура);
	
	Если Контекст.ОбработатьДанныеПриОшибкеСервер 
		Или (Контекст.ОбработатьДанныеСервер И РезультатОперации.Результат) Тогда
		ПараметрыПодключенияСервер = ПараметрыПодключенияСервер(Контекст);
		МенеджерОборудованияВызовСервера.ПриОбработкеРезультатовОперации(
			Контекст.ПроцессорДанныхСервер,
			Контекст.ДанныеОперации, 
			ПараметрыПодключенияСервер, 
			Команда, 
			РезультатОперации);
	КонецЕсли;
		
	Если Контекст.ОбработатьДанныеПриОшибкеКлиент
		Или (Контекст.ОбработатьДанныеКлиент И РезультатОперации.Результат) Тогда
		
		Контекст.ДанныеОперации.Вставить("ДополнительныеПараметры", Контекст.ДополнительныеПараметры);
		МодульПроцессорДанных = ОбщегоНазначенияБПОКлиент.ОбщийМодуль(Контекст.ПроцессорДанныхКлиент);
		ПараметрыПодключенияКлиент = ПараметрыПодключенияКлиент(Контекст);
		Ждать МодульПроцессорДанных.ПриОбработкеРезультатовОперацииАсинх(
			Контекст.ДанныеОперации, 
			ПараметрыПодключенияКлиент, 
			Команда, 
			РезультатОперации);
		Контекст.ДанныеОперации.Удалить("ДополнительныеПараметры");
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

// Завершить выполнение команды асинх.
// 
// Параметры:
//  КонтекстВыполненияКоманды - см. КонтекстВыполненияПакетнойКоманды
// 
// Возвращаемое значение:
//   Булево
//  
Асинх Функция ЗавершитьВыполнениеКомандыАсинх(Контекст) Экспорт
	
	// отключить оборудование если требуется
	Если Не Контекст.ОставитьПодключенным Тогда
		
		ОтключатьПриЗавершении = Контекст.ПодключеныАвтоматически;
		
		// Отключить сетевое оборудование при необходимости
		ПодключениеОсновногоУстройства = Контекст.ПодключенияУстройствКлиент[Контекст.ОсновноеУстройство];
		Если ПодключениеОсновногоУстройства <> Неопределено И
			ПодключениеОсновногоУстройства.СетевоеОборудование Тогда
			Если ОтключатьПриЗавершении.Найти(Контекст.ОсновноеУстройство) = Неопределено Тогда
				ОтключатьПриЗавершении.Добавить(Контекст.ОсновноеУстройство);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтключатьПриЗавершении) Тогда
			Ждать МенеджерОборудованияКлиент.ОтключениеОборудованияАсинх(Контекст.Клиент,,ОтключатьПриЗавершении);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Асинх Функция ВыполнитьАнализОшибки(Контекст, РезультатОперации)
	
	Если Контекст.СообщенияВСлужбуТехническойПоддержки 
		И ОбщегоНазначенияБПОКлиент.ИспользуетсяСообщенияВСлужбуТехническойПоддержки() Тогда
		
		МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиБПОКлиент");
		
		// ++ НеМобильноеПриложение
		Если Не РезультатОперации.Результат Тогда
			
			ИдентификаторУстройства = Контекст.ОсновноеУстройство;
			РезультатАнализаОшибки = МенеджерОборудованияКлиент.АнализТекстаОшибкиОборудования(ИдентификаторУстройства, РезультатОперации.ОписаниеОшибки);
			РезультатОперации.ОписаниеОшибки = РезультатАнализаОшибки.ОписаниеОшибки;
			ЛокальнаяОбработкаОшибки = РезультатАнализаОшибки.ЛокальнаяОбработкаОшибки;
			
			Если Не ЛокальнаяОбработкаОшибки И ЗначениеЗаполнено(ИдентификаторУстройства) Тогда  
				
				ОписаниеОшибки = РезультатАнализаОшибки.ОписаниеОшибки;
				КраткоеОписание = РезультатАнализаОшибки.КраткоеОписание;
				ДополнительныеДанные = Новый Структура();
				ДополнительныеДанные.Вставить("Операция",          Контекст.Команда);
				ДополнительныеДанные.Вставить("ОписаниеОшибки",    ОписаниеОшибки);
				ДополнительныеДанные.Вставить("ПараметрыОперации", Контекст.ДанныеОперации);
				
				ТекстВопроса = СтрШаблон(НСтр("ru = '%1
				|
				|Создать сообщение об ошибке в службу поддержки?'"), ОписаниеОшибки);
			
				Параметры = МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.ПараметрыОтправкиСообщенияОбОшибке();
				Параметры.Вставить("ИдентификаторОборудования", ИдентификаторУстройства);
				Параметры.Вставить("ТекстОшибки",               КраткоеОписание + ". " + РезультатОперации.ОписаниеОшибки);
				Параметры.Вставить("ДополнительныеДанные",      ДополнительныеДанные);
				Параметры.Вставить("ТекстВопроса",              ТекстВопроса);
			
				МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.ОтправитьСообщениеОбОшибкеСВопросомАсинх(Параметры);
				
			КонецЕсли;
			
		КонецЕсли;
		// -- НеМобильноеПриложение
		
	КонецЕсли;
	
КонецФункции


// Завершить выполнение команды асинх.
// 
// Параметры:
//  КонтекстВыполненияКоманды - см. КонтекстВыполненияПакетнойКоманды
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование
// 
// Возвращаемое значение:
//   см. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании
//  
Функция ОтрицательныйРезультатВыполненияКоманды(Контекст, ИдентификаторУстройства = Неопределено)
	
	ТекстОшибки = СокрЛП(СтрСоединить(Контекст.Ошибки, Символы.ПС));
	Если ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
		Идентификатор = ИдентификаторУстройства;
	Иначе
		Идентификатор = Контекст.ОсновноеУстройство;
	КонецЕсли;
	
	Возврат МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(
		Ложь, ТекстОшибки, Идентификатор);
	
КонецФункции

#КонецОбласти

#КонецОбласти