#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьНастройки();
	УбратьНастройкиНеиспользуемыеВУНФ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонстантыНаборИспользоватьНачислениеЗарплатыПриИзменении(Элемент)
	КонстантыНаборИспользоватьНачислениеЗарплатыПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура КонстантыНаборИспользоватьРезервыПоОплатеТрудаПриИзменении(Элемент)
	КонстантыНаборИспользоватьРезервыПоОплатеТрудаПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура КонстантыНаборРасчетЗарплатыДляНебольшихОрганизацийПриИзменении(Элемент)
	КонстантыНаборРасчетЗарплатыДляНебольшихОрганизацийПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура КонстантыНаборИспользоватьКадровыйУчетПриИзменении(Элемент)
	КонстантыНаборИспользоватьКадровыйУчетПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура КонстантыНаборИспользоватьРасчетПервойПоловиныМесяцаПриИзменении(Элемент)
	КонстантыНаборИспользоватьРасчетПервойПоловиныМесяцаПриИзмененииПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРасчетаЗарплатыИспользоватьНачисленияПоДоговорамПриИзменении(Элемент)
	НастройкиРасчетаЗарплатыИспользоватьНачисленияПоДоговорамПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКадровогоУчетаИспользоватьРаботуНаНеполнуюСтавкуПриИзменении(Элемент)
	НастройкиКадровогоУчетаИспользоватьРаботуНаНеполнуюСтавкуПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьСотрудниковАвтоматическиПриИзменении(Элемент)
	ОтправлятьСотрудниковАвтоматическиПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КонстантыНаборИспользоватьНачислениеЗарплатыПриИзмененииНаСервере()
	
	Константы.ИспользоватьНачислениеЗарплаты.Установить(КонстантыНабор.ИспользоватьНачислениеЗарплаты);
	ПрочитатьНастройки();
	
КонецПроцедуры

&НаСервере
Процедура КонстантыНаборРасчетЗарплатыДляНебольшихОрганизацийПриИзмененииНаСервере()
	Константы.РасчетЗарплатыДляНебольшихОрганизаций.Установить(КонстантыНабор.РасчетЗарплатыДляНебольшихОрганизаций);
	ПрочитатьНастройки();
КонецПроцедуры

&НаСервере
Процедура КонстантыНаборИспользоватьРезервыПоОплатеТрудаПриИзмененииНаСервере()
	Константы.ИспользоватьРезервыПоОплатеТруда.Установить(КонстантыНабор.ИспользоватьРезервыПоОплатеТруда);
	ПрочитатьНастройки();
КонецПроцедуры

&НаСервере
Процедура КонстантыНаборИспользоватьКадровыйУчетПриИзмененииНаСервере()
	Константы.ИспользоватьКадровыйУчет.Установить(КонстантыНабор.ИспользоватьКадровыйУчет);
	СформироватьКадровыеПриказыНаСервере();
КонецПроцедуры

&НаСервере
Процедура НастройкиРасчетаЗарплатыИспользоватьНачисленияПоДоговорамПриИзмененииНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.НастройкиРасчетаЗарплаты.СоздатьМенеджерЗаписи();
	НоваяНастройка = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(НастройкиРасчетаЗарплаты,
		Метаданные.РегистрыСведений.НастройкиРасчетаЗарплаты);
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, НоваяНастройка);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Процедура НастройкиКадровогоУчетаИспользоватьРаботуНаНеполнуюСтавкуПриИзмененииНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.НастройкиКадровогоУчета.СоздатьМенеджерЗаписи();
	НоваяНастройка = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(НастройкиКадровогоУчета,
		Метаданные.РегистрыСведений.НастройкиКадровогоУчета);
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, НоваяНастройка);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОтправлятьСотрудниковАвтоматическиПриИзмененииНаСервере()
	Константы.ИспользоватьАвтоматическуюОтправкуСотрудниковБронированияКомандировок.Установить(
		КонстантыНабор.ИспользоватьАвтоматическуюОтправкуСотрудниковБронированияКомандировок);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройки()
	
	СтрокаКонстант = "ИспользоватьНачислениеЗарплаты,ИспользоватьРезервыПоОплатеТруда,ИспользоватьКадровыйУчет,
		|РасчетЗарплатыДляНебольшихОрганизаций,
		|ИспользоватьАвтоматическуюОтправкуСотрудниковБронированияКомандировок,ИспользоватьРасчетПервойПоловиныМесяца";
	
	Настройка = Константы.СоздатьНабор(СтрокаКонстант);
	Настройка.Прочитать();
	ЗначениеВРеквизитФормы(Настройка, "КонстантыНабор");
	
	Настройка = РегистрыСведений.НастройкиРасчетаЗарплаты.СоздатьМенеджерЗаписи();
	Настройка.Прочитать();
	ЗначениеВРеквизитФормы(Настройка, "НастройкиРасчетаЗарплаты");
	
	Настройка = РегистрыСведений.НастройкиКадровогоУчета.СоздатьМенеджерЗаписи();
	Настройка.Прочитать();
	ЗначениеВРеквизитФормы(Настройка, "НастройкиКадровогоУчета");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКадровыеПриказыНаСервере()
	
	КадровыйУчетБазовый.СформироватьКадровыеПриказы();
	
КонецПроцедуры

&НаСервере
Процедура УбратьНастройкиНеиспользуемыеВУНФ()
	
	Элементы.БронированиеКомандировокГруппа.Видимость = Ложь;
	Элементы.ГруппаПодчиненныеНастройкиРасчетаЗарплаты.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура КонстантыНаборИспользоватьРасчетПервойПоловиныМесяцаПриИзмененииПриИзмененииНаСервере()
	
	Константы.ИспользоватьРасчетПервойПоловиныМесяца.Установить(КонстантыНабор.ИспользоватьРасчетПервойПоловиныМесяца);
	ПрочитатьНастройки();
	
КонецПроцедуры

#КонецОбласти
