#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Параметры.ИдентификаторПоказателя) Тогда
		ШаблонПроцедуры = Справочники.ПоказателиБизнеса.ШаблонПроцедурыПодключаемогоПоказателя(
			Параметры.ИдентификаторПоказателя);
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ИдентификаторВидаЦен) Тогда
		ШаблонПроцедуры = Справочники.ВидыЦен.ШаблонПроцедурыПодключаемогоВидаЦен(Параметры.ИдентификаторВидаЦен);
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ИдентификаторМетодаПрогнозаПотребностей) Тогда
		ШаблонПроцедуры = Справочники.МетодыПрогнозаПродаж.ШаблонПроцедурыПодключаемогоМетодаПрогноза(
			Параметры.ИдентификаторМетодаПрогнозаПотребностей);
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ИдентификаторПоказателяРасчета) Тогда
		ШаблонПроцедуры = Справочники.ПоказателиРасчетов.ШаблонПроцедурыПодключаемогоПоказателяРасчета(
			Параметры.ИдентификаторПоказателяРасчета);
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ИдентификаторАвтоматическойСкидки) Тогда
		ШаблонПроцедуры = Справочники.АвтоматическиеСкидки.ШаблонПроцедурыПодключаемойСкидки(
			Параметры.ИдентификаторАвтоматическойСкидки);
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ИдентификаторСпецификации) Тогда
		ШаблонПроцедуры = Справочники.Спецификации.ШаблонПроцедурыПодключаемойСпецификации(
			Параметры.ИдентификаторСпецификации);
	КонецЕсли;

	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Элементы.ТекстШаг4.Видимость = Ложь;
		Элементы.СкриншотШаг4.Видимость = Ложь;
	Иначе
		Элементы.ТекстШаг4РежимСервиса.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстШаг3ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		Возврат;
	КонецЕсли;
	ЭлементыБуфераОбмена = Новый Массив;
	Если СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(СтандартныйФорматДанныхБуфераОбмена.Текст) Тогда
		ДляБуфераОбмена = Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст,
			ШаблонПроцедуры);
		ЭлементыБуфераОбмена.Добавить(ДляБуфераОбмена);
	КонецЕсли;
	СредстваБуфераОбмена.ПоместитьДанныеАсинх(ЭлементыБуфераОбмена);
КонецПроцедуры

#КонецОбласти