#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет табличную часть Сотрудники данными по остаткам начислений из регистра РасчетыСПерсоналом.
//
// Параметры:
//   УчитыватьПредыдущиеПериоды - Булево - признак необходимости учета остатков за периоды,
//                                       предшествующие периоду регистрации документа
//
Процедура ЗаполнитьПоОстаткамНаСервере(УчитыватьПредыдущиеПериоды = Ложь) Экспорт

	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Укажите операцию!'");
 		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Аванс Тогда	
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'При выплате аванса заполнение по остаткам не предусмотрено!'");
 		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПерсоналомОстатки.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА &ВалютаРасчетов = &ВалютаДокумента
	|				ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
	|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс / &Кратность КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) КАК СуммаПлатежа,
	|	СУММА(РасчетыСПерсоналомОстатки.СуммаВалОстаток) КАК СуммаРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСПерсоналом.Остатки(
	|			,
	|			Организация = &Организация
	|				И ПериодРегистрации = &ПериодРегистрации
	|				И Валюта = &ВалютаРасчетов
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК РасчетыСПерсоналомОстатки
	|ГДЕ
	|	РасчетыСПерсоналомОстатки.СуммаВалОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПерсоналомОстатки.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетыСПерсоналомОстатки.Сотрудник.Наименование";

	Если УчитыватьПредыдущиеПериоды Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"ПериодРегистрации = &ПериодРегистрации", "ПериодРегистрации <= &ПериодРегистрации");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
	Запрос.УстановитьПараметр("Организация", 		Константы.УчетПоКомпании.Компания(Организация));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ВалютаРасчетов",		ВалютаРасчетов);
	Запрос.УстановитьПараметр("ВалютаДокумента",	ВалютаДокумента);
	Запрос.УстановитьПараметр("Курс",				Курс);
	Запрос.УстановитьПараметр("Кратность",			Кратность);
	
	Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЗаполнитьНалогиНаДоходы(УчитыватьПредыдущиеПериоды);
	
КонецПроцедуры

// Процедура заполняет табличную часть Сотрудники по подразделению.
//
Процедура ЗаполнитьПоПодразделениюНаСервере() Экспорт
	
	// Сотрудники:
	// 1. Уволенные, переведенные из 
	//  - на начало периода есть запись о принадлежности к указанному подразделению;
	// 2. Работающие.
	//  - на начало периода есть запись о принадлежности к указанному подразделению;
	// 3. Принятые на работу, переведенные в
	//  - в течении периода будет запись с указанным подразделением;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"
	// Пункты 1 и 2
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Максимум(СотрудникиСрезПоследних.Период) КАК Период
	|	,СотрудникиСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ СотрудникиЧислящиесяНаНачалоПериода
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(&ПериодРегистрации, Организация = &Организация) КАК СотрудникиСрезПоследних
	|ГДЕ СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|СГРУППИРОВАТЬ ПО СотрудникиСрезПоследних.Сотрудник, СотрудникиСрезПоследних.СтруктурнаяЕдиница
	|
	// Пункт 3
	|;Выбрать РАЗРЕШЕННЫЕ
	|	Сотрудники.Период КАК Период
	|	,Сотрудники.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ СотрудникиПереведенныеПринятыеВПериоде
	|ИЗ РегистрСведений.Сотрудники КАК Сотрудники
	|ГДЕ Сотрудники.Организация = &Организация
	|	И Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сотрудники.Период МЕЖДУ &ПериодРегистрации И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|
	// Результирующая выборка
	|;Выбрать РАЗРЕШЕННЫЕ
	|	СотрудникиЧислящиесяНаНачалоПериода.Сотрудник
	|ИЗ СотрудникиЧислящиесяНаНачалоПериода КАК СотрудникиЧислящиесяНаНачалоПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 
	|	СотрудникиПереведенныеПринятыеВПериоде.Сотрудник
	|ИЗ СотрудникиПереведенныеПринятыеВПериоде КАК СотрудникиПереведенныеПринятыеВПериоде";

	Запрос.УстановитьПараметр("ПериодРегистрации",	ПериодРегистрации);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Организация",		Константы.УчетПоКомпании.Компания(Организация));
	
	Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("ДокументСсылка.НачислениеЗарплатыУНФ")] = "ЗаполнитьПоНачислениюЗарплаты";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДаннымиСобытияУНФ.ПропуститьДозаполнениеДокумента(ЭтотОбъект, РежимЗаписи) Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Сотрудники.Итог("СуммаПлатежа");
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик заполнения на основании документа НачислениеЗарплатыУНФ.
//
// Параметры:
//	ДанныеЗаполнения - ДокументСсылка.НачислениеЗарплатыУНФ
//	
Процедура ЗаполнитьПоНачислениюЗарплаты(ДанныеЗаполнения) Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	// Заполним данные из табличной части документа.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеЗарплатыУНФ.Организация КАК Организация,
	|	НачислениеЗарплатыУНФ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыУНФ.ВалютаДокумента КАК ВалютаДокумента,
	|	НачислениеЗарплатыУНФ.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ КАК НачислениеЗарплатыУНФ
	|ГДЕ
	|	НачислениеЗарплатыУНФ.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНалогиНаДоходы.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыНалогиНаДоходы.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	СУММА(НачислениеЗарплатыНалогиНаДоходы.Сумма) КАК Сумма,
	|	СУММА(НачислениеЗарплатыНалогиНаДоходы.СуммаСПревышения) КАК СуммаСПревышения,
	|	СУММА(НачислениеЗарплатыНалогиНаДоходы.СуммаСПревышенияПоСтавке18) КАК СуммаСПревышенияПоСтавке18,
	|	СУММА(НачислениеЗарплатыНалогиНаДоходы.СуммаСПревышенияПоСтавке20) КАК СуммаСПревышенияПоСтавке20,
	|	СУММА(НачислениеЗарплатыНалогиНаДоходы.СуммаСПревышенияПоСтавке22) КАК СуммаСПревышенияПоСтавке22
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ.НалогиНаДоходы КАК НачислениеЗарплатыНалогиНаДоходы
	|ГДЕ
	|	НачислениеЗарплатыНалогиНаДоходы.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.НалогНаДоходы)
	|	И НачислениеЗарплатыНалогиНаДоходы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	НачислениеЗарплатыНалогиНаДоходы.ВидНачисленияУдержания,
	|	НачислениеЗарплатыНалогиНаДоходы.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ -НачислениеЗарплатыНачисленияУдержания.Сумма
	|	КОНЕЦ КАК СуммаРасчетов,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ -НачислениеЗарплатыНачисленияУдержания.Сумма
	|	КОНЕЦ КАК СуммаПлатежа
	|ПОМЕСТИТЬ ВременнаяТаблицаСуммыНачисленийИУдержаний
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ.НачисленияУдержания КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыУНФНалогиНаДоходы.Сотрудник,
	|	-НачислениеЗарплатыУНФНалогиНаДоходы.Сумма - НачислениеЗарплатыУНФНалогиНаДоходы.СуммаСПревышения
	|		- НачислениеЗарплатыУНФНалогиНаДоходы.СуммаСПревышенияПоСтавке18
	|		- НачислениеЗарплатыУНФНалогиНаДоходы.СуммаСПревышенияПоСтавке20
	|		- НачислениеЗарплатыУНФНалогиНаДоходы.СуммаСПревышенияПоСтавке22,
	|	-НачислениеЗарплатыУНФНалогиНаДоходы.Сумма - НачислениеЗарплатыУНФНалогиНаДоходы.СуммаСПревышения
	|		- НачислениеЗарплатыУНФНалогиНаДоходы.СуммаСПревышенияПоСтавке18
	|		- НачислениеЗарплатыУНФНалогиНаДоходы.СуммаСПревышенияПоСтавке20
	|		- НачислениеЗарплатыУНФНалогиНаДоходы.СуммаСПревышенияПоСтавке22
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ.НалогиНаДоходы КАК НачислениеЗарплатыУНФНалогиНаДоходы
	|ГДЕ
	|	НачислениеЗарплатыУНФНалогиНаДоходы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыУНФПогашениеЗаймов.Сотрудник,
	|	-(НачислениеЗарплатыУНФПогашениеЗаймов.ПогашеноЗайма + НачислениеЗарплатыУНФПогашениеЗаймов.ПогашеноПроцентов),
	|	-(НачислениеЗарплатыУНФПогашениеЗаймов.ПогашеноЗайма + НачислениеЗарплатыУНФПогашениеЗаймов.ПогашеноПроцентов)
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ.ПогашениеЗаймов КАК НачислениеЗарплатыУНФПогашениеЗаймов
	|ГДЕ
	|	НачислениеЗарплатыУНФПогашениеЗаймов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСуммыНачисленийИУдержаний.Сотрудник КАК Сотрудник,
	|	СУММА(ВременнаяТаблицаСуммыНачисленийИУдержаний.СуммаРасчетов) КАК СуммаРасчетов,
	|	СУММА(ВременнаяТаблицаСуммыНачисленийИУдержаний.СуммаПлатежа) КАК СуммаПлатежа
	|ИЗ
	|	ВременнаяТаблицаСуммыНачисленийИУдержаний КАК ВременнаяТаблицаСуммыНачисленийИУдержаний
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаСуммыНачисленийИУдержаний.Сотрудник
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВременнаяТаблицаСуммыНачисленийИУдержаний.СуммаРасчетов) > 0";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	РезультатЗапросаШапка = МассивРезультатов[0];
	РезультатЗапросаНалогиНаДоходы = МассивРезультатов[1];
	РезультатЗапросаСотрудники = МассивРезультатов[3];
	Выборка = РезультатЗапросаШапка.Выбрать();
	
	Если НЕ РезультатЗапросаШапка.Пустой() Тогда
		
		// Заполним реквизиты шапки.
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
		// Заполним таблицу Сотрудники
		ВыборкаСотрудники = РезультатЗапросаСотрудники.Выбрать();
		Пока ВыборкаСотрудники.Следующий() Цикл
			НоваяСтрока = Сотрудники.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСотрудники);
		КонецЦикла;

		ВыборкаНалогиНаДоходы = РезультатЗапросаНалогиНаДоходы.Выбрать();
		Пока ВыборкаНалогиНаДоходы.Следующий() Цикл
			НоваяСтрока = НалогиНаДоходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНалогиНаДоходы);
		КонецЦикла;
		
	КонецЕсли;
	
	СуммаДокумента = Сотрудники.Итог("СуммаПлатежа");
	
КонецПроцедуры // ЗаполнитьПоНачислениюЗарплаты()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНалогиНаДоходы(УчитыватьПредыдущиеПериоды)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ВестиУчетНалогаНаДоходыИВзносов") Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники.ВыгрузитьКолонку("Сотрудник"));
	
	Если ПериодРегистрации >= РегламентированнаяОтчетностьУСН.ДатаОбязательногоПримененияЕНП() Тогда
		Запрос.Текст = ТекстЗапросаНДФЛПоРасчетамПлательщиков(УчитыватьПредыдущиеПериоды);
	Иначе
		Запрос.Текст = ТекстЗапросаНДФЛПоРасчетамАгентов(УчитыватьПредыдущиеПериоды);
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();

	Запрос.Текст = "ВЫБРАТЬ
	|	НалогиНаДоходы.Сотрудник КАК Сотрудник,
	|	НалогиНаДоходы.Сумма КАК Сумма,
	|	0 КАК СуммаСПревышения,
	|	0 КАК СуммаСПревышенияПоСтавке18,
	|	0 КАК СуммаСПревышенияПоСтавке20,
	|	0 КАК СуммаСПревышенияПоСтавке22
	|ПОМЕСТИТЬ ВТНалогиПоложительные
	|ИЗ
	|	ВТНалогиНаДоходыОстаток КАК НалогиНаДоходы
	|ГДЕ
	|	НалогиНаДоходы.Сумма > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалогиНаДоходы.Сотрудник КАК Сотрудник,
	|	0,
	|	НалогиНаДоходы.СуммаСПревышения,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	ВТНалогиНаДоходыОстаток КАК НалогиНаДоходы
	|ГДЕ
	|	НалогиНаДоходы.СуммаСПревышения > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалогиНаДоходы.Сотрудник КАК Сотрудник,
	|	0,
	|	0,
	|	НалогиНаДоходы.СуммаСПревышенияПоСтавке18,
	|	0,
	|	0
	|ИЗ
	|	ВТНалогиНаДоходыОстаток КАК НалогиНаДоходы
	|ГДЕ
	|	НалогиНаДоходы.СуммаСПревышенияПоСтавке18 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалогиНаДоходы.Сотрудник КАК Сотрудник,
	|	0,
	|	0,
	|	0,
	|	НалогиНаДоходы.СуммаСПревышенияПоСтавке20,
	|	0
	|ИЗ
	|	ВТНалогиНаДоходыОстаток КАК НалогиНаДоходы
	|ГДЕ
	|	НалогиНаДоходы.СуммаСПревышенияПоСтавке20 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалогиНаДоходы.Сотрудник КАК Сотрудник,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НалогиНаДоходы.СуммаСПревышенияПоСтавке22
	|ИЗ
	|	ВТНалогиНаДоходыОстаток КАК НалогиНаДоходы
	|ГДЕ
	|	НалогиНаДоходы.СуммаСПревышенияПоСтавке22 > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалогиНаДоходы.Сотрудник КАК Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.НалогНаДоходы) КАК ВидНачисленияУдержания,
	|	СУММА(НалогиНаДоходы.Сумма) КАК Сумма,
	|	СУММА(НалогиНаДоходы.СуммаСПревышения) КАК СуммаСПревышения,
	|	СУММА(НалогиНаДоходы.СуммаСПревышенияПоСтавке18) КАК СуммаСПревышенияПоСтавке18,
	|	СУММА(НалогиНаДоходы.СуммаСПревышенияПоСтавке20) КАК СуммаСПревышенияПоСтавке20,
	|	СУММА(НалогиНаДоходы.СуммаСПревышенияПоСтавке22) КАК СуммаСПревышенияПоСтавке22
	|ИЗ
	|	ВТНалогиПоложительные КАК НалогиНаДоходы
	|СГРУППИРОВАТЬ ПО
	|	НалогиНаДоходы.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	НалогиНаДоходы.Сотрудник
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	НалогиНаДоходы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Функция ТекстЗапросаНДФЛПоРасчетамАгентов(УчитыватьПредыдущиеПериоды)
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НДФЛРасчетыНалоговыхАгентов.Сотрудник КАК Сотрудник,
	|	НДФЛРасчетыНалоговыхАгентов.СуммаОстаток КАК Сумма,
	|	НДФЛРасчетыНалоговыхАгентов.СуммаСПревышенияОстаток КАК СуммаСПревышения,
	|	НДФЛРасчетыНалоговыхАгентов.СуммаСПревышенияПоСтавке18Остаток КАК СуммаСПревышенияПоСтавке18,
	|	НДФЛРасчетыНалоговыхАгентов.СуммаСПревышенияПоСтавке20Остаток КАК СуммаСПревышенияПоСтавке20,
	|	НДФЛРасчетыНалоговыхАгентов.СуммаСПревышенияПоСтавке22Остаток КАК СуммаСПревышенияПоСтавке22
	|ПОМЕСТИТЬ ВТНалогиНаДоходыОстаток
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Остатки(
	|			,
	|			Организация = &Организация
	|				И ПериодРегистрации = &ПериодРегистрации
	|				И Сотрудник В (&Сотрудники)) КАК НДФЛРасчетыНалоговыхАгентов";
	
	Если УчитыватьПредыдущиеПериоды Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"ПериодРегистрации = &ПериодРегистрации", "ПериодРегистрации <= &ПериодРегистрации");
	КонецЕсли;

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаНДФЛПоРасчетамПлательщиков(УчитыватьПредыдущиеПериоды)

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(Сотрудники.Ссылка) КАК Сотрудник,
	|	Сотрудники.ФизЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ФизическиеЛица
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В (&Сотрудники)
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлатежнаяВедомость.Ссылка КАК Ведомость,
	|	ПлатежнаяВедомостьНалогиНаДоходы.Сотрудник КАК Сотрудник,
	|	ПлатежнаяВедомостьНалогиНаДоходы.Сумма КАК Сумма,
	|	ПлатежнаяВедомостьНалогиНаДоходы.СуммаСПревышения КАК СуммаСПревышения,
	|	ПлатежнаяВедомостьНалогиНаДоходы.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	ПлатежнаяВедомостьНалогиНаДоходы.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	ПлатежнаяВедомостьНалогиНаДоходы.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22
	|ПОМЕСТИТЬ НалогиВедомостей
	|ИЗ
	|	Документ.ПлатежнаяВедомость.НалогиНаДоходы КАК ПлатежнаяВедомостьНалогиНаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость КАК ПлатежнаяВедомость
	|		ПО ПлатежнаяВедомостьНалогиНаДоходы.Ссылка = ПлатежнаяВедомость.Ссылка
	|		И ПлатежнаяВедомость.ПериодРегистрации = &ПериодРегистрации
	|		И
	|			ПлатежнаяВедомостьНалогиНаДоходы.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.НалогНаДоходы)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФизическиеЛица КАК ФизическиеЛица
	|		ПО ПлатежнаяВедомостьНалогиНаДоходы.Сотрудник = ФизическиеЛица.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалогиВедомостей.Сотрудник КАК Сотрудник,
	|	НалогиВедомостей.Сумма КАК Сумма,
	|	НалогиВедомостей.СуммаСПревышения КАК СуммаСПревышения,
	|	НалогиВедомостей.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	НалогиВедомостей.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	НалогиВедомостей.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22,
	|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка КАК ДенежныйДокумент
	|ПОМЕСТИТЬ ВыплатыПоВедомостям
	|ИЗ
	|	НалогиВедомостей КАК НалогиВедомостей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК РасходСоСчетаВыплатаЗаработнойПлаты
	|		ПО НалогиВедомостей.Ведомость = РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалогиВедомостей.Сотрудник КАК Сотрудник,
	|	НалогиВедомостей.Сумма КАК Сумма,
	|	НалогиВедомостей.СуммаСПревышения КАК СуммаСПревышения,
	|	НалогиВедомостей.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	НалогиВедомостей.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	НалогиВедомостей.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22,
	|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка КАК Ссылка
	|ИЗ
	|	НалогиВедомостей КАК НалогиВедомостей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК РасходИзКассыВыплатаЗаработнойПлаты
	|		ПО НалогиВедомостей.Ведомость = РасходИзКассыВыплатаЗаработнойПлаты.Ведомость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыНалогоплательщиков.Регистратор КАК Регистратор,
	|	РасчетыНалогоплательщиков.ВидДвижения КАК ВидДвижения,
	|	ФизическиеЛица.Сотрудник КАК Сотрудник,
	|	РасчетыНалогоплательщиков.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалогоплательщиков.Сумма КАК Сумма,
	|	РасчетыНалогоплательщиков.СуммаСПревышения КАК СуммаСПревышения,
	|	РасчетыНалогоплательщиков.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	РасчетыНалогоплательщиков.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	РасчетыНалогоплательщиков.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22
	|ПОМЕСТИТЬ ВТРасчетыНалогоплательщиков
	|ИЗ
	|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ КАК РасчетыНалогоплательщиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФизическиеЛица КАК ФизическиеЛица
	|		ПО Организация = &Организация
	|		И РасчетыНалогоплательщиков.ФизическоеЛицо = ФизическиеЛица.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалогоплательщиков.Сотрудник КАК Сотрудник,
	|	РасчетыНалогоплательщиков.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалогоплательщиков.Сумма КАК Сумма,
	|	РасчетыНалогоплательщиков.СуммаСПревышения КАК СуммаСПревышения,
	|	РасчетыНалогоплательщиков.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	РасчетыНалогоплательщиков.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	РасчетыНалогоплательщиков.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22
	|ПОМЕСТИТЬ РасчетыПериодаРегистрации
	|ИЗ
	|	ВТРасчетыНалогоплательщиков КАК РасчетыНалогоплательщиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплатыУНФ КАК НачислениеЗарплатыУНФ
	|		ПО РасчетыНалогоплательщиков.Регистратор = НачислениеЗарплатыУНФ.Ссылка
	|		И НачислениеЗарплатыУНФ.ПериодРегистрации = &ПериодРегистрации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыНалогоплательщиков.Сотрудник,
	|	РасчетыНалогоплательщиков.ФизическоеЛицо,
	|	-ВыплатыПоВедомостям.Сумма,
	|	-ВыплатыПоВедомостям.СуммаСПревышения,
	|	-ВыплатыПоВедомостям.СуммаСПревышенияПоСтавке18,
	|	-ВыплатыПоВедомостям.СуммаСПревышенияПоСтавке20,
	|	-ВыплатыПоВедомостям.СуммаСПревышенияПоСтавке22
	|ИЗ
	|	ВТРасчетыНалогоплательщиков КАК РасчетыНалогоплательщиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыплатыПоВедомостям КАК ВыплатыПоВедомостям
	|		ПО РасчетыНалогоплательщиков.Сотрудник = ВыплатыПоВедомостям.Сотрудник
	|		И РасчетыНалогоплательщиков.Регистратор = ВыплатыПоВедомостям.ДенежныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПериодаРегистрации.Сотрудник КАК Сотрудник,
	|	СУММА(РасчетыПериодаРегистрации.Сумма) КАК Сумма,
	|	СУММА(РасчетыПериодаРегистрации.СуммаСПревышения) КАК СуммаСПревышения,
	|	СУММА(РасчетыПериодаРегистрации.СуммаСПревышенияПоСтавке18) КАК СуммаСПревышенияПоСтавке18,
	|	СУММА(РасчетыПериодаРегистрации.СуммаСПревышенияПоСтавке20) КАК СуммаСПревышенияПоСтавке20,
	|	СУММА(РасчетыПериодаРегистрации.СуммаСПревышенияПоСтавке22) КАК СуммаСПревышенияПоСтавке22
	|ПОМЕСТИТЬ ВТНалогиНаДоходыОстаток
	|ИЗ
	|	РасчетыПериодаРегистрации КАК РасчетыПериодаРегистрации
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПериодаРегистрации.Сотрудник";

	Если УчитыватьПредыдущиеПериоды Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"ПериодРегистрации = &ПериодРегистрации", "ПериодРегистрации <= &ПериодРегистрации");
	КонецЕсли;

	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли