
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет исходные данные для программного формирования элементов плиточного интерфейса формы подбора
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ПлиточныйИнтерфейсВыбораТоваров
//
Процедура ЗаполнитьОпорныеДанныеПанелиПлиточногоИнтерфейса(Форма) Экспорт
	
	Форма.ОпорныеДанные.Очистить();
	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	ТаблицаИерархическогоСоставаПалитры = СформироватьСоставПалитрыСУчетомВложенныхПалитр(Форма);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
	|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
	|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
	|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры,
	|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
	|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
	|	ПалитраТоваровРМКСостав.КартинкаПоУмолчанию КАК КартинкаПоУмолчанию
	|ПОМЕСТИТЬ ПалитраТоваровРМКСостав
	|ИЗ
	|	&ТаблицаСоставаПалитры КАК ПалитраТоваровРМКСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтрокиМодификатора,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|ПОМЕСТИТЬ ВТГрупповыеМодификаторы
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|			ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|			ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|		ИЗ
	|			ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ГДЕ
	|			ПалитраТоваровРМКСостав.НомерКатегорииРазмещения > 0
	|			И НЕ ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)) КАК ВложенныйЗапрос
	|		ПО ПалитраТоваровРМКСостав.НомерКатегорииРазмещения = ВложенныйЗапрос.НомерКатегорииРазмещения
	|			И ПалитраТоваровРМКСостав.ИсточникПалитры = ВложенныйЗапрос.ИсточникПалитры И НЕ ПалитраТоваровРМКСостав.ЭтоКатегория
	|ГДЕ
	|	ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|ПОМЕСТИТЬ СтруктураПалитрыБезМодификаторов
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрупповыеМодификаторы КАК ВТГрупповыеМодификаторы
	|		ПО ПалитраТоваровРМКСостав.НомерСтроки = ВТГрупповыеМодификаторы.НомерСтрокиМодификатора
	|			И ПалитраТоваровРМКСостав.ИсточникПалитры = ВТГрупповыеМодификаторы.ИсточникПалитры
	|ГДЕ
	|	ВТГрупповыеМодификаторы.НомерСтрокиМодификатора ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегории КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ЛОЖЬ КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|ПОМЕСТИТЬ СтруктураПалитрыМодификаторов
	|ИЗ
	|	СтруктураПалитрыБезМодификаторов КАК СтруктураПалитрыБезМодификаторов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрупповыеМодификаторы КАК ВТГрупповыеМодификаторы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|			ПО ВТГрупповыеМодификаторы.НомерСтрокиМодификатора = ПалитраТоваровРМКСостав.НомерСтроки
	|				И ВТГрупповыеМодификаторы.ИсточникПалитры = ПалитраТоваровРМКСостав.ИсточникПалитры
	|		ПО СтруктураПалитрыБезМодификаторов.НомерКатегории = ВТГрупповыеМодификаторы.НомерКатегории
	|			И СтруктураПалитрыБезМодификаторов.НомерКатегорииРазмещения = ВТГрупповыеМодификаторы.НомерКатегорииРазмещения
	|			И СтруктураПалитрыБезМодификаторов.ИндексПозиции = ВТГрупповыеМодификаторы.ИндексПозиции
	|			И СтруктураПалитрыБезМодификаторов.ИсточникПалитры = ВТГрупповыеМодификаторы.ИсточникПалитры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	0 КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегорииРазмещенияЭлемента,
	|	1 КАК ИндексПозицииВКатегории,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ИСТИНА КАК ЭтоТекущаяКатегория,
	|	1 КАК ПорядокВидов,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПлитки
	|ПОМЕСТИТЬ ИтоговаяСтруктура
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|ГДЕ
	|	ПалитраТоваровРМКСостав.НомерКатегории > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураПалитрыМодификаторов.НомерСтроки,
	|	СтруктураПалитрыМодификаторов.НомерКатегории,
	|	СтруктураПалитрыМодификаторов.НомерКатегорииРазмещения,
	|	СтруктураПалитрыМодификаторов.ИндексПозиции,
	|	СтруктураПалитрыМодификаторов.ЭтоКатегория,
	|	СтруктураПалитрыМодификаторов.ИмеетсяВложенность,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СтруктураПалитрыБезМодификаторов.ИндексПозиции > СтруктураПалитрыМодификаторов.ИндексПозиции
	|			ТОГДА 2
	|		ИНАЧЕ 4
	|	КОНЕЦ,
	|	СтруктураПалитрыМодификаторов.ИсточникПалитры
	|ИЗ
	|	СтруктураПалитрыМодификаторов КАК СтруктураПалитрыМодификаторов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтруктураПалитрыБезМодификаторов КАК СтруктураПалитрыБезМодификаторов
	|		ПО СтруктураПалитрыМодификаторов.НомерКатегорииРазмещения = СтруктураПалитрыБезМодификаторов.НомерКатегории
	|			И СтруктураПалитрыМодификаторов.ИсточникПалитры = СтруктураПалитрыБезМодификаторов.ИсточникПалитры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураПалитрыБезМодификаторов.НомерСтроки,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегории,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегорииРазмещения,
	|	СтруктураПалитрыБезМодификаторов.ИндексПозиции,
	|	СтруктураПалитрыБезМодификаторов.ЭтоКатегория,
	|	СтруктураПалитрыБезМодификаторов.ИмеетсяВложенность,
	|	ЛОЖЬ,
	|	3,
	|	СтруктураПалитрыБезМодификаторов.ИсточникПалитры
	|ИЗ
	|	СтруктураПалитрыБезМодификаторов КАК СтруктураПалитрыБезМодификаторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяСтруктура.ИсточникПлитки КАК ИсточникПлитки,
	|	ИтоговаяСтруктура.НомерСтроки КАК НомерСтроки,
	|	ИтоговаяСтруктура.НомерКатегорииРазмещенияЭлемента КАК НомерКатегорииРазмещенияЭлемента,
	|	ИтоговаяСтруктура.ПорядокВидов КАК ПорядокВидов,
	|	ИтоговаяСтруктура.ИндексПозицииВКатегории КАК ИндексПозицииВКатегории,
	|	ИтоговаяСтруктура.НомерКатегории КАК НомерКатегории,
	|	ИтоговаяСтруктура.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ИтоговаяСтруктура.ЭтоКатегория КАК ЭтоКатегория,
	|	ИтоговаяСтруктура.ЭтоТекущаяКатегория КАК ЭтоТекущаяКатегория,
	|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
	|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
	|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
	|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
	|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
	|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
	|	ПалитраТоваровРМКСостав.КартинкаПоУмолчанию КАК КартинкаПоУмолчанию,
	|	Ложь КАК ЭтоПодарок
	|ИЗ
	|	ИтоговаяСтруктура КАК ИтоговаяСтруктура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ПО ИтоговаяСтруктура.НомерСтроки = ПалитраТоваровРМКСостав.НомерСтроки
	|			И ИтоговаяСтруктура.ИсточникПлитки = ПалитраТоваровРМКСостав.ИсточникПалитры
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсточникПлитки,
	|	НомерКатегорииРазмещенияЭлемента,
	|	ПорядокВидов,
	|	ИндексПозицииВКатегории");
	
	ПалитраПлитки = Неопределено;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтруктураПлиточногоИнтерфейсаПодбора") Тогда
		ПалитраПлитки = Форма.СтруктураПлиточногоИнтерфейсаПодбора;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтруктураПлиточногоИнтерфейса") Тогда
		ПалитраПлитки = Форма.СтруктураПлиточногоИнтерфейса;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаСоставаПалитры", ТаблицаИерархическогоСоставаПалитры);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьОпорныеДанныеСтрокамиПалитры(Форма, Выборка, ПалитраПлитки);
	
КонецПроцедуры

// Заполняет исходные данные для программного формирования элементов плиточного интерфейса формы подбора
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ПлиточныйИнтерфейсВыбораТоваров
//  ТоварыДляУстройств - Таблица значений с колонками:
//		*Номенклатура - ОпределяемыйТип.НоменклатураРМК,
//		*Характеристика - ОпределяемыйТип.ХарактеристикаРМК,
//		*Весовой - Булево,
//		*SKU - Число.
//
Процедура ЗаполнитьОпорныеДанныеПлиточногоИнтерфейсаДляУстройствРаспознавания(Форма, ТоварыДляУстройств) Экспорт
	
	ЦветФонаКнопки = ?(ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85(), Новый Цвет(), ЦветаСтиля.ЦветФонаФормы);
	Форма.ОпорныеДанные.Очистить();
	ПалитраПлитки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ТекущаяНастройкаРМК,
		"СтруктураПлиточногоИнтерфейсаПодбора");
	Если ЗначениеЗаполнено(ПалитраПлитки) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаТоваровДляУстройствИзПалитры();
		Запрос.УстановитьПараметр("ТоварыУстройств", ТоварыДляУстройств);
		Запрос.УстановитьПараметр("ПалитраТоваров", ПалитраПлитки);
		ЦветФонаСтрокой = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПалитраПлитки, "ЦветФонаКнопки");
		Если Не СокрЛП(ЦветФонаСтрокой) = "" Тогда
			ЦветФонаКнопки = ОбщегоНазначения.ЗначениеИзСтрокиXML(ЦветФонаСтрокой);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		ЗаполнитьОпорныеДанныеСтрокамиПалитры(Форма, Выборка, ПалитраПлитки);
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("МаксимальныйНомерКатегории", 0);
		ДополнительныеПараметры.Вставить("МаксимальныйИндексПозицииВНулевойКатегории", 0);
		ТаблицаТоваровПалитры = ПолучитьТаблицуТоваровОпорныхДанных(Форма.ОпорныеДанные, ДополнительныеПараметры);
		Если ТаблицаТоваровПалитры.Количество() = 0 Тогда
			ДобавитьВОпорныеДанныеТоварыНеИзПалитры(Форма, ТоварыДляУстройств, Ложь, ЦветФонаКнопки);
		Иначе
			ТоварыНеИзПалитры = ВыделитьНеПопавшиеВПалитруТовары(ТоварыДляУстройств, ТаблицаТоваровПалитры);
			Если ТоварыНеИзПалитры.Количество() > 0 Тогда
				ДобавитьВОпорныеДанныеТоварыНеИзПалитры(Форма, ТоварыНеИзПалитры, Истина, ЦветФонаКнопки, ДополнительныеПараметры);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		НастроитьКоличествоЭлементовПлитки(Форма);
		ДобавитьВОпорныеДанныеТоварыНеИзПалитры(Форма, ТоварыДляУстройств, Ложь, ЦветФонаКнопки);
	КонецЕсли;
	ДобавитьСлужебныеГруппыВесовогоТовараВОпорныеДанные(Форма);
	
КонецПроцедуры

Процедура ЗаполнитьИерархиюПалитрыТоваров(ИерархияТоваров, ИсходныеДанные) Экспорт
	
	ЦветаФормы = ОбщегоНазначенияРМК.ЦветаФормыРМК();
	
	ЭлементыДерева = ИерархияТоваров.ПолучитьЭлементы();
	
	Корень = ЭлементыДерева.Добавить();
	Корень.ИмяЭлемента = НСтр("ru = 'Первый уровень'", ОбщегоНазначения.КодОсновногоЯзыка());
	Корень.ЭтоКатегория = Истина;
	Корень.НомерИзображения = 0;
	
	НумерацияКатегорий = Новый Соответствие;
	НумерацияКатегорий.Вставить(0, Корень);
	
	Если ЗначениеЗаполнено(ИсходныеДанные) Тогда

		ТекстЗапросаПостроенияДерева = 
		"ВЫБРАТЬ
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Ссылка КАК Ссылка,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.НомерСтроки КАК НомерСтроки,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Номенклатура КАК Номенклатура,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Характеристика КАК Характеристика,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ЗаголовокЭлемента КАК ЗаголовокЭлемента,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.НомерКатегории КАК НомерКатегории,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ИндексПозиции КАК ИндексПозиции,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Шрифт КАК Шрифт,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ЦветШрифта КАК ЦветШрифта,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ЦветФона КАК ЦветФона,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ИмяЭлемента КАК Наименование,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ХарактеристикиИспользуются КАК ХарактеристикиИспользуются,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.КатегорияРазмещения КАК КатегорияРазмещения,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ВидМодификатора КАК ВидМодификатора,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Упаковка КАК Упаковка,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Палитра КАК Палитра,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ПустаяОбласть КАК ПустаяОбласть,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.КартинкаПоУмолчанию КАК КартинкаПоУмолчанию
		|ПОМЕСТИТЬ ПалитраТоваровРМКСостав
		|ИЗ
		|	Справочник.ПалитраТоваровРМК.Состав КАК СтруктураПлиточногоИнтерфейсаПодбораРМКСостав
		|ГДЕ
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения
		|ПОМЕСТИТЬ ВТНомераКатегорийРазмещения
		|ИЗ
		|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
		|ГДЕ
		|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
		|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
		|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции
		|ПОМЕСТИТЬ ВТГрупповыеМодификаторы
		|ИЗ
		|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения
		|		ИЗ
		|			ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
		|		ГДЕ
		|			ПалитраТоваровРМКСостав.НомерКатегорииРазмещения > 0
		|			И НЕ ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)) КАК ВложенныйЗапрос
		|		ПО ПалитраТоваровРМКСостав.НомерКатегорииРазмещения = ВложенныйЗапрос.НомерКатегорииРазмещения
		|ГДЕ
		|	ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПалитраТоваровРМКСостав.Ссылка КАК Ссылка,
		|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
		|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
		|	ВТНомераКатегорийРазмещения.НомерКатегорииРазмещения ЕСТЬ НЕ NULL 
		|		ИЛИ ВТГрупповыеМодификаторы.НомерКатегорииРазмещения ЕСТЬ НЕ NULL  КАК ИмеетсяВложенность,
		|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
		|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
		|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
		|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
		|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
		|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
		|	ПалитраТоваровРМКСостав.ЗаголовокЭлемента КАК ЗаголовокЭлемента,
		|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
		|	ПалитраТоваровРМКСостав.ХарактеристикиИспользуются КАК ХарактеристикиИспользуются,
		|	ПалитраТоваровРМКСостав.Шрифт КАК Шрифт,
		|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
		|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
		|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
		|	ВЫБОР
		|		КОГДА ПалитраТоваровРМКСостав.ЭтоКатегория
		|			ТОГДА 1
		|		КОГДА ПалитраТоваровРМКСостав.ПустаяОбласть
		|			ТОГДА 9
		|		КОГДА НЕ ПалитраТоваровРМКСостав.Палитра = ЗНАЧЕНИЕ(Справочник.ПалитраТоваровРМК.ПустаяСсылка)
		|			ТОГДА 5
		|		КОГДА ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ВключатьВЧек)
		|			ТОГДА 3
		|		КОГДА ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.НеВключатьВЧек)
		|			ТОГДА 4
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК НомерИзображения,
		|	ПалитраТоваровРМКСостав.КатегорияРазмещения КАК КатегорияРазмещения,
		|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
		|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
		|	ПалитраТоваровРМКСостав.Палитра КАК Палитра,
		|	ПалитраТоваровРМКСостав.ПустаяОбласть КАК ПустаяОбласть,
		|	ПалитраТоваровРМКСостав.КартинкаПоУмолчанию КАК КартинкаПоУмолчанию
		|ИЗ
		|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНомераКатегорийРазмещения КАК ВТНомераКатегорийРазмещения
		|		ПО ПалитраТоваровРМКСостав.НомерКатегории = ВТНомераКатегорийРазмещения.НомерКатегорииРазмещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрупповыеМодификаторы КАК ВТГрупповыеМодификаторы
		|		ПО ПалитраТоваровРМКСостав.НомерКатегорииРазмещения = ВТГрупповыеМодификаторы.НомерКатегорииРазмещения
		|			И ПалитраТоваровРМКСостав.ИндексПозиции = ВТГрупповыеМодификаторы.ИндексПозиции
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерКатегорииРазмещения,
		|	КатегорияРазмещения,
		|	ИндексПозиции
		|ИТОГИ ПО
		|	НомерКатегорииРазмещения";
		
		Запрос = Новый Запрос(ТекстЗапросаПостроенияДерева);
		Запрос.УстановитьПараметр("Ссылка", ИсходныеДанные);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
		
			ВыборкаПоКатегории = Выборка.Выбрать();
			РодительскийЭлемент = НумерацияКатегорий.Получить(Выборка.НомерКатегорииРазмещения).ПолучитьЭлементы();
			
			Пока ВыборкаПоКатегории.Следующий() Цикл
				
				НовыйЭлемент = РодительскийЭлемент.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, ВыборкаПоКатегории);
				
				Если НовыйЭлемент.ЭтоКатегория ИЛИ НовыйЭлемент.ИмеетсяВложенность Тогда
					НумерацияКатегорий.Вставить(НовыйЭлемент.НомерКатегории, НовыйЭлемент);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИсходныеДанные.ШрифтЭлементовПодбора) Тогда
					НовыйЭлемент.Шрифт = ОбщегоНазначения.ЗначениеВСтрокуXML(ИсходныеДанные.ШрифтЭлементовПодбора);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаПоКатегории.ЦветШрифта) Тогда
					НовыйЭлемент.ЦветШрифта = ОбщегоНазначения.ЗначениеИзСтрокиXML(ВыборкаПоКатегории.ЦветШрифта);
				КонецЕсли;

				Если ЗначениеЗаполнено(ВыборкаПоКатегории.ЦветФона) Тогда
					НовыйЭлемент.ЦветФона = ОбщегоНазначения.ЗначениеИзСтрокиXML(ВыборкаПоКатегории.ЦветФона);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСоставПалитрыИзбранногоПоДаннымДерева(СоставПалитры, ИерархияТоваров, ЗаполнятьНомерСтроки = Ложь) Экспорт
	
	НомерСтроки = Неопределено;
	Если ЗаполнятьНомерСтроки Тогда
		НомерСтроки = 0;
	КонецЕсли;
	
	Дерево = ДанныеФормыВЗначение(ИерархияТоваров, Тип("ДеревоЗначений"));
	Дерево.Строки.Сортировать("ИндексПозиции", Истина);
	СоставПалитры.Очистить();
	ИндексКорневогоЭлемента = 0;
	ЭлементыДерева = Дерево.Строки;
	КорневойЭлемент = ЭлементыДерева[ИндексКорневогоЭлемента];
	Ветви = КорневойЭлемент.Строки;
	ЗаполнитьСоставПалитрыИзбранногоПоДаннымДереваВУзле(СоставПалитры, Ветви, ИндексКорневогоЭлемента, НомерСтроки);
	
КонецПроцедуры

Процедура НастроитьПервоначальныйИнтерфейсРежимаКассыСамообслуживания(Форма, НастройкиЭлементов) Экспорт
	
	ВысотаКоманд = 2;
	
	ЭлементыФормы = Форма.Элементы;
	КомандыФормы = Форма.Команды;
	ЭлементыФормы.РассчитатьСкидки.Видимость = Форма.РаботаВРежимеМедленногоСоединения;
	КомандыФормы.РассчитатьСкидки.Отображение = ОтображениеКнопки.Текст;
	КомандыФормы.РассчитатьСкидки.Картинка = Новый Картинка();
	ЗаголовокНоваяПокупка = НСтр("ru='Новая покупка'");
	КомандыФормы.ПродолжитьПослеПробитияЧека.Заголовок = ЗаголовокНоваяПокупка;
	
	ЭлементыФормы.РассчитатьСкидки.Заголовок = НСтр("ru='Рассчитать скидки'");
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьВысотуЭлементаПриОтсутствииПерсональнойНастройки(НастройкиЭлементов,
		ЭлементыФормы.РассчитатьСкидки, ВысотаКоманд);
	
	ЭлементыФормы.ГруппаQRCode.Видимость = Ложь;
		
	ПараметрыПлиточногоИнтерфейса = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыПлиточногоИнтерфейса();
	
	Если Не (Форма.ИспользоватьАртикул Или Форма.ИспользоватьКод) Тогда
		ЭлементыФормы.ТоварыПредставлениеНоменклатураХарактеристика.АвтоВысотаЯчейки = Истина;
	КонецЕсли;
	СброситьПодсказкиЭлементовВРежимеКСО(ЭлементыФормы);
	КомандыФормы.ГорячаяКлавишаESC.Подсказка = "";
	ЗаголовокДекорации = НСтр("ru='Начните покупку просканировав'")
		+ Символы.ПС + НСтр("ru='товар или выбрав из каталога'");
	ЭлементыФормы.ДекорацияТекстПустойСтраницы.Заголовок = Новый ФорматированнаяСтрока(ЗаголовокДекорации);
	ЭлементыФормы.КаталогИзПустойСтраницы.Видимость = Ложь;
	ЭлементыФормы.ГруппаКомандПродолженияПослеПробития.Высота = 3;
		
	Если ЗначениеЗаполнено(Форма.АдресРекламнойЗаставки) Тогда
		Если Форма.ОсновнойПодборПлиточный Тогда
			ЭлементыФормы.ДекорацияПустойЧекПродажа.Видимость = Ложь;
			ЭлементыФормы.РекламнаяЗаставкаПлитка.Видимость = Истина;
		Иначе
			ЭлементыФормы.ДекорацияПустойЧекПродажаКСО.Видимость = Ложь;
			ЭлементыФормы.РекламнаяЗаставка.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
		
	СформироватьПанельОперацийКСО(Форма, НастройкиЭлементов);
	СформироватьПанельУправленияТекущимТоваромКСО(Форма, НастройкиЭлементов);
	ЭлементыФормы.ГруппаКнопокЛояльности.Видимость = Ложь;
	ЭлементыФормы.СтраницаБаннер.Видимость = Ложь;
	СформироватьКнопкуЛояльностиКСО(Форма, НастройкиЭлементов);
	Если Форма.ЗначениеСкидкиПенсионерам <> 0 Тогда
		СформироватьКнопкуСкидкаПенсионераКСО(Форма, НастройкиЭлементов);
	КонецЕсли;
	ИнтерфейсРМКСлужебныйКлиентСервер.НастроитьВидГлавнойКнопкиПереходаКОплате(Форма, НастройкиЭлементов);
	
КонецПроцедуры

Процедура СформироватьКнопкуЛояльностиКСОВОкнеОплаты(Форма, НастройкиВводаПокупателей) Экспорт
	
	ДобавитьКнопкуЛояльностиКСО(Форма, НастройкиВводаПокупателей, 1);
	
КонецПроцедуры

Процедура СформироватьУникальнуюКнопкуОплатыНаФорме(Форма, УникальныйВидОплаты, ПараметрыПостроения) Экспорт
	
	ОчиститьЭлементыКнопокУникальнойОплаты(Форма);
	Если Не УникальныйВидОплаты = "" Тогда
		ДобавитьУникальнуюКнопкуОплатыНаФорме(Форма, УникальныйВидОплаты, ПараметрыПостроения);
	КонецЕсли;
	
КонецПроцедуры

Функция ШаблонДанныхКнопкиОплатыКСО() Экспорт
	
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("Имя", "");
	ДанныеКнопки.Вставить("Высота", 5);
	ДанныеКнопки.Вставить("Ширина", 0);
	ДанныеКнопки.Вставить("Картинка", Неопределено);
	ДанныеКнопки.Вставить("Заголовок", "");
	ДанныеКнопки.Вставить("ЦветФона", Новый Цвет());
	
	Возврат ДанныеКнопки;
	
КонецФункции

Процедура ДобавитьКнопкуОплатыКСО(Форма, ГруппаКонтейнер, ДанныеКнопки) Экспорт
	
	СуффиксИмени = "КСО";
	ДобавитьКнопкуОплаты(Форма, ГруппаКонтейнер, ДанныеКнопки, СуффиксИмени);
	
КонецПроцедуры

Процедура УвеличитьРазмерКоманд(Форма, НастройкиЭлементов) Экспорт
	Перем ПараметрыРазмеров;
	
	ПараметрыУвеличенногоИнтерфейса = ПараметрыУвеличенногоИнтерфейса(Форма.ВидОтображения);
	ПараметрыРазмеров = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыРазмеровИнтерфейса();
	Высота = ПараметрыУвеличенногоИнтерфейса.ВысотаКоманды;
	Ширина = ПараметрыУвеличенногоИнтерфейса.ШиринаКоманды;
	Шрифт = ПараметрыУвеличенногоИнтерфейса.Шрифт;
	
	Элементы = Форма.Элементы;
	
	СвойствоШирина = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок;
	СвойствоВысота = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
	Для Каждого ЭлементФормы Из Элементы Цикл
		Если ИгнорироватьЭлементДляУвеличенияРазмера(Форма.РежимКассыСамообслуживания, Элементы, ЭлементФормы) Тогда
			Продолжить;
		КонецЕсли;
		ШиринаИзНастроек = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗначениеСвойстваИзНастроек(ЭлементФормы.Имя,
			НастройкиЭлементов, СвойствоШирина);
		ВысотаИзНастроек = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗначениеСвойстваИзНастроек(ЭлементФормы.Имя,
			НастройкиЭлементов, СвойствоВысота);
		Если (ЭлементФормы.Высота = 0 Или ЭлементФормы.Высота = 1) И Не ЗначениеЗаполнено(ВысотаИзНастроек) Тогда
			ЭлементФормы.Высота = Высота;
		КонецЕсли;
		Если (ЗначениеЗаполнено(ЭлементФормы.Ширина) И ЭлементФормы.Ширина < 4)
				И Не ЗначениеЗаполнено(ШиринаИзНастроек) Тогда
			ЭлементФормы.Ширина = Ширина;
		КонецЕсли;
	КонецЦикла;
	
	КлючПараметрыПолей = "ПараметрыПолей";
	ПараметрыПолей = НастройкиЭлементов.Получить(КлючПараметрыПолей);
	
	УвеличитьРазмерПолейОплат(Элементы.ПанельВидовОплат, ПараметрыУвеличенногоИнтерфейса, ПараметрыПолей);
	
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьШиринуЭлементаПриОтсутствииПерсональнойНастройки(НастройкиЭлементов,
		Элементы.СкидкаНаЧекПроцентом, Ширина);
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьШиринуЭлементаПриОтсутствииПерсональнойНастройки(НастройкиЭлементов,
		Элементы.СкидкаНаЧекСуммой, Ширина);
		
	Если ПараметрыПолей.ШиринаПолей.Получить(Элементы.ТекущийТоварЦенаИзКарточки.Имя) = Неопределено Тогда
		Элементы.ТекущийТоварЦенаИзКарточки.Ширина = ПараметрыУвеличенногоИнтерфейса.ШиринаПоля;
	КонецЕсли;
	
	Если Форма.РежимКассыСамообслуживания Тогда
		ПараметрыРазмеров = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыРазмеровКомандУправленияЧекомДляКСО();
	Иначе
		ПараметрыРазмеров = ПараметрыРазмеровКомандУправленияЧекомДляОбычногоРежима(ПараметрыУвеличенногоИнтерфейса);
	КонецЕсли;
	ПараметрыИнтерфейсаПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыПлиточногоИнтерфейса();
	ИнтерфейсРМКСлужебныйКлиентСервер.НастроитьРазмерКомандУправленияСоставомЧека(Форма, ПараметрыРазмеров,
		НастройкиЭлементов, Истина);
	УстановитьУвеличенныйШрифтПолей(Элементы, ПараметрыУвеличенногоИнтерфейса, ПараметрыПолей);
	
	СтандартныеРазмеры = Новый Структура("Высота,Ширина", 0, 0);
	СтандартныеРазмеры.Высота = ПараметрыРазмеров.ВысотаКомандыОперации;
	СтандартныеРазмеры.Ширина = ?(Форма.РежимКассыСамообслуживания, ПараметрыИнтерфейсаПлитки.ШиринаКомандыСНадписью,
		ПараметрыРазмеров.ШиринаКомандыОперации);
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьФормуИРазмерыЭлементаСУчетомНастроек(Элементы.УдалитьЧек,
		Форма, СтандартныеРазмеры, НастройкиЭлементов);
		
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьШиринуЭлементаПриОтсутствииПерсональнойНастройки(НастройкиЭлементов,
		Элементы.ПерейтиНаНачальнуюСтраницу, ПараметрыИнтерфейсаПлитки.ШиринаКоманды);
	
	ОбщегоНазначенияРМКПереопределяемый.УвеличитьРазмерКоманд(Форма, ПараметрыУвеличенногоИнтерфейса);
	
КонецПроцедуры

// Устанавливает условное оформление формы
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения.
//
Процедура УстановитьУсловноеОформление(Форма) Экспорт

	Если Форма.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК" Тогда
		УстановитьУсловноеОформлениеФормыРМК(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Подготавливает панель наличных купюр формы РМК
//
// Параметры:
//  Форма - форма клиентского приложения ФормаРМК
//  ИспользоватьПанельВводаНаличныхКупюр - Булево
//  ВертикальнаяОриентация - Булево. Признак настройки использования экрана в вертикальной ориентации.
//
Процедура ПодготовитьПанельВводаНаличныхКупюр(Форма, ИспользоватьПанельВводаНаличныхКупюр,
		РежимКлавиатуры = Ложь) Экспорт
	Перем ГруппаРядКупюр;
	
	Если РежимКлавиатуры Тогда
		КоличествоКупюрВРяде = 3;
	Иначе
		КоличествоКупюрВРяде = 4;
	КонецЕсли;
	Если ИспользоватьПанельВводаНаличныхКупюр Тогда
	
		ЦветаНоминалов = СоответствиеНоминаловЦветам();

		МассивДанныхКупюр = Новый Массив;
		Элементы = Форма.Элементы;
		
		ЗапросНоминалов = Новый Запрос;
		ЗапросНоминалов.Текст =
		"ВЫБРАТЬ
		|	СправочникНастройкиРМК.ВводНаличныхАкселераторAlt КАК Alt,
		|	СправочникНастройкиРМК.ВводНаличныхАкселераторCtrl КАК Ctrl,
		|	СправочникНастройкиРМК.ВводНаличныхАкселераторShift КАК Shift
		|ИЗ
		|	Справочник.НастройкиРабочегоМестаКассира КАК СправочникНастройкиРМК
		|ГДЕ
		|	СправочникНастройкиРМК.Ссылка = &НастройкаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиРабочегоМестаКассираВводНаличных.Номинал КАК Номинал,
		|	НастройкиРабочегоМестаКассираВводНаличных.Клавиша КАК Клавиша
		|ИЗ
		|	Справочник.НастройкиРабочегоМестаКассира.ВводНаличных КАК НастройкиРабочегоМестаКассираВводНаличных
		|ГДЕ
		|	НастройкиРабочегоМестаКассираВводНаличных.Ссылка = &НастройкаСсылка
		|	И НастройкиРабочегоМестаКассираВводНаличных.Использование";
		ЗапросНоминалов.УстановитьПараметр("НастройкаСсылка", Форма.ТекущаяНастройкаРМК);
		РезультатыЗапросов = ЗапросНоминалов.ВыполнитьПакет();
		ВыборкаАкселераторов = РезультатыЗапросов[0].Выбрать();
		АкселераторыКупюр = Новый Структура("Alt,Ctrl,Shift", Ложь, Ложь, Ложь);
		Если ВыборкаАкселераторов.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(АкселераторыКупюр, ВыборкаАкселераторов);
		КонецЕсли;
		ВыборкаНоминалов = РезультатыЗапросов[1].Выбрать();
		Пока ВыборкаНоминалов.Следующий() Цикл
			
			СочетаниеКлавишКупюры = ПодготовитьСочетаниеГорячейКлавиши(АкселераторыКупюр, ВыборкаНоминалов.Клавиша);
			ДанныеКупюры = Новый Структура("НоминалКупюры, ЦветФона, ГорячаяКлавиша",
			ВыборкаНоминалов.Номинал, ЦветаНоминалов.Получить(ВыборкаНоминалов.Номинал), СочетаниеКлавишКупюры);
			МассивДанныхКупюр.Добавить(ДанныеКупюры);
			
		КонецЦикла;
		
		Если РежимКлавиатуры Тогда
			ЦветСлужебнойКнопки = ?(ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85(),
				ЦветаПалитры.Красный, ЦветаСтиля.ЦветКнопкиОтказатьсяРМК);
			ДанныеКупюры = Новый Структура("НоминалКупюры, ЦветФона, ГорячаяКлавиша",
				"0", ЦветСлужебнойКнопки);
			МассивДанныхКупюр.Добавить(ДанныеКупюры);
		КонецЕсли;
		
		КоличествоКупюр = МассивДанныхКупюр.Количество();
		Если КоличествоКупюр > 0 Тогда
			Форма.ИспользоватьПанельВводаНаличных = Истина;

			ИндексКупюры = 0;
			Пока ИндексКупюры < КоличествоКупюр Цикл
				
				ДанныеКупюры = МассивДанныхКупюр.Получить(ИндексКупюры);
				
				ПоложениеКупюры = (ИндексКупюры+1) / КоличествоКупюрВРяде;
				РасчетныйРядКупюры = ?(ПоложениеКупюры = Цел(ПоложениеКупюры), ПоложениеКупюры, Цел(ПоложениеКупюры+1));
				РядКупюры = ?(КоличествоКупюр > КоличествоКупюрВРяде, РасчетныйРядКупюры, КоличествоКупюр);
				ГруппаКупюрРяд = Элементы.Найти("ГруппаКупюрРяд" + РядКупюры);
				Если ГруппаКупюрРяд = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				ДобавитьКупюруНаПанельВводаНаличных(Элементы, Форма.Команды, ГруппаКупюрРяд, ДанныеКупюры, РежимКлавиатуры);
				ИндексКупюры = ИндексКупюры + 1;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Подготавливает панель управления чеком формы РМК
//
// Параметры:
//  Форма - форма клиентского приложения ФормаРМК
//  ВертикальнаяОриентация - Булево. Признак настройки использования экрана в вертикальной ориентации.
//
Процедура НастроитьПанельУправленияЧеком(Форма, ВертикальнаяОриентация) Экспорт
	
	ПараметрыЭлементовПанели = ПолучитьПараметрыЭлементовПанелиУправленияЧеком(Форма);
	
	Для Каждого ДанныеЭлемента Из ПараметрыЭлементовПанели Цикл
		МодифицироватьЭлементФормы(Форма.Элементы, ДанныеЭлемента, ВертикальнаяОриентация);
	КонецЦикла;
	
	Форма.Элементы.ГруппаУправленияЧекомВер.Видимость = ВертикальнаяОриентация;
	Форма.Элементы.ГруппаУправленияЧекомГор.Видимость = (Не ВертикальнаяОриентация);

КонецПроцедуры

// Добавляет элемент отбора на равенство в отбор компоновки данных
//
// Параметры:
//  ЭлементВладелецОтбора - родительский элемент (отбор, группа отбора), которому добавляется элемент отбора.
//  ПутьКДаннымЭлемента - Строка - путь к элементу данных, значение которого сравнивается.
//  ЗначениеСравнения - любое значение, с которым сравнивается значение элемента.
//
Процедура ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(ЭлементВладелецОтбора, ПутьКДаннымЭлемента, ЗначениеСравнения) Экспорт
	
	ЭлементОтбора = ЭлементВладелецОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДаннымЭлемента);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ЗначениеСравнения;
	
КонецПроцедуры

Функция ПараметрыУвеличенногоИнтерфейса(ВидОтображения) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ВысотаКоманды", 2);
	Параметры.Вставить("ШиринаКоманды", 4);
	Параметры.Вставить("ШиринаПоля", 10);
	Параметры.Вставить("ШиринаПанелиВидовОплат", 26);
	
	ШрифтСуммыОплат = Новый Шрифт(ШрифтыСтиля.ШрифтОбычныйПолужирныйРМК,,,,,,, 145);
	
	ШрифтПоляВвода = Неопределено;
	Если ВидОтображения = Перечисления.ВидыОтображения.Уменьшенный Тогда
		ШрифтПоляВвода = ШрифтыСтиля.ШрифтПоляВводаРМК18;
	ИначеЕсли ВидОтображения = Перечисления.ВидыОтображения.Стандартный Тогда
		ШрифтПоляВвода = ШрифтыСтиля.ШрифтПоляВводаРМК17;
	Иначе
		ШрифтПоляВвода = ШрифтыСтиля.ШрифтПоляВводаРМК;
	КонецЕсли;
	Параметры.Вставить("Шрифт", ШрифтПоляВвода);
	Параметры.Вставить("ШрифтКнопкиВидаОплаты", ШрифтыСтиля.ШрифтОбычныйПолужирныйРМК);
	Параметры.Вставить("ШрифтСуммОплат", ШрифтСуммыОплат);
	
	Возврат Параметры;
	
КонецФункции

Процедура СформироватьЭлементыПанелиИзбранныхПозиций(Форма, ГорячиеКлавиши) Экспорт
	
	Элементы = Форма.Элементы;
	
	ДанныеКнопок = Форма.ДанныеКнопок;
	ОсновнаяГруппаЭлементов = Элементы.ГруппаРядовКнопокБыстрыхТоваров;
	
	ДанныеКнопок.Очистить();
	КоличествоКарточек = ИнтерфейсРМКСлужебныйКлиентСервер.КоличествоКарточекИзбранногоНаСтранице();
	Для ПорядковыйНомер = 1 По КоличествоКарточек Цикл
		СтрокаКнопка = ДанныеКнопок.Добавить();
	КонецЦикла;
	
	ОтображатьОстаток = Ложь;
	СкрыватьЦенуИзбранных = Ложь;
	ИмяКомандыНажатия = "Подключаемый_ИзбранноеВыбор";
	ИмяКомандыГорячейКлавиши = "Подключаемый_ИзбранноеКоманда";
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОтображатьОстаток") Тогда
		ОтображатьОстаток = Форма.ОтображатьОстаток;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СкрыватьЦенуИзбранных") Тогда
		СкрыватьЦенуИзбранных = Форма.СкрыватьЦенуИзбранных;
	КонецЕсли;
	
	БазовыйШрифт = ПолучитьШрифтИзбранногоПоУмолчанию(Форма);
	
	ПараметрыПостроения = Новый Структура();
	ПараметрыПостроения.Вставить("ИмяКомандыНажатия", ИмяКомандыНажатия);
	ПараметрыПостроения.Вставить("ИмяКомандыГорячейКлавиши", ИмяКомандыГорячейКлавиши);
	ПараметрыПостроения.Вставить("ОтображатьОстаток", ОтображатьОстаток);
	ПараметрыПостроения.Вставить("СкрыватьЦену", СкрыватьЦенуИзбранных);
	ПараметрыПостроения.Вставить("ЦветФона", ЦветаСтиля.ЦветФонаФормы);
	ПараметрыПостроения.Вставить("БазовыйШрифт", БазовыйШрифт);
	
	ДобавитьРядКнопок(Форма, ОсновнаяГруппаЭлементов, 1, ПараметрыПостроения, ГорячиеКлавиши);
	ВторойРяд = ДобавитьРядКнопок(Форма, ОсновнаяГруппаЭлементов, 2, ПараметрыПостроения, ГорячиеКлавиши);
	Если Не Форма.ЕстьГруппыИзбранногоБолее4 Тогда
		ВторойРяд.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеИерархииБыстрыхТоваров(Форма) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	Элементы = Форма.Элементы;
	
	НомераКартинок = Новый СписокЗначений;
	НомераКартинок.Добавить(0);
	НомераКартинок.Добавить(5);
	НомераКартинок.Добавить(9);
	
	// Только просмотр для корня и палитры
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеДереваТоваров = Элемент.Поля.Элементы.Добавить();
	ПолеДереваТоваров.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваров.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение =
		Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровНомерИзображения.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = НомераКартинок;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Не отображать шрифт, цвет шрифта и цвет фона для корня и палитры
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеШрифт = Элемент.Поля.Элементы.Добавить();
	ПолеШрифт.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровШрифт.Имя);
	
	ПолеЦвет = Элемент.Поля.Элементы.Добавить();
	ПолеЦвет.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровЦветШрифта.Имя);
	
	ПолеФон = Элемент.Поля.Элементы.Добавить();
	ПолеФон.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровЦветФона.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение =
		Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровНомерИзображения.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = НомераКартинок;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	
	// Только просмотр для категорий
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеНоменклатуры = Элемент.Поля.Элементы.Добавить();
	ПолеНоменклатуры.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровНоменклатура.Имя);
	
	ПолеХарактеристики = Элемент.Поля.Элементы.Добавить();
	ПолеХарактеристики.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровХарактеристика.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровЭтоКатегория.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Контроль заполнения характеристик
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровХарактеристика.Имя);
	
	ОтборПоИспользованиюХарактеристик = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоИспользованиюХарактеристик.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровХарактеристикиИспользуются.ПутьКДанным);
	ОтборПоИспользованиюХарактеристик.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоИспользованиюХарактеристик.ПравоеЗначение = Ложь;
	
	ОтборПоПринадлежностиКатегории = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПринадлежностиКатегории.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровЭтоКатегория.ПутьКДанным);
	ОтборПоПринадлежностиКатегории.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоПринадлежностиКатегории.ПравоеЗначение = Ложь;
	
	ОтборПоПринадлежностиКатегории = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПринадлежностиКатегории.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровНомерИзображения.ПутьКДанным);
	ОтборПоПринадлежностиКатегории.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборПоПринадлежностиКатегории.ПравоеЗначение = 5;
	
	ОтборПоПринадлежностиКатегории = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПринадлежностиКатегории.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровПустаяОбласть.ПутьКДанным);
	ОтборПоПринадлежностиКатегории.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоПринадлежностиКатегории.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
	// Незаполненное изображение
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровИзображениеЭлемента.Имя);
	
	ОтборПоПустомуФайлуИзображения = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПустомуФайлуИзображения.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровИзображениеЭлемента.ПутьКДанным);
	ОтборПоПустомуФайлуИзображения.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЗначениеСтрокой = "Справочник.ПалитраТоваровРМКПрисоединенныеФайлы.ПустаяСсылка";
	ОтборПоПустомуФайлуИзображения.ПравоеЗначение = ОбщегоНазначения.ПредопределенныйЭлемент(ЗначениеСтрокой);
	
	ОтборПоПринадлежностиКатегории = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПринадлежностиКатегории.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровНомерИзображения.ПутьКДанным);
	ОтборПоПринадлежностиКатегории.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборПоПринадлежностиКатегории.ПравоеЗначение = НомераКартинок;
	
	ОтборПоПризнакуКартинкиПоУмолчанию = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПризнакуКартинкиПоУмолчанию.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровКартинкаПоУмолчанию.ПутьКДанным);
	ОтборПоПризнакуКартинкиПоУмолчанию.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоПризнакуКартинкиПоУмолчанию.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Добавить изображение>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
	// Картинка по умолчанию
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровИзображениеЭлемента.Имя);
	
	ОтборПоПризнакуКартинкиПоУмолчанию = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПризнакуКартинкиПоУмолчанию.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровКартинкаПоУмолчанию.ПутьКДанным);
	ОтборПоПризнакуКартинкиПоУмолчанию.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоПризнакуКартинкиПоУмолчанию.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Картинка по умолчанию>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
КонецПроцедуры

Процедура ОбновитьСписокТоваров(Форма) Экспорт
	
	СтандартнаяОбработка = Истина;
	ОбщегоНазначенияРМКПереопределяемый.ОбновитьДинамическийСписокТоваров(Форма, СтандартнаяОбработка);
	Если СтандартнаяОбработка Тогда
		
		ПараметрыСписка = Форма.СписокТоваров.Параметры;
		Если Не ПараметрыСписка.Элементы.Найти("Дата") = Неопределено Тогда
			ПараметрыСписка.УстановитьЗначениеПараметра("Дата", ТекущаяДатаСеанса());
		КонецЕсли;
		
	КонецЕсли;
	Форма.Элементы.СписокТоваров.Обновить();
	Форма.Элементы.ДополнительныйСписокТоваров.Обновить();
	
КонецПроцедуры

Процедура СформироватьЭлементыПлиток(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	ОдинарнаяРамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная);
	ДанныеКнопокПлиток = Форма.ДанныеКнопокПлиток;
	ОсновнаяГруппаЭлементов = Элементы.ПлиточныйИнтерфейс;
	КоличествоКнопокВРяду = Форма.КоличествоЭлементовВРяду;
	КоличествоРядов = Форма.КоличествоРядовНаСтранице;
	БазовыйШрифт = ПолучитьШрифтПлиткиПоУмолчанию(Форма);
	
	ИмяЭлемента = "ДекорацияПутьПлиточногоИнтерфейса";
	ДекорацияПуть = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ОсновнаяГруппаЭлементов);
	ДекорацияПуть.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияПуть.Заголовок = "";
	ДекорацияПуть.Рамка = ОдинарнаяРамка;
	ДекорацияПуть.Высота = 1;
	ДекорацияПуть.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
	ДекорацияПуть.РастягиватьПоГоризонтали = Истина;
	ДекорацияПуть.АвтоМаксимальнаяШирина = Ложь;
	ДекорацияПуть.Шрифт = ШрифтыСтиля.ЗаголовокВторогоУровня;
	
	ИмяКомандыНажатия = "Подключаемый_ПлиткаВыбор";
	ОтображатьОстаток = Ложь;
	СкрыватьЦену = Ложь;
	ШрифтЦены = Новый Шрифт(БазовыйШрифт, , , Ложь);
	ЦветФона = ЦветаСтиля.ЦветФонаФормы;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОтображатьОстаток") Тогда
		ОтображатьОстаток = Форма.ОтображатьОстаток;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "НастройкиРМК") Тогда
		ОтображатьОстаток = Форма.НастройкиРМК.ОтображатьОстаток;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СкрыватьЦену") Тогда
		СкрыватьЦену = Форма.СкрыватьЦену;
	КонецЕсли;
	
	ПараметрыПостроения = Новый Структура();
	ПараметрыПостроения.Вставить("ИмяКомандыНажатия", ИмяКомандыНажатия);
	ПараметрыПостроения.Вставить("ОтображатьОстаток", ОтображатьОстаток);
	ПараметрыПостроения.Вставить("СкрыватьЦену", СкрыватьЦену);
	ПараметрыПостроения.Вставить("ШрифтЦены", ШрифтЦены);
	ПараметрыПостроения.Вставить("ЦветФона", ЦветФона);
	ПараметрыПостроения.Вставить("БазовыйШрифт", БазовыйШрифт);
	
	ИндексКнопки = 0;
	Для ИндексРяда = 1 По КоличествоРядов Цикл
		
		РядКнопок = ДобавитьРядКнопокПлиток(ОсновнаяГруппаЭлементов, ИндексРяда, Элементы);
		
		Для СчетчикКнопок = 1 По КоличествоКнопокВРяду Цикл
			ДобавитьКнопкуВРядПлитокКарточек(РядКнопок, ИндексКнопки, Форма, ПараметрыПостроения);
			СтрокаКнопка = ДанныеКнопокПлиток.Добавить();
			ИндексКнопки = ИндексКнопки + 1;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьПараметрыКартыЛояльности(ОписаниеКарты) Экспорт
	
	ПараметрыКарты = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыКартыЛояльности();
	НомерКарты = ?(ЗначениеЗаполнено(ОписаниеКарты.Barcode), ОписаниеКарты.Barcode, ОписаниеКарты.MagneticCode);
	
	ПараметрыКарты.ИдентификаторКарты = ОписаниеКарты.CardGUID;
	ПараметрыКарты.КодКарты = НомерКарты;
	ПараметрыКарты.ФИО = ОписаниеКарты.ClientName;
	ПараметрыКарты.НомерТелефонаВладельцаКарты = ОписаниеКарты.Phone;
	ПараметрыКарты.АдресЭПВладельцаКарты = ОписаниеКарты.Email;
	ПараметрыКарты.ДатаРождения = XMLЗначение(Тип("Дата"), ОписаниеКарты.DateOfBirth);
	ПараметрыКарты.ЭтоКомпания = Не ОписаниеКарты.IsPerson;
	ПараметрыКарты.ЭтоБонуснаяКарта = ЗначениеЗаполнено(ОписаниеКарты.BonusData.BonusGUID);
	
	Если ОписаниеКарты.Свойство("SellCount") Тогда
		ПараметрыКарты.СуммаПродаж = Формат(ОписаниеКарты.SellCount,"ЧДЦ=2");
	КонецЕсли;
	
	Возврат ПараметрыКарты;
	
КонецФункции

// Включает или выключает отображение кнопки выбора у полей ввода, в зависимости от значения переменной
// Форма.СкрытьЦифровуюКлавиатуру на форме РМК
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма РМК
//
Процедура НастроитьИспользованиеКнопокВыбораПолей(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	УвеличитьШирину = Ложь;
	ПредыдущееЗначение = Элементы.ТекущийТоварКоличество.КнопкаВыбора;
	ПоказатьКнопкуВыбора = (Не (Форма.СкрытьЦифровуюКлавиатуру Или Форма.РежимКассыСамообслуживания));
	Если ПредыдущееЗначение И Не ПоказатьКнопкуВыбора Тогда
		УвеличитьШирину = Истина;
	КонецЕсли;
	
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "ТекущийТоварЦенаИзКарточки", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "ТекущийТоварКоличество", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "ТекущийТоварКоличествоСобрано", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоНал", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоБН", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоЮКасса", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоСБП", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоПредоплата", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоВРассрочку", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоЗачетАванса", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоКредитом", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаНаличныхКВыдаче", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоБонусами", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "ТекущийТоварСкидка", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "ЗначениеСкидкиНаЧек", ПоказатьКнопкуВыбора, УвеличитьШирину);
	
КонецПроцедуры

Процедура НастроитьЭлементыФормыРМКПриСозданииНаСервере(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	МаскаПоляВводаТелефона = ИнтерфейсРМКСлужебныйКлиентСервер.МаскаВводаТелефона();
	Элементы.ОтправкаЧекаТелефон.Маска = МаскаПоляВводаТелефона;
	
	ФорматКорзиныПлиточногоИнтерфейса = Форма.ФорматКорзиныПлиточногоИнтерфейса;
	Элементы.ТоварыМиниСписокКоличество.Видимость = ФорматКорзиныПлиточногоИнтерфейса = 0;
	Если ФорматКорзиныПлиточногоИнтерфейса = 1 Или ФорматКорзиныПлиточногоИнтерфейса = 2 Тогда
		Элементы.ТоварыМиниСписокТекстКоличествоСумма.Видимость = Истина;
		Элементы.ТоварыМиниСписокТекстКоличествоСумма.АвтоВысотаЯчейки = ФорматКорзиныПлиточногоИнтерфейса = 2;
	ИначеЕсли ФорматКорзиныПлиточногоИнтерфейса = 3 Или ФорматКорзиныПлиточногоИнтерфейса = 4 Тогда
		Элементы.ТоварыМиниСписокТекстКоличествоСуммаВнизу.Видимость = Истина;
	Иначе
		Элементы.ТоварыМиниСписокКоличество.Видимость = Истина;
	КонецЕсли;
	
	ЦветФонаКнопокУправляющих = ЦветУправляющейКнопки(Истина);
	
	Элементы.РассчитатьСкидки.ЦветФона = ЦветФонаКнопокУправляющих;
	Элементы.ОплатаКартойВТихомРежиме.ЦветФона = ЦветФонаКнопокУправляющих;
	Элементы.ОплатаНаличнымиВТихомРежиме.ЦветФона = ЦветГиперссылки(Истина);
	Элементы.ОплатаСБПВТихомРежиме.ЦветФона = ЦветВспомогательнойКнопки(Истина);
	Элементы.ПоказатьРассчитанныеСкидкиНаЧек.ЦветФона = ЦветГиперссылки(Истина);
	
	Если Не Форма.РежимКассыСамообслуживания Тогда
		Элементы.ГруппаВидОплатыНаличными.ЦветФона = ЦветГиперссылки(Истина);
		Элементы.ГруппаВидОплатыКартой.ЦветФона = ЦветФонаКнопокУправляющих;
		Элементы.ГруппаВидОплатыВыдачаНаличных.ЦветФона = ЦветФонаВспомогательныхВидовОплат();
		Элементы.ГруппаВидОплатыСБП.ЦветФона = ЦветВспомогательнойКнопки(Истина);
		Элементы.ГруппаВидОплатыЮКасса.ЦветФона = ЦветВидаОплатыЮКасса();
		Элементы.ГруппаВидОплатыНСПК.ЦветФона = ЦветФонаВспомогательныхВидовОплат();
		Элементы.ГруппаВидОплатыЗаменаТоваров.ЦветФона = ЦветФонаВспомогательныхВидовОплат();
		Элементы.ГруппаВидОплатыПредоплата.ЦветФона = ЦветФонаВспомогательныхВидовОплат();
		Элементы.ГруппаВидОплатыВРассрочку.ЦветФона = ЦветФонаВспомогательныхВидовОплат();
		Элементы.ГруппаВидОплатыЗачетАванса.ЦветФона = ЦветФонаВспомогательныхВидовОплат();
		Элементы.ГруппаВидОплатыБезнал.ЦветФона = ЦветФонаВспомогательныхВидовОплат();
		Элементы.ГруппаВидОплатыКредитом.ЦветФона = ЦветФонаВспомогательныхВидовОплат();
		Элементы.ГруппаВидОплатыСертификатом.ЦветФона = ЦветФонаВспомогательныхВидовОплат();
		Элементы.ГруппаВидОплатыБонусы.ЦветФона = ЦветФонаВспомогательныхВидовОплат();
		Если Не Форма.ЭтоИнтерфейс85 Тогда
			ПривестиКЕдинойШиринеКнопкиВидовОплат(Форма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеГорячихКлавиш(Форма) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	Элементы = Форма.Элементы;
	
	// Шрифт раздела горячих клавиш
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиДействие.Имя);
	
	ДобавитьОтборРазделаГорячихКлавиш(Элементы, Элемент);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
	
	// Только просмотр колонок сочетания клавиш
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиКлавиша.Имя);
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиАкселераторAlt.Имя);
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиАкселераторCtrl.Имя);
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиАкселераторShift.Имя);
	
	ДобавитьОтборРазделаГорячихКлавиш(Элементы, Элемент);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Цвет фона дублей горячих клавиш
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавиши.Имя);
	
	ДобавитьОтборНекорректныхКомбинацийГорячихКлавиш(Элемент, "Дубль");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ФонУправляющегоПоля);
	
	// Цвет фона запрещенных горячих клавиш
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавиши.Имя);
	
	ДобавитьОтборНекорректныхКомбинацийГорячихКлавиш(Элемент, "ЗапрещеннаяКомбинация");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ПравоСозданияФон);
	
	// Цвет фона дублей горячих клавиш купюр
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкиРМКВводНаличных.Имя);
	
	ДобавитьОтборНекорректныхКомбинацийГорячихКлавишКупюр(Элемент, "Дубль");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ФонУправляющегоПоля);
	
	// Цвет фона запрещенных горячих клавиш купюр
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкиРМКВводНаличных.Имя);
	
	ДобавитьОтборНекорректныхКомбинацийГорячихКлавишКупюр(Элемент, "ЗапрещеннаяКомбинация");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ПравоСозданияФон);
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеДереваОбластейФормыРМК(Форма) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	Элементы = Форма.Элементы;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваОбластей = Элемент.Поля.Элементы.Добавить();
	ПолеДереваОбластей.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОбластейФормыРМК.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоОбластейФормыРМК.ДоступностьГруппы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серебряный);
	
КонецПроцедуры

Функция ПолучитьУстройстваРаспознаванияЭлектронныхВесовДляПодключения(РабочееМесто) Экспорт
	
	УстройстваРаспознавания = Новый Массив;
	
	ЭлектронныеВесыРабочегоМеста
		= ОбщегоНазначенияРМК.ПолучитьПодключенноеОборудованиеПоТипу("ЭлектронныеВесы", РабочееМесто);
	УстройстваРаспознаванияРабочегоМеста
		= ОбщегоНазначенияРМК.ПолучитьПодключенноеОборудованиеПоТипу("УстройствоРаспознавания", РабочееМесто);
		
	ЗапросУстройств = Новый Запрос;
	ЗапросУстройств.Текст =
	"ВЫБРАТЬ
	|	КомплектацияПодключаемогоОборудования.ОсновноеОборудование КАК ЭлектронныеВесыСсылка,
	|	КомплектацияПодключаемогоОборудования.ДополнительноеОборудование КАК УстройствоРаспознаванияСсылка
	|ИЗ
	|	РегистрСведений.КомплектацияПодключаемогоОборудования КАК КомплектацияПодключаемогоОборудования
	|ГДЕ
	|	КомплектацияПодключаемогоОборудования.ОсновноеОборудование В(&ЭлектронныеВесы)
	|	И КомплектацияПодключаемогоОборудования.ДополнительноеОборудование В(&УстройстваРаспознавания)";
	ЗапросУстройств.УстановитьПараметр("ЭлектронныеВесы", ЭлектронныеВесыРабочегоМеста);
	ЗапросУстройств.УстановитьПараметр("УстройстваРаспознавания", УстройстваРаспознаванияРабочегоМеста);
	РезультатЗапроса = ЗапросУстройств.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаУстройств = РезультатЗапроса.Выбрать();
		Пока ВыборкаУстройств.Следующий() Цикл
			
			СтрокаКомплекта = Новый Структура();
			СтрокаКомплекта.Вставить("ЭлектронныеВесы", ВыборкаУстройств.ЭлектронныеВесыСсылка);
			СтрокаКомплекта.Вставить("УстройствоРаспознавания", ВыборкаУстройств.УстройствоРаспознаванияСсылка);
			СтрокаКомплекта.Вставить("ВесыОбработаны", Ложь);
			СтрокаКомплекта.Вставить("УстройствоРаспознаванияОбработано", Ложь);
			УстройстваРаспознавания.Добавить(СтрокаКомплекта);
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат УстройстваРаспознавания;
	
КонецФункции

Процедура НастроитьЭлементыВесовогоТовараВПлитке(Форма) Экспорт
	
	ПараметрыИнтерфейсаПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыПлиточногоИнтерфейса();
	Форма.ЕстьВесовойТоварВПлитке = ЕстьВесовойТоварВОпорныхДанных(Форма.ОпорныеДанные);
	Элементы = Форма.Элементы;
	СтандартнаяПлитка = ЗначениеЗаполнено(Форма.СтруктураПлиточногоИнтерфейсаПодбора);
	
	Если Форма.РежимКассыСамообслуживания Тогда
		Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(Элементы, "ГруппаКнопкиВесовойОтборКСО") Тогда
			Элементы.ГруппаКнопкиВесовойОтборКСО.Видимость = Форма.ЕстьВесовойТоварВПлитке;
		КонецЕсли;
		Если Форма.ВертикальнаяОриентация И ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(Элементы, "КнопкаПлиткаДомойКСО")
			 И ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(Элементы, "КнопкаПлиткаДомойВерхКСО") Тогда
			Элементы.КнопкаПлиткаДомойКСО.Видимость = Форма.ЕстьВесовойТоварВПлитке;
			Элементы.КнопкаПлиткаДомойВерхКСО.Видимость = Не Форма.ЕстьВесовойТоварВПлитке;
		КонецЕсли;
	Иначе
		Элементы.ОтборВесовогоТовара.Видимость = СтандартнаяПлитка И Форма.ЕстьВесовойТоварВПлитке;
	КонецЕсли;
	
	Элементы.Декорация1.Видимость = (Форма.РежимПлитки И СтандартнаяПлитка И Форма.ЕстьВесовойТоварВПлитке);
	
	Если Форма.ЕстьВесовойТоварВПлитке Тогда
		ДобавитьСлужебныеГруппыВесовогоТовараВОпорныеДанные(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьАнализИРегистрациюАварийногоЗавершенияЧеков(ПараметрыРМК) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтартовыеОперации = РегистрыСведений.ЖурналДействийКассира.ПолучитьОперацииДействийОткрытияЧека();
	ТекущийНомерСеанса = НомерСеансаИнформационнойБазы();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаНеЗавершенныхДействийСЧеком();
	Запрос.УстановитьПараметр("НачальныеОперацииСЧеком", СтартовыеОперации);
	
	НачатьТранзакцию();
	Попытка
		
		БлокировкаЖурналаДействий = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаЖурналаДействий.Добавить("РегистрСведений.ЖурналДействийКассира");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаЖурналаДействий.Заблокировать();
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			АктивныеСеансы = ПолучитьСеансыИнформационнойБазы();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				РегистрироватьАварийноеЗавершение = Ложь;
				Если Выборка.НомерСеанса = ТекущийНомерСеанса Тогда
					РегистрироватьАварийноеЗавершение = ПараметрыРМК.ЗапускПриСтарте;
				Иначе
					Активныйсеанс = НайтиАктивныйСеансПоНомеру(АктивныеСеансы, Выборка.НомерСеанса);
					Если Активныйсеанс = Неопределено Тогда
						РегистрироватьАварийноеЗавершение = Истина;
					КонецЕсли;
				КонецЕсли;
				Если РегистрироватьАварийноеЗавершение Тогда
					ЗарегистрироватьАварийноеЗавершениеЧека(Выборка);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось зарегистрировать аварийные завершения чеков.'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ЖурналДействийКассира, ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеЖурналаДействийКассира(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	УсловноеОформление = Форма.УсловноеОформление;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеСписок = Элемент.Поля.Элементы.Добавить();
	ПолеСписок.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ОперацияСЧеком");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ОперацииРабочегоМестаКассира.АварийноеЗавершениеЧека;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
КонецПроцедуры

Функция ПолучитьПервоначальноеРасположениеОбластейФормыРМК(ГруппаФормыРМК, ПараметрыЗаполнения) Экспорт
	
	МассивТиповЦвет = Новый Массив;
	МассивТиповЦвет.Добавить(Тип("Цвет"));
	ТипЧислоРазмер = ОбщегоНазначения.ОписаниеТипаЧисло(3, 0, ДопустимыйЗнак.Неотрицательный);
	
	МассивТиповГруппировка = Новый Массив;
	МассивТиповГруппировка.Добавить(Тип("ГруппировкаПодчиненныхЭлементовФормы"));
	
	ДеревоПорядкаОбластей = Новый ДеревоЗначений;
	ДеревоПорядкаОбластей.Колонки.Добавить("ИмяОбласти", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДеревоПорядкаОбластей.Колонки.Добавить("ЗаголовокОбласти", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДеревоПорядкаОбластей.Колонки.Добавить("Группировка", ОбщегоНазначения.ОписаниеТипаСтрока(15));
	ДеревоПорядкаОбластей.Колонки.Добавить("Ширина", ТипЧислоРазмер);
	ДеревоПорядкаОбластей.Колонки.Добавить("Высота", ТипЧислоРазмер);
	ДеревоПорядкаОбластей.Колонки.Добавить("ЦветОбласти", Новый ОписаниеТипов(МассивТиповЦвет));
	ДеревоПорядкаОбластей.Колонки.Добавить("ДоступностьГруппы", Новый ОписаниеТипов("Булево"));
	
	ЗаполнитьПервоначальныйПорядокОбластейФормыРМК(ГруппаФормыРМК, ДеревоПорядкаОбластей, ПараметрыЗаполнения);
	
	Возврат ДеревоПорядкаОбластей;
	
КонецФункции

Процедура ПрименитьНастройкуПорядкаОбластей(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	ЗапросПорядка = Новый Запрос;
	ЗапросПорядка.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираПорядокОбластей.ОбластьРодитель КАК ОбластьРодитель,
	|	НастройкиРабочегоМестаКассираПорядокОбластей.Область КАК Область,
	|	НастройкиРабочегоМестаКассираПорядокОбластей.Порядок КАК Порядок
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.ПорядокОбластей КАК НастройкиРабочегоМестаКассираПорядокОбластей
	|ГДЕ
	|	НастройкиРабочегоМестаКассираПорядокОбластей.ВертикальнаяОриентация = &ВертикальнаяОриентация
	|	И НастройкиРабочегоМестаКассираПорядокОбластей.Ссылка = &ТекущаяНастройка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбластьРодитель,
	|	Порядок";
	ЗапросПорядка.УстановитьПараметр("ВертикальнаяОриентация", Форма.ВертикальнаяОриентация);
	ЗапросПорядка.УстановитьПараметр("ТекущаяНастройка", Форма.ТекущаяНастройкаРМК);
	
	СуффиксВертикальная = "_Вертикальная";
	СуффиксГоризонтальная = "_Горизонтальная";
	ТекущийСуффикс = ?(Форма.ВертикальнаяОриентация, СуффиксВертикальная, СуффиксГоризонтальная);

	ТаблицаПорядка = ЗапросПорядка.Выполнить().Выгрузить();
	Для Каждого СтрокаПорядка Из ТаблицаПорядка Цикл
		
		ПозицияСуффикса = СтрНайти(СтрокаПорядка.Область, ТекущийСуффикс);
		Если ПозицияСуффикса > 0 Тогда
			ИмяГруппы = Лев(СтрокаПорядка.Область, ПозицияСуффикса - 1);
			ГруппаЭлемент = Элементы.Найти(ИмяГруппы);
			КоллекцияЭлементов = ГруппаЭлемент.Родитель.ПодчиненныеЭлементы;
			ИндексЭлемента = КоллекцияЭлементов.Индекс(ГруппаЭлемент);
			Если СтрокаПорядка.Порядок <> ИндексЭлемента + 1 Тогда
				ЭлементДляСмещения = КоллекцияЭлементов.Получить(СтрокаПорядка.Порядок - 1);
				Элементы.Переместить(ГруппаЭлемент, ГруппаЭлемент.Родитель, ЭлементДляСмещения);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	ПрименитьИсключенияОбработкиПорядкаОбластей(Форма, ТаблицаПорядка);
	
КонецПроцедуры

// Получает массив вложенных палитр в переданных палитрах по всей глубине иерархии
//
// Параметры:
//  КорневыеПалитры - Массив из СправочникСсылка.ПалитраТоваровРМК
//
// Возвращаемое значение - Массив из СправочникСсылка.ПалитраТоваровРМК
//
Функция ПолучитьВложенныеПалитры(КорневыеПалитры) Экспорт
	
	РезультатФункции = Новый Массив;
	
	СхемаВложенныхПалитр = Справочники.ПалитраТоваровРМК.ПолучитьМакет("МакетВложенныхПалитр");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаВложенныхПалитр.НастройкиПоУмолчанию);

	ПараметрМассивПалитр = Новый ПараметрКомпоновкиДанных("МассивПалитр");
	МассивПалитр = Новый СписокЗначений;
	МассивПалитр.ЗагрузитьЗначения(КорневыеПалитры);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрМассивПалитр, МассивПалитр);
	ТекущиеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	ТипГенератораДляКоллекции = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаВложенныхПалитр, ТекущиеНастройки, , , ТипГенератораДляКоллекции);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаВложенныхПалитр = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаВложенныхПалитр);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Для каждого СтрокаТаблицы Из ТаблицаВложенныхПалитр Цикл
		
		Если КорневыеПалитры.Найти(СтрокаТаблицы.ВложеннаяПалитра) = Неопределено
				И РезультатФункции.Найти(СтрокаТаблицы.ВложеннаяПалитра) = Неопределено Тогда
				
			РезультатФункции.Добавить(СтрокаТаблицы.ВложеннаяПалитра);
				
		КонецЕсли;
		
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

// Получает массив палитр, начиная с текущей и всех палитр - владельцев
//
// Параметры:
//  ИсходнаяПалитра - СправочникСсылка.ПалитраТоваровРМК,
//  ИсключитьИсходнуюПалитру - Булево - в возвращаемом массиве будет исключена исходная палитра
//
// Возвращаемое значение - Массив из СправочникСсылка.ПалитраТоваровРМК
//
Функция ПолучитьИерархиюРодителейПалитры(ИсходнаяПалитра, ИсключитьИсходнуюПалитру = Ложь) Экспорт
	
	РезультатФункции = Новый Массив;
	
	СхемаРодительскихПалитр = Справочники.ПалитраТоваровРМК.ПолучитьМакет("МакетРодительскихПалитр");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаРодительскихПалитр.НастройкиПоУмолчанию);

	ПараметрИсходнаяПалитра = Новый ПараметрКомпоновкиДанных("ИсходнаяПалитра");
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрИсходнаяПалитра, ИсходнаяПалитра);
	ТекущиеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	ТипГенератораДляКоллекции = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	МакетКомпоновки
		= КомпоновщикМакета.Выполнить(СхемаРодительскихПалитр, ТекущиеНастройки, , , ТипГенератораДляКоллекции);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаРодительскихПалитр = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРодительскихПалитр);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	РезультатФункции = ТаблицаРодительскихПалитр.ВыгрузитьКолонку("ПалитраВладелец");
	Если Не ИсключитьИсходнуюПалитру Тогда
		РезультатФункции.Вставить(0, ИсходнаяПалитра);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура НастроитьКоличествоЭлементовПлитки(Форма) Экспорт
	
	ВертикальнаяОриентация = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВертикальнаяОриентация") тогда
		ВертикальнаяОриентация = Форма.ВертикальнаяОриентация;
	КонецЕсли;
	РазмерыПлиткиПоУмолчанию = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьРазмерыПлиткиПоУмолчанию(ВертикальнаяОриентация);
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("КоличествоЭлементовВРяду", РазмерыПлиткиПоУмолчанию.КоличествоЭлементовВРяду);
	СтруктураРеквизитовФормы.Вставить("КоличествоРядовНаСтранице", РазмерыПлиткиПоУмолчанию.КоличествоРядовНаСтранице);
	ЗаполнитьЗначенияСвойств(Форма, СтруктураРеквизитовФормы);
	
КонецПроцедуры

Функция ПодготовитьДанныеКонтроляПродаж(НаборТаблиц) Экспорт
	
	ДанныеКонтроляПродаж = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонКэшаКонтроляПродаж();
	ТаблицаКонтроляИСвойств = НаборТаблиц.ТаблицаКонтроляИСвойств;
	ТаблицаВидовКонтроляСПараметрами = НаборТаблиц.ТаблицаВидовКонтроляСПараметрами;
	ТаблицаКонтроляИНоменклатуры = НаборТаблиц.ТаблицаКонтроляИНоменклатуры;
	ТаблицаСтрокКонтроля = НаборТаблиц.ТаблицаСтрокКонтроля;
	
	Для Каждого СтрокаКонтроляНоменклатуры Из ТаблицаКонтроляИНоменклатуры Цикл
		ТекущийКонтроль = СтрокаКонтроляНоменклатуры.КонтрольПродаж;
		КонтрольДобавлен = Ложь;
		Если ЗначениеЗаполнено(СтрокаКонтроляНоменклатуры.Номенклатура) Тогда
			КонтрольДобавлен = ДобавитьКонтрольНоменклатурыПриНеобходимости(ДанныеКонтроляПродаж.НоменклатураКонтроляПродаж, 
				СтрокаКонтроляНоменклатуры);
		Иначе
			Если ДанныеКонтроляПродаж.ОбщийКонтрольПродаж.Найти(ТекущийКонтроль) = Неопределено Тогда
				ДанныеКонтроляПродаж.ОбщийКонтрольПродаж.Добавить(ТекущийКонтроль);
				КонтрольДобавлен = Истина;
			КонецЕсли;
		КонецЕсли;
		Если КонтрольДобавлен Тогда
			СтрокаЭлементаКонтроля
				= ПолучитьСтрокуЭлементаКонтроляПродаж(ДанныеКонтроляПродаж.ЭлементыКонтроляПродаж, ТекущийКонтроль);
				
			Если СтрокаЭлементаКонтроля = Неопределено Тогда
				ДобавитьЭлементКонтроляПродажВДанныеКонтроля(НаборТаблиц, ДанныеКонтроляПродаж, ТекущийКонтроль);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеКонтроляПродаж;
	
КонецФункции

Функция ПолучитьРеквизитыОбработкиРабочееМестоКассира() Экспорт
	
	РезультатФункции = Новый Массив;
	КоллекцияРеквизитов = Метаданные.Обработки.РабочееМестоКассира.Реквизиты;
	Для Каждого РеквизитОбработки Из КоллекцияРеквизитов Цикл
		РезультатФункции.Добавить(РеквизитОбработки.Имя);
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Процедура ПреобразоватьМассивыСтруктурДанныхЧекаВТаблицы(РеквизитыФормы) Экспорт
	
	ИмяТаблицыОплата = "Оплата";
	ИмяТаблицыТовары = "Товары";
	
	СтруктураИсточник = Неопределено;
	Для Каждого ОписаниеТаблицы Из РеквизитыФормы.КолонкиТаблицФормы Цикл
		ТаблицаПриемник = Новый ТаблицаЗначений;
		Для Каждого КолонкаТаблицы Из ОписаниеТаблицы.Значение Цикл
			ТаблицаПриемник.Колонки.Добавить(КолонкаТаблицы.Имя, КолонкаТаблицы.Тип);
		КонецЦикла;
		Если ОписаниеТаблицы.Ключ = ИмяТаблицыОплата Или ОписаниеТаблицы.Ключ = ИмяТаблицыТовары Тогда
			СтруктураИсточник = РеквизитыФормы.Объект[ОписаниеТаблицы.Ключ];
		Иначе
			СтруктураИсточник = РеквизитыФормы[ОписаниеТаблицы.Ключ];
		КонецЕсли;
		Для Каждого ДанныеСтроки Из СтруктураИсточник Цикл
			НоваяСтрока = ТаблицаПриемник.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);
		КонецЦикла;
		Если ОписаниеТаблицы.Ключ = ИмяТаблицыОплата Или ОписаниеТаблицы.Ключ = ИмяТаблицыТовары Тогда
			РеквизитыФормы.Объект.Вставить(ОписаниеТаблицы.Ключ, ТаблицаПриемник);
		Иначе
			РеквизитыФормы.Вставить(ОписаниеТаблицы.Ключ, ТаблицаПриемник);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПреобразоватьТаблицыЧекаВСтруктурыДанных(РеквизитыФормы) Экспорт
	
	ИмяТаблицыОплата = "Оплата";
	ИмяТаблицыТовары = "Товары";
	
	ТаблицаИсточник = Неопределено;
	Для Каждого ОписаниеТаблицы Из РеквизитыФормы.КолонкиТаблицФормы Цикл
		Если ОписаниеТаблицы.Ключ = ИмяТаблицыОплата Или ОписаниеТаблицы.Ключ = ИмяТаблицыТовары Тогда
			ТаблицаИсточник = РеквизитыФормы.Объект[ОписаниеТаблицы.Ключ];
		Иначе
			ТаблицаИсточник = РеквизитыФормы[ОписаниеТаблицы.Ключ];
		КонецЕсли;
		СтруктураПриемник = Новый Массив;
		Для Каждого СтрокаТаблицыИсточника Из ТаблицаИсточник Цикл
			ДанныеСтроки = Новый Структура();
			Для Каждого КолонкаТаблицы Из ОписаниеТаблицы.Значение Цикл
				ДанныеСтроки.Вставить(КолонкаТаблицы.Имя, СтрокаТаблицыИсточника[КолонкаТаблицы.Имя]);
			КонецЦикла;
			СтруктураПриемник.Добавить(ДанныеСтроки);
		КонецЦикла;
		Если ОписаниеТаблицы.Ключ = ИмяТаблицыОплата Или ОписаниеТаблицы.Ключ = ИмяТаблицыТовары Тогда
			РеквизитыФормы.Объект.Вставить(ОписаниеТаблицы.Ключ, СтруктураПриемник);
		Иначе
			РеквизитыФормы.Вставить(ОписаниеТаблицы.Ключ, СтруктураПриемник);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВключитьКнопочныйВариантКомандРежимЕще(Форма, НастройкиЭлементов) Экспорт
	
	Элементы = Форма.Элементы;
	
	СвойствоВысота = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	НаборСвойств = НастройкиЭлементов.Получить(ЗаголовкиОбластей.ОбластьПанельОпераций);
	Если Не НаборСвойств = Неопределено Тогда
		ЗначениеВысоты = НаборСвойств.Получить(СвойствоВысота);
		Если ЗначениеЗаполнено(ЗначениеВысоты) И ЗначениеВысоты > 1 Тогда
			ПараметрыУвеличенногоИнтерфейса = ПараметрыУвеличенногоИнтерфейса(Форма.ВидОтображения);
			Элементы.ВводТовараПоСтроке.Шрифт = ПараметрыУвеличенногоИнтерфейса.Шрифт;
			Элементы.КомандаРежим.Шрифт = ПараметрыУвеличенногоИнтерфейса.Шрифт;
			Элементы.ОтборВесовогоТовара.Шрифт = ПараметрыУвеличенногоИнтерфейса.Шрифт;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПервоначальныеНастройкиОбластейРМК() Экспорт
	
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	
	ТиповыеАвтоЗначения = ПолучитьТиповыеАвтоЗначенияСвойствНастроекЭлементов();
	
	ТипЦелоеЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(2, 0, ДопустимыйЗнак.Неотрицательный);
	ТаблицаНастроек = Справочники.НастройкиРабочегоМестаКассира.ПустаяСсылка().НастройкиОбластей.ВыгрузитьКолонки();
	ТаблицаНастроек.Колонки.Добавить("МаксимальноеЗначение", ТипЦелоеЧисло);
	
	СвойствоШрифт = Перечисления.СвойстваЭлементовРМК.ШрифтКнопок;
	СвойстваШирина = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок;
	СвойствоВысота = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
	СвойствоЦветКнопок = Перечисления.СвойстваЭлементовРМК.ЦветКнопок;
	СвойствоПереноситьТекст = Перечисления.СвойстваЭлементовРМК.ПереноситьТекст;
	СвойствоРазмер = Перечисления.СвойстваЭлементовРМК.РазмерКнопок;
	СвойствоРазмерПлиточныйИнтерфейс = Перечисления.СвойстваЭлементовРМК.РазмерКнопокПлиточныйИнтерфейс;
	
	ДобавитьНастройкиОбластиОплатить(ТаблицаНастроек, ЗаголовкиОбластей.ОбластьОплатить, ТиповыеАвтоЗначения, 10, 45);
	ДобавитьНастройкиОбластиПанельОпераций(ТаблицаНастроек, ТиповыеАвтоЗначения);
	
	ЗначенияРазмераКнопок = Новый Структура();
	ЗначенияРазмераКнопок.Вставить("ЗначениеПоУмолчанию", 0);
	ЗначенияРазмераКнопок.Вставить("МаксимальноеЗначение", 4);
	
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ЗаголовкиОбластей.ОбластьДанныеТекущегоТовара,
		СвойствоЦветКнопок, ТиповыеАвтоЗначения.ЦветАвто);
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ЗаголовкиОбластей.ОбластьДанныеТекущегоТовара,
		СвойствоРазмер, ЗначенияРазмераКнопок);
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ЗаголовкиОбластей.ОбластьДанныеТекущегоТовара,
		СвойствоРазмерПлиточныйИнтерфейс, ЗначенияРазмераКнопок);
	
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		ЗначенияВысотыДанныеТовара = Новый Структура();
		ЗначенияВысотыДанныеТовара.Вставить("ЗначениеПоУмолчанию", 0);
		ЗначенияВысотыДанныеТовара.Вставить("МаксимальноеЗначение", 10);
		
		ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ЗаголовкиОбластей.ОбластьДанныеТекущегоТовара,
			СвойствоВысота, ЗначенияВысотыДанныеТовара);
	КонецЕсли;
	
	ЗначенияШириныКолонки = Новый Структура();
	ЗначенияШириныКолонки.Вставить("ЗначениеПоУмолчанию", 0);
	ЗначенияШириныКолонки.Вставить("МаксимальноеЗначение", 30);
	
	ЗначенияШириныСуммы = Новый Структура();
	ЗначенияШириныСуммы.Вставить("ЗначениеПоУмолчанию", 0);
	ЗначенияШириныСуммы.Вставить("МаксимальноеЗначение", 30);
	
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ЗаголовкиОбластей.ОбластьСписокТоваров, СвойствоШрифт,
		ТиповыеАвтоЗначения.ШрифтАвто);
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ЗаголовкиОбластей.ОбластьСписокТоваров, СвойстваШирина,
		ЗначенияШириныКолонки);
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ЗаголовкиОбластей.ОбластьСписокТоваров, СвойствоВысота,
		ЗначенияШириныСуммы);
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ЗаголовкиОбластей.ОбластьСписокТоваров,
		СвойствоПереноситьТекст, Ложь);
	
	Возврат ТаблицаНастроек;
	
КонецФункции

Функция ПолучитьПервоначальныеНастройкиЭлементовПанелиОперацииРМК() Экспорт
	
	ТаблицаНастроек = ПолучитьБазовыеНастройкиЭлементовРМК();
	СвойствоЦветШрифта = Перечисления.СвойстваЭлементовРМК.ЦветШрифта;
	ТиповыеАвтоЗначения = ПолучитьТиповыеАвтоЗначенияСвойствНастроекЭлементов();
	ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоЦветШрифта, ТиповыеАвтоЗначения.ЦветАвто);
	Возврат ТаблицаНастроек;
	
КонецФункции

Функция ПолучитьПервоначальныеНастройкиЭлементовРМК(КвадратныеКнопки = Ложь) Экспорт
	
	ТаблицаНастроек = ПолучитьБазовыеНастройкиЭлементовРМК();
	
	СвойствоВысотаКнопок = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
	СвойствоШрифтКнопок = Перечисления.СвойстваЭлементовРМК.ШрифтКнопок;
	СвойствоЦветШрифта = Перечисления.СвойстваЭлементовРМК.ЦветШрифта;
	СвойствоФигураКнопок = Перечисления.СвойстваЭлементовРМК.ФигураКнопок;
	
	ТиповыеАвтоЗначения = ПолучитьТиповыеАвтоЗначенияСвойствНастроекЭлементов();
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоВысотаКнопок, 0);
	КонецЕсли;
	Если Не КвадратныеКнопки Тогда
		ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоШрифтКнопок, ТиповыеАвтоЗначения.ШрифтАвто);
		ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоЦветШрифта, ТиповыеАвтоЗначения.ЦветАвто);
	КонецЕсли;
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоФигураКнопок, ТиповыеАвтоЗначения.ФигураАвто);
	КонецЕсли;
	
	Возврат ТаблицаНастроек;
	
КонецФункции

Функция ПолучитьИндивидуальныеПервоначальныеНастройки(ИмяЭлемента = "", ЭтоТерминалСамообслуживания = Ложь) Экспорт
	
	ТаблицаНастроек = Справочники.НастройкиРабочегоМестаКассира.ПустаяСсылка().НастройкиЭлементов.ВыгрузитьКолонки();
	ЭлементДробноеКоличество = "ТекущийТоварУстановитьДробноеКоличество";
	ИмяКнопкиВводаДанныхПокупателя = "ВвестиДанныеПокупателя";
		
	Если ИмяЭлемента = ЭлементДробноеКоличество Или ИмяЭлемента = "" Тогда
		
		СвойствоЗаголовокКнопки = Перечисления.СвойстваЭлементовРМК.ЗаголовокКнопки;
		СвойствоВеличинаДробная = Перечисления.СвойстваЭлементовРМК.ВеличинаДробногоКоличества;
		СвойствоШагДробный = Перечисления.СвойстваЭлементовРМК.ШагДробногоКоличества;
		СвойствоПодтверждениеДробного = Перечисления.СвойстваЭлементовРМК.ПодтверждениеДробногоТовара;
		
		СтрокаНастройки = ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоЗаголовокКнопки, "");
		СтрокаНастройки.ИмяЭлемента = ЭлементДробноеКоличество;
		СтрокаНастройки = ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоВеличинаДробная, 0);
		СтрокаНастройки.ИмяЭлемента = ЭлементДробноеКоличество;
		СтрокаНастройки = ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоШагДробный, 0);
		СтрокаНастройки.ИмяЭлемента = ЭлементДробноеКоличество;
		СтрокаНастройки = ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоПодтверждениеДробного, Ложь);
		СтрокаНастройки.ИмяЭлемента = ЭлементДробноеКоличество;
		
	КонецЕсли;
	
	Если (ИмяЭлемента = ИмяКнопкиВводаДанныхПокупателя Или ИмяЭлемента = "") И ЭтоТерминалСамообслуживания Тогда
		СвойствоРазмерКнопок = Перечисления.СвойстваЭлементовРМК.РазмерКнопок;
		СтрокаНастройки = ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоРазмерКнопок, 0);
		СтрокаНастройки.ИмяЭлемента = ИмяКнопкиВводаДанныхПокупателя;
	КонецЕсли;
	
	Возврат ТаблицаНастроек;
	
КонецФункции

Функция ПодготовитьНастройкиЭлементовДляКлиента(ПараметрыРМК) Экспорт
	
	НастройкаРМК = ПараметрыРМК.НастройкаРМК;
	
	РезультатФункции = Новый Соответствие();
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	
	ЭлементыДляКлиента = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЭлементыОбластиПанельОпераций();
	ЭлементыТекущегоТовара = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЭлементыОбластиДанныхТекущегоТовара();
	Для Каждого ИмяЭлемента Из ЭлементыТекущегоТовара Цикл
		ЭлементыДляКлиента.Добавить(ИмяЭлемента);
	КонецЦикла;
	
	ТаблицаПервоначальныхНастроек = ПолучитьПервоначальныеНастройкиОбластейРМК();
	НаборСвойствПанельОпераций = Новый Соответствие();
	ОтборСтрокПанелиОпераций = Новый Структура("ЗаголовокОбласти", ЗаголовкиОбластей.ОбластьПанельОпераций);
	СтрокиНастроекПанелиОпераций = ТаблицаПервоначальныхНастроек.найтиСтроки(ОтборСтрокПанелиОпераций);
	Для Каждого СтрокаНастройки Из СтрокиНастроекПанелиОпераций Цикл
		Если Не СтрокаНастройки.СвойствоЭлементовОбласти = Перечисления.СвойстваЭлементовРМК.ОбластьПрименения Тогда
			ЗначениеСвойства
				= ПривестиТипЗначенияСвойства(СтрокаНастройки.СвойствоЭлементовОбласти, СтрокаНастройки.ЗначениеСвойства);
			НаборСвойствПанельОпераций.Вставить(СтрокаНастройки.СвойствоЭлементовОбласти, ЗначениеСвойства);
		КонецЕсли;
	КонецЦикла;
	НаборСвойствПлиточныйИнтерфейс = СкопироватьСоответствие(НаборСвойствПанельОпераций);
	
	НастройкиЭлементов = ОбщегоНазначенияРМК.ПолучитьНастройкиЭлементовРабочегоМестаКассира(НастройкаРМК);
	КнопкаКаталог = "Каталог";
	КнопкаКаталогКСО = "ОткрытьПлиточныйИнтерфейсКаталога";
	КнопкаОплаты = "ПерейтиКОплате";
	
	Для Каждого ТекущаяНастройка Из НастройкиЭлементов Цикл
		Если Не ЭлементыДляКлиента.Найти(ТекущаяНастройка.Ключ) = Неопределено Тогда
			РезультатФункции.Вставить(ТекущаяНастройка.Ключ, ТекущаяНастройка.Значение);
			Если ТекущаяНастройка.Ключ = КнопкаКаталог И ПараметрыРМК.РежимКассыСамообслуживания Тогда
				РезультатФункции.Вставить(КнопкаКаталогКСО, ТекущаяНастройка.Значение);
			КонецЕсли;
		ИначеЕсли ТекущаяНастройка.Ключ = ЗаголовкиОбластей.ВвестиДанныеПокупателя Тогда
			РезультатФункции.Вставить(ЗаголовкиОбластей.ВвестиДанныеПокупателя, ТекущаяНастройка.Значение);
		ИначеЕсли ТекущаяНастройка.Ключ = ЗаголовкиОбластей.ОбластьПанельОпераций Тогда
			ПеренестиЗначенияСвойствВНабор(НаборСвойствПанельОпераций, ТекущаяНастройка.Значение);
		ИначеЕсли ТекущаяНастройка.Ключ = ЗаголовкиОбластей.ПлиточныйИнтерфейс Тогда
			ПеренестиЗначенияСвойствВНабор(НаборСвойствПлиточныйИнтерфейс, ТекущаяНастройка.Значение);
		ИначеЕсли ТекущаяНастройка.Ключ = КнопкаОплаты Тогда
			РезультатФункции.Вставить(ТекущаяНастройка.Ключ, ТекущаяНастройка.Значение);
		КонецЕсли;
	КонецЦикла;
	РезультатФункции.Вставить(ЗаголовкиОбластей.ОбластьПанельОпераций, НаборСвойствПанельОпераций);
	РезультатФункции.Вставить(ЗаголовкиОбластей.ПлиточныйИнтерфейс, НаборСвойствПлиточныйИнтерфейс);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьМассивИменКвадратныхКнопок() Экспорт
	
	КнопкиИсключения = Новый Массив;
	КнопкиИсключения.Добавить("ТекущийТоварУстановитьДробноеКоличество");
	
	МассивИмен = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЭлементыОбластиДанныхТекущегоТовара();
	Для Каждого КнопкаИсключение Из КнопкиИсключения Цикл
		ИндексИсключения = МассивИмен.Найти(КнопкаИсключение);
		Если Не ИндексИсключения = Неопределено Тогда
			МассивИмен.Удалить(ИндексИсключения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивИмен;
	
КонецФункции

Функция ПолучитьМаксимальноеЗначениеНастройкиЭлемента(ИмяЭлемента, СвойствоЭлементов) Экспорт
	
	РезультатФункции = 1;
	
	ТаблицаМаксимальныхЗначений = ПолучитьТаблицуМаксимальныхЗначенийНастроекЭлементов();
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("ИмяЭлемента", ИмяЭлемента);
	ОтборСтрок.Вставить("СвойствоЭлементов", СвойствоЭлементов);
	СтрокиМаксимальногоЗначения = ТаблицаМаксимальныхЗначений.НайтиСтроки(ОтборСтрок);
	Если СтрокиМаксимальногоЗначения.Количество() > 0 Тогда
		РезультатФункции = СтрокиМаксимальногоЗначения[0].МаксимальноеЗначение;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьНастройкиЭлементовРабочегоМестаКассира(НастройкаРМК) Экспорт
	
	РезультатФункции = Новый Соответствие();
	
	ЗапросНастроек = Новый Запрос;
	ЗапросНастроек.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираНастройкиЭлементов.ИмяЭлемента КАК ИмяЭлемента,
	|	НастройкиРабочегоМестаКассираНастройкиЭлементов.СвойствоЭлементов КАК СвойствоЭлементов,
	|	НастройкиРабочегоМестаКассираНастройкиЭлементов.ЗначениеСвойства КАК ЗначениеСвойства
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.НастройкиЭлементов КАК НастройкиРабочегоМестаКассираНастройкиЭлементов
	|ГДЕ
	|	НастройкиРабочегоМестаКассираНастройкиЭлементов.Ссылка = &ТекущаяНастройкаРМК
	|ИТОГИ ПО
	|	ИмяЭлемента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираНастройкиОбластей.ЗаголовокОбласти КАК ЗаголовокОбласти,
	|	НастройкиРабочегоМестаКассираНастройкиОбластей.СвойствоЭлементовОбласти КАК СвойствоЭлементов,
	|	НастройкиРабочегоМестаКассираНастройкиОбластей.ЗначениеСвойства КАК ЗначениеСвойства
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.НастройкиОбластей КАК НастройкиРабочегоМестаКассираНастройкиОбластей
	|ГДЕ
	|	НастройкиРабочегоМестаКассираНастройкиОбластей.Ссылка = &ТекущаяНастройкаРМК
	|ИТОГИ ПО
	|	ЗаголовокОбласти";
	ЗапросНастроек.УстановитьПараметр("ТекущаяНастройкаРМК", НастройкаРМК);
	
	ПакетРезультатов = ЗапросНастроек.ВыполнитьПакет();
	ВыборкаНастроекЭлементов = ПакетРезультатов[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНастроекЭлементов.Следующий() Цикл
		
		СоответствиеНастроек = Новый Соответствие();
		ВыборкаСвойств = ВыборкаНастроекЭлементов.Выбрать();
		Пока ВыборкаСвойств.Следующий() Цикл
			
			ЗначениеСвойства = ПривестиТипЗначенияСвойства(ВыборкаСвойств.СвойствоЭлементов, ВыборкаСвойств.ЗначениеСвойства);
			СоответствиеНастроек.Вставить(ВыборкаСвойств.СвойствоЭлементов, ЗначениеСвойства);
			
		КонецЦикла;
		РезультатФункции.Вставить(ВыборкаНастроекЭлементов.ИмяЭлемента, СоответствиеНастроек);
		
	КонецЦикла;
	ВыборкаНастроекОбластей = ПакетРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОбработатьВыборкуНастроекОбластей(РезультатФункции, ВыборкаНастроекОбластей);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура НастроитьЭлементыРабочегоМестаКассира(Форма, НастройкиЭлементов) Экспорт
	
	ПоложениеЧасов = "";
	СвойствоШирина = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок;
	СвойствоВыравнивание = Перечисления.СвойстваЭлементовРМК.ВыравниваниеЭлементов;
	СвойствоВысота = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
	ШиринаСтатусаСмены = 0;
	ЭлементыПанелиОпераций = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЭлементыОбластиПанельОпераций();
	
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	Для Каждого СтрокаНастройки Из НастройкиЭлементов Цикл
		
		Если СтрокаНастройки.Ключ = ЗаголовкиОбластей.ОбластьПанельОпераций Тогда
			
			Если Не Форма.РежимКассыСамообслуживания Тогда
				ОпределитьПрименитьПоложениеЧасов(Форма, ПоложениеЧасов, СтрокаНастройки.Значение);
				ИнтерфейсРМКСлужебныйКлиентСервер.ОпределитьПрименитьВыравниваниеГруппыОперации(Форма, СтрокаНастройки.Значение);
				НастроитьОтображениеСтатусаКассовойСмены(Форма, ПоложениеЧасов, СтрокаНастройки.Значение);
				ЗначениеВысоты = СтрокаНастройки.Значение.Получить(СвойствоВысота);
				Если Не ЗначениеВысоты = Неопределено И ЗначениеВысоты > 1 Тогда
					ШиринаСтатусаСмены = 4;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаНастройки.Ключ = ЗаголовкиОбластей.ПлиточныйИнтерфейс Тогда
			
			КнопкаДомой = Форма.Элементы.ПерейтиНаНачальнуюСтраницу;
			ИнтерфейсРМКСлужебныйКлиентСервер.НастроитьОтображениеКнопкиФормы(Форма, КнопкаДомой, СтрокаНастройки.Значение);
			
			НаборСвойствКнопкаКСО = СкопироватьСоответствие(СтрокаНастройки.Значение);
			Если Не НаборСвойствКнопкаКСО.Получить(СвойствоШирина) = Неопределено Тогда
				НаборСвойствКнопкаКСО.Удалить(СвойствоШирина);
			КонецЕсли;
			
			ОпределитьПрименитьПоложениеЧасов(Форма, ПоложениеЧасов, СтрокаНастройки.Значение);
			
		ИначеЕсли СтрокаНастройки.Ключ = ЗаголовкиОбластей.ОбластьСписокТоваров Тогда
			
			НастроитьОтображениеСпискаТоваров(Форма, СтрокаНастройки.Значение);
			
		Иначе
			
			ЭлементФормы = Форма.Элементы.Найти(СтрокаНастройки.Ключ);
			Если Не ЭлементФормы = Неопределено И ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") Тогда
				ИнтерфейсРМКСлужебныйКлиентСервер.НастроитьОтображениеКнопкиФормы(Форма, ЭлементФормы, СтрокаНастройки.Значение);
				Если ШиринаСтатусаСмены = 0 И Не ЭлементыПанелиОпераций.Найти(СтрокаНастройки.Ключ) = Неопределено Тогда
					ЗначениеВысоты = СтрокаНастройки.Значение.Получить(СвойствоВысота);
					Если Не ЗначениеВысоты = Неопределено И ЗначениеВысоты > 1 Тогда
						ШиринаСтатусаСмены = 4;
					КонецЕсли;
				КонецЕсли;
				Если ЭлементФормы = Форма.Элементы.ПерейтиКОплате И Форма.ВертикальнаяОриентация
						И ЭлементФормы.Ширина > Форма.Элементы.ПраваяКолонкаУправленияЧеком.Ширина Тогда
					Форма.Элементы.ПраваяКолонкаУправленияЧеком.Ширина = ЭлементФормы.Ширина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ШиринаСтатусаСмены > 0 Тогда
		Форма.Элементы.ДекорацияСтатусСмены.Ширина = ШиринаСтатусаСмены;
	КонецЕсли;
	КлючПараметрыПолей = "ПараметрыПолей";
	ПараметрыПолей = СформироватьНастройкиСвязанныхПолей(Форма, НастройкиЭлементов);
	НастройкиЭлементов.Вставить(КлючПараметрыПолей, ПараметрыПолей);
	
КонецПроцедуры

Функция ВидыЦифровойКлавиатуры() Экспорт
	
	РезультатФункции = Новый Структура();
	
	РезультатФункции.Вставить("Стандартный", 0);
	РезультатФункции.Вставить("Авторизация", 1);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПостроитьПанельЦифровойКлавиатуры(Форма, ЭлементКонтейнер, ПараметрыПостроения) Экспорт
	
	ТекстОшибки = "";
	
	ИмяРеквизитаВвода = "";
	КнопкаЗакрытия = Ложь;
	Если ПараметрыПостроения.Свойство("ИмяРеквизитаВвода") Тогда
		ИмяРеквизитаВвода = ПараметрыПостроения.ИмяРеквизитаВвода;
	КонецЕсли;
	Если ПараметрыПостроения.Свойство("КнопкаЗакрытия") Тогда
		КнопкаЗакрытия = ПараметрыПостроения.КнопкаЗакрытия;
	КонецЕсли;
	ВидыКлавиатуры = ВидыЦифровойКлавиатуры();
	ВидКлавиатуры = ВидыКлавиатуры.Стандартный;
	Если ПараметрыПостроения.Свойство("ВидКлавиатуры") Тогда
		ВидКлавиатуры = ПараметрыПостроения.ВидКлавиатуры;
	КонецЕсли;
	
	ДобавитьКомандыКлавиатуры(Форма, ВидКлавиатуры);
	
	ОбщаяГруппа = ДобавитьГруппуКлавиатуры(Форма, ЭлементКонтейнер, "ОбщийКонтейнер", ПараметрыПостроения, ТекстОшибки);
	ОбщаяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	Если ВидКлавиатуры = ВидыКлавиатуры.Стандартный Тогда
		ГруппаТабло = ДобавитьГруппуКлавиатуры(Форма, ОбщаяГруппа, "ГруппаТабло", ПараметрыПостроения, ТекстОшибки);
		ГруппаТабло.Ширина = ЭлементКонтейнер.Ширина;
		ДобавитьЭлементыГруппыТабло(Форма, ГруппаТабло, ИмяРеквизитаВвода, КнопкаЗакрытия, ТекстОшибки);
	КонецЕсли;
	ГруппаПанель = ДобавитьГруппуКлавиатурыЦифроваяПанель(Форма, ОбщаяГруппа, ПараметрыПостроения, ТекстОшибки);
	
	ГруппаЦифры789 = ДобавитьГруппуКлавиатуры(Форма, ГруппаПанель, "ГруппаЦифры789", ПараметрыПостроения, ТекстОшибки);
	МассивЦифр = Новый Массив;
	МассивЦифр.Добавить(7);
	МассивЦифр.Добавить(8);
	МассивЦифр.Добавить(9);
	ДобавитьКнопкиЦифрыРяда(Форма, ГруппаЦифры789, МассивЦифр, ПараметрыПостроения, ТекстОшибки);
	
	ГруппаЦифры456 = ДобавитьГруппуКлавиатуры(Форма, ГруппаПанель, "ГруппаЦифры456", ПараметрыПостроения, ТекстОшибки);
	МассивЦифр.Очистить();
	МассивЦифр.Добавить(4);
	МассивЦифр.Добавить(5);
	МассивЦифр.Добавить(6);
	ДобавитьКнопкиЦифрыРяда(Форма, ГруппаЦифры456, МассивЦифр, ПараметрыПостроения, ТекстОшибки);
	
	ГруппаЦифры123 = ДобавитьГруппуКлавиатуры(Форма, ГруппаПанель, "ГруппаЦифры123", ПараметрыПостроения, ТекстОшибки);
	МассивЦифр.Очистить();
	МассивЦифр.Добавить(1);
	МассивЦифр.Добавить(2);
	МассивЦифр.Добавить(3);
	ДобавитьКнопкиЦифрыРяда(Форма, ГруппаЦифры123, МассивЦифр, ПараметрыПостроения, ТекстОшибки);
	
	ГруппаЦифры0 = ДобавитьГруппуКлавиатуры(Форма, ГруппаПанель, "ГруппаЦифры0", ПараметрыПостроения, ТекстОшибки);
	Если ВидКлавиатуры = ВидыКлавиатуры.Стандартный Тогда
		ДобавитьКнопкиНулевогоРяда(Форма, ГруппаЦифры0, ПараметрыПостроения, ТекстОшибки);
	
		ГруппаОчищениеПоиск = ДобавитьГруппуКлавиатуры(Форма, ГруппаПанель, "ГруппаОчищениеПоиск", ПараметрыПостроения, ТекстОшибки);
		ГруппаОчищениеПоиск.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		ГруппаОчищениеПоиск.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Лево;
		ДобавитьКнопкиРядаОчищениеПоиск(Форма, ГруппаОчищениеПоиск, ПараметрыПостроения, ТекстОшибки);
	ИначеЕсли ВидКлавиатуры = ВидыКлавиатуры.Авторизация Тогда
		ДобавитьКнопкиНулевогоРядаАвторизации(Форма, ГруппаЦифры0, ПараметрыПостроения, ТекстОшибки);
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция ДобавитьГруппуКарточку(ЭлементыФормы, КонтейнерЭлемента, ИмяЭлемента, ИмяДействия) Экспорт
	
	ПлиткаКарточка = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), КонтейнерЭлемента);
	ПлиткаКарточка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ПлиткаКарточка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ПлиткаКарточка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ПлиткаКарточка.ОтображатьЗаголовок = Ложь;
	ПлиткаКарточка.ОтображатьКакКарточку = Истина;
	ПлиткаКарточка.Гиперссылка = Истина;
	ПлиткаКарточка.УстановитьДействие("Нажатие", ИмяДействия);
	
	Возврат ПлиткаКарточка
	
КонецФункции

Процедура ОбновитьКнопкуСтатусаКассовыхСмен(Форма) Экспорт
	
	КартинкаСтатуса = ПолучитьКартинкуСтатусаКассовыхСмен(Форма.ГрупповойСтатусСмен);
	Если Не КартинкаСтатуса = Неопределено Тогда
		Форма.Элементы.ДекорацияСтатусСмены.Картинка = КартинкаСтатуса;
	КонецЕсли;
	
КонецПроцедуры

Функция КодДоступаПользователяУказан(ДанныеПоискаКассира) Экспорт
	
	Результат = Ложь;
	Запрос = Новый Запрос;
	ОбщегоНазначенияРМКПереопределяемый.СформироватьЗапросПолученияКодовДоступаПользователя(Запрос, ДанныеПоискаКассира);
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		КоличествоПаролейПользователя = Выборка.Количество();
		Результат = (КоличествоПаролейПользователя > 0);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЦветаПлиточногоИнтерфейсаПоУмолчанию(Форма) Экспорт
	
	Интерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	
	ЦветФонаПапки = ?(Интерфейс85, ЦветаПалитры.Фиолетовый, ЦветаСтиля.ЦветПапкиКнопкиРМК);
	ЦветФонаКнопки = ?(Интерфейс85, Новый Цвет(), ЦветаСтиля.ЦветФонаСтаканаРМК);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтруктураПлиточногоИнтерфейсаПодбора") Тогда
		ПалитраПлитки = Форма.СтруктураПлиточногоИнтерфейсаПодбора;
		Если ЗначениеЗаполнено(ПалитраПлитки) Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПалитраПлитки, "ЦветФонаПапки,ЦветФонаКнопки");
			Если Не СокрЛП(ЗначенияРеквизитов.ЦветФонаПапки) = "" Тогда
				ЦветФонаПапки = ОбщегоНазначения.ЗначениеИзСтрокиXML(ЗначенияРеквизитов.ЦветФонаПапки);
			КонецЕсли;
			Если Не СокрЛП(ЗначенияРеквизитов.ЦветФонаКнопки) = "" Тогда
				ЦветФонаКнопки = ОбщегоНазначения.ЗначениеИзСтрокиXML(ЗначенияРеквизитов.ЦветФонаКнопки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РезультатФункции = Новый Структура("ЦветФонаПапки,ЦветФонаКнопки", ЦветФонаПапки, ЦветФонаКнопки);
	Возврат РезультатФункции;
	
КонецФункции

Процедура УдалитьСтрокиСоставаПалитрыСРазорваннымиСвязями(ПалитраОбъект) Экспорт
	
	СтрокиБезСвязи = ПолучитьСтрокиСоставаПалитрыБезСвязи(ПалитраОбъект.Состав);
	Пока СтрокиБезСвязи.Количество() > 0 Цикл
		
		ПроверяемыеКатегории = Новый Массив;
		Для Каждого СтрокаУдаления Из СтрокиБезСвязи Цикл
			Если СтрокаУдаления.ЭтоКатегория И СтрокаУдаления.НомерКатегорииРазмещения > 0 Тогда
				ПроверяемыеКатегории.Добавить(СтрокаУдаления.НомерКатегорииРазмещения);
			КонецЕсли;
			ПалитраОбъект.Состав.Удалить(СтрокаУдаления);
		КонецЦикла;
		СтрокиБезСвязи = ПолучитьСтрокиСоставаПалитрыБезСвязи(ПалитраОбъект.Состав, ПроверяемыеКатегории);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоОбластейФормы(Форма, ПараметрыЗаполнения) Экспорт
	
	ВосстановитьПервоначальноеДеревоОбластейФормы(Форма, ПараметрыЗаполнения);
	ПрименитьСохраненныйПорядокОбластей(Форма);
	
КонецПроцедуры

Процедура ВосстановитьПервоначальноеДеревоОбластейФормы(Форма, ПараметрыЗаполнения) Экспорт
	
	Форма.ШиринаСхемыРМК = 1;
	Форма.ВысотаСхемыРМК = 1;
	ТипыГруппировок = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыГруппировок();
	
	Форма.ДеревоОбластейФормыРМК.ПолучитьЭлементы().Очистить();
	МодельОбластейРМК = Форма.МодельОбластейРМК;
	КорневаяГруппа = ?(Форма.ГоризонтальнаяОриентация,
		МодельОбластейРМК.ГоризонтальнаяОриентация, МодельОбластейРМК.ВертикальнаяОриентация);
	ДеревоПервоначальногоРасположения
		= ПолучитьПервоначальноеРасположениеОбластейФормыРМК(КорневаяГруппа, ПараметрыЗаполнения);
	ДобавитьСтрокиУровняДерева(Форма, ДеревоПервоначальногоРасположения.Строки,
		Форма.ДеревоОбластейФормыРМК.ПолучитьЭлементы(), 1, ТипыГруппировок.Вертикальная);
	
КонецПроцедуры

Функция ВернутьТекстСочетанияКлавиш(СочетаниеКлавиш) Экспорт
	СочетаниеКлавишAlt = ?(СочетаниеКлавиш.Alt, "Alt + ", "");
	СочетаниеКлавишCtrl = ?(СочетаниеКлавиш.Ctrl, "Ctrl + ", "");
	СочетаниеКлавишShift = ?(СочетаниеКлавиш.Shift, "Shift + ", "");
	СочетаниеКлавишКлавиша = Строка(СочетаниеКлавиш.Клавиша);
	
	ТекстСочетания = СочетаниеКлавишAlt + СочетаниеКлавишCtrl + СочетаниеКлавишShift + СочетаниеКлавишКлавиша;
	
	Если ТекстСочетания = "Нет" Тогда
		ТекстСочетания = "";
	КонецЕсли;
	
	Возврат ТекстСочетания;
КонецФункции

Функция ЦветУправляющейКнопки(ЭтоФон = Ложь) Экспорт
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЦветВТакси = ?(ЭтоФон, ЦветаПалитры.ГолубойОсветленныйРМК, ЦветаСтиля.ГиперссылкаЦвет);
	Возврат ?(ЭтоИнтерфейс85, ЦветаПалитры.Фиолетовый, ЦветВТакси);
	
КонецФункции

Функция ЦветВспомогательнойКнопки(ЭтоФон = Ложь) Экспорт
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЦветВТакси = ?(ЭтоФон, ЦветаПалитры.Зеленый, ЦветаСтиля.ЦветАктивизированногоПунктаРМК);
	Возврат ?(ЭтоИнтерфейс85, ЦветаПалитры.Зеленый, ЦветВТакси);
	
КонецФункции

Функция ЦветГиперссылки(ЭтоФон = Ложь) Экспорт
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЦветВТакси = ?(ЭтоФон, ЦветаПалитры.Голубой, ЦветаСтиля.ИзмененноеЗначениеРеквизитаФон);
	Возврат ?(ЭтоИнтерфейс85, ЦветаПалитры.ГолубойОсветленныйРМК, ЦветВТакси);
	
КонецФункции

Функция ЦветВыбранногоЭлементаПоУмолчанию() Экспорт
	
	Возврат ?(ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85(), ЦветаПалитры.Зеленый, ЦветаСтиля.ЦветТаксиSpringGreenРМК);
	
КонецФункции

Функция ЦветСопутствующегоТовараПоУмолчанию() Экспорт
	
	Возврат ?(ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85(),
		ЦветаПалитры.ЖелтоЗеленыйРМК, ЦветаСтиля.ЦветТаксиYellowGreenРМК);
	
КонецФункции

Функция ЦветВидаОплатыЮКасса() Экспорт
	
	Возврат ?(ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85(),
		ЦветаПалитры.Розовый, ЦветаСтиля.ЦветКнопкиОтказатьсяРМК);
	
КонецФункции

Функция ЦветФонаВспомогательныхВидовОплат() Экспорт
	
	Возврат ?(ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85(),
		ЦветаПалитры.Оранжевый, ЦветаСтиля.ЦветТаксиLightOrangeРМК);
	
КонецФункции

Функция ЗаполнитьПараметрыКартыЛояльности85(ОписаниеКарты) Экспорт
	
	ПараметрыКарты = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыКартыЛояльности();
	
	ПараметрыКарты.ИдентификаторКарты = ОписаниеКарты.ИдентификаторКарты;
	ПараметрыКарты.КодКарты = ОписаниеКарты.НомерКарты;
	ПараметрыКарты.ФИО = ОписаниеКарты.ФИО;
	ПараметрыКарты.НомерТелефонаВладельцаКарты = ОписаниеКарты.Телефон;
	ПараметрыКарты.АдресЭПВладельцаКарты = ОписаниеКарты.Почта;
	ПараметрыКарты.ДатаРождения = ОписаниеКарты.ДатаРождения;
	ПараметрыКарты.ЭтоКомпания = Не ОписаниеКарты.ФизЛицо;
	ПараметрыКарты.ЭтоБонуснаяКарта = ЗначениеЗаполнено(ОписаниеКарты.БонуснаяПрограмма);
	
	Если ОписаниеКарты.Свойство("ПродажиОборот") Тогда
		ПараметрыКарты.СуммаПродаж = Формат(ОписаниеКарты.ПродажиОборот,"ЧДЦ=2");
	КонецЕсли;
	
	Возврат ПараметрыКарты;
	
КонецФункции

Процедура ПрименитьНаФормеМасштабИзПараметров(Форма, Параметры) Экспорт
	
	Если ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		Если Параметры.Свойство("УвеличенныйВариантМасштаба") Тогда
			Если Параметры.УвеличенныйВариантМасштаба = Истина Тогда
				Форма.ВариантМасштаба = ВариантМасштабаФормКлиентскогоПриложения.Обычный;
			Иначе
				Форма.ВариантМасштаба = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "УвеличенныйВариантМасштаба") Тогда
				Форма.УвеличенныйВариантМасштаба = Параметры.УвеличенныйВариантМасштаба;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Параметры.Свойство("Масштаб") Тогда
			Форма.Масштаб = Параметры.Масштаб;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьКнопкуСкидкаПенсионераКСОВОкнеОплаты(Форма, Настройки = Неопределено) Экспорт
	
	ДобавитьКнопкуСкидкаПенсионераКСО(Форма, Настройки, 1);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСУниверсальнойЦифровойКлавиатурой

Процедура ДобавитьКомандыКлавиатуры(Форма, ВидКлавиатуры)

	ДобавитьКомандыЦифрКлавиатуры(Форма);
	ДобавитьКомандуКлавиатуры(Форма, "ОчиститьУниверсальнаяКлавиатура");
	ДобавитьКомандуКлавиатуры(Форма, "УдалитьПоследнееУниверсальнаяКлавиатура");
	
	ВидыКлавиатуры = ВидыЦифровойКлавиатуры();
	Если ВидКлавиатуры = ВидыКлавиатуры.Стандартный Тогда
		ДобавитьКомандуКлавиатуры(Форма, "ЗапятаяУниверсальнаяКлавиатура");
		ДобавитьКомандуКлавиатуры(Форма, "ПоискУниверсальнаяКлавиатура");
		ДобавитьКомандуКлавиатуры(Форма, "ЗакрытьУниверсальнаяКлавиатура");
		ДобавитьКомандуКлавиатуры(Форма, "ДваНуляУниверсальнаяКлавиатура");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКомандуКлавиатуры(Форма, ИмяКоманды)
	
	НоваяКоманда = Форма.Команды.Найти(ИмяКоманды);
	Если НоваяКоманда = Неопределено Тогда
		НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = СтрШаблон("Подключаемый_%1", ИмяКоманды);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКомандыЦифрКлавиатуры(Форма)
	
	Для Счетчик = 0 По 9 Цикл
		ИмяКоманды = СтрШаблон("Цифра%1УниверсальнаяКлавиатура", Счетчик);
		
		НоваяКоманда = Форма.Команды.Найти(ИмяКоманды);
		Если НоваяКоманда = Неопределено Тогда
			НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие = "Подключаемый_ЦифраУниверсальнаяКлавиатура";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКнопкиНулевогоРяда(Форма, ГруппаЦифры0, ПараметрыПостроения, ТекстОшибки)
	
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("ИмяКнопки", "Цифра00УниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("ИмяКоманды", "ДваНуляУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("Заголовок", "00");
	ДобавитьКнопкуКлавиатуры(Форма, ГруппаЦифры0, ДанныеКнопки, ПараметрыПостроения, ТекстОшибки);
	
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("ИмяКнопки", "Цифра0УниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("ИмяКоманды", "Цифра0УниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("Заголовок", "0");
	ДобавитьКнопкуКлавиатуры(Форма, ГруппаЦифры0, ДанныеКнопки, ПараметрыПостроения, ТекстОшибки);
	
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("ИмяКнопки", "ЗапятаяУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("ИмяКоманды", "ЗапятаяУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("Заголовок", ",");
	ДобавитьКнопкуКлавиатуры(Форма, ГруппаЦифры0, ДанныеКнопки, ПараметрыПостроения, ТекстОшибки);
	
КонецПроцедуры

Процедура ДобавитьКнопкиНулевогоРядаАвторизации(Форма, ГруппаЦифры0, ПараметрыПостроения, ТекстОшибки)
	
	ЦветСлужебнойКнопки = ?(ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85(),
		ЦветаПалитры.Красный, ЦветаСтиля.ЦветКнопкиОтказатьсяРМК);
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("ИмяКнопки", "ОчиститьУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("ИмяКоманды", "ОчиститьУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("Заголовок", "X");
	КнопкаОчистить = ДобавитьКнопкуКлавиатуры(Форма, ГруппаЦифры0, ДанныеКнопки, ПараметрыПостроения, ТекстОшибки);
	КнопкаОчистить.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
	КнопкаОчистить.Отображение = ОтображениеКнопки.Картинка;
	КнопкаОчистить.Картинка = БиблиотекаКартинок.ОформлениеКрест;
	КнопкаОчистить.ЦветФона = ЦветСлужебнойКнопки;
	
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("ИмяКнопки", "Цифра0УниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("ИмяКоманды", "Цифра0УниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("Заголовок", "0");
	ДобавитьКнопкуКлавиатуры(Форма, ГруппаЦифры0, ДанныеКнопки, ПараметрыПостроения, ТекстОшибки);
	
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("ИмяКнопки", "УдалитьПоследнееУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("ИмяКоманды", "УдалитьПоследнееУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("Заголовок", "<<");
	КнопкаУдалить = ДобавитьКнопкуКлавиатуры(Форма, ГруппаЦифры0, ДанныеКнопки, ПараметрыПостроения, ТекстОшибки);
	КнопкаУдалить.Отображение = ОтображениеКнопки.Картинка;
	КнопкаУдалить.Картинка = БиблиотекаКартинок.ПереместитьВлево;
	КнопкаУдалить.ЦветФона = ЦветСлужебнойКнопки;
	
КонецПроцедуры

Процедура ДобавитьКнопкиРядаОчищениеПоиск(Форма, ГруппаОчищениеПоиск, ПараметрыПостроения, ТекстОшибки)
	
	ЦветСлужебнойКнопки = ?(ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85(),
		ЦветаПалитры.Красный, ЦветаСтиля.ЦветКнопкиОтказатьсяРМК);
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("ИмяКнопки", "ОчиститьУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("ИмяКоманды", "ОчиститьУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("Заголовок", "X");
	КнопкаОчистить = ДобавитьКнопкуКлавиатуры(Форма, ГруппаОчищениеПоиск, ДанныеКнопки, ПараметрыПостроения, ТекстОшибки);
	КнопкаОчистить.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
	КнопкаОчистить.Отображение = ОтображениеКнопки.Картинка;
	КнопкаОчистить.Картинка = БиблиотекаКартинок.ОформлениеКрест;
	КнопкаОчистить.ЦветФона = ЦветСлужебнойКнопки;
	
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("ИмяКнопки", "УдалитьПоследнееУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("ИмяКоманды", "УдалитьПоследнееУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("Заголовок", "<<");
	КнопкаУдалить = ДобавитьКнопкуКлавиатуры(Форма, ГруппаОчищениеПоиск, ДанныеКнопки, ПараметрыПостроения, ТекстОшибки);
	КнопкаУдалить.Отображение = ОтображениеКнопки.Картинка;
	КнопкаУдалить.Картинка = БиблиотекаКартинок.ПереместитьВлево;
	КнопкаУдалить.ЦветФона = ЦветСлужебнойКнопки;
	
	Элементы = Форма.Элементы;
	ИмяЭлемента = "ПоискСтраницы";
	ПоискСтраницы = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаОчищениеПоиск);
	ПоискСтраницы.Вид = ВидГруппыФормы.Страницы;
	ПоискСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	ИмяЭлемента = "ПоискСтраницаКнопки";
	СтраницаКнопкиПоиск = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ПоискСтраницы);
	СтраницаКнопкиПоиск.Вид = ВидГруппыФормы.Страница;
	СтраницаКнопкиПоиск.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ИмяЭлемента = "ПоискСтраницаПустая";
	ПоискСтраницаПустая = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ПоискСтраницы);
	ПоискСтраницаПустая.Вид = ВидГруппыФормы.Страница;
	ПоискСтраницаПустая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
	
	ИмяЭлемента = "ПустаяДекорация";
	ЭлементФормы = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ПоискСтраницаПустая);
	ЭлементФормы.Вид = ВидДекорацииФормы.Надпись;
	ЭлементФормы.Заголовок = " ";
	ЭлементФормы.Высота = 1;
	ЭлементФормы.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("ИмяКнопки", "ПоискУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("ИмяКоманды", "ПоискУниверсальнаяКлавиатура");
	ДанныеКнопки.Вставить("Заголовок", "O");
	КнопкаПоиск = ДобавитьКнопкуКлавиатуры(Форма, СтраницаКнопкиПоиск, ДанныеКнопки, ПараметрыПостроения, ТекстОшибки);
	КнопкаПоиск.Отображение = ОтображениеКнопки.Картинка;
	КнопкаПоиск.Картинка = БиблиотекаКартинок.Search;
	КнопкаПоиск.ЦветФона = ЦветаСтиля.ЦветАктивности;
	
КонецПроцедуры

Процедура ДобавитьКнопкиЦифрыРяда(Форма, ГруппаРодитель, МассивЦифр, ПараметрыПостроения, ТекстОшибки)
	
	Для Каждого ЦифраКнопки Из МассивЦифр Цикл
		
		ИмяКнопки = СтрШаблон("Цифра%1УниверсальнаяКлавиатура", ЦифраКнопки);
		
		ДанныеКнопки = Новый Структура();
		ДанныеКнопки.Вставить("ИмяКнопки", ИмяКнопки);
		ДанныеКнопки.Вставить("ИмяКоманды", ИмяКнопки);
		ДанныеКнопки.Вставить("Заголовок", Строка(ЦифраКнопки));
		ДобавитьКнопкуКлавиатуры(Форма, ГруппаРодитель, ДанныеКнопки, ПараметрыПостроения, ТекстОшибки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЭлементыГруппыТабло(Форма, ГруппаРодитель, ИмяРеквизитаВвода, КнопкаЗакрытия, ТекстОшибки)
	
	Если Не ТекстОшибки = "" Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	ИмяПоляВвода = "ПолеВводаУниверсальнаяКлавиатура";
	ИмяКнопкиЗакрытия = "ЗакрытьУниверсальнаяКлавиатура";
	ПолеВвода = Элементы.Найти(ИмяПоляВвода);
	КнопкаЗакрыть = Элементы.Найти(ИмяКнопкиЗакрытия);
	
	Если Не ПолеВвода = Неопределено Тогда
		
		ТекстОшибки = НСтр("ru = 'Элемент ""ПолеВводаУниверсальнаяКлавиатура"" уже существует.'");
		
	ИначеЕсли Не КнопкаЗакрыть = Неопределено Тогда
		
		ТекстОшибки = НСтр("ru = 'Элемент ""ЗакрытьУниверсальнаяКлавиатура"" уже существует.'");
		
	Иначе
		
		ВидОтображения = Неопределено;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВидОтображения") Тогда
			ВидОтображения = Форма.ВидОтображения;
		КонецЕсли;
		ПараметрыУвеличенногоИнтерфейса = ПараметрыУвеличенногоИнтерфейса(ВидОтображения);
		
		ПолеВвода = Элементы.Добавить(ИмяПоляВвода, Тип("ПолеФормы"), ГруппаРодитель);
		Если Не ИмяРеквизитаВвода = "" Тогда
			ПолеВвода.ПутьКДанным = ИмяРеквизитаВвода;
		КонецЕсли;
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеВвода.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		ПолеВвода.КнопкаВыбора = Ложь;
		ПолеВвода.Шрифт = ПараметрыУвеличенногоИнтерфейса.ШрифтСуммОплат;
		ПолеВвода.РастягиватьПоГоризонтали = Истина;
		ПолеВвода.Видимость = (Не ИмяРеквизитаВвода = "");
		
		КнопкаЗакрыть = Элементы.Добавить(ИмяКнопкиЗакрытия, Тип("КнопкаФормы"), ГруппаРодитель);
		КнопкаЗакрыть.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаЗакрыть.ИмяКоманды = "ЗакрытьУниверсальнаяКлавиатура";
		КнопкаЗакрыть.Шрифт = ШрифтыСтиля.ШрифтОбычныйПолужирныйРМК;
		КнопкаЗакрыть.Ширина = 8;
		КнопкаЗакрыть.Высота = 2;
		КнопкаЗакрыть.Картинка = БиблиотекаКартинок.ClosingX;
		КнопкаЗакрыть.Отображение = ОтображениеКнопки.Картинка;
		КнопкаЗакрыть.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		КнопкаЗакрыть.Шрифт = ШрифтыСтиля.ОченьКрупныйШрифтТекста;
		КнопкаЗакрыть.Видимость = КнопкаЗакрытия;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьКнопкуКлавиатуры(Форма, РодительКнопки, ДанныеКнопки, ПараметрыПостроения, ТекстОшибки)
	
	Элементы = Форма.Элементы;
	НоваяКнопка = Неопределено;
	РастягиватьПоШирине = ПолучитьЗначениеРастягиватьПоШирине(ПараметрыПостроения);
	ЦветКнопок = ПолучитьЗначениеЦветКнопок(ПараметрыПостроения);
	ШиринаКлавиши = ?(ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85(), 7, 8);
	
	Если ТекстОшибки = "" Тогда
		НоваяКнопка = Элементы.Найти(ДанныеКнопки.ИмяКнопки);
		Если НоваяКнопка = Неопределено Тогда
			
			НоваяКнопка = Элементы.Добавить(ДанныеКнопки.ИмяКнопки, Тип("КнопкаФормы"), РодительКнопки);
			НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			НоваяКнопка.ИмяКоманды = ДанныеКнопки.ИмяКоманды;
			НоваяКнопка.Заголовок = ДанныеКнопки.Заголовок;
			НоваяКнопка.Шрифт = ШрифтыСтиля.ОченьКрупныйШрифтТекста;
			НоваяКнопка.Ширина = ШиринаКлавиши;
			НоваяКнопка.РастягиватьПоВертикали = Истина;
			Если Не ЦветКнопок = Неопределено Тогда
				НоваяКнопка.ЦветФона = ЦветКнопок;
			КонецЕсли;
			
			Если РастягиватьПоШирине Тогда
				НоваяКнопка.РастягиватьПоГоризонтали = Истина;
			КонецЕсли;
			
		Иначе
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Элемент ""%1"" уже существует.'"), ДанныеКнопки.ИмяКнопки);
		КонецЕсли;
	КонецЕсли;
	Возврат НоваяКнопка;
	
КонецФункции

Функция ДобавитьГруппуКлавиатурыЦифроваяПанель(Форма, РодительГруппы, ПараметрыПостроения, ТекстОшибки)
	
	ИнтервалВертикальный = ИнтервалМеждуЭлементамиФормы.Нет;
	Если ПараметрыПостроения.Свойство("ИнтервалМеждуКлавишамиВертикальный") Тогда
		ИнтервалВертикальный = ПараметрыПостроения.ИнтервалМеждуКлавишамиВертикальный;
	КонецЕсли;
	РастягиватьПоШирине = ПолучитьЗначениеРастягиватьПоШирине(ПараметрыПостроения);
	
	НоваяГруппа = Неопределено;
	Элементы = Форма.Элементы;
	ИмяГруппы = "ЦифроваяПанельУниверсальнаяКлавиатура";
	
	Если ТекстОшибки = "" Тогда
		НоваяГруппа = Элементы.Найти(ИмяГруппы);
		Если НоваяГруппа = Неопределено Тогда
			НоваяГруппа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), РодительГруппы);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.РастягиватьПоГоризонтали = РастягиватьПоШирине;
			НоваяГруппа.РастягиватьПоВертикали = Ложь;
			НоваяГруппа.ВертикальныйИнтервал = ИнтервалВертикальный;
		Иначе
			ТекстОшибки = НСтр("ru = 'Группа ""ЦифроваяПанельУниверсальнаяКлавиатура"" уже существует.'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат НоваяГруппа;
	
КонецФункции

Функция ДобавитьГруппуКлавиатуры(Форма, РодительГруппы, ИмяГруппыНачало, ПараметрыПостроения, ТекстОшибки)
	
	НоваяГруппа = Неопределено;
	Элементы = Форма.Элементы;
	ИмяГруппы = СтрШаблон("%1УниверсальнаяКлавиатура", ИмяГруппыНачало);
	РастягиватьПоШирине = ПолучитьЗначениеРастягиватьПоШирине(ПараметрыПостроения);
	ИнтервалГоризонтальный = ИнтервалМеждуЭлементамиФормы.Нет;
	Если ПараметрыПостроения.Свойство("ИнтервалМеждуКлавишамиГоризонтальный") Тогда
		ИнтервалГоризонтальный = ПараметрыПостроения.ИнтервалМеждуКлавишамиГоризонтальный;
	КонецЕсли;
	ВысотаГруппы = ПолучитьЗначениеВысотыКлавиш(ПараметрыПостроения);
	
	Если ТекстОшибки = "" Тогда
		НоваяГруппа = Элементы.Найти(ИмяГруппы);
		Если НоваяГруппа = Неопределено Тогда
			НоваяГруппа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), РодительГруппы);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.РастягиватьПоГоризонтали = РастягиватьПоШирине;
			НоваяГруппа.РастягиватьПоВертикали = Ложь;
			НоваяГруппа.Гиперссылка = Истина;
			НоваяГруппа.ГоризонтальныйИнтервал = ИнтервалГоризонтальный;
			Если Не ИмяГруппыНачало = "ОбщийКонтейнер" Тогда
				НоваяГруппа.Высота = ВысотаГруппы;
			КонецЕсли;
		Иначе
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Группа ""%1"" уже существует.'"), ИмяГруппы);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НоваяГруппа;
	
КонецФункции

Функция ПолучитьЗначениеЦветКнопок(ПараметрыПостроения)
	
	РезультатФункции = Неопределено;
	Если ПараметрыПостроения.Свойство("ЦветКнопок") Тогда
		РезультатФункции = ПараметрыПостроения.ЦветКнопок;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьЗначениеРастягиватьПоШирине(ПараметрыПостроения)
	
	РезультатФункции = Ложь;
	Если ПараметрыПостроения.Свойство("РастягиватьПоШирине") Тогда
		РезультатФункции = ПараметрыПостроения.РастягиватьПоШирине;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьЗначениеВысотыКлавиш(ПараметрыПостроения)
	
	РезультатФункции = 3;
	Если ПараметрыПостроения.Свойство("УвеличеннаяВысота") И ПараметрыПостроения.УвеличеннаяВысота = Истина Тогда
		РезультатФункции = 4;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти

Процедура ДобавитьЭлементКонтроляПродажВДанныеКонтроля(НаборТаблиц, ДанныеКонтроляПродаж, КонтрольПродаж)

	ТаблицаКонтроляИСвойств = НаборТаблиц.ТаблицаКонтроляИСвойств;
	ТаблицаВидовКонтроляСПараметрами = НаборТаблиц.ТаблицаВидовКонтроляСПараметрами;
	ТаблицаСтрокКонтроля = НаборТаблиц.ТаблицаСтрокКонтроля;
	
	ОтборСтрокКонтроля = Новый Структура("КонтрольПродаж", КонтрольПродаж);
	СтрокаТаблицыКонтроляИСвойств = ТаблицаКонтроляИСвойств.Найти(КонтрольПродаж, "КонтрольПродаж");
	СтрокиКонтроляИзТаблицы = ТаблицаСтрокКонтроля.НайтиСтроки(ОтборСтрокКонтроля);
	Если СтрокиКонтроляИзТаблицы.Количество() > 0 И Не СтрокаТаблицыКонтроляИСвойств = Неопределено Тогда
		
		СтрокаЭлементаКонтроля = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонЭлементаКонтроляПродаж();
		СтрокаЭлементаКонтроля.КонтрольПродаж = КонтрольПродаж;
		СтрокаЭлементаКонтроля.НаименованиеГруппыТоваров = СтрокаТаблицыКонтроляИСвойств.НаименованиеГруппыТоваров;
		Для Каждого СтрокаКонтроляТаблицы Из СтрокиКонтроляИзТаблицы Цикл
			СтрокаКонтроляПродаж = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонСтрокиКонтроляПродаж();
			ЗаполнитьЗначенияСвойств(СтрокаКонтроляПродаж, СтрокаКонтроляТаблицы);
			
			СтрокаВидаКонтроля = ПолучитьСтрокуВидаКонтроля(ДанныеКонтроляПродаж.СтрокиВидовКонтроля,
				СтрокаКонтроляТаблицы.ВидКонтроля);
			Если СтрокаВидаКонтроля = Неопределено Тогда
				ДобавитьСтрокуВидаКонтроляВДанныеКонтроля(ТаблицаВидовКонтроляСПараметрами,
					ДанныеКонтроляПродаж.СтрокиВидовКонтроля, СтрокаКонтроляТаблицы.ВидКонтроля);
			КонецЕсли;
			
			СтрокаЭлементаКонтроля.СтрокиКонтроля.Добавить(СтрокаКонтроляПродаж);
		КонецЦикла;
		ДанныеКонтроляПродаж.ЭлементыКонтроляПродаж.Добавить(СтрокаЭлементаКонтроля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВидаКонтроляВДанныеКонтроля(ТаблицаВидовКонтроляСПараметрами, СтрокиВидовКонтроля, ВидКонтроля)
	
	СтрокаВидаКонтроляИзТаблицы = ТаблицаВидовКонтроляСПараметрами.Найти(ВидКонтроля, "ВидКонтроля");
	Если Не СтрокаВидаКонтроляИзТаблицы = Неопределено Тогда
		СтрокаВидаКонтроля = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонСтрокиВидаКонтроляПродаж();
		ЗаполнитьЗначенияСвойств(СтрокаВидаКонтроля, СтрокаВидаКонтроляИзТаблицы, , "ПараметрыКонтроля"); 
		Для Каждого ПараметрВидаКонтроля Из СтрокаВидаКонтроляИзТаблицы.ПараметрыКонтроля Цикл
			СтрокаПараметра = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонСтрокиПараметровВидаКонтроля();
			СтрокаПараметра.Параметр = ПараметрВидаКонтроля.Параметр;
			СтрокаПараметра.Значение = ПараметрВидаКонтроля.Значение;
			СтрокаВидаКонтроля.ПараметрыКонтроля.Добавить(СтрокаПараметра);
		КонецЦикла;
		СтрокиВидовКонтроля.Добавить(СтрокаВидаКонтроля);
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьКонтрольНоменклатурыПриНеобходимости(НоменклатураКонтроляПродаж, СтрокаКонтроляНоменклатуры)
	
	КонтрольДобавлен = Ложь;
	СтрокаНоменклатурыСКонтролем
		= ПолучитьСтрокуНоменклатурыСКонтролем(НоменклатураКонтроляПродаж, СтрокаКонтроляНоменклатуры);
	Если СтрокаНоменклатурыСКонтролем = Неопределено Тогда
		СтрокаНоменклатурыСКонтролем = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонСтрокиНоменклатурыКонтроляПродаж();
		СтрокаНоменклатурыСКонтролем.Номенклатура = СтрокаКонтроляНоменклатуры.Номенклатура;
		СтрокаНоменклатурыСКонтролем.Характеристика = СтрокаКонтроляНоменклатуры.Характеристика;
		НоменклатураКонтроляПродаж.Добавить(СтрокаНоменклатурыСКонтролем);
	КонецЕсли;
	Если СтрокаНоменклатурыСКонтролем.МассивКонтролейПродаж.Найти(СтрокаКонтроляНоменклатуры.КонтрольПродаж)
			= Неопределено Тогда
			
		СтрокаНоменклатурыСКонтролем.МассивКонтролейПродаж.Добавить(СтрокаКонтроляНоменклатуры.КонтрольПродаж);
		КонтрольДобавлен = Истина;
		
	КонецЕсли;
	
	Возврат КонтрольДобавлен;
	
КонецФункции

Функция ПолучитьСтрокуВидаКонтроля(СтрокиВидовКонтроля, ВидКонтроля)
	
	РезультатФункции = Неопределено;
	КоличествоСтрок = СтрокиВидовКонтроля.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаВидаКонтроля = СтрокиВидовКонтроля.Получить(ИндексСтроки);
		Если СтрокаВидаКонтроля.ВидКонтроля = ВидКонтроля Тогда
			РезультатФункции = СтрокаВидаКонтроля;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьСтрокуЭлементаКонтроляПродаж(ЭлементыКонтроляПродаж, КонтрольПродаж)
	
	РезультатФункции = Неопределено;
	КоличествоСтрок = ЭлементыКонтроляПродаж.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаЭлементаКонтроля = ЭлементыКонтроляПродаж.Получить(ИндексСтроки);
		Если СтрокаЭлементаКонтроля.КонтрольПродаж = КонтрольПродаж Тогда
			РезультатФункции = СтрокаЭлементаКонтроля;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьСтрокуНоменклатурыСКонтролем(НоменклатураКонтроляПродаж, СтрокаКонтроляНоменклатуры)
	
	РезультатФункции = Неопределено;
	КоличествоСтрок = НоменклатураКонтроляПродаж.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаНоменклатуры = НоменклатураКонтроляПродаж.Получить(ИндексСтроки);
		Если СтрокаНоменклатуры.Номенклатура = СтрокаКонтроляНоменклатуры.Номенклатура
				И СтрокаНоменклатуры.Характеристика = СтрокаКонтроляНоменклатуры.Характеристика Тогда
				
			РезультатФункции = СтрокаНоменклатуры;
				
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗаполнитьПервоначальныйПорядокОбластейФормыРМК(ГруппаФормыРМК, ДеревоПорядкаОбластей, ПараметрыЗаполнения)
	
	Для Каждого ОбластьФормы Из ГруппаФормыРМК.ПодчиненныеЭлементы Цикл
		
		ОбработатьОбластьФормы(ДеревоПорядкаОбластей.Строки, ОбластьФормы, ПараметрыЗаполнения);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СинонимГруппыПлиточногоИнтерфейса()
	
	Возврат НСтр("ru = 'Панель плиток'")
	
КонецФункции

Функция ЭтоГруппаПлиточногоИнтерфейса(ИмяОбласти, ПараметрыЗаполнения)
	
	МассивГруппПлитки = Новый Массив;
	МассивГруппПлитки.Добавить("ГруппаПанельИнформацииГор_Горизонтальная");
	МассивГруппПлитки.Добавить("ГруппаПанельИнформацииВер_Вертикальная");
	
	Возврат (ПараметрыЗаполнения.ПлиточныйИнтерфейс И Не МассивГруппПлитки.Найти(ИмяОбласти) = Неопределено);
	
КонецФункции

Процедура ОбработатьОбластьФормы(УровеньПорядкаОбластей, ТекущаяОбласть, ПараметрыЗаполнения)
	
	НачалоУдаленногоЭлемента = "ххх";
	Если СтрНайти(ТекущаяОбласть.Имя, НачалоУдаленногоЭлемента) <> 1 Тогда
		
		НоваяСтрокаОбласти = УровеньПорядкаОбластей.Добавить();
		НоваяСтрокаОбласти.ИмяОбласти = ТекущаяОбласть.Имя;
		НоваяСтрокаОбласти.ЗаголовокОбласти = ТекущаяОбласть.Заголовок;
		НоваяСтрокаОбласти.Группировка = ТекущаяОбласть.Группировка;
		НоваяСтрокаОбласти.Ширина = ТекущаяОбласть.Ширина;
		НоваяСтрокаОбласти.Высота = ТекущаяОбласть.Высота;
		НоваяСтрокаОбласти.ЦветОбласти = ТекущаяОбласть.ЦветФона;
		НоваяСтрокаОбласти.ДоступностьГруппы = ОпределитьДоступностьОбластиФормы(ТекущаяОбласть.Имя, ПараметрыЗаполнения);
		
		Если ЭтоГруппаПлиточногоИнтерфейса(ТекущаяОбласть.Имя, ПараметрыЗаполнения) Тогда
			НоваяСтрокаОбласти.ЗаголовокОбласти = СинонимГруппыПлиточногоИнтерфейса();
		Иначе
			Для Каждого ПодчиненнаяОбласть Из ТекущаяОбласть.ПодчиненныеЭлементы Цикл
				ОбработатьОбластьФормы(НоваяСтрокаОбласти.Строки, ПодчиненнаяОбласть, ПараметрыЗаполнения);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьДоступностьОбластиФормы(ИмяОбласти, ПараметрыЗаполнения)
	
	НачалоИмениПанелиИзбранных = "ПанельИзбранныхТоваров_";
	
	РезультатФункции = Истина;
	Если СтрНайти(ИмяОбласти, НачалоИмениПанелиИзбранных) = 1 Тогда
		РезультатФункции = ПараметрыЗаполнения.ПанельИзбранных;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗарегистрироватьАварийноеЗавершениеЧека(СтрокаВыборки)
	
	ПараметрыОперации = Новый Структура();
	
	ПараметрыОперации.Вставить("РабочееМесто", СтрокаВыборки.РабочееМесто);
	ПараметрыОперации.Вставить("ТорговыйОбъект", СтрокаВыборки.ТорговыйОбъект);
	ПараметрыОперации.Вставить("Кассир", СтрокаВыборки.Кассир);
	ПараметрыОперации.Вставить("ПользовательБД", СтрокаВыборки.Пользователь);
	ПараметрыОперации.Вставить("РегистрируемаяОперация",
		Перечисления.ОперацииРабочегоМестаКассира.АварийноеЗавершениеЧека);
	ПараметрыОперации.Вставить("НомерСеанса", СтрокаВыборки.НомерСеанса);
	ПараметрыОперации.Вставить("Чек", Неопределено);
	ПараметрыОперации.Вставить("Сумма", 0);
	
	РегистрыСведений.ЖурналДействийКассира.ЗарегистрироватьОперацию(ПараметрыОперации);
	
КонецПроцедуры

Функция НайтиАктивныйСеансПоНомеру(АктивныеСеансы, НомерСеанса)
	
	РезультатФункции = Неопределено;
	
	КоличествоСеансов = АктивныеСеансы.Количество();
	ИндексСеанса = 0;
	Пока ИндексСеанса < КоличествоСеансов И РезультатФункции = Неопределено Цикл
		ДанныеСеанса = АктивныеСеансы[ИндексСеанса];
		Если ДанныеСеанса.НомерСеанса = НомерСеанса Тогда
			РезультатФункции = ДанныеСеанса;
		КонецЕсли;
		ИндексСеанса = ИндексСеанса + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТекстЗапросаНеЗавершенныхДействийСЧеком()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЖурналДействийКассира.НомерСеанса КАК НомерСеанса,
	|	МАКСИМУМ(ЖурналДействийКассира.ДатаВремяОперации) КАК ДатаВремяОперации
	|ПОМЕСТИТЬ втПоследниеОперацииСеансов
	|ИЗ
	|	РегистрСведений.ЖурналДействийКассира КАК ЖурналДействийКассира
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналДействийКассира.НомерСеанса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПоследниеОперацииСеансов.НомерСеанса КАК НомерСеанса,
	|	ЖурналДействийКассира.ОперацияСЧеком КАК ОперацияСЧеком,
	|	ЖурналДействийКассира.РабочееМесто КАК РабочееМесто,
	|	ЖурналДействийКассира.ТорговыйОбъект КАК ТорговыйОбъект,
	|	ЖурналДействийКассира.Пользователь КАК Пользователь,
	|	ЖурналДействийКассира.Кассир КАК Кассир
	|ИЗ
	|	втПоследниеОперацииСеансов КАК втПоследниеОперацииСеансов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналДействийКассира КАК ЖурналДействийКассира
	|		ПО втПоследниеОперацииСеансов.НомерСеанса = ЖурналДействийКассира.НомерСеанса
	|			И втПоследниеОперацииСеансов.ДатаВремяОперации = ЖурналДействийКассира.ДатаВремяОперации
	|ГДЕ
	|	ЖурналДействийКассира.ОперацияСЧеком В(&НачальныеОперацииСЧеком)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЕстьВесовойТоварВОпорныхДанных(ОпорныеДанные)
	
	РезультатФункции = Ложь;
	
	КоличествоПозиций = ОпорныеДанные.Количество();
	ИндексПозиции = 0;
	Пока ИндексПозиции < КоличествоПозиций И Не РезультатФункции Цикл
		СтрокаОпорныхДанных = ОпорныеДанные.Получить(ИндексПозиции);
		Если СтрокаОпорныхДанных.Весовой Тогда
			РезультатФункции = Истина;
		КонецЕсли;
		ИндексПозиции = ИндексПозиции + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УстановитьУвеличенныйШрифтПолей(Элементы, ПараметрыУвеличенногоИнтерфейса, ПараметрыПолей)
	
	Шрифт = ПараметрыУвеличенногоИнтерфейса.Шрифт;
	
	Элементы.ВводТовараПоСтроке.Шрифт = Шрифт;
	Элементы.ЗначениеСкидкиНаЧек.Шрифт = Шрифт;
	Элементы.КомандаРежим.Шрифт = Шрифт;
	Элементы.ОтборВесовоготовара.Шрифт = Шрифт;
	
	Если ПараметрыПолей.ШрифтыПолей.Получить(Элементы.ТекущийТоварЦенаИзКарточки.Имя) = Неопределено Тогда
		Элементы.ТекущийТоварЦенаИзКарточки.Шрифт = Шрифт;
	КонецЕсли;
	Если ПараметрыПолей.ШрифтыПолей.Получить(Элементы.ТекущийТоварКоличество.Имя) = Неопределено Тогда
		Элементы.ТекущийТоварКоличество.Шрифт = Шрифт;
		Элементы.ТекущийТоварКоличествоСобрано.Шрифт = Шрифт;
	КонецЕсли;
	Если ПараметрыПолей.ШрифтыПолей.Получить(Элементы.ТекущийТоварСкидка.Имя) = Неопределено Тогда
		Элементы.ТекущийТоварСкидка.Шрифт = Шрифт;
	КонецЕсли;
	
	Если ПараметрыПолей.ШрифтыПолей.Получить(Элементы.ТекущийТоварСкидкаПереключатель.Имя) = Неопределено Тогда
		Элементы.ТекущийТоварСкидкаПереключатель.Шрифт = Шрифт;
	КонецЕсли;
	
	Если ПараметрыПолей.ШрифтыПолей.Получить(Элементы.СкидкиНаЧекСкидкаПереключатель.Имя) = Неопределено Тогда
		Элементы.СкидкиНаЧекСкидкаПереключатель.Шрифт = Шрифт;
	КонецЕсли;
	
	Если ПараметрыПолей.ШрифтыПолей.Получить(Элементы.ПереключательДействующиеСкидки.Имя) = Неопределено Тогда
		Элементы.ПереключательДействующиеСкидки.Шрифт = Шрифт;
	КонецЕсли;
	
	Элементы.ДополнениеСтрокаПоиска.Шрифт = Шрифт;
	Элементы.ДополнениеДополнительнаяСтрокаПоиска.Шрифт = Шрифт;
	
	Элементы.ОтправкаЧекаПочта.Шрифт = Шрифт;
	Элементы.ОтправкаЧекаТелефон.Шрифт = Шрифт;
	Элементы.ПродавецТекущейСтроки.Шрифт = Шрифт;
	Элементы.СкладТекущейСтроки.Шрифт = Шрифт;
	Элементы.ЯчейкаТекущейСтроки.Шрифт = Шрифт;
	Элементы.ПродавецТекущейСтрокиВПлитке.Шрифт = Шрифт;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыГруппВерхнегоУровня(Элементы, ПараметрыЭлементов)
	
	ГоризонтальнаяГруппировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ВертикальнаяГруппировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаУправленияЧекомГор, Неопределено,
		Элементы.ГруппаУправленияЧекомВер, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСлоевПанелиУправления, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ВертикальнаяГруппировка, ГоризонтальнаяГруппировка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Неопределено);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПанельУправленияЧеком);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ВертикальнаяГруппировка, ГоризонтальнаяГруппировка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ОтображатьКакКарточку", Ложь, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПраваяКолонкаУправленияЧеком);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 24);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДанныеИтоговЧекаВер);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаКнопокЛояльности);
	//ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ОтображатьКакКарточку", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаСуммИУправленияЧеком);
	//ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ОтображатьКакКарточку", Истина, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыГруппСлоев(Элементы, ПараметрыЭлементов)

	ПараметрыРазмеров = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыРазмеровИнтерфейса();
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ВводИнформацииИтоговЧекаГор, Элементы.ГруппаЦифроваяПанель,
		Элементы.ЛеваяСредняяКолонкиУправленияЧеком, Элементы.ГруппаСлоевДополнительнаяКоманднаяПанель);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСлоевСлужебнаяИнформацияЧека, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.СводнаяПанельИтоговЧекаГор,
		Неопределено, Элементы.КолонкаЛояльности, Элементы.ГруппаЦифроваяПанель);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПанельИтоговПоЧекам, ОписаниеРасположения);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОбластьОперативногоУправленияЧеком);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСлоевЛеваяВерхняяВспомогательнаяПанель);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаВидовОплат);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСводныеДанныеЧека);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовКоманднойПанели(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКомандПродолженияПослеПробитияДополнительно);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКомандВозвратИзПробитияЧека);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВернутьсяВРежимПодбораТовара);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 18);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыГруппыИтог(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СуммаБезСкидок);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 15, 14);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СуммаИтого);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 17, 16);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыГруппыОсновныхКоманд(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКомандПродолженияПослеПробития);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Авто);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПродолжитьПослеПробитияЧека);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 24);
	
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Центр);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 24);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовЛояльности(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОписаниеНайденнойСкидки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВысотаЗаголовка", 0, 2);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыОплаты(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОтсутQRCode);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаQRCodeКарта);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 5);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаQRCodeНаличные);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 5);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаQRCodeСБП);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 5);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаКомандКОплате);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 3, 5);
	//ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаQRCode);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 24);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаКомандПереходаКОплате,
		Элементы.ГруппаКомандСозданияЗаказа, Элементы.КолонкаБыстрыхОплат, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаДополнительногоУправленияОплат, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 24);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОсновнаяКоманднаяПанельУправленияЧеком);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовСпискаТоваровПлитки(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПлиткаГруппаИтого);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.СуммаИтогоПлитка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Низ, ВертикальноеПоложениеЭлемента.Верх);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПлиткаГруппаДанные);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаЛево, Неопределено,
		Элементы.ПлиткаПанельИтоговВер, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПлиткаГруппаНиз, ОписаниеРасположения);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаЛево, Элементы.ПлиткаГруппаНиз,
		Элементы.ПлиткаТаблицаТоваровВер, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.НастраиваемаяПанельЛево, ОписаниеРасположения);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаЛево, Элементы.НастраиваемаяПанельЛево,
		Элементы.ПлиткаТаблицаТоваровВер, Элементы.НастраиваемаяПанельЛево);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПлиткаГруппаИнфо, ОписаниеРасположения);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПерейтиВОплату);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаОкончаниеЧекаВПлитке);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовСложнойОплаты(Элементы, ПараметрыЭлементов)
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.УправлениеЧекомСложнойОплаты,
		Неопределено, Элементы.СтраницаСложнойОплаты, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.КомандыПробитияСложнойОплаты, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 8, 3);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Право);
	
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВернутьсяВРежимПодбораТовараСложнойОплаты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 20);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПробитьЧекСложнойОплаты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 20);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКомандыОтменыВозврата);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 20);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Центр);
	
КонецПроцедуры

Функция ПолучитьПараметрыЭлементовПанелиУправленияЧеком(Форма)
	
	Элементы = Форма.Элементы;
	ПараметрыЭлементов = Новый Массив;
	
	ЗаполнитьПараметрыГруппВерхнегоУровня(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыГруппСлоев(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовКоманднойПанели(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыГруппыИтог(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыГруппыОсновныхКоманд(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовЛояльности(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыОплаты(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовСпискаТоваровПлитки(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовСложнойОплаты(Элементы, ПараметрыЭлементов);
	
	Возврат ПараметрыЭлементов;
	
КонецФункции

Функция ОписаниеРасположенияЭлемента(РодительскийЭлементГоризонтально, 
		СледующийЭлементГоризонтально,
		РодительскийЭлементВертикально,
		СледующийЭлементВертикально)
	
	РезультатФункции = Новый Структура("РодительскийЭлементГоризонтально,СледующийЭлементГоризонтально,
		|РодительскийЭлементВертикально,СледующийЭлементВертикально");
	РезультатФункции.Вставить("РодительскийЭлементГоризонтально", РодительскийЭлементГоризонтально);
	РезультатФункции.Вставить("СледующийЭлементГоризонтально", СледующийЭлементГоризонтально);
	РезультатФункции.Вставить("РодительскийЭлементВертикально", РодительскийЭлементВертикально);
	РезультатФункции.Вставить("СледующийЭлементВертикально", СледующийЭлементВертикально);
	Возврат РезультатФункции;
	
КонецФункции

Функция ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
				ЭлементФормы,
				ОписаниеРасположенияЭлемента = Неопределено)
				
	ДанныеЭлемента = Новый Структура("ЭлементФормы,РодительскийЭлементГоризонтально,СледующийЭлементГоризонтально,
		|РодительскийЭлементВертикально,СледующийЭлементВертикально,ИзменяемыеСвойства");
	ДанныеЭлемента.ЭлементФормы 					= ЭлементФормы;
	Если Не ОписаниеРасположенияЭлемента = Неопределено Тогда
		ДанныеЭлемента.РодительскийЭлементГоризонтально = ОписаниеРасположенияЭлемента.РодительскийЭлементГоризонтально;
		ДанныеЭлемента.СледующийЭлементГоризонтально 	= ОписаниеРасположенияЭлемента.СледующийЭлементГоризонтально;
		ДанныеЭлемента.РодительскийЭлементВертикально 	= ОписаниеРасположенияЭлемента.РодительскийЭлементВертикально;
		ДанныеЭлемента.СледующийЭлементВертикально		= ОписаниеРасположенияЭлемента.СледующийЭлементВертикально;
	КонецЕсли;
	ДанныеЭлемента.ИзменяемыеСвойства 				= Новый Массив;
	ПараметрыЭлементов.Добавить(ДанныеЭлемента);
	
	Возврат ДанныеЭлемента;
	
КонецФункции

Процедура ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, ИмяСвойства,
	ЗначениеГоризонтально, ЗначениеВертикально)
	
	СтрокаИзменяемогоСвойства = Новый Структура("ИмяСвойства,ЗначениеГоризонтально,ЗначениеВертикально");
	СтрокаИзменяемогоСвойства.ИмяСвойства = ИмяСвойства;
	СтрокаИзменяемогоСвойства.ЗначениеГоризонтально = ЗначениеГоризонтально;
	СтрокаИзменяемогоСвойства.ЗначениеВертикально = ЗначениеВертикально;
	ДанныеЭлемента.ИзменяемыеСвойства.Добавить(СтрокаИзменяемогоСвойства);
	
КонецПроцедуры

Процедура МодифицироватьЭлементФормы(Элементы, ДанныеЭлемента, ВертикальнаяОриентация)

	УстанавливаемыйРодитель = ?(ВертикальнаяОриентация,
								ДанныеЭлемента.РодительскийЭлементВертикально,
								ДанныеЭлемента.РодительскийЭлементГоризонтально);
	Если Не УстанавливаемыйРодитель = Неопределено Тогда
		
		Если Не (ДанныеЭлемента.РодительскийЭлементГоризонтально = ДанныеЭлемента.РодительскийЭлементВертикально
			И ДанныеЭлемента.СледующийЭлементГоризонтально = ДанныеЭлемента.СледующийЭлементВертикально) Тогда
			
			СледующийЭлемент = ?(ВертикальнаяОриентация,
								ДанныеЭлемента.СледующийЭлементВертикально,
								ДанныеЭлемента.СледующийЭлементГоризонтально);
			Элементы.Переместить(ДанныеЭлемента.ЭлементФормы, УстанавливаемыйРодитель, СледующийЭлемент);
			
		КонецЕсли;
	КонецЕсли;
	Для Каждого СтрокаСвойства Из ДанныеЭлемента.ИзменяемыеСвойства Цикл
		УстанавливаемоеСвойство = ?(ВертикальнаяОриентация,
									СтрокаСвойства.ЗначениеВертикально,
									СтрокаСвойства.ЗначениеГоризонтально);
		ДанныеЭлемента.ЭлементФормы[СтрокаСвойства.ИмяСвойства] = УстанавливаемоеСвойство;
	КонецЦикла;
	
КонецПроцедуры

Процедура УвеличитьРазмерПоляГруппыОплат(ЭлементПоле, ПараметрыУвеличенногоИнтерфейса, ПараметрыПолей)
	
	Если Не ЗначениеЗаполнено(ПараметрыПолей.ШиринаПолейОплат) Тогда
		Если ЭлементПоле.Имя = "ЭквайринговыйТерминалВыполненияОперации" Тогда
		ИначеЕсли ЭлементПоле.Имя = "СуммаОплаченоСБП" Или ЭлементПоле.Имя = "СуммаОплаченоЮКасса" Тогда
			ЭлементПоле.Ширина = ПараметрыУвеличенногоИнтерфейса.ШиринаПоля - 1;
		ИначеЕсли ЭлементПоле.Вид = ВидПоляФормы.ПолеНадписи Тогда
			ЭлементПоле.Ширина = ПараметрыУвеличенногоИнтерфейса.ШиринаПоля + 1;
		Иначе
			ЭлементПоле.Ширина = ПараметрыУвеличенногоИнтерфейса.ШиринаПоля;
		КонецЕсли;
	КонецЕсли;
	Если ПараметрыПолей.ШрифтыПолей.Получить(ЭлементПоле.Имя) = Неопределено Тогда
		ЭлементПоле.Шрифт = ПараметрыУвеличенногоИнтерфейса.ШрифтСуммОплат;
	КонецЕсли;
	
КонецПроцедуры

Процедура УвеличитьРазмерПолейОплат(РодительскийЭлемент, ПараметрыУвеличенногоИнтерфейса, ПараметрыПолей)
	
	Для Каждого ЭлементГруппыОплат Из РодительскийЭлемент.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ЭлементГруппыОплат) = Тип("ГруппаФормы") Тогда
			УвеличитьРазмерПолейОплат(ЭлементГруппыОплат, ПараметрыУвеличенногоИнтерфейса, ПараметрыПолей);
		ИначеЕсли ТипЗнч(ЭлементГруппыОплат) = Тип("ПолеФормы") Или ТипЗнч(ЭлементГруппыОплат) = Тип("ПолеНадписиФормы") Тогда
			УвеличитьРазмерПоляГруппыОплат(ЭлементГруппыОплат, ПараметрыУвеличенногоИнтерфейса, ПараметрыПолей);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция НавигационнаяСсылкаИзображения(ДанныеИзображения, ИдентификаторФормы)

	УстановитьПривилегированныйРежим(Истина);
	Возврат РаботаСФайлами.ДанныеФайла(ДанныеИзображения, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;

КонецФункции

Процедура УстановитьУсловноеОформлениеФормыРМК(ФормаРМК)
	
	// Оплаченные товары
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.Товары.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ТоварыОплачена.ПутьКДанным, Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ФормаРМК.ЦветаФормы.ЗеленаяКнопка);
	
	// Оплата недоступна
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.Товары.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ТоварыОплатаНедоступна.ПутьКДанным, Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ФормаРМК.ЦветаФормы.КраснаяКнопка);
	
	// Замена товара
	Если ФормаРМК.ИспользоватьЗаменуТоваров Тогда
		Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.Товары.Имя);
		ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ТоварыТоварКЗамене.ПутьКДанным, Истина);
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ФормаРМК.ЦветаФормы.ФонРежимаВозврат);
		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	КонецЕсли;
	
	// Товары сверх заказа
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.Товары.Имя);
	ГруппаОтбораЭлементаВерхнегоУровня = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораЭлементаВерхнегоУровня.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаказПокупателя");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЗаказПокупателя");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВыделятьСтрокуСверхЗаказа");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ФормаРМК.ЦветаФормы.ТекстСверхЗаказа);
	
	// Сборка заказа при отгрузке
	Если ФормаРМК.ИспользоватьСборкуЗаказовПриОтгрузке Тогда
		Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТоварыКоличествоСобрано.Имя);
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТекущийТоварКоличествоСобрано.Имя);
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.Красный);
		
		Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТоварыКоличествоСобрано.Имя);
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТекущийТоварКоличествоСобрано.Имя);
		ГруппаОтбораЭлементаВерхнегоУровня = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораЭлементаВерхнегоУровня.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоСобрано");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Количество");
		ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЗаказПокупателя");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.Зеленый);
		
		Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТоварыКоличествоСобрано.Имя);
		ГруппаОтбораЭлементаВерхнегоУровня = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораЭлементаВерхнегоУровня.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЗаказПокупателя");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", " ");
		
		Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТекущийТоварКоличествоСобрано.Имя);
		ГруппаОтбораЭлементаВерхнегоУровня = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораЭлементаВерхнегоУровня.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЗаказПокупателя");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветФонаПоля);
		Элемент.Оформление.УстановитьЗначениеПараметра("Цветфона", ЦветаСтиля.ЦветФонаПоля);
	КонецЕсли;
	
	// Товары без скидок и бонусов
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТоварыСуммаСкидокОбщая.Имя);
	
	ГруппаОтбораЭлементаВерхнегоУровня = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораЭлементаВерхнегоУровня.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ГруппаЗапретОплатыБонусамиИлиПодарок
		= ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЗапретОплатыБонусамиИлиПодарок.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(ГруппаЗапретОплатыБонусамиИлиПодарок,
		"Объект.Товары.ЗапретОплатыБонусамиСкидками", Истина);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(ГруппаЗапретОплатыБонусамиИлиПодарок,
		"Объект.Товары.Подарок", Истина);
	
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(ГруппаОтбораЭлементаВерхнегоУровня,
		"Объект.Товары.СуммаСкидокОбщая", 0);
	
	ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БонусыДоступноКОплате");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("Формат", НСтр("ru='ЧН=0.00'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
	
	// Остатки товаров в корзине РМК
	Если ЗначениеЗаполнено(ФормаРМК.Объект.ТорговыйОбъект) Тогда
		Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТаблицаОстатков.Имя);
		ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ТаблицаОстатковМестоХранения.ПутьКДанным, Строка(ФормаРМК.Объект.ТорговыйОбъект));
		Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
	КонецЕсли;
	
	// Дерево скидок
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ДеревоСкидок.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ДеревоСкидокУровень.ПутьКДанным, 0);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
	
	// Дерево действующих скидок
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ДеревоДействующихСкидок.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ДеревоДействующихСкидокУровень.ПутьКДанным, 1);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
	
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ДеревоДействующихСкидок.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ДеревоДействующихСкидокУровень.ПутьКДанным, 2);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйНаклонный12РМК);
	
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ДеревоСкидокУниверсальнаяКоманда.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, "ДеревоСкидок.ЭтоУправляемаяСкидка", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Картинка", БиблиотекаКартинок.ОформлениеКрест);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Нстр("ru = 'удалить скидку'"));

	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ДеревоСкидокУниверсальнаяКоманда.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, "ДеревоСкидок.МожноДобавитьУправляемуюСкидку", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Картинка", БиблиотекаКартинок.СоздатьЭлементСписка);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Нстр("ru = 'добавить скидку'"));

	// Отбор группа
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ОтборГруппа.Имя);
	ЭлементОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтборГруппа.Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("НастройкаКаталогаТекущаяГруппа");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаРежимаПродажиРМК);
	
	// Отбор категории
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ОтборКатегория.Имя);
	ЭлементОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтборКатегория.Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("НастройкаКаталогаТекущаяКатегория");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаРежимаПродажиРМК);
	
	// Объединенная строка номенклатуры в каталоге
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.СписокТоваров.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.СписокТоваровВидСтроки.ПутьКДанным, 1);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветАктивнойКнопкиРМК);

	// Сумма баллов к начислению в карточке
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ИмяРеквизита = ФормаРМК.Элементы.БудетНачислено.ПутьКДанным;
	ИмяЭлемента = ФормаРМК.Элементы.БудетНачислено.Имя;
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ИмяРеквизита, 0);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Сумма баллов будет списано
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ИмяРеквизита = ФормаРМК.Элементы.БудетСписано.ПутьКДанным;
	ИмяЭлемента = ФормаРМК.Элементы.БудетСписано.Имя;
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ИмяРеквизита, 0);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Не отображать информацию о баллах, если ДК не заполнена
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ИмяРеквизита = "ВведенаБонуснаяКарта";
	ИмяЭлемента = ФормаРМК.Элементы.КоличествоБонусовВКарточке.Имя;
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ИмяРеквизита, Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Курсивом в списке товаров отображать код и артикул
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТоварыПредставлениеКодАртикул.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТоварыМиниСписокКодАртикул.Имя);
	ГруппаОтбораЭлементов = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораЭлементов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ЭлементОтбора = ГруппаОтбораЭлементов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Код");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементОтбора = ГруппаОтбораЭлементов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Артикул");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйНаклонный10РМК);
	
КонецПроцедуры

Функция СоответствиеНоминаловЦветам()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("10", ЦветаПалитры.Серый);
	Результат.Вставить("50", ЦветаПалитры.Голубой);
	Результат.Вставить("100", ЦветаПалитры.Желтый);
	Результат.Вставить("200", ЦветаПалитры.ЗеленыйСветлоТусклыйРМК);
	Результат.Вставить("500", ЦветаПалитры.Фиолетовый);
	Результат.Вставить("1000", ЦветаПалитры.Зеленый);
	Результат.Вставить("2000", ЦветаПалитры.ГолубойОсветленныйРМК);
	Результат.Вставить("5000", ЦветаПалитры.Оранжевый);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьКупюруНаПанельВводаНаличных(Элементы, Команды, ГруппаРядКупюр, ДанныеКупюры, РежимКлавиатуры = Ложь)
	
	Номинал = ДанныеКупюры.НоминалКупюры;
	
	ИмяГруппыКупюры = "ГруппаКупюры" + Номинал;
	Если НЕ Элементы.Найти(ИмяГруппыКупюры) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяГруппаКупюры = Элементы.Добавить(ИмяГруппыКупюры, Тип("ГруппаФормы"), ГруппаРядКупюр);
	НоваяГруппаКупюры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаКупюры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппаКупюры.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	НоваяГруппаКупюры.ОтображатьЗаголовок = Ложь;
	НоваяГруппаКупюры.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппаКупюры.Высота = ?(РежимКлавиатуры, 5, 0);
	
	ИмяКоманды = "ВыборКупюры" + Номинал;
	НоваяКоманда = Команды.Найти(ИмяКоманды);
	Если НоваяКоманда = Неопределено Тогда
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = "Подключаемый_ВыбратьКупюру";
		Если Не ДанныеКупюры.ГорячаяКлавиша = Неопределено Тогда
			НоваяКоманда.СочетаниеКлавиш = ДанныеКупюры.ГорячаяКлавиша;
		КонецЕсли;
	КонецЕсли;
	
	ИмяКнопкиКупюры = "Купюра" + Номинал;
	КнопкаКупюры = Элементы.Добавить(ИмяКнопкиКупюры, Тип("КнопкаФормы"), НоваяГруппаКупюры);
	КнопкаКупюры.ИмяКоманды = ИмяКоманды;
	Если Номинал = "0" Тогда
		КнопкаКупюры.Заголовок = "X";
	Иначе
		КнопкаКупюры.Заголовок = Номинал;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеКупюры.ЦветФона) Тогда
		КнопкаКупюры.ЦветФона = ДанныеКупюры.ЦветФона;
	КонецЕсли;
	КнопкаКупюры.Ширина = 8;
	КнопкаКупюры.РастягиватьПоГоризонтали = Истина;
	КнопкаКупюры.РастягиватьПоВертикали = Истина;
	КнопкаКупюры.Отображение = ОтображениеКнопки.Текст;
	
КонецПроцедуры

Функция ДобавитьРядКнопок(Форма, РодительскийЭлемент, ИндексРяда, ПараметрыПостроения, ГорячиеКлавиши)
	
	Элементы = Форма.Элементы;
	
	ИмяРяда = СтрШаблон("РядКнопок_%1", ИндексРяда);
	НовыйРяд = Элементы.Найти(ИмяРяда);
	Если НовыйРяд = Неопределено Тогда
		НовыйРяд = Элементы.Добавить(ИмяРяда, Тип("ГруппаФормы"), РодительскийЭлемент);
	КонецЕсли;
	НовыйРяд.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
	НовыйРяд.ГоризонтальноеПоложениеПодчиненных	= ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйРяд.Группировка						= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйРяд.ОтображатьЗаголовок 				= Ложь;
	НовыйРяд.Отображение						= ОтображениеОбычнойГруппы.Нет;
	НовыйРяд.РастягиватьПоГоризонтали			= Истина;
	НовыйРяд.РастягиватьПоВертикали				= Ложь;
	НовыйРяд.ГоризонтальныйИнтервал 			= ИнтервалМеждуЭлементамиФормы.Половинный;
	
	КоличествоКнопокВРяду = 4;
	Для Счт = 1 По КоличествоКнопокВРяду Цикл
		
		НомерКарточки = КоличествоКнопокВРяду * (ИндексРяда - 1) + Счт;
		ДобавитьКнопкуВРяд(Форма, НовыйРяд, НомерКарточки, ГорячиеКлавиши, ПараметрыПостроения);
		
	КонецЦикла;
	Возврат НовыйРяд;
	
КонецФункции

Процедура ДобавитьКнопкуВРяд(Форма, РядКнопок, ИндексКнопки, ГорячиеКлавиши, ПараметрыПостроения)
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	СочетаниеКлавиш = Неопределено;
	Если Не ГорячиеКлавиши = Неопределено Тогда
		Если (ГорячиеКлавиши.Alt ИЛИ ГорячиеКлавиши.Shift ИЛИ ГорячиеКлавиши.Ctrl) И ИндексКнопки < 10 Тогда
			
			ИмяКлавиши = СтрШаблон("_%1", (ИндексКнопки));
			ДополнительнаяКлавиша = Клавиша[ИмяКлавиши];
			
			СочетаниеКлавиш = Новый СочетаниеКлавиш(ДополнительнаяКлавиша,
				ГорячиеКлавиши.Alt, ГорячиеКлавиши.Ctrl, ГорячиеКлавиши.Shift);
		КонецЕсли;
	КонецЕсли;
	
	ЭлементыФормы = Форма.Элементы;
	
	ИмяЭлемента = СтрШаблон("КонтейнерИзбранное_%1", ИндексКнопки);
	КонтейнерПлитки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), РядКнопок);
	КонтейнерПлитки.Вид = ВидГруппыФормы.Страницы;
	КонтейнерПлитки.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонтейнерПлитки.РастягиватьПоВертикали = Ложь;
	
	ИмяЭлемента = СтрШаблон("СтраницаИзбранноеПустоеМесто_%1", ИндексКнопки);
	СтраницаКонтейнера = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), КонтейнерПлитки);
	СтраницаКонтейнера.Вид = ВидГруппыФормы.Страница;
	СтраницаКонтейнера.ОтображатьЗаголовок = Ложь;
	
	БезРамки = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	ИмяЭлемента = СтрШаблон("ДекорацияИзбранноеПустоеМесто_%1", ИндексКнопки);
	ИзображениеИзбранного = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), СтраницаКонтейнера);
	ИзображениеИзбранного.Вид = ВидПоляФормы.ПолеКартинки;
	ИзображениеИзбранного.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ИзображениеИзбранного.Рамка = БезРамки;
	ИзображениеИзбранного.ПутьКДанным = "ПустаяКартинка";
	ИзображениеИзбранного.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	ИзображениеИзбранного.Ширина = 17;
	ИзображениеИзбранного.Высота = 1;
	ИзображениеИзбранного.АвтоМаксимальнаяВысота = Истина;
	ИзображениеИзбранного.АвтоМаксимальнаяШирина = Ложь;
	ИзображениеИзбранного.РастягиватьПоВертикали = Истина;
	ИзображениеИзбранного.РастягиватьПоГоризонтали = Истина;
	
	ИмяЭлемента = СтрШаблон("СтраницаСодержимоеИзбранного_%1", ИндексКнопки);
	СтраницаКонтейнера = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), КонтейнерПлитки);
	СтраницаКонтейнера.Вид = ВидГруппыФормы.Страница;
	СтраницаКонтейнера.ОтображатьЗаголовок = Ложь;
	
	ИмяЭлемента = СтрШаблон("КарточкаИзбранного_%1", ИндексКнопки);
	ПлиткаИзбранного = ДобавитьГруппуКарточку(ЭлементыФормы, СтраницаКонтейнера, ИмяЭлемента,
		ПараметрыПостроения.ИмяКомандыНажатия);
	ПлиткаИзбранного.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ПлиткаИзбранного.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	ПлиткаИзбранного.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ПлиткаИзбранного.Ширина = 34;
	ПлиткаИзбранного.РастягиватьПоГоризонтали = Истина;
	
	ЗаполнитьКарточкуИзбранного(Форма, ПлиткаИзбранного, ИндексКнопки, СочетаниеКлавиш, ПараметрыПостроения);
	
	Если ИндексКнопки = 8 Тогда
		
		ДобавитьСтраницуНавигацииИзбранного(Форма, КонтейнерПлитки, ГорячиеКлавиши);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКарточкуИзбранного(Форма, ПлиткаИзбранного, ИндексКнопки, СочетаниеКлавиш, ПараметрыПостроения)
	
	ЭлементыФормы = Форма.Элементы;
	ИндексДанных = ИндексКнопки - 1;
	
	ИмяЭлемента = СтрШаблон("СтраницыДанныхИзбранного_%1", ИндексКнопки);
	СтраницыИзбранного = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ПлиткаИзбранного);
	СтраницыИзбранного.Вид = ВидГруппыФормы.Страницы;
	СтраницыИзбранного.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;

	ИмяЭлемента = СтрШаблон("СтраницаИзбранногоЭлементКартинка_%1", ИндексКнопки);
	СтраницаЭлемента = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыИзбранного);
	СтраницаЭлемента.Вид = ВидГруппыФормы.Страница;
	СтраницаЭлемента.ОтображатьЗаголовок = Ложь;
	СтраницаЭлемента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СтраницаЭлемента.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	СтраницаЭлемента.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	СтраницаЭлемента.РастягиватьПоВертикали = Истина;
	СтраницаЭлемента.РастягиватьПоГоризонтали = Истина;
	
	ПараметрыПостроения.Вставить("ЕстьКартинка", Истина);
	ЗаполнитьСтраницуЭлементаИзбранного(Форма, СтраницаЭлемента, ИндексКнопки, СочетаниеКлавиш, ПараметрыПостроения);
	
	ИмяЭлемента = СтрШаблон("СтраницаИзбранногоЭлемент_%1", ИндексКнопки);
	СтраницаЭлемента = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыИзбранного);
	СтраницаЭлемента.Вид = ВидГруппыФормы.Страница;
	СтраницаЭлемента.ОтображатьЗаголовок = Ложь;
	СтраницаЭлемента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СтраницаЭлемента.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	СтраницаЭлемента.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	СтраницаЭлемента.РастягиватьПоВертикали = Истина;
	СтраницаЭлемента.РастягиватьПоГоризонтали = Истина;
	
	ПараметрыПостроения.Вставить("ЕстьКартинка", Ложь);
	ЗаполнитьСтраницуЭлементаИзбранного(Форма, СтраницаЭлемента, ИндексКнопки, СочетаниеКлавиш, ПараметрыПостроения);
	
	ИмяЭлемента = СтрШаблон("СтраницаИзбранногоГруппаКартинка_%1", ИндексКнопки);
	СтраницаГруппы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыИзбранного);
	СтраницаГруппы.Вид = ВидГруппыФормы.Страница;
	СтраницаГруппы.ОтображатьЗаголовок = Ложь;
	СтраницаГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СтраницаГруппы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	СтраницаГруппы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	СтраницаГруппы.РастягиватьПоВертикали = Истина;
	СтраницаГруппы.РастягиватьПоГоризонтали = Истина;
	
	ПараметрыПостроения.Вставить("ЕстьКартинка", Истина);
	ЗаполнитьСтраницуГруппыИзбранного(Форма, СтраницаГруппы, ИндексКнопки, СочетаниеКлавиш, ПараметрыПостроения);
	
	ИмяЭлемента = СтрШаблон("СтраницаИзбранногоГруппа_%1", ИндексКнопки);
	СтраницаГруппы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыИзбранного);
	СтраницаГруппы.Вид = ВидГруппыФормы.Страница;
	СтраницаГруппы.ОтображатьЗаголовок = Ложь;
	СтраницаГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СтраницаГруппы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	СтраницаГруппы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	СтраницаГруппы.РастягиватьПоВертикали = Истина;
	СтраницаГруппы.РастягиватьПоГоризонтали = Истина;
	
	ПараметрыПостроения.Вставить("ЕстьКартинка", Ложь);
	ЗаполнитьСтраницуГруппыИзбранного(Форма, СтраницаГруппы, ИндексКнопки, СочетаниеКлавиш, ПараметрыПостроения);
	
	Если Не СочетаниеКлавиш = Неопределено Тогда
	
		ИмяЭлемента = СтрШаблон("СтраницаИзбранногоКнопка_%1", ИндексКнопки);
		СтраницаКнопки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыИзбранного);
		СтраницаКнопки.Вид = ВидГруппыФормы.Страница;
		СтраницаКнопки.ОтображатьЗаголовок = Истина;
		
		ИмяКоманды = СтрШаблон("ИзбранноеВыбор_%1", ИндексКнопки);
		НоваяКоманда = Форма.Команды.Найти(ИмяКоманды);
		Если НоваяКоманда = Неопределено Тогда
			НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие = ПараметрыПостроения.ИмяКомандыГорячейКлавиши;
		КонецЕсли;
		НоваяКоманда.СочетаниеКлавиш = СочетаниеКлавиш;
		
		ИмяЭлемента = СтрШаблон("ИзбранноеКнопка_%1", ИндексКнопки);
		КнопкаИзбранного = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), СтраницаКнопки);
		КнопкаИзбранного.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаИзбранного.ИмяКоманды = ИмяКоманды;
		КнопкаИзбранного.Заголовок = Строка(ИндексКнопки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтраницуГруппыИзбранного(Форма, СтраницаГруппы, ИндексКнопки,
		СочетаниеКлавиш, ПараметрыПостроения)
		
	БезРамки = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	СКартинкой = ПараметрыПостроения.ЕстьКартинка;
	СуффиксИмени = ?(СКартинкой, "Картинка", "");
	ЭлементыФормы = Форма.Элементы;
	ИндексДанных = ИндексКнопки - 1;
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	
	Если СКартинкой Тогда
		ИмяЭлемента = СтрШаблон("ИзображениеИзбранногоГруппа_%1", ИндексКнопки);
		ИзображениеИзбранного = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), СтраницаГруппы);
		ИзображениеИзбранного.Вид = ВидПоляФормы.ПолеКартинки;
		ИзображениеИзбранного.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ИзображениеИзбранного.Рамка = БезРамки;
		ИзображениеИзбранного.ПутьКДанным = СтрШаблон("ДанныеКнопок[%1].АдресИзображения", ИндексДанных);
		ИзображениеИзбранного.РазмерКартинки = РазмерКартинки.АвтоРазмер;
		ИзображениеИзбранного.Ширина = ?(ЭтоИнтерфейс85, 7, 6);
		ИзображениеИзбранного.Высота = 1;
		ИзображениеИзбранного.АвтоМаксимальнаяВысота = Истина;
		ИзображениеИзбранного.АвтоМаксимальнаяШирина = Ложь;
		ИзображениеИзбранного.МаксимальнаяШирина = 7;
		ИзображениеИзбранного.РастягиватьПоВертикали = Истина;
		ИзображениеИзбранного.РастягиватьПоГоризонтали = Ложь;
	КонецЕсли;
	
	ИмяЭлемента = СтрШаблон("НаименованиеГруппыИзбранного%1_%2", СуффиксИмени, ИндексКнопки);
	ПолеНаименование = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), СтраницаГруппы);
	ПолеНаименование.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеНаименование.ПутьКДанным = СтрШаблон("ДанныеКнопок[%1].ИмяЭлемента", ИндексДанных);
	ПолеНаименование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеНаименование.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ПолеНаименование.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
	ПолеНаименование.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
	ПолеНаименование.Высота = 3;
	ПолеНаименование.АвтоМаксимальнаяШирина = Ложь;
	ПолеНаименование.АвтоМаксимальнаяВысота = Ложь;
	ПолеНаименование.МаксимальнаяВысота = 2;
	ПолеНаименование.РастягиватьПоГоризонтали = Истина;
	ПолеНаименование.Шрифт = ПараметрыПостроения.БазовыйШрифт;
	
	ИмяЭлемента = СтрШаблон("ПраваяКолонкаГруппыИзбранного%1_%2", СуффиксИмени, ИндексКнопки);
	КолонкаГруппы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницаГруппы);
	КолонкаГруппы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	КолонкаГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КолонкаГруппы.ОтображатьЗаголовок = Ложь;
	КолонкаГруппы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	КолонкаГруппы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	КолонкаГруппы.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	КолонкаГруппы.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
	КолонкаГруппы.РастягиватьПоВертикали = Истина;
	КолонкаГруппы.РастягиватьПоГоризонтали = Ложь;
	
	Если Не СочетаниеКлавиш = Неопределено Тогда
		
		ИмяЭлемента = СтрШаблон("ИзбранноеГруппаНомерКлавиши%1_%2", СуффиксИмени, ИндексКнопки);
		
		ГруппаНомерКлавиши = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), КолонкаГруппы);
		ГруппаНомерКлавиши.Вид = ВидДекорацииФормы.Надпись;
		ГруппаНомерКлавиши.Шрифт = ШрифтыСтиля.ЗаголовокПятогоУровня;
		ГруппаНомерКлавиши.Заголовок = Строка(ИндексКнопки);
		ГруппаНомерКлавиши.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
		
	КонецЕсли;
	
	ИмяЭлемента = СтрШаблон("ИзбранноеСтатусаГруппы%1_%2", СуффиксИмени, ИндексКнопки);
	КартинкаСтатуса = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), КолонкаГруппы);
	КартинкаСтатуса.Вид = ВидДекорацииФормы.Картинка;
	КартинкаСтатуса.Ширина = 2;
	КартинкаСтатуса.РастягиватьПоВертикали = Ложь;
	КартинкаСтатуса.РастягиватьПоГоризонтали = Ложь;
	КартинкаСтатуса.Картинка = БиблиотекаКартинок.РМКНаУровеньВниз;
	КартинкаСтатуса.РазмерКартинки = РазмерКартинки.Пропорционально;
	КартинкаСтатуса.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	
КонецПроцедуры

Процедура ЗаполнитьСтраницуЭлементаИзбранного(Форма, СтраницаЭлемента, ИндексКнопки,
		СочетаниеКлавиш, ПараметрыПостроения)
		
	БезРамки = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	СКартинкой = ПараметрыПостроения.ЕстьКартинка;
	ЭлементыФормы = Форма.Элементы;
	ИндексДанных = ИндексКнопки - 1;
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	СуффиксИмени = ?(СКартинкой, "Картинка", "");
	
	Если СКартинкой Тогда
		ИмяЭлемента = СтрШаблон("ИзображениеИзбранногоЭлемент_%1", ИндексКнопки);
		ИзображениеИзбранного = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), СтраницаЭлемента);
		ИзображениеИзбранного.Вид = ВидПоляФормы.ПолеКартинки;
		ИзображениеИзбранного.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ИзображениеИзбранного.Рамка = БезРамки;
		ИзображениеИзбранного.ПутьКДанным = СтрШаблон("ДанныеКнопок[%1].АдресИзображения", ИндексДанных);
		ИзображениеИзбранного.РазмерКартинки = РазмерКартинки.АвтоРазмер;
		ИзображениеИзбранного.Ширина = ?(ЭтоИнтерфейс85, 7, 6);
		ИзображениеИзбранного.Высота = 1;
		ИзображениеИзбранного.АвтоМаксимальнаяВысота = Истина;
		ИзображениеИзбранного.АвтоМаксимальнаяШирина = Ложь;
		ИзображениеИзбранного.МаксимальнаяШирина = 7;
		ИзображениеИзбранного.РастягиватьПоВертикали = Истина;
		ИзображениеИзбранного.РастягиватьПоГоризонтали = Ложь;
	КонецЕсли;
	
	ИмяЭлемента = СтрШаблон("ИзбранноеКолонкаДанныхЭлемента%1_%2", СуффиксИмени, ИндексКнопки);
	ГруппаКолонкаДанных = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницаЭлемента);
	ГруппаКолонкаДанных.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКолонкаДанных.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаКолонкаДанных.ОтображатьЗаголовок = Ложь;
	ГруппаКолонкаДанных.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ГруппаКолонкаДанных.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ГруппаКолонкаДанных.РастягиватьПоВертикали = Истина;
	ГруппаКолонкаДанных.РастягиватьПоГоризонтали = Истина;
	
	ИмяЭлемента = СтрШаблон("ИзбранноеОсновнойРядЭлемента%1_%2", СуффиксИмени, ИндексКнопки);
	ОсновнойРядЭлемента = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаКолонкаДанных);
	ОсновнойРядЭлемента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ОсновнойРядЭлемента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ОсновнойРядЭлемента.ОтображатьЗаголовок = Ложь;
	ОсновнойРядЭлемента.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	ОсновнойРядЭлемента.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ОсновнойРядЭлемента.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	ОсновнойРядЭлемента.РастягиватьПоВертикали = Истина;
	ОсновнойРядЭлемента.РастягиватьПоГоризонтали = Истина;
	
	ИмяЭлемента = СтрШаблон("НаименованиеЭлементаИзбранного%1_%2", СуффиксИмени, ИндексКнопки);
	ПолеНаименование = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ОсновнойРядЭлемента);
	ПолеНаименование.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеНаименование.ПутьКДанным = СтрШаблон("ДанныеКнопок[%1].ИмяЭлемента", ИндексДанных);
	ПолеНаименование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеНаименование.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
	ПолеНаименование.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ПолеНаименование.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
	ПолеНаименование.Высота = 2;
	ПолеНаименование.АвтоМаксимальнаяШирина = Ложь;
	ПолеНаименование.АвтоМаксимальнаяВысота = Истина;
	ПолеНаименование.РастягиватьПоГоризонтали = Истина;
	ПолеНаименование.РастягиватьПоВертикали = Истина;
	ПолеНаименование.Шрифт = ПараметрыПостроения.БазовыйШрифт;
	
	Если Не СочетаниеКлавиш = Неопределено Тогда
	
		ИмяЭлемента = СтрШаблон("ИзбранноеЭлементНомерКлавиши%1_%2", СуффиксИмени, ИндексКнопки);
		
		ЭлементНомерКлавиши = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ОсновнойРядЭлемента);
		ЭлементНомерКлавиши.Вид = ВидДекорацииФормы.Надпись;
		ЭлементНомерКлавиши.Шрифт = ШрифтыСтиля.ЗаголовокПятогоУровня;
		ЭлементНомерКлавиши.Заголовок = Строка(ИндексКнопки);
		ЭлементНомерКлавиши.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
		
	КонецЕсли;
	
	Если ПараметрыПостроения.ОтображатьОстаток Или Не ПараметрыПостроения.СкрыватьЦену Тогда
	
		ИмяЭлемента = СтрШаблон("ИзбранноеРядПоказателейЭлемента%1_%2", СуффиксИмени, ИндексКнопки);
		РядПоказателейЭлемента = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаКолонкаДанных);
		РядПоказателейЭлемента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		РядПоказателейЭлемента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		РядПоказателейЭлемента.ОтображатьЗаголовок = Ложь;
		РядПоказателейЭлемента.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		РядПоказателейЭлемента.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		РядПоказателейЭлемента.РастягиватьПоВертикали = Истина;
		РядПоказателейЭлемента.РастягиватьПоГоризонтали = Истина;
		
		Если ПараметрыПостроения.ОтображатьОстаток Тогда
			ИмяЭлемента = СтрШаблон("ОстатокВИзбранном%1_%2", СуффиксИмени, ИндексКнопки);
			ПолеОстаток = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), РядПоказателейЭлемента);
			ПолеОстаток.Вид = ВидПоляФормы.ПолеНадписи;
			ПолеОстаток.ПутьКДанным = СтрШаблон("ДанныеКнопок[%1].КоличествоТекст", ИндексДанных);
			ПолеОстаток.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеОстаток.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			ПолеОстаток.Ширина = 1;
			ПолеОстаток.Высота = 1;
			ПолеОстаток.АвтоМаксимальнаяШирина = Ложь;
			ПолеОстаток.АвтоМаксимальнаяВысота = Истина;
			ПолеОстаток.РастягиватьПоГоризонтали = Истина;
			ПолеОстаток.РастягиватьПоВертикали = Ложь;
		КонецЕсли;
		
		Если Не ПараметрыПостроения.СкрыватьЦену Тогда
			ШрифтЦены = Новый Шрифт(ШрифтыСтиля.ТекстТретьегоУровня, , , Истина);
			ИмяЭлемента = СтрШаблон("ЦенаВИзбранном%1_%2", СуффиксИмени, ИндексКнопки);
			ПолеЦена = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), РядПоказателейЭлемента);
			ПолеЦена.Вид = ВидПоляФормы.ПолеНадписи;
			ПолеЦена.ПутьКДанным = СтрШаблон("ДанныеКнопок[%1].ЦенаТекст", ИндексДанных);
			ПолеЦена.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеЦена.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
			ПолеЦена.Ширина = 1;
			ПолеЦена.Высота = 1;
			ПолеЦена.АвтоМаксимальнаяШирина = Ложь;
			ПолеЦена.АвтоМаксимальнаяВысота = Истина;
			ПолеЦена.РастягиватьПоГоризонтали = Истина;
			ПолеЦена.РастягиватьПоВертикали = Ложь;
			ПолеЦена.Шрифт = ШрифтЦены;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтраницуНавигацииИзбранного(Форма, КонтейнерПлитки, ГорячиеКлавиши)
	
	ЭлементыФормы = Форма.Элементы;
	
	СочетаниеКлавишНазад = Неопределено;
	СочетаниеКлавишВперед = Неопределено;
	Если Не ГорячиеКлавиши = Неопределено Тогда
		Если (ГорячиеКлавиши.Alt ИЛИ ГорячиеКлавиши.Shift ИЛИ ГорячиеКлавиши.Ctrl) Тогда
			
			ДополнительнаяКлавишаНазад = Клавиша["_9"];
			ДополнительнаяКлавишаВперед = Клавиша["_0"];
			
			СочетаниеКлавишНазад = Новый СочетаниеКлавиш(ДополнительнаяКлавишаНазад,
				ГорячиеКлавиши.Alt, ГорячиеКлавиши.Ctrl, ГорячиеКлавиши.Shift);
			СочетаниеКлавишВперед = Новый СочетаниеКлавиш(ДополнительнаяКлавишаВперед,
				ГорячиеКлавиши.Alt, ГорячиеКлавиши.Ctrl, ГорячиеКлавиши.Shift);
				
		КонецЕсли;
	КонецЕсли;
	ИмяСобытияНазад = "Подключаемый_ИзбранноеНазад";
	ИмяСобытияВперед = "Подключаемый_ИзбранноеВперед";
	ИмяКомандыНазад = "Подключаемый_ИзбранноеКомандаНазад";
	ИмяКомандыВперед = "Подключаемый_ИзбранноеКомандаВперед";
	ИмяСобытияСменаСтраницы = "Подключаемый_ПриСменеСтраницыИзбранное";
	
	ИмяЭлемента = "СтраницаИзбранноеНавигация";
	СтраницаКонтейнера = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), КонтейнерПлитки);
	СтраницаКонтейнера.Вид = ВидГруппыФормы.Страница;
	СтраницаКонтейнера.ОтображатьЗаголовок = Ложь;
	СтраницаКонтейнера.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СтраницаКонтейнера.ГоризонтальныйИнтервал  = ИнтервалМеждуЭлементамиФормы.Половинный;
	СтраницаКонтейнера.РастягиватьПоВертикали = Истина;
	СтраницаКонтейнера.РастягиватьПоГоризонтали = Истина;
	СтраницаКонтейнера.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
	
	ИмяЭлемента = "КнопкаИзбранноеНазад";
	ГруппаКнопкаНазад = ДобавитьГруппуКарточку(ЭлементыФормы, СтраницаКонтейнера, ИмяЭлемента, ИмяСобытияНазад);
	ГруппаКнопкаНазад.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	ГруппаКнопкаНазад.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
	ГруппаКнопкаНазад.ЦветФона = ЦветУправляющейКнопки(Истина);
	ГруппаКнопкаНазад.РастягиватьПоВертикали = Истина;
	
	Если СочетаниеКлавишНазад = Неопределено Тогда
		
		ИмяЭлемента = "ДекорацияИзбранноеНазад";
		ДобавитьДекорациюНавигации(ЭлементыФормы, ИмяЭлемента, ГруппаКнопкаНазад, БиблиотекаКартинок.СтрелкаВлевоРМК);
		
	Иначе
		
		ИмяЭлемента = "СтраницыНавигацииНазад";
		СтраницыНавигацииНазад = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаКнопкаНазад);
		СтраницыНавигацииНазад.Вид = ВидГруппыФормы.Страницы;
		СтраницыНавигацииНазад.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		СтраницыНавигацииНазад.УстановитьДействие("ПриСменеСтраницы", ИмяСобытияСменаСтраницы);
	
		ИмяЭлемента = "СтраницаНавигацииИзображениеНазад";
		СтраницаНавигацииИзображениеНазад = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыНавигацииНазад);
		СтраницаНавигацииИзображениеНазад.Вид = ВидГруппыФормы.Страница;
		СтраницаНавигацииИзображениеНазад.ОтображатьЗаголовок = Ложь;
		
		ИмяЭлемента = "ДекорацияИзбранноеНазад";
		ДобавитьДекорациюНавигации(ЭлементыФормы, ИмяЭлемента,
			СтраницаНавигацииИзображениеНазад, БиблиотекаКартинок.СтрелкаВлевоРМК);
		
		ИмяЭлемента = "СтраницаНавигацииГорячаяКнопкаНазад";
		СтраницаГорячаяКнопкаНазад = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыНавигацииНазад);
		СтраницаГорячаяКнопкаНазад.Вид = ВидГруппыФормы.Страница;
		СтраницаГорячаяКнопкаНазад.ОтображатьЗаголовок = Ложь;
		
		ИмяЭлемента = "ИзбранноеНазад";
		КнопкаНазад = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), СтраницаГорячаяКнопкаНазад);
		КнопкаНазад.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаНазад.ИмяКоманды = ИмяКомандыНазад;
		КнопкаНазад.Заголовок = "_";
		КнопкаНазад.СочетаниеКлавиш = СочетаниеКлавишНазад;
		
	КонецЕсли;
	
	ИмяЭлемента = "КнопкаИзбранноеВперед";
	ГруппаКнопкаВперед = ДобавитьГруппуКарточку(ЭлементыФормы, СтраницаКонтейнера, ИмяЭлемента, ИмяСобытияВперед);
	ГруппаКнопкаВперед.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	ГруппаКнопкаВперед.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
	ГруппаКнопкаВперед.ЦветФона = ЦветУправляющейКнопки(Истина);
	ГруппаКнопкаВперед.РастягиватьПоВертикали = Истина;
	
	Если СочетаниеКлавишВперед = Неопределено Тогда
		
		ИмяЭлемента = "ДекорацияИзбранноеВперед";
		ДобавитьДекорациюНавигации(ЭлементыФормы, ИмяЭлемента, ГруппаКнопкаВперед, БиблиотекаКартинок.СтрелкаВправоРМК);
		
	Иначе
		
		ИмяЭлемента = "СтраницыНавигацииВперед";
		СтраницыНавигацииВперед = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаКнопкаВперед);
		СтраницыНавигацииВперед.Вид = ВидГруппыФормы.Страницы;
		СтраницыНавигацииВперед.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		СтраницыНавигацииВперед.УстановитьДействие("ПриСменеСтраницы", ИмяСобытияСменаСтраницы);
	
		ИмяЭлемента = "СтраницаНавигацииИзображениеВперед";
		СтраницаНавигацииИзображениеВперед
			= ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыНавигацииВперед);
		СтраницаНавигацииИзображениеВперед.Вид = ВидГруппыФормы.Страница;
		СтраницаНавигацииИзображениеВперед.ОтображатьЗаголовок = Ложь;
		
		ИмяЭлемента = "ДекорацияИзбранноеВперед";
		ДобавитьДекорациюНавигации(ЭлементыФормы, ИмяЭлемента,
			СтраницаНавигацииИзображениеВперед, БиблиотекаКартинок.СтрелкаВправоРМК);
		
		ИмяЭлемента = "СтраницаНавигацииГорячаяКнопкаВперед";
		СтраницаГорячаяКнопкаВперед = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыНавигацииВперед);
		СтраницаГорячаяКнопкаВперед.Вид = ВидГруппыФормы.Страница;
		СтраницаГорячаяКнопкаВперед.ОтображатьЗаголовок = Ложь;
		
		ИмяЭлемента = "ИзбранноеВперед";
		КнопкаВперед = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), СтраницаГорячаяКнопкаВперед);
		КнопкаВперед.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаВперед.ИмяКоманды = ИмяКомандыВперед;
		КнопкаВперед.Заголовок = "_";
		КнопкаВперед.СочетаниеКлавиш = СочетаниеКлавишВперед;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтраницуНавигацииПлитки(Форма, КонтейнерПлитки)
	
	ЭлементыФормы = Форма.Элементы;
	ИмяСобытияНазад = "Подключаемый_ПлиткаНазад";
	ИмяСобытияВперед = "Подключаемый_ПлиткаВперед";
	
	ИмяЭлемента = "СтраницаПлиткаНавигация";
	СтраницаКонтейнера = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), КонтейнерПлитки);
	СтраницаКонтейнера.Вид = ВидГруппыФормы.Страница;
	СтраницаКонтейнера.ОтображатьЗаголовок = Ложь;
	СтраницаКонтейнера.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	СтраницаКонтейнера.ВертикальныйИнтервал  = ИнтервалМеждуЭлементамиФормы.Половинный;
	СтраницаКонтейнера.РастягиватьПоВертикали = Истина;
	СтраницаКонтейнера.РастягиватьПоГоризонтали = Истина;
	СтраницаКонтейнера.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	
	ИмяЭлемента = "КнопкаПлиткаНазад";
	ГруппаКнопкаНазад = ДобавитьГруппуКарточку(ЭлементыФормы, СтраницаКонтейнера, ИмяЭлемента, ИмяСобытияНазад);
	ГруппаКнопкаНазад.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	ГруппаКнопкаНазад.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	ГруппаКнопкаНазад.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	ГруппаКнопкаНазад.ЦветФона = ЦветУправляющейКнопки(Истина);
	ГруппаКнопкаНазад.РастягиватьПоВертикали = Истина;
	ГруппаКнопкаНазад.РастягиватьПоГоризонтали = Истина;
	
	ИмяЭлемента = "ДекорацияПлиткаНазад";
	ДобавитьДекорациюНавигации(ЭлементыФормы, ИмяЭлемента, ГруппаКнопкаНазад, БиблиотекаКартинок.РМКСтрелкаВверх);
	
	ИмяЭлемента = "КнопкаПлиткаВперед";
	ГруппаКнопкаВперед = ДобавитьГруппуКарточку(ЭлементыФормы, СтраницаКонтейнера, ИмяЭлемента, ИмяСобытияВперед);
	ГруппаКнопкаВперед.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	ГруппаКнопкаВперед.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	ГруппаКнопкаВперед.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	ГруппаКнопкаВперед.ЦветФона = ЦветУправляющейКнопки(Истина);
	ГруппаКнопкаВперед.РастягиватьПоВертикали = Истина;
	ГруппаКнопкаВперед.РастягиватьПоГоризонтали = Истина;
	
	ИмяЭлемента = "ДекорацияПлиткаВперед";
	ДобавитьДекорациюНавигации(ЭлементыФормы, ИмяЭлемента, ГруппаКнопкаВперед, БиблиотекаКартинок.РМКСтрелкаВниз);
	
КонецПроцедуры

Функция ДобавитьДекорациюНавигации(ЭлементыФормы, ИмяЭлемента, ГруппаКнопки, КартинкаДекорации)
	
	КартинкаКнопки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаКнопки);
	КартинкаКнопки.Вид = ВидДекорацииФормы.Картинка;
	КартинкаКнопки.АвтоМаксимальнаяШирина = Ложь;
	КартинкаКнопки.МаксимальнаяШирина = 7;
	КартинкаКнопки.РастягиватьПоВертикали = Истина;
	КартинкаКнопки.РастягиватьПоГоризонтали = Истина;
	КартинкаКнопки.Картинка = КартинкаДекорации;
	КартинкаКнопки.РазмерКартинки = РазмерКартинки.Пропорционально;
	КартинкаКнопки.ЦветКартинки = ЦветУправляющейКнопки();
	
	Возврат КартинкаКнопки;
	
КонецФункции

Функция ПараметрыРазмеровКомандУправленияЧекомДляОбычногоРежима(ПараметрыУвеличенногоИнтерфейса)
	
	ПараметрыРазмеров = Новый Структура;
	
	ПараметрыРазмеров.Вставить("ВысотаКоманды", ПараметрыУвеличенногоИнтерфейса.ВысотаКоманды);
	ПараметрыРазмеров.Вставить("ШиринаКоманды", ПараметрыУвеличенногоИнтерфейса.ШиринаКоманды);
	ПараметрыРазмеров.Вставить("ВысотаКомандыОперации", ПараметрыУвеличенногоИнтерфейса.ВысотаКоманды);
	ПараметрыРазмеров.Вставить("ШиринаКомандыОперации", ПараметрыУвеличенногоИнтерфейса.ШиринаКоманды);
	
	Возврат ПараметрыРазмеров;
	
КонецФункции

Функция ПринадлежитГруппеОпераций(Элементы, ЭлементФормы)
	
	РезультатФункции = Ложь;
	ГруппаОперации = Элементы.ГруппаОперации;
	Если ЭлементФормы.Родитель = ГруппаОперации
		Или (ТипЗнч(ЭлементФормы.Родитель) = Тип("ГруппаФормы") И ЭлементФормы.Родитель.Родитель = ГруппаОперации) Тогда
		
		РезультатФункции = Истина;
		
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ИгнорироватьЭлементДляУвеличенияРазмера(РежимКСО, Элементы, ЭлементФормы)
	
	РезультатФункции = Ложь;

	Если (Не ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы")) Или ЭлементФормы.Вид = ВидКнопкиФормы.Гиперссылка
		Или (РежимКСО И ПринадлежитГруппеОпераций(Элементы, ЭлементФормы)) Тогда
		
		РезультатФункции = Истина;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДобавитьРядКнопокПлиток(РодительскийЭлемент, ИндексРяда, Элементы)
	
	ИмяРяда = СтрШаблон("ПлиткаРядКнопок_%1", ИндексРяда);
	НовыйРяд = Элементы.Найти(ИмяРяда);
	Если НовыйРяд = Неопределено Тогда
		НовыйРяд = Элементы.Добавить(ИмяРяда, Тип("ГруппаФормы"), РодительскийЭлемент);
	КонецЕсли;
	НовыйРяд.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	НовыйРяд.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйРяд.ОтображатьЗаголовок 		= Ложь;
	НовыйРяд.РастягиватьПоГоризонтали	= Истина;
	НовыйРяд.РастягиватьПоВертикали		= Истина;
	НовыйРяд.Высота 					= 1;
	Если ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		НовыйРяд.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	КонецЕсли;
	
	Возврат НовыйРяд;
	
КонецФункции

Функция ПолучитьШрифтПлиткиПоУмолчанию(Форма)
	
	Перем БазовыйШрифт;
	
	ШрифтТекстом = "";
	ПалитраФормы = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтруктураПлиточногоИнтерфейсаПодбора") Тогда
		ШрифтТекстом
			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.СтруктураПлиточногоИнтерфейсаПодбора, "ШрифтЭлементовПодбора");
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекущаяНастройкаРМК") Тогда
		ШрифтТекстом = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ТекущаяНастройкаРМК,
			"СтруктураПлиточногоИнтерфейсаПодбора.ШрифтЭлементовПодбора");
	КонецЕсли;
	Если ЗначениеЗаполнено(ШрифтТекстом) Тогда
		БазовыйШрифт = ОбщегоНазначения.ЗначениеИзСтрокиXML(ШрифтТекстом);
	Иначе
		БазовыйШрифт = Новый Шрифт(ШрифтыСтиля.ЗаголовокЧетвертогоУровня, , , Истина);
	КонецЕсли;
	Возврат БазовыйШрифт;
	
КонецФункции

Функция ПолучитьШрифтИзбранногоПоУмолчанию(Форма)
	
	Перем БазовыйШрифт;
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ШрифтТекстом = "";
	ПалитраИзбранных = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "НастройкиРМК") Тогда
		ПалитраИзбранных = Форма.НастройкиРМК.СтруктураБыстрыхТоваров;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекущаяНастройкаРМК") Тогда
		ПалитраИзбранных = Форма.ТекущаяНастройкаРМК.СтруктураБыстрыхТоваров;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПалитраИзбранных) Тогда
		ШрифтТекстом = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПалитраИзбранных, "ШрифтЭлементовПодбора");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШрифтТекстом) Тогда
		БазовыйШрифт = ОбщегоНазначения.ЗначениеИзСтрокиXML(ШрифтТекстом);
	Иначе
		ШрифтТакси = Новый Шрифт(ШрифтыСтиля.ЗаголовокТретьегоУровня, , , Ложь);
		БазовыйШрифт = ?(ЭтоИнтерфейс85, ШрифтыСтиля.ШрифтИзбранногоПоУмолчанию85, ШрифтТакси);
	КонецЕсли;
	
	Возврат БазовыйШрифт;
	
КонецФункции

Процедура ДобавитьКнопкуВРядПлитокКарточек(РядКнопок, ИндексКнопки, Форма, ПараметрыПостроения)
	
	ЭлементыФормы = Форма.Элементы;
	
	ИмяЭлемента = СтрШаблон("КонтейнерПлитки_%1", ИндексКнопки);
	КонтейнерПлитки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), РядКнопок);
	КонтейнерПлитки.Вид = ВидГруппыФормы.Страницы;
	КонтейнерПлитки.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	ИмяЭлемента = СтрШаблон("СтраницаПлиткаПустоеМесто_%1", ИндексКнопки);
	СтраницаКонтейнера = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), КонтейнерПлитки);
	СтраницаКонтейнера.Вид = ВидГруппыФормы.Страница;
	
	ИмяЭлемента = СтрШаблон("ДекорацияПустоеМесто_%1", ИндексКнопки);
	ПустаяДекорация = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), СтраницаКонтейнера);
	ПустаяДекорация.Вид = ВидДекорацииФормы.Надпись;
	ПустаяДекорация.РастягиватьПоВертикали = Истина;
	ПустаяДекорация.РастягиватьПоГоризонтали = Истина;
	ПустаяДекорация.Заголовок = " ";
	
	ИмяЭлемента = СтрШаблон("СтраницаСодержимогоГруппы_%1", ИндексКнопки);
	СтраницаКонтейнера = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), КонтейнерПлитки);
	СтраницаКонтейнера.Вид = ВидГруппыФормы.Страница;
	СтраницаКонтейнера.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	СтраницаКонтейнера.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	СтраницаКонтейнера.РастягиватьПоГоризонтали = Истина;
	СтраницаКонтейнера.РастягиватьПоВертикали = Истина;
	СтраницаКонтейнера.ОтображатьЗаголовок = Ложь;
	НаполнитьСтраницуГруппыПлитки(ЭлементыФормы, СтраницаКонтейнера, ИндексКнопки, ПараметрыПостроения);
	
	ИмяЭлемента = СтрШаблон("СтраницаСодержимогоЭлемента_%1", ИндексКнопки);
	СтраницаКонтейнера = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), КонтейнерПлитки);
	СтраницаКонтейнера.Вид = ВидГруппыФормы.Страница;
	СтраницаКонтейнера.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	СтраницаКонтейнера.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	СтраницаКонтейнера.РастягиватьПоГоризонтали = Истина;
	СтраницаКонтейнера.РастягиватьПоВертикали = Истина;
	СтраницаКонтейнера.ОтображатьЗаголовок = Ложь;
	НаполнитьСтраницуЭлементаПлитки(ЭлементыФормы, СтраницаКонтейнера, ИндексКнопки, ПараметрыПостроения);
	
	Если ИндексКнопки = (Форма.КоличествоЭлементовВРяду * Форма.КоличествоРядовНаСтранице - 1) Тогда
		ДобавитьСтраницуНавигацииПлитки(Форма, КонтейнерПлитки);
	КонецЕсли;
	
КонецПроцедуры

Процедура НаполнитьСтраницуГруппыПлитки(ЭлементыФормы, СтраницаКонтейнера, ИндексКнопки, ПараметрыПостроения)
	
	ЭлементыПлитки = Новый Структура();
	НаполнитьСтраницуПлиткиОбщимиЭлементами(ЭлементыФормы, СтраницаКонтейнера, ИндексКнопки,
		ПараметрыПостроения, ЭлементыПлитки);
	ЭлементыПлитки.ПлиткаКарточка.ВидОтображения = ВидОтображенияКарточки.Группа;
	
КонецПроцедуры

Процедура НаполнитьСтраницуЭлементаПлитки(ЭлементыФормы, СтраницаКонтейнера, ИндексКнопки, ПараметрыПостроения)
	
	ЭлементыПлитки = Новый Структура();
	НаполнитьСтраницуПлиткиОбщимиЭлементами(ЭлементыФормы, СтраницаКонтейнера, ИндексКнопки,
		ПараметрыПостроения, ЭлементыПлитки);
	
	Если ПараметрыПостроения.ОтображатьОстаток Тогда
		
		ИмяЭлемента = СтрШаблон("ГруппаИнформацияЭлемента_%1", ИндексКнопки);
		ГруппаИнформация = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ЭлементыПлитки.ПлиткаКарточка);
		ГруппаИнформация.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаИнформация.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаИнформация.ОтображатьЗаголовок = Ложь;
		ГруппаИнформация.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ГруппаИнформация.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		
		ИмяЭлемента = СтрШаблон("ЦенаВПлитке_%1", ИндексКнопки);
		ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаИнформация);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеНадписи;
		ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].ЦенаТекст", ИндексКнопки);
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементФормы.Высота = 1;
		ЭлементФормы.Ширина = 1;
		ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
		ЭлементФормы.РастягиватьПоГоризонтали = Истина;
		ЭлементФормы.РастягиватьПоВертикали = Ложь;
		ЭлементФормы.Шрифт = ПараметрыПостроения.ШрифтЦены;
		
		ИмяЭлемента = СтрШаблон("ОстатокВПлитке_%1", ИндексКнопки);
		ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаИнформация);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеНадписи;
		ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].КоличествоТекст", ИндексКнопки);
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		ЭлементФормы.Высота = 1;
		ЭлементФормы.Ширина = 1;
		ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
		ЭлементФормы.РастягиватьПоГоризонтали = Истина;
		ЭлементФормы.РастягиватьПоВертикали = Ложь;
		ЭлементФормы.Шрифт = ПараметрыПостроения.ШрифтЦены;
		
	ИначеЕсли Не ПараметрыПостроения.СкрыватьЦену Тогда
		
		ИмяЭлемента = СтрШаблон("ЦенаВПлитке_%1", ИндексКнопки);
		ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ЭлементыПлитки.ПлиткаКарточка);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеНадписи;
		ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].ЦенаТекст", ИндексКнопки);
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементФормы.Высота = 1;
		ЭлементФормы.Ширина = 1;
		ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
		ЭлементФормы.РастягиватьПоГоризонтали = Истина;
		ЭлементФормы.РастягиватьПоВертикали = Ложь;
		ЭлементФормы.Шрифт = ПараметрыПостроения.ШрифтЦены;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НаполнитьСтраницуПлиткиОбщимиЭлементами(ЭлементыФормы, СтраницаКонтейнера, ИндексКнопки,
		ПараметрыПостроения, ЭлементыПлитки)
	
	БезРамки = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	
	НачалоИмениГруппы = "СтраницаСодержимогоГруппы";
	ПостфиксЭлементаФормы = ?(СтрНайти(СтраницаКонтейнера.Имя, НачалоИмениГруппы) > 0, "Группы", "Элемента");
	
	ИмяЭлемента = СтрШаблон("ПлиткаКарточка%1_%2", ПостфиксЭлементаФормы, ИндексКнопки);
	ПлиткаКарточка = ДобавитьГруппуКарточку(ЭлементыФормы,
		СтраницаКонтейнера, ИмяЭлемента, ПараметрыПостроения.ИмяКомандыНажатия);
	ПлиткаКарточка.РастягиватьПоГоризонтали = Истина;
	ПлиткаКарточка.РастягиватьПоВертикали = Истина;
	ПлиткаКарточка.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	ПлиткаКарточка.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		ПлиткаКарточка.Ширина = 26;
	КонецЕсли;
	
	ИмяЭлемента = СтрШаблон("Наименование%1Плитки_%2", ПостфиксЭлементаФормы, ИндексКнопки);
	НадписьПлитки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ПлиткаКарточка);
	НадписьПлитки.Вид = ВидПоляФормы.ПолеНадписи;
	НадписьПлитки.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].ИмяЭлемента", ИндексКнопки);
	НадписьПлитки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НадписьПлитки.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
	НадписьПлитки.РастягиватьПоГоризонтали = Истина;
	НадписьПлитки.Шрифт = ПараметрыПостроения.БазовыйШрифт;
	НадписьПлитки.Высота = 2;
	НадписьПлитки.АвтоМаксимальнаяВысота = Ложь;
	НадписьПлитки.АвтоМаксимальнаяШирина = Ложь;
	НадписьПлитки.МаксимальнаяВысота = 2;
	
	ИмяЭлемента = СтрШаблон("Изображение%1ВПлитке_%2", ПостфиксЭлементаФормы, ИндексКнопки);
	КартинкаПлитки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ПлиткаКарточка);
	КартинкаПлитки.Вид = ВидПоляФормы.ПолеКартинки;
	КартинкаПлитки.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].АдресИзображения", ИндексКнопки);
	КартинкаПлитки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КартинкаПлитки.РазмерКартинки = РазмерКартинки.Пропорционально;
	КартинкаПлитки.Высота = 1;
	КартинкаПлитки.Ширина = 1;
	КартинкаПлитки.Рамка = БезРамки;
	КартинкаПлитки.РастягиватьПоВертикали = Истина;
	КартинкаПлитки.РастягиватьПоГоризонтали = Истина;
	
	ЭлементыПлитки.Вставить("ПлиткаКарточка", ПлиткаКарточка);
	
КонецПроцедуры

Процедура ЗаполнитьСоставПалитрыИзбранногоПоДаннымДереваВУзле(СоставПалитры, ЭлементыДерева, НомерКатегории, НомерСтроки)
	Перем ЦветШрифтаСтроки, ЦветФонаСтроки;
	
	ТекущийИндексПозиции = 0;
	ТекущийНомерКатегории = НомерКатегории;
	
	ИндексыКрайнихПустыхОбластей = Новый Массив;
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		
		НовыйЭлементСостава = СоставПалитры.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйЭлементСостава, ЭлементДерева);
		Если Не НомерСтроки = Неопределено Тогда
			НомерСтроки = НомерСтроки + 1;
			НовыйЭлементСостава.НомерСтроки = ЭлементДерева.НомерСтроки;
		КонецЕсли;
		ТекущийИндексПозиции = ТекущийИндексПозиции + 1;
		НовыйЭлементСостава.ИндексПозиции = ТекущийИндексПозиции;
		
		НовыйЭлементСостава.НомерКатегорииРазмещения = НомерКатегории;
		
		ЭтоЭлементГруппа = ЭлементДерева.ЭтоКатегория ИЛИ ЭлементДерева.ИмеетсяВложенность;
		Если ЭтоЭлементГруппа И НЕ ЗначениеЗаполнено(ЭлементДерева.ВидМодификатора) Тогда
			
			ТекущийНомерКатегории = ТекущийНомерКатегории + 1;
			НовыйЭлементСостава.НомерКатегории = ТекущийНомерКатегории;
			ЗаполнитьСоставПалитрыИзбранногоПоДаннымДереваВУзле(СоставПалитры,
				ЭлементДерева.Строки, ТекущийНомерКатегории, НомерСтроки);
			
		КонецЕсли;
		
		ИменаСвойствЗаполнения = "ИндексПозиции, НомерКатегорииРазмещения, НомерКатегории";
		ЗаполнитьЗначенияСвойств(ЭлементДерева,
			НовыйЭлементСостава, ИменаСвойствЗаполнения);
			
		Если ЭлементДерева.ЦветШрифта.Вид = ВидЦвета.WindowsЦвет
				Или ЭлементДерева.ЦветШрифта.Вид = ВидЦвета.ЭлементСтиля Тогда
				
			ЦветШрифтаСтроки = ЭлементДерева.ЦветШрифта.ПолучитьАбсолютный();
				
		Иначе
			
			ЦветШрифтаСтроки =  ЭлементДерева.ЦветШрифта;
			
		КонецЕсли;
		
		Если ЭлементДерева.ЦветФона.Вид = ВидЦвета.WindowsЦвет
				Или ЭлементДерева.ЦветФона.Вид = ВидЦвета.ЭлементСтиля Тогда
				
			ЦветФонаСтроки = ЭлементДерева.ЦветФона.ПолучитьАбсолютный();
				
		Иначе
			
			ЦветФонаСтроки =  ЭлементДерева.ЦветФона;
			
		КонецЕсли;
			
		НовыйЭлементСостава.ЦветШрифта = ОбщегоНазначения.ЗначениеВСтрокуXML(ЦветШрифтаСтроки);
		НовыйЭлементСостава.ЦветФона = ОбщегоНазначения.ЗначениеВСтрокуXML(ЦветФонаСтроки);
		Если ЭлементДерева.ПустаяОбласть Тогда
			ИндексыКрайнихПустыхОбластей.Вставить(0, СоставПалитры.Индекс(НовыйЭлементСостава));
		ИначеЕсли Не (ЭлементДерева.ПустаяОбласть Или ЗначениеЗаполнено(ЭлементДерева.ВидМодификатора)) Тогда
			ИндексыКрайнихПустыхОбластей.Очистить();
		КонецЕсли;
		
	КонецЦикла;
	Для Каждого ИндексЛишнего Из ИндексыКрайнихПустыхОбластей Цикл
		СоставПалитры.Удалить(ИндексЛишнего);
	КонецЦикла;
	
	НомерКатегории = ТекущийНомерКатегории;
	
КонецПроцедуры

Процедура НастроитьИспользованиеКнопкиВыбораПоля(Элементы, ИмяПоля, ПоказатьКнопкуВыбора, УвеличитьШирину)
	
	ДельтаШирины = 2;
	Элементы[ИмяПоля].КнопкаВыбора = ПоказатьКнопкуВыбора;
	Если УвеличитьШирину Тогда
		Элементы[ИмяПоля].Ширина = Элементы[ИмяПоля].Ширина + ДельтаШирины;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОтборРазделаГорячихКлавиш(Элементы, Элемент)
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение =
		Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиНомерСтроки.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
КонецПроцедуры

Процедура ДобавитьОтборНекорректныхКомбинацийГорячихКлавиш(Элемент, ТиНарушения)
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоГорячиеКлавиши.ТипНарушения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлемента.ПравоеЗначение = ТиНарушения;
	
КонецПроцедуры

Процедура ДобавитьОтборНекорректныхКомбинацийГорячихКлавишКупюр(Элемент, ТиНарушения)
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкиРМК.ВводНаличных.ТипНарушения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ТиНарушения;
	
КонецПроцедуры

Функция ПодготовитьСочетаниеГорячейКлавиши(АкселераторыКупюр, КлавишаСтрокой)
	СочетаниеКлавиш = Неопределено;
	ПустаяКлавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	Если ЗначениеЗаполнено(КлавишаСтрокой) И Не КлавишаСтрокой = ПустаяКлавиша Тогда
		
		ДополнительнаяКлавиша = Клавиша[КлавишаСтрокой];
		СочетаниеКлавиш = Новый СочетаниеКлавиш(ДополнительнаяКлавиша,
			АкселераторыКупюр.Alt, АкселераторыКупюр.Ctrl, АкселераторыКупюр.Shift);
				
	КонецЕсли;
	Возврат СочетаниеКлавиш;
КонецФункции

Процедура ДобавитьСлужебныеГруппыВесовогоТовараВОпорныеДанные(Форма)
	
	ЦветаФона = ПолучитьЦветаПлиточногоИнтерфейсаПоУмолчанию(Форма);
	ПараметрыПостроения = Новый Структура();
	ПараметрыПостроения.Вставить("ЦветаФона", ЦветаФона);
	
	ИмяПапкиДругихВесовыхТоваров = ИнтерфейсРМКСлужебныйКлиентСервер.ИмяГруппыДругихВесовыхТоваров();
	ИмяОбратнойПапки = ИнтерфейсРМКСлужебныйКлиентСервер.ИмяГруппыРаспознанныхВесовыхТоваров();
	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ИсточникСлужебныеГруппы = ИсточникиДанныхПлитки.СлужебныеГруппы;
	
	ОтборДанных = Новый Структура("ИсточникПлитки", ИсточникСлужебныеГруппы);
	СлужебныеСтроки = Форма.ОпорныеДанные.НайтиСтроки(ОтборДанных);
	Если СлужебныеСтроки.Количество() = 0 Тогда
		ДобавитьСлужебнуюГруппуВОпорныеДанные(Форма, ИмяПапкиДругихВесовыхТоваров, Ложь,
			ИсточникСлужебныеГруппы, ПараметрыПостроения);
		ДобавитьСлужебнуюГруппуВОпорныеДанные(Форма, ИмяОбратнойПапки, Истина,
			ИсточникСлужебныеГруппы, ПараметрыПостроения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСлужебнуюГруппуВОпорныеДанные(Форма, ИмяЭлемента,
		ОбратнаяГруппа, ИсточникПлитки, ПараметрыПостроения)
	
	ОпорныеДанные = Форма.ОпорныеДанные;
	НоваяСтрока = ОпорныеДанные.Добавить();
	НоваяСтрока.НомерКатегории = ?(ОбратнаяГруппа, 0, 1);
	НоваяСтрока.ИндексПозицииВКатегории = ?(ОбратнаяГруппа, 1, 0);
	НоваяСтрока.НомерКатегорииРазмещенияЭлемента = ?(ОбратнаяГруппа, 1, 0);
	НоваяСтрока.ЭтоКатегория = Истина;
	НоваяСтрока.ЦветФона = ПараметрыПостроения.ЦветаФона.ЦветФонаПапки;
	НоваяСтрока.ИмяЭлемента = ИмяЭлемента;
	НоваяСтрока.ДоступностьКоманды = Истина;
	НоваяСтрока.ПервыйИндексПлитки = 0;
	НоваяСтрока.ИмеетсяВложенность = Истина;
	НоваяСтрока.ИсточникПлитки = ИсточникПлитки;
	НоваяСтрока.ЭтоТекущаяКатегория = ?(ОбратнаяГруппа, Истина, Ложь);
	
КонецПроцедуры

Функция ДобавитьПакетВОпорныеДанныеПриНеобходимости(ОпорныеДанные, Форма, НовыйИндекс)
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	СтрокаПакета = Неопределено;
	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ДанныеПакета = Форма.ДанныеПакета;
	Если (Не ДанныеПакета = Неопределено) И ЗначениеЗаполнено(ДанныеПакета.Номенклатура) Тогда
		
		НовыйИндекс = НовыйИндекс + 1;
		СтрокаПакета = ОпорныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПакета, ДанныеПакета);
		СтрокаПакета.ИндексПозицииВКатегории = НовыйИндекс;
		СтрокаПакета.ЦветШрифта = Новый Цвет();
		СтрокаПакета.ЦветФона = ?(ЭтоИнтерфейс85, Новый Цвет(), ЦветаПалитры.СветлоБежевыйРМК);
		СтрокаПакета.ИмяЭлемента = Общегоназначения.ЗначениеРеквизитаОбъекта(ДанныеПакета.Номенклатура, "Наименование");
		СтрокаПакета.Доступностькоманды = Истина;
		СтрокаПакета.ИсточникПлитки = ИсточникиДанныхПлитки.Избранное;
		СтрокаПакета.ПервыйИндексПлитки = ОпорныеДанные.Индекс(СтрокаПакета);
		Если ЭтоРежимКассыСамообслуживания(Форма) Тогда
			СтрокаПакета.АдресИзображения
				= ПоместитьВоВременноеХранилище(БиблиотекаКартинок.РМКПакетКрупно.ПолучитьДвоичныеДанные(Истина),
					Форма.УникальныйИдентификатор);
		Иначе
			СтрокаПакета.АдресИзображения
				= ПоместитьВоВременноеХранилище(БиблиотекаКартинок.РМКДобавитьПакетQR.ПолучитьДвоичныеДанные(Истина),
					Форма.УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЕсли;
	Возврат СтрокаПакета;
	
КонецФункции

Функция ЭтоРежимКассыСамообслуживания(Форма)
	
	РезультатФункции = Ложь;
	Если Форма.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК" Тогда
		РезультатФункции = Форма.РежимКассыСамообслуживания;
	ИначеЕсли Форма.ИмяФормы = "ОбщаяФорма.НастройкиРабочегоМестаКассира" Тогда
		РезультатФункции = (Форма.НастройкиРМК.СценарийИспользования
			= Перечисления.СценарииИспользованияРМК.ТерминалСамообслуживания);
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьНачальныйИндексНаСтранице(СтрокаПлитки, НомерСтраницыВКатегории, КоличествоПлитокНаСтранице)
	
	КоличествоКарточекНаСтранице = 1;
	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	Если СтрокаПлитки.ИсточникПлитки = ИсточникиДанныхПлитки.Избранное Тогда
		КоличествоКарточекНаСтранице = ИнтерфейсРМКСлужебныйКлиентСервер.КоличествоКарточекИзбранногоНаСтранице();
	Иначе
		КоличествоКарточекНаСтранице = КоличествоПлитокНаСтранице;
	КонецЕсли;
	
	РезультатФункции = 0;
	Если СтрокаПлитки.НомерКатегорииРазмещенияЭлемента = 0 Тогда
		РезультатФункции = (НомерСтраницыВКатегории * (КоличествоКарточекНаСтранице - 1)) + 1;
	Иначе
		РезультатФункции = (НомерСтраницыВКатегории * (КоличествоКарточекНаСтранице - 2)) + 2;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьНомерСтраницыЭлемента(СтрокаПлитки, КоличествоВКатегориях,
		КоличествоВКатегорияхПалитры, КоличествоПлитокНаСтранице)
	
	КоличествоКарточекНаСтранице = 1;
	МаксимальныйИндексВКатегории = 0;
	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	Если СтрокаПлитки.ИсточникПлитки = ИсточникиДанныхПлитки.Избранное Тогда
		КоличествоКарточекНаСтранице = ИнтерфейсРМКСлужебныйКлиентСервер.КоличествоКарточекИзбранногоНаСтранице();
		МаксимальныйИндексВКатегории = КоличествоВКатегориях.Получить(СтрокаПлитки.НомерКатегорииРазмещенияЭлемента);
	Иначе
		КоличествоКарточекНаСтранице = КоличествоПлитокНаСтранице;
		МаксимальныйИндексВКатегории = КоличествоВКатегорияхПалитры.Получить(СтрокаПлитки.НомерКатегорииРазмещенияЭлемента);
	КонецЕсли;
	
	РезультатФункции = 0;
	Если МаксимальныйИндексВКатегории > КоличествоКарточекНаСтранице Тогда
		Если СтрокаПлитки.НомерКатегорииРазмещенияЭлемента = 0 Тогда
			РезультатФункции = Цел((СтрокаПлитки.ИндексПозицииВКатегории - 1) / (КоличествоКарточекНаСтранице - 1));
		Иначе
			РезультатФункции = Цел((СтрокаПлитки.ИндексПозицииВКатегории - 2) / (КоличествоКарточекНаСтранице - 2));
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьКоличествоКатегории(КоличествоВКатегориях, СтрокаОпорныхДанных)
	
	КоличествоВКатегории = КоличествоВКатегориях.Получить(СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента);
	Если КоличествоВКатегории = Неопределено Или КоличествоВКатегории < СтрокаОпорныхДанных.ИндексПозицииВКатегории Тогда
		КоличествоВКатегориях.Вставить(СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента,
			СтрокаОпорныхДанных.ИндексПозицииВКатегории);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОпорныеДанныеСтрокамиПалитры(Форма, Выборка, ПалитраПлитки) Экспорт

	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	ВертикальнаяОриентация = Ложь;
	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ДанныеАвтоКартинки = БиблиотекаКартинок.РМККассаЗеленая.ПолучитьДвоичныеДанные();
	АдресКартинкиГруппыПоУмолчанию = ПоместитьВоВременноеХранилище(ДанныеАвтоКартинки, УникальныйИдентификаторФормы);
	ДанныеКартинкиПодарок = БиблиотекаКартинок.РМКПодарок.ПолучитьДвоичныеДанные();
	АдресКартинкиПодаркаПоУмолчанию = ПоместитьВоВременноеХранилище(ДанныеКартинкиПодарок, УникальныйИдентификаторФормы);
	ОбозначениеПалитры = ПолучитьОбозначениеПалитрыПоУмолчанию();
	
	КоличествоЭлементовВРяду = 0;
	КоличествоРядовНаСтранице = 0;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВертикальнаяОриентация") Тогда
		ВертикальнаяОриентация = Форма.ВертикальнаяОриентация;
	КонецЕсли;
	
	Если Не ПалитраПлитки = Неопределено И ОбщегоНазначения.СсылкаСуществует(ПалитраПлитки) Тогда
		ИменаРеквизитов = "Наименование,КоличествоЭлементовВРяду,КоличествоРядов";
		РеквизитыПалитры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПалитраПлитки, ИменаРеквизитов);
		Если РеквизитыПалитры.КоличествоЭлементовВРяду > 0 И РеквизитыПалитры.КоличествоРядов > 0 Тогда
			
			КоличествоЭлементовВРяду = РеквизитыПалитры.КоличествоЭлементовВРяду;
			КоличествоРядовНаСтранице = РеквизитыПалитры.КоличествоРядов;
			
		КонецЕсли;
		ОбозначениеПалитры = РеквизитыПалитры.Наименование;
	КонецЕсли;
	Если КоличествоЭлементовВРяду < 2 Или КоличествоРядовНаСтранице < 2 Тогда
		РазмерыПлиткиПоУмолчанию
			= ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьРазмерыПлиткиПоУмолчанию(ВертикальнаяОриентация);
			
		Если КоличествоЭлементовВРяду < 2 Тогда
			КоличествоЭлементовВРяду = РазмерыПлиткиПоУмолчанию.КоличествоЭлементовВРяду;
		КонецЕсли;
		Если КоличествоРядовНаСтранице < 2 Тогда
			КоличествоРядовНаСтранице = РазмерыПлиткиПоУмолчанию.КоличествоРядовНаСтранице;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущийНомерКатегорииРазмещения = -1;
	ТекущийИсточникДанныхПалитры = -1;
	ОпорныеДанные = Форма.ОпорныеДанные;
	НовыйИндекс = 0;
	МаксимальноеКоличествоИзбранных = 0;
	СтрокаПакета = Неопределено;
	ЦветаПакетаУстановлены = Ложь;
	КоличествоВКатегориях = Новый Соответствие;
	КоличествоВКатегорияхПалитры = Новый Соответствие;
	НаименованияКатегорий = Новый Соответствие;
	НаименованияКатегорий.Вставить(0, ОбозначениеПалитры);
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ТекущийНомерКатегорииРазмещения = Выборка.НомерКатегорииРазмещенияЭлемента
			Или Не ТекущийИсточникДанныхПалитры = Выборка.ИсточникПлитки Тогда
			НовыйИндекс = 0;
			Если Выборка.ИсточникПлитки = ИсточникиДанныхПлитки.Избранное И Выборка.НомерКатегорииРазмещенияЭлемента = 0 Тогда
				СтрокаПакета = ДобавитьПакетВОпорныеДанныеПриНеобходимости(ОпорныеДанные, Форма, НовыйИндекс);
			КонецЕсли;
			ТекущийНомерКатегорииРазмещения = Выборка.НомерКатегорииРазмещенияЭлемента;
			ТекущийИсточникДанныхПалитры = Выборка.ИсточникПлитки;
		КонецЕсли;
		
		НовыйИндекс = НовыйИндекс + 1;
		
		СтрокаОпорныхДанных = ОпорныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОпорныхДанных, Выборка);
		СтрокаОпорныхДанных.ИндексПозицииВКатегории = НовыйИндекс;
		СтрокаОпорныхДанных.ДоступностьКоманды = Истина;
		СтрокаОпорныхДанных.ПервыйИндексПлитки = ОпорныеДанные.Индекс(СтрокаОпорныхДанных);
		
		СтрокаОпорныхДанных.ЦветШрифта = ОбщегоНазначения.ЗначениеИзСтрокиXML(Выборка.ЦветШрифта);
		СтрокаОпорныхДанных.ЦветФона = ОбщегоНазначения.ЗначениеИзСтрокиXML(Выборка.ЦветФона);
		
		Если Выборка.ИсточникПлитки = ИсточникиДанныхПлитки.Избранное И (Не СтрокаПакета = Неопределено)
				И (Не ЦветаПакетаУстановлены) И ЗначениеЗаполнено(СтрокаОпорныхДанных.Номенклатура) Тогда
			ЦветаПакетаУстановлены = Истина;
			СтрокаПакета.ЦветШрифта = СтрокаОпорныхДанных.ЦветШрифта;
			СтрокаПакета.ЦветФона = СтрокаОпорныхДанных.ЦветФона;
		КонецЕсли;
		
		СсылкаНаПрисоединенныйФайл = Выборка.ИзображениеЭлемента;
		Если Не СсылкаНаПрисоединенныйФайл.Пустая() Тогда
			АдресКартинки = НавигационнаяСсылкаИзображения(СсылкаНаПрисоединенныйФайл, УникальныйИдентификаторФормы);
			СтрокаОпорныхДанных.АдресИзображения = АдресКартинки;
		ИначеЕсли Выборка.ЭтоКатегория И Выборка.КартинкапоУмолчанию Тогда
			СтрокаОпорныхДанных.АдресИзображения = АдресКартинкиГруппыПоУмолчанию;
		ИначеЕсли Выборка.ЭтоПодарок И Выборка.КартинкапоУмолчанию Тогда
			СтрокаОпорныхДанных.АдресИзображения = АдресКартинкиПодаркаПоУмолчанию;
		КонецЕсли;
		
		Если Выборка.ИсточникПлитки = ИсточникиДанныхПлитки.Избранное Тогда
			МаксимальноеКоличествоИзбранных = Макс(МаксимальноеКоличествоИзбранных, СтрокаОпорныхДанных.ИндексПозицииВКатегории);
			ДобавитьКоличествоКатегории(КоличествоВКатегориях, СтрокаОпорныхДанных);
		ИначеЕсли Выборка.ИсточникПлитки = ИсточникиДанныхПлитки.Палитра Тогда
			ДобавитьКоличествоКатегории(КоличествоВКатегорияхПалитры, СтрокаОпорныхДанных);
		КонецЕсли;
		ДобавитьВКэшИмяКатегории(НаименованияКатегорий, Выборка, ИсточникиДанныхПлитки);
		
	КонецЦикла;
	
	Попытка
		КоличествоПлитокНаСтранице = КоличествоЭлементовВРяду * КоличествоРядовНаСтранице;
		Фильтр = Новый Структура;
		Фильтр.Вставить("ИмеетсяВложенность", Истина);
		Фильтр.Вставить("ЭтоТекущаяКатегория", Ложь);
		СтрокиПлитки = ОпорныеДанные.НайтиСтроки(Фильтр);
		ФильтрЭлемента = Новый Структура;
		
		Для Каждого СтрокаПлитки Из СтрокиПлитки Цикл
			
			Фильтр = Новый Структура;
			Фильтр.Вставить("ЭтоТекущаяКатегория", Истина);
			Фильтр.Вставить("НомерКатегорииРазмещенияЭлемента", СтрокаПлитки.НомерКатегории);
			Фильтр.Вставить("ИсточникПлитки", СтрокаПлитки.ИсточникПлитки);
			
			ЭлементыОпорныхДанных = ОпорныеДанные.НайтиСтроки(Фильтр);
			Если ЭлементыОпорныхДанных.Количество() Тогда
				ПервыйЭлементКатегорииПлитки = ЭлементыОпорныхДанных[0];
				СтрокаПлитки.ПервыйИндексПлитки = ОпорныеДанные.Индекс(ПервыйЭлементКатегорииПлитки);
				ЗаменитьИмяУОбратногоЭлементаПлитки(ПервыйЭлементКатегорииПлитки, СтрокаПлитки.НомерКатегорииРазмещенияЭлемента,
					НаименованияКатегорий, ИсточникиДанныхПлитки);
				
				НомерСтраницыВКатегории
					= ПолучитьНомерСтраницыЭлемента(СтрокаПлитки, КоличествоВКатегориях, КоличествоВКатегорияхПалитры,
						КоличествоПлитокНаСтранице);
				НачальныйИндексПозицииНаСтранице
					= ПолучитьНачальныйИндексНаСтранице(СтрокаПлитки, НомерСтраницыВКатегории, КоличествоПлитокНаСтранице);
				
				ФильтрЭлемента.Вставить("НомерКатегорииРазмещенияЭлемента", СтрокаПлитки.НомерКатегорииРазмещенияЭлемента);
				ФильтрЭлемента.Вставить("ИндексПозицииВКатегории", НачальныйИндексПозицииНаСтранице);
				ФильтрЭлемента.Вставить("ИсточникПлитки", СтрокаПлитки.ИсточникПлитки);
				СтрокаНачальнойПозиции = ОпорныеДанные.НайтиСтроки(ФильтрЭлемента)[0];
				
				Если СтрокаПлитки.НомерКатегорииРазмещенияЭлемента = 0 Тогда
					ПервыйЭлементКатегорииПлитки.ПервыйИндексПлитки = ОпорныеДанные.Индекс(СтрокаНачальнойПозиции);
				Иначе
					ПервыйЭлементКатегорииПлитки.ВторойИндексПлитки = ОпорныеДанные.Индекс(СтрокаНачальнойПозиции);
					ФильтрЭлемента.Вставить("ИндексПозицииВКатегории", 1);
					СтрокаПозицииГруппы = ОпорныеДанные.НайтиСтроки(ФильтрЭлемента)[0];
					ПервыйЭлементКатегорииПлитки.ПервыйИндексПлитки = ОпорныеДанные.Индекс(СтрокаПозицииГруппы);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ОпорныеДанные.Очистить();
	КонецПопытки;
	
	ТекущийПервыйИндексИзбранного = -1;
	ТекущийВторойИндексИзбранного = -1;
	ТекущийПервыйИндексПлитки = -1;
	ТекущийВторойИндексПлитки = -1;
	ТекущаяСтраницаКнопок = -1;
	Фильтр = Новый Структура;
	Фильтр.Вставить("НомерКатегорииРазмещенияЭлемента", 0);
	Фильтр.Вставить("ИндексПозицииВКатегории", 1);
	Фильтр.Вставить("ИсточникПлитки", ИсточникиДанныхПлитки.Палитра);
	СтрокиПлитки = ОпорныеДанные.НайтиСтроки(Фильтр);
	
	Если СтрокиПлитки.Количество() > 0 Тогда
		ТекущийПервыйИндексПлитки = ОпорныеДанные.Индекс(СтрокиПлитки[0]);
		Фильтр.Вставить("ИндексПозицииВКатегории", 2);
		СтрокиПлитки = ОпорныеДанные.НайтиСтроки(Фильтр);
		Если СтрокиПлитки.Количество() > 0 Тогда
			ТекущийВторойИндексПлитки = ОпорныеДанные.Индекс(СтрокиПлитки[0]);
		КонецЕсли;
	КонецЕсли;
	
	Фильтр.Вставить("ИсточникПлитки", ИсточникиДанныхПлитки.Избранное);
	Фильтр.Вставить("ИндексПозицииВКатегории", 1);
	СтрокиПлитки = ОпорныеДанные.НайтиСтроки(Фильтр);
	Если СтрокиПлитки.Количество() = 0 Тогда
		СтрокаПакета = ДобавитьПакетВОпорныеДанныеПриНеобходимости(ОпорныеДанные, Форма, 0);
	КонецЕсли;
	
	СтрокиПлитки = ОпорныеДанные.НайтиСтроки(Фильтр);
	Если СтрокиПлитки.Количество() > 0 Тогда
		ТекущаяСтраницаКнопок = ОпорныеДанные.Индекс(СтрокиПлитки[0]);
		ТекущийПервыйИндексИзбранного = ТекущаяСтраницаКнопок;
		Фильтр.Вставить("ИндексПозицииВКатегории", 2);
		СтрокиПлитки = ОпорныеДанные.НайтиСтроки(Фильтр);
		Если СтрокиПлитки.Количество() > 0 Тогда
			ТекущийВторойИндексИзбранного = ОпорныеДанные.Индекс(СтрокиПлитки[0]);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("КоличествоЭлементовВРяду", КоличествоЭлементовВРяду);
	СтруктураРеквизитовФормы.Вставить("КоличествоРядовНаСтранице", КоличествоРядовНаСтранице);
	СтруктураРеквизитовФормы.Вставить("ТекущийПервыйИндексПлитки", ТекущийПервыйИндексПлитки);
	СтруктураРеквизитовФормы.Вставить("ТекущийВторойИндексПлитки", ТекущийВторойИндексПлитки);
	СтруктураРеквизитовФормы.Вставить("ТекущаяСтраницаКнопок", ТекущаяСтраницаКнопок);
	СтруктураРеквизитовФормы.Вставить("ТекущийПервыйИндексИзбранного", ТекущийПервыйИндексИзбранного);
	СтруктураРеквизитовФормы.Вставить("ТекущийВторойИндексИзбранного", ТекущийВторойИндексИзбранного);
	СтруктураРеквизитовФормы.Вставить("МаксимальноеКоличествоИзбранныхНаСтранице", МаксимальноеКоличествоИзбранных);
	СтруктураРеквизитовФормы.Вставить("ЕстьГруппыИзбранногоБолее4", (МаксимальноеКоличествоИзбранных > 4));
	ЗаполнитьЗначенияСвойств(Форма, СтруктураРеквизитовФормы);
	
КонецПроцедуры

Процедура ДобавитьВКэшИмяКатегории(НаименованияКатегорий, Выборка, ИсточникиДанныхПлитки)
	
	Если Выборка.ЭтоКатегория И Выборка.ИсточникПлитки = ИсточникиДанныхПлитки.Палитра
			И Не Выборка.ЭтоТекущаяКатегория Тогда
		Если НаименованияКатегорий.Получить(Выборка.НомерКатегории) = Неопределено Тогда
			НаименованияКатегорий.Вставить(Выборка.НомерКатегории, Выборка.ИмяЭлемента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаменитьИмяУОбратногоЭлементаПлитки(СтрокаДанных, НомерКатегорииРодителя,
		НаименованияКатегорий, ИсточникиДанныхПлитки)
		
	Если СтрокаДанных.ИсточникПлитки = ИсточникиДанныхПлитки.Палитра Тогда
		НаименованиеРодителяКатегории = НаименованияКатегорий.Получить(НомерКатегорииРодителя);
		Если Не НаименованиеРодителяКатегории = Неопределено Тогда
			СтрокаДанных.ИмяЭлемента = НаименованиеРодителяКатегории;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Функция ТекстЗапросаТоваровДляУстройствИзПалитры()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыУстройств.Номенклатура КАК Номенклатура,
	|	ТоварыУстройств.Характеристика КАК Характеристика,
	|	ТоварыУстройств.Весовой КАК Весовой,
	|	ТоварыУстройств.SKU КАК SKU
	|ПОМЕСТИТЬ втТоварыУстройств
	|ИЗ
	|	&ТоварыУстройств КАК ТоварыУстройств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
	|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
	|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
	|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
	|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
	|	ПалитраТоваровРМКСостав.КартинкаПоУмолчанию КАК КартинкаПоУмолчанию,
	|	ЕСТЬNULL(ТоварыУстройств.SKU, 0) КАК SKU,
	|	ЕСТЬNULL(ТоварыУстройств.Весовой, ЛОЖЬ) КАК Весовой
	|ПОМЕСТИТЬ ПалитраТоваровРМКСостав
	|ИЗ
	|	Справочник.ПалитраТоваровРМК.Состав КАК ПалитраТоваровРМКСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТоварыУстройств КАК ТоварыУстройств
	|		ПО (ТоварыУстройств.Номенклатура = ПалитраТоваровРМКСостав.Номенклатура
	|					И ТоварыУстройств.Характеристика = ПалитраТоваровРМКСостав.Характеристика)
	|ГДЕ
	|	ПалитраТоваровРМКСостав.Ссылка = &ПалитраТоваров
	|	И (ЕСТЬNULL(ТоварыУстройств.SKU, 0) > 0 ИЛИ ПалитраТоваровРМКСостав.ЭтоКатегория)
	|	И ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.SKU КАК SKU
	|ПОМЕСТИТЬ СтруктураПалитрыБезМодификаторов
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	0 КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегорииРазмещенияЭлемента,
	|	1 КАК ИндексПозицииВКатегории,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ИСТИНА КАК ЭтоТекущаяКатегория,
	|	1 КАК ПорядокВидов
	|ПОМЕСТИТЬ ИтоговаяСтруктура
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|ГДЕ
	|	ПалитраТоваровРМКСостав.НомерКатегории > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураПалитрыБезМодификаторов.НомерСтроки,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегории,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегорииРазмещения,
	|	СтруктураПалитрыБезМодификаторов.ИндексПозиции,
	|	СтруктураПалитрыБезМодификаторов.ЭтоКатегория,
	|	СтруктураПалитрыБезМодификаторов.ИмеетсяВложенность,
	|	ЛОЖЬ,
	|	3
	|ИЗ
	|	СтруктураПалитрыБезМодификаторов КАК СтруктураПалитрыБезМодификаторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ИсточникПлитки,
	|	ИтоговаяСтруктура.НомерСтроки КАК НомерСтроки,
	|	ИтоговаяСтруктура.НомерКатегорииРазмещенияЭлемента КАК НомерКатегорииРазмещенияЭлемента,
	|	ИтоговаяСтруктура.ПорядокВидов КАК ПорядокВидов,
	|	ИтоговаяСтруктура.ИндексПозицииВКатегории КАК ИндексПозицииВКатегории,
	|	ИтоговаяСтруктура.НомерКатегории КАК НомерКатегории,
	|	ИтоговаяСтруктура.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ИтоговаяСтруктура.ЭтоКатегория КАК ЭтоКатегория,
	|	ИтоговаяСтруктура.ЭтоТекущаяКатегория КАК ЭтоТекущаяКатегория,
	|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
	|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
	|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
	|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
	|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
	|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
	|	ПалитраТоваровРМКСостав.КартинкаПоУмолчанию КАК КартинкаПоУмолчанию,
	|	ПалитраТоваровРМКСостав.SKU КАК SKU,
	|	ПалитраТоваровРМКСостав.Весовой КАК Весовой,
	|	ЛОЖЬ КАК ЭтоПодарок
	|ИЗ
	|	ИтоговаяСтруктура КАК ИтоговаяСтруктура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ПО ИтоговаяСтруктура.НомерСтроки = ПалитраТоваровРМКСостав.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерКатегорииРазмещенияЭлемента,
	|	ПорядокВидов,
	|	ИндексПозицииВКатегории";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВыделитьНеПопавшиеВПалитруТовары(ТаблицаТоваровПолная, ТаблицаТоваровПалитры)
	
	РезультатФункции = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваровПолная.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваровПолная.Характеристика КАК Характеристика,
	|	ТаблицаТоваровПолная.Весовой КАК Весовой,
	|	ТаблицаТоваровПолная.SKU КАК SKU
	|ПОМЕСТИТЬ втТаблицаТоваровПолная
	|ИЗ
	|	&ТаблицаТоваровПолная КАК ТаблицаТоваровПолная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваровПалитры.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваровПалитры.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ втТаблицаТоваровПалитры
	|ИЗ
	|	&ТаблицаТоваровПалитры КАК ТаблицаТоваровПалитры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваровПолная.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваровПолная.Характеристика КАК Характеристика,
	|	ТаблицаТоваровПолная.Весовой КАК Весовой,
	|	ТаблицаТоваровПолная.SKU КАК SKU
	|ИЗ
	|	втТаблицаТоваровПолная КАК ТаблицаТоваровПолная
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаТоваровПалитры КАК втТаблицаТоваровПалитры
	|		ПО ТаблицаТоваровПолная.Номенклатура = втТаблицаТоваровПалитры.Номенклатура
	|			И ТаблицаТоваровПолная.Характеристика = втТаблицаТоваровПалитры.Характеристика
	|ГДЕ
	|	втТаблицаТоваровПалитры.Номенклатура ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ТаблицаТоваровПолная", ТаблицаТоваровПолная);
	Запрос.УстановитьПараметр("ТаблицаТоваровПалитры", ТаблицаТоваровПалитры);

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		РезультатФункции = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьВОпорныеДанныеТоварыНеИзПалитры(Форма,
		ТаблицаТоваров,
		НужнаОтдельнаяГруппа,
		ЦветФона,
		ДополнительныеПараметры = Неопределено)
		
	ОпорныеДанные = Форма.ОпорныеДанные;
	НомерКатагорииГруппы = 0;
	Если НужнаОтдельнаяГруппа Тогда
		ДобавитьГруппуОстальныхТоваровВОпорныеДанные(Форма, ДополнительныеПараметры, НомерКатагорииГруппы);
	КонецЕсли;
	ИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	ЗапросИзображений = Новый Запрос;
	ЗапросИзображений.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Весовой КАК Весовой,
	|	ТаблицаТоваров.SKU КАК SKU
	|ПОМЕСТИТЬ втТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ПалитраТоваровРМКСостав.ИзображениеЭлемента) КАК ИзображениеЭлемента
	|ПОМЕСТИТЬ втИзображенияТовара
	|ИЗ
	|	Справочник.ПалитраТоваровРМК.Состав КАК ПалитраТоваровРМКСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ПалитраТоваровРМКСостав.Номенклатура = ТаблицаТоваров.Номенклатура
	|			И ПалитраТоваровРМКСостав.Характеристика = ТаблицаТоваров.Характеристика
	|ГДЕ
	|	НЕ ПалитраТоваровРМКСостав.Ссылка.ПометкаУдаления
	|	И НЕ ПалитраТоваровРМКСостав.ИзображениеЭлемента = ЗНАЧЕНИЕ(Справочник.ПалитраТоваровРМКПрисоединенныеФайлы.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПалитраТоваровРМКСостав.Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Характеристика.Наименование КАК ХарактеристикаНаименование,
	|	ТаблицаТоваров.Весовой КАК Весовой,
	|	ТаблицаТоваров.SKU КАК SKU,
	|	ЕСТЬNULL(втИзображенияТовара.ИзображениеЭлемента, ЗНАЧЕНИЕ(Справочник.ПалитраТоваровРМКПрисоединенныеФайлы.ПустаяСсылка)) КАК Изображение
	|ИЗ
	|	втТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИзображенияТовара КАК втИзображенияТовара
	|		ПО ТаблицаТоваров.Номенклатура = втИзображенияТовара.Номенклатура
	|			И ТаблицаТоваров.Характеристика = втИзображенияТовара.Характеристика";
	ЗапросИзображений.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	
	ЦветЧерный = ЦветаСтиля.ЦветТекстаПодсказки;
	ИсточникиПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ИндексПозицииВКатегории = ?(НужнаОтдельнаяГруппа, 2, 1);
	Выборка = ЗапросИзображений.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаОпорныхДанных = ОпорныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОпорныхДанных, Выборка);
		СтрокаОпорныхДанных.НомерКатегории = 0;
		СтрокаОпорныхДанных.ИндексПозицииВКатегории = ИндексПозицииВКатегории;
		СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента = НомерКатагорииГруппы;
		СтрокаОпорныхДанных.ЦветШрифта = ЦветЧерный;
		СтрокаОпорныхДанных.ЦветФона = ЦветФона;
		ИмяХарактеристики = "";
		Если ЗначениеЗаполнено(Выборка.Характеристика) Тогда
			ИмяХарактеристики = СтрШаблон(", %1", Выборка.ХарактеристикаНаименование);
		КонецЕсли;
		ИмяЭлемента = СтрШаблон("%1%2", Выборка.НоменклатураНаименование, ИмяХарактеристики);
		СтрокаОпорныхДанных.ИмяЭлемента = ИмяЭлемента;
		СтрокаОпорныхДанных.ДоступностьКоманды = Истина;
		СтрокаОпорныхДанных.ПервыйИндексПлитки = ОпорныеДанные.Индекс(СтрокаОпорныхДанных);
		СтрокаОпорныхДанных.ИсточникПлитки = ИсточникиПлитки.ВесовойТовар;
		Если ЗначениеЗаполнено(Выборка.Изображение) Тогда
			АдресКартинки = РаботаСФайлами.ДанныеФайла(Выборка.Изображение, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
			СтрокаОпорныхДанных.АдресИзображения = АдресКартинки;
		КонецЕсли;
		
		ИндексПозицииВКатегории = ИндексПозицииВКатегории + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОбозначениеПалитрыПоУмолчанию()
	
	Возврат НСтр("ru = 'На главную'");
	
КонецФункции

Процедура ДобавитьГруппуОстальныхТоваровВОпорныеДанные(Форма, ДополнительныеПараметры, НомерКатагорииГруппы)
	
	ИсточникиПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ОпорныеДанные = Форма.ОпорныеДанные;
	НомерКатагорииГруппы = 1;
	ИндексПозицииВКатегории = 1;
	Если Не ДополнительныеПараметры = Неопределено Тогда
		НомерКатагорииГруппы = ДополнительныеПараметры.МаксимальныйНомерКатегории + 1;
		ИндексПозицииВКатегории = ДополнительныеПараметры.МаксимальныйИндексПозицииВНулевойКатегории + 1;
	КонецЕсли;
	
	ЦветЧерный = ЦветаСтиля.ЦветТекстаПодсказки;
	ИмяГруппыОстальныхТоваров = НСтр("ru = 'Остальные товары'");
	ИмяОбратнойГруппы = НСтр("ru = 'Все весовые товары'");
	ТекущееКоличествоЭлементов = ОпорныеДанные.Количество();

	// Добавление группы
	СтрокаОпорныхДанных = ОпорныеДанные.Добавить();
	СтрокаОпорныхДанных.НомерКатегории = НомерКатагорииГруппы;
	СтрокаОпорныхДанных.ИндексПозицииВКатегории = ИндексПозицииВКатегории;
	СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента = 0;
	СтрокаОпорныхДанных.ЭтоКатегория = Истина;
	СтрокаОпорныхДанных.ЦветШрифта = ЦветЧерный;
	СтрокаОпорныхДанных.ЦветФона = Форма.ЦветаФормы.ПапкаКнопка;
	СтрокаОпорныхДанных.ИмяЭлемента = ИмяГруппыОстальныхТоваров;
	СтрокаОпорныхДанных.ДоступностьКоманды = Истина;
	СтрокаОпорныхДанных.ПервыйИндексПлитки = ТекущееКоличествоЭлементов + 1;
	СтрокаОпорныхДанных.ИмеетсяВложенность = Истина;
	СтрокаОпорныхДанных.ИсточникПлитки = ИсточникиПлитки.ВесовойТовар;
	СтрокаОпорныхДанных.ЭтоТекущаяКатегория = Ложь;
	
	// Добавление обратной группы
	СтрокаОпорныхДанных = ОпорныеДанные.Добавить();
	СтрокаОпорныхДанных.НомерКатегории = 0;
	СтрокаОпорныхДанных.ИндексПозицииВКатегории = 1;
	СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента = НомерКатагорииГруппы;
	СтрокаОпорныхДанных.ЭтоКатегория = Истина;
	СтрокаОпорныхДанных.ЦветШрифта = ЦветЧерный;
	СтрокаОпорныхДанных.ЦветФона = Форма.ЦветаФормы.ПапкаКнопка;
	СтрокаОпорныхДанных.ИмяЭлемента = ИмяОбратнойГруппы;
	СтрокаОпорныхДанных.ДоступностьКоманды = Истина;
	СтрокаОпорныхДанных.ПервыйИндексПлитки = 0;
	СтрокаОпорныхДанных.ИмеетсяВложенность = Истина;
	СтрокаОпорныхДанных.ИсточникПлитки = ИсточникиПлитки.ВесовойТовар;
	СтрокаОпорныхДанных.ЭтоТекущаяКатегория = Истина;
	
КонецПроцедуры

Функция ПолучитьТаблицуТоваровОпорныхДанных(ОпорныеДанные, ДополнительныеПараметры)
	
	ТаблицаТоваров = ОпорныеДанные.Выгрузить(Новый Массив, "Номенклатура,Характеристика");
	Для Каждого СтрокаОпорныхДанных Из ОпорныеДанные Цикл
		Если ЗначениеЗаполнено(СтрокаОпорныхДанных.Номенклатура) Тогда
			НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура = СтрокаОпорныхДанных.Номенклатура;
			НоваяСтрока.Характеристика = СтрокаОпорныхДанных.Характеристика;
		КонецЕсли;
		Если СтрокаОпорныхДанных.НомерКатегории > ДополнительныеПараметры.МаксимальныйНомерКатегории Тогда
			ДополнительныеПараметры.МаксимальныйНомерКатегории = СтрокаОпорныхДанных.НомерКатегории;
		КонецЕсли;
		Если СтрокаОпорныхДанных.ИндексПозицииВКатегории > ДополнительныеПараметры.МаксимальныйИндексПозицииВНулевойКатегории
				И СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента = 0 Тогда
			ДополнительныеПараметры.МаксимальныйИндексПозицииВНулевойКатегории = СтрокаОпорныхДанных.ИндексПозицииВКатегории;
		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаТоваров;
	
КонецФункции

Процедура ПрименитьИсключенияОбработкиПорядкаОбластей(Форма, ТаблицаПорядка)
	
	УстановитьНастройкиПорядкаОбластейПоУмолчанию(Форма);
	Если Форма.ВертикальнаяОриентация Тогда
		ПрименитьИсключенияОбработкиПорядкаОбластейВертикальнаяОриентация(Форма, ТаблицаПорядка);
	Иначе
		ПрименитьИсключенияОбработкиПорядкаОбластейГоризонтальнаяОриентация(Форма, ТаблицаПорядка);
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьПорядокГоризонтальныхПанелей(ТаблицаПорядка)
	
	ПорядокПанелей = Новый Структура();

	ИмяГруппыШапкиТоваров = "ГруппаИнфо_Горизонтальная";
	ИмяГруппыДанныхЧека = "СтраницыОбластиСоставаЧека_Горизонтальная";
	ИмяГруппыРодителяКоманднойПанели = "ГруппаУправленияЧекомГор_Горизонтальная";
	ИмяРабочейОбласти = "Страницы_Горизонтальная";
	ИмяГруппыИтогиИОплаты = "ПраваяКолонкаУправленияЧеком_Горизонтальная";
	ИмяГруппыИтогов = "ГруппаСуммыТоваров_Горизонтальная";
	ИмяГруппыПереходаКОплате = "ОсновнаяКоманднаяПанельУправленияЧеком_Горизонтальная";
	ИмяГруппыОплатить = "ГруппаКомандКОплате_Горизонтальная";
	
	ПорядокПанелей.Вставить("ПорядокДанныхТовара",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяГруппыДанныхЧека, ИмяГруппыШапкиТоваров));
	ПорядокПанелей.Вставить("ПорядокПанелиУправления",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяРабочейОбласти, ИмяГруппыРодителяКоманднойПанели));
	ПорядокПанелей.Вставить("ПорядокИтогов",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяГруппыИтогиИОплаты, ИмяГруппыИтогов));
	ПорядокПанелей.Вставить("ПорядокКомандыОплаты",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяГруппыПереходаКОплате, ИмяГруппыОплатить));
	
	Возврат ПорядокПанелей;
	
КонецФункции

Процедура ПрименитьИсключенияОбработкиПорядкаОбластейГоризонтальнаяОриентация(Форма, ТаблицаПорядка)
	
	Элементы = Форма.Элементы;
	Элементы.ГруппаЦифроваяПанель.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	
	ПорядокПанелей = ОпределитьПорядокГоризонтальныхПанелей(ТаблицаПорядка);
	
	Если ПорядокПанелей.ПорядокДанныхТовара > 1 Тогда
		Если ПорядокПанелей.ПорядокИтогов = 1 Тогда
			Элементы.Переместить(Элементы.ПлиткаГруппаИнфо, Элементы.ГруппаЛево, Элементы.ПлиткаГруппаНиз);
		Иначе
			Элементы.Переместить(Элементы.ПлиткаГруппаИнфо, Элементы.ГруппаЛево, Неопределено);
		КонецЕсли;
		Элементы.Переместить(Элементы.ПлиткаИнфоТекущейСтроки, Элементы.ПлиткаГруппаИнфо, Неопределено);
	КонецЕсли;
	Если ПорядокПанелей.ПорядокПанелиУправления = 1 Тогда
		Элементы.Переместить(Элементы.ГруппаРаботаСТоварамиПлитки, Элементы.ПлиткаГруппаДанные, Элементы.ПанельПодбора);
	КонецЕсли;
	
	Если ПорядокПанелей.ПорядокИтогов > 1 Тогда
		Элементы.Переместить(Элементы.ПлиткаГруппаОплатить, Элементы.ГруппаЛево,
			Элементы.НастраиваемаяПанельЛево);
			Если ПорядокПанелей.ПорядокДанныхТовара = 1 Тогда //
				Элементы.Переместить(Элементы.ПлиткаГруппаИнфо, Элементы.ГруппаЛево, Элементы.НастраиваемаяПанельЛево);
			КонецЕсли; //
		Элементы.ГруппаЦифроваяПанель.ВертикальноеПоложениеВГруппе
			= ВертикальноеПоложениеЭлемента.Верх;
		Элементы.ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком.ВертикальноеПоложениеПодчиненных
			= ВертикальноеПоложениеЭлемента.Верх;
		Элементы.ГруппаСуммыТоваров.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
		Элементы.ГруппаСуммыТоваров.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Низ;
	КонецЕсли;
	Если ПорядокПанелей.ПорядокКомандыОплаты = 1 Тогда
		Элементы.Переместить(Элементы.ГруппаКомандСозданияЗаказа, Элементы.ГруппаКомандПереходаКОплате,
			Элементы.ГруппаДополнительногоУправленияОплат);
		Если ПорядокПанелей.ПорядокИтогов > 1 Тогда
			Элементы.Переместить(Элементы.ОтсутQRCode, Элементы.ГруппаQRCode, Неопределено);
		Иначе
			Элементы.ОтступГруппыКомандКОплате.Видимость = Истина;
			Элементы.ОтсутQRCode.Видимость = Ложь;
			Элементы.Переместить(Элементы.ОтступГруппыКомандКОплате, Элементы.ГруппаКомандКОплате,
				Элементы.ГруппаВысотыКнопкиПерейтиКОплате);
		КонецЕсли;
	Иначе
		Элементы.Переместить(Элементы.ГруппаКомандСозданияЗаказа, Элементы.ГруппаКомандПереходаКОплате,
			Элементы.ГруппаКомандКОплате);
		Если ПорядокПанелей.ПорядокИтогов > 1 Тогда
			Элементы.ОтступГруппыКомандКОплате.Видимость = Истина;
			Элементы.ОтсутQRCode.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьПорядокВертикальныхПанелей(ТаблицаПорядка)
	
	ПорядокПанелей = Новый Структура();
	
	ИмяКорневойГруппы = "ВертикальнаяОриентация";
	ИмяПанелиОпераций = "ГруппаУправленияСтатическая_Вертикальная";
	ИмяРодителяПанелиИтоговЧека = "ГруппаУправленияЧекомВер_Вертикальная";
	ИмяПанелиИтогоЧека = "ПраваяКолонкаУправленияЧеком_Вертикальная";
	ИмяРабочейОбласти = "Страницы_Вертикальная";
	ИмяГруппыРаботыСТоварами = "СтраницыОбластиСоставаЧека_Вертикальная";
	ИмяГруппыДанныхТовара = "ГруппаИнфо_Вертикальная";
	ИмяГруппыСпискаТоваров = "ПанельТаблицыТоваров_Вертикальная";
	ИмяГруппыПереходаКОплате = "ОсновнаяКоманднаяПанельУправленияЧеком_Вертикальная";
	
	ПорядокПанелей.Вставить("ПорядокОплатить",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяПанелиИтогоЧека, ИмяГруппыПереходаКОплате));
	ПорядокПанелей.Вставить("ПорядокКолонкиУправления",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяРодителяПанелиИтоговЧека, ИмяПанелиИтогоЧека));
	ПорядокПанелей.Вставить("ПорядокГруппыОпераций",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяКорневойГруппы, ИмяПанелиОпераций));
	ПорядокПанелей.Вставить("ПорядокПанелиУправления",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяРабочейОбласти, ИмяРодителяПанелиИтоговЧека));
	ПорядокПанелей.Вставить("ПорядокДанныхТекущегоТовара",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяГруппыРаботыСТоварами, ИмяГруппыДанныхТовара));
	ПорядокПанелей.Вставить("ПорядокСпискаТоваров",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяГруппыРаботыСТоварами, ИмяГруппыСпискаТоваров));
	
	Возврат ПорядокПанелей;
	
КонецФункции

Процедура ПрименитьИсключенияОбработкиПорядкаОбластейВертикальнаяОриентация(Форма, ТаблицаПорядка)
	
	Элементы = Форма.Элементы;
	Элементы.Переместить(Элементы.ПлиткаГруппаИнфо, Элементы.ПлиткаТаблицаТоваровВер, Элементы.НастраиваемаяПанельЛево);
	
	НаправлениеВерх = ВертикальноеПоложениеЭлемента.Верх;
	НаправлениеПраво = ГоризонтальноеПоложениеЭлемента.Право;
	
	ПорядокПанелей = ОпределитьПорядокВертикальныхПанелей(ТаблицаПорядка);
	Если ПорядокПанелей.ПорядокОплатить = 1 Тогда
		Элементы.Переместить(Элементы.ПлиткаГруппаОплатить, Элементы.ПлиткаГруппаНиз,
			Элементы.ПлиткаГруппаИтого);
		Элементы.ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком.ВертикальноеПоложениеПодчиненных
			= ВертикальноеПоложениеЭлемента.Верх;
		Элементы.КолонкаБыстрыхОплат.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Верх;
		Элементы.СуммаИтогоПлитка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	КонецЕсли;
	
	Если ПорядокПанелей.ПорядокКолонкиУправления = 1 Тогда
		Элементы.ЛеваяСредняяКолонкиУправленияЧеком.ГоризонтальноеПоложениеВГруппе = НаправлениеПраво;
		Элементы.ПраваяКолонкаУправленияЧеком.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		Элементы.Переместить(Элементы.КолонкаЛояльности, Элементы.ГруппаЛояльностиИБыстрыхОплат, Неопределено);
		
		Элементы.ГруппаСлоевЛеваяВерхняяВспомогательнаяПанель.ГоризонтальноеПоложениеВГруппе
			= ГоризонтальноеПоложениеЭлемента.Право;
		Элементы.Переместить(Элементы.ПлиткаПанельИтоговВер, Элементы.ОболочкаПлиткиВер, Элементы.ПлиткаТаблицаТоваровВер);
	КонецЕсли;
	
	Если ПорядокПанелей.ПорядокДанныхТекущегоТовара > ПорядокПанелей.ПорядокСпискаТоваров Тогда
		Элементы.Переместить(Элементы.ПлиткаГруппаИнфо, Элементы.ПлиткаТаблицаТоваровВер, Неопределено);
		Элементы.Переместить(Элементы.ПлиткаИнфоТекущейСтроки, Элементы.ПлиткаГруппаИнфо, Неопределено);
	КонецЕсли;
	
	Если ПорядокПанелей.ПорядокПанелиУправления = 1 Тогда
		Элементы.Переместить(Элементы.ГруппаРаботаСТоварамиПлитки, Элементы.ПлиткаГруппаДанные, Элементы.ПанельПодбора);
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяРодительскойГруппы, ИмяПанели)
	
	РезультатФункции = 0;
	
	ОтборСтрокРодителя = Новый Структура("ОбластьРодитель", ИмяРодительскойГруппы);
	СтрокиГруппы = ТаблицаПорядка.НайтиСтроки(ОтборСтрокРодителя);
	КоличествоСтрок = СтрокиГруппы.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = 0 Цикл
		СтрокаГруппы = СтрокиГруппы[ИндексСтроки];
		Если СтрокаГруппы.Область = ИмяПанели Тогда
			РезультатФункции = СтрокаГруппы.Порядок;
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УстановитьНастройкиПорядкаОбластейПоУмолчанию(Форма)
	
	Элементы = Форма.Элементы;
	НаправлениеНиз = ВертикальноеПоложениеЭлемента.Низ;
	НаправлениеЛево = ГоризонтальноеПоложениеЭлемента.Лево;
	НаправлениеПраво = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.ОтступКоманднойПанели.Видимость = Ложь;
	Элементы.СводнаяПанельИтоговЧекаГор.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Авто;
	Элементы.КоманднаяПанельУправленияЧекомГор.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	Элементы.ЛеваяСредняяКолонкиУправленияЧеком.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Авто;
	Элементы.ПраваяКолонкаУправленияЧеком.ГоризонтальноеПоложениеВГруппе = НаправлениеПраво;
	Элементы.ГруппаСлоевЛеваяВерхняяВспомогательнаяПанель.ГоризонтальноеПоложениеВГруппе
		= ГоризонтальноеПоложениеЭлемента.Авто;
	
	Элементы.Переместить(Элементы.ГруппаРаботаСТоварамиПлитки, Элементы.ПлиткаГруппаДанные, Неопределено);
	Элементы.Переместить(Элементы.ПлиткаГруппаОплатить, Элементы.ПлиткаГруппаНиз, Неопределено);
	Элементы.Переместить(Элементы.ПлиткаПанельИтоговВер, Элементы.ОболочкаПлиткиВер, Неопределено);
	Элементы.Переместить(Элементы.ПлиткаИнфоТекущейСтроки, Элементы.ПлиткаГруппаИнфо, Элементы.ПлиткаГруппаПродавец);
	
	Элементы.ГруппаУправленияОплатамиГор.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	Элементы.СуммаИтогоПлитка.ВертикальноеПоложениеВГруппе = ?(Форма.ВертикальнаяОриентация,
		ВертикальноеПоложениеЭлемента.Верх, ВертикальноеПоложениеЭлемента.Низ);
	
	Элементы.ГруппаЦифроваяПанель.ВертикальноеПоложениеВГруппе
		= ВертикальноеПоложениеЭлемента.Низ;
	Элементы.ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком.ВертикальноеПоложениеПодчиненных
		= ВертикальноеПоложениеЭлемента.Низ;
		
	Элементы.ГруппаСуммыТоваров.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	Элементы.ГруппаСуммыТоваров.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Верх;
	
	Элементы.Переместить(Элементы.ГруппаКомандСозданияЗаказа, Элементы.ГруппаКомандПереходаКОплате,
		Элементы.ГруппаКомандКОплате);
	Элементы.ОтступГруппыКомандКОплате.Видимость = Ложь;
	Элементы.ОтсутQRCode.Видимость = Не Форма.ВертикальнаяОриентация;
	Элементы.Переместить(Элементы.КолонкаЛояльности, Элементы.ГруппаЛояльностиИБыстрыхОплат,
		Элементы.КолонкаБыстрыхОплат);
	Элементы.КолонкаБыстрыхОплат.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Низ;
	Элементы.Переместить(Элементы.ОтсутQRCode, Элементы.ГруппаQRCode, Элементы.ГруппаQRCodeНаличные);
	Элементы.Переместить(Элементы.ОтступГруппыКомандКОплате, Элементы.ГруппаКомандКОплате, Неопределено);
	
КонецПроцедуры

Функция СформироватьСоставПалитрыСУчетомВложенныхПалитр(Форма)

	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ПалитраПлитки = Справочники.ПалитраТоваровРМК.ПустаяСсылка();
	МассивПалитр = Новый СписокЗначений;
	ЗаполнитьПараметрыПалитрыДляСКД(Форма, ПалитраПлитки, МассивПалитр);
	
	СхемаИерархииПалитры = Справочники.ПалитраТоваровРМК.ПолучитьМакет("МакетПалитрыСКД");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаИерархииПалитры.НастройкиПоУмолчанию);

	ПараметрПалитраПлитка = Новый ПараметрКомпоновкиДанных("ПалитраПлитка");
	ПараметрМассивПалитр = Новый ПараметрКомпоновкиДанных("МассивПалитр");
	ПараметрИсточникПалитрыПлитка = Новый ПараметрКомпоновкиДанных("ИсточникПалитрыПлитка");
	ПараметрИсточникПалитрыИзбранное = Новый ПараметрКомпоновкиДанных("ИсточникПалитрыИзбранное");
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрПалитраПлитка, ПалитраПлитки);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрМассивПалитр, МассивПалитр);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрИсточникПалитрыПлитка,
		ИсточникиДанныхПлитки.Палитра);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрИсточникПалитрыИзбранное,
		ИсточникиДанныхПлитки.Избранное);
	
	ТекущиеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	ТипГенератораДляКоллекции = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаИерархииПалитры, ТекущиеНастройки, , , ТипГенератораДляКоллекции);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ДеревоИерархииПалитры = Новый ДеревоЗначений;
	ПроцессорВывода.УстановитьОбъект(ДеревоИерархииПалитры);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат СформироватьЛинейныйИерархическийСоставПалитр(ДеревоИерархииПалитры);
	
КонецФункции

Процедура ОбойтиСтрокиДереваСоставаПалитры(ТаблицаПалитры, СтрокиУровня, ДанныеПреобразования,
		Знач УровеньДерева, ИсточникПалитры)
	
	УровеньДерева = УровеньДерева + 1;
	Для Каждого СтрокаДерева Из СтрокиУровня Цикл
		
		Если УровеньДерева = 1 Тогда
			Если ИсточникПалитры <> СтрокаДерева.ИсточникПалитры Тогда
				Если ИсточникПалитры > 0 Тогда
					ОчиститьДанныеПреобразования(ДанныеПреобразования);
					ДанныеПреобразования = ИнициализироватьДанныеПреобразования();
				КонецЕсли;
				ИсточникПалитры = СтрокаДерева.ИсточникПалитры;
				ДобавитьКорневуюКатегориюВДанныеПреобразования(ДанныеПреобразования, СтрокаДерева.ПалитраВладелец);
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаДерева.ЭтоПалитра Тогда
			ОбойтиСтрокиДереваСоставаПалитры(ТаблицаПалитры, СтрокаДерева.Строки,
				ДанныеПреобразования, УровеньДерева, ИсточникПалитры);
		Иначе
			Если Не (ЗначениеЗаполнено(СтрокаДерева.Номенклатура)
					И ОбщегоНазначенияРМК.ТребуетсяВводХарактеристикиДляНоменклатуры(СтрокаДерева.Номенклатура)
					И (Не ЗначениеЗаполнено(СтрокаДерева.Характеристика))) Тогда
				
				НоваяСтрокаПалитры = ТаблицаПалитры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПалитры, СтрокаДерева);
				СкорректироватьДанныеСтрокиСоставаПалитры(НоваяСтрокаПалитры, СтрокаДерева,
					ДанныеПреобразования, ИсточникПалитры);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкорректироватьДанныеСтрокиСоставаПалитры(СтрокаСоставаПалитры, СтрокаДерева,
		ДанныеПреобразования, ИсточникПалитры)
		
	ДанныеПреобразования.НомерСтроки = ДанныеПреобразования.НомерСтроки + 1;
	
	ДанныеРазмещенияДерева = ПолучитьДанныеРазмещенияСтрокиДерева(СтрокаДерева, ДанныеПреобразования);
	НовыеДанныеРазмещения = ПолучитьНовыеДанныеКатегорииРазмещения(ДанныеПреобразования, ДанныеРазмещенияДерева);
	ПрисвоитьКатегорию = Ложь;
	Если Не НовыеДанныеРазмещения = Неопределено Тогда
		СтрокаСоставаПалитры.НомерКатегорииРазмещения = НовыеДанныеРазмещения.НовыйНомер;
		НовыеДанныеРазмещения.ТекущийИндексВКатегории = НовыеДанныеРазмещения.ТекущийИндексВКатегории + 1;
		СтрокаСоставаПалитры.ИндексПозиции = НовыеДанныеРазмещения.ТекущийИндексВКатегории;
		ПрисвоитьКатегорию = НовыеДанныеРазмещения.ИмеетсяГрупповойМодификатор;
	КонецЕсли;
	СтрокаСоставаПалитры.НомерСтроки = ДанныеПреобразования.НомерСтроки;
	СтрокаСоставаПалитры.ИсточникПалитры = ИсточникПалитры;
	
	Если СтрокаДерева.НомерКатегории > 0 Тогда
		ИмеетсяГрупповойМодификатор = ГруппаИмеетГрупповойМодификатор(СтрокаДерева);
		НовыйНомерКатегории = ЗарегистрироватьНовыйНомерКатегории(ДанныеПреобразования,
			СтрокаДерева, ИмеетсяГрупповойМодификатор);
		СтрокаСоставаПалитры.НомерКатегории = НовыйНомерКатегории;
	ИначеЕсли ПрисвоитьКатегорию И ЗначениеЗаполнено(СтрокаДерева.Номенклатура)
			И Не ЗначениеЗаполнено(СтрокаДерева.ВидМодификатора) Тогда
			
		ДанныеПреобразования.ВыделенныйНомерКатегории = ДанныеПреобразования.ВыделенныйНомерКатегории + 1;
		СтрокаСоставаПалитры.НомерКатегории = ДанныеПреобразования.ВыделенныйНомерКатегории;
		СтрокаСоставаПалитры.ИмеетсяВложенность = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗарегистрироватьНовыйНомерКатегории(ДанныеПреобразования, СтрокаДерева, ИмеетсяГрупповойМодификатор)
	
	НовыйНомерКатегории = 0;
	КатегорииПалитры = ДанныеПреобразования.СоответствиеКатегорий.Получить(СтрокаДерева.ПалитраВладелец);
	Если КатегорииПалитры = Неопределено Тогда
		КатегорииПалитры = Новый Соответствие();
		ДанныеПреобразования.СоответствиеКатегорий.Вставить(СтрокаДерева.ПалитраВладелец, КатегорииПалитры);
	КонецЕсли;
	ДанныеКатегории = КатегорииПалитры.Получить(СтрокаДерева.НомерКатегории);
	Если ДанныеКатегории = Неопределено Тогда
		ДанныеПреобразования.ВыделенныйНомерКатегории = ДанныеПреобразования.ВыделенныйНомерКатегории + 1;
		Если СтрокаДерева.НомерКатегории > 0 Тогда
			ДанныеКатегории = Новый Структура();
			ДанныеКатегории.Вставить("НовыйНомер", ДанныеПреобразования.ВыделенныйНомерКатегории);
			ДанныеКатегории.Вставить("ТекущийИндексВКатегории", 0);
			ДанныеКатегории.Вставить("ИмеетсяГрупповойМодификатор", ИмеетсяГрупповойМодификатор);
			КатегорииПалитры.Вставить(СтрокаДерева.НомерКатегории, ДанныеКатегории);
		КонецЕсли;
		НовыйНомерКатегории = ДанныеПреобразования.ВыделенныйНомерКатегории;
	Иначе
		НовыйНомерКатегории = ДанныеКатегории.НовыйНомер;
	КонецЕсли;
	Возврат НовыйНомерКатегории;
	
КонецФункции

Функция ПолучитьНовыеДанныеКатегорииРазмещения(ДанныеПреобразования, ДанныеРазмещенияДерева)
	
	РезультатФункции = Неопределено;
	
	КатегорииПалитры
		= ДанныеПреобразования.СоответствиеКатегорий.Получить(ДанныеРазмещенияДерева.ПалитраКатегорииРазмещения);
	Если Не КатегорииПалитры = Неопределено Тогда
		РезультатФункции = КатегорииПалитры.Получить(ДанныеРазмещенияДерева.НомерКатегорииРазмещения);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьДанныеРазмещенияСтрокиДерева(СтрокаДерева, ДанныеПреобразования)
	
	РезультатФункции = Новый Структура();
	НомерКатегорииРазмещения = 0;
	ПалитраКатегорииРазмещения = Неопределено;
	ПроверяемаяСтрока = СтрокаДерева;
	Пока НомерКатегорииРазмещения = 0 И Не ПроверяемаяСтрока = Неопределено Цикл
		НомерКатегорииРазмещения = ПроверяемаяСтрока.НомерКатегорииРазмещения;
		Если НомерКатегорииРазмещения > 0 Тогда
			ПалитраКатегорииРазмещения = ПроверяемаяСтрока.ПалитраВладелец;
		КонецЕсли;
		ПроверяемаяСтрока = ПроверяемаяСтрока.Родитель;
	КонецЦикла;
	Если НомерКатегорииРазмещения = 0 Тогда
		ПалитраКатегорииРазмещения = ДанныеПреобразования.ПалитраВладелец;
	КонецЕсли;
	РезультатФункции.Вставить("НомерКатегорииРазмещения", НомерКатегорииРазмещения);
	РезультатФункции.Вставить("ПалитраКатегорииРазмещения", ПалитраКатегорииРазмещения);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьКорневуюКатегориюВДанныеПреобразования(ДанныеПреобразования, ПалитраВладелец)
	
	ДанныеНулевойКатегории = Новый Структура("НовыйНомер,ТекущийИндексВКатегории", 0, 0);
	ДанныеНулевойКатегории.Вставить("ИмеетсяГрупповойМодификатор", Ложь);
	КатегорииПалитры = Новый Соответствие();
	КатегорииПалитры.Вставить(0, ДанныеНулевойКатегории);
	
	ДанныеПреобразования.ПалитраВладелец = ПалитраВладелец;
	ДанныеПреобразования.СоответствиеКатегорий.Вставить(ПалитраВладелец, КатегорииПалитры);
	
КонецПроцедуры

Функция ИнициализироватьДанныеПреобразования()
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("НомерСтроки", 0);
	РезультатФункции.Вставить("ВыделенныйНомерКатегории", 0);
	РезультатФункции.Вставить("СоответствиеКатегорий", Новый Соответствие());
	РезультатФункции.Вставить("ПалитраВладелец", Справочники.ПалитраТоваровРМК.ПустаяСсылка());
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ОчиститьДанныеПреобразования(ДанныеПреобразования)
	
	Для Каждого КлючЗначение Из ДанныеПреобразования.СоответствиеКатегорий Цикл
		КлючЗначение.Значение.Очистить();
	КонецЦикла;
	ДанныеПреобразования.СоответствиеКатегорий.Очистить();
	
КонецПроцедуры

Функция СформироватьЛинейныйИерархическийСоставПалитр(ДеревоИерархииПалитры)
	
	ДанныеПреобразования = ИнициализироватьДанныеПреобразования();
	УровеньДерева = 0;
	ИсточникПалитры = 0;
	ТаблицаПалитры = ШаблонЛинейногоИерархическогоСоставаПалитр();
	
	ОбойтиСтрокиДереваСоставаПалитры(ТаблицаПалитры,
		ДеревоИерархииПалитры.Строки, ДанныеПреобразования, УровеньДерева, ИсточникПалитры);
	ОчиститьДанныеПреобразования(ДанныеПреобразования);
	Возврат ТаблицаПалитры;
	
КонецФункции

Функция ШаблонЛинейногоИерархическогоСоставаПалитр()
	
	ШаблонСостава = Справочники.ПалитраТоваровРМК.ПустаяСсылка().Состав.ВыгрузитьКолонки();
	ШаблонСостава.Колонки.Удалить("КатегорияРазмещения");
	ШаблонСостава.Колонки.Удалить("Шрифт");
	ШаблонСостава.Колонки.Удалить("ХарактеристикиИспользуются");
	ШаблонСостава.Колонки.Удалить("ЗаголовокЭлемента");
	ШаблонСостава.Колонки.Удалить("Палитра");
	
	ШаблонСостава.Колонки.Добавить("ИсточникПалитры", ОбщегоНазначения.ОписаниеТипаЧисло(2, 0, ДопустимыйЗнак.Неотрицательный));
	
	Возврат ШаблонСостава;
	
КонецФункции

Процедура ЗаполнитьПараметрыПалитрыДляСКД(Форма, ПалитраПлитки, МассивПалитр)
	
	ПалитраИзбранных = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтруктураПлиточногоИнтерфейсаПодбора") Тогда
		ПалитраПлитки = Форма.СтруктураПлиточногоИнтерфейсаПодбора;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтруктураПлиточногоИнтерфейса") Тогда
		ПалитраПлитки = Форма.СтруктураПлиточногоИнтерфейса;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "НастройкиРМК") Тогда
		ПалитраИзбранных = Форма.НастройкиРМК.СтруктураБыстрыхТоваров;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекущаяНастройкаРМК") Тогда
		ПалитраИзбранных = Форма.ТекущаяНастройкаРМК.СтруктураБыстрыхТоваров;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПалитраПлитки) Тогда
		МассивПалитр.Добавить(ПалитраПлитки);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПалитраИзбранных) Тогда
		МассивПалитр.Добавить(ПалитраИзбранных);
	КонецЕсли;
	
КонецПроцедуры

Функция ГруппаИмеетГрупповойМодификатор(СтрокаДерева)

	РезультатФункции = Ложь;
	
	СтрокиУровня = ?(СтрокаДерева.Родитель = Неопределено, СтрокаДерева.Владелец().Строки, СтрокаДерева.Родитель.Строки);
	ОтборПодчиненныхСтрок = Новый Структура("НомерКатегорииРазмещения,ИсточникПалитры",
		СтрокаДерева.НомерКатегории, СтрокаДерева.ИсточникПалитры);
	ПодчиненныеЭлементы = СтрокиУровня.НайтиСтроки(ОтборПодчиненныхСтрок);
	ИндексПодчиненногоЭлемента = 0;
	КоличествоЭлементов = ПодчиненныеЭлементы.Количество();
	Пока ИндексПодчиненногоЭлемента < КоличествоЭлементов И Не РезультатФункции Цикл
		ПодчиненныйЭлемент = ПодчиненныеЭлементы.Получить(ИндексПодчиненногоЭлемента);
		Если ЗначениеЗаполнено(ПодчиненныйЭлемент.ВидМодификатора) Тогда
			РезультатФункции = Истина;
		КонецЕсли;
		ИндексПодчиненногоЭлемента = ИндексПодчиненногоЭлемента + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура НастроитьОтображениеСпискаТоваров(Форма, НаборСвойств)
	
	СвойствоШрифт = Перечисления.СвойстваЭлементовРМК.ШрифтКнопок;
	СвойствоПереносить = Перечисления.СвойстваЭлементовРМК.ПереноситьТекст;
	СвойствоШиринаТовара = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок;
	СвойствоШиринаСуммы = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
	
	ЗначениеШрифта = НаборСвойств.Получить(СвойствоШрифт);
	Если Не ЗначениеШрифта = Неопределено Тогда
		Форма.Элементы.Товары.Шрифт = ЗначениеШрифта;
		Форма.Элементы.ТоварыСумма.Шрифт = ЗначениеШрифта;
	КонецЕсли;
	ЗначениеПереносить = НаборСвойств.Получить(СвойствоПереносить);
	Если ЗначениеПереносить = Истина Тогда
		Форма.Элементы.ТоварыПредставлениеНоменклатураХарактеристика.АвтоВысотаЯчейки = Истина;
	КонецЕсли;
	ЗначениеШириныТовара = НаборСвойств.Получить(СвойствоШиринаТовара);
	ЗначениеШириныСуммы = НаборСвойств.Получить(СвойствоШиринаСуммы);
	Если ЗначениеЗаполнено(ЗначениеШириныТовара) Тогда
		Форма.Элементы.ТоварыПредставлениеНоменклатураХарактеристика.Ширина = ЗначениеШириныТовара;
	КонецЕсли;
	ПределШирины = 6;
	Если ЗначениеЗаполнено(ЗначениеШириныСуммы) Тогда
		Форма.Элементы.ТоварыЦена.Ширина = ЗначениеШириныСуммы - ?(ЗначениеШириныСуммы > ПределШирины, 2, 0);
		Форма.Элементы.ТоварыСуммаСкидокОбщая.Ширина = ЗначениеШириныСуммы - ?(ЗначениеШириныСуммы > ПределШирины, 2, 0);
		Форма.Элементы.ТоварыСумма.Ширина = ЗначениеШириныСуммы;
		Форма.Элементы.ТоварыМиниСписокКоличество.Ширина = ЗначениеШириныСуммы - ?(ЗначениеШириныСуммы > ПределШирины, 3, 0);
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьПрименитьПоложениеЧасов(Форма, ПоложениеЧасов, НаборСвойств)
	
	Если ПоложениеЧасов = "" Тогда
		СвойствоПоложениеЧасов = Перечисления.СвойстваЭлементовРМК.ПоложениеЧасов;
		ЗначениеПоложения = НаборСвойств.Получить(СвойствоПоложениеЧасов);
		Если Не ЗначениеПоложения = Неопределено Тогда
			ПоложениеЛево = НСтр("ru = 'Лево'");
			ПоложениеПраво = НСтр("ru = 'Право'");
			Элементы = Форма.Элементы;
			
			ПоложениеЧасов = ЗначениеПоложения;
			Если ПоложениеЧасов = ПоложениеЛево Тогда
				Элементы.Переместить(Элементы.ПодгруппаЧасы, Элементы.ГруппаОперации,
					Элементы.ОткрытьПлиточныйИнтерфейсКаталога);
				Элементы.ПодгруппаЧасы.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
			ИначеЕсли ПоложениеЧасов = ПоложениеПраво Тогда
				Элементы.Переместить(Элементы.ПодгруппаЧасы,
					Элементы.ГруппаОперации, Элементы.ЗакрытьПлиточныйИнтерфейс);
				Элементы.ПодгруппаЧасы.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Процедура НастроитьОтображениеСтатусаКассовойСмены(Форма, ПоложениеЧасов, НаборСвойств)
	
	ПоложениеЛево = НСтр("ru = 'Лево'");
	СвойствоСтатусСмены = Перечисления.СвойстваЭлементовРМК.ПоказыватьСтатусСмены;
	ЗначениеСтатусаСмены = НаборСвойств.Получить(СвойствоСтатусСмены);
	Если ЗначениеСтатусаСмены = Истина И Не Форма.РежимКассыСамообслуживания Тогда
		
		Элементы = Форма.Элементы;
		Элементы.ДекорацияСтатусСмены.Видимость = Истина;
		//Если ПоложениеЧасов = ПоложениеЛево Тогда
		//	Элементы.Переместить(Элементы.ДекорацияСтатусСмены, Элементы.ПодгруппаЧасыСтатусСмены, Элементы.КартинкаЧасы);
		//ИначеЕсли ПоложениеЧасов = "" Тогда
		//	Элементы.Переместить(Элементы.ДекорацияСтатусСмены,
		//		Элементы.ГруппаОперации, Элементы.ПодгруппаОтложитьЧек);
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуСвязанныхПолей(Форма)
	
	РезультатФункции = Новый ТаблицаЗначений;
	РезультатФункции.Колонки.Добавить("ИмяПоля", Новый ОписаниеТипов("Строка"));
	РезультатФункции.Колонки.Добавить("МассивКнопок", Новый ОписаниеТипов("Массив"));
	РезультатФункции.Колонки.Добавить("ИндивидуальнаяШирина", Новый ОписаниеТипов("Булево"));
	
	КнопкиКоличества = Новый Массив();
	КнопкиКоличества.Добавить("ТекущийТоварУменьшитьКоличество");
	КнопкиКоличества.Добавить("ТекущийТоварУвеличитьКоличество");
	
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "ТекущийТоварЦенаИзКарточки", КнопкиКоличества, Истина);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "ТекущийТоварКоличество", КнопкиКоличества, Истина);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "ТекущийТоварКоличествоСобрано", КнопкиКоличества, Истина);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "ТекущийТоварСкидка", "ТекущийТоварСкидкаПереключатель", Истина);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаОплаченоНал", "ОплатаНаличными", Ложь);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаОплаченоБН", "ОплатаКартой", Ложь);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаОплаченоСБП", "ОплатаСБП", Ложь);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаОплаченоЮКасса", "ОплатаЮКасса", Ложь);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаОплаченоСертификатамиНСПК", "ОплатаСертификатомНСПК", Ложь);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаОплаченоПредоплата", "Предоплата", Ложь);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаОплаченоВРассрочку", "ОплатаВРассрочку", Ложь);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаОплаченоЗачетАванса", "ЗачетАванса", Ложь);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаОплаченоБезнал", "Безнал", Ложь);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаОплаченоКредитом", "ОплатаКредитом", Ложь);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаОплаченоБонусами", "ОплатаБонусами", Ложь);
	ДобавитьОписаниеСвязанногоПоля(РезультатФункции, "СуммаНаличныхКВыдаче", Новый Массив, Ложь);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьОписаниеСвязанногоПоля(ТаблицаПолей, ИмяПоля, ИменаКнопок, ИндивидуальнаяШирина)
	Перем МассивКнопок;
	
	Если ТипЗнч(ИменаКнопок) = Тип("Строка") Тогда
		МассивКнопок = Новый Массив();
		МассивКнопок.Добавить(ИменаКнопок);
	Иначе
		МассивКнопок = ИменаКнопок;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПолей.Добавить();
	НоваяСтрока.ИмяПоля = ИмяПоля;
	НоваяСтрока.МассивКнопок = МассивКнопок;
	НоваяСтрока.ИндивидуальнаяШирина = ИндивидуальнаяШирина;
	
КонецПроцедуры

Функция СформироватьНастройкиСвязанныхПолей(Форма, НастройкиЭлементов)
	
	ШиринаПолейОплат = 0;
	ШрифтыПолей = Новый Соответствие();
	ШиринаПолей = Новый Соответствие();
	
	ТаблицаПолей = ПолучитьТаблицуСвязанныхПолей(Форма);
	Для Каждого СтрокаТаблицы Из ТаблицаПолей Цикл
		
		ЭлементПоле = Форма.Элементы.Найти(СтрокаТаблицы.ИмяПоля);
		ВысотаКнопок = ПолучитьМинимальнуюВысотуКнопок(НастройкиЭлементов, СтрокаТаблицы.МассивКнопок);
		Если ВысотаКнопок > 1 И Не ЭлементПоле = Неопределено Тогда
			
			МасштабШрифта = 100 + 45 * (ВысотаКнопок - 1);
			ПрибавкаШирины = (ВысотаКнопок - 1);
			ДельтаТипаОплаты = 0;
			ТекущийШрифт = ЭлементПоле.Шрифт;
			Коэффициент = ?(СтрокаТаблицы.ИндивидуальнаяШирина, 3, 2);
			Если ЭлементПоле.Имя = "СуммаОплаченоСБП" Или ЭлементПоле.Имя = "СуммаОплаченоЮКасса" Тогда
				ДельтаТипаОплаты = 1;
				Коэффициент = 1;
			ИначеЕсли ЭлементПоле.Имя = "ТекущийТоварЦенаИзКарточки" Тогда
				ДельтаТипаОплаты = 1;
				ТекущийШрифт = ШрифтыСтиля.ШрифтОбычный12РМК;
			ИначеЕсли ЭлементПоле.Вид = ВидПоляФормы.ПолеНадписи Или ЭлементПоле.Имя = "ТекущийТоварКоличество"
				Или ЭлементПоле.Имя = "ТекущийТоварКоличествоСобрано "Тогда
				ДельтаТипаОплаты = 0;
			ИначеЕсли ЭлементПоле.Имя = "ТекущийТоварСкидка" Тогда
				Коэффициент = 2;
				ТекущийШрифт = ШрифтыСтиля.ШрифтОбычный12РМК;
			КонецЕсли;
			НовыйШрифт = Новый Шрифт(ТекущийШрифт,,,,,,, МасштабШрифта);
			НоваяШирина = ЭлементПоле.Ширина + Коэффициент * ПрибавкаШирины + ДельтаТипаОплаты;
			
			Если СтрокаТаблицы.ИндивидуальнаяШирина Тогда
				ЭлементПоле.Ширина = НоваяШирина;
				ШиринаПолей.Вставить(СтрокаТаблицы.ИмяПоля, НоваяШирина);
			ИначеЕсли ШиринаПолейОплат < НоваяШирина Тогда
				ШиринаПолейОплат = НоваяШирина;
			КонецЕсли;
			ЭлементПоле.Шрифт = НовыйШрифт;
			ШрифтыПолей.Вставить(СтрокаТаблицы.ИмяПоля, НовыйШрифт);
			
		ИначеЕсли ВысотаКнопок = 1 И Не ЭлементПоле = Неопределено И Не СтрокаТаблицы.ИндивидуальнаяШирина Тогда
			ШрифтыПолей.Вставить(СтрокаТаблицы.ИмяПоля, ЭлементПоле.Шрифт);
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы = Форма.Элементы;
	
	// Применение ширины к элементам оплаты
	Если ШиринаПолейОплат > 0 Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаПолей Цикл
			Если Не СтрокаТаблицы.ИндивидуальнаяШирина Тогда
				ЭлементПоле = Элементы.Найти(СтрокаТаблицы.ИмяПоля);
				ДельтаТипаОплаты = 0;
				Если ЭлементПоле.Имя = "СуммаОплаченоСБП" Или ЭлементПоле.Имя = "СуммаОплаченоЮКасса" Тогда
					ДельтаТипаОплаты = -1;
				ИначеЕсли ЭлементПоле.Вид = ВидПоляФормы.ПолеНадписи Тогда
					ДельтаТипаОплаты = 1;
				КонецЕсли;
				НоваяШирина = ШиринаПолейОплат + ДельтаТипаОплаты;
				ЭлементПоле.Ширина = НоваяШирина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ПараметрыПолей = Новый Структура();
	ПараметрыПолей.Вставить("ШиринаПолейОплат", ШиринаПолейОплат);
	ПараметрыПолей.Вставить("ШрифтыПолей", ШрифтыПолей);
	ПараметрыПолей.Вставить("ШиринаПолей", ШиринаПолей);
	
	Возврат ПараметрыПолей;
	
КонецФункции

Функция ПолучитьМинимальнуюВысотуКнопок(НастройкиЭлементов, Кнопки)
	
	ВысотаКнопок = Неопределено;
	СвойствоВысота = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
	
	Для Каждого ИмяКнопки Из Кнопки Цикл
		НаборСвойств = НастройкиЭлементов.Получить(ИмяКнопки);
		Если Не НаборСвойств = Неопределено Тогда
			ЗначениеВысоты = НаборСвойств.Получить(СвойствоВысота);
			Если ЗначениеЗаполнено(ЗначениеВысоты) И (ВысотаКнопок = Неопределено Или ВысотаКнопок > ЗначениеВысоты) Тогда
				ВысотаКнопок = ЗначениеВысоты;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВысотаКнопок = Неопределено Тогда
		ВысотаКнопок = 0;
	КонецЕсли;
	Возврат ВысотаКнопок;
	
КонецФункции

Функция ПривестиТипЗначенияСвойства(СвойствоЭлементов, ИсходноеЗначениеСвойства)
	Перем ЗначениеСвойства;
	
	Если СвойствоЭлементов = Перечисления.СвойстваЭлементовРМК.ЦветКнопок
			Или СвойствоЭлементов = Перечисления.СвойстваЭлементовРМК.ЦветШрифта
			Или СвойствоЭлементов = Перечисления.СвойстваЭлементовРМК.ШрифтКнопок Тогда
			
		ЗначениеСвойства = ОбщегоНазначения.ЗначениеИзСтрокиXML(ИсходноеЗначениеСвойства);
		
	Иначе
		
		ЗначениеСвойства = ИсходноеЗначениеСвойства;
		
	КонецЕсли;
	Возврат ЗначениеСвойства;
	
КонецФункции

Процедура ОбработатьВыборкуНастроекОбластей(НастройкиЭлементов, ВыборкаНастроекОбластей)
	
	СвойствоСтатусСмены = Перечисления.СвойстваЭлементовРМК.ПоказыватьСтатусСмены;
	СвойстваПанели = Новый Массив;
	СвойстваПанели.Добавить(Перечисления.СвойстваЭлементовРМК.ВыравниваниеЭлементов);
	СвойстваПанели.Добавить(Перечисления.СвойстваЭлементовРМК.ПоложениеЧасов);
	СвойстваПанели.Добавить(СвойствоСтатусСмены);
	ОбластиПримененияНастроек = ОбластиПримененияНастроекПанели();
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	
	Пока ВыборкаНастроекОбластей.Следующий() Цикл
		
		НаборНастроекЭлементов = Новый Соответствие();
		НаборНастроекПанелиОпераций = Новый Соответствие();
		ОбластьПрименения = ОбластиПримененияНастроек.Везде;
		ВыборкаСвойств = ВыборкаНастроекОбластей.Выбрать();
		Пока ВыборкаСвойств.Следующий() Цикл
			
			Если ВыборкаСвойств.СвойствоЭлементов = Перечисления.СвойстваЭлементовРМК.ОбластьПрименения Тогда
				// ОбластьПрименения = ВыборкаСвойств.ЗначениеСвойства;
			ИначеЕсли Не СвойстваПанели.Найти(ВыборкаСвойств.СвойствоЭлементов) = Неопределено Тогда
				НаборНастроекПанелиОпераций.Вставить(ВыборкаСвойств.СвойствоЭлементов, ВыборкаСвойств.ЗначениеСвойства);
			Иначе
				ЗначениеСвойства = ПривестиТипЗначенияСвойства(ВыборкаСвойств.СвойствоЭлементов, ВыборкаСвойств.ЗначениеСвойства);
				НаборНастроекЭлементов.Вставить(ВыборкаСвойств.СвойствоЭлементов, ЗначениеСвойства);
			КонецЕсли;
			
		КонецЦикла;
		
		ДобавитьНастройкиВсемЭлементамОбласти(НастройкиЭлементов, ВыборкаНастроекОбластей.ЗаголовокОбласти,
			НаборНастроекЭлементов);
		Если ВыборкаНастроекОбластей.ЗаголовокОбласти = ЗаголовкиОбластей.ОбластьПанельОпераций Тогда
			
			ДобавитьСтрокиИзСоответствия(НаборНастроекПанелиОпераций, НаборНастроекЭлементов);
			НастройкиЭлементов.Вставить(ВыборкаНастроекОбластей.ЗаголовокОбласти, НаборНастроекПанелиОпераций);
			
		КонецЕсли;
		
		Если ВыборкаНастроекОбластей.ЗаголовокОбласти = ЗаголовкиОбластей.ОбластьПанельОпераций Тогда
			
			НаборНастроекПлиточныйИнтерфейс = СкопироватьСоответствие(НаборНастроекЭлементов);
			ДобавитьСтрокиИзСоответствия(НаборНастроекПлиточныйИнтерфейс, НаборНастроекПанелиОпераций);
			НастройкиЭлементов.Вставить(ЗаголовкиОбластей.ПлиточныйИнтерфейс, НаборНастроекПлиточныйИнтерфейс);
			//Если ОбластьПрименения = ОбластиПримененияНастроек.ПлиточныйИнтерфейс
			//		И НаборНастроекПанелиОпераций.Получить(СвойствоСтатусСмены) = Истина Тогда
			//	
			//	НаборНастроекПанелиОпераций.Очистить();
			//	НаборНастроекПанелиОпераций.Вставить(СвойствоСтатусСмены, Истина);
			//	НастройкиЭлементов.Вставить(ВыборкаНастроекОбластей.ЗаголовокОбласти, НаборНастроекПанелиОпераций);
			//	
			//КонецЕсли;
		КонецЕсли;
		Если ВыборкаНастроекОбластей.ЗаголовокОбласти = ЗаголовкиОбластей.ОбластьСписокТоваров Тогда
			НастройкиЭлементов.Вставить(ЗаголовкиОбластей.ОбластьСписокТоваров, НаборНастроекЭлементов);
		ИначеЕсли ВыборкаНастроекОбластей.ЗаголовокОбласти = ЗаголовкиОбластей.ОбластьДанныеТекущегоТовара Тогда
			НастройкиЭлементов.Вставить(ЗаголовкиОбластей.ОбластьДанныеТекущегоТовара, НаборНастроекЭлементов);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНастройкиВсемЭлементамОбласти(НастройкиЭлементов, ЗаголовокОбласти, НаборНастроекЭлементов)
	
	МассивКомандРежимЕще = Новый Массив;
	МассивКомандРежимЕще.Добавить("КомандаРежим");
	МассивКомандРежимЕще.Добавить("КомандаЕще");
	
	ЭлементыОбласти = ПолучитьЭлементыОбласти(ЗаголовокОбласти);
	Для Каждого ИмяЭлемента Из ЭлементыОбласти Цикл
		ТекущаяНастройка = НастройкиЭлементов.Получить(ИмяЭлемента);
		Если ТекущаяНастройка = Неопределено Тогда
			Если МассивКомандРежимЕще.Найти(ИмяЭлемента) = Неопределено Тогда
				НастройкиЭлементов.Вставить(ИмяЭлемента, НаборНастроекЭлементов);
			Иначе
				ТекущаяНастройка = Новый Соответствие();
				НастройкиЭлементов.Вставить(ИмяЭлемента, ТекущаяНастройка);
			КонецЕсли;
		КонецЕсли;
		Если Не ТекущаяНастройка = Неопределено Тогда
			Для Каждого СтрокаНабора Из НаборНастроекЭлементов Цикл
				ТекущееСвойство = ТекущаяНастройка.Получить(СтрокаНабора.Ключ);
				Если ТекущееСвойство = Неопределено И (МассивКомандРежимЕще.Найти(ИмяЭлемента) = Неопределено
						Или Не СтрокаНабора.Ключ = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок) Тогда
					ТекущаяНастройка.Вставить(СтрокаНабора.Ключ, СтрокаНабора.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЭлементыОбласти(ЗаголовокОбласти)
	
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	
	РезультатФункции = Новый Массив;
	
	Если ЗаголовокОбласти = ЗаголовкиОбластей.ОбластьПанельОпераций Тогда
		РезультатФункции = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЭлементыОбластиПанельОпераций();
	ИначеЕсли ЗаголовокОбласти = ЗаголовкиОбластей.ОбластьОплатить Тогда
		РезультатФункции = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЭлементыОбластиОплатить();
	ИначеЕсли ЗаголовокОбласти = ЗаголовкиОбластей.ОбластьДанныеТекущегоТовара Тогда
		РезультатФункции = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЭлементыОбластиДанныхТекущеготовара();
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция СкопироватьСоответствие(ИсходноеСоответствие)
	
	РезультатФункции = Новый Соответствие();
	Для Каждого СтрокаСоответствия Из ИсходноеСоответствие Цикл
		
		РезультатФункции.Вставить(СтрокаСоответствия.Ключ, СтрокаСоответствия.Значение);
		
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьСтрокиИзСоответствия(СоответствиеПриемник, СоответствиеИсточник)
	
	Для Каждого СтрокаСоответствия Из СоответствиеИсточник Цикл
		
		СоответствиеПриемник.Вставить(СтрокаСоответствия.Ключ, СтрокаСоответствия.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуМаксимальныхЗначенийНастроекЭлементов()
	
	ТипЦелоеЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(2, 0, ДопустимыйЗнак.Неотрицательный);
	СвойствоВысотаКнопок = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
	СвойствоШиринаКнопок = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок;
	СвойствоРазмерКнопок = Перечисления.СвойстваЭлементовРМК.РазмерКнопок;
	
	ТаблицаНастроек = Справочники.НастройкиРабочегоМестаКассира.ПустаяСсылка().НастройкиЭлементов.ВыгрузитьКолонки();
	ТаблицаНастроек.Колонки.Удалить("ЗначениеСвойства");
	ТаблицаНастроек.Колонки.Добавить("МаксимальноеЗначение", ТипЦелоеЧисло);
	
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "НастройкаВводаПоСтрокеОткрытьНастройки", СвойствоВысотаКнопок, 10);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "НастройкаВводаПоСтрокеОткрытьНастройки", СвойствоШиринаКнопок, 25);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "Каталог", СвойствоВысотаКнопок, 10);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "Каталог", СвойствоШиринаКнопок, 25);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "НайтиВЧеке", СвойствоВысотаКнопок, 10);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "НайтиВЧеке", СвойствоШиринаКнопок, 25);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтложитьЧек", СвойствоВысотаКнопок, 10);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтложитьЧек", СвойствоШиринаКнопок, 25);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "УдалитьЧек", СвойствоВысотаКнопок, 10);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "УдалитьЧек", СвойствоШиринаКнопок, 25);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтменитьИзмененияЧека", СвойствоВысотаКнопок, 10);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтменитьИзмененияЧека", СвойствоШиринаКнопок, 25);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ВвестиКомментарийКЧеку", СвойствоВысотаКнопок, 10);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ВвестиКомментарийКЧеку", СвойствоШиринаКнопок, 25);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПозватьСотрудника", СвойствоВысотаКнопок, 10);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПозватьСотрудника", СвойствоШиринаКнопок, 25);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "СборкаПоЗаказу", СвойствоВысотаКнопок, 10);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "СборкаПоЗаказу", СвойствоШиринаКнопок, 25);
	
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "КомандаРежим", СвойствоВысотаКнопок, 10);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "КомандаРежим", СвойствоШиринаКнопок, 20);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "КомандаЕще", СвойствоВысотаКнопок, 10);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "КомандаЕще", СвойствоШиринаКнопок, 20);
	
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ВвестиДанныеПокупателя", СвойствоВысотаКнопок, 7);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ВвестиДанныеПокупателя", СвойствоШиринаКнопок, 36);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ВвестиДанныеПокупателя", СвойствоРазмерКнопок, 4);

	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПробитьЧек", СвойствоВысотаКнопок, 12);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПробитьЧек", СвойствоШиринаКнопок, 36);
	
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ВернутьсяВРежимПодбораТовара", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ВернутьсяВРежимПодбораТовара", СвойствоШиринаКнопок, 36);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "РаспечататьТекущийТоварныйЧек", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "РаспечататьТекущийТоварныйЧек", СвойствоШиринаКнопок, 36);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПробитьТекущийЧекПовторно", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПробитьТекущийЧекПовторно", СвойствоШиринаКнопок, 36);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ВыполнитьВозвратТекущегоЧека", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ВыполнитьВозвратТекущегоЧека", СвойствоШиринаКнопок, 36);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "РаспечататьТекущееЗаявлениеНаВозврат", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "РаспечататьТекущееЗаявлениеНаВозврат", СвойствоШиринаКнопок, 36);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПовторитьЧек", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПовторитьЧек", СвойствоШиринаКнопок, 36);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "РассчитатьСкидки", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "РассчитатьСкидки", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтменаРасчетаСкидок", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтменаРасчетаСкидок", СвойствоШиринаКнопок, 24);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПоказатьСкидкиНаЧек", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПоказатьСкидкиНаЧек", СвойствоШиринаКнопок, 36);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПроверитьСертификатНСПК", СвойствоВысотаКнопок, 3);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПроверитьСертификатНСПК", СвойствоШиринаКнопок, 24);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтменитьОплатуСертификатомНСПК", СвойствоВысотаКнопок, 3);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтменитьОплатуСертификатомНСПК", СвойствоШиринаКнопок, 24);
	
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ЗаменаТоваров", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ЗаменаТоваров", СвойствоШиринаКнопок, 24);
	
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ТекущийТоварУменьшитьКоличество", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ТекущийТоварУменьшитьКоличество", СвойствоШиринаКнопок, 12);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ТекущийТоварУвеличитьКоличество", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ТекущийТоварУвеличитьКоличество", СвойствоШиринаКнопок, 12);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ТекущийТоварУстановитьДробноеКоличество", СвойствоШиринаКнопок, 12);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПоказатьОстатки", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПоказатьОстатки", СвойствоШиринаКнопок, 12);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ТекущийТоварСкидкаПереключатель", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ТекущийТоварСкидкаПереключатель", СвойствоШиринаКнопок, 12);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПолучитьВес", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ПолучитьВес", СвойствоШиринаКнопок, 12);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "УдалитьТовар", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "УдалитьТовар", СвойствоШиринаКнопок, 12);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ДобавитьПродавцаВРежимеПлитки", СвойствоВысотаКнопок, 4);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ДобавитьПродавцаВРежимеПлитки", СвойствоШиринаКнопок, 12);
	
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтменитьВводКарты", СвойствоВысотаКнопок, 3);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтменитьВводКарты", СвойствоШиринаКнопок, 36);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "СоздатьКарту", СвойствоВысотаКнопок, 3);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "СоздатьКарту", СвойствоШиринаКнопок, 36);
	
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаКартой", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаКартой", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаНаличными", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаНаличными", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаСБП", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаСБП", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаСертификатомНСПК", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаСертификатомНСПК", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаКредитом", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаКредитом", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "Предоплата", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "Предоплата", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ЗачетАванса", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ЗачетАванса", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаВРассрочку", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаВРассрочку", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаСертификатом", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаСертификатом", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "НайтиСертификат", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "НайтиСертификат", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатитьСертификатом", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатитьСертификатом", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаБонусами", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОплатаБонусами", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ВыбратьЭквайринговыйТерминал", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ВыбратьЭквайринговыйТерминал", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтказатьсяОтВыбораТерминала", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтказатьсяОтВыбораТерминала", СвойствоШиринаКнопок, 30);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтменитьВсеОплаты", СвойствоВысотаКнопок, 5);
	ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек, "ОтменитьВсеОплаты", СвойствоШиринаКнопок, 30);
	
	Возврат ТаблицаНастроек;
	
КонецФункции

Функция ПолучитьТиповыеАвтоЗначенияСвойствНастроекЭлементов()
	
	ЦветАвто = Новый Цвет();
	ЦветАвтоСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ЦветАвто);
	ШрифтАвто = Новый Шрифт();
	ШрифтАвтоСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ШрифтАвто);
	
	ТиповыеАвтоЗначения = Новый Структура();
	ТиповыеАвтоЗначения.Вставить("ЦветАвто", ЦветАвтоСтрокой);
	ТиповыеАвтоЗначения.Вставить("ШрифтАвто", ШрифтАвтоСтрокой);
	ТиповыеАвтоЗначения.Вставить("ФигураАвто", НСтр("ru = 'Авто'"));
	ТиповыеАвтоЗначения.Вставить("ВыравниваниеАвто", НСтр("ru = 'Авто'"));
	ТиповыеАвтоЗначения.Вставить("ПоложениеЧасовНет", НСтр("ru = 'Нет'"));
	
	Возврат ТиповыеАвтоЗначения;
	
КонецФункции

Процедура ДобавитьНастройкиОбластиОплатить(ТаблицаНастроек, ИмяОбласти, ТиповыеАвтоЗначения,
		МаксимальнаяВысотаКнопки, МаксимальнаяШиринаКнопок)
	
	СвойствоВысотаКнопок = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
	СвойствоШиринаКнопок = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок;
	СвойствоЦветКнопок = Перечисления.СвойстваЭлементовРМК.ЦветКнопок;
	СвойствоФигураКнопок = Перечисления.СвойстваЭлементовРМК.ФигураКнопок;
	
	ЗначенияВысотыКнопок = Новый Структура();
	ЗначенияВысотыКнопок.Вставить("ЗначениеПоУмолчанию", 0);
	ЗначенияВысотыКнопок.Вставить("МаксимальноеЗначение", МаксимальнаяВысотаКнопки);
	
	ЗначенияШириныКнопок = Новый Структура();
	ЗначенияШириныКнопок.Вставить("ЗначениеПоУмолчанию", 0);
	ЗначенияШириныКнопок.Вставить("МаксимальноеЗначение", МаксимальнаяШиринаКнопок);
	
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоВысотаКнопок, ЗначенияВысотыКнопок);
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоШиринаКнопок, ЗначенияШириныКнопок);
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоЦветКнопок, ТиповыеАвтоЗначения.ЦветАвто);
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоФигураКнопок, ТиповыеАвтоЗначения.ФигураАвто);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьНастройкиОбластиПанельОпераций(ТаблицаНастроек, ТиповыеАвтоЗначения)
	
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	ИмяОбласти = ЗаголовкиОбластей.ОбластьПанельОпераций;
	ОбластиПрименения = ОбластиПримененияНастроекПанели();
	
	СвойствоРазмерКнопок = Перечисления.СвойстваЭлементовРМК.РазмерКнопок;
	СвойствоВысотаКнопок = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
	СвойствоШиринаКнопок = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок;
	СвойствоЦветКнопок = Перечисления.СвойстваЭлементовРМК.ЦветКнопок;
	СвойствоПоложениеЧасов = Перечисления.СвойстваЭлементовРМК.ПоложениеЧасов;
	СвойствоОбластьПрименения = Перечисления.СвойстваЭлементовРМК.ОбластьПрименения;
	СвойствоПоказыватьСтатусСмены = Перечисления.СвойстваЭлементовРМК.ПоказыватьСтатусСмены;
	
	Если ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		
		ЗначенияРазмераКнопок = Новый Структура();
		ЗначенияРазмераКнопок.Вставить("ЗначениеПоУмолчанию", 0);
		ЗначенияРазмераКнопок.Вставить("МаксимальноеЗначение", 4);
		
		ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоРазмерКнопок, ЗначенияРазмераКнопок);
		
	Иначе
		
		ЗначенияВысотыКнопок = Новый Структура();
		ЗначенияВысотыКнопок.Вставить("ЗначениеПоУмолчанию", 0);
		ЗначенияВысотыКнопок.Вставить("МаксимальноеЗначение", 8);
		
		ЗначенияШириныКнопок = Новый Структура();
		ЗначенияШириныКнопок.Вставить("ЗначениеПоУмолчанию", 0);
		ЗначенияШириныКнопок.Вставить("МаксимальноеЗначение", 28);
	
		ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоВысотаКнопок, ЗначенияВысотыКнопок);
		ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоШиринаКнопок, ЗначенияШириныКнопок);
		
	КонецЕсли;
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоЦветКнопок, ТиповыеАвтоЗначения.ЦветАвто);
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоПоложениеЧасов,
		ТиповыеАвтоЗначения.ПоложениеЧасовНет);
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоПоказыватьСтатусСмены, Ложь);
	ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоОбластьПрименения,
		ОбластиПрименения.ОбычныйИнтерфейс);
	
КонецПроцедуры

Функция ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоЭлементов, ЗначениеПоУмолчанию)
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.СвойствоЭлементов = СвойствоЭлементов;
	НоваяСтрока.ЗначениеСвойства = ЗначениеПоУмолчанию;
	
	Возврат НоваяСтрока;
	
КонецФункции

Процедура ДобавитьМаксимальноеЗначениеНастройкиЭлемента(ТаблицаНастроек,
		ИмяЭлемента, СвойствоЭлементов, МаксимальноеЗначение)
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.ИмяЭлемента = ИмяЭлемента;
	НоваяСтрока.СвойствоЭлементов = СвойствоЭлементов;
	НоваяСтрока.МаксимальноеЗначение = МаксимальноеЗначение;
	
КонецПроцедуры

Процедура ДобавитьСтрокуНастроекОбластей(ТаблицаНастроек, ИмяОбласти, СвойствоОбласти, ЗначениеСвойства)
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.ЗаголовокОбласти = ИмяОбласти;
	НоваяСтрока.СвойствоЭлементовОбласти = СвойствоОбласти;
	Если ТипЗнч(ЗначениеСвойства) = Тип("Структура") Тогда
		НоваяСтрока.ЗначениеСвойства = ЗначениеСвойства.ЗначениеПоУмолчанию;
		НоваяСтрока.МаксимальноеЗначение = ЗначениеСвойства.МаксимальноеЗначение;
	Иначе
		НоваяСтрока.ЗначениеСвойства = ЗначениеСвойства;
	КонецЕсли;
	
КонецПроцедуры

Процедура СброситьПодсказкиЭлементовВРежимеКСО(ЭлементыФормы)
	
	ЭлементыДляОбработки = Новый Массив;
	
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ВвестиДанныеПокупателя);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ВернутьсяВРежимПодбораТовара);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.НайтиПромокод);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ОплатаБонусами);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ОплатаКартой);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ОплатаСБП);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ОплатаЮКасса);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ОпровергнутьВозраст);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ОткрытьПлиточныйИнтерфейсКаталога);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ОтменаВводаПромокода);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ОтменаРасчетаСкидок);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ОтменитьВсеОплаты);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ПерейтиВОплату);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ПерейтиКОплате);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ПрименитьПромокод);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.ПродолжитьРаботуСЧеком);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.РассчитатьСкидки);
	ЭлементыДляОбработки.Добавить(ЭлементыФормы.УдалитьЧек);
	
	Для Каждого ЭлементФормыКСО Из ЭлементыДляОбработки Цикл
		ЭлементФормыКСО.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКартинкуСтатусаКассовыхСмен(СтатусСмен)
	
	КартинкиСтатусов = Новый Соответствие;
	ГрупповыеСтатусы = ИнтерфейсРМКСлужебныйКлиентСервер.ГрупповыеСтатусыКассовыхСмен();
	КартинкиСтатусов.Вставить(ГрупповыеСтатусы.СменыАктуальны, БиблиотекаКартинок.РМКЗеленыйКруг);
	КартинкиСтатусов.Вставить(ГрупповыеСтатусы.СменыАктуальныЧастично, БиблиотекаКартинок.РМККрасноЗеленыйКруг);
	КартинкиСтатусов.Вставить(ГрупповыеСтатусы.ТребуетсяОткрытиеСмен, БиблиотекаКартинок.РМККрасныйКруг);
	
	Возврат КартинкиСтатусов.Получить(СтатусСмен);
	
КонецФункции

Процедура ПеренестиЗначенияСвойствВНабор(НаборПриемник, НаборИсточник)
	
	Для Каждого СтрокаСвойства Из НаборИсточник Цикл
		НаборПриемник.Вставить(СтрокаСвойства.Ключ, СтрокаСвойства.Значение);
	КонецЦикла;
	
КонецПроцедуры

Функция ОбластиПримененияНастроекПанели()
	
	ОбластиПрименения = Новый Структура();
	ОбластиПрименения.Вставить("ОбычныйИнтерфейс", 0);
	ОбластиПрименения.Вставить("ПлиточныйИнтерфейс", 1);
	ОбластиПрименения.Вставить("Везде", 2);
	
	Возврат ОбластиПрименения;
	
КонецФункции

Функция ПолучитьСтрокиСоставаПалитрыБезСвязи(СоставПалитры, ПроверяемыеКатегории = Неопределено)
	
	МассивСтрокСостава = Новый Массив;
	
	КоличествоСтрок = СоставПалитры.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок Цикл
		ИндексТекущейСтроки = КоличествоСтрок - ИндексСтроки - 1;
		СтрокаСостава = СоставПалитры.Получить(ИндексТекущейСтроки);
		
		Если СтрокаСостава.ЭтоКатегория И (ПроверяемыеКатегории = Неопределено
				Или Не ПроверяемыеКатегории.Найти(СтрокаСостава.НомерКатегории) = Неопределено) Тогда
				
			ОтборДетей = Новый Структура("НомерКатегорииРазмещения", СтрокаСостава.НомерКатегории);
			ДетиГруппы = СоставПалитры.НайтиСтроки(ОтборДетей);
			Если ДетиГруппы.Количество() = 0 Тогда
				МассивСтрокСостава.Добавить(СтрокаСостава);
			КонецЕсли;
			
		ИначеЕсли ПроверяемыеКатегории = Неопределено И ЗначениеЗаполнено(СтрокаСостава.ВидМодификатора)
				И СтрокаСостава.НомерКатегорииРазмещения > 0 Тогда
			
			ОтборРодителей = Новый Структура("НомерКатегории", СтрокаСостава.НомерКатегорииРазмещения);
			РодителиМодификатора = СоставПалитры.НайтиСтроки(ОтборРодителей);
			Если РодителиМодификатора.Количество() = 0 Тогда
				МассивСтрокСостава.Добавить(СтрокаСостава);
			КонецЕсли;
			
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат МассивСтрокСостава;
	
КонецФункции

Процедура ДобавитьСтрокиУровняДерева(Форма, ИсходныеСтроки, СтрокиПриемника, Знач ТекущийУровень, ГруппировкаУровня)
	
	ТипыГруппировок = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыГруппировок();
	ВозможныеСостоянияНастроек = ИнтерфейсРМКСлужебныйКлиентСервер.ВозможныеСостоянияНастроек();
	
	КолонкаШирина = "Ширина";
	КолонкаВысота = "Высота";
	КолонкаШиринаВПроцентах = "ШиринаВПроцентах";
	КолонкаВысотаВПроцентах = "ВысотаВПроцентах";
	МаксимальныйПроцент = 100;
	ШиринаГруппы = ПолучитьОбщуюШиринуГруппы(ИсходныеСтроки, ГруппировкаУровня);
	ВысотаГруппы = ПолучитьОбщуюВысотуГруппы(ИсходныеСтроки, ГруппировкаУровня);
	ОбщееЗначениеРазмера = ?(ГруппировкаУровня = ТипыГруппировок.Вертикальная, ВысотаГруппы, ШиринаГруппы);
	Если ТекущийУровень = 1 Тогда
		Форма.ШиринаСхемыРМК = ШиринаГруппы;
		Форма.ВысотаСхемыРМК = ВысотаГруппы;
	КонецЕсли;
	
	ИмяКолонкиРаспределения = ?(ГруппировкаУровня = ТипыГруппировок.Вертикальная, КолонкаВысота, КолонкаШирина);
	ИмяКолонкиРаспределенияВПроцентах
		= ?(ГруппировкаУровня = ТипыГруппировок.Вертикальная, КолонкаВысотаВПроцентах, КолонкаШиринаВПроцентах);
	
	НаименьшийРазмер = 0;
	НаибольшийРазмер = 0;
	МинимальнаяСтрока = Неопределено;
	МаксимальнаяСтрока = Неопределено;
	РазницаОкругления = 100;
	
	Для Каждого СтрокаИсточника Из ИсходныеСтроки Цикл
		
		ПроцентРазмераДробный = 100 * СтрокаИсточника[ИмяКолонкиРаспределения] / ОбщееЗначениеРазмера;
		ПроцентРазмера = Окр(ПроцентРазмераДробный, 1, РежимОкругления.Окр15как20);
		
		НоваяСтрока = СтрокиПриемника.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточника);
		НоваяСтрока.ИсходныйПорядок = СтрокиПриемника.Индекс(НоваяСтрока) + 1;
		
		Если СтрокаИсточника.ДоступностьГруппы Тогда
			НоваяСтрока.ШиринаВПроцентах = ?(ГруппировкаУровня = ТипыГруппировок.Вертикальная,
				МаксимальныйПроцент, ПроцентРазмера);
			НоваяСтрока.ВысотаВПроцентах = ?(ГруппировкаУровня = ТипыГруппировок.Вертикальная,
				ПроцентРазмера, МаксимальныйПроцент);
			
			Если НаименьшийРазмер = 0 Или СтрокаИсточника[ИмяКолонкиРаспределения] < НаименьшийРазмер Тогда
				НаименьшийРазмер = СтрокаИсточника[ИмяКолонкиРаспределения];
				МинимальнаяСтрока = НоваяСтрока;
			КонецЕсли;
			Если СтрокаИсточника[ИмяКолонкиРаспределения] > НаибольшийРазмер Тогда
				НаибольшийРазмер = СтрокаИсточника[ИмяКолонкиРаспределения];
				МаксимальнаяСтрока = НоваяСтрока;
			КонецЕсли;
			РазницаОкругления = РазницаОкругления - ПроцентРазмера;
			
			ДобавитьСтрокиУровняДерева(Форма, СтрокаИсточника.Строки, НоваяСтрока.ПолучитьЭлементы(), ТекущийУровень + 1,
				СтрокаИсточника.Группировка);
		Иначе
			НоваяСтрока.ШиринаВПроцентах = 0;
			НоваяСтрока.ВысотаВПроцентах = 0;
		КонецЕсли;
		НоваяСтрока.СостояниеНастроек = ПолучитьИндексСостоянияНастроекОбласти(Форма, СтрокаИсточника.ЗаголовокОбласти);
		
	КонецЦикла;
	
	Если РазницаОкругления <> 100 И РазницаОкругления <> 0 Тогда
		Если РазницаОкругления > 0 И Не МинимальнаяСтрока = Неопределено Тогда
			МинимальнаяСтрока[ИмяКолонкиРаспределенияВПроцентах]
				= МинимальнаяСтрока[ИмяКолонкиРаспределенияВПроцентах] + РазницаОкругления;
		ИначеЕсли РазницаОкругления < 0 И Не МаксимальнаяСтрока = Неопределено Тогда
			МаксимальнаяСтрока[ИмяКолонкиРаспределенияВПроцентах]
				= МаксимальнаяСтрока[ИмяКолонкиРаспределенияВПроцентах] + РазницаОкругления;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрименитьСохраненныйПорядокОбластей(Форма)
	
	МодельОбластейРМК = Форма.МодельОбластейРМК;
	КорневаяГруппа = ?(Форма.ГоризонтальнаяОриентация,
		МодельОбластейРМК.ГоризонтальнаяОриентация, МодельОбластейРМК.ВертикальнаяОриентация);
	ПрименитьСохраненныйПорядокДляУровня(Форма, КорневаяГруппа.Имя, Форма.ДеревоОбластейФормыРМК.ПолучитьЭлементы());
	
КонецПроцедуры

Процедура ПрименитьСохраненныйПорядокДляУровня(Форма, ИмяРодителя, СтрокиУровня)
	
	Для Каждого СтрокаДерева Из СтрокиУровня Цикл
		Если СтрокаДерева.ПолучитьЭлементы().Количество() > 0 Тогда
			ПрименитьСохраненныйПорядокДляУровня(Форма, СтрокаДерева.ИмяОбласти, СтрокаДерева.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла;
	ПрименитьСохраненныйПорядокДляПодчиненныхСтрокУровня(Форма, ИмяРодителя, СтрокиУровня);
	
КонецПроцедуры

Процедура ПрименитьСохраненныйПорядокДляПодчиненныхСтрокУровня(Форма, ИмяРодителя, СтрокиУровня)
	
	ОтборСтрок = Новый Структура("ОбластьРодитель,ВертикальнаяОриентация",
		ИмяРодителя, (Не Форма.ГоризонтальнаяОриентация));
	СтрокиПорядка = Форма.ПорядокОбластей.НайтиСтроки(ОтборСтрок);
	Для Каждого СтрокаПорядка Из СтрокиПорядка Цикл
		ИндексОбластиВДереве = -1;
		СтрокаОбластиВДереве = ПолучитьСтрокуДереваОбластиПоИмени(СтрокиУровня, СтрокаПорядка.Область, ИндексОбластиВДереве);
		ВПределахГраницы = (СтрокаПорядка.Порядок > 0 И СтрокаПорядка.Порядок <= СтрокиУровня.Количество());
		Если (Не СтрокаОбластиВДереве = Неопределено) И СтрокаПорядка.Порядок <> ИндексОбластиВДереве + 1
				И ВПределахГраницы Тогда
			СтрокиУровня.Сдвинуть(ИндексОбластиВДереве, СтрокаПорядка.Порядок - ИндексОбластиВДереве - 1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОбщуюШиринуГруппы(ИсходныеСтроки, ГруппировкаУровня)
	
	ТипыГруппировок = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыГруппировок();
	
	РезультатФункции = 0;
	Если ИсходныеСтроки.Количество() > 0 Тогда
		Если ГруппировкаУровня = ТипыГруппировок.Вертикальная Тогда
			РезультатФункции = ИсходныеСтроки[0].Ширина;
		Иначе
			Для Каждого СтрокаОбласти Из ИсходныеСтроки Цикл
				Если СтрокаОбласти.ДоступностьГруппы Тогда
					РезультатФункции = РезультатФункции + СтрокаОбласти.Ширина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если РезультатФункции = 0 Тогда
		РезультатФункции = 1;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьОбщуюВысотуГруппы(ИсходныеСтроки, ГруппировкаУровня)
	
	ТипыГруппировок = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыГруппировок();
	
	РезультатФункции = 0;
	Если ИсходныеСтроки.Количество() > 0 Тогда
		Если ГруппировкаУровня = ТипыГруппировок.Вертикальная Тогда
			Для Каждого СтрокаОбласти Из ИсходныеСтроки Цикл
				Если СтрокаОбласти.ДоступностьГруппы Тогда
					РезультатФункции = РезультатФункции + СтрокаОбласти.Высота;
				КонецЕсли;
			КонецЦикла;
		Иначе
			РезультатФункции = ИсходныеСтроки[0].Высота;
		КонецЕсли;
	КонецЕсли;
	Если РезультатФункции = 0 Тогда
		РезультатФункции = 1;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьСтрокуДереваОбластиПоИмени(СтрокиУровня, ИмяОбласти, ИндексОбластиВДереве)
	
	РезультатФункции = Неопределено;
	
	КоличествоСтрок = СтрокиУровня.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаОбласти = СтрокиУровня.Получить(ИндексСтроки);
		Если СтрокаОбласти.ИмяОбласти = ИмяОбласти Тогда
			РезультатФункции = СтрокаОбласти;
			ИндексОбластиВДереве = ИндексСтроки;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьИндексСостоянияНастроекОбласти(Форма, ЗаголовокОбласти)
	Перем СценарийИспользования;
	
	ВозможныеСостоянияНастроек = ИнтерфейсРМКСлужебныйКлиентСервер.ВозможныеСостоянияНастроек();
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВлияющиеПараметры") Тогда
		СценарийИспользования = Форма.ВлияющиеПараметры.СценарийИспользования;
	Иначе
		СценарийИспользования = Форма.НастройкиРМК.СценарийИспользования;
	КонецЕсли;
	ОтборСтрокНастроек = Новый Структура();
	ОтборСтрокНастроек.Вставить("ЗаголовокОбласти", ЗаголовокОбласти);
	СтрокиНастроекФормы = Форма.НастройкиОбластейФормыРМК.НайтиСтроки(ОтборСтрокНастроек);
	ИндексСтроки = 0;
	РезультатФункции = ВозможныеСостоянияНастроек.НеИмеетНастроек;
	
	Пока ИндексСтроки < СтрокиНастроекФормы.Количество()
				И Не РезультатФункции = ВозможныеСостоянияНастроек.НастройкиИзменены Цикл
		СтрокаНастройки = СтрокиНастроекФормы[ИндексСтроки];
		ЗаголовокОбласти = СтрокаНастройки.ЗаголовокОбласти;
		Если ИнтерфейсРМКСлужебныйКлиентСервер.НастройкаОбластиСоответствуетСценариюИспользования(ЗаголовокОбласти,
				СтрокаНастройки.СвойствоЭлементовОбласти, СценарийИспользования) Тогда
			Если Не СтрокаНастройки.ЗначениеСвойства = СтрокаНастройки.ЗначениеПоУмолчанию Тогда
				РезультатФункции = ВозможныеСостоянияНастроек.НастройкиИзменены;
			ИначеЕсли РезультатФункции = ВозможныеСостоянияНастроек.НеИмеетНастроек Тогда
				РезультатФункции = ВозможныеСостоянияНастроек.НастройкиПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьБазовыеНастройкиЭлементовРМК()
	
	СвойствоШиринаКнопок = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок;
	СвойствоЦветКнопок = Перечисления.СвойстваЭлементовРМК.ЦветКнопок;
	
	ТиповыеАвтоЗначения = ПолучитьТиповыеАвтоЗначенияСвойствНастроекЭлементов();
	ТаблицаНастроек = Справочники.НастройкиРабочегоМестаКассира.ПустаяСсылка().НастройкиЭлементов.ВыгрузитьКолонки();
	ТаблицаНастроек.Колонки.Удалить("ИмяЭлемента");
	ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоШиринаКнопок, 0);
	ДобавитьСтрокуНастроекЭлементов(ТаблицаНастроек, СвойствоЦветКнопок, ТиповыеАвтоЗначения.ЦветАвто);
	
	Возврат ТаблицаНастроек;
	
КонецФункции

Процедура ДобавитьПараметрНастройки(ПараметрыНастроек, ИмяПараметра, ЗначениеПараметра)
	
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		ПараметрыНастроек.Вставить(ИмяПараметра, ЗначениеПараметра);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПанельУправленияТекущимТоваромКСО(Форма, НастройкиЭлементов)
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЭлементыФормы = Форма.Элементы;
	ЭлементыФормы.ГруппаРучнаяСкидка.Видимость = Ложь;
	
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	НаборСвойствПанели = НастройкиЭлементов.Получить(ЗаголовкиОбластей.ОбластьДанныеТекущегоТовара);
	СвойствоЦветКнопок = Перечисления.СвойстваЭлементовРМК.ЦветКнопок;
	СвойствоРазмер = Перечисления.СвойстваЭлементовРМК.РазмерКнопок;
	СвойствоРазмерВПлитке = Перечисления.СвойстваЭлементовРМК.РазмерКнопокПлиточныйИнтерфейс;
	
	ЗначениеРазмера = 0;
	ЗначениеРазмераВПлитке = 0;
	
	ПараметрыНастроек = Новый Структура();
	ПараметрыНастроек.Вставить("БазовыйРазмер", 14);
	ПараметрыНастроек.Вставить("ЗначениеЦвета", ?(ЭтоИнтерфейс85, Неопределено, WebЦвета.Бежевый));
	
	Если Не НаборСвойствПанели = Неопределено Тогда
		Если ЗначениеЗаполнено(НаборСвойствПанели.Получить(СвойствоРазмер)) Тогда
			ЗначениеРазмера = НаборСвойствПанели.Получить(СвойствоРазмер);
		КонецЕсли;
		Если ЗначениеЗаполнено(НаборСвойствПанели.Получить(СвойствоРазмерВПлитке)) Тогда
			ЗначениеРазмераВПлитке = НаборСвойствПанели.Получить(СвойствоРазмерВПлитке);
		КонецЕсли;
		ДобавитьПараметрНастройки(ПараметрыНастроек, "ЗначениеЦвета", НаборСвойствПанели.Получить(СвойствоЦветКнопок));
	КонецЕсли;
	
	ПриведенныйРазмер = ПараметрыНастроек.БазовыйРазмер + 2 * ЗначениеРазмера - 2;
	ПриведенныйРазмерВПлитке = (ПараметрыНастроек.БазовыйРазмер + 1) + 2 * ЗначениеРазмераВПлитке;
	ВысотаГруппы = 3 + ЗначениеРазмера;
	ВысотаГруппыВПлитке = ?(ЭтоИнтерфейс85, 5, 5) + ЗначениеРазмераВПлитке;
	
	ПараметрыНастроек.Вставить("ПриведенныйРазмер", ПриведенныйРазмер);
	ПараметрыНастроек.Вставить("ПриведенныйРазмерВПлитке", ПриведенныйРазмерВПлитке);
	ПараметрыНастроек.Вставить("ВысотаГруппы", ВысотаГруппы);
	ПараметрыНастроек.Вставить("ВысотаГруппыВПлитке", ВысотаГруппыВПлитке);
	
	СформироватьПанельТекущегоТовараСпискаКСО(Форма, ПараметрыНастроек);
	ПараметрыНастроек.БазовыйРазмер = 15;
	СформироватьПанельТекущегоТовараПлиточногоИнтерфейсаКСО(Форма, ПараметрыНастроек);
	
КонецПроцедуры

Процедура СформироватьПанельОперацийКСО(Форма, НастройкиЭлементов)
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЭлементыФормы = Форма.Элементы;
	ЭлементыФормы.ГруппаУправления.Видимость = Ложь;
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	НаборСвойствПанели = НастройкиЭлементов.Получить(ЗаголовкиОбластей.ОбластьПанельОпераций);
	СвойствоШирина = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок;
	СвойствоВысота = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
	СвойствоЦветКнопок = Перечисления.СвойстваЭлементовРМК.ЦветКнопок;
	СвойствоПоложениеЧасов = Перечисления.СвойстваЭлементовРМК.ПоложениеЧасов;
	СвойствоРазмер = Перечисления.СвойстваЭлементовРМК.РазмерКнопок;
	
	ЗначениеШирины = 0;
	ЗначениеВысоты = 0;
	ЗначениеРазмера = 0;
	ПараметрыНастроек = Новый Структура();
	ПараметрыНастроек.Вставить("БазоваяШирина", 15);
	ПараметрыНастроек.Вставить("ЗначениеЦвета", ?(ЭтоИнтерфейс85, Неопределено, WebЦвета.Бежевый));
	ПараметрыНастроек.Вставить("ЗначениеПоложенияЧасов", Неопределено);
	
	Если Не НаборСвойствПанели = Неопределено Тогда
		Если ЗначениеЗаполнено(НаборСвойствПанели.Получить(СвойствоШирина)) Тогда
			ЗначениеШирины = НаборСвойствПанели.Получить(СвойствоШирина);
		КонецЕсли;
		Если ЗначениеЗаполнено(НаборСвойствПанели.Получить(СвойствоВысота)) Тогда
			ЗначениеВысоты = НаборСвойствПанели.Получить(СвойствоВысота);
		КонецЕсли;
		Если ЗначениеЗаполнено(НаборСвойствПанели.Получить(СвойствоРазмер)) Тогда
			ЗначениеРазмера = НаборСвойствПанели.Получить(СвойствоРазмер);
		КонецЕсли;
		ДобавитьПараметрНастройки(ПараметрыНастроек, "ЗначениеЦвета", НаборСвойствПанели.Получить(СвойствоЦветКнопок));
		ДобавитьПараметрНастройки(ПараметрыНастроек, "ЗначениеПоложенияЧасов",
			НаборСвойствПанели.Получить(СвойствоПоложениеЧасов));
	КонецЕсли;
	
	ШиринаТакси = ?(ЗначениеЗаполнено(ЗначениеШирины), ЗначениеШирины, ПараметрыНастроек.БазоваяШирина);
	ШиринаКарточки = ?(ЭтоИнтерфейс85, ПараметрыНастроек.БазоваяШирина + 2 * ЗначениеРазмера, ШиринаТакси);
	ВысотаТакси = ?(ЗначениеЗаполнено(ЗначениеВысоты), ЗначениеВысоты, 5);
	ВысотаГруппы = ?(ЭтоИнтерфейс85, 5 + ЗначениеРазмера, ВысотаТакси);
	ПараметрыНастроек.Вставить("ВысотаГруппы", ВысотаГруппы);
	ПараметрыНастроек.Вставить("ШиринаКарточки", ШиринаКарточки);
	
	СформироватьПанельОперацийСпискаКСО(Форма, ПараметрыНастроек);
	СформироватьПанельОперацийПлиточногоИнтерфейсаКСО(Форма, ПараметрыНастроек);
	ЭлементыФормы.ГруппаУправленияПлиточныйИнтерфейс.Видимость = Ложь;
	ЭлементыФормы.ГруппаУправленияКСО.Видимость = Истина;
	
	ПараметрыНастроек.БазоваяШирина = 20;
	ПараметрыНастроек.ШиринаКарточки = Цел(1.33 * ПараметрыНастроек.ШиринаКарточки);
	
	НастроитьНижнююПанельКСО(Форма, ПараметрыНастроек);
	НастроитьПанельЗавершенияОплатыКСО(Форма, ПараметрыНастроек);
	
КонецПроцедуры

Функция ШаблонДанныхКнопкиПанелиОперацийКСО()
	
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("Имя", "");
	ДанныеКнопки.Вставить("ИмяДействия", "");
	ДанныеКнопки.Вставить("Положение", Неопределено);
	ДанныеКнопки.Вставить("Картинка", Неопределено);
	ДанныеКнопки.Вставить("Заголовок", "");
	ДанныеКнопки.Вставить("ВысотаЗаголовка", 0);
	
	Возврат ДанныеКнопки;
	
КонецФункции

Функция ШаблонДанныхПоляПанелиКСО()
	
	ДанныеКнопки = Новый Структура();
	ДанныеКнопки.Вставить("Имя", "");
	ДанныеКнопки.Вставить("Редактирование", Ложь);
	ДанныеКнопки.Вставить("ПутьКДанным", "");
	ДанныеКнопки.Вставить("Формат", "");
	
	Возврат ДанныеКнопки;
	
КонецФункции

Функция ПолучитьПриведенныйРазмер(ПараметрыНастроек, ИспользоватьПлиточныеРазмеры)
	
	РезультатФункции = ?(ИспользоватьПлиточныеРазмеры, ПараметрыНастроек.ПриведенныйРазмерВПлитке,
		ПараметрыНастроек.ПриведенныйРазмер);
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьМасштабШрифтаКартинки(ПараметрыНастроек, ИспользоватьПлиточныеРазмеры = Ложь)
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	БазовыйМасштаб = 120;
	БазоваяШирина = ?(ПараметрыНастроек.Свойство("БазовыйРазмер"),
		ПараметрыНастроек.БазовыйРазмер, ПараметрыНастроек.БазоваяШирина);
	ШиринаКарточки = ?(ПараметрыНастроек.Свойство("ШиринаКарточки"),
		ПараметрыНастроек.ШиринаКарточки, ПолучитьПриведенныйРазмер(ПараметрыНастроек, ИспользоватьПлиточныеРазмеры));
	
	Если ШиринаКарточки <= БазоваяШирина И Не ЭтоИнтерфейс85 Тогда
		МасштабШрифтаКартинки = БазовыйМасштаб;
	Иначе
		МасштабШрифтаКартинки
			= Цел(БазовыйМасштаб * Pow(ШиринаКарточки / БазоваяШирина, 2));
	КонецЕсли;
	
	Возврат МасштабШрифтаКартинки;
	
КонецФункции

Функция ПолучитьМасштабШрифтаКартинкиОплаты(ВысотаКнопкиОплаты)
	
	РезультатФункции = 120;
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	БазоваяВысота = 5;
	
	Если ВысотаКнопкиОплаты > БазоваяВысота Или ЭтоИнтерфейс85 Тогда
		РезультатФункции = Цел(РезультатФункции * Pow(ВысотаКнопкиОплаты / БазоваяВысота, 2));
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДобавитьПолеВГруппуУправления(Форма, ГруппаУправления, ДанныеПоля, ПараметрыНастроек)
	
	ЭлементыФормы = Форма.Элементы;
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	
	МасштабШрифта = Цел(?(ЭтоИнтерфейс85, 100, 120)
		* Pow(ПараметрыНастроек.ПриведенныйРазмер / (ПараметрыНастроек.БазовыйРазмер - 1), 2));
	Если ЭтоИнтерфейс85 Тогда
	
		ИмяЭлемента = СтрШаблон("Группа%1КСО", ДанныеПоля.Имя);
		КарточкаПоля = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаУправления);
		КарточкаПоля.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		КарточкаПоля.Отображение = ОтображениеОбычнойГруппы.Нет;
		КарточкаПоля.ОтображатьЗаголовок = Ложь;
		КарточкаПоля.ОтображатьКакКарточку = Истина;
		КарточкаПоля.Гиперссылка = ДанныеПоля.Редактирование;
		КарточкаПоля.ЦветФона = ЦветаПалитры.Серый;
	
		Если ДанныеПоля.Редактирование Тогда
			ИмяСобытия = СтрШаблон("Подключаемый_Группа%1КСОНажатие", ДанныеПоля.Имя);
			КарточкаПоля.УстановитьДействие("Нажатие", ИмяСобытия);
		КонецЕсли;
	
		ИмяЭлемента = СтрШаблон("%1КСО", ДанныеПоля.Имя);
		ПолеДанных = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), КарточкаПоля);
		ПолеДанных.Вид = ВидПоляФормы.ПолеНадписи;
		ПолеДанных.АвтоМаксимальнаяШирина = Ложь;
		ПолеДанных.МаксимальнаяШирина = ПараметрыНастроек.ПриведенныйРазмер;
		ПолеДанных.ИспользоватьКопирование = Ложь;
		ПолеДанных.РастягиватьПоГоризонтали = Истина;
		Если ЗначениеЗаполнено(ДанныеПоля.Формат) Тогда
			ПолеДанных.Формат = ДанныеПоля.Формат;
		КонецЕсли;
		ПолеДанных.ЦветФона = WebЦвета.Белый;
		
	Иначе
		
		ИмяЭлемента = СтрШаблон("%1КСО", ДанныеПоля.Имя);
		ПолеДанных = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаУправления);
		ПолеДанных.Вид = ВидПоляФормы.ПолеВвода;
		ПолеДанных.КнопкаВыбора = Ложь;
		ПолеДанных.АвтоМаксимальнаяШирина = Ложь;
		ПолеДанных.Ширина = ПараметрыНастроек.БазовыйРазмер
			+ 2 * (ПараметрыНастроек.ПриведенныйРазмер - ПараметрыНастроек.БазовыйРазмер + 2);
			
		Если ДанныеПоля.Редактирование Тогда
			ИмяСобытияПриИзменении = СтрШаблон("Подключаемый_%1КСОПриИзменении", ДанныеПоля.Имя);
			ПолеДанных.УстановитьДействие("ПриИзменении", ИмяСобытияПриИзменении);
			
			ИмяСобытияНачалоВыбора = СтрШаблон("Подключаемый_%1КСОНачалоВыбора", ДанныеПоля.Имя);
			ПолеДанных.УстановитьДействие("НачалоВыбора", ИмяСобытияНачалоВыбора);
			
			ИмяСобытияАвтоПодбор = СтрШаблон("Подключаемый_%1КСОАвтоПодбор", ДанныеПоля.Имя);
			ПолеДанных.УстановитьДействие("АвтоПодбор", ИмяСобытияАвтоПодбор);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеПоля.Формат) Тогда
			ПолеДанных.ФорматРедактирования = ДанныеПоля.Формат;
		КонецЕсли;
		
	КонецЕсли;
	ПолеДанных.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеДанных.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	ПолеДанных.ПутьКДанным = ДанныеПоля.ПутьКДанным;
	ПолеДанных.РастягиватьПоВертикали = Истина;
	ПолеДанных.Шрифт = Новый Шрифт(ШрифтыСтиля.ЗаголовокВторогоУровня, , , , , , , МасштабШрифта);
	ПолеДанных.ТолькоПросмотр = Не ДанныеПоля.Редактирование;
	
КонецФункции

Функция ДобавитьТекстовуюКнопкуВГруппуУправления(Форма, ГруппаУправления, ДанныеКнопки, ПараметрыНастроек,
		ИспользоватьПлиточныеРазмеры = Ложь)
		
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЭлементыФормы = Форма.Элементы;
	ИмяДействия = СтрШаблон("Подключаемый_Кнопка%1КСОНажатие", ДанныеКнопки.Имя);
	
	ИмяЭлемента = СтрШаблон("Кнопка%1КСО", ДанныеКнопки.Имя);
	КнопкаКарточка = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаУправления);
	КнопкаКарточка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	КнопкаКарточка.Отображение = ОтображениеОбычнойГруппы.Нет;
	КнопкаКарточка.ОтображатьЗаголовок = Ложь;
	КнопкаКарточка.ОтображатьКакКарточку = Истина;
	КнопкаКарточка.Гиперссылка = Истина;
	Если Не ДанныеКнопки.Положение = Неопределено Тогда
		КнопкаКарточка.ГоризонтальноеПоложениеВГруппе = ДанныеКнопки.Положение;
	КонецЕсли;
	КнопкаКарточка.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	КнопкаКарточка.РастягиватьПоГоризонтали = Ложь;
	КнопкаКарточка.РастягиватьПоВертикали = Истина;
	Если Не ПараметрыНастроек.ЗначениеЦвета = Неопределено Тогда
		КнопкаКарточка.ЦветФона = ПараметрыНастроек.ЗначениеЦвета;
	КонецЕсли;
	КнопкаКарточка.УстановитьДействие("Нажатие", ИмяДействия);
	
	ПриведенныйРазмер = ?(ИспользоватьПлиточныеРазмеры, ПараметрыНастроек.ПриведенныйРазмерВПлитке,
		ПараметрыНастроек.ПриведенныйРазмер);
	МасштабШрифта = Цел(?(ЭтоИнтерфейс85, 100, 120) * Pow(ПриведенныйРазмер / (ПараметрыНастроек.БазовыйРазмер - 2), 2));
	
	ИмяЭлемента = СтрШаблон("ЗаголовокКнопки%1КСО", ДанныеКнопки.Имя);
	ЗаголовокКнопки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), КнопкаКарточка);
	ЗаголовокКнопки.Вид = ВидДекорацииФормы.Надпись;
	ЗаголовокКнопки.Шрифт = Новый Шрифт(ШрифтыСтиля.ЗаголовокВторогоУровня, , , , , , , МасштабШрифта);
	ЗаголовокКнопки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ЗаголовокКнопки.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
	ЗаголовокКнопки.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ЗаголовокКнопки.РастягиватьПоГоризонтали = Истина;
	ЗаголовокКнопки.Заголовок = ДанныеКнопки.Заголовок;
	Если ЗначениеЗаполнено(ДанныеКнопки.ВысотаЗаголовка) Тогда
		ЗаголовокКнопки.Высота = ДанныеКнопки.ВысотаЗаголовка;
		ЗаголовокКнопки.ВысотаЗаголовка = ДанныеКнопки.ВысотаЗаголовка;
	КонецЕсли;
	
	Возврат КнопкаКарточка;
	
КонецФункции

Процедура ДобавитьКнопкуВГруппуУправления(Форма, ГруппаУправления, ДанныеКнопки, ПараметрыНастроек)
	
	ЭлементыФормы = Форма.Элементы;
	ИмяДействия = СтрШаблон("Подключаемый_Кнопка%1КСОНажатие", ДанныеКнопки.Имя);
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	
	ИмяЭлемента = СтрШаблон("Кнопка%1КСО", ДанныеКнопки.Имя);
	КнопкаКарточка = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаУправления);
	КнопкаКарточка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	КнопкаКарточка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	КнопкаКарточка.Отображение = ОтображениеОбычнойГруппы.Нет;
	КнопкаКарточка.ОтображатьЗаголовок = Ложь;
	КнопкаКарточка.ОтображатьКакКарточку = Истина;
	КнопкаКарточка.Гиперссылка = Истина;
	КнопкаКарточка.Ширина = ПараметрыНастроек.ШиринаКарточки;
	КнопкаКарточка.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	Если Не ДанныеКнопки.Положение = Неопределено Тогда
		КнопкаКарточка.ГоризонтальноеПоложениеВГруппе = ДанныеКнопки.Положение;
	КонецЕсли;
	КнопкаКарточка.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	КнопкаКарточка.РастягиватьПоГоризонтали = Ложь;
	КнопкаКарточка.РастягиватьПоВертикали = Истина;
	Если Не ПараметрыНастроек.ЗначениеЦвета = Неопределено Тогда
		КнопкаКарточка.ЦветФона = ПараметрыНастроек.ЗначениеЦвета;
	КонецЕсли;
	КнопкаКарточка.УстановитьДействие("Нажатие", ИмяДействия);

	МасштабШрифтаКартинки = ПолучитьМасштабШрифтаКартинки(ПараметрыНастроек);
	МасштабШрифтаЗаголовка = Цел(?(ЭтоИнтерфейс85, 90, 100)
		* ПараметрыНастроек.ШиринаКарточки / ПараметрыНастроек.БазоваяШирина);
	
	ИмяЭлемента = СтрШаблон("ИконкаКнопки%1КСО", ДанныеКнопки.Имя);
	ИконкаКнопки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), КнопкаКарточка);
	ИконкаКнопки.Вид = ВидДекорацииФормы.Картинка;
	ИконкаКнопки.Картинка = ДанныеКнопки.Картинка;
	ИконкаКнопки.Шрифт = Новый Шрифт(ШрифтыСтиля.ЗаголовокПервогоУровня, , , , , , , МасштабШрифтаКартинки);
	ИконкаКнопки.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
	ИконкаКнопки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ИконкаКнопки.РастягиватьПоВертикали = Ложь;
	
	ИмяЭлемента = СтрШаблон("ЗаголовокКнопки%1КСО", ДанныеКнопки.Имя);
	ЗаголовокКнопки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), КнопкаКарточка);
	ЗаголовокКнопки.Вид = ВидДекорацииФормы.Надпись;
	ЗаголовокКнопки.Шрифт = Новый Шрифт(ШрифтыСтиля.ЗаголовокВторогоУровня, , , , , , , МасштабШрифтаЗаголовка);
	ЗаголовокКнопки.МаксимальнаяШирина = ПараметрыНастроек.ШиринаКарточки;
	ЗаголовокКнопки.АвтомаксимальнаяШирина = Ложь;
	ЗаголовокКнопки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ЗаголовокКнопки.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
	ЗаголовокКнопки.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ЗаголовокКнопки.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	ЗаголовокКнопки.РастягиватьПоГоризонтали = Истина;
	ЗаголовокКнопки.Заголовок = ДанныеКнопки.Заголовок;
	Если ЗначениеЗаполнено(ДанныеКнопки.ВысотаЗаголовка) Тогда
		ЗаголовокКнопки.Высота = ДанныеКнопки.ВысотаЗаголовка;
		ЗаголовокКнопки.ВысотаЗаголовка = ДанныеКнопки.ВысотаЗаголовка;
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьКнопкуНавигацииВГруппуУправления(Форма, ГруппаУправления, ДанныеКнопки, ПараметрыНастроек,
		ИспользоватьПлиточныеРазмеры = Ложь)
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЭлементыФормы = Форма.Элементы;
	ИмяДействия = "";
	Если ЗначениеЗаполнено(ДанныеКнопки.ИмяДействия) Тогда
		ИмяДействия = ДанныеКнопки.ИмяДействия;
	Иначе
		ИмяДействия = СтрШаблон("Подключаемый_Кнопка%1КСОНажатие", ДанныеКнопки.Имя);
	КонецЕсли;
	
	ИмяЭлемента = СтрШаблон("Кнопка%1КСО", ДанныеКнопки.Имя);
	КнопкаКарточка = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаУправления);
	КнопкаКарточка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	КнопкаКарточка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	КнопкаКарточка.Отображение = ОтображениеОбычнойГруппы.Нет;
	КнопкаКарточка.ОтображатьЗаголовок = Ложь;
	КнопкаКарточка.ОтображатьКакКарточку = Истина;
	КнопкаКарточка.Гиперссылка = Истина;
	Если Не ДанныеКнопки.Положение = Неопределено Тогда
		КнопкаКарточка.ГоризонтальноеПоложениеВГруппе = ДанныеКнопки.Положение;
	КонецЕсли;
	Если Не ПараметрыНастроек.ЗначениеЦвета = Неопределено Тогда
		КнопкаКарточка.ЦветФона = ПараметрыНастроек.ЗначениеЦвета;
	КонецЕсли;
	КнопкаКарточка.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	КнопкаКарточка.УстановитьДействие("Нажатие", ИмяДействия);
	
	МасштабШрифтаКартинки = ПолучитьМасштабШрифтаКартинки(ПараметрыНастроек, ИспользоватьПлиточныеРазмеры);
	
	ИмяЭлемента = СтрШаблон("ИконкаКнопки%1КСО", ДанныеКнопки.Имя);
	ИконкаКнопки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), КнопкаКарточка);
	ИконкаКнопки.Вид = ВидДекорацииФормы.Картинка;
	ИконкаКнопки.Картинка = ДанныеКнопки.Картинка;
	ИконкаКнопки.Шрифт = Новый Шрифт(ШрифтыСтиля.ЗаголовокПервогоУровня, , , , , , , МасштабШрифтаКартинки);
	ИконкаКнопки.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
	ИконкаКнопки.РастягиватьПоВертикали = Истина;
	ИконкаКнопки.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	Если ЗначениеЗаполнено(ГруппаУправления.Высота) Тогда
		КнопкаКарточка.Ширина = Цел(ГруппаУправления.Высота * 1.7);
	КонецЕсли;
	
	Возврат КнопкаКарточка;
	
КонецФункции

Процедура ДобавитьКнопкуВесовогоОтбораКСО(Форма, ГруппаУправления, ПараметрыНастроек)
	
	ЭлементыФормы = Форма.Элементы;
	
	ИмяЭлемента = "ГруппаКнопкиВесовойОтборКСО";
	ГруппаКнопкиВесовойОтборКСО = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаУправления);
	ГруппаКнопкиВесовойОтборКСО.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКнопкиВесовойОтборКСО.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаКнопкиВесовойОтборКСО.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКнопкиВесовойОтборКСО.ОтображатьЗаголовок = Ложь;
	ГруппаКнопкиВесовойОтборКСО.РастягиватьПоВертикали = Истина;
	Если Форма.ВертикальнаяОриентация Тогда
		ГруппаКнопкиВесовойОтборКСО.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	КонецЕсли;
	
	Если Не Форма.ВертикальнаяОриентация Тогда
		
		ИмяЭлемента = "ДекорацияОтступВесовойКСО";
		ДекорацияОтступ = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаКнопкиВесовойОтборКСО);
		ДекорацияОтступ.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияОтступ.Заголовок = " ";
		ДекорацияОтступ.Ширина = 2;
		ДекорацияОтступ.РастягиватьПоГоризонтали = Ложь;
		
	КонецЕсли;
	
	ДанныеКнопки = ШаблонДанныхКнопкиПанелиОперацийКСО();
	ДанныеКнопки.Вставить("Имя", "ВесовойОтбор");
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКФильтрВесовой);
	ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Весовой'"));
	ДобавитьКнопкуВГруппуУправления(Форма, ГруппаКнопкиВесовойОтборКСО, ДанныеКнопки, ПараметрыНастроек);
	
КонецПроцедуры

Процедура ПодключитьЧасыНаПанельОперацийКСО(Форма, ГруппаУправления, ЗначениеПоложенияЧасов, ПанельПлитки = Ложь)
	
	Если ЗначениеПоложенияЧасов = "Лево" Или ЗначениеПоложенияЧасов = "Центр" Или ЗначениеПоложенияЧасов = "Право" Тогда
		
		ЭлементыФормы = Форма.Элементы;
		ЧастьИмени = ?(ПанельПлитки, "Плитка", "");
		
		ИмяПодгруппы = СтрШаблон("ПодгруппаЧасы%1КСО", ЧастьИмени);
		ПодгруппаЧасы = ЭлементыФормы.Добавить(ИмяПодгруппы, Тип("ГруппаФормы"), ГруппаУправления);
		ПодгруппаЧасы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ПодгруппаЧасы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ПодгруппаЧасы.Отображение = ОтображениеОбычнойГруппы.Нет;
		ПодгруппаЧасы.ОтображатьЗаголовок = Ложь;
		ПодгруппаЧасы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ПодгруппаЧасы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ПодгруппаЧасы.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		ПодгруппаЧасы.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		ПодгруппаЧасы.РастягиватьПоВертикали = Истина;
		
		СледующийЭлемент = Неопределено;
		Если ЗначениеПоложенияЧасов = "Центр" Тогда
			
			ИмяЭлемента = СтрШаблон("ДекорацияСлеваЧасы%1КСО", ЧастьИмени);
			ДекорацияСлева = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ПодгруппаЧасы);
			ДекорацияСлева.Вид = ВидДекорацииФормы.Надпись;
			ДекорацияСлева.Заголовок = " ";
			ДекорацияСлева.Ширина = 2;
			ДекорацияСлева.АвтоМаксимальнаяШирина = Ложь;
			ДекорацияСлева.РастягиватьПоГоризонтали = Истина;
			
			ИмяЭлемента = СтрШаблон("ДекорацияСправаЧасы%1КСО", ЧастьИмени);
			ДекорацияСправа = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ПодгруппаЧасы);
			ДекорацияСправа.Вид = ВидДекорацииФормы.Надпись;
			ДекорацияСправа.Заголовок = " ";
			ДекорацияСправа.Ширина = 2;
			ДекорацияСправа.АвтоМаксимальнаяШирина = Ложь;
			ДекорацияСправа.РастягиватьПоГоризонтали = Истина;
			
			СледующийЭлемент = ДекорацияСправа;
			ЭлементПослеЧасов = ?(ПанельПлитки, ЭлементыФормы.КнопкаПомощьСотрудникаВПлиткеКСО,
				ЭлементыФормы.КнопкаПомощьСотрудникаКСО);
			ЭлементыФормы.Переместить(ПодгруппаЧасы, ГруппаУправления, ЭлементПослеЧасов);
			
		ИначеЕсли ЗначениеПоложенияЧасов = "Лево" Тогда
			
			ПодгруппаЧасы.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
			ЭлементПослеЧасов = ?(ПанельПлитки, ЭлементыФормы.КнопкаКСпискуКСО, ЭлементыФормы.КнопкаКаталогКСО);
			ЭлементыФормы.Переместить(ПодгруппаЧасы, ГруппаУправления, ЭлементПослеЧасов);
			
		Иначе
			
			ПодгруппаЧасы.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
			
		КонецЕсли;
		Если ПанельПлитки Тогда
			
			ИмяЭлемента = "КартинкаЧасыВПлиткеКСО";
			КартинкаЧасыКСО = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ПодгруппаЧасы);
			КартинкаЧасыКСО.Вид = ВидДекорацииФормы.Картинка;
			КартинкаЧасыКСО.Картинка = БиблиотекаКартинок.РМКЧасы;
			КартинкаЧасыКСО.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
			
			ИмяЭлемента = "ПолеЧасовВПлиткеКСО";
			ПолеЧасов = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ПодгруппаЧасы);
			ПолеЧасов.Вид = ВидПоляФормы.ПолеHTMLДокумента;
			ПолеЧасов.Высота = 1;
			ПолеЧасов.Ширина = 8;
			ПолеЧасов.РастягиватьПоВертикали = Истина;
			ПолеЧасов.РастягиватьПоГоризонтали = Ложь;
			ПолеЧасов.ПутьКДанным = "КодЧасов";
			ПолеЧасов.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеЧасов.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, 0);
			ПолеЧасов.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
			ПолеЧасов.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
			ПолеЧасов.ТолькоПросмотр = Истина;
			
			Если ЗначениеПоложенияЧасов = "Центр" Тогда
				ЭлементыФормы.Переместить(ДекорацияСправа, ПодгруппаЧасы, Неопределено);
			КонецЕсли;
			
		Иначе
			ЭлементыФормы.Переместить(ЭлементыФормы.КартинкаЧасы, ПодгруппаЧасы, СледующийЭлемент);
			ЭлементыФормы.Переместить(ЭлементыФормы.ПолеЧасов, ПодгруппаЧасы, СледующийЭлемент);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПанельОперацийСпискаКСО(Форма, ПараметрыНастроек)
	
	ЭлементыФормы = Форма.Элементы;
	ГруппаУправленияКСО = ЭлементыФормы.ГруппаУправленияКСО;
	
	ИмяЭлемента = "ГруппаУправленияСписок";
	ГруппаУправленияСписок = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаУправленияКСО);
	ГруппаУправленияСписок.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаУправленияСписок.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаУправленияСписок.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаУправленияСписок.ОтображатьЗаголовок = Ложь;
	ГруппаУправленияСписок.Высота = ПараметрыНастроек.ВысотаГруппы;
	ГруппаУправленияСписок.РастягиватьПоГоризонтали = Истина;
	ГруппаУправленияСписок.РастягиватьПоВертикали = Ложь;
	ГруппаУправленияСписок.ВертикальнаяПрокруткаПриСжатии = Ложь;
	
	КартинкаКаталог = ?(ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85(), БиблиотекаКартинок.РМККарточки,
		БиблиотекаКартинок.РМКЭлементПалитрыВложеннаяПалитра);
	ДанныеКнопки = ШаблонДанныхКнопкиПанелиОперацийКСО();
	ДанныеКнопки.Вставить("Имя", "Каталог");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
	ДанныеКнопки.Вставить("Картинка", КартинкаКаталог);
	ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Каталог'"));
	ДанныеКнопки.Вставить("ВысотаЗаголовка", 0);
	ДобавитьКнопкуВГруппуУправления(Форма, ГруппаУправленияСписок, ДанныеКнопки, ПараметрыНастроек);
	
	ДанныеКнопки.Вставить("Имя", "ВвестиШтрихкод");
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКСозданиеШтрихкода);
	ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Ввести штрихкод'"));
	ДанныеКнопки.Вставить("ВысотаЗаголовка", 2);
	ДобавитьКнопкуВГруппуУправления(Форма, ГруппаУправленияСписок, ДанныеКнопки, ПараметрыНастроек);
	
	ДанныеКнопки.Вставить("Имя", "ПомощьСотрудника");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Право);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКДобавитьПерсонал);
	ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Помощь сотрудника'"));
	ДобавитьКнопкуВГруппуУправления(Форма, ГруппаУправленияСписок, ДанныеКнопки, ПараметрыНастроек);
	
	ДанныеКнопки.Вставить("Имя", "НоваяПокупка");
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКНоваяПродажа24);
	ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Новая покупка'"));
	ДобавитьКнопкуВГруппуУправления(Форма, ГруппаУправленияСписок, ДанныеКнопки, ПараметрыНастроек);
	
	ПодключитьЧасыНаПанельОперацийКСО(Форма, ГруппаУправленияСписок, ПараметрыНастроек.ЗначениеПоложенияЧасов);
	ЭлементыФормы.КнопкаКаталогКСО.Видимость = ЗначениеЗаполнено(Форма.СтруктураПлиточногоИнтерфейсаПодбора);
	
КонецПроцедуры

Процедура СформироватьПанельОперацийПлиточногоИнтерфейсаКСО(Форма, ПараметрыНастроек)
	
	ЭлементыФормы = Форма.Элементы;
	ГруппаУправленияКСО = ЭлементыФормы.ГруппаУправленияКСО;
	ГруппаКнопокНавигации = Неопределено;

	ИмяЭлемента = "ГруппаУправленияПлиточныйИнтерфейс";
	ГруппаУправленияПлитка = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаУправленияКСО);
	ГруппаУправленияПлитка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаУправленияПлитка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаУправленияПлитка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаУправленияПлитка.ОтображатьЗаголовок = Ложь;
	ГруппаУправленияПлитка.РастягиватьПоГоризонтали = Истина;
	
	ИмяЭлемента = "ГруппаВерхнийРядУправленияПлитка";
	ГруппаУправленияВерх = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаУправленияПлитка);
	ГруппаУправленияВерх.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаУправленияВерх.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаУправленияВерх.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаУправленияВерх.ОтображатьЗаголовок = Ложь;
	ГруппаУправленияВерх.Высота = ПараметрыНастроек.ВысотаГруппы;
	ГруппаУправленияВерх.РастягиватьПоГоризонтали = Истина;
	ГруппаУправленияВерх.РастягиватьПоВертикали = Ложь;
	ГруппаУправленияВерх.ВертикальнаяПрокруткаПриСжатии = Ложь;
	
	Если Форма.ВертикальнаяОриентация Тогда
	
		ИмяЭлемента = "ГруппаНижнийРядУправленияПлитка";
		ГруппаУправленияНиз = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаУправленияПлитка);
		ГруппаУправленияНиз.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаУправленияНиз.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаУправленияНиз.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаУправленияНиз.ОтображатьЗаголовок = Ложь;
		ГруппаУправленияНиз.РастягиватьПоГоризонтали = Истина;
		ГруппаУправленияНиз.РастягиватьПоВертикали = Ложь;
		ГруппаУправленияНиз.ВертикальнаяПрокруткаПриСжатии = Ложь;
		ГруппаКнопокНавигации = ГруппаУправленияНиз;
		
	Иначе
		
		ГруппаКнопокНавигации = ГруппаУправленияВерх;
		
	КонецЕсли;
	
	ДанныеКнопки = ШаблонДанныхКнопкиПанелиОперацийКСО();
	
	Если Не Форма.ОсновнойПодборПлиточный Тогда
		ДанныеКнопки.Вставить("Имя", "КСписку");
		ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
		ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.ПереместитьВлевоРМК);
		ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'К списку'"));
		ДанныеКнопки.Вставить("ВысотаЗаголовка", 0);
		ДобавитьКнопкуВГруппуУправления(Форма, ГруппаУправленияВерх, ДанныеКнопки, ПараметрыНастроек);
	КонецЕсли;
	
	Если Форма.ВертикальнаяОриентация Тогда
		
		ДанныеКнопки.Вставить("ИмяДействия", "Подключаемый_КнопкаПлиткаДомойКСОНажатие");
		ДанныеКнопки.Вставить("Имя", "ПлиткаДомойВерх");
		ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
		ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.ПереходДомойРМК);
		ДобавитьКнопкуНавигацииВГруппуУправления(Форма, ГруппаУправленияВерх, ДанныеКнопки, ПараметрыНастроек);
		
	КонецЕсли;
	
	ДанныеКнопки.Вставить("ИмяДействия", "");
	ДанныеКнопки.Вставить("Имя", "ПлиткаДомой");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.ПереходДомойРМК);
	КнопкаПлиткаДомой
		= ДобавитьКнопкуНавигацииВГруппуУправления(Форма, ГруппаКнопокНавигации, ДанныеКнопки, ПараметрыНастроек);
	КнопкаПлиткаДомой.Видимость = Не Форма.ВертикальнаяОриентация;
	
	ДобавитьКнопкуВесовогоОтбораКСО(Форма, ГруппаКнопокНавигации, ПараметрыНастроек);
	
	ДанныеКнопки.Вставить("Имя", "ВвестиШтрихкодВПлитке");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Право);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКСозданиеШтрихкода);
	ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Ввести штрихкод'"));
	ДанныеКнопки.Вставить("ВысотаЗаголовка", 2);
	ДобавитьКнопкуВГруппуУправления(Форма, ГруппаУправленияВерх, ДанныеКнопки, ПараметрыНастроек);
	
	ДанныеКнопки.Вставить("Имя", "ПомощьСотрудникаВПлитке");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Право);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКДобавитьПерсонал);
	ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Помощь сотрудника'"));
	ДанныеКнопки.Вставить("ВысотаЗаголовка", 2);
	ДобавитьКнопкуВГруппуУправления(Форма, ГруппаУправленияВерх, ДанныеКнопки, ПараметрыНастроек);
	
	ДанныеКнопки.Вставить("Имя", "НоваяПокупкаВПлитке");
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКНоваяПродажа24);
	ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Новая покупка'"));
	ДобавитьКнопкуВГруппуУправления(Форма, ГруппаУправленияВерх, ДанныеКнопки, ПараметрыНастроек);
	
	ПодключитьЧасыНаПанельОперацийКСО(Форма, ГруппаУправленияВерх, ПараметрыНастроек.ЗначениеПоложенияЧасов, Истина);
	
	ДанныеКнопки.Вставить("Имя", "ЗакрытьПлитку");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Право);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.Cancel);
	КнопкаЗакрыть
		= ДобавитьКнопкуНавигацииВГруппуУправления(Форма, ГруппаУправленияВерх, ДанныеКнопки, ПараметрыНастроек);
	КнопкаЗакрыть.Видимость = Ложь;
	
КонецПроцедуры

Процедура СформироватьПанельТекущегоТовараСпискаКСО(Форма, ПараметрыНастроек)
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЭлементыФормы = Форма.Элементы;
	ГруппаУправлениеТоваромКСО = ЭлементыФормы.ГруппаУправлениеТоваромКСО;
	ГруппаУправлениеТоваромКСО.Высота = ПараметрыНастроек.ВысотаГруппы;
	
	ДанныеПоля = ШаблонДанныхПоляПанелиКСО();
	ДанныеПоля.Имя = "ЦенаИзКарточки";
	ДанныеПоля.ПутьКДанным = "ТекущийТоварЦенаИзКарточки";
	ДанныеПоля.Формат = "ЧДЦ=2; ЧН=0.00; ЧФ='Ч ₽'";
	ДобавитьПолеВГруппуУправления(Форма, ГруппаУправлениеТоваромКСО, ДанныеПоля, ПараметрыНастроек);
	
	ДанныеПоля.Имя = "Количество";
	ДанныеПоля.Редактирование = Истина;
	ДанныеПоля.ПутьКДанным = "ТекущийТоварКоличество";
	ДанныеПоля.Формат = "";
	ДобавитьПолеВГруппуУправления(Форма, ГруппаУправлениеТоваромКСО, ДанныеПоля, ПараметрыНастроек);
	
	ДанныеКнопки = ШаблонДанныхКнопкиПанелиОперацийКСО();
	ДанныеКнопки.Вставить("Имя", "ТоварУменьшитьКоличество");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.Minus);
	КнопкаУменьшить = ДобавитьКнопкуНавигацииВГруппуУправления(Форма,
		ГруппаУправлениеТоваромКСО, ДанныеКнопки, ПараметрыНастроек);
	КнопкаУменьшить.Доступность = Ложь;
	
	ДанныеКнопки.Вставить("Имя", "ТоварУвеличитьКоличество");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.Plus);
	КнопкаУвеличить = ДобавитьКнопкуНавигацииВГруппуУправления(Форма,
		ГруппаУправлениеТоваромКСО, ДанныеКнопки, ПараметрыНастроек);
	КнопкаУвеличить.Доступность = Ложь;
	
	КнопкаДробноеКоличество = ЭлементыФормы.ТекущийТоварУстановитьДробноеКоличество;
	Если КнопкаДробноеКоличество.Видимость Тогда
		ДанныеКнопки = ШаблонДанныхКнопкиПанелиОперацийКСО();
		ДанныеКнопки.Вставить("Имя", "ТоварУстановитьДробноеКоличество");
		ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
		ДанныеКнопки.Вставить("Заголовок", КнопкаДробноеКоличество.Заголовок);
		КнопкаДробноеКоличествоКСО
			= ДобавитьТекстовуюКнопкуВГруппуУправления(Форма, ГруппаУправлениеТоваромКСО, ДанныеКнопки, ПараметрыНастроек);
		КнопкаДробноеКоличествоКСО.Ширина = ПараметрыНастроек.ВысотаГруппы * 1.7
			+ ?(ПараметрыНастроек.ВысотаГруппы < 5, 1, 0);
		КнопкаДробноеКоличествоКСО.Доступность = Ложь;
	КонецЕсли;
	
	ДанныеКнопки.Вставить("Имя", "ПолучитьВес");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКГиря);
	КнопкаВес = ДобавитьКнопкуНавигацииВГруппуУправления(Форма,
		ГруппаУправлениеТоваромКСО, ДанныеКнопки, ПараметрыНастроек);
	КнопкаВес.Доступность = Ложь;
	КнопкаВес.Видимость = ЭлементыФормы.ПолучитьВес.Видимость;
	
	ДанныеКнопки.Вставить("Имя", "УдалитьТовар");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Право);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.УдалитьТовар);
	КнопкаУдаления = ДобавитьКнопкуНавигацииВГруппуУправления(Форма,
		ГруппаУправлениеТоваромКСО, ДанныеКнопки, ПараметрыНастроек);
	ИконкаУдалитьТовар = ЭлементыФормы.ИконкаКнопкиУдалитьТоварКСО;
	ИмяСвойстваЦвета = ?(ЭтоИнтерфейс85, "ЦветКартинки", "ЦветТекста");
	ИконкаУдалитьТовар[ИмяСвойстваЦвета] = ЦветаПалитры.Красный;
	КнопкаУдаления.Доступность = Ложь;
	
КонецПроцедуры

Процедура СформироватьПанельТекущегоТовараПлиточногоИнтерфейсаКСО(Форма, ПараметрыНастроек)
	
	Если Форма.ЗакрыватьПодборПриВыбореТовара Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЭлементыФормы = Форма.Элементы;
	ГруппаУправлениеТоваромВПлитке = ЭлементыФормы.ПлиткаИнфоТекущейСтроки;
	ГруппаУправлениеТоваромВПлитке.Высота = ПараметрыНастроек.ВысотаГруппыВПлитке;
	
	ДанныеКнопки = ШаблонДанныхКнопкиПанелиОперацийКСО();
	ДанныеКнопки.Вставить("Имя", "ТоварУменьшитьКоличествоВПлитке");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.Minus);
	КнопкаУменьшить = ДобавитьКнопкуНавигацииВГруппуУправления(Форма,
		ГруппаУправлениеТоваромВПлитке, ДанныеКнопки, ПараметрыНастроек, Истина);
	КнопкаУменьшить.Доступность = Ложь;
	
	ДанныеКнопки.Вставить("Имя", "ТоварУвеличитьКоличествоВПлитке");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.Plus);
	КнопкаУвеличить = ДобавитьКнопкуНавигацииВГруппуУправления(Форма,
		ГруппаУправлениеТоваромВПлитке, ДанныеКнопки, ПараметрыНастроек, Истина);
	КнопкаУвеличить.Доступность = Ложь;
	
	КнопкаДробноеКоличество = ЭлементыФормы.ТекущийТоварУстановитьДробноеКоличество;
	Если КнопкаДробноеКоличество.Видимость Тогда
		ДанныеКнопки.Вставить("Имя", "ТоварУстановитьДробноеКоличествоВПлитке");
		ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
		ДанныеКнопки.Вставить("Заголовок", КнопкаДробноеКоличество.Заголовок);
		КнопкаДробноеКоличествоКСО = ДобавитьТекстовуюКнопкуВГруппуУправления(Форма,
			ГруппаУправлениеТоваромВПлитке, ДанныеКнопки, ПараметрыНастроек, Истина);
		КнопкаДробноеКоличествоКСО.Ширина = ПараметрыНастроек.ВысотаГруппыВПлитке * 1.7;
		КнопкаДробноеКоличествоКСО.Доступность = Ложь;
	КонецЕсли;
	
	ДанныеКнопки.Вставить("Имя", "ПолучитьВесВПлитке");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Лево);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКГиря);
	КнопкаВес = ДобавитьКнопкуНавигацииВГруппуУправления(Форма,
		ГруппаУправлениеТоваромВПлитке, ДанныеКнопки, ПараметрыНастроек, Истина);
	КнопкаВес.Доступность = Ложь;
	КнопкаВес.Видимость = ЭлементыФормы.ПолучитьВес.Видимость;
	
	ДанныеКнопки.Вставить("Имя", "УдалитьТоварВПлитке");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Право);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.УдалитьТовар);
	КнопкаУдаления = ДобавитьКнопкуНавигацииВГруппуУправления(Форма,
		ГруппаУправлениеТоваромВПлитке, ДанныеКнопки, ПараметрыНастроек, Истина);
	ИконкаУдалитьТовар = ЭлементыФормы.ИконкаКнопкиУдалитьТоварВПлиткеКСО;
	ИмяСвойстваЦвета = ?(ЭтоИнтерфейс85, "ЦветКартинки", "ЦветТекста");
	ИконкаУдалитьТовар[ИмяСвойстваЦвета] = ЦветаПалитры.Красный;
	КнопкаУдаления.Доступность = Ложь;
	
КонецПроцедуры

Процедура СформироватьКнопкуЛояльностиКСО(Форма, НастройкиЭлементов)
	
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	НастройкиВводаПокупателей = НастройкиЭлементов.Получить(ЗаголовкиОбластей.ВвестиДанныеПокупателя);
	КнопкаЛояльности = ДобавитьКнопкуЛояльностиКСО(Форма, НастройкиВводаПокупателей);
	
КонецПроцедуры

Функция ДобавитьКнопкуЛояльностиКСО(Форма, НастройкиВводаПокупателей, ВысотаЗаголовка = 2)
	
	ГруппаКарточка = Неопределено;
	Если Форма.ВводДисконтныхКарт Тогда
	
		ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
		ЭлементыФормы = Форма.Элементы;
		СвойствоШирина = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок;
		СвойствоВысота = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
		СвойствоЦветКнопок = Перечисления.СвойстваЭлементовРМК.ЦветКнопок;
		СвойствоРазмер = Перечисления.СвойстваЭлементовРМК.РазмерКнопок;
		
		ПараметрыНастроек = Новый Структура();
		ПараметрыНастроек.Вставить("БазоваяШирина", 20);
		ПараметрыНастроек.Вставить("ЗначениеЦвета", ?(ЭтоИнтерфейс85, Неопределено, WebЦвета.Бежевый));
		ЗначениеШирины = 0;
		ЗначениеВысоты = 0;
		ЗначениеРазмера = 0;
		
		Если Не НастройкиВводаПокупателей = Неопределено Тогда
			Если ЗначениеЗаполнено(НастройкиВводаПокупателей.Получить(СвойствоШирина)) Тогда
				ЗначениеШирины = НастройкиВводаПокупателей.Получить(СвойствоШирина);
			КонецЕсли;
			Если ЗначениеЗаполнено(НастройкиВводаПокупателей.Получить(СвойствоВысота)) Тогда
				ЗначениеВысоты = НастройкиВводаПокупателей.Получить(СвойствоВысота);
			КонецЕсли;
			Если ЗначениеЗаполнено(НастройкиВводаПокупателей.Получить(СвойствоРазмер)) Тогда
				ЗначениеРазмера = НастройкиВводаПокупателей.Получить(СвойствоРазмер);
			КонецЕсли;
			ДобавитьПараметрНастройки(ПараметрыНастроек, "ЗначениеЦвета",
				НастройкиВводаПокупателей.Получить(СвойствоЦветКнопок));
		КонецЕсли;
		
		ШиринаТакси = ?(ЗначениеЗаполнено(ЗначениеШирины), ЗначениеШирины, ПараметрыНастроек.БазоваяШирина);
		ШиринаКарточки = ?(ЭтоИнтерфейс85, ПараметрыНастроек.БазоваяШирина + 2 * ЗначениеРазмера, ШиринаТакси);
		ВысотаТакси = ?(ЗначениеЗаполнено(ЗначениеВысоты), ЗначениеВысоты, 5);
		ВысотаГруппы = ?(ЭтоИнтерфейс85, 5 + ЗначениеРазмера, ВысотаТакси);

		ПараметрыНастроек.Вставить("ВысотаГруппы", ВысотаГруппы);
		ПараметрыНастроек.Вставить("ШиринаКарточки", ШиринаКарточки);
		
		ГруппаВвестиДанныеПокупателяКСО = ЭлементыФормы.ГруппаЛояльностиКСО;
		ГруппаВвестиДанныеПокупателяКСО.Высота = ПараметрыНастроек.ВысотаГруппы;
		ДанныеКнопки = ШаблонДанныхКнопкиПанелиОперацийКСО();
		ДанныеКнопки.Вставить("Имя", "ВвестиДанныеПокупателя");
		ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Центр);
		ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.ВвестиДанныеПокупателя);
		ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Карта лояльности'"));
		ДанныеКнопки.Вставить("ВысотаЗаголовка", ВысотаЗаголовка);
		ДобавитьКнопкуВГруппуУправления(Форма, ГруппаВвестиДанныеПокупателяКСО, ДанныеКнопки, ПараметрыНастроек);
		
		ИмяЭлемента = СтрШаблон("ИконкаКнопки%1КСО", ДанныеКнопки.Имя);
		КартинкаКарточки = ЭлементыФормы.Найти(ИмяЭлемента);
		КартинкаКарточки.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		
		ИмяЭлемента = СтрШаблон("ЗаголовокКнопки%1КСО", ДанныеКнопки.Имя);
		ЗаголовокКарточки = ЭлементыФормы.Найти(ИмяЭлемента);
		ЗаголовокКарточки.МаксимальнаяШирина = 0;
		
		ИмяЭлемента = СтрШаблон("Кнопка%1КСО", ДанныеКнопки.Имя);
		ГруппаКарточка = ЭлементыФормы.Найти(ИмяЭлемента);
		ГруппаКарточка.РастягиватьПоГоризонтали = Истина;
		
	КонецЕсли;
	Возврат ГруппаКарточка;
	
КонецФункции

Процедура НастроитьНижнююПанельКСО(Форма, ПараметрыНастроек)
	
	ЭлементыФормы = Форма.Элементы;
	ГруппаНачатьСканирование = ЭлементыФормы.НачатьСканированиеКСО;
	ГруппаНачатьСканирование.Высота = ПараметрыНастроек.ВысотаГруппы;
	
	ДанныеКнопки = ШаблонДанныхКнопкиПанелиОперацийКСО();
	ДанныеКнопки.Вставить("Имя", "СканерШтрихкода");
	ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Центр);
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКЗеленаяСтрелкаВниз48);
	ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Сканер штрихкода'"));
	ДанныеКнопки.Вставить("ВысотаЗаголовка", 2);
	ДобавитьКнопкуВГруппуУправления(Форма, ГруппаНачатьСканирование, ДанныеКнопки, ПараметрыНастроек);
	
КонецПроцедуры

Процедура НастроитьПанельЗавершенияОплатыКСО(Форма, ПараметрыНастроек)
	
	ЭлементыФормы = Форма.Элементы;
	ГруппаОкончаниеЧекаКоманднаяПанель = ЭлементыФормы.ГруппаОкончаниеЧекаКоманднаяПанель;
	ГруппаОкончаниеЧекаКоманднаяПанель.Высота = ПараметрыНастроек.ВысотаГруппы;
	
	ДанныеКнопки = ШаблонДанныхКнопкиПанелиОперацийКСО();
	ДанныеКнопки.Вставить("Имя", "НачатьПокупку");
	ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКПакет);
	ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Начать покупку'"));
	ДобавитьКнопкуВГруппуУправления(Форма, ГруппаОкончаниеЧекаКоманднаяПанель, ДанныеКнопки, ПараметрыНастроек);
	
КонецПроцедуры

Процедура ПривестиКЕдинойШиринеКнопкиВидовОплат(Форма)
	
	Элементы = Форма.Элементы;
	ЕдинаяШирина = 22;
	
	КнопкиВидовОплат = Новый Массив;
	КнопкиВидовОплат.Добавить(Элементы.ОплатаНаличными);
	КнопкиВидовОплат.Добавить(Элементы.ОплатаКартой);
	КнопкиВидовОплат.Добавить(Элементы.ПодготовитьДанныеВыдачиНаличных);
	КнопкиВидовОплат.Добавить(Элементы.ОткрытьДенежныйЯщикПриВыдачеНаличных);
	КнопкиВидовОплат.Добавить(Элементы.ОплатаСБП);
	КнопкиВидовОплат.Добавить(Элементы.ОплатаЮКасса);
	КнопкиВидовОплат.Добавить(Элементы.ОплатаСертификатомНСПК);
	КнопкиВидовОплат.Добавить(Элементы.ЗаменаТоваров);
	КнопкиВидовОплат.Добавить(Элементы.Предоплата);
	КнопкиВидовОплат.Добавить(Элементы.ОплатаВРассрочку);
	КнопкиВидовОплат.Добавить(Элементы.ЗачетАванса);
	КнопкиВидовОплат.Добавить(Элементы.Безнал);
	КнопкиВидовОплат.Добавить(Элементы.ОплатаКредитом);
	КнопкиВидовОплат.Добавить(Элементы.ДобавитьСертификат);
	КнопкиВидовОплат.Добавить(Элементы.ДоплатитьСертификатом);
	КнопкиВидовОплат.Добавить(Элементы.ОплатаБонусами);
	
	Для Каждого КнопкаЭлемент Из КнопкиВидовОплат Цикл
		КнопкаЭлемент.Ширина = ЕдинаяШирина;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьКнопкуСкидкаПенсионераКСО(Форма, НастройкиЭлементов)
	
	КнопкаСкидкаПенсионераКСО = ДобавитьКнопкуСкидкаПенсионераКСО(Форма);
	Если Форма.ОсновнойПодборПлиточный Тогда
		Форма.Элементы.Переместить(Форма.Элементы.ГруппаСкидкаПенсионераКСО,
			Форма.Элементы.ПлиткаГруппаНиз, Форма.Элементы.ПлиткаГруппаОплатить);
		Форма.Элементы.ГруппаСкидкаПенсионераКСО.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		Форма.Элементы.Переместить(Форма.Элементы.ПлиткаГруппаОплатить,
			Форма.Элементы.ГруппаСкидкаПенсионераКСО);
	Иначе
		Если Форма.ВертикальнаяОриентация Тогда
			Форма.Элементы.СтраницаУправленияЛояльностьюКСО.Группировка = 
				ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		Иначе
			Форма.Элементы.Переместить(Форма.Элементы.ГруппаСкидкаПенсионераКСО,
				Форма.Элементы.ГруппаУправленияЛояльностьюКСО, Форма.Элементы.ГруппаДанныеСкидки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ДобавитьКнопкуСкидкаПенсионераКСО(Форма, Настройки = Неопределено, ВысотаЗаголовка = 2)
	
	ГруппаКарточка = Неопределено;
	Если Форма.ВводДисконтныхКарт Тогда
	
		ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
		ЭлементыФормы = Форма.Элементы;
		СвойствоШирина = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок;
		СвойствоВысота = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок;
		СвойствоЦветКнопок = Перечисления.СвойстваЭлементовРМК.ЦветКнопок;
		СвойствоРазмер = Перечисления.СвойстваЭлементовРМК.РазмерКнопок;
		
		ПараметрыНастроек = Новый Структура();
		ПараметрыНастроек.Вставить("БазоваяШирина", 20);
		ПараметрыНастроек.Вставить("ЗначениеЦвета", ?(ЭтоИнтерфейс85, Неопределено, WebЦвета.Бежевый));
		ЗначениеШирины = 0;
		ЗначениеВысоты = 0;
		ЗначениеРазмера = 0;
		
		Если Не Настройки = Неопределено Тогда
			Если ЗначениеЗаполнено(Настройки.Получить(СвойствоШирина)) Тогда
				ЗначениеШирины = Настройки.Получить(СвойствоШирина);
			КонецЕсли;
			Если ЗначениеЗаполнено(Настройки.Получить(СвойствоВысота)) Тогда
				ЗначениеВысоты = Настройки.Получить(СвойствоВысота);
			КонецЕсли;
			Если ЗначениеЗаполнено(Настройки.Получить(СвойствоРазмер)) Тогда
				ЗначениеРазмера = Настройки.Получить(СвойствоРазмер);
			КонецЕсли;
			ДобавитьПараметрНастройки(ПараметрыНастроек, "ЗначениеЦвета",
				Настройки.Получить(СвойствоЦветКнопок));
		КонецЕсли;
		
		ШиринаТакси = ?(ЗначениеЗаполнено(ЗначениеШирины), ЗначениеШирины, ПараметрыНастроек.БазоваяШирина);
		ШиринаКарточки = ?(ЭтоИнтерфейс85, ПараметрыНастроек.БазоваяШирина + 2 * ЗначениеРазмера, ШиринаТакси);
		ВысотаТакси = ?(ЗначениеЗаполнено(ЗначениеВысоты), ЗначениеВысоты, 5);
		ВысотаГруппы = ?(ЭтоИнтерфейс85, 5 + ЗначениеРазмера, ВысотаТакси);

		ПараметрыНастроек.Вставить("ВысотаГруппы", ВысотаГруппы);
		ПараметрыНастроек.Вставить("ШиринаКарточки", ШиринаКарточки);
		
		ГруппаСкидкаПенсионераКСО = ЭлементыФормы.ГруппаСкидкаПенсионераКСО;
		ГруппаСкидкаПенсионераКСО.Высота = ПараметрыНастроек.ВысотаГруппы;
		ДанныеКнопки = ШаблонДанныхКнопкиПанелиОперацийКСО();
		ДанныеКнопки.Вставить("Имя", "СкидкаПенсионера");
		ДанныеКнопки.Вставить("Положение", ГоризонтальноеПоложениеЭлемента.Центр);
		ДанныеКнопки.Вставить("Картинка", БиблиотекаКартинок.РМКПенсионер);
		ДанныеКнопки.Вставить("Заголовок", НСтр("ru = 'Скидка пенсионерам'"));
		ДанныеКнопки.Вставить("ВысотаЗаголовка", ВысотаЗаголовка);
		ДобавитьКнопкуВГруппуУправления(Форма, ГруппаСкидкаПенсионераКСО, ДанныеКнопки, ПараметрыНастроек);
		
		ИмяЭлемента = СтрШаблон("ИконкаКнопки%1КСО", ДанныеКнопки.Имя);
		КартинкаКарточки = ЭлементыФормы.Найти(ИмяЭлемента);
		КартинкаКарточки.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		
		ИмяЭлемента = СтрШаблон("ЗаголовокКнопки%1КСО", ДанныеКнопки.Имя);
		ЗаголовокКарточки = ЭлементыФормы.Найти(ИмяЭлемента);
		ЗаголовокКарточки.МаксимальнаяШирина = 0;
		
		ИмяЭлемента = СтрШаблон("Кнопка%1КСО", ДанныеКнопки.Имя);
		ГруппаКарточка = ЭлементыФормы.Найти(ИмяЭлемента);
		ГруппаКарточка.РастягиватьПоГоризонтали = Истина;
		
	КонецЕсли;
	Возврат ГруппаКарточка;
	
КонецФункции

Процедура ДобавитьКнопкуОплаты(Форма, ГруппаКонтейнер, ДанныеКнопки, СуффиксИмени)
	
	ЭлементыФормы = Форма.Элементы;
	ИмяДействия = СтрШаблон("Подключаемый_Кнопка%1%2Нажатие", ДанныеКнопки.Имя, СуффиксИмени);
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	БазоваяВысота = 5;
	
	ИмяЭлемента = СтрШаблон("Кнопка%1%2", ДанныеКнопки.Имя, СуффиксИмени);
	КнопкаКарточка = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаКонтейнер);
	КнопкаКарточка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	КнопкаКарточка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	КнопкаКарточка.Отображение = ОтображениеОбычнойГруппы.Нет;
	КнопкаКарточка.ОтображатьЗаголовок = Ложь;
	КнопкаКарточка.ОтображатьКакКарточку = Истина;
	КнопкаКарточка.Гиперссылка = Истина;
	КнопкаКарточка.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	КнопкаКарточка.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	КнопкаКарточка.РастягиватьПоГоризонтали = Истина;
	КнопкаКарточка.РастягиватьПоВертикали = Ложь;
	КнопкаКарточка.Высота = ДанныеКнопки.Высота;
	КнопкаКарточка.ЦветФона = ДанныеКнопки.ЦветФона;
	КнопкаКарточка.УстановитьДействие("Нажатие", ИмяДействия);
	Если ЗначениеЗаполнено(ДанныеКнопки.Ширина) Тогда
		КнопкаКарточка.Ширина = ДанныеКнопки.Ширина;
	КонецЕсли;

	МасштабШрифтаКартинки = ПолучитьМасштабШрифтаКартинкиОплаты(ДанныеКнопки.Высота);
	МасштабШрифтаЗаголовка = Цел(?(ЭтоИнтерфейс85, 100, 110) * ДанныеКнопки.Высота / БазоваяВысота);
	
	ИмяЭлемента = СтрШаблон("ИконкаКнопки%1%2", ДанныеКнопки.Имя, СуффиксИмени);
	ИконкаКнопки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), КнопкаКарточка);
	ИконкаКнопки.Вид = ВидДекорацииФормы.Картинка;
	ИконкаКнопки.Картинка = ДанныеКнопки.Картинка;
	ИконкаКнопки.Шрифт = Новый Шрифт(ШрифтыСтиля.ЗаголовокПервогоУровня, , , , , , , МасштабШрифтаКартинки);
	ИконкаКнопки.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
	ИконкаКнопки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ИконкаКнопки.РастягиватьПоВертикали = Ложь;
	
	ИмяЭлемента = СтрШаблон("ЗаголовокКнопки%1%2", ДанныеКнопки.Имя, СуффиксИмени);
	ЗаголовокКнопки = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), КнопкаКарточка);
	ЗаголовокКнопки.Вид = ВидДекорацииФормы.Надпись;
	ЗаголовокКнопки.Шрифт = Новый Шрифт(ШрифтыСтиля.ЗаголовокВторогоУровня, , , , , , , МасштабШрифтаЗаголовка);
	ЗаголовокКнопки.МаксимальнаяШирина = 0;
	ЗаголовокКнопки.АвтомаксимальнаяШирина = Ложь;
	ЗаголовокКнопки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ЗаголовокКнопки.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
	ЗаголовокКнопки.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ЗаголовокКнопки.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	ЗаголовокКнопки.РастягиватьПоГоризонтали = Истина;
	ЗаголовокКнопки.Заголовок = ДанныеКнопки.Заголовок;
	
КонецПроцедуры

Процедура ДобавитьУникальнуюКнопкуОплатыНаФорме(Форма, УникальныйВидОплаты, ПараметрыПостроения)
	
	ИменаВидовОплат = ИнтерфейсРМКСлужебныйКлиентСервер.ИменаУникальныхВидовОплат();
	
	ПоказатьQR = ПараметрыПостроения.ОтображатьQRОплаты;
	МинимальнаяВысота = ?(ПоказатьQR, 6, 5);
	ВысотаКнопки = МинимальнаяВысота;
	Если ПараметрыПостроения.ВысотаКнопокОплат > 9 Тогда
		ВысотаКнопки = 9;
	ИначеЕсли ПараметрыПостроения.ВысотаКнопокОплат > МинимальнаяВысота Тогда
		ВысотаКнопки = ПараметрыПостроения.ВысотаКнопокОплат;
	КонецЕсли;
	
	Отказ = Ложь;
	ДанныеКнопки = ШаблонДанныхКнопкиОплатыКСО();
	ДанныеКнопки.Имя = СтрШаблон("Оплатить%1", УникальныйВидОплаты);
	ДанныеКнопки.Высота = ВысотаКнопки;
	ДанныеКнопки.Ширина = ПараметрыПостроения.ШиринаКнопокОплат;
	Если УникальныйВидОплаты = ИменаВидовОплат.Карта Тогда
		ДанныеКнопки.Картинка = ?(ПоказатьQR, БиблиотекаКартинок.РМКQRОплатаКартой, БиблиотекаКартинок.РМКВидОплатыКарта);
		ДанныеКнопки.Заголовок = НСтр("ru='Карта'");
		ДанныеКнопки.ЦветФона = ИнтерфейсРМКСлужебный.ЦветУправляющейКнопки(Истина);
	ИначеЕсли УникальныйВидОплаты = ИменаВидовОплат.Наличные Тогда
		ДанныеКнопки.Картинка
			= ?(ПоказатьQR, БиблиотекаКартинок.РМКQRОплатаНаличными, БиблиотекаКартинок.РМКВидОплатыНаличные);
		ДанныеКнопки.Заголовок = НСтр("ru='Наличные'");
		ДанныеКнопки.ЦветФона = ИнтерфейсРМКСлужебный.ЦветГиперссылки(Истина);
	ИначеЕсли УникальныйВидОплаты = ИменаВидовОплат.СБП Тогда
		ДанныеКнопки.Картинка = ?(ПоказатьQR, БиблиотекаКартинок.РМКQRОплатаСБП, БиблиотекаКартинок.РМКВидОплатыСБП);
		ДанныеКнопки.Заголовок = НСтр("ru='СБП'");
		ДанныеКнопки.ЦветФона = ИнтерфейсРМКСлужебный.ЦветВспомогательнойКнопки(Истина);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ Тогда
		ЭлементыФормы = Форма.Элементы;
		ГруппаОплатыСписок = ЭлементыФормы.ГруппаУникальнойКнопкиОплаты;
		ДобавитьКнопкуОплаты(Форма, ГруппаОплатыСписок, ДанныеКнопки, "Список");
		
		ГруппаОплатыПлитка = ЭлементыФормы.СтраницаУникальнойКнопкиОплатыПлитка;
		ДобавитьКнопкуОплаты(Форма, ГруппаОплатыПлитка, ДанныеКнопки, "Плитка");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьЭлементыКнопокУникальнойОплаты(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	ОчиститьЭлементыГруппы(ЭлементыФормы, ЭлементыФормы.ГруппаУникальнойКнопкиОплаты);
	ОчиститьЭлементыГруппы(ЭлементыФормы, ЭлементыФормы.СтраницаУникальнойКнопкиОплатыПлитка);
	
КонецПроцедуры

Процедура ОчиститьЭлементыГруппы(ЭлементыФормы, ГруппаНаФорме)
	
	КоличествоВложенныхЭлементов = ГруппаНаФорме.ПодчиненныеЭлементы.Количество();
	Если КоличествоВложенныхЭлементов > 0 Тогда
		Для ИндексЭлемента = 1 По КоличествоВложенныхЭлементов Цикл
			ТекущийИндекс = КоличествоВложенныхЭлементов - ИндексЭлемента;
			ВложенныйЭлемент = ГруппаНаФорме.ПодчиненныеЭлементы.Получить(ТекущийИндекс);
			ЭлементыФормы.Удалить(ВложенныйЭлемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
