#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗапись();
	Элементы.ГруппаДанныеВычета.Доступность = запись.Применяется;
	АдаптацияТакси();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрименяетсяПриИзменении(Элемент)
	
	Элементы.ГруппаДанныеВычета.Доступность = запись.Применяется;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьЗапись();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьЗапись();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
&НаСервере
Процедура ЗаполнитьЗапись()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НДФЛСоциальныеВычетыСрезПоследних.Период КАК Период,
	|	НДФЛСоциальныеВычетыСрезПоследних.Сотрудник КАК Сотрудник,
	|	НДФЛСоциальныеВычетыСрезПоследних.КодВычета КАК КодВычета,
	|	НДФЛСоциальныеВычетыСрезПоследних.Применяется КАК Применяется,
	|	НДФЛСоциальныеВычетыСрезПоследних.СуммаРасходов КАК СуммаРасходов,
	|	НДФЛСоциальныеВычетыСрезПоследних.КодИФНС КАК КодИФНС,
	|	НДФЛСоциальныеВычетыСрезПоследних.НомерУведомления КАК НомерУведомления,
	|	НДФЛСоциальныеВычетыСрезПоследних.ДатаУведомления КАК ДатаУведомления,
	|	НДФЛСоциальныеВычетыСрезПоследних.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.НДФЛСоциальныеВычеты.СрезПоследних КАК НДФЛСоциальныеВычетыСрезПоследних
	|ГДЕ
	|	НДФЛСоциальныеВычетыСрезПоследних.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник", Параметры.Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	Иначе
		Запись.Сотрудник = Параметры.Сотрудник;
	КонецЕсли;
	
КонецПроцедуры

// Процедура сохраняет запись в регистр сведений ДокументыФизическихЛиц
&НаСервере
Процедура СохранитьЗапись()
	
	МенеджерЗаписи = РегистрыСведений.НДФЛСоциальныеВычеты.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
	МенеджерЗаписи.Записать();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		Элементы.ГруппаСуммаВычета.Имя, "Ширина", 35);
	
КонецПроцедуры

#КонецОбласти
