#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок = Параметры.Заголовок;
	Элементы.ТекстСообщения.Заголовок = Параметры.ТекстСообщения;
	ВидимостьБольшеНеПоказывать = Параметры.ВидимостьБольшеНеПоказывать;
	Если ЗначениеЗаполнено(Параметры.ЗаголовокКнопкиЗакрыть) Тогда
		Элементы.Закрыть.Заголовок = Параметры.ЗаголовокКнопкиЗакрыть;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БольшеНеПоказывать", "Видимость",
		ВидимостьБольшеНеПоказывать);

	МобильныйКлиентУНФ.НастроитьВспомогательнуюФормуМобильныйКлиент(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗакрыть(Команда)

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("БольшеНеПоказывать", БольшеНеПоказывать);
	СтруктураВозврата.Вставить("КодВозврата", КодВозвратаДиалога.ОК);
	Закрыть(СтруктураВозврата);

КонецПроцедуры

#КонецОбласти