
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазделениеВключено = РаботаВМоделиСервиса.РазделениеВключено();
	
	ЭтоИнтерфейсТакси = НЕ ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	ВосстановитьНастройкиФормыИОтборов();
	
	ПоказателиБизнесаФормы.ИнициализироватьСлужебныеРеквизитыФормы(ЭтотОбъект);
	
	АктивныйПериод = ТекущаяДатаСеанса();
	Если ТипЗнч(Параметры.Отбор) = Тип("Структура") Тогда
		Для каждого КлючИЗначение Из Параметры.Отбор Цикл
			Если КлючИЗначение.Ключ = "НачалоПериода" Тогда
				Отчет.ПериодОтчета = Новый СтандартныйПериод(НачалоГода(КлючИЗначение.Значение), КонецГода(КлючИЗначение.Значение));
				Отчет.Периодичность = Перечисления.Периодичность.Месяц;
				АктивныйПериод = КлючИЗначение.Значение;
			ИначеЕсли КлючИЗначение.Ключ = "КонецПериода" Тогда
				Если Год(КлючИЗначение.Значение) = Год(ТекущаяДатаСеанса()) Тогда
					Отчет.ПериодОтчета.ДатаОкончания = КонецМесяца(КлючИЗначение.Значение);
				Иначе
					Отчет.ПериодОтчета.ДатаОкончания = КонецГода(КлючИЗначение.Значение);
				КонецЕсли; 
			ИначеЕсли КлючИЗначение.Ключ = "Организация" Тогда 
				ОтборОрганизация = КлючИЗначение.Значение;
			ИначеЕсли КлючИЗначение.Ключ = "СценарийПланирования" Тогда 
				Отчет.СценарийПланирования = КлючИЗначение.Значение;
			ИначеЕсли КлючИЗначение.Ключ = "ПланФакт" Тогда 
				Отчет.ПланФакт = КлючИЗначение.Значение;
			ИначеЕсли КлючИЗначение.Ключ = "Группировка" Тогда 
				Отчет.Группировка = КлючИЗначение.Значение;
			ИначеЕсли КлючИЗначение.Ключ = "АктивныйОтчет" Тогда 
				АктивнаяГиперссылка = КлючИЗначение.Значение;
			ИначеЕсли КлючИЗначение.Ключ = "Периодичность" Тогда 
				Отчет.Периодичность = КлючИЗначение.Значение;
			КонецЕсли; 
		КонецЦикла;
		ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(Отчет.ПериодОтчета);
	КонецЕсли;
	
	Если Отчет.Периодичность = Перечисления.Периодичность.Месяц Тогда
		АктивныйПериод = НачалоМесяца(АктивныйПериод);
	ИначеЕсли Отчет.Периодичность = Перечисления.Периодичность.Квартал Тогда
		АктивныйПериод = НачалоКвартала(АктивныйПериод);
	ИначеЕсли Отчет.Периодичность = Перечисления.Периодичность.Полугодие Тогда
		МесяцПериода = Месяц(АктивныйПериод);
		АктивныйПериод = НачалоГода(АктивныйПериод);
		Если МесяцПериода >= 6 Тогда
			АктивныйПериод = ДобавитьМесяц(АктивныйПериод, 6);
		КонецЕсли;
	ИначеЕсли Отчет.Периодичность = Перечисления.Периодичность.Год Тогда
		АктивныйПериод = НачалоГода(АктивныйПериод);
	КонецЕсли;
	
	ПредставлениеАктивногоПериода = ПоказателиБизнесаФормы.ЗаголовокКолонки(АктивныйПериод, Отчет.Периодичность);
	
	// Тесная интеграция с подсистемами БСП.
	НастройкиОтчета = ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию();
	НастройкиОтчета.Вставить("Внешний", Ложь);
	НастройкиОтчета.Вставить("ПолноеИмя", РеквизитФормыВЗначение("Отчет").Метаданные().ПолноеИмя());
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РассылкаОтчетов") Тогда
		Если НЕ НастройкиОтчета.Свойство("ВариантСсылка") Тогда
			Если ТипЗнч(Параметры.Ключ) = Тип("СправочникСсылка.ВариантыОтчетов") Тогда
				НастройкиОтчета.Вставить("ВариантСсылка", Параметры.Ключ);
			Иначе
				НастройкиОтчета.Вставить("ВариантСсылка", Справочники.ВариантыОтчетов.ПустаяСсылка());
			КонецЕсли; 
		КонецЕсли; 
		МодульРассылкаОтчетов = ОбщегоНазначения.ОбщийМодуль("РассылкаОтчетов");
		МодульРассылкаОтчетов.ФормаОтчетаДобавитьКоманды(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	
	ОбновитьОтчеты();
	ОбновитьКарточки();
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		НастроитьЭлементыФормыМобильныйКлиент();
	КонецЕсли;
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(АктивнаяГиперссылка) Тогда
		Если АктивнаяГиперссылка = "ДекорацияДоходыРасходы" Тогда
			ТекущаяСтраница = Элементы.ГруппаДеревоДоходыРасходы;
		ИначеЕсли АктивнаяГиперссылка = "ДекорацияДенежныйПоток" Тогда
			ТекущаяСтраница = Элементы.ГруппаДеревоДенежныйПоток;
		ИначеЕсли АктивнаяГиперссылка = "ДекорацияБаланс" Тогда
			ТекущаяСтраница = Элементы.ГруппаДеревоБаланс;
		Иначе
			ТекущаяСтраница = Элементы.ГруппаАссистент;
		КонецЕсли;
	Иначе
		ТекущаяСтраница = Элементы.ГруппаДеревоДоходыРасходы;
	КонецЕсли;
	
	Элементы.ГруппаВариантыОтчетов.ТекущаяСтраница = ТекущаяСтраница;
	ПриСменеСтраницыОтчета(ТекущаяСтраница);
	ОбновитьОтображениеЭлементовНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		СохранитьНастройкиФормыИОтборов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьПоказателяФинансовыхОтчетов"  Тогда
		
		ОбновитьОтчеты();
		
	КонецЕсли;
	
	Если ИмяСобытия = "ЗакрытиеФормыБюджета" Тогда
		
		Если Отчет.ПланФакт <> ПредопределенноеЗначение("Перечисление.ПланФакт.Факт") Тогда
			
			Если  ЗначениеЗаполнено(Параметр.НачалоПериода)
				И ЗначениеЗаполнено(Параметр.КонецПериода) 
				И ЗначениеЗаполнено(Параметр.СценарийПланирования)
				И ЗначениеЗаполнено(Параметр.Периодичность) Тогда
				
				Отчет.ПериодОтчета.ДатаНачала = Параметр.НачалоПериода;
				Отчет.ПериодОтчета.ДатаОкончания = Параметр.КонецПериода;
				Отчет.СценарийПланирования = Параметр.СценарийПланирования;
				Отчет.Периодичность = Параметр.Периодичность;
				
				ВыровнятьПериодПоПериодичности();
				
				ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(Отчет.ПериодОтчета);
				
				ОбновитьОтчеты();
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ЗаписьКарточкиАнализаБизнеса" Тогда
		
		Если НЕ ЭтоИнтерфейсТакси Тогда
			ОбновитьКарточки();
			Возврат;
		КонецЕсли;
		
		Если НЕ Параметр.Свойство("ВидКарточки") ИЛИ НЕ Параметр.Свойство("Ссылка") 
			ИЛИ НЕ ЗначениеЗаполнено(Параметр.ВидКарточки) ИЛИ Параметр.Ссылка.Пустая() Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ИмяТаблицы = ?(Параметр.ВидКарточки = ПредопределенноеЗначение("Перечисление.ВидыКарточекАнализаБизнеса.Цель"), "СписокЦелей", "СписокПроверок");
		СтрокиКарточки = ЭтотОбъект[ИмяТаблицы].НайтиСтроки(Новый Структура("Ссылка", Параметр.Ссылка));
		
		Если СтрокиКарточки.Количество() = 0 Тогда // Добавили новую
			
			ДобавитьКарточкуНаФорму(Параметр.ВидКарточки, Параметр.Ссылка);
			
		Иначе // Обновляем отображение
			
			СтрокаКарточки = СтрокиКарточки[0];
			ДанныеКарточки = ПолучитьДанныеКарточкиНаСервере(Параметр.Ссылка);
			Если ДанныеКарточки <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаКарточки, ДанныеКарточки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаВариантыОтчетовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ПриСменеСтраницыОтчета(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = Отчет.ПериодОтчета;
	
	Диалог.Показать(Новый ОписаниеОповещения("ПредставлениеПериодаНажатиеЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры

#Область ПраваяПанель

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ВыровнятьПериодПоПериодичности();
	ОбновитьОтчеты();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПланированияПриИзменении(Элемент)
	
	Отчет.Периодичность = ПолучитьПериодичностьСценария(Отчет.СценарийПланирования);
	ОбновитьОтчеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланФактПриИзменении(Элемент)
	
	Если Отчет.ПланФакт =  ПредопределенноеЗначение("Перечисление.ПланФакт.Факт") Тогда
		Отчет.СценарийПланирования = ПредопределенноеЗначение("Справочник.СценарииПланирования.Фактический");
		Отчет.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
	Иначе
		Если Отчет.СценарийПланирования = ПредопределенноеЗначение("Справочник.СценарииПланирования.Фактический") Тогда
			Отчет.СценарийПланирования = ПредопределенноеЗначение("Справочник.СценарииПланирования.ПустаяСсылка");
			Отчет.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Если Отчет.ПланФакт <> ПредопределенноеЗначение("Перечисление.ПланФакт.Факт") Тогда
		
		Если НЕ БюджетированиеИспользуется() Тогда
			ТекстВопроса = НСтр("ru = 'Анализировать план можно только после включения настройки ""Бюджетирование"". Использовать бюджетирование?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ДиалогВключенияБюджетированияПродолжение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
		Иначе
			Если БюджетыНеСозданы() Тогда
				ОткрытьДиалогСозданияБюджета();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьОтображениеЭлементовНаКлиенте();
	ОбновитьОтчеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПриИзменении(Элемент)
	ОбновитьОтчеты();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПустыеСтрокиПриИзменении(Элемент)
	ОбновитьОтчеты();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьОтклонениеПриИзменении(Элемент)
	ОбновитьОтчеты();
КонецПроцедуры

&НаКлиенте
Процедура АктивныйПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПредставлениеАктивногоПериода = ПолучитьПредставлениеПериода(ВыбранноеЗначение, Отчет.Периодичность);
	АктивныйПериод = ВыбранноеЗначение;
	
	ОбновитьОтчеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = Отчет.ПериодОтчета;
	
	Диалог.Показать(Новый ОписаниеОповещения("ПредставлениеПериодаНажатиеЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтбор("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПроектОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтбор("Проект", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтбор("Подразделение", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_")+1);
	
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияКарточекАнализаБизнеса

&НаКлиенте
Процедура Подключаемый_КарточкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидКарточки = Неопределено;
	Значение = ПредопределенноеЗначение("Справочник.КарточкиАнализаБизнеса.ПустаяСсылка");
	
	Если Элемент.Имя = "ДобавитьКарточкуЦели" ИЛИ Элемент.Имя = "ДобавитьКарточкуЦелиЗаголовок" Тогда
		ВидКарточки = ПредопределенноеЗначение("Перечисление.ВидыКарточекАнализаБизнеса.Цель");
	ИначеЕсли Элемент.Имя = "ДобавитьПроверку" ИЛИ Элемент.Имя = "ДобавитьПроверкуЗаголовок" Тогда
		ВидКарточки = ПредопределенноеЗначение("Перечисление.ВидыКарточекАнализаБизнеса.КонтрольПоказателей");
	Иначе
		
		ПараметрыЭлемента = СформироватьПараметрыЭлементаПоИмени(Элемент.Имя);
		
		// Параметры не получены
		Если НЕ ЗначениеЗаполнено(ПараметрыЭлемента.ИмяТаблицы) ИЛИ ПараметрыЭлемента.ИндексСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаЭлемента = ЭтотОбъект[ПараметрыЭлемента.ИмяТаблицы].Получить(ПараметрыЭлемента.ИндексСтроки);
		
		// Строка не найдена
		Если СтрокаЭлемента = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Значение = СтрокаЭлемента.Ссылка;
		
	КонецЕсли;
	
	ОткрытьФормуЭлементаПоЗначению(Значение, ВидКарточки);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьКарточкуНажатие(Элемент)
	
	ПараметрыЭлемента = СформироватьПараметрыЭлементаПоИмени(Элемент.Имя);
	
	// Параметры не получены
	Если НЕ ЗначениеЗаполнено(ПараметрыЭлемента.ИмяТаблицы) ИЛИ ПараметрыЭлемента.ИндексСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКУдалению = ЭтотОбъект[ПараметрыЭлемента.ИмяТаблицы];
	СсылкаДляПометкиНаУдаление = ТаблицаКУдалению[ПараметрыЭлемента.ИндексСтроки].Ссылка;
	ТаблицаКУдалению.Удалить(ПараметрыЭлемента.ИндексСтроки);
	
	ИмяУдаляемогоЭлемента = ПараметрыЭлемента.ИмяТаблицы + "_" + ПараметрыЭлемента.ИндексСтроки;
	
	МассивЭлементовДляУдаления = Новый Массив;
	МассивЭлементовДляУдаления.Добавить(ИмяУдаляемогоЭлемента);
	Если ЭтоИнтерфейсТакси Тогда
		МассивЭлементовДляУдаления.Добавить(ИмяУдаляемогоЭлемента + "_Удалить");
	КонецЕсли;
	
	УдалитьЭлементыНаСервере(ПараметрыЭлемента.ИмяТаблицы, МассивЭлементовДляУдаления, СсылкаДляПометкиНаУдаление);
	
	ОбновитьКарточки();
	
	Если ЭтоИнтерфейсТакси Тогда
		ВключитьРежимРедактированияКарточек(ПредопределенноеЗначение("Перечисление.ВидыКарточекАнализаБизнеса.Цель"));
		ВключитьРежимРедактированияКарточек(ПредопределенноеЗначение("Перечисление.ВидыКарточекАнализаБизнеса.КонтрольПоказателей"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДенежныйПотокТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	ОбработатьРасшифровкуЯчейки(Расшифровка, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДоходыРасходыТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	ОбработатьРасшифровкуЯчейки(Расшифровка, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура БалансТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	ОбработатьРасшифровкуЯчейки(Расшифровка, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьОтчеты();
	ОбновитьКарточки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРежимРедактирования(Команда)
	
	Элементы.ВключитьРежимРедактирования.Пометка = НЕ Элементы.ВключитьРежимРедактирования.Пометка;
	РежимРедактирования = НЕ РежимРедактирования;
	
	ВключитьРежимРедактированияКарточек(ПредопределенноеЗначение("Перечисление.ВидыКарточекАнализаБизнеса.Цель"));
	ВключитьРежимРедактированияКарточек(ПредопределенноеЗначение("Перечисление.ВидыКарточекАнализаБизнеса.КонтрольПоказателей"));
	
	ОбновитьSVGНаСервере();
	
	Элементы.ДекорацияПодсказкаНастройки.Видимость = РежимРедактирования;
	Элементы.Обновить.Видимость = НЕ РежимРедактирования;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчета(Команда)
	
	СохранитьНастройкиФормыИОтборов();
	
	ПечатнаяФорма = Новый ТабличныйДокумент;
	СформироватьПечатнуюФормуНаСервере(ПечатнаяФорма);
	ПечатнаяФорма.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	
	СохранитьНастройкиФормыИОтборов();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	СформироватьПечатнуюФормуНаСервере(ТабличныйДокумент);
	ПоказатьДиалогОтправкиПоПочте(ТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтчет(Команда)
	
	СохранитьНастройкиФормыИОтборов();
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("СохранениеОтчетаЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботы1СПредприятия(ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Команда(Команда)
	// Механизмы расширения
	ПостояннаяКоманда = ПостоянныеКоманды.НайтиПоЗначению(Команда.Имя);
	Если ПостояннаяКоманда <> Неопределено И ЗначениеЗаполнено(ПостояннаяКоманда.Представление) Тогда
		МассивПодстрок = СтрРазделить(ПостояннаяКоманда.Представление, ".");
		КлиентскийМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль(МассивПодстрок[0]);
		Обработчик = Новый ОписаниеОповещения(МассивПодстрок[1], КлиентскийМодуль, Команда);
		ВыполнитьОбработкуОповещения(Обработчик, ЭтотОбъект);
	Иначе
		ОтчетыКлиентПереопределяемый.ОбработчикКоманды(ЭтотОбъект, Команда, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКЗакрытиюМесяца(Команда)
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Месяц", Отчет.ПериодОтчета.ДатаНачала);
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма", СтруктураОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда,
	НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПредставлениеПериодаТакси.Видимость = Истина;
	Элементы.ПредставлениеПериода.Видимость = Ложь;
	Элементы.ИндексФильтры.Видимость = Ложь;
	Элементы.ИндексФильтрыТакси.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницыОтчета(ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаАссистент Тогда
		ВыбранныйОтчет = Неопределено;
		АктивнаяГиперссылка = "ДекорацияАссистент";
		Элементы.ГруппаПраваяПанель.Видимость = Ложь;
		Возврат;
	Иначе
		Элементы.ГруппаПраваяПанель.Видимость = Истина;
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.ГруппаДеревоДоходыРасходы Тогда
		ВыбранныйОтчет = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы");
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаДеревоДенежныйПоток Тогда
		ВыбранныйОтчет = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДенежныйПоток");
	Иначе // Баланс
		ВыбранныйОтчет =  ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.Баланс");
	КонецЕсли;
	
	Если ВыбранныйОтчет = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДенежныйПоток")
		ИЛИ ВыбранныйОтчет = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда
		
		Элементы.ГруппаОтборПроект.Видимость = Истина;
		Элементы.ГруппаОтборПодразделение.Видимость = Истина;
		Элементы.Группировка.Видимость = Истина;
		
	Иначе // Баланс
		
		Элементы.ГруппаОтборПроект.Видимость = Ложь;
		Элементы.ГруппаОтборПодразделение.Видимость = Ложь;
		Элементы.Группировка.Видимость = Ложь;
		
	КонецЕсли;
	
		Если ТекущаяСтраница = Элементы.ГруппаДеревоДоходыРасходы Тогда
			АктивнаяГиперссылка = "ДекорацияДоходыРасходы";
		ИначеЕсли ТекущаяСтраница = Элементы.ГруппаДеревоДенежныйПоток Тогда
			АктивнаяГиперссылка = "ДекорацияДенежныйПоток";
		ИначеЕсли ТекущаяСтраница = Элементы.ГруппаДеревоБаланс Тогда
			АктивнаяГиперссылка = "ДекорацияБаланс";
		Иначе
			АктивнаяГиперссылка = "ДекорацияАссистент";
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатиеЗавершение(НовыйПериод, Параметры) Экспорт
	
	Если НовыйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НовыйПериод.ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(НовыйПериод.ДатаОкончания) Тогда
		ТекстСообщения = НСтр("ru = 'Невозможно выбрать неограниченный период.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, Элементы.ПредставлениеПериодаТакси, "ПредставлениеПериода");
	Иначе
		
		Отчет.ПериодОтчета = НовыйПериод;
		
		ВыровнятьПериодПоПериодичности();
		
		ОбновитьОтчеты();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМеткуИОтбор(ИмяПоляОтбора, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбора, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения);
	
	ОбновитьОтчеты();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Неопределено, МеткаИД,,, Ложь);
	
	ОбновитьОтчеты();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКарточкуНаФорму(ВидКарточки, Ссылка)
	
	ИмяТаблицы = ?(ВидКарточки = Перечисления.ВидыКарточекАнализаБизнеса.Цель, "СписокЦелей", "СписокПроверок");
	ЭлементДобавить = ?(ВидКарточки = Перечисления.ВидыКарточекАнализаБизнеса.Цель, Элементы.ДобавитьКарточкуЦели,  Элементы.ДобавитьПроверку);
	ДанныеКарточки = ПолучитьДанныеКарточкиНаСервере(Ссылка);
	
	ПараметрыЭлемента = Справочники.КарточкиАнализаБизнеса.СформироватьПараметрыЭлементаКарточки(ВидКарточки);
	ПараметрыЭлемента.РодительЭлемента = НайтиИлиДобавитьГруппуКарточек(ВидКарточки);
	
	НомерСтроки = ЭтотОбъект[ИмяТаблицы].Количество();
	СтрокаКарточки = ЭтотОбъект[ИмяТаблицы].Добавить();
	
	ЗаполнитьЗначенияСвойств(СтрокаКарточки, ДанныеКарточки);
	СтрокаКарточки.SVG = СформироватьSVGПоСтроке(СтрокаКарточки.СтрокаSVG);
	
	ПараметрыЭлемента.ИмяЭлемента = ИмяТаблицы + "_" + НомерСтроки;
	ПараметрыЭлемента.ПутьКДанным = СтрШаблон(ПараметрыЭлемента.ШаблонПутьКДанным, ИмяТаблицы, НомерСтроки);
	
	СформироватьЭлементКарточки(ПараметрыЭлемента);
	СформироватьЭлементУдалитьКарточку(ПараметрыЭлемента);
	Элементы[ПараметрыЭлемента.ИмяЭлемента + "_Удалить"].Видимость = Истина;
	
	РодительЭлементаДобавить = НайтиИлиДобавитьГруппуКарточек(ВидКарточки);
	Элементы.Переместить(ЭлементДобавить, РодительЭлементаДобавить);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеКарточкиНаСервере(Ссылка)
	
	ДанныеКарточки = Справочники.КарточкиАнализаБизнеса.ПолучитьДанныеКарточки(Ссылка);
	Если ДанныеКарточки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	МодифицироватьТекстSVGПоРежимуРедактирования(ДанныеКарточки.СтрокаSVG, РежимРедактирования);
	
	ДанныеКарточки.Вставить("SVG", СформироватьSVGПоСтроке(ДанныеКарточки.СтрокаSVG));
	Возврат ДанныеКарточки;
	
КонецФункции

&НаСервере
Процедура ВосстановитьНастройкиФормыИОтборов()
	
	НастройкиФормы = Отчеты.АнализБизнеса.ИнициализироватьНастройкиФормы();
	Отчеты.АнализБизнеса.ВосстановитьНастройкиФормы(НастройкиФормы);
	
	АктивнаяГиперссылка = НастройкиФормы.АктивнаяГиперссылка;
	
	Отчеты.АнализБизнеса.ВосстановитьНастройкиОтборов(Отчет, ДанныеМеток);
	
	РаботаСОтборами.ОбновитьЭлементыМеток(ЭтотОбъект);
	ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(Отчет.ПериодОтчета);
	
	ИспользоватьПроекты = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	ИспользоватьПодразделения = ПолучитьФункциональнуюОпцию("УчетПоНесколькимПодразделениям");
	
	Если ИспользоватьПроекты Тогда
		Элементы.Группировка.СписокВыбора.Добавить(Перечисления.ГруппировкаАнализаБизнеса.Проекты);
	КонецЕсли;
	
	Если ИспользоватьПодразделения Тогда
		Элементы.Группировка.СписокВыбора.Добавить(Перечисления.ГруппировкаАнализаБизнеса.Подразделения);
	КонецЕсли;
	
	Если НЕ ИспользоватьПроекты И НЕ ИспользоватьПодразделения Тогда
		Отчет.Группировка = Перечисления.ГруппировкаАнализаБизнеса.Показатели;
		Элементы.ГруппаВариант.Видимость = Ложь;
	КонецЕсли;
	
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормыИОтборов()
	
	НастройкиФормы = Отчеты.АнализБизнеса.ИнициализироватьНастройкиФормы();
	НастройкиФормы.АктивнаяГиперссылка 		   = АктивнаяГиперссылка;
	
	Отчеты.АнализБизнеса.СохранитьНастройкиФормы(НастройкиФормы);
	Отчеты.АнализБизнеса.СохранитьНастройкиОтборов(Отчет, ДанныеМеток);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементовНаКлиенте()
	
	АнализироватьФакт = (Отчет.ПланФакт = ПредопределенноеЗначение("Перечисление.ПланФакт.Факт"));
	Элементы.СценарийПланирования.Доступность = НЕ АнализироватьФакт;
	Элементы.Периодичность.Доступность = АнализироватьФакт;
	Элементы.АктивныйПериод.Видимость = Отчет.ПланФакт = ПредопределенноеЗначение("Перечисление.ПланФакт.ПланФакт");
	Элементы.АктивныйПериод.Доступность = ЗначениеЗаполнено(Отчет.СценарийПланирования);
	Элементы.ВыводитьОтклонение.Видимость = Отчет.ПланФакт = ПредопределенноеЗначение("Перечисление.ПланФакт.ПланФакт");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеЭлементов()
	
	АнализироватьФакт = (Отчет.ПланФакт = ПредопределенноеЗначение("Перечисление.ПланФакт.Факт"));
	Элементы.СценарийПланирования.Доступность = НЕ АнализироватьФакт;
	Элементы.Периодичность.Доступность = АнализироватьФакт;
	Элементы.АктивныйПериод.Видимость = Отчет.ПланФакт = ПредопределенноеЗначение("Перечисление.ПланФакт.ПланФакт");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтчеты()
	
	ПоказателиБизнесаФормы.ЗаполнитьСписокПериодов(ПериодыПланирования, Отчет.ПериодОтчета, Отчет.Периодичность);
	ЗаполнитьСписокАктивныхПериодов(ПериодыПланирования, Отчет.Периодичность); 
	
	Если ЗначениеЗаполнено(Отчет.СценарийПланирования) Тогда
		ДанныеОтчета = ИнициализироватьДанныеОтчета();
		ДанныеОтчета.ВидОтчетаОтбор = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы;
		Отчеты.АнализБизнеса.СформироватьОтчет(ДоходыРасходыТабличныйДокумент, ДанныеОтчета);
		
		ДанныеОтчета = ИнициализироватьДанныеОтчета();
		ДанныеОтчета.ВидОтчетаОтбор = Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток;
		Отчеты.АнализБизнеса.СформироватьОтчет(ДенежныйПотокТабличныйДокумент, ДанныеОтчета);
		
		ДанныеОтчета = ИнициализироватьДанныеОтчета();
		ДанныеОтчета.ВидОтчетаОтбор = Перечисления.ВидыФинансовыхОтчетов.Баланс;
		Отчеты.АнализБизнеса.СформироватьОтчет(БалансТабличныйДокумент, ДанныеОтчета);
	Иначе
		ТекущийЭлемент = Элементы.СценарийПланирования;
	КонецЕсли;
	
	Если Отчет.ПланФакт = Перечисления.ПланФакт.План Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(ЭтотОбъект, "ЗакрытьМесяц");
	Иначе
		РезультатПроверки = ЗакрытиеМесяца.НеактуальныеДанныеСебестоимостиВПериоде(Отчет.ПериодОтчета.ДатаНачала, Отчет.ПериодОтчета.ДатаОкончания, Новый Массив);
		СформироватьВажноеСообщение(РезультатПроверки <> Неопределено);
	КонецЕсли;
	
	Элементы.АктивныйПериод.Доступность = ЗначениеЗаполнено(Отчет.СценарийПланирования);
	
КонецПроцедуры

&НаСервере
Функция ИнициализироватьДанныеОтчета()
	
	ДанныеОтчета = Новый Структура;
	ДанныеОтчета.Вставить("ВидОтчетаОтбор", Перечисления.ВидыФинансовыхОтчетов.ПустаяСсылка());
	ДанныеОтчета.Вставить("ПериодОтчета", Дата('00010101'));
	ДанныеОтчета.Вставить("ПланФакт", Перечисления.ПланФакт.ПустаяСсылка());
	ДанныеОтчета.Вставить("Периодичность", Перечисления.Периодичность.ПустаяСсылка());
	ДанныеОтчета.Вставить("СценарийПланирования", Справочники.СценарииПланирования.ПустаяСсылка());
	
	ДанныеОтчета.Вставить("ДанныеМеток", ДанныеМеток.Выгрузить());
	
	ДанныеОтчета.Вставить("ВидОтчетаОтбор", Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы);
		
	ДанныеОтчета.Вставить("СценарийПланирования", Отчет.СценарийПланирования);
	ДанныеОтчета.Вставить("ПериодОтчета", Отчет.ПериодОтчета);
	ДанныеОтчета.Вставить("ПланФакт", Отчет.ПланФакт);
	ДанныеОтчета.Вставить("Периодичность", Отчет.Периодичность);
	
	ДанныеОтчета.Вставить("ГруппировкаАнализаБизнеса", Отчет.Группировка);
	
	ДанныеОтчета.Вставить("АктивныйПериод", АктивныйПериод);
	
	ДанныеОтчета.Вставить("ПериодыПланирования", Новый Массив);
	ПоказателиБизнесаФормы.ЗаполнитьСписокПериодов(ДанныеОтчета.ПериодыПланирования, ДанныеОтчета.ПериодОтчета, ДанныеОтчета.Периодичность);
	
	ВидыОтчетов = Новый СписокЗначений;
	ВидыОтчетов.Добавить(Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы, "ДоходыРасходы");
	ВидыОтчетов.Добавить(Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток, "ДенежныйПоток");
	ВидыОтчетов.Добавить(Перечисления.ВидыФинансовыхОтчетов.Баланс, 		"Баланс");
	
	ДанныеОтчета.Вставить("ВидыОтчетов", ВидыОтчетов);
	
	ДанныеОтчета.Вставить("ИдентификаторыПоказателей", Новый Соответствие);
	ДанныеОтчета.Вставить("ИдентификаторыПоказателейДляФормул", Новый Соответствие);
	ДанныеОтчета.Вставить("ВременноеСоответствиеЗависимыхЭлементов", Новый Соответствие);
	ДанныеОтчета.Вставить("СоответствиеЗависимыхЭлементов", Новый Соответствие);
	
	ДанныеОтчета.Вставить("ЭтоВыводНаПечать", Ложь);
	ДанныеОтчета.Вставить("ПоказыватьПустыеСтроки", Отчет.ПоказыватьПустыеСтроки);
	ДанныеОтчета.Вставить("ВыводитьОтклонение", Отчет.ВыводитьОтклонение);
	
	ИнициализироватьДеревьяОтчета(ДанныеОтчета);
	
	Возврат ДанныеОтчета;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьДеревьяОтчета(ДанныеОтчета)
	
	МассивИменДеревьев = ПоказателиБизнесаФормы.ИменаДеревьевФормы();
	
	Для каждого ИмяДерева Из МассивИменДеревьев Цикл
		
		Дерево = Новый ДеревоЗначений;
		
		Дерево.Колонки.Добавить("Показатель");
		Дерево.Колонки.Добавить("Порядок");
		Дерево.Колонки.Добавить("Представление");
		Дерево.Колонки.Добавить("ЭтоВерхнийУровеньИерархии");
		Дерево.Колонки.Добавить("ТипПоказателя");
		Дерево.Колонки.Добавить("НомерКартинкиСтроки");
		Дерево.Колонки.Добавить("ИдентификаторПоказателя");
		Дерево.Колонки.Добавить("ОписаниеПоказателя");
		Дерево.Колонки.Добавить("СтрокаФормулы");
		Дерево.Колонки.Добавить("ЭтоПроцент");
		Дерево.Колонки.Добавить("НеИспользоватьВИтогах");
		Дерево.Колонки.Добавить("Аналитика");
		
		Если ДанныеОтчета.ПланФакт = Перечисления.ПланФакт.ПланФакт Тогда
			Дерево.Колонки.Добавить("ИтогоПлан", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
			Дерево.Колонки.Добавить("ИтогоФакт", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
		Иначе
			Дерево.Колонки.Добавить("Итого", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
		КонецЕсли;
		
		Для каждого Период Из ДанныеОтчета.ПериодыПланирования Цикл
			ИмяКолонки = СформироватьИмяКолонкиПоПериоду(Период);
			Дерево.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
			Если ДанныеОтчета.ПланФакт = Перечисления.ПланФакт.ПланФакт И ЭтоАктивныйПериод(Период, ДанныеОтчета.АктивныйПериод, ДанныеОтчета.Периодичность) Тогда
				ИмяКолонки = ИмяКолонки + "План";
				Дерево.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
			КонецЕсли;
		КонецЦикла;
		
		ДанныеОтчета.Вставить(ИмяДерева, Дерево);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьИмяКолонкиПоПериоду(Знач Период)
	
	Возврат Формат(Период,"ДФ=_ггггММдд");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокАктивныхПериодов(ПериодыПланирования, Периодичность)
	
	Элементы.АктивныйПериод.СписокВыбора.Очистить();
	
	Для каждого Период Из ПериодыПланирования Цикл
		Если Период.Значение > НачалоМесяца(ТекущаяДатаСеанса()) Тогда
			Прервать;
		КонецЕсли;
		ПериодПредставление = ПоказателиБизнесаФормы.ЗаголовокКолонки(Период.Значение, Периодичность);
		Элементы.АктивныйПериод.СписокВыбора.Добавить(Период.Значение, ПериодПредставление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПериодичностьСценария(СценарийПланирования)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СценарийПланирования, "Периодичность");
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоАктивныйПериод(Период, АктивныйПериод, Периодичность)
	
	Если Периодичность = Перечисления.Периодичность.Месяц Тогда
		ПериодСУчетомПериодичности = НачалоМесяца(АктивныйПериод);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		ПериодСУчетомПериодичности = НачалоКвартала(АктивныйПериод);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
		
		МесяцПериода = Месяц(АктивныйПериод);
		ПериодСУчетомПериодичности = НачалоГода(АктивныйПериод);
		Если МесяцПериода > 6 Тогда
			ПериодСУчетомПериодичности = ДобавитьМесяц(ПериодСУчетомПериодичности, 6);
		КонецЕсли;
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		ПериодСУчетомПериодичности = НачалоГода(АктивныйПериод);
	Иначе // Другая периодичность не поддерживаются
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Период = ПериодСУчетомПериодичности;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеПериода(ВыбранныйПериод, Периодичность)
	Возврат ПоказателиБизнесаФормы.ЗаголовокКолонки(ВыбранныйПериод, Периодичность);
КонецФункции

&НаСервере
Процедура ОбновитьКарточки()
	
	// Очистка формы
	Пока Элементы.ГруппаКарточкиЦели.ПодчиненныеЭлементы.Количество() <> 0 Цикл
		Элементы.Удалить(Элементы.ГруппаКарточкиЦели.ПодчиненныеЭлементы.Получить(0));
	КонецЦикла;
	
	Пока Элементы.ГруппаКарточкиПроверки.ПодчиненныеЭлементы.Количество() <> 0 Цикл
		Элементы.Удалить(Элементы.ГруппаКарточкиПроверки.ПодчиненныеЭлементы.Получить(0));
	КонецЦикла;
	
	ИзменитьРеквизиты(, СписокДиаграмм.ВыгрузитьЗначения());
	
	СписокПроверок.Очистить();
	СписокЦелей.Очистить();
	СписокДиаграмм.Очистить();
	
	СформироватьКарточкиАнализаБизнеса(Перечисления.ВидыКарточекАнализаБизнеса.Цель);
	СформироватьКарточкиАнализаБизнеса(Перечисления.ВидыКарточекАнализаБизнеса.КонтрольПоказателей);
	
	Если ЭтоИнтерфейсТакси Тогда
		
		Элементы.ДобавитьКарточкуЦели.Видимость = РежимРедактирования;
		Элементы.ДобавитьПроверку.Видимость = РежимРедактирования;
		
		Для каждого СтрокаКарточки Из СписокЦелей Цикл
			НомерСтроки = СписокЦелей.Индекс(СтрокаКарточки);
			ИмяЭлементаУдаления = "СписокЦелей" + "_" + НомерСтроки +"_Удалить";
			Элементы[ИмяЭлементаУдаления].Видимость = РежимРедактирования;
		КонецЦикла;
		
		Для каждого СтрокаКарточки Из СписокПроверок Цикл
			НомерСтроки = СписокПроверок.Индекс(СтрокаКарточки);
			ИмяЭлементаУдаления = "СписокПроверок" + "_" + НомерСтроки +"_Удалить";
			Элементы[ИмяЭлементаУдаления].Видимость = РежимРедактирования;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция БюджетыНеСозданы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бюджет.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Бюджет КАК Бюджет
		|ГДЕ
		|	Бюджет.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();

КонецФункции

&НаКлиенте
Процедура ДиалогСозданияБюджетаПродолжение(Выбор, ДополнительныеПараметры) Экспорт
	
	Если Выбор = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("Документ.Бюджет.Форма.ФормаДокумента", , ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогВключенияБюджетированияПродолжение(Выбор, ДополнительныеПараметры) Экспорт
	
	Если Выбор = КодВозвратаДиалога.Да Тогда
		ВключитьОпциюБюджетирование();
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 1, Истина);
		ОткрытьДиалогСозданияБюджета();
		Элементы.ВыводитьОтклонение.Видимость = Отчет.ПланФакт = ПредопределенноеЗначение("Перечисление.ПланФакт.ПланФакт");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция БюджетированиеИспользуется()
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьБюджетирование");
КонецФункции

&НаСервереБезКонтекста
Процедура ВключитьОпциюБюджетирование()
	Константы.ФункциональнаяОпцияИспользоватьБюджетирование.Установить(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСозданияБюджета()
	
	ТекстВопроса = НСтр("ru = 'Не найдено ни одного бюджета. Создать новый?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ДиалогСозданияБюджетаПродолжение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыровнятьПериодПоПериодичности()
	
	ДатаНачала = Отчет.ПериодОтчета.ДатаНачала;
	ДатаОкончания = Отчет.ПериодОтчета.ДатаОкончания;
		
	Если Отчет.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		ДатаНачала 	  = НачалоМесяца(ДатаНачала);
		ДатаОкончания = КонецМесяца(ДатаОкончания);
		
	ИначеЕсли Отчет.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		ДатаНачала 	  = НачалоКвартала(ДатаНачала);
		ДатаОкончания = КонецКвартала(ДатаОкончания);
		
	ИначеЕсли Отчет.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		
		МесяцДатыНачала = Месяц(ДатаНачала);
		
		ДатаНачала = НачалоГода(ДатаНачала);
		
		Если МесяцДатыНачала > 6 Тогда
			
			ДатаНачала = ДобавитьМесяц(ДатаНачала, 6);
			
		КонецЕсли;
		
		МесяцДатыОкончания = Месяц(ДатаОкончания);
		
		ДатаОкончания = КонецГода(ДатаОкончания);
		
		Если МесяцДатыОкончания < 6 Тогда
			
			ДатаОкончания = ДобавитьМесяц(ДатаОкончания, -6);
			
		КонецЕсли;
		
	Иначе // Год
		
		ДатаНачала 	  = НачалоГода(ДатаНачала);
		ДатаОкончания = КонецГода(ДатаОкончания);
		
	КонецЕсли;
	
	Если Отчет.ПериодОтчета.ДатаНачала <> ДатаНачала ИЛИ Отчет.ПериодОтчета.ДатаОкончания <> ДатаОкончания Тогда
		
		Отчет.ПериодОтчета.ДатаНачала = ДатаНачала;
		Отчет.ПериодОтчета.ДатаОкончания = ДатаОкончания;
		
		ТекстСообщения = НСтр("ru = 'Период был изменен по периодичности'");
		ПоказатьОповещениеПользователя(ТекстСообщения,,, БиблиотекаКартинок.ПлатежныйКалендарьИзменитьДату);
		
	КонецЕсли;
	
	ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(Отчет.ПериодОтчета);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыМобильныйКлиент()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтраницаОтбор", "Ширина", 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтраницы", "Ширина", 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтраницаОтбор", "РастягиватьПоГоризонтали", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтраницы", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПраваяПанель", "ОтображатьЗаголовок", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СвернутьПравуюПанель", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВключитьРежимРедактирования", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПраваяПанель", "ОтображатьКакКарточку", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРасшифровкуЯчейки(Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыЯчейки = Новый Структура;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Показатель",     Расшифровка.Показатель);
		ПараметрыОткрытия.Вставить("Аналитика",      Расшифровка.Аналитика);
		ПараметрыОткрытия.Вставить("ЭтоИтоги",       Расшифровка.ЭтоИтоги);
		ПараметрыОткрытия.Вставить("Периодичность",  Отчет.Периодичность);
		ПараметрыОткрытия.Вставить("Группировка",    Отчет.Группировка);
		ПараметрыОткрытия.Вставить("ВыбранныйОтчет", ВыбранныйОтчет);
		ПараметрыОткрытия.Вставить("ДанныеМеток",    ДанныеМеток);
		
		ЗаполнитьПериодРасшифровкиПоТекущийКолонке(Расшифровка, ПараметрыОткрытия);
		ЗаполнитьСценарийПланированияПоТекущийКолонке(Расшифровка, ПараметрыОткрытия);
		
		ПараметрыЯчейки.Вставить("ПараметрыОткрытия", ПараметрыОткрытия);
		ОткрытьФорму("Отчет.АнализБизнеса.Форма.ФормаРасшифровкиЗначения", ПараметрыЯчейки, ЭтотОбъект, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПериодРасшифровкиПоТекущийКолонке(Расшифровка, СтруктураПараметров)
	
	Если Расшифровка.ЭтоИтоги Тогда // Колонка итогов
		СтруктураПараметров.Вставить("НачалоПериода", Отчет.ПериодОтчета.ДатаНачала);
		СтруктураПараметров.Вставить("КонецПериода", Отчет.ПериодОтчета.ДатаОкончания);
		Возврат;
	КонецЕсли;
	
	НачалоПериода = Расшифровка.Период;
	
	Если Отчет.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли Отчет.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		КонецПериода = КонецКвартала(НачалоПериода);
	ИначеЕсли Отчет.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		
		Если Месяц(НачалоПериода) = 1 Тогда
			КонецПериода = КонецМесяца(ДобавитьМесяц(НачалоПериода, 6));
		Иначе
			КонецПериода = КонецГода(НачалоПериода);
		КонецЕсли;
		
	ИначеЕсли Отчет.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		КонецПериода = КонецГода(НачалоПериода);
	Иначе
		КонецПериода = НачалоПериода;
	КонецЕсли; 
	
	СтруктураПараметров.Вставить("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Вставить("КонецПериода", КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСценарийПланированияПоТекущийКолонке(Расшифровка, СтруктураПараметров)
	
	СценарийПланирования = Отчет.СценарийПланирования;
	
	Если Отчет.ПланФакт = ПредопределенноеЗначение("Перечисление.ПланФакт.ПланФакт") Тогда
		
		Если СтруктураПараметров.НачалоПериода <= АктивныйПериод И Расшифровка.ЭтоПлан = Ложь Тогда
			СценарийПланирования = ПредопределенноеЗначение("Справочник.СценарииПланирования.Фактический");
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураПараметров.Вставить("СценарийПланирования", СценарийПланирования);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьВажноеСообщение(Формировать)
	
	ИдентификаторСообщения = "ЗакрытьМесяц";
	
	Если НЕ Формировать Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(ЭтотОбъект, ИдентификаторСообщения);
	Иначе
		
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		ПараметрыСообщения.Идентификатор = ИдентификаторСообщения;
		ПараметрыСообщения.ТипСообщения = "Информация";
		ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Требуется выполнить закрытие месяца'");
		ПараметрыСообщения.Сообщение = НСтр("ru = 'Некоторые показатели рассчитаны по месяцам, в которых расчёт фактической себестоимости не актуален'");
		ПараметрыСообщения.ПараметрыДействия = Новый Массив;
		ПараметрыСообщения.Родитель = Элементы.ГруппаДляВажногоСообщения.Имя;
		ПараметрыДействияСообщения = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
		ПараметрыДействияСообщения.ИмяКоманды = "ПерейтиКЗакрытиюМесяца";
		ПараметрыДействияСообщения.Обработчик = "Подключаемый_ПерейтиКЗакрытиюМесяца";
		ПараметрыДействияСообщения.Заголовок = НСтр("ru = 'Выполнить закрытие месяца'");
		
		ПараметрыСообщения.ПараметрыДействия.Добавить(ПараметрыДействияСообщения);
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
		ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#Область КарточкиАнализаБизнеса

&НаКлиенте
Процедура ПослеЗаписиКарточки(Параметр, ДополнительныйПараметр) Экспорт
	
	ОбновитьКарточки();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВыборкуЦелей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦелиБизнеса.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КарточкиАнализаБизнеса КАК ЦелиБизнеса
		|ГДЕ
		|	НЕ ЦелиБизнеса.ПометкаУдаления
		|	И ЦелиБизнеса.ВидКарточки = ЗНАЧЕНИЕ(Перечисление.ВидыКарточекАнализаБизнеса.Цель)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦелиБизнеса.Наименование";
	
	ВыборкаЦелей = Запрос.Выполнить().Выбрать();
	
	Возврат ВыборкаЦелей;
	
КонецФункции

&НаСервере
Функция ПолучитьВыборкуПроверок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КарточкиАнализаБизнеса.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КарточкиАнализаБизнеса КАК КарточкиАнализаБизнеса
		|ГДЕ
		|	НЕ КарточкиАнализаБизнеса.ПометкаУдаления
		|	И КарточкиАнализаБизнеса.ВидКарточки = ЗНАЧЕНИЕ(Перечисление.ВидыКарточекАнализаБизнеса.КонтрольПоказателей)";
	
	ВыборкаПроверок = Запрос.Выполнить().Выбрать();
	
	Возврат ВыборкаПроверок;
	
КонецФункции

&НаКлиенте
Процедура ВключитьРежимРедактированияКарточек(ВидКарточки)
	
	Если ВидКарточки = ПредопределенноеЗначение("Перечисление.ВидыКарточекАнализаБизнеса.Цель") Тогда
		ИмяТаблицы = "СписокЦелей"; // Не локализуется
		Элементы.ДобавитьКарточкуЦели.Видимость = РежимРедактирования;
	Иначе // Проверки
		ИмяТаблицы = "СписокПроверок"; // Не локализуется
		Элементы.ДобавитьПроверку.Видимость = РежимРедактирования;
	КонецЕсли;
	
	ТаблицаКарточек = ЭтотОбъект[ИмяТаблицы];
	
	Для каждого СтрокаКарточки Из ТаблицаКарточек Цикл
		
		НомерСтроки = ТаблицаКарточек.Индекс(СтрокаКарточки);
		ИмяЭлементаУдаления = ИмяТаблицы + "_" + НомерСтроки +"_Удалить";
		Элементы[ИмяЭлементаУдаления].Видимость = РежимРедактирования;
		
		МодифицироватьТекстSVGПоРежимуРедактирования(СтрокаКарточки.СтрокаSVG, РежимРедактирования);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура МодифицироватьТекстSVGПоРежимуРедактирования(Текст, РежимРедактирования)
	
	РедактированиеВключено  = "<g transform=""rotate(-3) translate(0 3)"">"; // Не локализуется
	РедактированиеВыключено = "<g transform=""rotate(0) translate(0 0)"">"; // Не локализуется
	
	Если РежимРедактирования Тогда
		Текст = СтрЗаменить(Текст, РедактированиеВыключено, РедактированиеВключено);
	Иначе
		Текст = СтрЗаменить(Текст, РедактированиеВключено, РедактированиеВыключено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьSVGНаСервере()
	
	// Обновим цвета кнопки режима редактирования на сервере
	Если РежимРедактирования Тогда
		Элементы.ВключитьРежимРедактирования.ЦветФона = ЦветаСтиля.НедоступныеДанныеЦвет;
	Иначе
		Элементы.ВключитьРежимРедактирования.ЦветФона = Новый Цвет;
	КонецЕсли;
	
	Для каждого СтрокаЦели Из СписокЦелей Цикл
		СтрокаЦели.SVG = СформироватьSVGПоСтроке(СтрокаЦели.СтрокаSVG);
	КонецЦикла;
	
	Для каждого СтрокаПроверки Из СписокПроверок Цикл
		СтрокаПроверки.SVG = СформироватьSVGПоСтроке(СтрокаПроверки.СтрокаSVG);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЭлементКарточки(ПараметрыЭлемента)
	
	Если ЭтоИнтерфейсТакси Тогда
		СформироватьЭлементКарточкиТакси(ПараметрыЭлемента);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЭлемента.ИмяЭлемента = "ДобавитьКарточкуЦели"
		ИЛИ ПараметрыЭлемента.ИмяЭлемента = "ДобавитьПроверку" Тогда
		СформироватьКарточкуДобавления(ПараметрыЭлемента);
	ИначеЕсли ПараметрыЭлемента.ДанныеКарточки.ВидКарточки = Перечисления.ВидыКарточекАнализаБизнеса.Цель Тогда
		СформироватьКарточкуЦели(ПараметрыЭлемента, ПараметрыЭлемента.ДанныеКарточки);
	ИначеЕсли ПараметрыЭлемента.ДанныеКарточки.ВидКарточки = Перечисления.ВидыКарточекАнализаБизнеса.КонтрольПоказателей Тогда
		СформироватьКарточкуКонтроляПоказателя(ПараметрыЭлемента, ПараметрыЭлемента.ДанныеКарточки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКарточкуКонтроляПоказателя(ПараметрыЭлемента, ДанныеКарточки)
	
	// Верхняя группа
	Группа = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента, Тип("ГруппаФормы"), ПараметрыЭлемента.РодительЭлемента);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.ОтображатьКакКарточку = Истина;
	Группа.Гиперссылка = Истина;
	Группа.РастягиватьПоВертикали = Ложь;
	Группа.РастягиватьПоГоризонтали = Ложь;
	Группа.Ширина = 25;
	Группа.Высота = 14;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Группа.РастягиватьПоГоризонтали = Истина;
		Группа.Ширина = 0;
	КонецЕсли;
	
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	Группа.УстановитьДействие("Нажатие", ПараметрыЭлемента.Действие);
	
	Если НЕ ДанныеКарточки.ОценкаХорошо Тогда
		Группа.ЦветФона = ЦветаПалитры.Желтый;
	КонецЕсли;
	
	ГруппаВертикально = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_Вертикально", Тип("ГруппаФормы"), Группа);
	ГруппаВертикально.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВертикально.ОтображатьЗаголовок = Ложь;
	ГруппаВертикально.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаВертикально.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаВертикально.РастягиватьПоВертикали = Истина;
	
	// Группа заголовки
	ГруппаЗаголовки = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_Заголовки", Тип("ГруппаФормы"), ГруппаВертикально);
	ГруппаЗаголовки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЗаголовки.ОтображатьЗаголовок = Ложь;
	ГруппаЗаголовки.РастягиватьПоВертикали = Ложь;
	ГруппаЗаголовки.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ГруппаЗаголовки.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаЗаголовки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ЭлементЗаголовок = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента+"_Заголовок", Тип("ДекорацияФормы"), ГруппаЗаголовки);
	ЭлементЗаголовок.Шрифт = ШрифтыСтиля.ЗаголовокВторогоУровня;
	ЭлементЗаголовок.Заголовок = ДанныеКарточки.ПерваяСтрокаЗаголовка;
	ЭлементЗаголовок.РастягиватьПоГоризонтали = Истина;
	
	Если ДанныеКарточки.ВариантПроверки = Перечисления.ВариантыПроверокАнализаБизнеса.Динамика Тогда
		
		// Диаграмма
		// Создание реквизитов формы
		МассивРеквизитов = Новый Массив;
		ИмяРеквизитаДиаграммы = ПараметрыЭлемента.ИмяЭлемента + "_Диаграмма";
		СписокДиаграмм.Добавить(ИмяРеквизитаДиаграммы);
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаДиаграммы, Новый ОписаниеТипов("Диаграмма")));
		ИзменитьРеквизиты(МассивРеквизитов);
		
		ОбъектДиаграмма = ЭтотОбъект[ИмяРеквизитаДиаграммы];
		ОбъектДиаграмма.ТипДиаграммы = ТипДиаграммы.Гистограмма;
		ОбъектДиаграмма.Анимация = АнимацияДиаграммы.НеИспользовать;
		ОбъектДиаграмма.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
		ОбъектДиаграмма.ОбластьЗаголовка.Расположение = РасположениеОбластиЗаголовкаДиаграммы.Нет;
		ОбъектДиаграмма.ПрозрачныйФон = Истина;
		ОбъектДиаграмма.ОбластьПостроения.ОтображатьПодписиШкалыЗначений = Ложь;
		ОбъектДиаграмма.ОбластьПостроения.ОтображатьПодписиШкалыСерий = Ложь;
		ОбъектДиаграмма.ОбластьПостроения.ОтображатьПодписиШкалыТочек = Ложь;
		ОбъектДиаграмма.ОбластьПостроения.ОтображатьШкалы = Ложь;
		ОбъектДиаграмма.ОбластьПостроения.ПрозрачныйФон = Истина;
		
		Серия = ОбъектДиаграмма.Серии.Добавить(НСтр("ru = 'Динамика показателя'"));
		Серия.Цвет = ЦветаПалитры.Желтый;
		
		Для каждого ТочкаДинамики Из ДанныеКарточки.ТаблицаДинамики Цикл
			ТочкаПериод = ОбъектДиаграмма.Точки.Добавить(ТочкаДинамики.Период);
			ОбъектДиаграмма.УстановитьЗначение(ТочкаПериод, Серия, ТочкаДинамики.Сумма);
		КонецЦикла;
		
		// Создание элементов диаграммы
		ЭлементДиаграмма = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_Диаграмма", Тип("ПолеФормы"), ГруппаВертикально);
		ЭлементДиаграмма.Вид = ВидПоляФормы.ПолеДиаграммы;
		ЭлементДиаграмма.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементДиаграмма.ПутьКДанным = ИмяРеквизитаДиаграммы;
		ЭлементДиаграмма.Ширина = 12;
		ЭлементДиаграмма.Высота = 3;
		ЭлементДиаграмма.РастягиватьПоВертикали = Истина;
		ЭлементДиаграмма.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		
	ИначеЕсли ДанныеКарточки.ВариантПроверки = Перечисления.ВариантыПроверокАнализаБизнеса.СравнениеСФиксированнымЗначением Тогда
		
		ГруппаВертикально.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		
		ЭлементПодзаголовок = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента+"_Подзаголовок", Тип("ДекорацияФормы"), ГруппаЗаголовки);
		ЭлементПодзаголовок.Шрифт = ШрифтыСтиля.ТекстВторогоУровня;
		
		ЭлементПодзаголовок.Заголовок = ДанныеКарточки.ПредставлениеСуммы;
		
		
		ЭлементЗначение = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента+"_Значение", Тип("ДекорацияФормы"), ГруппаВертикально);
		//@skip-check new-font
		ЭлементЗначение.Шрифт = Новый Шрифт(ШрифтыСтиля.ЗаголовокПервогоУровня,,, Истина);
		ЭлементЗначение.Заголовок = ДанныеКарточки.СтрокаЗначенияСравнения;
		ЭлементЗначение.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		ЭлементЗначение.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
		ЭлементЗначение.РастягиватьПоГоризонтали = Истина;
		ЭлементЗначение.Высота = 2;
	Иначе
		
		ГруппаВертикально.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		
		ЭлементПодзаголовок = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента+"_Подзаголовок", Тип("ДекорацияФормы"), ГруппаЗаголовки);
		ЭлементПодзаголовок.Шрифт = ШрифтыСтиля.ТекстВторогоУровня;
		ЭлементПодзаголовок.Заголовок = ДанныеКарточки.ПредставлениеСуммы;
		
		// Диаграмма
		// Создание реквизитов формы
		МассивРеквизитов = Новый Массив;
		ИмяРеквизитаДиаграммы = ПараметрыЭлемента.ИмяЭлемента + "_Диаграмма";
		СписокДиаграмм.Добавить(ИмяРеквизитаДиаграммы);
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаДиаграммы, Новый ОписаниеТипов("Диаграмма")));
		ИзменитьРеквизиты(МассивРеквизитов);
		
		ОбъектДиаграмма = ЭтотОбъект[ИмяРеквизитаДиаграммы];
		ОбъектДиаграмма.ТипДиаграммы = ТипДиаграммы.Гистограмма;
		ОбъектДиаграмма.Анимация = АнимацияДиаграммы.НеИспользовать;
		ОбъектДиаграмма.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
		ОбъектДиаграмма.ОбластьЗаголовка.Расположение = РасположениеОбластиЗаголовкаДиаграммы.Нет;
		ОбъектДиаграмма.ПрозрачныйФон = Истина;
		ОбъектДиаграмма.ОбластьПостроения.ОтображатьПодписиШкалыЗначений = Ложь;
		ОбъектДиаграмма.ОбластьПостроения.ОтображатьПодписиШкалыСерий = Ложь;
		ОбъектДиаграмма.ОбластьПостроения.ОтображатьПодписиШкалыТочек = Ложь;
		ОбъектДиаграмма.ОбластьПостроения.ОтображатьШкалы = Ложь;
		ОбъектДиаграмма.ОбластьПостроения.ПрозрачныйФон = Истина;
		
		СерияПервыйПоказатель = ОбъектДиаграмма.Серии.Добавить(ДанныеКарточки.ПерваяСтрокаЗаголовка);
		СерияПервыйПоказатель.Цвет = ЦветаПалитры.Желтый;
		СерияВторойПоказатель = ОбъектДиаграмма.Серии.Добавить(ДанныеКарточки.ВтораяСтрокаЗаголовка);
		СерияВторойПоказатель.Цвет = ЦветаПалитры.Оранжевый;
		
		ТочкаПериод = ОбъектДиаграмма.Точки.Добавить(ДанныеКарточки.ПредставлениеПериода);
		ОбъектДиаграмма.УстановитьЗначение(ТочкаПериод, СерияПервыйПоказатель, ДанныеКарточки.СуммаПоказателя);
		ОбъектДиаграмма.УстановитьЗначение(ТочкаПериод, СерияВторойПоказатель, ДанныеКарточки.ЗначениеДляСравнения);
		
		// Создание элементов диаграммы
		ЭлементДиаграмма = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_Диаграмма", Тип("ПолеФормы"), ГруппаВертикально);
		ЭлементДиаграмма.Вид = ВидПоляФормы.ПолеДиаграммы;
		ЭлементДиаграмма.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементДиаграмма.ПутьКДанным = ИмяРеквизитаДиаграммы;
		ЭлементДиаграмма.Ширина = 12;
		ЭлементДиаграмма.Высота = 3;
		ЭлементДиаграмма.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		
		// Группа заголовки
		ГруппаЗаголовкиНижние = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_ЗаголовкиНижние", Тип("ГруппаФормы"), ГруппаВертикально);
		ГруппаЗаголовкиНижние.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЗаголовкиНижние.ОтображатьЗаголовок = Ложь;
		ГруппаЗаголовкиНижние.РастягиватьПоВертикали = Ложь;
		ГруппаЗаголовкиНижние.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ГруппаЗаголовкиНижние.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаЗаголовкиНижние.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаЗаголовкиНижние.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		ГруппаЗаголовкиНижние.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
		
		ЭлементПодзаголовок = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента+"_ПодзаголовокНижний", Тип("ДекорацияФормы"), ГруппаЗаголовкиНижние);
		ЭлементПодзаголовок.Шрифт = ШрифтыСтиля.ТекстВторогоУровня;
		ЭлементПодзаголовок.Заголовок = ДанныеКарточки.ПредставлениеВторойСуммы;
		
		ЭлементЗаголовок = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента+"_ЗаголовокНижний", Тип("ДекорацияФормы"), ГруппаЗаголовкиНижние);
		ЭлементЗаголовок.Шрифт = ШрифтыСтиля.ЗаголовокВторогоУровня;
		ЭлементЗаголовок.Заголовок = ДанныеКарточки.ВтораяСтрокаЗаголовка;
		
	КонецЕсли;
	
	КартинкаРазделитель = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_Иконка", Тип("ДекорацияФормы"), ГруппаВертикально);
	КартинкаРазделитель.Вид = ВидДекорацииФормы.Картинка;
	КартинкаРазделитель.РазмерКартинки = РазмерКартинки.Растянуть;
	КартинкаРазделитель.РастягиватьПоГоризонтали = Истина;
	КартинкаРазделитель.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	КартинкаРазделитель.Картинка = БиблиотекаКартинок.ЛинияПоУмолчанию;
	
	ЭлементПериод = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента+"_Период", Тип("ДекорацияФормы"), ГруппаВертикально);
	ЭлементПериод.Шрифт = ШрифтыСтиля.ТекстВторогоУровня;
	ЭлементПериод.Заголовок = ДанныеКарточки.ПредставлениеПериода;
	ЭлементПериод.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКарточкуДобавления(ПараметрыЭлемента)
	
	ГруппаДобавить = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента, Тип("ГруппаФормы"), ПараметрыЭлемента.РодительЭлемента);
	ГруппаДобавить.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДобавить.ОтображатьЗаголовок = Ложь;
	ГруппаДобавить.ОтображатьКакКарточку = Истина;
	ГруппаДобавить.Гиперссылка = Истина;
	ГруппаДобавить.РастягиватьПоВертикали = Ложь;
	ГруппаДобавить.РастягиватьПоГоризонтали = Ложь;
	
	Если ПараметрыЭлемента.ИмяЭлемента = "ДобавитьПроверку" Тогда
		ГруппаДобавить.Ширина = 25;
		ГруппаДобавить.Высота = 14;
	Иначе
		ГруппаДобавить.Ширина = 33;
		ГруппаДобавить.Высота = 9;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ГруппаДобавить.РастягиватьПоГоризонтали = Истина;
		ГруппаДобавить.Ширина = 0;
	КонецЕсли;
	
	ЗаголовокДобавить = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента +"Заголовок", Тип("ДекорацияФормы"), ГруппаДобавить);
	ЗаголовокДобавить.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ЗаголовокДобавить.РастягиватьПоГоризонтали = Истина;
	ЗаголовокДобавить.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ЗаголовокДобавить.Шрифт = ШрифтыСтиля.ЗаголовокТретьегоУровня;
	ЗаголовокДобавить.Заголовок = ПараметрыЭлемента.Заголовок;
	ЗаголовокДобавить.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
	ЗаголовокДобавить.Гиперссылка = Истина;
	
	Если ЗначениеЗаполнено(ПараметрыЭлемента.Действие) Тогда
		ГруппаДобавить.УстановитьДействие("Нажатие", ПараметрыЭлемента.Действие);
		ЗаголовокДобавить.УстановитьДействие("Нажатие", ПараметрыЭлемента.Действие);
	КонецЕсли;
	
	ГруппаДобавить.Видимость = РежимРедактирования;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКарточкуЦели(ПараметрыЭлемента, ДанныеКарточки)
	
	// Верхняя группа
	Группа = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента, Тип("ГруппаФормы"), ПараметрыЭлемента.РодительЭлемента);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.ОтображатьКакКарточку = Истина;
	Группа.Гиперссылка = Истина;
	Группа.РастягиватьПоВертикали = Ложь;
	Группа.РастягиватьПоГоризонтали = Ложь;
	Группа.Ширина = 33;
	Группа.Высота = 7;
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Группа.РастягиватьПоГоризонтали = Истина;
		Группа.Ширина = 0;
	КонецЕсли;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	Группа.УстановитьДействие("Нажатие", ПараметрыЭлемента.Действие);
	
	ГруппаЛево = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_Лево", Тип("ГруппаФормы"), Группа);
	ГруппаЛево.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЛево.ОтображатьЗаголовок = Ложь;
	ГруппаЛево.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	// Группа заголовки
	ГруппаЗаголовки = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_Заголовки", Тип("ГруппаФормы"), ГруппаЛево);
	ГруппаЗаголовки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЗаголовки.ОтображатьЗаголовок = Ложь;
	ГруппаЗаголовки.РастягиватьПоВертикали = Ложь;
	ГруппаЗаголовки.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ГруппаЗаголовки.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаЗаголовки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ЭлементЗаголовок = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента+"_Заголовок", Тип("ДекорацияФормы"), ГруппаЗаголовки);
	ЭлементЗаголовок.Шрифт = ШрифтыСтиля.ЗаголовокВторогоУровня;
	ЭлементЗаголовок.Заголовок = ДанныеКарточки.ПерваяСтрокаЗаголовка;
	
	ЭлементЗаголовок2 = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента+"_Заголовок2", Тип("ДекорацияФормы"), ГруппаЗаголовки);
	ЭлементЗаголовок2.Шрифт = ШрифтыСтиля.ТекстВторогоУровня;
	ЭлементЗаголовок2.Заголовок = ДанныеКарточки.ВтораяСтрокаЗаголовка;
	
	// Группа суммы и период
	ГруппаСуммаПериод = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_СуммаПериод", Тип("ГруппаФормы"), ГруппаЛево);
	ГруппаСуммаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСуммаПериод.ОтображатьЗаголовок = Ложь;
	ГруппаСуммаПериод.РастягиватьПоВертикали = Ложь;
	ГруппаСуммаПериод.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ГруппаСуммаПериод.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСуммаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ЭлементЗаголовок2 = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента+"_Период", Тип("ДекорацияФормы"), ГруппаСуммаПериод);
	ЭлементЗаголовок2.Шрифт = ШрифтыСтиля.ТекстВторогоУровня;
	ЭлементЗаголовок2.Заголовок = ДанныеКарточки.ПредставлениеПериода;
	
	ЭлементЗаголовок = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента+"_Сумма", Тип("ДекорацияФормы"), ГруппаСуммаПериод);
	ЭлементЗаголовок.Шрифт = ШрифтыСтиля.ЗаголовокВторогоУровня;
	ЭлементЗаголовок.Заголовок = ДанныеКарточки.ПредставлениеСуммы;
	
	// Диаграмма
	// Создание реквизитов формы
	МассивРеквизитов = Новый Массив;
	ИмяРеквизитаДиаграммы = ПараметрыЭлемента.ИмяЭлемента + "_Диаграмма";
	СписокДиаграмм.Добавить(ИмяРеквизитаДиаграммы);
	МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаДиаграммы, Новый ОписаниеТипов("Диаграмма")));
	ИзменитьРеквизиты(МассивРеквизитов);
	
	ОбъектДиаграмма = ЭтотОбъект[ИмяРеквизитаДиаграммы];
	ОбъектДиаграмма.ТипДиаграммы = ТипДиаграммы.Кольцевая;
	ОбъектДиаграмма.Анимация = АнимацияДиаграммы.НеИспользовать;
	ОбъектДиаграмма.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	ОбъектДиаграмма.ВнутреннийРадиусКольцевойДиаграммы = 70;
	СерияПлан = ОбъектДиаграмма.Серии.Добавить(НСтр("ru = 'Остаток плана'"));
	СерияПлан.Цвет = ЦветаПалитры.Серый;
	СерияФактТекущийПериод = ОбъектДиаграмма.Серии.Добавить(НСтр("ru = 'Факт за'") + " " + ДанныеКарточки.ПредставлениеПериода);
	СерияФактТекущийПериод.Цвет = ЦветаПалитры.Желтый;
	ТочкаТекущийПериод = ОбъектДиаграмма.Точки.Добавить(НСтр("ru = 'План / факт за текущий период'"));
	
	ОстатокПлана = Макс(ДанныеКарточки.СуммаПлан - ДанныеКарточки.СуммаФакт, 0);
	Если ДанныеКарточки.СуммаПлан = 0 Тогда
		ОстатокПлана = 1;
	КонецЕсли;
	ОбъектДиаграмма.УстановитьЗначение(ТочкаТекущийПериод, СерияПлан, ОстатокПлана);
	ОбъектДиаграмма.УстановитьЗначение(ТочкаТекущийПериод, СерияФактТекущийПериод, ДанныеКарточки.СуммаФакт);
	ОбъектДиаграмма.ОбластьЗаголовка.Расположение = РасположениеОбластиЗаголовкаДиаграммы.УказываетсяРасположение;
	ОбъектДиаграмма.ОбластьЗаголовка.Текст = Строка(ДанныеКарточки.Процент) + "%";
	ОбъектДиаграмма.ОбластьЗаголовка.Верх = 0.25;
	ОбъектДиаграмма.ОбластьЗаголовка.Лево = 0.25;
	ОбъектДиаграмма.ОбластьЗаголовка.Низ = 0.75;
	ОбъектДиаграмма.ОбластьЗаголовка.Право = 0.75;
	ОбъектДиаграмма.ОбластьЗаголовка.ПрозрачныйФон = Истина;
	ОбъектДиаграмма.ОбластьЗаголовка.Шрифт = ШрифтыСтиля.ЗаголовокВторогоУровня;
	
	// Создание элементов диаграммы
	ЭлементДиаграмма = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_Диаграмма", Тип("ПолеФормы"), Группа);
	ЭлементДиаграмма.Вид = ВидПоляФормы.ПолеДиаграммы;
	ЭлементДиаграмма.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементДиаграмма.ПутьКДанным = ИмяРеквизитаДиаграммы;
	ЭлементДиаграмма.Ширина = 12;
	ЭлементДиаграмма.Высота = 3;
	ЭлементДиаграмма.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	ЭлементДиаграмма.РастягиватьПоГоризонтали = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЭлементКарточкиТакси(ПараметрыЭлемента)
	
	НовыйЭлемент = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента, Тип("ПолеФормы"), ПараметрыЭлемента.РодительЭлемента);
	
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеКартинки;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ПараметрыЭлемента);
	
	Если ЗначениеЗаполнено(ПараметрыЭлемента.Действие) Тогда
		НовыйЭлемент.УстановитьДействие("Нажатие", ПараметрыЭлемента.Действие);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЭлементУдалитьКарточку(ПараметрыЭлемента)
	
	Если ЭтоИнтерфейсТакси Тогда
		СформироватьЭлементУдалитьКарточкуТакси(ПараметрыЭлемента);
		Возврат;
	КонецЕсли;
	ЭлементКарточки = Элементы.Найти(ПараметрыЭлемента.ИмяЭлемента);
	НовыйЭлемент = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_Удалить", Тип("ДекорацияФормы"), ЭлементКарточки);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Удалить;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Видимость = РежимРедактирования;
	НовыйЭлемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_УдалитьКарточкуНажатие");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЭлементУдалитьКарточкуТакси(ПараметрыЭлемента)
	
	НовыйЭлемент = Элементы.Добавить(ПараметрыЭлемента.ИмяЭлемента + "_Удалить", Тип("ДекорацияФормы"), ПараметрыЭлемента.РодительЭлемента);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Закрыть;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Видимость = Ложь;
	НовыйЭлемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_УдалитьКарточкуНажатие");
	
КонецПроцедуры

&НаСервере
Функция СформироватьSVGПоСтроке(ШаблонSVG)
	
	МодифицироватьТекстSVGПоРежимуРедактирования(ШаблонSVG, РежимРедактирования);
	
	ИмяВременногоФайлаSVG = ПолучитьИмяВременногоФайла();
	ФайлКартинки = Новый ЗаписьТекста(ИмяВременногоФайлаSVG);
	ФайлКартинки.Записать(ШаблонSVG);
	ФайлКартинки.Закрыть();
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайлаSVG);
	УдалитьФайлы(ИмяВременногоФайлаSVG);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
КонецФункции

// Находит существующую или создает новую группу карточек для указанного вида карточек анализа бизнеса.
//
// Параметры:
//  ВидКарточки - ПеречислениеСсылка.ВидыКарточекАнализаБизнеса - вид карточки, для которого требуется найти или создать группу.
//
// Возвращаемое значение:
//  ГруппаФормы - найденная или созданная группа карточек.
//
&НаСервере
Функция НайтиИлиДобавитьГруппуКарточек(ВидКарточки)
	
	Если ВидКарточки = Перечисления.ВидыКарточекАнализаБизнеса.Цель Тогда
		РодительГруппы = Элементы.ГруппаКарточкиЦели;
		ИмяГруппы = "ГруппаЦели"; // Не локализуется
		КоличествоКарточекВГруппе = ?(ЭтоИнтерфейсТакси, 4, 3); // Кнопка удаления в такси считается отдельно от карточки
	Иначе // Проверки
		РодительГруппы = Элементы.ГруппаКарточкиПроверки;
		ИмяГруппы = "ГруппаПроверки"; // Не локализуется
		КоличествоКарточекВГруппе = ?(ЭтоИнтерфейсТакси, 8, 4); // Кнопка удаления в такси считается отдельно от карточки
	КонецЕсли;
	
	НомерГруппы = 0;
	ПоследняяСозданнаяГруппа = Неопределено;
	
	Пока Элементы.Найти(ИмяГруппы + НомерГруппы) <> Неопределено Цикл
		ПоследняяСозданнаяГруппа = Элементы.Найти(ИмяГруппы + НомерГруппы);
		НомерГруппы = НомерГруппы + 1;
	КонецЦикла; 
	
	Если ПоследняяСозданнаяГруппа <> Неопределено И
		ПоследняяСозданнаяГруппа.ПодчиненныеЭлементы.Количество() < КоличествоКарточекВГруппе Тогда
		Возврат ПоследняяСозданнаяГруппа;
	КонецЕсли;
	
	НоваяГруппа = Элементы.Добавить(ИмяГруппы + НомерГруппы, Тип("ГруппаФормы"), РодительГруппы);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.АвтоматическиУчитыватьВидЭкрана;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	
	Возврат НоваяГруппа;
	
КонецФункции

&НаСервере
Процедура СформироватьКарточкиАнализаБизнеса(ВидКарточки)
	
	Если ВидКарточки = Перечисления.ВидыКарточекАнализаБизнеса.Цель Тогда
		ИмяТаблицы = "СписокЦелей"; // Не локализуется
		ВыборкаКарточек = ПолучитьВыборкуЦелей();
	Иначе // Проверки
		ИмяТаблицы = "СписокПроверок"; // Не локализуется
		ВыборкаКарточек = ПолучитьВыборкуПроверок();
	КонецЕсли;
	
	ПараметрыЭлемента = Справочники.КарточкиАнализаБизнеса.СформироватьПараметрыЭлементаКарточки(ВидКарточки);
	
	НомерСтроки = 0;
	ЭтотОбъект[ИмяТаблицы].Очистить();
	
	Пока ВыборкаКарточек.Следующий() Цикл
		
		ДанныеКарточки = Справочники.КарточкиАнализаБизнеса.ПолучитьДанныеКарточки(ВыборкаКарточек.Ссылка);
		Если ДанныеКарточки = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаКарточки = ЭтотОбъект[ИмяТаблицы].Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаКарточки, ДанныеКарточки);
		
		Если ЭтоИнтерфейсТакси Тогда
			СтрокаКарточки.SVG = СформироватьSVGПоСтроке(СтрокаКарточки.СтрокаSVG);
		Иначе
			ПараметрыЭлемента.Вставить("ДанныеКарточки", ДанныеКарточки);
		КонецЕсли;
		
		ПараметрыЭлемента.РодительЭлемента = НайтиИлиДобавитьГруппуКарточек(ВидКарточки);
		ПараметрыЭлемента.ИмяЭлемента = ИмяТаблицы + "_" + НомерСтроки;
		ПараметрыЭлемента.ПутьКДанным = СтрШаблон(ПараметрыЭлемента.ШаблонПутьКДанным, ИмяТаблицы, НомерСтроки);
		
		СформироватьЭлементКарточки(ПараметрыЭлемента);
		СформироватьЭлементУдалитьКарточку(ПараметрыЭлемента);
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	ПараметрыЭлемента.РодительЭлемента = НайтиИлиДобавитьГруппуКарточек(ВидКарточки);
	
	Если ВидКарточки = Перечисления.ВидыКарточекАнализаБизнеса.Цель Тогда
		Если ЭтоИнтерфейсТакси Тогда
			ДобавитьКарточкуЦелиSVG = СформироватьSVGПоСтроке(АнализБизнесаПовтИсп.ШаблонДобавитьЦель());
		КонецЕсли;
		ПараметрыЭлемента.Видимость = Ложь;
		ПараметрыЭлемента.ИмяЭлемента = "ДобавитьКарточкуЦели";
		ПараметрыЭлемента.ПутьКДанным = "ДобавитьКарточкуЦелиSVG";
		ПараметрыЭлемента.Вставить("Заголовок", НСтр("ru = '+ ДОБАВИТЬ ЦЕЛЬ'"));
		СформироватьЭлементКарточки(ПараметрыЭлемента);
	Иначе // Проверки
		Если ЭтоИнтерфейсТакси Тогда
			ДобавитьПроверкуSVG = СформироватьSVGПоСтроке(АнализБизнесаПовтИсп.ШаблонДобавитьПроверку());
		КонецЕсли;
		ДобавитьПроверкуSVG = СформироватьSVGПоСтроке(АнализБизнесаПовтИсп.ШаблонДобавитьПроверку());
		ПараметрыЭлемента.Видимость = Ложь;
		ПараметрыЭлемента.ИмяЭлемента = "ДобавитьПроверку";
		ПараметрыЭлемента.ПутьКДанным = "ДобавитьПроверкуSVG";
		ПараметрыЭлемента.Вставить("Заголовок", НСтр("ru = '+ ДОБАВИТЬ ПОКАЗАТЕЛЬ'"));
		СформироватьЭлементКарточки(ПараметрыЭлемента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПараметрыЭлементаПоИмени(ИмяЭлемента)
	
	ПараметрыЭлемента = Новый Структура("ИмяТаблицы, ИндексСтроки");
	
	ПараметрыЭлемента.ИмяТаблицы = Лев(ИмяЭлемента, СтрНайти(ИмяЭлемента, "_")-1);
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяЭлемента, "_");
	Если МассивПодстрок.Количество() >= 2 Тогда
		ПараметрыЭлемента.ИндексСтроки = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(МассивПодстрок[1]);
	КонецЕсли;
	
	Возврат ПараметрыЭлемента;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуЭлементаПоЗначению(Значение, ВидКарточки)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", Значение);
	Если ВидКарточки <> Неопределено Тогда
		ПараметрыОткрытия.Вставить("ВидКарточки", ВидКарточки);
	КонецЕсли;
			
	Если РежимРедактирования ИЛИ Значение.Пустая() Тогда
		ИмяФормыЭлемента = "Справочник.КарточкиАнализаБизнеса.Форма.ФормаРедактированияЭлемента"; // Не локализуется
	Иначе
		ИмяФормыЭлемента = "Справочник.КарточкиАнализаБизнеса.Форма.ФормаЭлемента"; // Не локализуется
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗаписиКарточки", ЭтотОбъект);
	ОткрытьФорму(ИмяФормыЭлемента, ПараметрыОткрытия,,,,, ОповещениеОЗакрытии, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыНаСервере(ИмяТаблицы, МассивЭлементовДляУдаления, СсылкаДляПометкиНаУдаление)
	
	Для каждого ИмяЭлемента Из МассивЭлементовДляУдаления Цикл
		Элементы.Удалить(Элементы[ИмяЭлемента]);
	КонецЦикла;
	
	ИмяГруппы = ?(ИмяТаблицы = "СписокЦелей", "ГруппаЦели", "ГруппаПроверки");
	
	НомерГруппы = 0;
	ТекущаяГруппа = Элементы.Найти(ИмяГруппы + НомерГруппы);
	Пока ТекущаяГруппа <> Неопределено Цикл
		Если ТекущаяГруппа.ПодчиненныеЭлементы.Количество() = 0 Тогда
			Элементы.Удалить(ТекущаяГруппа);
		КонецЕсли;
		НомерГруппы = НомерГруппы + 1;
		ТекущаяГруппа = Элементы.Найти(ИмяГруппы + НомерГруппы);
	КонецЦикла;
	
	КарточкаОбъект = СсылкаДляПометкиНаУдаление.ПолучитьОбъект();
	КарточкаОбъект.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры

#КонецОбласти 

#Область ПечатьИСохранение

&НаСервереБезКонтекста
Функция СформироватьПараметрыСохраненияФайла()
	
	СтруктураФильтра = Новый Структура;
	МассивФорматов = Новый Массив;
	
	СтрокаФильтра = "";
	Шаблон = "%1|*.%2|";
	ТаблицаФорматов = СтандартныеПодсистемыСервер.НастройкиФорматовСохраненияТабличногоДокумента();
	
	Для каждого СтрокаФормата Из ТаблицаФорматов Цикл
		СтрокаФильтра = СтрокаФильтра + СтрШаблон(Шаблон, СтрокаФормата.Представление, СтрокаФормата.Расширение);
		МассивФорматов.Добавить(СтрокаФормата.ТипФайлаТабличногоДокумента);
	КонецЦикла;
	
	СтруктураФильтра.Вставить("СтрокаФильтра", СтрокаФильтра);
	СтруктураФильтра.Вставить("МассивФорматов", МассивФорматов);
	
	Возврат СтруктураФильтра;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораФайлаДляСохранения(ВыбранныйФайл, ПараметрыДиалога) Экспорт
	
	Если ВыбранныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = ПараметрыДиалога.ДиалогСохранения.ПолноеИмяФайла;
	ТабличныйДокумент = Новый ТабличныйДокумент;
	СформироватьПечатнуюФормуНаСервере(ТабличныйДокумент);
	ФорматСохранения = ПараметрыДиалога.ПараметрыСохранения.МассивФорматов[ПараметрыДиалога.ДиалогСохранения.ИндексФильтра];
	ТабличныйДокумент.Записать(ИмяФайла, ФорматСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогОтправкиПоПочте(ТабличныйДокумент)
	
	ШаблонПредставления = НСтр("ru = 'Анализ бизнеса %1'");
	ОтчетНаименованиеТекущегоВарианта = СтрШаблон(ШаблонПредставления, ПредставлениеПериода);
	
	Вложение = Новый Структура;
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ТабличныйДокумент, УникальныйИдентификатор);
	Вложение.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	Вложение.Вставить("Представление", ОтчетНаименованиеТекущегоВарианта);
	
	СписокВложений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вложение);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		ПараметрыОтправки = МодульРаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
		ПараметрыОтправки.Тема = ОтчетНаименованиеТекущегоВарианта;
		ПараметрыОтправки.Вложения = СписокВложений;
		МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПечатнуюФормуНаСервере(ТабличныйДокумент)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СкомпоноватьРезультат(ТабличныйДокумент, Новый ДанныеРасшифровкиКомпоновкиДанных);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСохраняемогоОтчета()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	СформироватьПечатнуюФормуНаСервере(ТабличныйДокумент);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	Попытка
		ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи табличного документа'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,ИнформацияОбОшибке());
			Возврат Неопределено;
	КонецПопытки;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура СохранениеОтчетаЗавершение(РасширениеПодключено, ДополнительныеПараметры) Экспорт
	
	Если РасширениеПодключено = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РасширениеПодключено Тогда
		ДиалогСохранения = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохранения.МножественныйВыбор = Ложь;
		
		ПараметрыСохранения = СформироватьПараметрыСохраненияФайла();
		
		ПараметрыДиалога = Новый Структура;
		ПараметрыДиалога.Вставить("ПараметрыСохранения", ПараметрыСохранения);
		ПараметрыДиалога.Вставить("ДиалогСохранения", ДиалогСохранения);
		
		ДиалогСохранения.Фильтр = ПараметрыСохранения.СтрокаФильтра;
		ДиалогСохранения.Показать(Новый ОписаниеОповещения("ПослеВыбораФайлаДляСохранения", ЭтотОбъект, ПараметрыДиалога));
	Иначе
		АдресФайла = ПолучитьАдресСохраняемогоОтчета();
		ИмяФайла = Строка(ВыбранныйОтчет) + " " + СтрЗаменить(ПредставлениеПериода,".","") + ".xlsx";
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
		ФайловаяСистемаКлиент.СохранитьФайл(Неопределено, АдресФайла, ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
