
// подмена формы по виду маркетплейса

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено( Объект.ВидМаркетплейса ) Тогда
		Если ЗначениеЗаполнено( Параметры.ВидМаркетплейса ) Тогда
			Объект.ВидМаркетплейса = Параметры.ВидМаркетплейса;
		КонецЕсли;
	КонецЕсли;

	Если Объект.ВидМаркетплейса = ПредопределенноеЗначение( "Перечисление.ВидыМаркетплейсов.МаркетплейсOzon" ) Тогда
		ОбработкаИмя = "МаркетплейсOzon";
	ИначеЕсли Объект.ВидМаркетплейса = ПредопределенноеЗначение( "Перечисление.ВидыМаркетплейсов.МаркетплейсЯндексМаркет" ) Тогда
		ОбработкаИмя = "МаркетплейсЯндексМаркет";
	ИначеЕсли Объект.ВидМаркетплейса = ПредопределенноеЗначение( "Перечисление.ВидыМаркетплейсов.МаркетплейсWildberries" ) Тогда
		ОбработкаИмя = "МаркетплейсWildberries";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
	Если ЗначениеЗаполнено( ОбработкаИмя ) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить( "УчетнаяЗапись", Объект.Ссылка );
		ОткрытьФорму( "Обработка." + ОбработкаИмя + ".Форма.ФормаНастройки", ПараметрыФормы, , Объект.Ссылка );
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере( ТекущийОбъект, ПараметрыЗаписи )
	УправлениеДоступом.ПослеЗаписиНаСервере( ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи );
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере( ТекущийОбъект )
	УправлениеДоступом.ПриЧтенииНаСервере( ЭтотОбъект, ТекущийОбъект );
КонецПроцедуры

#КонецОбласти