#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОтображениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;

	ВалютаДокумента = Объект.ВалютаДокумента;
	Компания = Константы.УчетПоКомпании.Компания(Объект.Организация);

	ВыполнятьЗамерыПроизводительности = ОценкаПроизводительностиВызовСервераПовтИсп.ВыполнятьЗамерыПроизводительности();

	ИспользоватьМногофирменныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Если Не ИспользоватьМногофирменныйУчет И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Организация.Гиперссылка = Истина;
	КонецЕсли;
	
	ИспользоватьНесколькоВалют = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	Если ИспользоватьНесколькоВалют Тогда
		Элементы.КолонкаСсылки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	КонецЕсли;
	
	ОбновитьПодвалФормы();
	УстановитьВидимостьИДоступность();

	ТипыСчетовЗатрат = Новый Соответствие;
	Для Каждого СтрокаДанных Из Объект.НачисленияУдержания Цикл
		ЗаполнитьТипСчетаЗатрат(СтрокаДанных, ТипыСчетовЗатрат);
	КонецЦикла;

	Для Каждого СтрокаДанных Из Объект.Взносы Цикл
		ЗаполнитьТипСчетаЗатрат(СтрокаДанных, ТипыСчетовЗатрат);
	КонецЦикла;
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	УстановитьУсловноеОформление();
	
	АдаптацияФормыТакси();
	МобильныйКлиентУНФ.НастроитьФормуОбъектаМобильныйКлиент(Элементы);
	
	УстановитьСвойстваСвернутогоПодвала();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ОбратнаяСвязь
	ОбратнаяСвязь.ПередЗаписьюДокумента(Отказ, ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);
	// Конец ОбратнаяСвязь
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	ДанныеДляИзмененияДаты = ДокументыУНФКлиент.ДанныеДляИзмененияДаты(ЭтотОбъект, Объект);
	Если ДанныеДляИзмененияДаты.ДатаНеМенялась Тогда
		Возврат;
	КонецЕсли;

	ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты);

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ОрганизацияПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)

	Если Объект.ВалютаДокумента = ВалютаДокумента Тогда
		Возврат;
	КонецЕсли;

	Если Объект.НачисленияУдержания.Количество() > 0 Или Объект.ПогашениеЗаймов.Количество() > 0 Тогда

		Режим = РежимДиалогаВопрос.ДаНет;
		ОповещениеЗавершение = Новый ОписаниеОповещения("ВалютаДокументаПриИзмененииЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Табличные части будут очищены. Продолжить выполнение операции?'");
		ПоказатьВопрос(ОповещениеЗавершение, ТекстВопроса, Режим, 0);
		Возврат;

	КонецЕсли;

	ВалютаДокументаПриИзмененииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)

	ЗарплатаИПерсоналКлиент.ПриРегулированииПериодаРегистрации(ЭтотОбъект, Направление);
	ЗарплатаИПерсоналКлиент.ПриИзмененииПериодаРегистрации(ЭтотОбъект);
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры // ПериодРегистрацииРегулирование()

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ЗарплатаИПерсоналКлиент.ОткрытьВыборПериодаРегистрации(Объект.ПериодРегистрации, Элементы.ПериодРегистрации);
	
КонецПроцедуры // ПериодРегистрацииНачалоВыбора()

&НаКлиенте
Процедура ПериодРегистрацииОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением,
	СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Объект.ПериодРегистрации = ВыбранноеЗначение.НачалоПериода;
		ЗарплатаИПерсоналКлиент.ПриИзмененииПериодаРегистрации(ЭтотОбъект);
		УстановитьВидимостьИДоступность();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийСвернутоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисленияУдержания

&НаКлиенте
Процедура НачисленияУдержанияПриИзменении(Элемент)

	ОбновитьПодвалФормы();

КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда

		Если Не Копирование Тогда

			ТекущиеДанные 				= Элементы.НачисленияУдержания.ТекущиеДанные;

			ТекущиеДанные.ДатаНачала 	= Объект.ПериодРегистрации;
			ТекущиеДанные.ДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);
			ТекущиеДанные.РучнаяКорректировка = Истина;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияСчетЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ЗарплатаИПерсоналКлиент.ПараметрыВыбораСчетаЗатрат(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияСчетЗатратПриИзменении(Элемент)

	ДанныеТекущейСтроки = Элементы.НачисленияУдержания.ТекущиеДанные;
	Если ДанныеТекущейСтроки <> Неопределено Тогда

		СтруктураДанных = ПолучитьДанныеСчетаЗатрат(ДанныеТекущейСтроки.СчетЗатрат);
		ДанныеТекущейСтроки.ТипСчета = СтруктураДанных.ТипСчета;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "НачисленияУдержанияСуммаСРасшифровкой" Тогда

		ТекущиеДанные = Элементы.НачисленияУдержания.ТекущиеДанные;

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораМенюРасшифровки", ЭтотОбъект, ДополнительныеПараметры);
		СписокЭлементовМеню = Новый СписокЗначений;
		СписокЭлементовМеню.Добавить("ИзменитьЗначение", НСтр("ru = 'Изменить значение'"), ,
			БиблиотекаКартинок.Изменить);
		СписокЭлементовМеню.Добавить("РасшифроватьЗначение", НСтр("ru = 'Расшифровать значение'"), ,
			БиблиотекаКартинок.Отчет);

		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокЭлементовМеню);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияВидНачисленияУдержанияПриИзменении(Элемент)

	ДанныеТекущейСтроки = Элементы.НачисленияУдержания.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("НачалоМесяца", НачалоМесяца(Объект.ПериодРегистрации));
	СтруктураДанных.Вставить("Организация", Объект.Организация);
	СтруктураДанных.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	СтруктураДанных.Вставить("Валюта", Объект.ВалютаДокумента);
	СтруктураДанных.Вставить("Сотрудник", ДанныеТекущейСтроки.Сотрудник);
	СтруктураДанных.Вставить("ВидНачисленияУдержания", ДанныеТекущейСтроки.ВидНачисленияУдержания);

	СтруктураДанных = ЗаполнитьПоказатели(СтруктураДанных);
	ЗаполнитьЗначенияСвойств(ДанныеТекущейСтроки, СтруктураДанных);

	Если Не ЗначениеЗаполнено(ДанныеТекущейСтроки.СчетЗатрат) Тогда
		ЗарплатаИПерсоналКлиент.СчетЗатратПоУмолчаниюВТекущуюСтроку(ЭтотОбъект, Объект.СтруктурнаяЕдиница);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНалогиНаДоходы

&НаКлиенте
Процедура НалогиНаДоходыПриИзменении(Элемент)

	ОбновитьПодвалФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтраховыеВзносы

&НаКлиенте
Процедура СтраховыеВзносыСчетЗатратПриИзменении(Элемент)

	ДанныеТекущейСтроки = Элементы.СтраховыеВзносы.ТекущиеДанные;
	Если ДанныеТекущейСтроки <> Неопределено Тогда

		СтруктураДанных = ПолучитьДанныеСчетаЗатрат(ДанныеТекущейСтроки.СчетЗатрат);
		ДанныеТекущейСтроки.ТипСчета = СтруктураДанных.ТипСчета;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраховыеВзносыСчетЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ЗарплатаИПерсоналКлиент.ПараметрыВыбораСчетаЗатрат(ЭтотОбъект, "СтраховыеВзносы");

КонецПроцедуры

&НаКлиенте
Процедура СтраховыеВзносыВидНачисленияУдержанияПриИзменении(Элемент)

	ДанныеТекущейСтроки = Элементы.СтраховыеВзносы.ТекущиеДанные;
	СтруктураПараметров = Новый Структура("СчетЗатрат, ТипСчета");
	СтруктураПараметров.Вставить("ВидНачисленияУдержания", ДанныеТекущейСтроки.ВидНачисленияУдержания);
	СтруктураПараметров.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);

	Если ЗначениеЗаполнено(ДанныеТекущейСтроки.ВидНачисленияУдержания) Тогда
		ПолучитьСчетЗатратВзноса(СтруктураПараметров);
		ДанныеТекущейСтроки.СчетЗатрат = СтруктураПараметров.СчетЗатрат;
	КонецЕсли;

	Если ДанныеТекущейСтроки.Свойство("ТипСчета") Тогда
		ДанныеТекущейСтроки.ТипСчета = СтруктураПараметров.ТипСчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеВзносыПриИзменении(Элемент)

	ОбновитьПодвалФормы();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПогашениеЗаймов

&НаКлиенте
Процедура ПогашениеЗаймовПриИзменении(Элемент)

	ОбновитьПодвалФормы();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Рассчитать(Команда)

	Если ЗаполненыТарифыВзносов("РассчитатьПоФормуламИНалогиИВзносы") Тогда
		РассчитатьПоФормуламИНалогиИВзносы();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)

	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не заполнено подразделение. Заполнение документа отменено.'");
		Сообщение.Поле = "Объект.СтруктурнаяЕдиница";
		Сообщение.Сообщить();

		Возврат;

	КонецЕсли;

	Если Объект.НачисленияУдержания.Количество() > 0 И Объект.НалогиНаДоходы.Количество() > 0 Тогда

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Табличные части документа будут очищены. Продолжить выполнение операции?'"),
			РежимДиалогаВопрос.ДаНет, 0);
		Возврат;
	КонецЕсли;
	
	Если Объект.НачисленияУдержания.Количество() > 0 Или Объект.НалогиНаДоходы.Количество() > 0
		Или Объект.ПогашениеЗаймов.Количество() > 0 Тогда // Прочие расчеты

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Табличная часть документа будет очищена. Продолжить выполнение операции?'"),
			РежимДиалогаВопрос.ДаНет, 0);
		Возврат;

	КонецЕсли;

	Если ЗаполненыТарифыВзносов("ЗаполнитьПоПодразделению") Тогда
		ЗаполнитьПоПодразделению();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиСПустойСуммой(Команда)

	МассивИдентификаторов = Новый Массив;
	Для Каждого СтрокаНачисления Из Объект.НачисленияУдержания Цикл

		Если СтрокаНачисления.Сумма = 0 Тогда
			МассивИдентификаторов.Добавить(СтрокаНачисления.ПолучитьИдентификатор());
		КонецЕсли;

	КонецЦикла;

	Количество = МассивИдентификаторов.Количество();
	Пока Количество > 0 Цикл

		СтрокаДляУдаления = Объект.НачисленияУдержания.НайтиПоИдентификатору(МассивИдентификаторов[Количество - 1]);
		Объект.НачисленияУдержания.Удалить(СтрокаДляУдаления);
		Количество = Количество - 1;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КомментарийИзменить(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Комментарий.КнопкаВыбора = Истина;
	Элементы.ПодвалСвернут.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваСвернутогоПодвала()
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	ОпределяющиеЭлементы = "ГруппаПодвалПраво,ГруппаИтогиТаблицы,СуммаНачислено,СуммаУдержано,ГруппаИтоги,СуммаПогашено,СуммаДокумента";
	РаботаСФормойДокумента.УстановитьСвойстваСвернутогоПодвала(ЭтотОбъект, ОпределяющиеЭлементы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ДобавитьУсловноеОформлениеНезаполненного("Объект.НачисленияУдержания.Размер",
		Элементы.НачисленияУдержанияРазмер.Имя, "");
	ДобавитьУсловноеОформлениеНезаполненного("Объект.НачисленияУдержания.ОтработаноДней",
		Элементы.НачисленияУдержанияОтработаноДней.Имя, НСтр("ru = 'Дней'"));
	ДобавитьУсловноеОформлениеНезаполненного("Объект.НачисленияУдержания.ОтработаноЧасов",
		Элементы.НачисленияУдержанияОтработаноЧасов.Имя, НСтр("ru = 'Часов'"));

	ТипыСчетовПрочие = Новый СписокЗначений;
	ТипыСчетовПрочие.Добавить(Перечисления.ТипыСчетов.ПрочиеДоходы);
	ТипыСчетовПрочие.Добавить(Перечисления.ТипыСчетов.ПрочиеРасходы);
	ТипыСчетовПрочие.Добавить(Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"Объект.НачисленияУдержания.ТипСчета", ТипыСчетовПрочие, ВидСравненияКомпоновкиДанных.ВСписке);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление,
		Элементы.НачисленияУдержанияЗаказ.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление,
		Элементы.НачисленияУдержанияНаправлениеДеятельности.Имя);
	УстановитьОформлениеНеЗаполняется(НовоеУсловноеОформление);

	ДобавитьУсловноеОформлениеНезаполненного("Объект.НачисленияУдержания.СчетЗатрат",
		Элементы.НачисленияУдержанияСчетЗатрат.Имя, НСтр("ru = 'Счет затрат'"));
	ДобавитьУсловноеОформлениеНезаполненного("Объект.НачисленияУдержания.Проект",
		Элементы.НачисленияУдержанияПроект.Имя, НСтр("ru = 'Проект'"));
		
	НовоеУсловноеОформление = ДобавитьУсловноеОформлениеНезаполненного(
		"Объект.НачисленияУдержания.НаправлениеДеятельности", Элементы.НачисленияУдержанияНаправлениеДеятельности.Имя,
		НСтр("ru = 'Направление деятельности'"));
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"Объект.НачисленияУдержания.ТипСчета", ТипыСчетовПрочие, ВидСравненияКомпоновкиДанных.НеВСписке);
		
	НовоеУсловноеОформление = ДобавитьУсловноеОформлениеНезаполненного(
		"Объект.НачисленияУдержания.ЗаказПокупателя", Элементы.НачисленияУдержанияЗаказ.Имя,
		НСтр("ru = 'Заказ покупателя'"));
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"Объект.НачисленияУдержания.ТипСчета", ТипыСчетовПрочие, ВидСравненияКомпоновкиДанных.НеВСписке);
		
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"Объект.Взносы.ТипСчета", ТипыСчетовПрочие, ВидСравненияКомпоновкиДанных.ВСписке);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление,
		Элементы.СтраховыеВзносыЗаказПокупателя.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, Элементы.СтраховыеВзносыНаправлениеДеятельности.Имя);
	УстановитьОформлениеНеЗаполняется(НовоеУсловноеОформление);

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"Объект.НачисленияУдержания.ВидНачисленияУдержания", Справочники.ВидыНачисленийИУдержаний.ПремияЗаПродажи,
			ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, Элементы.НачисленияУдержанияСумма.Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"Объект.НачисленияУдержания.ВидНачисленияУдержания", Справочники.ВидыНачисленийИУдержаний.ПремияЗаПродажи,
			ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, Элементы.НачисленияУдержанияСуммаСРасшифровкой.Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"Объект.НачисленияУдержания.НомерСтроки", Неопределено, ВидСравненияКомпоновкиДанных.Заполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, Элементы.НачисленияУдержанияТарифТекст.Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = 'Размер'"));

КонецПроцедуры

&НаСервере
Функция ДобавитьУсловноеОформлениеНезаполненного(Знач ПолеДанных, Знач ИмяЭлемента, Знач ТекстПусто = "")

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ПолеДанных, Неопределено,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяЭлемента);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление,
		"ЦветТекста", ЦветаПалитры.НедоступныеДанныеЦветУНФ);
	Если ЗначениеЗаполнено(ТекстПусто) Тогда
		РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", ТекстПусто);
	КонецЕсли;

	Возврат НовоеУсловноеОформление;
	
КонецФункции

&НаСервере
Процедура УстановитьОформлениеНеЗаполняется(ЭлементУсловногоОформления)

	РаботаСФормой.ДобавитьЭлементУсловногоОформления(ЭлементУсловногоОформления,
		"ЦветТекста", ЦветаПалитры.НедоступныеДанныеЦветУНФ);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(ЭлементУсловногоОформления,
		"Текст", НСтр("ru = '<Не заполняется>'"));
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(ЭлементУсловногоОформления,
		"Доступность", Ложь);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	СвойствоВидимость = "Видимость";
	
	Если Не Константы.ФункциональнаяОпцияИспользоватьСовместительство.Получить() Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияУдержанияСотрудникКод",
																	СвойствоВидимость, Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НалогиНаДоходыСотрудникКод",
																	СвойствоВидимость, Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраховыеВзносыСотрудникКод",
																	СвойствоВидимость, Ложь);
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаПогашениеЗаймов", СвойствоВидимость,
																ПолучитьФункциональнуюОпцию("КредитыИЗаймы"));
	
	ВидимостьКолонок = Объект.ПериодРегистрации >= УчетНДФЛ.ДатаЗакона176ФЗ();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НДФЛГруппаКолонокПоПрогрессивнымСтавкам",
																СвойствоВидимость, ВидимостьКолонок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НалогиНаДоходыСуммаСПревышения",
																СвойствоВидимость, НЕ ВидимостьКолонок);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыОрганизацииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Ответ = Результат;

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПроверкаДанныхКлиент.ПровестиРасшифровку(ДополнительныеПараметры.Расшифровка, Объект.Организация);
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;

	РассчитыватьБезВзносов = Истина;
	Если ДополнительныеПараметры.ПроцедураВыполнения = "ЗаполнитьПоПодразделению" Тогда
		ЗаполнитьПоПодразделению();
	ИначеЕсли ДополнительныеПараметры.ПроцедураВыполнения = "РассчитатьПоФормуламИНалогиИВзносы" Тогда
		РассчитатьПоФормуламИНалогиИВзносы();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Ответ = Результат;

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗаполненыТарифыВзносов("ЗаполнитьПоПодразделению") Тогда
		ЗаполнитьПоПодразделению();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.НачисленияУдержания.Очистить();
		Объект.НалогиНаДоходы.Очистить();
		Объект.ПогашениеЗаймов.Очистить();
	КонецЕсли;
	ВалютаДокументаПриИзмененииФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзмененииФрагмент()

	ВалютаДокумента = Объект.ВалютаДокумента;

КонецПроцедуры // ВалютаДокументаПриИзменении()

&НаСервере
Функция НачатьЗамерВремени()

	Возврат ?(ВыполнятьЗамерыПроизводительности, ОценкаПроизводительности.НачатьЗамерВремени(), Неопределено);

КонецФункции

&НаСервере
Процедура ЗакончитьЗамерВремени(НачалоЗамера, ИмяКлючевойОперации, Комментарий = "")

	Если ВыполнятьЗамерыПроизводительности Тогда

		ОценкаПроизводительности.ЗакончитьЗамерВремени(ИмяКлючевойОперации, НачалоЗамера, , Комментарий);

	КонецЕсли;

КонецПроцедуры

// Заполняет таблицу показателей параметрами на основе вида начисления или удержания.
//
// Параметры:
//   СтруктураДанных - Структура - Содержит данные для расчета показателей
//
// Возвращаемое значение:
//   Структура - Содержит показатели и их значения
&НаСервере
Функция ЗаполнитьПоказатели(СтруктураДанных)

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Показатель1", "");
	СтруктураВозврата.Вставить("Представление1", Справочники.ПоказателиРасчетов.ПустаяСсылка());
	СтруктураВозврата.Вставить("Значение1", 0);
	СтруктураВозврата.Вставить("Показатель2", "");
	СтруктураВозврата.Вставить("Представление2", Справочники.ПоказателиРасчетов.ПустаяСсылка());
	СтруктураВозврата.Вставить("Значение2", 0);
	СтруктураВозврата.Вставить("Показатель3", "");
	СтруктураВозврата.Вставить("Представление3", Справочники.ПоказателиРасчетов.ПустаяСсылка());
	СтруктураВозврата.Вставить("Значение3", 0);
	СтруктураВозврата.Вставить("СчетЗатрат", Неопределено);

	Если Не ЗначениеЗаполнено(СтруктураДанных.Сотрудник) Или Не ЗначениеЗаполнено(
		СтруктураДанных.ВидНачисленияУдержания) Тогда

		Возврат СтруктураВозврата;

	КонецЕсли;

	ФормулаРасчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанных.ВидНачисленияУдержания, "Формула");
	Если ФормулаРасчета = Неопределено Тогда
		ФормулаРасчета = "";
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	ЗарплатаУНФВызовСервера.ДобавитьПараметрыВСтруктуру(ФормулаРасчета,	СтруктураПараметров);

	Счетчик = 0;
	Для Каждого ПараметрСтруктуры Из СтруктураПараметров Цикл

		Если ПараметрСтруктуры.Ключ = "ОтработаноДней" Или ПараметрСтруктуры.Ключ = "ОтработаноЧасов"
			Или ПараметрСтруктуры.Ключ = "ТарифнаяСтавка" Тогда

			Продолжить;

		КонецЕсли;

		ПараметрРасчета = Справочники.ПоказателиРасчетов.НайтиПоРеквизиту("Идентификатор", ПараметрСтруктуры.Ключ);
		Если Не ЗначениеЗаполнено(ПараметрРасчета) Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(НСтр("ru = 'Не найден параметр %1 для формулы начисления (удержания) %2'"),
				ПараметрРасчета, СтруктураДанных.ВидНачисленияУдержания);
			Сообщение.Сообщить();
			Продолжить;

		КонецЕсли;

		Счетчик = Счетчик + 1;

		Если Счетчик > 3 Тогда

			Прервать;

		КонецЕсли;

		СтруктураВозврата["Показатель" + Счетчик] = ПараметрСтруктуры.Ключ;
		СтруктураВозврата["Представление" + Счетчик] = ПараметрРасчета;

	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоМесяца", СтруктураДанных.НачалоМесяца);
	Запрос.УстановитьПараметр("Организация", СтруктураДанных.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктураДанных.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Валюта", СтруктураДанных.Валюта);
	Запрос.УстановитьПараметр("Сотрудник", СтруктураДанных.Сотрудник);
	Запрос.УстановитьПараметр("ВидНачисленияУдержания", СтруктураДанных.ВидНачисленияУдержания);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ СотрудникиПодразделенияНаНачалоМесяца
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&НачалоМесяца,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СотрудникиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПлановыеНачисленияИУдержания.СчетЗатрат, НЕОПРЕДЕЛЕНО) КАК СчетЗатрат
	|ИЗ
	|	СотрудникиПодразделенияНаНачалоМесяца КАК СотрудникиПодразделенияНаНачалоМесяца
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
	|				&НачалоМесяца,
	|				Организация = &Организация
	|					И Сотрудник = &Сотрудник
	|					И ВидНачисленияУдержания = &ВидНачисленияУдержания
	|					И Валюта = &Валюта
	|					И ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата)
	|					И ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент)
	|					И ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма)) КАК ПлановыеНачисленияИУдержания
	|		ПО СотрудникиПодразделенияНаНачалоМесяца.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник";

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда

			СтруктураВозврата.Вставить("СчетЗатрат", Выборка.СчетЗатрат);

		КонецЕсли;

	КонецЕсли;

	Возврат СтруктураВозврата;

КонецФункции // ЗаполнитьПоказатели()

&НаСервере
Функция СформироватьТаблицуНачислений()

	ТаблицаНачислений = Новый ТаблицаЗначений;

	ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
	ТаблицаНачислений.Колонки.Добавить("Сотрудник", ОписаниеТипов);

	ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.Должности");
	ТаблицаНачислений.Колонки.Добавить("Должность", ОписаниеТипов);

	ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ВидыНачисленийИУдержаний");
	ТаблицаНачислений.Колонки.Добавить("ВидНачисленияУдержания", ОписаниеТипов);

	ОписаниеТипов = Новый ОписаниеТипов("Дата");
	ТаблицаНачислений.Колонки.Добавить("ДатаНачала", ОписаниеТипов);
	ТаблицаНачислений.Колонки.Добавить("ДатаОкончания", ОписаниеТипов);

	ОписаниеТипов = Новый ОписаниеТипов("ПланСчетовСсылка.Управленческий");
	ТаблицаНачислений.Колонки.Добавить("СчетЗатрат", ОписаниеТипов);

	ОписаниеТипов = Новый ОписаниеТипов("Число");
	ТаблицаНачислений.Колонки.Добавить("Размер", ОписаниеТипов);

	ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ГрафикиРаботы");
	ТаблицаНачислений.Колонки.Добавить("ГрафикРаботы", ОписаниеТипов);

	Для Каждого СтрокаТЧ Из Объект.НачисленияУдержания Цикл

		НоваяСтрока = ТаблицаНачислений.Добавить();
		НоваяСтрока.Сотрудник = СтрокаТЧ.Сотрудник;
		НоваяСтрока.Должность = СтрокаТЧ.Должность;
		НоваяСтрока.ВидНачисленияУдержания = СтрокаТЧ.ВидНачисленияУдержания;
		НоваяСтрока.ДатаНачала = СтрокаТЧ.ДатаНачала;
		НоваяСтрока.ДатаОкончания = СтрокаТЧ.ДатаОкончания;
		НоваяСтрока.СчетЗатрат = СтрокаТЧ.СчетЗатрат;
		НоваяСтрока.Размер = СтрокаТЧ.Размер;
		НоваяСтрока.ГрафикРаботы = СтрокаТЧ.ГрафикРаботы;

	КонецЦикла;

	Возврат ТаблицаНачислений;

КонецФункции // СформироватьТаблицуНачислений()

&НаСервере
// Процедура заполняет табличную часть "Сотрудники" с отбором по подразделению.
//
Процедура ЗаполнитьПоПодразделению()
	Перем НачалоЗамераПодразделение, НачалоЗамераПараметр;

	НачалоЗамераПодразделение = НачатьЗамерВремени();

	Объект.НачисленияУдержания.Очистить();
	Объект.НалогиНаДоходы.Очистить();
	Объект.Взносы.Очистить();

	КорректныеТипыСчетовНачислений = Новый Массив(6);
	КорректныеТипыСчетовНачислений[0] = Перечисления.ТипыСчетов.КосвенныеЗатраты;
	КорректныеТипыСчетовНачислений[1] = Перечисления.ТипыСчетов.Расходы;
	КорректныеТипыСчетовНачислений[2] = Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы;
	КорректныеТипыСчетовНачислений[3] = Перечисления.ТипыСчетов.НезавершенноеПроизводство;
	КорректныеТипыСчетовНачислений[4] = Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы;

	Запрос = Новый Запрос;

	Запрос.Параметры.Вставить("НачалоМесяца", Объект.ПериодРегистрации);
	Запрос.Параметры.Вставить("ОкончаниеМесяца", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.Параметры.Вставить("Организация", Константы.УчетПоКомпании.Компания(Объект.Организация));
	Запрос.Параметры.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.Параметры.Вставить("Валюта", Объект.ВалютаДокумента);
		
	// 1. Определяем интересующих сотрудников	
	// 2. Определяем все движения интересующих сотрудников и начисления в нужном подразделении.
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ СотрудникиПодразделения
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиСрезПоследних.Сотрудник КАК Сотрудник
	|	ИЗ
	|		РегистрСведений.Сотрудники.СрезПоследних(&НачалоМесяца, Организация = &Организация) КАК СотрудникиСрезПоследних
	|	ГДЕ
	|		СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Сотрудники.Сотрудник
	|	ИЗ
	|		РегистрСведений.Сотрудники КАК Сотрудники
	|	ГДЕ
	|		Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		И Сотрудники.Период МЕЖДУ &НачалоМесяца И &ОкончаниеМесяца
	|		И Сотрудники.Организация = &Организация) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Должность КАК Должность,
	|	ПлановыеНачисленияИУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ПлановыеНачисленияИУдержания.Сумма КАК Сумма,
	|	ПлановыеНачисленияИУдержания.СчетЗатрат КАК СчетЗатрат,
	|	ПлановыеНачисленияИУдержания.Актуальность КАК Актуальность,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ДругоеПодразделениеУвольнение КАК ДругоеПодразделениеУвольнение,
	|	ВложенныйЗапрос.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ДвиженияСотрудники
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиПодразделения.Сотрудник КАК Сотрудник,
	|		Сотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		Сотрудники.Должность КАК Должность,
	|		МАКСИМУМ(ПлановыеНачисленияИУдержания.Период) КАК ПериодНачисления,
	|		Сотрудники.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК ДругоеПодразделениеУвольнение,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержания.Валюта КАК Валюта,
	|		Сотрудники.ГрафикРаботы КАК ГрафикРаботы
	|	ИЗ
	|		СотрудникиПодразделения КАК СотрудникиПодразделения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК Сотрудники
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
	|				ПО Сотрудники.Организация = ПлановыеНачисленияИУдержания.Организация
	|					И Сотрудники.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|					И Сотрудники.Период >= ПлановыеНачисленияИУдержания.Период
	|					И (Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	|					И (ПлановыеНачисленияИУдержания.Валюта = &Валюта)
	|					И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата))
	|					И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент))
	|					И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма))
	|			ПО СотрудникиПодразделения.Сотрудник = Сотрудники.Сотрудник
	|	ГДЕ
	|		Сотрудники.Организация = &Организация
	|		И Сотрудники.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоМесяца, ДЕНЬ, 1) И &ОкончаниеМесяца
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Сотрудники.СтруктурнаяЕдиница,
	|		СотрудникиПодразделения.Сотрудник,
	|		Сотрудники.Должность,
	|		Сотрудники.Период,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержания.Валюта,
	|		ВЫБОР
	|			КОГДА Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ,
	|		Сотрудники.ГрафикРаботы) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
	|		ПО ВложенныйЗапрос.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|			И (ПлановыеНачисленияИУдержания.Валюта = &Валюта)
	|			И (ПлановыеНачисленияИУдержания.Организация = &Организация)
	|			И ВложенныйЗапрос.ПериодНачисления = ПлановыеНачисленияИУдержания.Период
	|			И ВложенныйЗапрос.ВидНачисленияУдержания = ПлановыеНачисленияИУдержания.ВидНачисленияУдержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ВложенныйЗапрос.Сумма КАК Сумма,
	|	ВложенныйЗапрос.СчетЗатрат КАК СчетЗатрат,
	|	ВложенныйЗапрос.Актуальность КАК Актуальность,
	|	Сотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Сотрудники.Должность КАК Должность,
	|	Сотрудники.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ДвиженияПлановыеНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПлановыеНачисленияИУдержания.Сотрудник КАК Сотрудник,
	|		ПлановыеНачисленияИУдержания.Период КАК Период,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержания.Сумма КАК Сумма,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияИУдержания.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|				ТОГДА ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.СчетЗатрат
	|			ИНАЧЕ ПлановыеНачисленияИУдержания.СчетЗатрат
	|		КОНЕЦ КАК СчетЗатрат,
	|		ПлановыеНачисленияИУдержания.Актуальность КАК Актуальность,
	|		МАКСИМУМ(Сотрудники.Период) КАК ПериодСотрудники
	|	ИЗ
	|		СотрудникиПодразделения КАК СотрудникиПодразделения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК Сотрудники
	|				ПО ПлановыеНачисленияИУдержания.Сотрудник = Сотрудники.Сотрудник
	|					И ПлановыеНачисленияИУдержания.Период >= Сотрудники.Период
	|					И (Сотрудники.Организация = &Организация)
	|			ПО СотрудникиПодразделения.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|				И (ПлановыеНачисленияИУдержания.Валюта = &Валюта)
	|				И (ПлановыеНачисленияИУдержания.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоМесяца, ДЕНЬ, 1) И &ОкончаниеМесяца)
	|				И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата))
	|				И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент))
	|				И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма))
	|				И (ПлановыеНачисленияИУдержания.Организация = &Организация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПлановыеНачисленияИУдержания.Актуальность,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияИУдержания.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|				ТОГДА ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.СчетЗатрат
	|			ИНАЧЕ ПлановыеНачисленияИУдержания.СчетЗатрат
	|		КОНЕЦ,
	|		ПлановыеНачисленияИУдержания.Период,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержания.Сотрудник,
	|		ПлановыеНачисленияИУдержания.Сумма) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК Сотрудники
	|		ПО ВложенныйЗапрос.ПериодСотрудники = Сотрудники.Период
	|			И (Сотрудники.Организация = &Организация)
	|			И ВложенныйЗапрос.Сотрудник = Сотрудники.Сотрудник
	|ГДЕ
	|	Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Должность КАК Должность,
	|	ВложенныйЗапрос.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ВложенныйЗапрос.Размер КАК Размер,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ТОГДА 0
	|		КОГДА ВложенныйЗапрос.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ДругоеПодразделениеУвольнение,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНалог,
	|	ВложенныйЗапрос.ГрафикРаботы КАК ГрафикРаботы,
	|	ВложенныйЗапрос.СчетЗатрат КАК СчетЗатрат,
	|	ВложенныйЗапрос.Актуальность КАК Актуальность,
	|	ВложенныйЗапрос.ДатаДействияНачало КАК ДатаДействияНачало
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиПодразделения.Сотрудник КАК Сотрудник,
	|		СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		СотрудникиСрезПоследних.Должность КАК Должность,
	|		ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержанияСрезПоследних.Сумма КАК Размер,
	|		&НачалоМесяца КАК ДатаДействияНачало,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|				ТОГДА ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания.СчетЗатрат
	|			ИНАЧЕ ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатрат
	|		КОНЕЦ КАК СчетЗатрат,
	|		ИСТИНА КАК Актуальность,
	|		СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
	|	ИЗ
	|		СотрудникиПодразделения КАК СотрудникиПодразделения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(&НачалоМесяца, Организация = &Организация) КАК СотрудникиСрезПоследних
	|			ПО СотрудникиПодразделения.Сотрудник = СотрудникиСрезПоследних.Сотрудник
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
	|					&НачалоМесяца,
	|					Организация = &Организация
	|						И Валюта = &Валюта) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	|			ПО СотрудникиПодразделения.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
	|	ГДЕ
	|		ПлановыеНачисленияИУдержанияСрезПоследних.Актуальность
	|		И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата)
	|		И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент)
	|		И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма)
	|		И СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПлановыеНачисленияИУдержания.Сотрудник,
	|		ПлановыеНачисленияИУдержания.СтруктурнаяЕдиница,
	|		ПлановыеНачисленияИУдержания.Должность,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержания.Сумма,
	|		ПлановыеНачисленияИУдержания.Период,
	|		ПлановыеНачисленияИУдержания.СчетЗатрат,
	|		ПлановыеНачисленияИУдержания.Актуальность,
	|		ЕСТЬNULL(Сотрудники.ГрафикРаботы, ПлановыеНачисленияИУдержания.ГрафикРаботы)
	|	ИЗ
	|		ДвиженияСотрудники КАК Сотрудники
	|			ПОЛНОЕ СОЕДИНЕНИЕ ДвиженияПлановыеНачисления КАК ПлановыеНачисленияИУдержания
	|			ПО Сотрудники.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|				И Сотрудники.Период = ПлановыеНачисленияИУдержания.Период
	|				И Сотрудники.ВидНачисленияУдержания = ПлановыеНачисленияИУдержания.ВидНачисленияУдержания) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник
	|ИТОГИ ПО
	|	Сотрудник";

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// 3. Определяем даты окончания периодов, заполняем таблицу значений.

	КонецМесяца = НачалоДня(КонецМесяца(Объект.ПериодРегистрации));
	ЭтоРасчетПодразделения = (Перечисления.ТипыСтруктурныхЕдиниц.Подразделение
		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтруктурнаяЕдиница, "ТипСтруктурнойЕдиницы"));
	ВыборкаСотрудник = МассивРезультатов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сотрудник");
	Пока ВыборкаСотрудник.Следующий() Цикл

		Если Не ЗначениеЗаполнено(ВыборкаСотрудник.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;

		Выборка = ВыборкаСотрудник.Выбрать();

		Пока Выборка.Следующий() Цикл

			Если Выборка.ДругоеПодразделениеУвольнение Тогда
				ЗаменитьДатуМассив = Объект.НачисленияУдержания.НайтиСтроки(Новый Структура("ДатаОкончания, Сотрудник",
					КонецМесяца, Выборка.Сотрудник));
				Для Каждого ЭлементМассива Из ЗаменитьДатуМассив Цикл
					ЭлементМассива.ДатаОкончания = Выборка.ДатаДействияНачало - ?(Выборка.ДругоеПодразделениеУвольнение
						= 1, 60 * 60 * 24, 0);
				КонецЦикла;
				Продолжить;
			КонецЕсли;

			ЗаменитьДатуМассив = Объект.НачисленияУдержания.НайтиСтроки(
				Новый Структура("ДатаОкончания, Сотрудник, ВидНачисленияУдержания", КонецМесяца, Выборка.Сотрудник,
				Выборка.ВидНачисленияУдержания));
			Для Каждого ЭлементМассива Из ЗаменитьДатуМассив Цикл
				ЭлементМассива.ДатаОкончания = Выборка.ДатаДействияНачало - 60 * 60 * 24;
			КонецЦикла;

			Если ЗначениеЗаполнено(Выборка.ВидНачисленияУдержания) И Выборка.Актуальность Тогда

				Если Выборка.ЭтоНалог Тогда

					НоваяСтрока							= Объект.НалогиНаДоходы.Добавить();
					НоваяСтрока.Сотрудник 				= Выборка.Сотрудник;
					НоваяСтрока.ВидНачисленияУдержания 	= Выборка.ВидНачисленияУдержания;

				Иначе

					НоваяСтрока							= Объект.НачисленияУдержания.Добавить();
					НоваяСтрока.Сотрудник 				= Выборка.Сотрудник;
					НоваяСтрока.Должность 				= Выборка.Должность;

					НоваяСтрока.ВидНачисленияУдержания 	= Выборка.ВидНачисленияУдержания;
					НоваяСтрока.ДатаНачала 				= Выборка.ДатаДействияНачало;
					НоваяСтрока.ДатаОкончания 			= КонецМесяца;
					НоваяСтрока.Размер 					= Выборка.Размер;
					НоваяСтрока.ГрафикРаботы 			= Выборка.ГрафикРаботы;

					ТипСчета = Выборка.СчетЗатрат.ТипСчета;

					СчетНачисленияУдержанияУказанСОшибкой = Ложь;
					Если Выборка.ВидНачисленияУдержания.Тип = Перечисления.ТипыНачисленийИУдержаний.Начисление Тогда

						СчетНачисленияУдержанияУказанСОшибкой = (КорректныеТипыСчетовНачислений.Найти(ТипСчета)
							= Неопределено);

					ИначеЕсли Выборка.ВидНачисленияУдержания.Тип = Перечисления.ТипыНачисленийИУдержаний.Удержание Тогда

						СчетНачисленияУдержанияУказанСОшибкой = (ТипСчета <> Перечисления.ТипыСчетов.ПрочиеДоходы);

					ИначеЕсли Выборка.ВидНачисленияУдержания.Тип = Перечисления.ТипыНачисленийИУдержаний.Налог Тогда

						СчетНачисленияУдержанияУказанСОшибкой = (ТипСчета <> Перечисления.ТипыСчетов.Кредиторы);

					КонецЕсли;

					Если ЭтоРасчетПодразделения И СчетНачисленияУдержанияУказанСОшибкой Тогда

						НоваяСтрока.СчетЗатрат = ПланыСчетов.Управленческий.ПустаяСсылка();

					Иначе

						НоваяСтрока.СчетЗатрат = Выборка.СчетЗатрат;

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;
	
	// 4. Заполняем отработанное время

	Запрос.Параметры.Вставить("ТаблицаНачисленияУдержания", СформироватьТаблицуНачислений());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	ТаблицаНачисленияУдержания.Должность КАК Должность,
	|	ТаблицаНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ТаблицаНачисленияУдержания.ДатаНачала КАК ДатаНачала,
	|	ТаблицаНачисленияУдержания.ДатаОкончания КАК ДатаОкончания,
	|	ТаблицаНачисленияУдержания.Размер КАК Размер,
	|	ТаблицаНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаНачисленияУдержания.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ТаблицаНачисленияУдержания
	|ИЗ
	|	&ТаблицаНачисленияУдержания КАК ТаблицаНачисленияУдержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументНачисление.Сотрудник КАК Сотрудник,
	|	ДокументНачисление.Должность КАК Должность,
	|	ДокументНачисление.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ДокументНачисление.ДатаНачала КАК ДатаНачала,
	|	ДокументНачисление.ДатаОкончания КАК ДатаОкончания,
	|	ДокументНачисление.Размер КАК Размер,
	|	ДокументНачисление.СчетЗатрат КАК СчетЗатрат,
	|	ДанныеТабеля.ОтработаноДней КАК ОтработаноДней,
	|	ДанныеТабеля.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ЕСТЬNULL(ДанныеТабеля.ВЦеломЗаПериод, ЛОЖЬ) КАК ВЦеломЗаПериод,
	|	ДокументНачисление.ГрафикРаботы КАК ГрафикРаботы
	|ИЗ
	|	ТаблицаНачисленияУдержания КАК ДокументНачисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДокументНачисление.Сотрудник КАК Сотрудник,
	|			СУММА(Табель.Дней) КАК ОтработаноДней,
	|			СУММА(Табель.Часов) КАК ОтработаноЧасов,
	|			ДокументНачисление.ДатаНачала КАК ДатаНачала,
	|			ДокументНачисление.ДатаОкончания КАК ДатаОкончания,
	|			МАКСИМУМ(Табель.ВЦеломЗаПериод) КАК ВЦеломЗаПериод
	|		ИЗ
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ДокументНачисление.Сотрудник КАК Сотрудник,
	|				ДокументНачисление.ДатаНачала КАК ДатаНачала,
	|				ДокументНачисление.ДатаОкончания КАК ДатаОкончания
	|			ИЗ
	|				ТаблицаНачисленияУдержания КАК ДокументНачисление) КАК ДокументНачисление
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Табель КАК Табель
	|				ПО ДокументНачисление.Сотрудник = Табель.Сотрудник
	|					И (Табель.ВидВремени = ЗНАЧЕНИЕ(Справочник.ВидыРабочегоВремени.Работа))
	|					И (Табель.Организация = &Организация)
	|					И (Табель.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	|					И (НЕ Табель.ВЦеломЗаПериод
	|							И ДокументНачисление.ДатаНачала <= Табель.Период
	|							И ДокументНачисление.ДатаОкончания >= Табель.Период
	|						ИЛИ Табель.ВЦеломЗаПериод
	|							И Табель.Период = НАЧАЛОПЕРИОДА(ДокументНачисление.ДатаНачала, МЕСЯЦ))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДокументНачисление.Сотрудник,
	|			ДокументНачисление.ДатаНачала,
	|			ДокументНачисление.ДатаОкончания) КАК ДанныеТабеля
	|		ПО ДокументНачисление.Сотрудник = ДанныеТабеля.Сотрудник
	|			И ДокументНачисление.ДатаНачала = ДанныеТабеля.ДатаНачала
	|			И ДокументНачисление.ДатаОкончания = ДанныеТабеля.ДатаОкончания";

	РезультатЗапроса = Запрос.ВыполнитьПакет()[1].Выгрузить();
	Объект.НачисленияУдержания.Загрузить(РезультатЗапроса);

	Объект.НачисленияУдержания.Сортировать("Сотрудник Возр, ДатаНачала Возр, ВидНачисленияУдержания Возр");

	ФормулыНачислений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		РезультатЗапроса.ВыгрузитьКолонку("ВидНачисленияУдержания"), "Формула");
	
	ЗапросПараметровРасчета = Новый Запрос;
	ЗапросПараметровРасчета.Текст = "ВЫБРАТЬ
	|	ПоказателиРасчетов.Ссылка КАК Ссылка,
	|	ПоказателиРасчетов.Идентификатор КАК Идентификатор,
	|	ПоказателиРасчетов.ТипПоказателяРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейРасчета.Ручной) КАК ЭтоРучнойРасчет
	|ИЗ
	|	Справочник.ПоказателиРасчетов КАК ПоказателиРасчетов";
	Выборка = ЗапросПараметровРасчета.Выполнить().Выбрать();
	ВсеПараметрыРасчета = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Данные = Новый Структура;
		Данные.Вставить("ПараметрРасчета", Выборка.Ссылка);
		Данные.Вставить("Идентификатор", Выборка.Идентификатор);
		Данные.Вставить("ЭтоРучнойРасчет", Выборка.ЭтоРучнойРасчет);
		ВсеПараметрыРасчета.Вставить(Выборка.Идентификатор, Данные);
	КонецЦикла;
		
	Для Каждого СтрокаТабличнойЧасти Из Объект.НачисленияУдержания Цикл
		
		// 1. Проверка
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидНачисленияУдержания) Тогда
			Продолжить;
		КонецЕсли;
		МассивПовторов = РезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник, ВидНачисленияУдержания",
			СтрокаТабличнойЧасти.Сотрудник, СтрокаТабличнойЧасти.ВидНачисленияУдержания));
		Если МассивПовторов.Количество() > 1 И МассивПовторов[0].ВЦеломЗаПериод Тогда

			СтрокаТабличнойЧасти.ОтработаноДней = 0;
			СтрокаТабличнойЧасти.ОтработаноЧасов = 0;

			ТекстСообщения = СтрШаблон(НСтр(
				"ru = '%1, %2: Данные об отработанном времени введены сводно. Расчет времени по каждому виду начисления (удержания) невозможен.'"),
				СтрокаТабличнойЧасти.Сотрудник, СтрокаТабличнойЧасти.ВидНачисленияУдержания);
			КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.НачисленияУдержания",
				СтрокаТабличнойЧасти.НомерСтроки, "Сотрудник");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , КонтекстноеПоле);

		КонецЕсли;
		
		// 2. Очистка
		Для Счетчик = 1 По 3 Цикл

			СтрокаТабличнойЧасти["Показатель" + Счетчик] = "";
			СтрокаТабличнойЧасти["Представление" + Счетчик] = Справочники.ПоказателиРасчетов.ПустаяСсылка();
			СтрокаТабличнойЧасти["Значение" + Счетчик] = 0;

		КонецЦикла;
		
		// 3. Поиск всех параметров-идентификаторов формулы
		СтруктураПараметров = Новый Структура;
		ЗарплатаУНФВызовСервера.ДобавитьПараметрыВСтруктуру(ФормулыНачислений.Получить(СтрокаТабличнойЧасти.ВидНачисленияУдержания),
			СтруктураПараметров);

		Если СтрокаТабличнойЧасти.ВидНачисленияУдержания = Справочники.ВидыНачисленийИУдержаний.ПремияЗаПродажи Тогда
			СтруктураПараметровРасчетаПремийПродавцам = Новый Структура;
			СтруктураПараметровРасчетаПремийПродавцам.Вставить("Организация", Объект.Организация);
			СтруктураПараметровРасчетаПремийПродавцам.Вставить("Подразделение", Объект.СтруктурнаяЕдиница);
			СтруктураПараметровРасчетаПремийПродавцам.Вставить("Сотрудник", СтрокаТабличнойЧасти.Сотрудник);
			СтруктураПараметровРасчетаПремийПродавцам.Вставить("ДатаПолученияПравил", НачалоДня(КонецМесяца(
				Объект.ПериодРегистрации)));
			СтруктураПараметровРасчетаПремийПродавцам.Вставить("НачалоПериода", НачалоМесяца(Объект.ПериодРегистрации));
			СтруктураПараметровРасчетаПремийПродавцам.Вставить("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));

			СтрокаТабличнойЧасти.Сумма = ЗарплатаИПерсоналСервер.РассчитатьСуммуПремииПоЛичнымПродажам(
				СтруктураПараметровРасчетаПремийПродавцам);

		Иначе
			
			// 4. Добавление показателя
			Счетчик = 0;
			Для Каждого ПараметрСтруктуры Из СтруктураПараметров Цикл

				Если ПараметрСтруктуры.Ключ = "ОтработаноДней" Или ПараметрСтруктуры.Ключ = "ОтработаноЧасов"
					Или ПараметрСтруктуры.Ключ = "ТарифнаяСтавка" Тогда

					Продолжить;

				КонецЕсли;

				ДанныеПараметра = ВсеПараметрыРасчета.Получить(ПараметрСтруктуры.Ключ);
				ПараметрРасчета = ДанныеПараметра.ПараметрРасчета;
				Если Не ЗначениеЗаполнено(ПараметрРасчета) Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон(НСтр("ru = 'Не найден параметр %1 для сотрудника в строке № %2'"),
						ПараметрРасчета, Объект.НачисленияУдержания.Индекс(СтрокаТабличнойЧасти) + 1);
					Сообщение.Сообщить();
				КонецЕсли;

				Счетчик = Счетчик + 1;

				Если Счетчик > 3 Тогда
					Прервать;
				КонецЕсли;

				СтрокаТабличнойЧасти["Показатель" + Счетчик] = ПараметрСтруктуры.Ключ;
				СтрокаТабличнойЧасти["Представление" + Счетчик] = ПараметрРасчета;

				Если ДанныеПараметра.ЭтоРучнойРасчет Тогда
					Продолжить;
				КонецЕсли; 
				
				// 5. Расчет показателя
				
				ДанныеСотрудника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТабличнойЧасти.Сотрудник,
					"Код, ТипЗанятости, ФизЛицо" );

				СтруктураОтборов = Новый Структура;
				СтруктураОтборов.Вставить("ПериодРегистрации", Объект.ПериодРегистрации);
				СтруктураОтборов.Вставить("Организация", Константы.УчетПоКомпании.Компания(Объект.Организация));
				СтруктураОтборов.Вставить("Валюта", Объект.ВалютаДокумента);
				СтруктураОтборов.Вставить("Подразделение", Объект.СтруктурнаяЕдиница);
				СтруктураОтборов.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
				СтруктураОтборов.Вставить("МоментВремени", КонецДня(СтрокаТабличнойЧасти.ДатаОкончания));
				СтруктураОтборов.Вставить("НачалоПериода", СтрокаТабличнойЧасти.ДатаНачала);
				СтруктураОтборов.Вставить("КонецПериода", КонецДня(СтрокаТабличнойЧасти.ДатаОкончания));
				СтруктураОтборов.Вставить("Сотрудник", СтрокаТабличнойЧасти.Сотрудник);
				СтруктураОтборов.Вставить("Ответственный", СтрокаТабличнойЧасти.Сотрудник);
				СтруктураОтборов.Вставить("ТипЗанятости", ДанныеСотрудника.ТипЗанятости);
				СтруктураОтборов.Вставить("ТабельныйНомер", ДанныеСотрудника.Код);
				СтруктураОтборов.Вставить("ТабНомер", ДанныеСотрудника.Код);
				СтруктураОтборов.Вставить("Исполнитель", СтрокаТабличнойЧасти.Сотрудник);
				СтруктураОтборов.Вставить("ФизЛицо", ДанныеСотрудника.Физлицо);
				СтруктураОтборов.Вставить("ФизическоеЛицо", ДанныеСотрудника.Физлицо);
				СтруктураОтборов.Вставить("Должность", СтрокаТабличнойЧасти.Должность);
				СтруктураОтборов.Вставить("ВидНачисленияУдержания", СтрокаТабличнойЧасти.ВидНачисленияУдержания);
				СтруктураОтборов.Вставить("ЗаказПокупателя", СтрокаТабличнойЧасти.ЗаказПокупателя);
				СтруктураОтборов.Вставить("Заказ", СтрокаТабличнойЧасти.ЗаказПокупателя);
				СтруктураОтборов.Вставить("Проект", Справочники.Проекты.ПустаяСсылка());
				Если ЗначениеЗаполнено(СтруктураОтборов.Заказ) Тогда
					СтруктураОтборов.Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураОтборов.Заказ, "Проект");
				КонецЕсли;
				СтруктураОтборов.Вставить("СчетЗатрат", СтрокаТабличнойЧасти.СчетЗатрат);
				СтруктураОтборов.Вставить("НаправлениеДеятельности", СтрокаТабличнойЧасти.НаправлениеДеятельности);
				СтруктураОтборов.Вставить("Размер", СтрокаТабличнойЧасти.Размер);
				СтруктураОтборов.Вставить("ОтработаноДней", СтрокаТабличнойЧасти.ОтработаноДней);
				СтруктураОтборов.Вставить("ОтработаноЧасов", СтрокаТабличнойЧасти.ОтработаноЧасов);
				СтруктураОтборов.Вставить("ГрафикРаботы", СтрокаТабличнойЧасти.ГрафикРаботы); 
				
				// СуммаПродажВНациональнойВалюте
				ВалютаУчета = Константы.ВалютаУчета.Получить();
				Если ВалютаУчета = Объект.ВалютаДокумента Тогда

					СтруктураОтборов.Вставить("ВалютаУчетаКратность", 1);
					СтруктураОтборов.Вставить("ВалютаУчетаКурс", 1);
					СтруктураОтборов.Вставить("ВалютаДокументаКратность", 1);
					СтруктураОтборов.Вставить("ВалютаДокументаКурс", 1);

				Иначе

					СтруктураКурсаВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУчета, Объект.Дата);
					СтруктураОтборов.Вставить("ВалютаУчетаКратность", СтруктураКурсаВалюты.Кратность);
					СтруктураОтборов.Вставить("ВалютаУчетаКурс", СтруктураКурсаВалюты.Курс);

					СтруктураКурсаВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
					СтруктураОтборов.Вставить("ВалютаДокументаКратность", СтруктураКурсаВалюты.Кратность);
					СтруктураОтборов.Вставить("ВалютаДокументаКурс", СтруктураКурсаВалюты.Курс);

				КонецЕсли;

				НачалоЗамераПараметр = НачатьЗамерВремени();

				СтрокаТабличнойЧасти["Значение" + Счетчик] = ЗарплатаИПерсоналСлужебный.РассчитатьЗначениеПараметра(
					СтруктураОтборов, ПараметрРасчета, СтрШаблон(" %1", НСтр("ru = 'для сотрудника в строке №'"))
					+ (Объект.НачисленияУдержания.Индекс(СтрокаТабличнойЧасти) + 1));

				ЗакончитьЗамерВремени(НачалоЗамераПараметр, "НачислениеЗарплаты_РассчитатьЗначениеПараметра", Строка(
					ДанныеПараметра.Идентификатор));

			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

	ЗаполнитьЗаймыСотрудникам(); // Прочие расчеты. Займы сотрудникам.
	РассчитатьПоФормулам();
	РассчитатьНалогиИВзносы();
	ОбновитьПодвалФормы();

	ЗакончитьЗамерВремени(НачалоЗамераПодразделение, "НачислениеЗарплаты_ЗаполнитьПоПодразделению");

КонецПроцедуры // ЗаполнитьПоПодразделению()

&НаСервере
// Процедура выполняет расчет размера начисления или удержания по формуле.
//
Процедура РассчитатьПоФормулам()

	КолонкаНачисленияУдержания = "ВидНачисленияУдержания";
	НачисленияУдержания = Объект.НачисленияУдержания.Выгрузить( ,
		КолонкаНачисленияУдержания).ВыгрузитьКолонку(КолонкаНачисленияУдержания);
	ФормулыНачислений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(НачисленияУдержания, "Формула");

	Для Каждого СтрокаНачислений Из Объект.НачисленияУдержания Цикл

		Если СтрокаНачислений.РучнаяКорректировка Или Не ЗначениеЗаполнено(
			СтрокаНачислений.ВидНачисленияУдержания) Тогда
			Продолжить;
		КонецЕсли; 

		ФормулаНачисления = ФормулыНачислений.Получить(СтрокаНачислений.ВидНачисленияУдержания);
		Если НЕ ЗначениеЗаполнено(ФормулаНачисления) Тогда
			Продолжить;
		КонецЕсли;
		
		// 1. Добавляем параметры и значения в структуру

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТарифнаяСтавка", СтрокаНачислений.Размер);
		СтруктураПараметров.Вставить("ОтработаноДней", СтрокаНачислений.ОтработаноДней);
		СтруктураПараметров.Вставить("ОтработаноЧасов", СтрокаНачислений.ОтработаноЧасов);

		Для Счетчик = 1 По 3 Цикл
			Если ЗначениеЗаполнено(СтрокаНачислений["Представление" + Счетчик]) Тогда
				СтруктураПараметров.Вставить(СтрокаНачислений["Показатель" + Счетчик], СтрокаНачислений["Значение"
					+ Счетчик]);
			КонецЕсли;
		КонецЦикла; 
		
		// 2. Рассчитываем по формулам
		Формула = "" + ФормулаНачисления;
		Для Каждого Параметр Из СтруктураПараметров Цикл
			Формула = СтрЗаменить(Формула, "[" + Параметр.Ключ + "]", Формат(Параметр.Значение, "ЧРД=.; ЧН=0; ЧГ=0"));
		КонецЦикла;
		Попытка
			РассчитаннаяСумма = ОбщегоНазначения.ВычислитьВБезопасномРежиме(Формула);
		Исключение
			ТекстСообщения = СтрШаблон(НСтр(
				"ru = 'Не удалось рассчитать сумму начисления  в строке №%1. Возможно, формула содержит ошибку или не заполнены показатели.'"),
				СтрокаНачислений.НомерСтроки);
			КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.НачисленияУдержания",
				СтрокаНачислений.НомерСтроки, "ВидНачисленияУдержания");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , КонтекстноеПоле);

			РассчитаннаяСумма = 0;
		КонецПопытки;
		СтрокаНачислений.Сумма = Окр(РассчитаннаяСумма, 2);

	КонецЦикла;

	ОбновитьПодвалФормы();

КонецПроцедуры // РассчитатьПоФормулам()

&НаСервере
// Процедура выполняет расчет размера налога и взносов.
//
Процедура РассчитатьНалогиИВзносы()

	Если РассчитыватьБезВзносов Тогда
		Возврат;
	КонецЕсли;

	Если Не ТранзакцияАктивна() Тогда
		НачатьТранзакцию();
		ОтменятьЗапись = Истина;
	КонецЕсли;

	НаборыЗаписей = УчетСтраховыхВзносовУНФ.НаборыЗаписейРегистратора(Объект.Ссылка.Метаданные(), ?(
		Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка));
	НачисленияИУдержания = Объект.НачисленияУдержания.Выгрузить();

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	НачислениеЗаработнойПлаты.Сотрудник КАК Сотрудник,
						  |	НачислениеЗаработнойПлаты.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
						  |	НачислениеЗаработнойПлаты.Сумма КАК Сумма
						  |ПОМЕСТИТЬ ВтНачисления
						  |ИЗ
						  |	&НачисленияИУдержания КАК НачислениеЗаработнойПлаты
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	НачислениеЗаработнойПлатыНачисления.Сотрудник КАК Сотрудник,
						  |	НачислениеЗаработнойПлатыНачисления.ВидНачисленияУдержания КАК ВидНачисления,
						  |	ВЫБОР
						  |		КОГДА ВидыНачисленийИУдержаний.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
						  |			ТОГДА ВЫРАЗИТЬ(НачислениеЗаработнойПлатыНачисления.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
						  |		ИНАЧЕ 0
						  |	КОНЕЦ КАК Начисление,
						  |	ВЫБОР
						  |		КОГДА ВидыНачисленийИУдержаний.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
						  |			ТОГДА ВЫРАЗИТЬ(НачислениеЗаработнойПлатыНачисления.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
						  |		ИНАЧЕ 0
						  |	КОНЕЦ КАК Удержание
						  |ПОМЕСТИТЬ ВТНачислениеЗаработнойПлатыНачисления
						  |ИЗ
						  |	ВтНачисления КАК НачислениеЗаработнойПлатыНачисления
						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНачисленийИУдержаний КАК ВидыНачисленийИУдержаний
						  |		ПО (ВидыНачисленийИУдержаний.Ссылка = НачислениеЗаработнойПлатыНачисления.ВидНачисленияУдержания)
						  |			И (ВидыНачисленийИУдержаний.Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление),
						  |				ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)))
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
						  |				&ДатаДокумента,
						  |				Валюта В
						  |					(ВЫБРАТЬ
						  |						Константы.ВалютаУчета
						  |					ИЗ
						  |						Константы КАК Константы)) КАК КурсыВалютУчета
						  |		ПО (ИСТИНА)
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютРасчетов
						  |		ПО (&ВалютаДокумента = КурсыВалютРасчетов.Валюта)
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |УНИЧТОЖИТЬ ВтНачисления
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	НачислениеЗаработнойПлатыНачисления.Сотрудник КАК Сотрудник,
						  |	НачислениеЗаработнойПлатыНачисления.ВидНачисления КАК ВидНачисления,
						  |	СУММА(НачислениеЗаработнойПлатыНачисления.Начисление) КАК Сумма,
						  |	СУММА(НачислениеЗаработнойПлатыНачисления.Удержание) КАК Скидка
						  |ПОМЕСТИТЬ ВтНачисления
						  |ИЗ
						  |	ВТНачислениеЗаработнойПлатыНачисления КАК НачислениеЗаработнойПлатыНачисления
						  |
						  |СГРУППИРОВАТЬ ПО
						  |	НачислениеЗаработнойПлатыНачисления.Сотрудник,
						  |	НачислениеЗаработнойПлатыНачисления.ВидНачисления
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |	ВтНачисления.Сотрудник КАК Сотрудник,
						  |	СУММА(ВтНачисления.Сумма) КАК Сумма,
						  |	ЕСТЬNULL(НачисленияОбороты.СуммаПриход, 0) КАК СуммаНачисленийПрошлыхПериодов
						  |ПОМЕСТИТЬ ВтСотрудники
						  |ИЗ
						  |	ВтНачисления КАК ВтНачисления
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПерсоналом.Обороты(
						  |				НАЧАЛОПЕРИОДА(&ПериодРегистрации, ГОД),
						  |				,
						  |				,
						  |				Организация = &Организация
						  |					И ПериодРегистрации < &ПериодРегистрации) КАК НачисленияОбороты
						  |		ПО ВтНачисления.Сотрудник = НачисленияОбороты.Сотрудник
						  |
						  |СГРУППИРОВАТЬ ПО
						  |	ВтНачисления.Сотрудник,
						  |	ЕСТЬNULL(НачисленияОбороты.СуммаПриход, 0)
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	НДФЛИмущественныйВычетСрезПоследних.Сотрудник КАК Сотрудник,
						  |	НДФЛИмущественныйВычетСрезПоследних.СуммаРасходов КАК СуммаРасходов,
						  |	НДФЛИмущественныйВычетСрезПоследних.ПроцентыПоКредиту КАК ПроцентыПоКредиту,
						  |	ЕСТЬNULL(ВЫБОР
						  |			КОГДА ПредоставленныйИмущественныйВычет.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код312)
						  |				ТОГДА ПредоставленныйИмущественныйВычет.СуммаВычетаОборот
						  |		КОНЕЦ, 0) КАК ПредоставленныйВычетПоПроцентам,
						  |	ЕСТЬNULL(ВЫБОР
						  |			КОГДА ПредоставленныйИмущественныйВычет.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код311)
						  |				ТОГДА ПредоставленныйИмущественныйВычет.СуммаВычетаОборот
						  |		КОНЕЦ, 0) КАК ПредоставленныйВычетПоРасходам
						  |ПОМЕСТИТЬ ВтИмущественныйВычет
						  |ИЗ
						  |	РегистрСведений.НДФЛИмущественныйВычет.СрезПоследних(
						  |			&ПериодРегистрации,
						  |			Сотрудник В
						  |				(ВЫБРАТЬ
						  |					ВтСотрудники.Сотрудник
						  |				ИЗ
						  |					ВтСотрудники)) КАК НДФЛИмущественныйВычетСрезПоследних
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПримененныеВычетыПоНДФЛ.Обороты(
						  |				,
						  |				,
						  |				,
						  |				Организация = &Организация
						  |					И ПериодРегистрации < &ПериодРегистрации
						  |					И (КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код312)
						  |						ИЛИ КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код311))) КАК ПредоставленныйИмущественныйВычет
						  |		ПО НДФЛИмущественныйВычетСрезПоследних.Сотрудник = ПредоставленныйИмущественныйВычет.Сотрудник
						  |ГДЕ
						  |	НДФЛИмущественныйВычетСрезПоследних.Применяется
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	НДФЛСоциальныеВычетыСрезПоследних.Сотрудник КАК Сотрудник,
						  |	НДФЛСоциальныеВычетыСрезПоследних.КодВычета КАК КодВычета,
						  |	НДФЛСоциальныеВычетыСрезПоследних.СуммаРасходов КАК СуммаРасходов,
						  |	ЕСТЬNULL(ПредоставленныйСоциальныйВычет.СуммаВычетаОборот, 0) КАК ПредоставленныйВычетПоРасходам
						  |ПОМЕСТИТЬ ВТСоциальныйВычет
						  |ИЗ
						  |	РегистрСведений.НДФЛСоциальныеВычеты.СрезПоследних(
						  |			&ПериодРегистрации,
						  |			Сотрудник В
						  |				(ВЫБРАТЬ
						  |					ВтСотрудники.Сотрудник
						  |				ИЗ
						  |					ВтСотрудники)) КАК НДФЛСоциальныеВычетыСрезПоследних
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПримененныеВычетыПоНДФЛ.Обороты(
						  |				,
						  |				,
						  |				,
						  |				Организация = &Организация
						  |					И ПериодРегистрации < &ПериодРегистрации) КАК ПредоставленныйСоциальныйВычет
						  |		ПО НДФЛСоциальныеВычетыСрезПоследних.Сотрудник = ПредоставленныйСоциальныйВычет.Сотрудник
						  |			И НДФЛСоциальныеВычетыСрезПоследних.КодВычета = ПредоставленныйСоциальныйВычет.КодВычета
						  |ГДЕ
						  |	НДФЛСоциальныеВычетыСрезПоследних.Применяется
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	НДФЛСтандартныеВычетыНаДетейСрезПоследних.Сотрудник КАК Сотрудник,
						  |	СУММА(ЕСТЬNULL(НДФЛРазмерВычетовСрезПоследних.Размер, 0)) КАК СуммаВычета,
						  |	НДФЛСтандартныеВычетыНаДетейСрезПоследних.КодВычета КАК КодВычета,
						  |	ЕСТЬNULL(НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам, 0) КАК ОграничениеПоДоходам
						  |ПОМЕСТИТЬ ВтВычетНаДетей
						  |ИЗ
						  |	РегистрСведений.НДФЛСтандартныеВычетыНаДетей.СрезПоследних(
						  |			&ПериодРегистрации,
						  |			Сотрудник В
						  |				(ВЫБРАТЬ
						  |					ВтСотрудники.Сотрудник
						  |				ИЗ
						  |					ВтСотрудники)) КАК НДФЛСтандартныеВычетыНаДетейСрезПоследних
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ПериодРегистрации, ) КАК НДФЛРазмерВычетовСрезПоследних
						  |		ПО НДФЛСтандартныеВычетыНаДетейСрезПоследних.КодВычета = НДФЛРазмерВычетовСрезПоследних.КодВычета
						  |ГДЕ
						  |	НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыНаДетейСрезПоследних.ПериодЗавершения, МЕСЯЦ) > &ПериодРегистрации
						  |
						  |СГРУППИРОВАТЬ ПО
						  |	НДФЛСтандартныеВычетыНаДетейСрезПоследних.Сотрудник,
						  |	НДФЛСтандартныеВычетыНаДетейСрезПоследних.КодВычета,
						  |	НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	НДФЛСтандартныеЛичныеВычетыСрезПоследних.Сотрудник КАК Сотрудник,
						  |	НДФЛСтандартныеЛичныеВычетыСрезПоследних.КодВычета КАК КодВычета,
						  |	ЕСТЬNULL(НДФЛРазмерВычетовСрезПоследних.Размер, 0) КАК РазмерВычета,
						  |	ЕСТЬNULL(НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам, 0) КАК ОграничениеПоДоходам
						  |ПОМЕСТИТЬ ВтЛичныйВычет
						  |ИЗ
						  |	РегистрСведений.НДФЛСтандартныеЛичныеВычеты.СрезПоследних(
						  |			&ПериодРегистрации,
						  |			Сотрудник В
						  |				(ВЫБРАТЬ
						  |					ВтСотрудники.Сотрудник
						  |				ИЗ
						  |					ВтСотрудники)) КАК НДФЛСтандартныеЛичныеВычетыСрезПоследних
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ПериодРегистрации, ) КАК НДФЛРазмерВычетовСрезПоследних
						  |		ПО НДФЛСтандартныеЛичныеВычетыСрезПоследних.КодВычета = НДФЛРазмерВычетовСрезПоследних.КодВычета
						  |ГДЕ
						  |	НДФЛСтандартныеЛичныеВычетыСрезПоследних.Применяется
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	ВтВычетНаДетей.Сотрудник КАК Сотрудник,
						  |	ВтВычетНаДетей.КодВычета КАК КодВычета,
						  |	ВЫБОР
						  |		КОГДА ВтСотрудники.Сумма + ВтСотрудники.СуммаНачисленийПрошлыхПериодов > ВтВычетНаДетей.ОграничениеПоДоходам
						  |				И ВтВычетНаДетей.ОграничениеПоДоходам > 0
						  |			ТОГДА 0
						  |		ИНАЧЕ ВтВычетНаДетей.СуммаВычета
						  |	КОНЕЦ КАК СуммаВычетаНаДетей,
						  |	ВтСотрудники.Сумма КАК Сумма
						  |ПОМЕСТИТЬ ВтПредоставленныеВычетыНаДетей
						  |ИЗ
						  |	ВтВычетНаДетей КАК ВтВычетНаДетей
						  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудники КАК ВтСотрудники
						  |		ПО ВтВычетНаДетей.Сотрудник = ВтСотрудники.Сотрудник
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |	&Организация КАК Организация,
						  |	Начисления.Сотрудник КАК ФизическоеЛицо
						  |ПОМЕСТИТЬ ВТФизЛицаОрганизаций
						  |ИЗ
						  |	ВтНачисления КАК Начисления");
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ПериодДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("НачисленияИУдержания", НачисленияИУдержания);
	Запрос.УстановитьПараметр("ПериодРегистрации", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("ОбъединятьНакопительнуюИСтраховуюЧасть",
		Объект.Дата >= УчетСтраховыхВзносовУНФ.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР());
	Запрос.УстановитьПараметр("ВалютаДокумента", Объект.ВалютаДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Результат = Запрос.ВыполнитьПакет();
	
	// Создадим временную таблицу предоставленных имущественных вычетов
	// в одном запросе данные движения не получатся из-за того, что нужно разбивать 
	// на несколько строк по процентам и основным величинам
	ОбработатьВременнуюТаблицуПредоставленныхВычетовНаДетей(Запрос);

	Запрос.Текст =
	"УНИЧТОЖИТЬ ВтВычетНаДетей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЛичныйВычет.Сотрудник,
	|	ВтЛичныйВычет.КодВычета,
	|	ВЫБОР
	|		КОГДА ВтСотрудники.СуммаНачисленийПрошлыхПериодов + ВтСотрудники.Сумма > ВтЛичныйВычет.ОграничениеПоДоходам
	|				И ВтЛичныйВычет.ОграничениеПоДоходам > 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВтСотрудники.Сумма - ЕСТЬNULL(СуммаВычетовНаДетей.Сумма, 0) > ВтЛичныйВычет.РазмерВычета
	|					ТОГДА ВтЛичныйВычет.РазмерВычета
	|				ИНАЧЕ ВтСотрудники.Сумма - ЕСТЬNULL(СуммаВычетовНаДетей.Сумма, 0)
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаЛичногоВычета
	|ПОМЕСТИТЬ ВтПредоставленныйЛичныйВычет
	|ИЗ
	|	ВтЛичныйВычет КАК ВтЛичныйВычет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудники КАК ВтСотрудники
	|		ПО ВтЛичныйВычет.Сотрудник = ВтСотрудники.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВтПредоставленныеВычетыНаДетей.Сотрудник КАК Сотрудник,
	|			СУММА(ВтПредоставленныеВычетыНаДетей.СуммаВычетаНаДетей) КАК Сумма
	|		ИЗ
	|			ВтПредоставленныеВычетыНаДетей КАК ВтПредоставленныеВычетыНаДетей
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВтПредоставленныеВычетыНаДетей.Сотрудник) КАК СуммаВычетовНаДетей
	|		ПО ВтЛичныйВычет.Сотрудник = СуммаВычетовНаДетей.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтЛичныйВычет
	|;";

	Результат = Запрос.ВыполнитьПакет();
	// обработаем строки ВтПредоставленныеВычетыНаДетей
	ОбработатьВременнуюТаблицуПредоставленныхИмущественныхВычетов(Запрос);
	ОбработатьВременнуюТаблицуПредоставленныхСоциальныхВычетов(Запрос);
	
	// Рассчитываем начисления в страховую

	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецГода", КонецГода(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("МесяцРасчета", Месяц(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("ИдентификаторОбщий", "ОбщийНалоговыйРежим");
	Запрос.УстановитьПараметр("ИдентификаторУпрощенный", "УпрощенныйНалоговыйРежим");
	Запрос.УстановитьПараметр("ИдентификаторЕНВД", "ЕНВД");
	Запрос.УстановитьПараметр("ТарифНаТравматизм",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ТарифНаТравматизм"));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	// Для начисления страховых взносов запишем изначально доходы по страховым взносам
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ПериодРегистрации КАК Период,
	|	&Организация КАК Организация,
	|	Начисления.Сотрудник,
	|	Начисления.ВидНачисления.ВидДоходаПоСтраховымВзносам КАК ВидДохода,
	|	СУММА(Начисления.Сумма) КАК Сумма,
	|	0 КАК Скидка
	| ИЗ ВТНачисления КАК Начисления
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник,
	|	Начисления.ВидНачисления.ВидДоходаПоСтраховымВзносам";

	НаборыЗаписей.СтраховыеВзносыДоходы.Загрузить(Запрос.Выполнить().Выгрузить());
	НаборыЗаписей.СтраховыеВзносыДоходы.Записать();
	НаборыЗаписей.СтраховыеВзносыДоходы.Записывать = Ложь;

	УчетСтраховыхВзносовУНФ.СформироватьВТРасширенныхСведенийОДоходах(Объект.ПериодРегистрации, КонецМесяца(
		Объект.ПериодРегистрации), Объект.Организация, Запрос.МенеджерВременныхТаблиц, Истина);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Основная.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Основная.ФизическоеЛицоНаименование,
	|	Основная.НачислятьНакопительнуюЧасть,
	|	Основная.ВидТарифаСтраховыхВзносов,
	|	МЕСЯЦ(Основная.Период) КАК Месяц,
	|	СУММА(Основная.БазаПФР) КАК БазаПФР,
	|	СУММА(Основная.БазаФСС) КАК БазаФСС,
	|	СУММА(Основная.БазаФОМС) КАК БазаФОМС,
	|	СУММА(Основная.СуммаПревысившаяПределПФР) КАК СуммаПревысившаяПределПФР,
	|	СУММА(Основная.СуммаПревысившаяПределФСС) КАК СуммаПревысившаяПределФСС,
	|	СУММА(Основная.СуммаПревысившаяПределФОМС) КАК СуммаПревысившаяПределФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ВходитВБазуФСС
	|				ТОГДА Основная.Сумма - Основная.Скидка
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСПоОсновномуТарифу
	|ПОМЕСТИТЬ ВТДоходыЗастрахованныхЛиц
	|ИЗ
	|	ВТСведенияОДоходах КАК Основная
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизическоеЛицо,
	|	Основная.НачислятьНакопительнуюЧасть,
	|	Основная.ФизическоеЛицоНаименование,
	|	Основная.ВидТарифаСтраховыхВзносов,
	|	Основная.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДоходыЗастрахованныхЛиц.ФизическоеЛицоНаименование,
	|	ДоходыЗастрахованныхЛиц.НачислятьНакопительнуюЧасть,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК БазаПФР,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК БазаФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК БазаФОМС,
	|	СУММА(ДоходыЗастрахованныхЛиц.СуммаПревысившаяПределПФР) КАК СуммаПревысившаяПределПФР,
	|	СУММА(ДоходыЗастрахованныхЛиц.СуммаПревысившаяПределФСС) КАК СуммаПревысившаяПределФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.СуммаПревысившаяПределФОМС) КАК СуммаПревысившаяПределФОМС
	|ПОМЕСТИТЬ ВТНакопленнаяОблагаемаяБаза
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|ГДЕ
	|	ДоходыЗастрахованныхЛиц.Месяц МЕЖДУ 1 И &МесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизическоеЛицо,
	|	ДоходыЗастрахованныхЛиц.ФизическоеЛицоНаименование,
	|	ДоходыЗастрахованныхЛиц.НачислятьНакопительнуюЧасть,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка КАК ВидТарифа,
	|	ИСТИНА КАК УчитываетсяПревышениеПФРСуммарно,
	|	ИСТИНА КАК УчитываетсяПревышениеПФРСтраховая
	|ПОМЕСТИТЬ ВТУчетТарифовСтраховыхВзносов
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта В (&ИдентификаторОбщий, &ИдентификаторУпрощенный)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	ИСТИНА,
	|	ИСТИНА
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ЯвляетсяТарифомДляМСП <= &ПериодРегистрации
	|	И ВидыТарифовСтраховыхВзносов.ЯвляетсяТарифомДляМСП <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	ЛОЖЬ,
	|	ИСТИНА
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = &ИдентификаторЕНВД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеОграниченнаяОблагаемаяБаза.ФизическоеЛицо,
	|	НеОграниченнаяОблагаемаяБаза.ФизическоеЛицоНаименование,
	|	(ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(НеОграниченнаяОблагаемаяБаза.СуммаПревысившаяПределПФР, 0)) * ОсновнойТариф.ПФР / 100 КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(УчетТарифов.УчитываетсяПревышениеПФРСуммарно, ЛОЖЬ)
	|				ТОГДА ЕСТЬNULL(НеОграниченнаяОблагаемаяБаза.СуммаПревысившаяПределПФР, 0) * ЕСТЬNULL(ОсновнойТариф.СтавкаСПревышенияПредела / 100, 0.1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2))) КАК РезультатПФРПоСуммарномуТарифу,
	|	ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(НеОграниченнаяОблагаемаяБаза.СуммаПревысившаяПределПФР, 0)) * ВЫБОР
	|			КОГДА НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть
	|				ТОГДА ОсновнойТариф.ПФРНакопительная
	|			ИНАЧЕ 0
	|		КОНЕЦ / 100 КАК ЧИСЛО(15, 2)) КАК РезультатПФРНакопительная,
	|	(ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(НеОграниченнаяОблагаемаяБаза.СуммаПревысившаяПределПФР, 0)) * (ОсновнойТариф.ПФР - ВЫБОР
	|			КОГДА НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть
	|				ТОГДА ОсновнойТариф.ПФРНакопительная
	|			ИНАЧЕ 0
	|		КОНЕЦ) / 100 КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(УчетТарифов.УчитываетсяПревышениеПФРСтраховая, ЛОЖЬ)
	|				ТОГДА ЕСТЬNULL(НеОграниченнаяОблагаемаяБаза.СуммаПревысившаяПределПФР, 0) * ЕСТЬNULL(ОсновнойТариф.СтавкаСПревышенияПредела / 100, 0.1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2))) КАК РезультатПФРСтраховая,
	|	ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФСС - ЕСТЬNULL(НеОграниченнаяОблагаемаяБаза.СуммаПревысившаяПределФСС, 0)) * ОсновнойТариф.ФСС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФОМС - ЕСТЬNULL(НеОграниченнаяОблагаемаяБаза.СуммаПревысившаяПределФОМС, 0)) * ОсновнойТариф.ФФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС,
	|	ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФОМС - ЕСТЬNULL(НеОграниченнаяОблагаемаяБаза.СуммаПревысившаяПределФОМС, 0)) * ОсновнойТариф.ТФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатТФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифу
	|ИЗ
	|	ВТНакопленнаяОблагаемаяБаза КАК НеОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК ОсновнойТариф
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОсновнойТариф.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетТарифовСтраховыхВзносов КАК УчетТарифов
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = УчетТарифов.ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РанееИсчисленныеВзносы.ФизическоеЛицо,
	|	СУММА(РанееИсчисленныеВзносы.ФССОборот) КАК ФССОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСОборот) КАК ФФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ТФОМСОборот) КАК ТФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот) КАК ПФРПоСуммарномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНакопительнаяОборот) КАК ПФРНакопительнаяОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРСтраховаяОборот) КАК ПФРСтраховаяОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот
	|ПОМЕСТИТЬ ВТРанееИсчисленныеВзносы
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСФондамиПоСтраховымВзносамОбороты.Сотрудник КАК ФизическоеЛицо,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРПоСуммарномуТарифу)
	|				ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПФРПоСуммарномуТарифуОборот,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРНакопительная)
	|				ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПФРНакопительнаяОборот,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРСтраховая)
	|				ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПФРСтраховаяОборот,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФФОМС)
	|				ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ФФОМСОборот,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФСС)
	|				ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ФССОборот,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФССНесчастныеСлучаи)
	|					И РасчетыСФондамиПоСтраховымВзносамОбороты.Период = &ПериодРегистрации
	|				ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ФССНесчастныеСлучаиОборот,
	|		0 КАК ТФОМСОборот
	|	ИЗ
	|		РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ.Обороты(
	|				&НачалоГода,
	|				&КонецМесяца,
	|				Месяц,
	|				Организация = &Организация
	|					И Сотрудник В
	|						(ВЫБРАТЬ
	|							СписокСотрудников.ФизическоеЛицо
	|						ИЗ
	|							ВТФизЛицаОрганизаций КАК СписокСотрудников)) КАК РасчетыСФондамиПоСтраховымВзносамОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСФондамиПоСтраховымВзносамУНФ.Сотрудник,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамУНФ.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРПоСуммарномуТарифу)
	|				ТОГДА -РасчетыСФондамиПоСтраховымВзносамУНФ.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамУНФ.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРНакопительная)
	|				ТОГДА -РасчетыСФондамиПоСтраховымВзносамУНФ.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамУНФ.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРСтраховая)
	|				ТОГДА -РасчетыСФондамиПоСтраховымВзносамУНФ.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамУНФ.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФФОМС)
	|				ТОГДА -РасчетыСФондамиПоСтраховымВзносамУНФ.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамУНФ.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФСС)
	|				ТОГДА -РасчетыСФондамиПоСтраховымВзносамУНФ.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|	ВЫБОР
	|			КОГДА РасчетыСФондамиПоСтраховымВзносамУНФ.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФССНесчастныеСлучаи)
	|				ТОГДА -РасчетыСФондамиПоСтраховымВзносамУНФ.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0
	|	ИЗ
	|		РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ КАК РасчетыСФондамиПоСтраховымВзносамУНФ
	|	ГДЕ
	|		РасчетыСФондамиПоСтраховымВзносамУНФ.Регистратор = &Ссылка
	|		И РасчетыСФондамиПоСтраховымВзносамУНФ.Сотрудник В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизическоеЛицо
	|				ИЗ
	|					ВТФизЛицаОрганизаций КАК СписокСотрудников)
	|		И РасчетыСФондамиПоСтраховымВзносамУНФ.Период МЕЖДУ &НачалоГода И &КонецМесяца) КАК РанееИсчисленныеВзносы
	|
	|СГРУППИРОВАТЬ ПО
	|	РанееИсчисленныеВзносы.ФизическоеЛицо
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Начислено.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Начислено.ФизическоеЛицоНаименование,
	|	(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &ТарифНаТравматизм/100 КАК ЧИСЛО(15, 2))) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаи
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК Начислено
	|ГДЕ
	|	Начислено.Месяц = &МесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизическоеЛицоНаименование,
	|	Начислено.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсегоИсчислено.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВсегоИсчислено.Порядок,
	|	СУММА(ВсегоИсчислено.РезультатПФРПоСуммарномуТарифу) КАК РезультатПФРПоСуммарномуТарифу,
	|	СУММА(ВсегоИсчислено.РезультатПФРНакопительная) КАК РезультатПФРНакопительная,
	|	СУММА(ВсегоИсчислено.РезультатПФРСтраховая) КАК РезультатПФРСтраховая,
	|	СУММА(ВсегоИсчислено.РезультатФСС) КАК РезультатФСС,
	|	СУММА(ВсегоИсчислено.РезультатФФОМС) КАК РезультатФФОМС,
	|	СУММА(ВсегоИсчислено.РезультатТФОМС) КАК РезультатТФОМС,
	|	СУММА(ВсегоИсчислено.РезультатФССНесчастныеСлучаи) КАК РезультатФССНесчастныеСлучаи
	|ПОМЕСТИТЬ ВТСуммыВзносовНарастающимИтогом
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоОсновномуТарифу.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ИсчисленоПоОсновномуТарифу.ФизическоеЛицоНаименование КАК Порядок,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРПоСуммарномуТарифу КАК РезультатПФРПоСуммарномуТарифу,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРНакопительная КАК РезультатПФРНакопительная,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРСтраховая КАК РезультатПФРСтраховая,
	|		ИсчисленоПоОсновномуТарифу.РезультатФСС КАК РезультатФСС,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМС КАК РезультатФФОМС,
	|		ИсчисленоПоОсновномуТарифу.РезультатТФОМС КАК РезультатТФОМС,
	|		0 КАК РезультатФССНесчастныеСлучаи
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифу КАК ИсчисленоПоОсновномуТарифу
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыФССНесчастныеСлучаи.ФизическоеЛицо,
	|		ВзносыФССНесчастныеСлучаи.ФизическоеЛицоНаименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФССНесчастныеСлучаи.Взносов
	|	ИЗ
	|		ВТВзносыФССНесчастныеСлучаи КАК ВзносыФССНесчастныеСлучаи
	|	) КАК ВсегоИсчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсегоИсчислено.ФизическоеЛицо,
	|	ВсегоИсчислено.Порядок;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНарастающимИтогом.ФизическоеЛицо КАК Сотрудник,
	|	СуммыНарастающимИтогом.Порядок КАК Порядок,
	|	СуммыНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленныеВзносы.ФССОборот, 0) КАК ФСС,
	|	СуммыНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСОборот, 0) КАК ФФОМС,
	|	СуммыНарастающимИтогом.РезультатТФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ТФОМСОборот, 0) КАК ТФОМС,
	|	ВЫБОР КОГДА &ОбъединятьНакопительнуюИСтраховуюЧасть ТОГДА
	|	СуммыНарастающимИтогом.РезультатПФРПоСуммарномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПФРПоСуммарномуТарифу,
	|	СуммыНарастающимИтогом.РезультатПФРНакопительная - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНакопительнаяОборот, 0) КАК ПФРНакопительная,
	|	ВЫБОР КОГДА &ОбъединятьНакопительнуюИСтраховуюЧасть ТОГДА
	|	0
	|	ИНАЧЕ СуммыНарастающимИтогом.РезультатПФРСтраховая - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСтраховаяОборот, 0)
	|	КОНЕЦ КАК ПФРСтраховая,
	|	СуммыНарастающимИтогом.РезультатФССНесчастныеСлучаи - ЕСТЬNULL(ИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0) КАК ФССНесчастныеСлучаи
	|ПОМЕСТИТЬ ВТВзносыЗаМесяц
	|ИЗ
	|	ВТСуммыВзносовНарастающимИтогом КАК СуммыНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК ИсчисленныеВзносы
	|		ПО СуммыНарастающимИтогом.ФизическоеЛицо = ИсчисленныеВзносы.ФизическоеЛицо
	|;
	|";
	Запрос.Выполнить();

	РассчитатьНДФЛПоПрогрессивнойШкале(Запрос);

	Запрос.Текст =
	"УНИЧТОЖИТЬ ВтИмущественныйВычет
	|;
	|УНИЧТОЖИТЬ ВТСоциальныйВычет
	|;
	|////////////////////////////////////////////////////////////////////////////////
	// 1. Таблица предоставленных стандартных вычетов вычетов
	|ВЫБРАТЬ
	|	ВтПредоставленныеВычетыНаДетей.Сотрудник КАК Сотрудник,
	|	ВтПредоставленныеВычетыНаДетей.КодВычета КАК КодВычета,
	|	ВтПредоставленныеВычетыНаДетей.СуммаВычетаНаДетей КАК СуммаВычета
	|ИЗ
	|	ВтПредоставленныеВычетыНаДетей КАК ВтПредоставленныеВычетыНаДетей
	|ГДЕ
	|	ВтПредоставленныеВычетыНаДетей.СуммаВычетаНаДетей <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтПредоставленныйЛичныйВычет.Сотрудник,
	|	ВтПредоставленныйЛичныйВычет.КодВычета,
	|	ВтПредоставленныйЛичныйВычет.СуммаЛичногоВычета
	|ИЗ
	|	ВтПредоставленныйЛичныйВычет КАК ВтПредоставленныйЛичныйВычет
	|ГДЕ
	|	ВтПредоставленныйЛичныйВычет.СуммаЛичногоВычета <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтПредоставленныйИмущественныйВычет.Сотрудник,
	|	ВтПредоставленныйИмущественныйВычет.КодВычета,
	|	ВтПредоставленныйИмущественныйВычет.СуммаИмущественногоВычета
	|ИЗ
	|	ВтПредоставленныйИмущественныйВычет КАК ВтПредоставленныйИмущественныйВычет
	|ГДЕ
	|	ВтПредоставленныйИмущественныйВычет.СуммаИмущественногоВычета <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтПредоставленныйСоциальныйВычет.Сотрудник,
	|	ВтПредоставленныйСоциальныйВычет.КодВычета,
	|	ВтПредоставленныйСоциальныйВычет.СуммаСоциальногоВычета
	|ИЗ
	|	ВтПредоставленныйСоциальныйВычет КАК ВтПредоставленныйСоциальныйВычет
	|ГДЕ
	|	ВтПредоставленныйСоциальныйВычет.СуммаСоциальногоВычета <> 0
	|;
	|
	// НДФЛ
	|
	|ВЫБРАТЬ
	|	НДФЛНалог.Сотрудник,
	|	&ВидНалогНаДоход КАК ВидНачисленияУдержания,
	|	НДФЛНалог.Сумма КАК Сумма,
	|	НДФЛНалог.СуммаСПревышения КАК СуммаСПревышения,
	|	НДФЛНалог.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	НДФЛНалог.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	НДФЛНалог.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22
	|ИЗ ВТНДФЛНалог КАК НДФЛНалог;
	|
	|
	// ПФРПоСуммарномуТарифу
	|ВЫБРАТЬ
	|	ВзносыЗаМесяц.Сотрудник,
	|	&ПФРПоСуммарномуТарифу КАК ВидНачисленияУдержания,
	|	ВЫБОР КОГДА &ОбъединятьНакопительнуюИСтраховуюЧасть ТОГДА
	|		ВзносыЗаМесяц.ПФРПоСуммарномуТарифу
	|	ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма
	|ИЗ ВТВзносыЗаМесяц КАК ВзносыЗаМесяц
	|	ГДЕ ВзносыЗаМесяц.ПФРПоСуммарномуТарифу <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРСтраховая
	|ВЫБРАТЬ
	|	ВзносыЗаМесяц.Сотрудник,
	|	&ПФРСтраховая,
	|	ВЫБОР КОГДА &ОбъединятьНакопительнуюИСтраховуюЧасть ТОГДА
	|		0
	|	ИНАЧЕ ВзносыЗаМесяц.ПФРСтраховая
	|	КОНЕЦ КАК Сумма
	|ИЗ ВТВзносыЗаМесяц КАК ВзносыЗаМесяц
	|	ГДЕ ВзносыЗаМесяц.ПФРСтраховая <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРНакопительная
	|ВЫБРАТЬ
	|	ВзносыЗаМесяц.Сотрудник,
	|	&ПФРНакопительная,
	|	ВзносыЗаМесяц.ПФРНакопительная КАК Сумма
	|ИЗ ВТВзносыЗаМесяц КАК ВзносыЗаМесяц
	|	ГДЕ ВзносыЗаМесяц.ПФРНакопительная <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ФСС
	|ВЫБРАТЬ
	|	ВзносыЗаМесяц.Сотрудник,
	|	&ФСС,
	|	ВзносыЗаМесяц.ФСС КАК Сумма
	|ИЗ ВТВзносыЗаМесяц КАК ВзносыЗаМесяц
	|	ГДЕ ВзносыЗаМесяц.ФСС <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ФССНесчастныеСлучаи
	|ВЫБРАТЬ
	|	ВзносыЗаМесяц.Сотрудник,
	|	&ФССНесчастныеСлучаи,
	|	ВзносыЗаМесяц.ФССНесчастныеСлучаи КАК Сумма
	|ИЗ ВТВзносыЗаМесяц КАК ВзносыЗаМесяц
	|	ГДЕ ВзносыЗаМесяц.ФССНесчастныеСлучаи <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ФФОМС
	|ВЫБРАТЬ
	|	ВзносыЗаМесяц.Сотрудник,
	|	&ФФОМС,
	|	ВзносыЗаМесяц.ФФОМС КАК Сумма
	|ИЗ ВТВзносыЗаМесяц КАК ВзносыЗаМесяц
	|	ГДЕ ВзносыЗаМесяц.ФФОМС <> 0;
	|";

	Запрос.УстановитьПараметр("ВидНалогНаДоход", Справочники.ВидыНачисленийИУдержаний.НалогНаДоходы);    
	Если ДатаДокумента > '20230101' Тогда
		Запрос.УстановитьПараметр("ПФРПоСуммарномуТарифу", Справочники.ВидыНачисленийИУдержаний.ВзносыПоЕдиномуТарифу);
	Иначе	
		Запрос.УстановитьПараметр("ПФРПоСуммарномуТарифу", Справочники.ВидыНачисленийИУдержаний.ПФРПоСуммарномуТарифу);		
	КонецЕсли;	
	Запрос.УстановитьПараметр("ПФРСтраховая", Справочники.ВидыНачисленийИУдержаний.ПФРСтраховая);
	Запрос.УстановитьПараметр("ПФРНакопительная", Справочники.ВидыНачисленийИУдержаний.ПФРНакопительная);
	Запрос.УстановитьПараметр("ФСС", Справочники.ВидыНачисленийИУдержаний.ФСС);
	Запрос.УстановитьПараметр("ФССНесчастныеСлучаи", Справочники.ВидыНачисленийИУдержаний.ФССНесчастныеСлучаи);
	Запрос.УстановитьПараметр("ФФОМС", Справочники.ВидыНачисленийИУдержаний.ФФОМС);

	Результат = Запрос.ВыполнитьПакет();

	Запрос.МенеджерВременныхТаблиц.Закрыть();

	Если ОтменятьЗапись = Истина Тогда
		ОтменитьТранзакцию();
	КонецЕсли;

	Объект.ПримененныеВычетыПоНДФЛ.Загрузить(Результат[2].Выгрузить());
	Объект.НалогиНаДоходы.Загрузить(Результат[3].Выгрузить());
	
	ТаблицаВзносы = Результат[4].Выгрузить();
	Объект.Взносы.Загрузить(ТаблицаВзносы);

	ЭтоПодразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтруктурнаяЕдиница, "ТипСтруктурнойЕдиницы")
		= Перечисления.ТипыСтруктурныхЕдиниц.Подразделение;
	
	ДанныеЗатрат = ДанныеЗатратВзносовПоВидамНачислений(ТаблицаВзносы.ВыгрузитьКолонку("ВидНачисленияУдержания"),
		ЭтоПодразделение);	
		
	Для Каждого СтрокаВзносов Из Объект.Взносы Цикл

		ДанныеНачисления = ДанныеЗатрат.Получить(СтрокаВзносов.ВидНачисленияУдержания);

		Если ДанныеНачисления = Неопределено Тогда
			СтрокаВзносов.СчетЗатрат = ПланыСчетов.Управленческий.ПустаяСсылка();
			СтрокаВзносов.ТипСчета = Перечисления.ТипыСчетов.ПустаяСсылка();
		Иначе
			СтрокаВзносов.СчетЗатрат = ДанныеНачисления.СчетЗатрат;
			СтрокаВзносов.ТипСчета = ДанныеНачисления.ТипСчета;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеЗатратВзносовПоВидамНачислений(ВидыНачислений, ДляПодразделения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Управленческий.Ссылка КАК Ссылка,
		|	Управленческий.ТипСчета КАК ТипСчета
		|ПОМЕСТИТЬ ТипыСчетов
		|ИЗ
		|	ПланСчетов.Управленческий КАК Управленческий
		|ГДЕ
		|	&ВсеТипыСчетов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Управленческий.Ссылка,
		|	Управленческий.ТипСчета
		|ИЗ
		|	ПланСчетов.Управленческий КАК Управленческий
		|ГДЕ
		|	&ВсеТипыСчетов = ЛОЖЬ
		|	И Управленческий.ТипСчета В(&ТипыСчетов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыНачисленийИУдержаний.Ссылка КАК ВидНачисленияУдержания,
		|	ВидыНачисленийИУдержаний.СчетЗатрат КАК СчетЗатрат,
		|	ТипыСчетов.ТипСчета КАК ТипСчета
		|ИЗ
		|	Справочник.ВидыНачисленийИУдержаний КАК ВидыНачисленийИУдержаний
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыСчетов КАК ТипыСчетов
		|		ПО ВидыНачисленийИУдержаний.СчетЗатрат = ТипыСчетов.Ссылка
		|			И (ВидыНачисленийИУдержаний.Ссылка В (&ВидыНачислений))";
		
	Запрос.УстановитьПараметр("ВидыНачислений", ВидыНачислений);
	
	Если ДляПодразделения Тогда
		Запрос.УстановитьПараметр("ВсеТипыСчетов", Ложь);
		ТипыСчетов = Новый Массив;
		ТипыСчетов.Добавить(Перечисления.ТипыСчетов.КосвенныеЗатраты);
		ТипыСчетов.Добавить(Перечисления.ТипыСчетов.Расходы);
		ТипыСчетов.Добавить(Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы);
		ТипыСчетов.Добавить(Перечисления.ТипыСчетов.НезавершенноеПроизводство);
		ТипыСчетов.Добавить(Перечисления.ТипыСчетов.Кредиторы);
		Запрос.УстановитьПараметр("ТипыСчетов", ТипыСчетов);
	Иначе
		Запрос.УстановитьПараметр("ВсеТипыСчетов", Истина);
		Запрос.УстановитьПараметр("ТипыСчетов", Неопределено);
	КонецЕсли;
	
	СчетаЗатрат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеЗатрат = Новый Структура("СчетЗатрат, ТипСчета");
		ЗаполнитьЗначенияСвойств(ДанныеЗатрат, Выборка);
		СчетаЗатрат.Вставить(Выборка.ВидНачисленияУдержания, ДанныеЗатрат);
	КонецЦикла;
	
	Возврат СчетаЗатрат;
	
КонецФункции

// Обрабатывает ситуацию с имущественными вычетами сотрудника
// Разбивает на несколько строк в том случае, когда необходимо разбить на основную часть
// и проценты
// Параметры:
//   Запрос - Запрос - объект запроса с временной таблицей имущественных вычетов ВТИмущественныйВычет
&НаСервере
Процедура ОбработатьВременнуюТаблицуПредоставленныхИмущественныхВычетов(Запрос)

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВтИмущественныйВычет.Сотрудник,
	|	ВтИмущественныйВычет.СуммаРасходов,
	|	ВтИмущественныйВычет.ПроцентыПоКредиту,
	|	ВтИмущественныйВычет.ПредоставленныйВычетПоПроцентам,
	|	ВтИмущественныйВычет.ПредоставленныйВычетПоРасходам,
	|	isnull(ВтСотрудники.Сумма,0) КАК СуммаНачисления,
	|	isnull(ПредоставленныеВычеты.СуммаВычетов,0) КАК СуммаВычетов
	|ИЗ
	|	ВтИмущественныйВычет КАК ВтИмущественныйВычет
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|			СУММА(ВложенныйЗапрос.СуммаВычетов) КАК СуммаВычетов
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВтПредоставленныеВычетыНаДетей.Сотрудник КАК Сотрудник,
	|				ВтПредоставленныеВычетыНаДетей.СуммаВычетаНаДетей КАК СуммаВычетов
	|			ИЗ
	|				ВтПредоставленныеВычетыНаДетей КАК ВтПредоставленныеВычетыНаДетей
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ВтПредоставленныйЛичныйВычет.Сотрудник,
	|				ВтПредоставленныйЛичныйВычет.СуммаЛичногоВычета
	|			ИЗ
	|				ВтПредоставленныйЛичныйВычет КАК ВтПредоставленныйЛичныйВычет) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Сотрудник) КАК ПредоставленныеВычеты
	|		ПО ВтИмущественныйВычет.Сотрудник = ПредоставленныеВычеты.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудники КАК ВтСотрудники
	|		ПО ВтИмущественныйВычет.Сотрудник = ВтСотрудники.Сотрудник";
	ТаблицаИмущественныхВычетов = Запрос.Выполнить().Выгрузить();
	ТаблицаПредоставленногоИмущественногоВычета = Новый ТаблицаЗначений;
	ТаблицаПредоставленногоИмущественногоВычета.Колонки.Добавить("Сотрудник",
		Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаПредоставленногоИмущественногоВычета.Колонки.Добавить("КодВычета",
		Новый ОписаниеТипов("СправочникСсылка.ВычетыНДФЛ"));
	ТаблицаПредоставленногоИмущественногоВычета.Колонки.Добавить("СуммаИмущественногоВычета",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));

	Для Каждого СтрокаВычета Из ТаблицаИмущественныхВычетов Цикл
		
		// проверим, есть ли вообще смысл в предоставлении вычета
		Если СтрокаВычета.СуммаНачисления > СтрокаВычета.СуммаВычетов Тогда

			Если СтрокаВычета.СуммаРасходов > СтрокаВычета.ПредоставленныйВычетПоРасходам Тогда
				// Вычет по расходам еще предоставлен не в полном объеме
				// значит сначала гасим его

				Если СтрокаВычета.СуммаРасходов - СтрокаВычета.ПредоставленныйВычетПоРасходам
					>= СтрокаВычета.СуммаНачисления - СтрокаВычета.СуммаВычетов Тогда
					// Сумма вычета по расходам больше, чем мы можем списать из текущего начисления
					// поэтому вычет применяем на все оставшееся начисление

					СтрокаПредоставленногоВычета = ТаблицаПредоставленногоИмущественногоВычета.Добавить();
					СтрокаПредоставленногоВычета.Сотрудник = СтрокаВычета.Сотрудник;
					СтрокаПредоставленногоВычета.КодВычета = Справочники.ВычетыНДФЛ.Код311; //вычет по расходам
					СтрокаПредоставленногоВычета.СуммаИмущественногоВычета = СтрокаВычета.СуммаНачисления
						- СтрокаВычета.СуммаВычетов;//спишем весь остаток начисления в вычет

				Иначе
					// Сумма вычета по расходам меньше, чем текущее начисление,
					// поэтому списываем сначала расходы, а затем пробуем проценты

					СтрокаПредоставленногоВычета = ТаблицаПредоставленногоИмущественногоВычета.Добавить();
					СтрокаПредоставленногоВычета.Сотрудник = СтрокаВычета.Сотрудник;
					СтрокаПредоставленногоВычета.КодВычета = Справочники.ВычетыНДФЛ.Код311; //вычет по расходам
					СтрокаПредоставленногоВычета.СуммаИмущественногоВычета = СтрокаВычета.СуммаРасходов
						- СтрокаВычета.ПредоставленныйВычетПоРасходам;// спишем весь остаток расходов

					Если СтрокаВычета.ПроцентыПоКредиту - СтрокаВычета.ПредоставленныйВычетПоПроцентам > 0 Тогда
						// если есть возможность списать проценты, то пробуем
						СтрокаПредоставленногоВычета = ТаблицаПредоставленногоИмущественногоВычета.Добавить();
						СтрокаПредоставленногоВычета.Сотрудник = СтрокаВычета.Сотрудник;
						СтрокаПредоставленногоВычета.КодВычета = Справочники.ВычетыНДФЛ.Код312; //вычет по процентам
						
						// Сумма начисления, уменьшенная на сумму вычетов, и за вычетом предоставленного имущественного вычета по расходам
						// это и есть сумма остатка списания
						СуммаОстаткаСписания =  СтрокаВычета.СуммаНачисления - СтрокаВычета.СуммаВычетов
							- (СтрокаВычета.СуммаРасходов - СтрокаВычета.ПредоставленныйВычетПоРасходам);

						СтрокаПредоставленногоВычета.СуммаИмущественногоВычета = Мин(СуммаОстаткаСписания, // списываем весь остаток от начисления

							СтрокаВычета.ПроцентыПоКредиту - СтрокаВычета.ПредоставленныйВычетПоПроцентам); // списываем весь остаток вычета
					КонецЕсли;

				КонецЕсли;
			ИначеЕсли СтрокаВычета.ПроцентыПоКредиту > СтрокаВычета.ПредоставленныйВычетПоПроцентам Тогда
				// списываем проценты
				Если СтрокаВычета.ПроцентыПоКредиту - СтрокаВычета.ПредоставленныйВычетПоПроцентам > 0 Тогда

					СтрокаПредоставленногоВычета = ТаблицаПредоставленногоИмущественногоВычета.Добавить();
					СтрокаПредоставленногоВычета.Сотрудник = СтрокаВычета.Сотрудник;
					СтрокаПредоставленногоВычета.КодВычета = Справочники.ВычетыНДФЛ.Код312; //вычет по процентам

					СуммаОстаткаСписания =  СтрокаВычета.СуммаНачисления - СтрокаВычета.СуммаВычетов;

					СтрокаПредоставленногоВычета.СуммаИмущественногоВычета = Мин(СуммаОстаткаСписания, // списываем весь остаток от начисления

						СтрокаВычета.ПроцентыПоКредиту - СтрокаВычета.ПредоставленныйВычетПоПроцентам); // списываем весь остаток вычета
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Запрос.Текст = "
				   |ВЫБРАТЬ
				   |	Т.Сотрудник,
				   |	Т.КодВычета,
				   |	Т.СуммаИмущественногоВычета
				   |ПОМЕСТИТЬ
				   |	ВтПредоставленныйИмущественныйВычет
				   |ИЗ
				   |	&ВтПредоставленныйИмущественныйВычет КАК Т
				   |;";

	Запрос.УстановитьПараметр("ВтПредоставленныйИмущественныйВычет", ТаблицаПредоставленногоИмущественногоВычета);
	Запрос.Выполнить();

	Запрос.Параметры.Удалить("ВтПредоставленныйИмущественныйВычет");

КонецПроцедуры

// Обрабатывает ситуацию с имущественными вычетами сотрудника
// Разбивает на несколько строк в том случае, когда необходимо разбить на основную часть
// и проценты
// Параметры:
//   Запрос - Запрос - объект запроса с временной таблицей социальных вычетов ВТСоциальныйВычет
//
&НаСервере
Процедура ОбработатьВременнуюТаблицуПредоставленныхСоциальныхВычетов(Запрос)

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТСоциальныйВычет.Сотрудник,
	|	ВТСоциальныйВычет.СуммаРасходов,
	|	ВТСоциальныйВычет.КодВычета,
	|	ВТСоциальныйВычет.ПредоставленныйВычетПоРасходам,
	|	isnull(ВтСотрудники.Сумма,0) КАК СуммаНачисления,
	|	isnull(ПредоставленныеВычеты.СуммаВычетов,0) КАК СуммаВычетов
	|ИЗ
	|	ВТСоциальныйВычет КАК ВТСоциальныйВычет
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|			СУММА(ВложенныйЗапрос.СуммаВычетов) КАК СуммаВычетов
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВтПредоставленныеВычетыНаДетей.Сотрудник КАК Сотрудник,
	|				ВтПредоставленныеВычетыНаДетей.СуммаВычетаНаДетей КАК СуммаВычетов
	|			ИЗ
	|				ВтПредоставленныеВычетыНаДетей КАК ВтПредоставленныеВычетыНаДетей
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ВтПредоставленныйЛичныйВычет.Сотрудник,
	|				ВтПредоставленныйЛичныйВычет.СуммаЛичногоВычета
	|			ИЗ
	|				ВтПредоставленныйЛичныйВычет КАК ВтПредоставленныйЛичныйВычет
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ВтПредоставленныйИмущественныйВычет.Сотрудник,
	|				ВтПредоставленныйИмущественныйВычет.СуммаИмущественногоВычета
	|			ИЗ
	|				ВтПредоставленныйИмущественныйВычет КАК ВтПредоставленныйИмущественныйВычет) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Сотрудник) КАК ПредоставленныеВычеты
	|		ПО ВТСоциальныйВычет.Сотрудник = ПредоставленныеВычеты.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудники КАК ВтСотрудники
	|		ПО ВТСоциальныйВычет.Сотрудник = ВтСотрудники.Сотрудник";
	ТаблицаСоциальныхВычетов = Запрос.Выполнить().Выгрузить();
	ТаблицаПредоставленногоСоциальногоВычета = Новый ТаблицаЗначений;
	ТаблицаПредоставленногоСоциальногоВычета.Колонки.Добавить("Сотрудник",
		Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаПредоставленногоСоциальногоВычета.Колонки.Добавить("КодВычета",
		Новый ОписаниеТипов("СправочникСсылка.ВычетыНДФЛ"));
	ТаблицаПредоставленногоСоциальногоВычета.Колонки.Добавить("СуммаСоциальногоВычета", Новый ОписаниеТипов("Число",
		Новый КвалификаторыЧисла(15, 2)));

	Для Каждого СтрокаВычета Из ТаблицаСоциальныхВычетов Цикл
		
		// проверим, есть ли вообще смысл в предоставлении вычета
		Если СтрокаВычета.СуммаНачисления > СтрокаВычета.СуммаВычетов Тогда

			Если СтрокаВычета.СуммаРасходов > СтрокаВычета.ПредоставленныйВычетПоРасходам Тогда
				// Вычет по расходам еще предоставлен не в полном объеме
				// значит сначала гасим его

				Если СтрокаВычета.СуммаРасходов - СтрокаВычета.ПредоставленныйВычетПоРасходам
					>= СтрокаВычета.СуммаНачисления - СтрокаВычета.СуммаВычетов Тогда
					// Сумма вычета по расходам больше, чем мы можем списать из текущего начисления
					// поэтому вычет применяем на все оставшееся начисление

					СтрокаПредоставленногоВычета = ТаблицаПредоставленногоСоциальногоВычета.Добавить();
					СтрокаПредоставленногоВычета.Сотрудник = СтрокаВычета.Сотрудник;
					СтрокаПредоставленногоВычета.КодВычета = СтрокаВычета.КодВычета; //вычет по расходам
					СтрокаПредоставленногоВычета.СуммаСоциальногоВычета = СтрокаВычета.СуммаНачисления
						- СтрокаВычета.СуммаВычетов;//спишем весь остаток начисления в вычет

				Иначе
					// Сумма вычета по расходам меньше, чем текущее начисление,
					// поэтому списываем сначала расходы, а затем пробуем проценты

					СтрокаПредоставленногоВычета = ТаблицаПредоставленногоСоциальногоВычета.Добавить();
					СтрокаПредоставленногоВычета.Сотрудник = СтрокаВычета.Сотрудник;
					СтрокаПредоставленногоВычета.КодВычета = СтрокаВычета.КодВычета; //вычет по расходам
					СтрокаПредоставленногоВычета.СуммаСоциальногоВычета = СтрокаВычета.СуммаРасходов
						- СтрокаВычета.ПредоставленныйВычетПоРасходам;// спишем весь остаток расходов

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Запрос.Текст = "
				   |ВЫБРАТЬ
				   |	Т.Сотрудник,
				   |	Т.КодВычета,
				   |	Т.СуммаСоциальногоВычета
				   |ПОМЕСТИТЬ
				   |	ВтПредоставленныйСоциальныйВычет
				   |ИЗ
				   |	&ВтПредоставленныйСоциальныйВычет КАК Т
				   |;";

	Запрос.УстановитьПараметр("ВтПредоставленныйСоциальныйВычет", ТаблицаПредоставленногоСоциальногоВычета);
	Запрос.Выполнить();

	Запрос.Параметры.Удалить("ВтПредоставленныйСоциальныйВычет");

КонецПроцедуры

&НаСервере
Процедура РассчитатьНДФЛПоПрогрессивнойШкале(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВтСотрудники.Сотрудник КАК Сотрудник,
	|	СУММА(ВтСотрудники.Сумма) КАК Сумма,
	|	КодыДоходовНДФЛ.СтавкаНДФЛ КАК СтавкаНДФЛ
	|ИЗ
	|	ВтНачисления КАК ВтСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНачисленийИУдержаний КАК ВидыНачисленийИУдержаний
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыДоходовНДФЛ КАК КодыДоходовНДФЛ
	|			ПО ВидыНачисленийИУдержаний.КодДоходаНДФЛ = КодыДоходовНДФЛ.Ссылка
	|		ПО ВтСотрудники.ВидНачисления = ВидыНачисленийИУдержаний.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтСотрудники.Сотрудник,
	|	КодыДоходовНДФЛ.СтавкаНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	СУММА(ВложенныйЗапрос.СуммаВычета) КАК СуммаВычета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВтПредоставленныеВычетыНаДетей.Сотрудник КАК Сотрудник,
	|		ВтПредоставленныеВычетыНаДетей.СуммаВычетаНаДетей КАК СуммаВычета
	|	ИЗ
	|		ВтПредоставленныеВычетыНаДетей КАК ВтПредоставленныеВычетыНаДетей
	|	ГДЕ
	|		ВтПредоставленныеВычетыНаДетей.СуммаВычетаНаДетей <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВтПредоставленныйЛичныйВычет.Сотрудник,
	|		ВтПредоставленныйЛичныйВычет.СуммаЛичногоВычета
	|	ИЗ
	|		ВтПредоставленныйЛичныйВычет КАК ВтПредоставленныйЛичныйВычет
	|	ГДЕ
	|		ВтПредоставленныйЛичныйВычет.СуммаЛичногоВычета <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВтПредоставленныйИмущественныйВычет.Сотрудник,
	|		ВтПредоставленныйИмущественныйВычет.СуммаИмущественногоВычета
	|	ИЗ
	|		ВтПредоставленныйИмущественныйВычет КАК ВтПредоставленныйИмущественныйВычет
	|	ГДЕ
	|		ВтПредоставленныйИмущественныйВычет.СуммаИмущественногоВычета <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВтПредоставленныйСоциальныйВычет.Сотрудник,
	|		ВтПредоставленныйСоциальныйВычет.СуммаСоциальногоВычета
	|	ИЗ
	|		ВтПредоставленныйСоциальныйВычет КАК ВтПредоставленныйСоциальныйВычет
	|	ГДЕ
	|		ВтПредоставленныйСоциальныйВычет.СуммаСоциальногоВычета <> 0) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтСотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВтНачисления КАК ВтСотрудники";

	Пакет = Запрос.ВыполнитьПакет();
	
	ТаблицаНачислений = Пакет[0].Выгрузить();
	ТаблицаВычетов =  Пакет[1].Выгрузить();
	ТаблицаСотрудников = Пакет[2].Выгрузить();

	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленияИУдержанияОбороты.Организация КАК Организация,
	|	НачисленияИУдержанияОбороты.Сотрудник КАК Сотрудник,
	|	НачисленияИУдержанияОбороты.Регистратор КАК Регистратор,
	|	НачисленияИУдержанияОбороты.СуммаВалОборот КАК СуммаВалНарастающимИтогом
	|ПОМЕСТИТЬ ВТНачисленияДоходы
	|ИЗ
	|	РегистрНакопления.НачисленияИУдержания.Обороты(НАЧАЛОПЕРИОДА(&ПериодРегистрации, ГОД),, Регистратор, Сотрудник В
	|		(ВЫБРАТЬ
	|			ВтНачисления.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВтНачисления КАК ВтНачисления)
	|	И ПериодРегистрации <= &ПериодРегистрации
	|	И ВидНачисленияУдержания.Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание))) КАК НачисленияИУдержанияОбороты
	|ГДЕ
	|	НачисленияИУдержанияОбороты.Регистратор <> &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачисления.Сотрудник КАК Сотрудник,
	|	ВТНачисления.СуммаВалНарастающимИтогом КАК СуммаВалНарастающимИтогом
	|ПОМЕСТИТЬ ВТНачисленияВычеты
	|ИЗ
	|	ВТНачисленияДоходы КАК ВТНачисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ПО ВТНачисления.Регистратор = ЗаказПокупателя.Ссылка
	|		И ЗаказПокупателя.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТНачисления.Сотрудник КАК Сотрудник,
	|	ВТНачисления.СуммаВалНарастающимИтогом КАК СуммаВалНарастающимИтогом
	|ИЗ
	|	ВТНачисленияДоходы КАК ВТНачисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СдельныйНаряд КАК СдельныйНаряд
	|		ПО ВТНачисления.Регистратор = СдельныйНаряд.Ссылка
	|		И СдельныйНаряд.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТНачисления.Сотрудник КАК Сотрудник,
	|	ВТНачисления.СуммаВалНарастающимИтогом КАК СуммаВалНарастающимИтогом
	|ИЗ
	|	ВТНачисленияДоходы КАК ВТНачисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплатыУНФ КАК НачислениеЗарплатыУНФ
	|		ПО ВТНачисления.Регистратор = НачислениеЗарплатыУНФ.Ссылка
	|		И НачислениеЗарплатыУНФ.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТНачисления.Сотрудник КАК Сотрудник,
	|	ВТНачисления.СуммаВалНарастающимИтогом КАК СуммаВалНарастающимИтогом
	|ИЗ
	|	ВТНачисленияДоходы КАК ВТНачисления
	|ГДЕ
	|	ВТНачисления.Организация = &Организация
	|	И (НЕ ВТНачисления.Регистратор ССЫЛКА Документ.ЗаказПокупателя
	|	И НЕ ВТНачисления.Регистратор ССЫЛКА Документ.СдельныйНаряд
	|	И НЕ ВТНачисления.Регистратор ССЫЛКА Документ.НачислениеЗарплатыУНФ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПримененныеВычетыПоНДФЛОбороты.Сотрудник,
	|	-ПримененныеВычетыПоНДФЛОбороты.СуммаВычетаОборот
	|ИЗ
	|	РегистрНакопления.ПримененныеВычетыПоНДФЛ.Обороты(НАЧАЛОПЕРИОДА(&ПериодРегистрации, ГОД),,,
	|	Организация = &Организация
	|	И Сотрудник В
	|		(ВЫБРАТЬ
	|			ВТНачисления.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТНачисления КАК ВТНачисления)
	|	И ПериодРегистрации <= &ПериодРегистрации) КАК ПримененныеВычетыПоНДФЛОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачисленияВычеты.Сотрудник КАК Сотрудник,
	|	СУММА(ВТНачисленияВычеты.СуммаВалНарастающимИтогом) КАК СуммаВалНарастающимИтогом
	|ИЗ
	|	ВТНачисленияВычеты КАК ВТНачисленияВычеты
	|СГРУППИРОВАТЬ ПО
	|	ВТНачисленияВычеты.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТНачисленияДоходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТНачисленияВычеты";

	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	ТаблицаДоходыСНачалаГода = Запрос.Выполнить().Выгрузить();
	
	ТипНачисленоНалога = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	ТаблицаНачислений.Колонки.Добавить("СуммаНалога", ТипНачисленоНалога);
	ТаблицаНачислений.Колонки.Добавить("СуммаНалогаСПревышения1", ТипНачисленоНалога); 
	ТаблицаНачислений.Колонки.Добавить("СуммаНалогаСПревышения2", ТипНачисленоНалога); 
	ТаблицаНачислений.Колонки.Добавить("СуммаНалогаСПревышения3", ТипНачисленоНалога); 
	ТаблицаНачислений.Колонки.Добавить("СуммаНалогаСПревышения4", ТипНачисленоНалога); 
	
	ГраницыНалоговойБазы = УчетНДФЛПредпринимателяКлиентСервер.ГраницыНалоговойБазыДляПримененияПовышеннойСтавки(
		Объект.Дата);

	СтруктураОтбораСтрок = Новый Структура("Сотрудник");
	СтавкиНДФЛ = Новый Структура("СтавкаНДФЛ", 0);
	Для Индекс = 1 По 3 Цикл
		СтавкиНДФЛ.Вставить("СтавкаНДФЛПовышенная" + Индекс, 0);
	КонецЦикла;
	
	СтавкаНДФЛРезидента = 13;
	СтавкиНДФЛ = УчетНДФЛПредпринимателяКлиентСервер.НалоговыеСтавкиПоУмолчанию(Объект.Дата);
	
	Для Каждого СтрокаСТекущимСотрудником Из ТаблицаСотрудников Цикл
		ТекущийСотрудник = СтрокаСТекущимСотрудником.Сотрудник;
		
		//@skip-check module-unused-local-variable
		НачисленоСНачалаГода = 0;
		НачисленоВсего = 0;
		ДоступноВычетов = 0;
		
		СтрокаНачисленоСНачалаГода = ТаблицаДоходыСНачалаГода.Найти(ТекущийСотрудник, "Сотрудник");
		Если СтрокаНачисленоСНачалаГода <> Неопределено Тогда
			НачисленоСНачалаГода = СтрокаНачисленоСНачалаГода.СуммаВалНарастающимИтогом;
		КонецЕсли;
		НачисленоВсего = НачисленоСНачалаГода;

		СтрокаВычетов = ТаблицаВычетов.Найти(ТекущийСотрудник, "Сотрудник");
		Если СтрокаВычетов <> Неопределено Тогда
			ДоступноВычетов = СтрокаВычетов.СуммаВычета;
		КонецЕсли;

		СтруктураОтбораСтрок.Сотрудник = ТекущийСотрудник;
		СтрокиНачисленийТекущегоСотрудника = ТаблицаНачислений.НайтиСтроки(СтруктураОтбораСтрок);

		Для Каждого СтрокаНачислено Из СтрокиНачисленийТекущегоСотрудника Цикл
			
			Если СтрокаНачислено.Сумма <= 0 Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтавкиНДФЛ, СтрокаНачислено);
			
			СуммаВычета = Мин(СтрокаНачислено.Сумма, ДоступноВычетов);
			СтрокаНачислено.Сумма = СтрокаНачислено.Сумма - СуммаВычета;
			ДоступноВычетов = ДоступноВычетов - СуммаВычета;
			
			Если СтрокаНачислено.СтавкаНДФЛ = СтавкаНДФЛРезидента Тогда
				СуммыНДФЛ = СуммыНДФЛПоГраницамДохода(НачисленоВсего, СтрокаНачислено.Сумма,
					ГраницыНалоговойБазы, СтавкиНДФЛ);
				ЗаполнитьЗначенияСвойств(СтрокаНачислено, СуммыНДФЛ);
			Иначе
				СтрокаНачислено.СуммаНалога = СуммаНДФЛ(СтрокаНачислено.Сумма, СтрокаНачислено.СтавкаНДФЛ);
			КонецЕсли;
			НачисленоВсего = НачисленоВсего + СтрокаНачислено.Сумма;
		КонецЦикла;

	КонецЦикла;
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Подготовим временную таблицу для последующей обработки
	Запрос.УстановитьПараметр("ТаблицаДляВТНалогНДФЛ", ТаблицаНачислений);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ПериодДокумента КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДляВТНалогНДФЛ.Сотрудник КАК Сотрудник,
	|	ТаблицаДляВТНалогНДФЛ.СуммаНалога КАК Сумма,
	|	ТаблицаДляВТНалогНДФЛ.СуммаНалогаСПревышения1 КАК СуммаСПревышения,
	|	ТаблицаДляВТНалогНДФЛ.СуммаНалогаСПревышения2 КАК СуммаСПревышенияПоСтавке18,
	|	ТаблицаДляВТНалогНДФЛ.СуммаНалогаСПревышения3 КАК СуммаСПревышенияПоСтавке20,
	|	ТаблицаДляВТНалогНДФЛ.СуммаНалогаСПревышения4 КАК СуммаСПревышенияПоСтавке22
	|ПОМЕСТИТЬ ВТНДФЛНалог
	|ИЗ
	|	&ТаблицаДляВТНалогНДФЛ КАК ТаблицаДляВТНалогНДФЛ
	|ГДЕ
	|	ТаблицаДляВТНалогНДФЛ.СуммаНалога
	|	+ ТаблицаДляВТНалогНДФЛ.СуммаНалогаСПревышения1
	|	+ ТаблицаДляВТНалогНДФЛ.СуммаНалогаСПревышения2
	|	+ ТаблицаДляВТНалогНДФЛ.СуммаНалогаСПревышения3
	|	+ ТаблицаДляВТНалогНДФЛ.СуммаНалогаСПревышения4 > 0";

	Запрос.Выполнить();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СуммыНДФЛПоГраницамДохода(Знач СуммаВсего, Знач СуммаТекущая, Знач ГраницыПревышения, Знач СтавкиНДФЛ)
	
	Результат = Новый Структура("СуммаНалога", 0);
	
	КоличествоПределов = 4;
	СуммаРаспределить = СуммаТекущая;
	Для Шаг = 0 По КоличествоПределов - 1 Цикл
		
		НомерПредела = КоличествоПределов - Шаг;
		СвойствоПредел = СтрШаблон("Предел%1", НомерПредела);
		СвойствоНалог = СтрШаблон("СуммаНалогаСПревышения%1", НомерПредела);
		СвойствоСтавка = СтрШаблон("СтавкаНДФЛПовышенная%1", НомерПредела);
		
		Результат.Вставить(СвойствоНалог, 0);
		ГраницаТекущая = ГраницыПревышения[СвойствоПредел];
		Если НЕ ЗначениеЗаполнено(ГраницаТекущая) Тогда
			Продолжить;
		КонецЕсли;
		
		Превышение = СуммаВсего + СуммаРаспределить - ГраницаТекущая;
		Если Превышение <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Доход = Мин(Превышение, СуммаРаспределить);
		СуммаРаспределить = СуммаРаспределить - Доход;
		
		Результат[СвойствоНалог] = СуммаНДФЛ(Доход, СтавкиНДФЛ[СвойствоСтавка]);	
		
	КонецЦикла;
	
	Если СуммаРаспределить > 0 Тогда
		Результат.СуммаНалога = СуммаНДФЛ(СуммаРаспределить, СтавкиНДФЛ.СтавкаНДФЛ);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СуммаНДФЛ(Знач Доход, Знач Ставка)
	
	Возврат Окр(Доход * Ставка / 100, 0, 1);
	
КонецФункции

// Обрабатывает ситуацию, когда сумма вычетов на детей больше, чем сумма начислений
// в текущем периоде работнику
// Параметры:
//   Запрос - Запрос - объект запроса с временной таблицей стандартных вычетов на детей ВтПредоставленныеВычетыНаДетей
//
&НаСервере
Процедура ОбработатьВременнуюТаблицуПредоставленныхВычетовНаДетей(Запрос)

	Запрос.Текст = "
				   |ВЫБРАТЬ * 
				   |ИЗ ВтПредоставленныеВычетыНаДетей 
				   |УПОРЯДОЧИТЬ ПО 
				   |	ВтПредоставленныеВычетыНаДетей.Сотрудник";
	
	// Получим таблицу вычетов на детей
	ТаблицаВычетовНаДетей = Запрос.Выполнить().Выгрузить();
	
	// Проверим все строки по каждому сотруднику и определим те, в которых сумма вычета
	// превышает сумму начислений, такие строки удалим или скорректируем
	КоличествоСтрок = ТаблицаВычетовНаДетей.Количество();

	СчетчикВычетаСотрудника = 0;
	ПредыдущийСотрудник = Неопределено;
	УдалитьПоследующиеСтроки = Ложь;
	Индекс = 0;
	Пока Индекс < КоличествоСтрок Цикл

		ТекущаяСтрока = ТаблицаВычетовНаДетей[Индекс];
		
		// Если перешли к обработки нового сотрудника, то сбрасываем все счетчики
		Если ПредыдущийСотрудник <> ТекущаяСтрока.Сотрудник Тогда
			ПредыдущийСотрудник = ТекущаяСтрока.Сотрудник;
			УдалитьПоследующиеСтроки = Ложь;
			СчетчикВычетаСотрудника = 0;
		КонецЕсли;

		Если УдалитьПоследующиеСтроки Тогда

			ТаблицаВычетовНаДетей.Удалить(ТекущаяСтрока);
			КоличествоСтрок = КоличествоСтрок - 1;
			
			// продолжаем, пока сотрудник не сменится
			Продолжить;
		КонецЕсли;
		
		// Если накопленная сумма вычета с учетом текущей строки больше, чем сумма начисления,
		// то сумму вычета уменьшаем до соответствующей величины и следующие строки удаляем
		Если ТекущаяСтрока.СуммаВычетаНаДетей + СчетчикВычетаСотрудника > ТекущаяСтрока.Сумма Тогда

			ТекущаяСтрока.СуммаВычетаНаДетей = ТекущаяСтрока.Сумма - СчетчикВычетаСотрудника;
			УдалитьПоследующиеСтроки = Истина;
			
		// Если накопленная сумма вычета с учетом текущей строки равна начислению, 
		// то последующие строки удаляем
		ИначеЕсли ТекущаяСтрока.СуммаВычетаНаДетей + СчетчикВычетаСотрудника = ТекущаяСтрока.Сумма Тогда

			УдалитьПоследующиеСтроки = Истина;

		Иначе
			
			// накапливаем сумму вычетов по детям в разрезе сотрудника
			СчетчикВычетаСотрудника = СчетчикВычетаСотрудника + ТекущаяСтрока.СуммаВычетаНаДетей;

		КонецЕсли;

		Индекс = Индекс + 1;

	КонецЦикла;
	
	// Подменяем таблицу
	Запрос.Текст = "
				   |УНИЧТОЖИТЬ ВтПредоставленныеВычетыНаДетей
				   |;
				   |////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	Т.Сотрудник,
				   |	Т.КодВычета,
				   |	Т.СуммаВычетаНаДетей
				   |ПОМЕСТИТЬ ВтПредоставленныеВычетыНаДетей 
				   |ИЗ &ВтПредоставленныеВычетыНаДетей КАК Т
				   |;";

	Запрос.УстановитьПараметр("ВтПредоставленныеВычетыНаДетей", ТаблицаВычетовНаДетей);
	Запрос.ВыполнитьПакет();
	Запрос.Параметры.Удалить("ВтПредоставленныеВычетыНаДетей");

КонецПроцедуры

&НаСервере
Процедура РассчитатьПоФормуламИНалогиИВзносы()

	РассчитатьПоФормулам();
	РассчитатьНалогиИВзносы();
	ОбновитьПодвалФормы();

КонецПроцедуры

// Получает набор данных с сервера для реквизита СчетЗатрат табличной части НачисленияИУдержания.
//
// Параметры:
//   СчетЗатрат - ПланСчетовСсылка.Управленческий
//
// Возвращаемое значение:
//   Структура
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеСчетаЗатрат(Знач СчетЗатрат)

	СтруктураДанных = Новый Структура("ТипСчета", Неопределено);
	Если ЗначениеЗаполнено(СчетЗатрат) Тогда

		СтруктураДанных.ТипСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетЗатрат, "ТипСчета");

	КонецЕсли;

	Возврат СтруктураДанных;

КонецФункции // ПолучитьДанныеСчетаЗатрат()

&НаСервере
Процедура ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты)

	ДокументыУНФ.ДатаПриИзменении(ДанныеДляИзмененияДаты, ЭтотОбъект, Объект);

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()

	ДокументыУНФ.ОрганизацияПриИзменении(ЭтотОбъект, Объект);

КонецПроцедуры

&НаСервере
// Процедура обновляет данные в подвале формы.
//
Процедура ОбновитьПодвалФормы()

	Документ = РеквизитФормыВЗначение("Объект");
	СтруктураИтогов = Документ.ПолучитьСуммуДокумента();
	СуммаДокумента = СтруктураИтогов.СуммаДокумента;
	СуммаНачислено = СтруктураИтогов.СуммаНачислено;
	СуммаУдержано = СтруктураИтогов.СуммаУдержано;
	СуммаПогашено = СтруктураИтогов.СуммаПогашено;
	СуммаВзносов = СтруктураИтогов.СуммаВзносов;

КонецПроцедуры // ОбновитьПодвалФормы()

&НаКлиенте
Функция ЗаполненыТарифыВзносов(ПроцедураПослеВопроса)
	
	ТекстВопроса = "";
	РассчитыватьБезВзносов = Ложь;
	Расшифровка = Новый Структура;
	
	Если ПроверитьЗаполнениеРеквизитовОрганизацииДляРасчетаВзносов(Объект.Организация, Объект.ПериодРегистрации,
		ТекстВопроса, РассчитыватьБезВзносов, Расшифровка) Тогда
	
		Возврат Истина;
	КонецЕсли;
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Заполнить'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Рассчитать без взносов'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
		
	ПараметрыОповещения = Новый Структура("Расшифровка, ПроцедураВыполнения", Расшифровка, ПроцедураПослеВопроса);
	ОповещениеОтвет = Новый ОписаниеОповещения("ЗаполнитьРеквизитыОрганизацииЗавершение", ЭтотОбъект,
		ПараметрыОповещения);
	ПоказатьВопрос(ОповещениеОтвет, ТекстВопроса, СписокКнопок);

	Возврат Ложь;

КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьЗаполнениеРеквизитовОрганизацииДляРасчетаВзносов(Знач Организация, Знач ДатаАнализа,
	ТекстВопроса, РассчитыватьБезВзносов, Расшифровка)

	УчетНалогов = ПолучитьФункциональнуюОпцию("ВестиУчетНалогаНаДоходыИВзносов");
	Если Не УчетНалогов Тогда
		РассчитыватьБезВзносов = Истина;
		Возврат Истина;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифыСтраховыхВзносов.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ТарифыСтраховыхВзносов.ВидТарифа КАК ВидТарифа
	|ПОМЕСТИТЬ ВТТарифыСтраховыхВзносов
	|ИЗ
	|	РегистрСведений.ПрименяемыеТарифыСтраховыхВзносовУНФ.СрезПоследних(&ДатаАнализа,
	|		ГоловнаяОрганизация = &Организация) КАК ТарифыСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.ИспользуетсяОтчетность КАК ИспользуетсяОтчетность,
	|	Организации.ТарифНаТравматизм КАК ТарифНаТравматизм,
	|	ТарифыСтраховыхВзносов.ВидТарифа КАК ВидТарифа
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыСтраховыхВзносов КАК ТарифыСтраховыхВзносов
	|		ПО ТарифыСтраховыхВзносов.ГоловнаяОрганизация = &Организация
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаАнализа", ДатаАнализа);

	Расшифровка = Новый Структура;
	Расшифровка.Вставить("ТипРасшифровки", "Объектная");
	Расшифровка.Вставить("ЗначениеРасшифровки", Организация);
	ПоляСОшибками = Новый Соответствие;

	СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
	Организация, ТекущаяДатаСеанса());

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не Выборка.ИспользуетсяОтчетность Тогда
		РассчитыватьБезВзносов = Истина;
		Возврат Истина;
	КонецЕсли;
	
	ЗаполненТарифНаТравматизм = Выборка.ТарифНаТравматизм > 0 Или (СистемаНалогообложения.ПрименяетсяАУСН
				И РегистрыСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.РазмерФиксированныхВзносовОтНесчастныхСлучаевЗаполнен());

	ЗаполненТарифСтраховыхВзносов = ЗначениеЗаполнено(Выборка.ВидТарифа);
				
	Если Не ЗаполненТарифНаТравматизм Тогда
		ТекстВопроса = НСтр("ru = 'В организации не заполнен тариф на травматизм. Заполнить?'");
		ПоляСОшибками.Вставить("Объект.ТарифНаТравматизм", НСтр("ru='Не указан тариф на травматизм'"));
	КонецЕсли;
	
	Если Не ЗаполненТарифСтраховыхВзносов Тогда
		ТекстВопроса = НСтр("ru = 'В организации не заполнен тариф страховых взносов. Заполнить?'");
		ПоляСОшибками.Вставить("КлючТарифаСтраховыхВзносов.ВидТарифа", НСтр("ru='Не указан тариф страховых взносов'"));
	КонецЕсли;

	Если Не ЗаполненТарифНаТравматизм И Не ЗаполненТарифСтраховыхВзносов Тогда
		ТекстВопроса = НСтр(
					"ru = 'В организации не заполнены тариф на травматизм и тариф страховых взносов. Заполнить?'");
	КонецЕсли;
	
	Если ПоляСОшибками.Количество() > 0 Тогда
		Расшифровка.Вставить("ПараметрыРасшифровки", ПоляСОшибками);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаСервереБезКонтекста
Процедура ПолучитьСчетЗатратВзноса(СтруктураПараметров)

	ЗарплатаИПерсоналСлужебный.ПолучитьСчетЗатратВидаНачисления(СтруктураПараметров);
	СтруктураПараметров.СчетЗатрат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СтруктураПараметров.ВидНачисленияУдержания, "СчетЗатрат");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипСчетаЗатрат(Строка, ТипыСчетовЗатрат)
	
	Если НЕ ЗначениеЗаполнено(Строка.СчетЗатрат) Тогда
		Возврат;
	КонецЕсли;
	
	ТипСчета = ТипыСчетовЗатрат.Получить(Строка.СчетЗатрат);
	Если ТипСчета = Неопределено Тогда
		ТипСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.СчетЗатрат, "ТипСчета");
		Если ТипСчета = Неопределено Тогда
			ТипСчета = Перечисления.ТипыСчетов.ПустаяСсылка();
		КонецЕсли;
		ТипыСчетовЗатрат.Вставить(Строка.СчетЗатрат, ТипСчета);
	КонецЕсли;
	Строка.ТипСчета = ТипСчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораМенюРасшифровки(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент <> Неопределено И ВыбранныйЭлемент.Значение = "РасшифроватьЗначение" Тогда

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Объект.Организация);
		СтруктураПараметров.Вставить("Сотрудник", ДополнительныеПараметры.Сотрудник);

		Период = Новый СтандартныйПериод;
		Период.ДатаНачала = НачалоМесяца(Объект.ПериодРегистрации);
		Период.ДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);

		СтруктураПараметров.Вставить("Период", Период);
		СтруктураПараметров.Вставить("ДатаПолученияПравил", КонецМесяца(Объект.ПериодРегистрации));

		ПараметрыФормыОтчетаРасшифровки = Новый Структура;
		ПараметрыФормыОтчетаРасшифровки.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормыОтчетаРасшифровки.Вставить("Отбор", СтруктураПараметров);

		ОткрытьФорму("Отчет.РасшифровкаНачисленийПремийПродавцам.Форма", ПараметрыФормыОтчетаРасшифровки, ЭтотОбъект);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаймыСотрудникам()

	Объект.ПогашениеЗаймов.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ СотрудникиПодразделения
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиСрезПоследних.Сотрудник КАК Сотрудник
	|	ИЗ
	|		РегистрСведений.Сотрудники.СрезПоследних(&НачалоМесяца, Организация = &Организация) КАК СотрудникиСрезПоследних
	|	ГДЕ
	|		СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Сотрудники.Сотрудник
	|	ИЗ
	|		РегистрСведений.Сотрудники КАК Сотрудники
	|	ГДЕ
	|		Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		И Сотрудники.Период МЕЖДУ &НачалоМесяца И &ОкончаниеМесяца
	|		И Сотрудники.Организация = &Организация) КАК ВложенныйЗапрос
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма КАК ДоговорЗаймаСотруднику,
	|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов КАК ВалютаРасчетов,
	|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалПриход КАК ОсновнойДолгВалВыплачено,
	|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалРасход КАК ОсновнойДолгПогашеноРанее,
	|	РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалПриход КАК ПроцентыВалНачислено,
	|	РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалРасход КАК ПроцентыВалПогашено,
	|	РасчетыПоКредитамИЗаймамОбороты.КомиссияВалПриход КАК КомиссияВалНачислено,
	|	РасчетыПоКредитамИЗаймамОбороты.КомиссияВалРасход КАК КомиссияВалПогашено
	|ПОМЕСТИТЬ ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений
	|ИЗ
	|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Обороты(
	|			,
	|			,
	|			,
	|			ДоговорКредитаЗайма.ПогашатьИзЗаработнойПлаты
	|				И Организация = &Организация
	|				И ДоговорКредитаЗайма.ВидДоговора = &ВидДоговораДоговорЗаймаСотруднику
	|				И ВидДоговора = &ВидДоговораДоговорЗаймаСотруднику
	|				И ДоговорКредитаЗайма.ВалютаРасчетов = &Валюта
	|				И Контрагент В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						СотрудникиПодразделения.Сотрудник
	|					ИЗ
	|						СотрудникиПодразделения КАК СотрудникиПодразделения)) КАК РасчетыПоКредитамИЗаймамОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыПоКредитамИЗаймам.ДоговорКредитаЗайма,
	|	РасчетыПоКредитамИЗаймам.ДоговорКредитаЗайма.ВалютаРасчетов,
	|	ВЫБОР
	|		КОГДА РасчетыПоКредитамИЗаймам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -РасчетыПоКредитамИЗаймам.ОсновнойДолгВал
	|		ИНАЧЕ РасчетыПоКредитамИЗаймам.ОсновнойДолгВал
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыПоКредитамИЗаймам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -РасчетыПоКредитамИЗаймам.ОсновнойДолгВал
	|		ИНАЧЕ РасчетыПоКредитамИЗаймам.ОсновнойДолгВал
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыПоКредитамИЗаймам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -РасчетыПоКредитамИЗаймам.ПроцентыВал
	|		ИНАЧЕ РасчетыПоКредитамИЗаймам.ПроцентыВал
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыПоКредитамИЗаймам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -РасчетыПоКредитамИЗаймам.ПроцентыВал
	|		ИНАЧЕ РасчетыПоКредитамИЗаймам.ПроцентыВал
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыПоКредитамИЗаймам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -РасчетыПоКредитамИЗаймам.КомиссияВал
	|		ИНАЧЕ РасчетыПоКредитамИЗаймам.КомиссияВал
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыПоКредитамИЗаймам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -РасчетыПоКредитамИЗаймам.КомиссияВал
	|		ИНАЧЕ РасчетыПоКредитамИЗаймам.КомиссияВал
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.РасчетыПоКредитамИЗаймам КАК РасчетыПоКредитамИЗаймам
	|ГДЕ
	|	РасчетыПоКредитамИЗаймам.Регистратор = &Ссылка
	|	И РасчетыПоКредитамИЗаймам.ДоговорКредитаЗайма.ПогашатьИзЗаработнойПлаты
	|	И РасчетыПоКредитамИЗаймам.Организация = &Организация
	|	И РасчетыПоКредитамИЗаймам.ДоговорКредитаЗайма.ВидДоговора = &ВидДоговораДоговорЗаймаСотруднику
	|	И РасчетыПоКредитамИЗаймам.ВидДоговора = &ВидДоговораДоговорЗаймаСотруднику
	|	И РасчетыПоКредитамИЗаймам.Контрагент В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				СотрудникиПодразделения.Сотрудник
	|			ИЗ
	|				СотрудникиПодразделения КАК СотрудникиПодразделения)
	|	И РасчетыПоКредитамИЗаймам.ДоговорКредитаЗайма.ВалютаРасчетов = &Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений.ДоговорЗаймаСотруднику,
	|	ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений.ВалютаРасчетов,
	|	СУММА(ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений.ОсновнойДолгВалВыплачено) КАК ОсновнойДолгВалВыплачено,
	|	СУММА(ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений.ОсновнойДолгПогашеноРанее) КАК ОсновнойДолгПогашеноРанее,
	|	СУММА(ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений.ПроцентыВалНачислено) КАК ПроцентыВалНачислено,
	|	СУММА(ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений.ПроцентыВалПогашено) КАК ПроцентыВалПогашено,
	|	СУММА(ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений.КомиссияВалНачислено) КАК КомиссияВалНачислено,
	|	СУММА(ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений.КомиссияВалПогашено) КАК КомиссияВалПогашено
	|ПОМЕСТИТЬ ВременнаяТаблицаСуммыНачисленныеИПогашенные
	|ИЗ
	|	ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений КАК ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений.ДоговорЗаймаСотруднику,
	|	ВременнаяТаблицаСуммыНачисленныеИПогашенныеСУчетомДвижений.ВалютаРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикПогашенияКредитовИЗаймов.ДоговорКредитаЗайма,
	|	ГрафикПогашенияКредитовИЗаймов.ДоговорКредитаЗайма.ВалютаРасчетов,
	|	СУММА(ГрафикПогашенияКредитовИЗаймов.СуммаОсновногоДолга) КАК СуммаОсновногоДолгаГрафик,
	|	СУММА(ГрафикПогашенияКредитовИЗаймов.СуммаПроцентов) КАК СуммаПроцентовГрафик,
	|	СУММА(ГрафикПогашенияКредитовИЗаймов.СуммаКомиссии) КАК СуммаКомиссииГрафик
	|ПОМЕСТИТЬ ВременнаяТаблицаСуммыКоторыеДолжныПогасить
	|ИЗ
	|	СотрудникиПодразделения КАК СотрудникиПодразделения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикПогашенияКредитовИЗаймов КАК ГрафикПогашенияКредитовИЗаймов
	|		ПО СотрудникиПодразделения.Сотрудник = ГрафикПогашенияКредитовИЗаймов.ДоговорКредитаЗайма.Сотрудник
	|ГДЕ
	|	ГрафикПогашенияКредитовИЗаймов.Период <= &ОкончаниеМесяца
	|	И ГрафикПогашенияКредитовИЗаймов.ДоговорКредитаЗайма.ВалютаРасчетов = &Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикПогашенияКредитовИЗаймов.ДоговорКредитаЗайма,
	|	ГрафикПогашенияКредитовИЗаймов.ДоговорКредитаЗайма.ВалютаРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСуммыКоторыеДолжныПогасить.ДоговорКредитаЗайма КАК ДоговорЗаймаСотруднику,
	|	ВременнаяТаблицаСуммыКоторыеДолжныПогасить.ДоговорКредитаЗаймаВалютаРасчетов КАК ВалютаРасчетов,
	|	ВременнаяТаблицаСуммыКоторыеДолжныПогасить.СуммаОсновногоДолгаГрафик,
	|	ВременнаяТаблицаСуммыКоторыеДолжныПогасить.СуммаПроцентовГрафик,
	|	ВременнаяТаблицаСуммыКоторыеДолжныПогасить.СуммаКомиссииГрафик,
	|	ЕСТЬNULL(ВременнаяТаблицаСуммыНачисленныеИПогашенные.ОсновнойДолгВалВыплачено, 0) КАК ОсновнойДолгВалВыплачено,
	|	ЕСТЬNULL(ВременнаяТаблицаСуммыНачисленныеИПогашенные.ОсновнойДолгПогашеноРанее, 0) КАК ОсновнойДолгПогашеноРанее,
	|	ЕСТЬNULL(ВременнаяТаблицаСуммыНачисленныеИПогашенные.ПроцентыВалНачислено, 0) КАК ПроцентыВалНачислено,
	|	ЕСТЬNULL(ВременнаяТаблицаСуммыНачисленныеИПогашенные.ПроцентыВалПогашено, 0) КАК ПроцентыВалПогашено,
	|	ЕСТЬNULL(ВременнаяТаблицаСуммыНачисленныеИПогашенные.КомиссияВалНачислено, 0) КАК КомиссияВалНачислено,
	|	ЕСТЬNULL(ВременнаяТаблицаСуммыНачисленныеИПогашенные.КомиссияВалПогашено, 0) КАК КомиссияВалПогашено,
	|	ВременнаяТаблицаСуммыКоторыеДолжныПогасить.ДоговорКредитаЗайма.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаСуммыКоторыеДолжныПогасить.ДоговорКредитаЗайма.СуммаДокумента КАК ОбщаяСуммаЗайма
	|ИЗ
	|	ВременнаяТаблицаСуммыКоторыеДолжныПогасить КАК ВременнаяТаблицаСуммыКоторыеДолжныПогасить
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммыНачисленныеИПогашенные КАК ВременнаяТаблицаСуммыНачисленныеИПогашенные
	|		ПО ВременнаяТаблицаСуммыКоторыеДолжныПогасить.ДоговорКредитаЗайма = ВременнаяТаблицаСуммыНачисленныеИПогашенные.ДоговорЗаймаСотруднику";

	Запрос.УстановитьПараметр("ВидДоговораДоговорЗаймаСотруднику",
		Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику);
	Запрос.Параметры.Вставить("НачалоМесяца", Объект.ПериодРегистрации);
	Запрос.Параметры.Вставить("ОкончаниеМесяца", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.Параметры.Вставить("Организация", Константы.УчетПоКомпании.Компания(Объект.Организация));
	Запрос.Параметры.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.Параметры.Вставить("Валюта", Объект.ВалютаДокумента);
	Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		// Если деньги по договору займа ещё не выплатили, то погашать не будем.
		Если Выборка.ОсновнойДолгВалВыплачено = 0 Тогда
			Продолжить;
		КонецЕсли;

		НужноПогаситьЗайма = Выборка.СуммаОсновногоДолгаГрафик - Выборка.ОсновнойДолгПогашеноРанее;
		НужноПогаситьЗайма = ?(НужноПогаситьЗайма < 0, 0, НужноПогаситьЗайма);
		НужноПогаситьЗайма = ?(Выборка.ОсновнойДолгПогашеноРанее > Выборка.ОбщаяСуммаЗайма, 0, НужноПогаситьЗайма);

		НачисленоПроцентов = (Выборка.СуммаПроцентовГрафик + Выборка.СуммаКомиссииГрафик)
			- (Выборка.ПроцентыВалНачислено + Выборка.КомиссияВалНачислено);
		НачисленоПроцентов = ?(НачисленоПроцентов < 0, 0, НачисленоПроцентов);

		ПогашеноПроцентов = (Выборка.СуммаПроцентовГрафик + Выборка.СуммаКомиссииГрафик) - (Выборка.ПроцентыВалПогашено
			+ Выборка.КомиссияВалПогашено);
		ПогашеноПроцентов = ?(ПогашеноПроцентов < 0, 0, ПогашеноПроцентов);

		Если НужноПогаситьЗайма > 0 Или НачисленоПроцентов > 0 Тогда
			НоваяСтрока = Объект.ПогашениеЗаймов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.ПогашеноЗайма = НужноПогаситьЗайма;
			НоваяСтрока.НачисленоПроцентов = НачисленоПроцентов;
			НоваяСтрока.ПогашеноПроцентов = ПогашеноПроцентов;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды

// @skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

// @skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти