#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОтзыва = ТекущаяДатаСеанса(); 
	
	УстановитьВидимостьИДоступностьЭлементовФормыДляИнтерфейсаКлиентскогоПриложенияВерсия8_5();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы.ИмяФормы = "Справочник.МашиночитаемыеДоверенностиОрганизаций.Форма.ФормаПросмотра" 
		ИЛИ ВладелецФормы.ИмяФормы = "Справочник.МашиночитаемыеДоверенностиОрганизаций.Форма.ФормаСписка"
		ИЛИ ВладелецФормы.ИмяФормы = "Справочник.МЧД003.Форма.ФормаПросмотра" 
		ИЛИ ВладелецФормы.ИмяФормы = "Справочник.МЧД003.Форма.ФормаПросмотра85" Тогда
			
		ТекстЗаголовка = НСтр(
			"ru = 'Пометка доверенности отозванной заблокирует возможность использования при подписании документов.'");
		Элементы.Декорация.Заголовок = ТекстЗаголовка;	
	
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометитьОтозванной(Команда)
	
	Закрыть(ДатаОтзыва);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементовФормыДляИнтерфейсаКлиентскогоПриложенияВерсия8_5()
	
	Если КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5 Тогда
		Элементы.Отмена.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти