
#Область ОбработчикиСобытий

Функция GetItems(ModificationDate, GroupCode) Экспорт
	
	Попытка
		
		Возврат ИнтеграцияСИнтернетМагазиномСервер.ПолучитьКлассификаторИКаталогВебСервис(ModificationDate, GroupCode);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации("ИнтеграцияСИнтернетМагазином.SiteExchange.GetItems",
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецФункции

Функция GetAmountAndPrices(ModificationDate, GroupCode, WarehouseCode, OrganizationCode) Экспорт
	
	Попытка
		
		Возврат ИнтеграцияСИнтернетМагазиномСервер.ПолучитьОстаткиИЦеныВебСервис(ModificationDate, GroupCode, WarehouseCode, OrganizationCode);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации("ИнтеграцияСИнтернетМагазином.SiteExchange.GetAmountAndPrices",
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецФункции

Функция GetOrders(ModificationDate) Экспорт
	
	Попытка
		
		Возврат ИнтеграцияСИнтернетМагазиномСервер.ПолучитьЗаказыВебСервис(ModificationDate);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации("ИнтеграцияСИнтернетМагазином.SiteExchange.GetOrders",
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецФункции

Функция LoadOrders(OrdersData) Экспорт
	
	Попытка
		
		Возврат ИнтеграцияСИнтернетМагазиномСервер.ЗагрузитьЗаказыВебСервис(OrdersData);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации("ИнтеграцияСИнтернетМагазином.SiteExchange.LoadOrders",
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецФункции

Функция GetPicture(ItemID) Экспорт
	
	Попытка
		
		Возврат ИнтеграцияСИнтернетМагазиномСервер.ПолучитьКартинкуВебСервис(ItemID);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации("ИнтеграцияСИнтернетМагазином.SiteExchange.GetPicture",
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти

