
#Область СлужебныеПроцедурыИФункции

Функция ДокументМенеджерОтменяющейЗаявки(ОтменяемаяЗаявка) Экспорт

	Возврат Неопределено;

КонецФункции

Функция ДокументМенеджерПоТипуОбъекта(ТипОбъекта, Объект) Экспорт
	
	Возврат Неопределено;

КонецФункции

Функция КоличествоДнейОтпуска(Сотрудник, ДатаНачала, ДатаОкончания) Экспорт

	Возврат ЗаявкиСотрудниковБазовый.КоличествоДнейОтпуска(Сотрудник, ДатаНачала, ДатаОкончания);

КонецФункции

Процедура ЗаполнитьДанныеПоВидамОтпусков(Объект, ДанныеПоВидамОтпусков) Экспорт

КонецПроцедуры

Процедура УстановитьНовуюФотографию(Форма) Экспорт

КонецПроцедуры

Процедура ЗаполнитьФайлыОтветаЗаявокДляВыгрузки(Заявки, ТипДанных, ТаблицаФайлов) Экспорт


КонецПроцедуры

Функция ВладелецЗаявкаСотрудника(Ссылки) Экспорт
	
	Возврат ЗаявкиСотрудниковБазовый.ВладелецЗаявкаСотрудника(Ссылки);
	
КонецФункции

Процедура ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек) Экспорт
	
КонецПроцедуры

Функция МестаПозицийВСтруктуреПредприятия(Позиции, ДатаПолученияДанных) Экспорт

	Возврат ЗаявкиСотрудниковБазовый.МестаПозицийВСтруктуреПредприятия(Позиции);

КонецФункции

Функция ПодписанныеФайлыЗаявок() Экспорт

	Возврат Неопределено;

КонецФункции

Функция ТипЗаявкаСотрудникаСправкаСМестаРаботы() Экспорт

	Возврат ЗаявкиСотрудниковБазовый.ТипЗаявкаСотрудникаСправкаСМестаРаботы();

КонецФункции

Функция ТипЗаявкаСотрудникаСправкаОстаткиОтпусков() Экспорт

	Возврат ЗаявкиСотрудниковБазовый.ТипЗаявкаСотрудникаСправкаОстаткиОтпусков();

КонецФункции

Функция ЗаявкаВыполненаАвтоматически(ЗаявкаОбъект) Экспорт

	Возврат Ложь;

КонецФункции

Процедура СоздатьБронированиеБилетовПроживания(ЗаявкаОбъект, ДанныеДляБронирования) Экспорт


КонецПроцедуры

Процедура ДополнитьРолиИсполнителейЗадач(Роли) Экспорт


КонецПроцедуры

Процедура УдалитьНедоступныеРолиИсполнителейЗадач(Роли) Экспорт


КонецПроцедуры

Процедура ПриНачальномЗаполненииРолейИсполнителей(КодыЯзыков, Элементы, ТабличныеЧасти, ОбъектАдресацииПодразделение) Экспорт

КонецПроцедуры

#КонецОбласти