
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТорговыйОбъект = Параметры.ТорговыйОбъект;
	ИспользоватьЦифровуюКлавиатуру = Параметры.ИспользоватьЦифровуюКлавиатуру;
	НастроитьКассировДляВхода = Параметры.НастроитьКассировДляВхода;
	ИнтерфейсРМКСлужебный.ПрименитьНаФормеМасштабИзПараметров(ЭтотОбъект, Параметры);
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		Элементы.ИзображениеСтоп.Высота = 6;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормыЭлементовШапкиФормы

&НаКлиенте
Процедура ГиперссылкаАвторизацияНажатие(Элемент)
	
	ПоказатьОкноАвторизации();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьОкноАвторизации()
	
	ВозможныеНазначенияАвторизации = ИнтерфейсРМКСлужебныйКлиентСервер.НазначенияАвторизации();
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ТорговыйОбъект", ТорговыйОбъект);
	ПараметрыОткрытия.Вставить("Кассир", Неопределено);
	ПараметрыОткрытия.Вставить("ИспользоватьЦифровуюКлавиатуру", ИспользоватьЦифровуюКлавиатуру);
	ПараметрыОткрытия.Вставить("НастроитьКассировДляВхода", НастроитьКассировДляВхода);
	ПараметрыОткрытия.Вставить("РежимКассыСамообслуживания", Истина);
	ПараметрыОткрытия.Вставить("НазначениеАвторизации", ВозможныеНазначенияАвторизации.РазблокировкаКСО);
	ПараметрыОткрытия.Вставить("НеобходимоеПраво", "");
	ПараметрыОткрытия.Вставить("ТекстАвторизации", "");
	ПараметрыОткрытия.Вставить("УвеличенныйВариантМасштаба", УвеличенныйВариантМасштаба);
	
	ОбработкаОповещения = Новый ОписаниеОповещения("АвторизацияЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаАвторизации", ПараметрыОткрытия, ЭтотОбъект,,,,
		ОбработкаОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И ЗначениеЗаполнено(Результат.ПользовательБД) Тогда
		Закрыть(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти