#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтражениеНДСКВычету(Команда)
	ОткрытьФорму("Документ.ОтражениеНДСКВычету.Форма.ФормаСписка", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеНулевойСтавкиНДС(Команда)
	ОткрытьФорму("Документ.ПодтверждениеНулевойСтавкиНДС.Форма.ФормаСписка", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеЗаписейКнигиПокупок(Команда)
	ОткрытьФорму("Документ.ФормированиеЗаписейКнигиПокупок.Форма.ФормаСписка", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеЗаписейКнигиПродаж(Команда)
	ОткрытьФорму("Документ.ФормированиеЗаписейКнигиПродаж.Форма.ФормаСписка", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеОВвозе(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Заявления о ввозе товаров'"));
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийВвозТоваровИзЕАЭС.ЗаявлениеОВвозе"));

	ОткрытьФорму("Документ.ЗаявлениеОВвозеТоваров.ФормаСписка", ПараметрыФормы,,"ФормаСписка_ЗаявлениеОВвозеТоваров");
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОПредстоящейПоставкеТоваров(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",  НСтр("ru = 'Документы о предстоящей поставке товаров (ДОПП)'"));
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийВвозТоваровИзЕАЭС.ДОПП"));
	
	ОткрытьФорму("Документ.ЗаявлениеОВвозеТоваров.ФормаСписка", ПараметрыФормы,,"ФормаСписка_ДОПП"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеОплатыНДСВБюджет(Команда)
	ОткрытьФорму("Документ.ПодтверждениеОплатыНДСВБюджет.ФормаСписка", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура СписаниеНДС(Команда)
	ОткрытьФорму("Документ.СписаниеНДС.Форма.ФормаСписка", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура КнигиПокупок(Команда)
	ОткрытьФорму("Отчет.КнигаПокупок.Форма.ФормаОтчета", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура КнигиПродаж(Команда)
	ОткрытьФорму("Отчет.КнигаПродаж.Форма.ФормаОтчета", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаСчетовФактур(Команда)
	ОткрытьФорму("Отчет.ЖурналУчетаСчетовФактур.Форма.ФормаОтчета", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура НаличиеСчетовФактур(Команда)
	ОткрытьФорму("Отчет.НаличиеСчетовФактур.Форма", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеЗаписейРаздела7ДекларацииНДС(Команда)
	ОткрытьФорму("Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.Форма.ФормаСписка", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияСчетФактурНаАванс(Команда)
	ОткрытьФорму("Обработка.РегистрацияСчетовФактурНаАванс.Форма", , , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПеренумерацияДокументов(Команда)
	ПараметрыПеренумерации = Новый Структура;
	ПараметрыПеренумерации.Вставить("Организация", ОрганизацияПоУмолчаню());
	ПараметрыПеренумерации.Вставить("НачалоПериода", НачалоКвартала(ТекущаяДата()));
	ПараметрыПеренумерации.Вставить("КонецПериода",  КонецКвартала(ТекущаяДата()));
	ПараметрыПеренумерации.Вставить("ВидДокументов", Новый ОписаниеТипов("ДокументСсылка.СчетФактура"));

	ОткрытьФорму("Обработка.ПеренумерацияДокументов.Форма.Форма", ПараметрыПеренумерации);
КонецПроцедуры

Функция ОрганизацияПоУмолчаню()
	
	Возврат Справочники.Организации.ОрганизацияПоУмолчанию();
	
КонецФункции
#КонецОбласти