#Область ПрограммныйИнтерфейс

// Обработчик события вызывается при получении имени кассира.
//
// Параметры:
//  ФискальноеУстройство - СправочникСсылка.ПодключаемоеОборудование.
//  ДополнительныеПараметры - Структура.
//
Процедура УправлениеФУЗаполнитьДополнительныеПараметрыПередОткрытиемСмены(ФискальноеУстройство, ДополнительныеПараметры) Экспорт

КонецПроцедуры

Процедура ЗакрытиеКассовойСменыПриЗаменеДрайвераОборудования(ПодключаемоеОборудование, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти
