
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОткрытьУзелОбмена = Параметры.ОткрытьУзелОбмена;
	СсылкаНаУзелОбмена = Параметры.СсылкаНаУзелОбмена;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОткрытьУзелОбмена Тогда
		ОписаниеУзлаОбменаВК = Новый Структура;
		ОписаниеУзлаОбменаВК.Вставить("Ключ" , СсылкаНаУзелОбмена);
		
		ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаУзлаВКонтакте", ОписаниеУзлаОбменаВК, 
		ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокИнтеграцияСМагазинамиСоцСетей" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
