////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы (УНФ)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииПодсистемы
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "УправлениеНебольшойФирмой";
	Описание.Версия = "3.0.13.363";
	Описание.ИдентификаторИнтернетПоддержки = "SmallBusiness";
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления 
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
#Область ПервыйЗапуск
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.0.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПервыйЗапуск_РазделенныеДанные";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.0.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПервыйЗапуск_ОбщиеДанные";
	Обработчик.ОбщиеДанные = Истина;
	
#КонецОбласти
	
#Область Обработчики_3_0_12

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.1";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c216f582-6097-4e07-a19c-96c07b4c4957");
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьПрефиксыШтучныхФасованныхТоваров";
	Обработчик.Комментарий = НСтр("ru = 'Установка префиксов для штучных фасованных товаров в правилах обмена с оборудованием.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.5";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Ложь;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ДобавитьОбновитьПолучательКазначейство";
	Обработчик.Комментарий = НСтр(
		"ru = 'Добавить обновить получатель казначейство'");

 	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьОсновныеСведенияКонтрагентов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("00c4bc7a-d6e8-45f4-a3e3-2b68e20805ec");
	Обработчик.Комментарий = НСтр("ru = 'Обновление основных сведений у контрагентов'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("89614927-9812-478b-8ed3-ccff752574ac");
	Обработчик.Процедура = "УправлениеКонтактнойИнформациейУНФ.ОбновитьВидыКонтактнойИнформацииВключитьХранениеИсторииАдресам";
	Обработчик.Комментарий = НСтр("ru = 'Включение хранения истории адресов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.18";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьОтчеты_3_0_12";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("fdbcf132-fa2f-4dbb-98d0-d3cc9707ab1b");
	Обработчик.Комментарий = НСтр("ru = 'Обновление настроек вариантов отчетов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.39";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "УчетАкцизовУНФ.ОбновитьСтавкиПоСпиртосодержащейПродукцииС01_01_2025";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("932258c8-bc60-4e1b-876f-c353c6980f22");
	Обработчик.Комментарий = НСтр("ru = 'Обновление ставок акцизов спиртосодержащей продукции с 01.05.2025'");
	
	Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.0.12.22";
    Обработчик.РежимВыполнения = "Отложенно";
    Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьВидыНалоговПоНДФЛРКИКС_2025";
    Обработчик.Идентификатор = Новый УникальныйИдентификатор("0f990d0b-3007-4ae1-8b73-6e0f9e60f309");
    Обработчик.Комментарий = НСтр("ru = 'Обработать виды налогов по НДФЛ РН и КС по ставкам 2025 года.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.72";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "РегистрыСведений.ТарифыСтраховыхВзносовУНФ.НачальноеЗаполнение";
	Обработчик.Комментарий = НСтр("ru = 'Установить новые тарифы страховых взносов'"); 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.204";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СтавкиНДС.СоздатьСтавки_НДС2026";
	Обработчик.Комментарий = НСтр("ru = 'Создание ставок НДС 22% для использования в 2026 году'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "3.0.12.217";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура           = "РегистрыСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.ЗаполнитьПоставляемыеДанные";
	Обработчик.НачальноеЗаполнение = Ложь; 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.223";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности";
	Обработчик.Комментарий = НСтр("ru = 'Загрузить календарь подготовки отчетности на 2025 год'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.226";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Ложь;
	Обработчик.Процедура = "ДанныеГосударственныхОрганов.ДобавитьМИДолПолучателяЕНП";
	Обработчик.Комментарий = НСтр(
		"ru = 'Изменение КПП при уплате ЕНП к 05.12.2025'");
	Обработчик.НачальноеЗаполнение = Истина;
	
#КонецОбласти

#Область Обработчики_3_0_13

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.22";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Константы.ИспользоватьПодсистемуМобильныйЛичныйКабинет.ОбновитьИспользованиеПодсистемыМЛК";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c5cdc41e-f1dc-40ca-b417-9c499c73973e");
	Обработчик.Комментарий = НСтр("ru = 'Обновление возможности использования подсистемы 1С:Кабинет клиента.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.35";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("776f3bdf-d229-48d2-8cf0-661497868c57");
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ВКонтактеПеренестиТокеныВБезопасноеХранилище";
	Обработчик.Комментарий = НСтр("ru = 'Перенос токенов ВКонтакте в безопасное хранилище.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.38";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПеренестиНастройкиРабочегоМеста";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("74d8d716-61f9-4b37-a69c-f02c334a1ef8");
	Обработчик.Комментарий = НСтр("ru = 'Перенос настроек старого РМК в новое РМК'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.40";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Справочники.НастройкиРассылкиСостояниеКомпании.Мигрировать";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("638dfca4-4074-43eb-b091-b0717b34b3c5");
	Обработчик.Комментарий = НСтр("ru = 'Мигрировать настройки рассылки ""Состояние компании""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.90";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЗаказНарядов.ОсветлитьЦветаПриОбновлении";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4af7ecf0-14a9-4027-ade4-7842d8c2a19e");
	Обработчик.Комментарий = НСтр("ru = 'Осветлить цвета состояний заказ-нарядов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.90";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЗаказовНаПеремещение.ОсветлитьЦветаПриОбновлении";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9404ae57-d77b-4097-8686-f8663b68341b");
	Обработчик.Комментарий = НСтр("ru = 'Осветлить цвета состояний заказов на перемещение'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.90";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЗаказовНаПроизводство.ОсветлитьЦветаПриОбновлении";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8630192e-2633-4086-b628-86594c14db57");
	Обработчик.Комментарий = НСтр("ru = 'Осветлить цвета состояний заказов на производство'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.90";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЗаказовПокупателей.ОсветлитьЦветаПриОбновлении";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("842be313-ad68-4f65-83c1-5d22f9c2598d");
	Обработчик.Комментарий = НСтр("ru = 'Осветлить цвета состояний заказов покупателей'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.90";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЗаказовПоставщикам.ОсветлитьЦветаПриОбновлении";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f3b6286c-1f47-4526-9c94-82b3ee1adaa2");
	Обработчик.Комментарий = НСтр("ru = 'Осветлить цвета состояний заказов поставщикам'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.90";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЛидов.ОсветлитьЦветаПриОбновлении";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9dc5a1c1-270a-45d1-995f-3423bb54aa64");
	Обработчик.Комментарий = НСтр("ru = 'Осветлить цвета состояний лидов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.90";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияСобытий.ОсветлитьЦветаПриОбновлении";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("021fb287-7e59-4ab0-880e-28a456b9a0e0");
	Обработчик.Комментарий = НСтр("ru = 'Осветлить цвета состояний событий'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.105";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПереводПодсистемыОбменССайтомНаИнтернетМагазин";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("70877adb-82ae-4255-bb4e-a66388bb3d7a");
	Обработчик.Комментарий = НСтр("ru = 'Перевод подсистемы ""Обмен с сайтом"" на ""Интеграция с интернет магазином"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.152";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьСхемуКомпоновкиДанныхШаблоновЧековККТ";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c140a38c-22df-460e-a379-8a0971913f26");
	Обработчик.Комментарий = НСтр("ru = 'Обновление шаблонов чеков ККТ'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.183";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьПроизвольныеУсловияСкидок";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("908e6869-a80e-497d-9d4e-4483b3a8ff90");
	Обработчик.Комментарий = НСтр("ru = 'Обновить сохраненные макеты произвольных условий скидок'");  
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.196";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Документы.КомплектацияЗапасов.ОбновитьРеквизитыПоложениеСкладаПоУмолчанию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1636f2a7-fdd7-4dc3-9a75-fd852a6cabd2");
	Обработчик.Комментарий = НСтр("ru = 'Обновить реквизиты склада в табличной части документов Комплектации запасов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.203";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "РегистрыСведений.МРОТ.НачальноеЗаполнение";
	Обработчик.Комментарий = НСтр("ru = 'Установить значение МРОТ для упр. учета'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.203";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносовУНФ.УстановитьПредельнуюВеличинуБазыСтраховыхВзносов";
	Обработчик.Комментарий = НСтр("ru = 'Установить значение предельной величины базы страховых взносов для упр. учета'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.203";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "РегистрыСведений.ТарифыСтраховыхВзносовУНФ.НачальноеЗаполнение";
	Обработчик.Комментарий = НСтр("ru = 'Установить новые тарифы страховых взносов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.203";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура           = "ИнтеграцияБЗКБУНФ.ОбновитьНачисленияРКиСН";
	Обработчик.Комментарий = НСтр("ru = 'Создать доли начислений Районный коэффициент и Северная надбавка'");
	Обработчик.НачальноеЗаполнение  = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.206";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ДополнитьОписаниеИСАлкогольнойПродукции";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c1ad0ebe-7a55-4432-b46f-d13055a4744f");
	Обработчик.Комментарий = НСтр("ru = 'Дополняет описание ИС алкогольной продукции, у которой не заполнен ""Вид продукции ИС""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.227";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьОтчеты_3_0_13";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("019a0c5d-19e1-735c-bea2-8697264c4895");
	Обработчик.Комментарий = НСтр("ru = 'Обновить настройки отчетов для версии 3.0.13'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.225";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Обработки.НачалоРаботыСПрограммой.УстановитьФОДляИспользованияОплатыПлатежнымиКартами";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("603b3b41-3730-468e-bb10-2e7d67c74583");
	Обработчик.Комментарий = НСтр("ru = 'Установить функциональную опцию для оплаты картами'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.227";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЗаказНарядов.ВернутьСтарыеЦветаТекста";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("02d4060e-5464-4540-802d-c856a460003d");
	Обработчик.Комментарий = НСтр("ru = 'Вернуть старые цвета текста состояний заказ-нарядов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.227";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЗаказовНаПеремещение.ВернутьСтарыеЦветаТекста";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("dbd702d3-deef-4470-8ace-12f877d0975f");
	Обработчик.Комментарий = НСтр("ru = 'Вернуть старые цвета текста состояний заказов на перемещение'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.227";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЗаказовНаПроизводство.ВернутьСтарыеЦветаТекста";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0abbe7fa-a0f7-47b8-abe1-c8d592acef28");
	Обработчик.Комментарий = НСтр("ru = 'Вернуть старые цвета текста состояний заказов на производство'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.227";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЗаказовПокупателей.ВернутьСтарыеЦветаТекста";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8aeaf03e-f118-44e5-b9a2-2a7a628abc1a");
	Обработчик.Комментарий = НСтр("ru = 'Вернуть старые цвета текста состояний заказов покупателей'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.227";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЗаказовПоставщикам.ВернутьСтарыеЦветаТекста";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("2b624a14-bb55-4cf5-bda9-12ca75550ef5");
	Обработчик.Комментарий = НСтр("ru = 'Вернуть старые цвета текста состояний заказов поставщикам'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.227";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияЛидов.ВернутьСтарыеЦветаТекста";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f00667c1-9733-403e-bd42-37559ca261eb");
	Обработчик.Комментарий = НСтр("ru = 'Вернуть старые цвета текста состояний лидов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.227";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СостоянияСобытий.ВернутьСтарыеЦветаТекста";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("668612b7-b2ef-4288-9a54-201954c28308");
	Обработчик.Комментарий = НСтр("ru = 'Вернуть старые цвета текста состояний событий'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.235";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "Справочники.ВычетыНДФЛ.ОписатьВычеты2026";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.235";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "Справочники.ВидыТарифовСтраховыхВзносовУНФ.ОписатьТарифНекоторыхСубъектовМСП";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.235";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "РегистрыСведений.ТарифыСтраховыхВзносовУНФ.НачальноеЗаполнение";
	Обработчик.Комментарий = НСтр("ru = 'Установить новые тарифы страховых взносов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.242";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "УчетАкцизовУНФ.ОбновитьСтавкиПоАкцизам";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7a1fd99c-5ab4-4370-bbb6-45f1f32b8039");
	Обработчик.Комментарий = НСтр("ru = 'Обновление ставок акцизов с 01.01.2026'"); 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.250";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПометитьНаУдалениеУстаревшиеШаблоныЧеков";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e7590181-beef-4a2c-9b6c-bc5156b626d5");
	Обработчик.Комментарий = НСтр("ru = 'Пометка на удаление устаревших шаблонов чеков'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.255";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УдалитьРегистрациюИнтерфейсыСеансовПользователей";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("bcc2a8a8-d741-4499-8dc2-d010d1af0b27");
	Обработчик.Комментарий = НСтр("ru = 'Удаление регистрации регистра сведений ИнтерфейсыСеансовПользователей из планов обмена'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.264";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ВидыПриложенийУНФ.ПереустановитьРасширениеВидаПриложения";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("5b32850a-bb17-437d-8fbb-ac6d3cb702a1");
	Обработчик.Комментарий = НСтр("ru = 'Переустановка расширения вида приложения'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.265";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("3553ba73-7ce7-47f0-aac0-c2d54519a7cf");
	Обработчик.Процедура = "ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение.НачальноеЗаполнениеСвойств1";
	Обработчик.Комментарий = НСтр("ru = 'Начальное заполнение свойств 1'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.272";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПометитьНаУдалениеУстаревшиеШаблоныЭтикетокИЦенников";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("5e1f976b-a1d9-47bd-a522-7e66ba2770c2");
	Обработчик.Комментарий = НСтр("ru = 'Пометка на удаление устаревших шаблонов этикеток и ценников'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.277";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьШаблоныЭтикетокИЦенников";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("858577c8-52ba-4666-bf6b-73eb203a3e7f");
	Обработчик.Комментарий = НСтр("ru = 'Обновить шаблоны этикеток и ценников'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.285";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьИспользованиеЛичногоКабинета";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d1cb12bf-3ccb-4002-b8eb-b0bd87f0b24b");
	Обработчик.Комментарий = НСтр("ru = 'Обновить использование личного кабинета'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.286";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f079f19d-9be7-4a42-a429-1d0ef4435a13");
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьСуммуДокументаСписаниеЗапасов";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение реквизита СуммаДокумента в документе СписаниеЗапасов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.292";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьФлагиОтсрочкиНачисленийБаллов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c04bb317-13c9-4bf5-a1da-7b90a720a7d1");
	Обработчик.Комментарий = НСтр("ru = 'Исправить несогласованность флагов отсрочки в бонусных программах'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.298";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьВидыНалоговЕНП";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8b560bad-fe23-4e1f-90ca-372dfc20e719");
	Обработчик.Комментарий = НСтр("ru = 'Обработать виды налогов по ЕНП.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.320";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("2a0b15b6-4328-43d9-9fcb-2440b10b4d60");
	Обработчик.Процедура = "ПроизводствоСервер.ОбновлениеРегистраЭтапыПроизводства";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение новых измерений в регистре накопления ЭтапыПроизводства'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.345";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.Организации.УстановитьСтатусФизическогоЛицаДляИП";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("5e1f976b-a1d9-47bd-a522-7e66ba275aa4");
	Обработчик.Комментарий = НСтр("ru = 'Установить статус физического лица для ИП'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.351";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8926225d-4b94-40c4-bcbf-3013b24f4c93");
	Обработчик.Комментарий = НСтр("ru = 'Заполнить обеспечительный платеж при ввозе товаров из ЕАЭС'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия               = "ОтладкаОбработчика";
	Обработчик.Процедура            = "Документы.ЗаявлениеОВвозеТоваров.ЗаполнитьВидОперацииПоУмолчанию";
	Обработчик.Комментарий          = НСтр("ru = 'Устанавливает реквизит ""Вид операции"" в документе ""Ввоз товаров из ЕАЭС""'");
	Обработчик.РежимВыполнения      = "Отложенно";
	Обработчик.Идентификатор        = Новый УникальныйИдентификатор("e0e8985a-9580-4d09-9d1f-816e0a700228");
	
#КонецОбласти

КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПередОбновлениемИнформационнойБазы
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПослеОбновленияИнформационнойБазы
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия, Знач ВыполненныеОбработчики,
	ВыводитьОписаниеОбновлений, Знач МонопольныйРежим) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриПодготовкеМакетаОписанияОбновлений
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	Возврат;
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковПереходаСДругойПрограммы
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	Если СтрНачинаетсяС(Метаданные.Имя, "Розница") Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.ПредыдущееИмяКонфигурации = "Розница";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьСлужебныеФункциональныеОпцииВозможностейПриложений";
		
	Иначе
		
		Обработчик = Обработчики.Добавить();
		Обработчик.ПредыдущееИмяКонфигурации = "Розница";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновлениеРозницыДоУНФ";
		
		Обработчик = Обработчики.Добавить();
		Обработчик.ПредыдущееИмяКонфигурации = "РозницаБазовая";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновлениеРозницыДоУНФ";
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриОпределенииНастроек
Процедура ПриОпределенииНастроекОбновленияИнформационнойБазы(Параметры) Экспорт
	
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.АвтоматическиеСкидки);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.Валюты);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыДокументовФизическихЛиц);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыДоходовПоСтраховымВзносамУНФ);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыЗаказНарядов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыЗаказовПокупателей);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыНалогов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыНачисленийИУдержаний);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыРабочегоВремени);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыЦен);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ДополнительныеУсловия);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ИсточникиПривлеченияПокупателей);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.КатегорииНоменклатуры);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.Кассы);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.КлассификаторЕдиницИзмерения);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.КодыДоходовНДФЛ);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.НаправленияДеятельности);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.Организации);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПоказателиРасчетов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПочтовыеЯщики);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПараметрыРасчетовДоставки);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПричиныНеуспешногоЗавершенияРаботыСЛидом);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СегментыКонтрагентов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СлужбыДоставки);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовПокупателей);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказНарядов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПричиныОтменыЗаказа);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовПоставщикам);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПричиныОтменыЗаказовПоставщикам);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовНаПроизводство);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовНаПеремещение);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЛидов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияСобытий);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СтавкиНДС);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СтатьиДвиженияДенежныхСредств);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СтруктурныеЕдиницы);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СценарииПланирования);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ШаблоныЗаполненияГрафиковРабочегоВремени);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.ПланыСчетов.Управленческий);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.ПланыВидовХарактеристик.НастройкиПользователей);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.ПланыВидовХарактеристик.РеквизитыДляСписка);
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриОпределенииРежимаОбновленияДанных
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриЗавершенииПереходаСДругойПрограммы
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации,
	Параметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПервыйЗапуск_ОбщиеДанные

// (5.Общий) Заполняем справочник ОКУН
Процедура ЗагрузитьОКУН()
	
	Справочники.ОКУН.ЗагрузитьКлассификатор();
	Справочники.ОКУН.ПроставитьВидДеятельностиОКУН();
	
КонецПроцедуры

// (6.Общий) Заполняет РС КоэффициентДефлятор
//
Процедура ЗаполнитьКоэффициентДефлятор()
	
	// переписываем сразу весь набор
	Набор = РегистрыСведений.КоэффициентДефлятор.СоздатьНаборЗаписей();
	
	Запись = Набор.Добавить();
	Запись.Период = '20030101';
	Запись.Значение = 1;
	
	Запись = Набор.Добавить();
	Запись.Период = '20040101';
	Запись.Значение = 1.133;
	
	Запись = Набор.Добавить();
	Запись.Период = '20050101';
	Запись.Значение = 1.104;
	
	Запись = Набор.Добавить();
	Запись.Период = '20060101';
	Запись.Значение = 1.132;
	
	Запись = Набор.Добавить();
	Запись.Период = '20070101';
	Запись.Значение = 1.096;
	
	Запись = Набор.Добавить();
	Запись.Период = '20080101';
	Запись.Значение = 1.081;
	
	Запись = Набор.Добавить();
	Запись.Период = '20090101';
	Запись.Значение = 1.148;
	
	Запись = Набор.Добавить();
	Запись.Период = '20100101';
	Запись.Значение = 1.295;
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.Значение = 1.372;
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.Значение = 1.4942;
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.Значение = 1.569;
	
	Запись = Набор.Добавить();
	Запись.Период = '20140101';
	Запись.Значение = 1.672;
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.Значение = 1.798;
	
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.Значение = 1.798;
	
	Запись = Набор.Добавить();
	Запись.Период = '20180101';
	Запись.Значение = 1.868;
	
	Запись = Набор.Добавить();
	Запись.Период = '20190101';
	Запись.Значение = 1.915;
	
	Запись = Набор.Добавить();
	Запись.Период = '20200101';
	Запись.Значение = 2.005;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПервогоЗапуска

// Процедура заполняет пустую ИБ общими данными
//
// К данным относятся неразделенные сведения, например, глобальные настройки сервиса
//
Процедура ПервыйЗапуск_ОбщиеДанные() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		// 1. Заполним константу ИзвлекатьТекстыФайловНаСервере
		Константы.ИзвлекатьТекстыФайловНаСервере.Установить(Истина);
		Константы.ИспользоватьПроверкуКонтрагентов.Установить(Истина);
		
		// 2. Заполним календарь отчетности
		Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
		
		// 3. Загружаем  тарифы страховых взносов с предельными величинами
		Справочники.ВидыТарифовСтраховыхВзносовУНФ.НачальноеЗаполнение();
		// Тарифы должны видеть новые данные в ВидыТарифовСтраховыхВзносовУНФ 
		ОбновитьПовторноИспользуемыеЗначения();
		РегистрыСведений.ТарифыСтраховыхВзносовУНФ.НачальноеЗаполнение();
		РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносовУНФ.УстановитьПредельнуюВеличинуБазыСтраховыхВзносов();
		
		// 4. Заполняем виды предпринимательской деятельности
		Справочники.ВидыПредпринимательскойДеятельности.ЗаполнитьВидыПредпринимательскойДеятельности();
		
		// 5. Заполняем справочник ОКУН
		ЗагрузитьОКУН();
		
		// 6. Заполняем регистр сведений КоэффициентДефлятор
		ЗаполнитьКоэффициентДефлятор();
		
		// 7. Заполняем регистр сведений МРОТ
		РегистрыСведений.МРОТ.НачальноеЗаполнение();
		
		// 8. Заполняем справочник Вычеты НДФЛ
		Справочники.ВычетыНДФЛ.НачальноеЗаполнение();
		
		// 9. Заполним регистр сведений НДФЛРазмерВычетов.
		СотрудникиУНФ.ЗаполнитьРазмерыВычетовНДФЛ();
		
		// 10. Отчетность
		Справочники.ПараметрыИсчисляемогоСтраховогоСтажа.НачальноеЗаполнение();
		Справочники.ОснованияДосрочногоНазначенияПенсии.НачальноеЗаполнение();
		Справочники.ТерриториальныеУсловияПФР.НачальноеЗаполнение();
		РегистрыСведений.ФиксированныеВзносыИП.УстановитьФиксированныеВзносыИП();
		Справочники.ОснованияДосрочногоНазначенияПенсииДляСЗВК.НачальноеЗаполнение();
		Справочники.ОснованияУвольнения.НачальноеЗаполнение(); 
		Справочники.КлассификаторЗанятийУНФ.НачальноеЗаполнение();
		Справочники.ПричиныУвольненияПФР.НачальноеЗаполнение();
		
		РегистрыСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.ЗаполнитьПоставляемыеДанные();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию(); 
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка выполнения обработчика ПервыйЗапуск_ОбщиеДанные()'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
		
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Процедура заполняет пустую ИБ данными пользователей
//
Процедура ПервыйЗапуск_РазделенныеДанные() Экспорт
	
	НачатьТранзакцию();
	
	Попытка

		ВозможностиПриложения.ЗаполнитьОсновныеДанныеВсехВидовПриложений();
		
		НеобходимоВыполнитьПервыйЗапуск = Не ОбщегоНазначения.РазделениеВключено()
			И Не ВидыПриложенийУНФ.УстановленРежимЗапускаКомбинированноеПриложение();

		Если НеобходимоВыполнитьПервыйЗапуск Тогда
			Если ОбщегоНазначенияУНФ.ЭтоУНФ() Тогда
				ВозможностиПриложения.УстановитьВидПриложенияУНФ(Неопределено);
			ИначеЕсли ОбщегоНазначенияУНФ.ЭтоРозница() Тогда
				ВозможностиПриложения.УстановитьВидПриложенияРозница(Неопределено);
			Иначе
				// Ничего делать не требуется.
			КонецЕсли;
		КонецЕсли;
		
		//УстановитьКонстантуПодключаемоеОборудование(Неопределено);
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка выполнения обработчика ПервыйЗапуск_РазделенныеДанные()'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
		
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры // ПервыйЗапуск()

#КонецОбласти

#Область ОбработчикиПереходаСДругихПрограмм

// Обработчики перехода с розницы на УНФ
Процедура ОбновлениеРозницыДоУНФ() Экспорт
	
	ВозможностиПриложения.ОбновлениеРозницыДоУНФ();
	
КонецПроцедуры

Процедура УстановитьСлужебныеФункциональныеОпцииВозможностейПриложений() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТекущегоВидаПриложения = ВидыПриложенийСервер.ИмяТекущегоВидаПриложения();
	Если ПустаяСтрока(ИмяТекущегоВидаПриложения) Тогда
		ВозможностиПриложения.УстановитьВидПриложенияПустое(Неопределено);
		Константы.ТребуетсяКонтрольДоговоровКонтрагентовВДенежныхДокументах.Установить(Истина);
		Возврат;
	КонецЕсли;
	
	ЭтоБизнесПриложение = ВозможностиПриложения.ЭтоБизнесПриложение();
	ЭтоРозница = ВозможностиПриложения.ЭтоРозница();

	Константы.ПереносАдресатовЗавершен.Установить(Истина);
	Константы.ПереносКонтактовВАдресатыЗавершен.Установить(Истина);
	Константы.ПереносКонтактовЛидовВАдресатыЗавершен.Установить(Истина);
	Константы.ПереносКонтрагентовВАдресатыЗавершен.Установить(Истина);
	Константы.ПереносЛидовВАдресатыЗавершен.Установить(Истина);
	Константы.ПереносФизическихЛицВАдресатыЗавершен.Установить(Истина);
	
	Если Не ЭтоБизнесПриложение Тогда
	
		Константы.ИспользоватьАвансовыеОтчеты.Установить(Истина);
		Константы.ИспользоватьГоловнуюОрганизацию.Установить(Истина);
		Константы.ИспользоватьДоставкуВЗаказеПокупателя.Установить(Истина);
		Константы.ИспользоватьЗагрузкуДанныхИзБП3.Установить(Истина);
		Константы.ИспользоватьЗагрузкуДанныхИзИнтернетМагазина.Установить(Истина);
		Константы.ИспользоватьЗагрузкуДанныхИзРТ23.Установить(Истина);
		Константы.ИспользоватьЗагрузкуДанныхИзУТ103.Установить(Истина);
		Константы.ИспользоватьИнтеграцииСистемыВзаимодействия.Установить(Истина);
		Константы.ИспользоватьИсториюРеквизитов.Установить(Истина);
		Константы.ИспользоватьКассы.Установить(Истина);
		Константы.ИспользоватьКатегорииНоменклатуры.Установить(Истина);
		Константы.ИспользоватьКомплектации.Установить(Истина);
		Константы.ИспользоватьКонтактыКонтрагентов.Установить(Истина);
		Константы.ИспользоватьНастройкуФильтровПравойПанели.Установить(Истина);
		Константы.ИспользоватьНастройкуФормы.Установить(Истина);
		Константы.ИспользоватьПодсистемуКаналыПродаж.Установить(Истина);
		Константы.ИспользоватьПодсистемуТорговыеПредложения.Установить(Истина);
		Константы.ИспользоватьПроизводственныйКалендарь.Установить(Истина);
		Константы.ИспользоватьРаботуСНовостями.Установить(Истина);
		Константы.ИспользоватьРабочиеПроцессы.Установить(Истина);
		Константы.ИспользоватьСвязанныеДокументы.Установить(Истина);
		Константы.ИспользоватьСегментыКонтрагентов.Установить(Истина);
		Константы.ИспользоватьСогласияНаОбработкуПерсональныхДанных.Установить(Истина);
		Константы.ИспользоватьСопутствующиеТовары.Установить(Истина);
		Константы.ИспользоватьСправочникПользователи.Установить(Истина);
		Константы.ИспользоватьСправочникСотрудники.Установить(Истина);
		Константы.ИспользоватьСтруктурныеЕдиницы.Установить(Истина);
		Константы.ИспользоватьСчетаНаОплату.Установить(Истина);
		Константы.ИспользоватьСчетаФактуры.Установить(Истина);
		Константы.ИспользоватьТегиКонтрагентов.Установить(Истина);
		Константы.ИспользоватьТипыНоменклатуры.Установить(Истина);
		Константы.ИспользоватьУстановкуЦен.Установить(Истина);
		Константы.ИспользоватьЧастичныеОплаты.Установить(Истина);
		Константы.ИспользоватьЧастичныеОтгрузки.Установить(Истина);
		Константы.ИспользоватьШтрихкоды.Установить(Истина);
		Константы.ОтображатьВводНаОсновании.Установить(Истина);
		Константы.ОтображатьВзаиморасчеты.Установить(Истина);
		Константы.ОтображатьВсеСправочникиОсновнойРаздел.Установить(Истина);
		Константы.ОтображатьДополнительныеНаименованияВСправочниках.Установить(Истина);
		Константы.ОтображатьКартинкиНоменклатуры.Установить(Истина);
		Константы.ОтображатьОтчетыВФормеНоменклатуры.Установить(Истина);
		Константы.ОтображатьПлюсМагазинРасширений.Установить(Истина);
		Константы.ОтображатьПодсказкиРазделовЕБВ.Установить(Истина);
		Константы.ОтображатьРазделПомощь.Установить(Истина);
		Константы.ОтображатьРеквизитыЗакупкиПроизводстваВНоменклатуре.Установить(Истина);
		Константы.ОтображатьРеквизитыНалогообложения.Установить(Истина);
		Константы.ОтображатьСодержаниеДокументаВСписке.Установить(Истина);
		Константы.ОтображатьСтраницаПродуктаНаСайте1С.Установить(Истина);
		Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Установить(Истина);
		Константы.ИспользоватьОтчетыВыполненияЗаказов.Установить(Истина);
		Константы.ИспользоватьСервисыИнтеграций.Установить(Истина);
		Константы.ИспользоватьСервисыДоставки.Установить(Истина);
		Константы.ИспользоватьСинхронизациюСОблаком.Установить(Истина);
		Константы.ОтображатьСпискиДенежныхДокументов.Установить(Истина);
		Константы.ИспользоватьЗакрытиеМесяца.Установить(Истина); 
		Константы.ФункциональнаяОпцияИспользоватьСинхронизациюДанныхВПриложении.Установить(Истина);

		Если НЕ ЭтоРозница Тогда
			Константы.ИспользоватьАктыВыполненныхРабот.Установить(Истина);
			Константы.ОтображатьВыборВидаБизнеса.Установить(Истина);
		КонецЕсли;

		Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеОтчетыИОбработки") Тогда
			Константы.ОтображатьДополнительныеОбработки.Установить(Истина);
		КонецЕсли;

		Если ПолучитьФункциональнуюОпцию("РаботаВМоделиСервисаБТС") Тогда
			Константы.ОтображатьКомандуОплатаСервиса.Установить(Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	ВключенаПодсистемаУслуги = Константы.ИспользоватьПодсистемуУслуги.Получить();
	ВключенаПодсистемаРаботы = Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы.Получить();
	Если ВключенаПодсистемаРаботы И НЕ ВключенаПодсистемаУслуги Тогда
		Константы.ОтображатьПодсистемуРаботы.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_3_0_12

Процедура УстановитьПрефиксыШтучныхФасованныхТоваров(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПравилаОбменаСПодключаемымОборудованиемOffline.Ссылка
	|ИЗ
	|	Справочник.ПравилаОбменаСПодключаемымОборудованиемOffline КАК ПравилаОбменаСПодключаемымОборудованиемOffline
	|ГДЕ
	|	ПравилаОбменаСПодключаемымОборудованиемOffline.ПрефиксШтучногоФасованногоТовара = 0");
	
	НачатьТранзакцию();
	
	Попытка
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ПравилоОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПравилоОбъект.ПрефиксШтучногоФасованногоТовара = 3;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПравилоОбъект);
			
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьОбновитьПолучательКазначейство() Экспорт

	НачатьТранзакцию();
	
	Попытка
		
		ДанныеГосударственныхОрганов.ДобавитьОбновитьПолучательКазначейство();

		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика Добавить обновить получатель казначейство'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
	КонецПопытки;

	
КонецПроцедуры

Процедура ОбновитьОсновныеСведенияКонтрагентов(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ОсновныеСведенияАктуализированы = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Параметры.ОбработкаЗавершена = Ложь;
	МетаданныеСправочника = Метаданные.Справочники.Контрагенты;
	ПолноеИмяОбъекта = МетаданныеСправочника.ПолноеИмя();
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	ПлохиеДанные = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию(); 
		Попытка             

			ПричинаИсключения = "Блокировка";
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			КонтрагентОбъект = Выборка.Ссылка.ПолучитьОбъект();
			КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
			
			// Если объект ранее был удален или обработан другими сеансами, пропускаем его.
			Если КонтрагентОбъект = Неопределено
				Или КонтрагентОбъект.ОсновныеСведенияАктуализированы <> Ложь Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			КонтрагентОбъект.ОсновныеСведения = "";
			КонтрагентОбъект.СформироватьОсновныеСведения();
			КонтрагентОбъект.ОсновныеСведенияАктуализированы = Истина;
			
			ПричинаИсключения = "Запись";
			Если КонтрагентОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(КонтрагентОбъект);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось обработать контрагента по причине:
			|%1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.Контрагенты, КонтрагентОбъект.Ссылка, ТекстСообщения);
			
			// Если не удалось обработать какой-либо заказ из-за конфликта блокировки, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			Если ПричинаИсключения <> "Блокировка" Тогда
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Процедуре ОбновитьОсновныеСведенияКонтрагентов не удалось обработать некоторых контрагентов (пропущены): %1'"),
		ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.Контрагенты,,
		НСтр("ru = 'Процедура ОбновитьОсновныеСведенияКонтрагентов обработала очередную порцию контрагентов.'"));
		Для Каждого НеобработанныйОбъект Из ПлохиеДанные Цикл
			ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(НеобработанныйОбъект.Ключ,
			НеобработанныйОбъект.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьОтчеты_3_0_12(ПараметрыОбработчика) Экспорт
	
	ОтчетыКОбновлению = Новый Массив;
	
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ДенежныеСредстваВКассахККМ);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ВыполнениеЭтаповПроизводства);
	
	ОтчетыУНФ.ОбновитьОтчетыВыборочно(ОтчетыКОбновлению);
	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ОбновитьВидыНалоговПоНДФЛРКИКС_2025(ПараметрыОбработчика) Экспорт
		
	ЕстьОшибки = Ложь;  
	
	РегистрыСведений.ЗначенияКБК.ЗагрузитьЗначенияКБК();

	НачатьТранзакцию();
	
	Попытка
		
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		
		// НДФЛ РН и КС   
		
		ЭлементНДФЛСотрудники = Справочники.ВидыНалогов.НДФЛДоходыРКИСН.ПолучитьОбъект();
		ЭлементНДФЛСотрудники.Наименование = НСтр("ru = 'НДФЛ исчисленный налоговым агентом по РК и СН'",
		КодОсновногоЯзыка);
		ЭлементНДФЛСотрудники.Код = "00-000029";        
		ЭлементНДФЛСотрудники.КодБК = "18210102210011000110";
		ЭлементНДФЛСотрудники.ВидНалога = Перечисления.ВидыНалогов.НДФЛ; 
		Справочники.ВидыНалогов.ЗаполнитьСчетаУчета(ЭлементНДФЛСотрудники);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементНДФЛСотрудники);
		
		// НДФЛ РН и КС 15% 
		
        ЭлементНДФЛСотрудники = Справочники.ВидыНалогов.НДФЛДоходыРКИСНСвышеПредельнойВеличины.ПолучитьОбъект();
		ЭлементНДФЛСотрудники.Наименование = НСтр("ru = 'НДФЛ исчисленный налоговым агентом по РК и СН (15%)'",
		КодОсновногоЯзыка);
		ЭлементНДФЛСотрудники.Код = "00-000030";        
		ЭлементНДФЛСотрудники.КодБК = "18210102230011000110";
		ЭлементНДФЛСотрудники.ВидНалога = Перечисления.ВидыНалогов.НДФЛ; 
		Справочники.ВидыНалогов.ЗаполнитьСчетаУчета(ЭлементНДФЛСотрудники);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементНДФЛСотрудники);

		// Конец НДФЛ   	
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика обновления видов налогов по НДФЛ'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ЕстьОшибки = Истина;
		
	КонецПопытки;
	
	ПараметрыОбработчика.ОбработкаЗавершена = НЕ ЕстьОшибки;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_3_0_13

Процедура ВКонтактеПеренестиТокеныВБезопасноеХранилище(ПараметрыОбработчика) Экспорт
	
	ЗапросТекст =
	"ВЫБРАТЬ
	|	ИнтеграцияСМагазинамиСоцСетей.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.ИнтеграцияСМагазинамиСоцСетей КАК ИнтеграцияСМагазинамиСоцСетей
	|ГДЕ
	|	ПОДСТРОКА(ИнтеграцияСМагазинамиСоцСетей.УдалитьТокенДоступа, 1, 10) > """"";

	ЗапросОбъект = Новый Запрос(ЗапросТекст);
	
	НачатьТранзакцию();
	
	Попытка
		
		ЗапросВыборка = ЗапросОбъект.Выполнить().Выбрать();
		Если ЗапросВыборка.Количество() = 0 Тогда
			ОтменитьТранзакцию();
			ПараметрыОбработчика.ОбработкаЗавершена = Истина;
			Возврат;
		КонецЕсли;
		
		АвторизацияВКонтактеПараметры = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.АвторизацияВКонтактеПараметрыНовый(
		ИнтеграцияСМагазинамиСоцСетейКлиентСервер.СпособАвторизацииOAUTH());
		
		Пока ЗапросВыборка.Следующий() Цикл
        
			Объект = ЗапросВыборка.Ссылка.ПолучитьОбъект();
        	
        	// запись в безопасное хранилище
        	АвторизацияВКонтактеПараметры.access_token = Объект.УдалитьТокенДоступа;
			АвторизацияВКонтактеПараметры.ОкончанияДействияТокенаДоступа = Объект.УдалитьОкончанияДействияТокенаДоступа;

			АвторизацияВКонтактеПараметры.access_token_community = Объект.УдалитьТокенДоступаСообщества;
			АвторизацияВКонтактеПараметры.ОкончанияДействияТокенДоступаСообщества = Объект.УдалитьОкончанияДействияТокенДоступаСообщества;

			ИнтеграцияСМагазинамиСоцСетейСервер.АвторизацияВКонтактеПараметрыВБезопасноеХранилищеЗаписать( 
			ЗапросВыборка.Ссылка, АвторизацияВКонтактеПараметры );
		
			// удаление значений в объекте
			
			Объект.УдалитьТокенДоступа = "";
			Объект.УдалитьОкончанияДействияТокенаДоступа = "";

			Объект.УдалитьТокенДоступаСообщества = "";
			Объект.УдалитьОкончанияДействияТокенДоступаСообщества = "";
			
			Объект.УдалитьСтрокаАвторизации = "";
			Объект.УдалитьСтрокаАвторизацииСообщества = "";
			
			
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать();
			
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ПеренестиНастройкиРабочегоМеста(ПараметрыОбработчика) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	НастройкиРМК.Ссылка КАК СтараяНастройкаРМК,
	|	ЕСТЬNULL(НастройкиРабочегоМестаКассира.Ссылка, ЗНАЧЕНИЕ(Справочник.НастройкиРабочегоМестаКассира.ПустаяСсылка)) КАК НоваяНастройкаРМК
	|ИЗ
	|	Справочник.УдалитьНастройкиРМК КАК НастройкиРМК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира
	|		ПО НастройкиРМК.РабочееМесто = НастройкиРабочегоМестаКассира.РабочееМесто
	|ГДЕ
	|	НЕ НастройкиРМК.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	НачатьТранзакцию();
	
	Попытка
		Пока Выборка.Следующий() Цикл
			
			РеквизитыСтаройНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.СтараяНастройкаРМК, "РаспределениеНоменклатуры, СтруктурныеЕдиницы, Наименование, ГруппыКатегории");
			РаспределениеНоменклатуры = РеквизитыСтаройНастройки.РаспределениеНоменклатуры.Выгрузить();
			СтруктурныеЕдиницы = РеквизитыСтаройНастройки.СтруктурныеЕдиницы.Выгрузить();
			Если РаспределениеНоменклатуры.Количество() = 0
				И СтруктурныеЕдиницы.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			Блокировка = Новый БлокировкаДанных();
			Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			Блокировка.Заблокировать();
			
			Если Выборка.НоваяНастройкаРМК.Пустая() Тогда
				НастройкаОбъект = Справочники.НастройкиРабочегоМестаКассира.СоздатьЭлемент();
				НастройкаОбъект.Наименование = РеквизитыСтаройНастройки.Наименование;
			Иначе
				НастройкаОбъект = Выборка.НоваяНастройкаРМК.ПолучитьОбъект();
			КонецЕсли;
			
			Если РаспределениеНоменклатуры.Количество() > 0 Тогда
				Для Каждого СтрокаТаблицы Из РаспределениеНоменклатуры Цикл
					НоваяСтрока = НастройкаОбъект.РаспределениеНоменклатуры.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				КонецЦикла;
				НастройкаОбъект.ГруппыКатегории = РеквизитыСтаройНастройки.ГруппыКатегории;
			КонецЕсли;
			
			Если СтруктурныеЕдиницы.Количество() > 0 Тогда
				Для Каждого СтрокаТаблицы Из СтруктурныеЕдиницы Цикл
					НоваяСтрока = НастройкаОбъект.СтруктурныеЕдиницы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				КонецЦикла;
				НастройкаОбъект.РазрешитьВыборСклада = Истина;
			КонецЕсли;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаОбъект);
			
		КонецЦикла;
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика обновления переноса настроек РМК'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ПереводПодсистемыОбменССайтомНаИнтернетМагазин(ПараметрыОбработчика) Экспорт
	
	ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	НачатьТранзакцию();
	Попытка
	  	Справочники.НастройкиИнтеграцииСИнтернетМагазином.СоздатьИнтеграцииСИнтернетМагазином();
		ЗафиксироватьТранзакцию();
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

Процедура ОбновитьОтчеты_3_0_13(ПараметрыОбработчика) Экспорт
	
	ОтчетыУНФ.Обновить();
	
КонецПроцедуры

Процедура ОбновитьСхемуКомпоновкиДанныхШаблоновЧековККТ(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ХранилищеШаблоновРМК.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХранилищеШаблоновРМК КАК ХранилищеШаблоновРМК";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	НачатьТранзакцию();
	
	Попытка
		СКДШаблоновЧеков = Новый СхемаКомпоновкиДанных;
		ОбщегоНазначенияРМКУНФ.ЗаполнитьМакетШаблонаЧека(СКДШаблоновЧеков);
		Пока Выборка.Следующий() Цикл
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ХранилищеШаблоновРМК");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			ШаблонЧекаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ШаблонЧекаОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКДШаблоновЧеков);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонЧекаОбъект);
		КонецЦикла;
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика обновления шаблонов чеков ККТ'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьПроизвольныеУсловияСкидок(ПараметрыОбработчика) Экспорт
	Справочники.УсловияПредоставленияСкидокНаценок.ОбновитьПроизвольныеУсловияСкидок(ПараметрыОбработчика);
КонецПроцедуры

Процедура ДополнитьОписаниеИСАлкогольнойПродукции(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СправочникНоменклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК СправочникНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО (ОписаниеНоменклатурыИС.Номенклатура = СправочникНоменклатура.Ссылка)
		|ГДЕ
		|	СправочникНоменклатура.УдалитьВидПродукцииИС = &ПустаяОсобенностьУчета
		|	И ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции, &ПустойКлючВидовПродукции) = &ПустойКлючВидовПродукции
		|	И СправочникНоменклатура.АлкогольнаяПродукция
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("ПустаяОсобенностьУчета",   Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойКлючВидовПродукции", Справочники.КлючиВидовПродукцииИС.ПустаяСсылка());
	
	ПозицииНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если ПозицииНоменклатуры.Количество() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	Иначе
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ДанныеДляОбработки  = ОбновлениеИнформационнойБазыГосИС.ДанныеДляОбработкиНоменклатурыПриПереходеНаКонструкторНастроек(
		ПозицииНоменклатуры);
	
	ЕстьОшибки = Ложь;
	Для Каждого СтрокаТаблицы Из ДанныеДляОбработки.ТаблицаНоменклатуры Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			ТекущееОписание = ДанныеДляОбработки.ОписаниеНоменклатуры[СтрокаТаблицы.Номенклатура];
			
			РезультатОбработки = ОбновлениеИнформационнойБазыГосИС.ОбработатьСтрокуТаблицыНоменклатурыПриПереходеНаКонструкторНастроек(
				СтрокаТаблицы,
				ДанныеДляОбработки);
			
			Если РезультатОбработки.ЕстьОшибки Тогда
				ВызватьИсключение РезультатОбработки.ТекстОшибки;
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ЕстьОшибки = Истина;
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Не удалось обработать номенклатуру ""%1"" при переходе на конструктор настроек видов продукции по причине:
					       |%2'"),
				СтрокаТаблицы.Номенклатура,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.Номенклатура,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	Иначе
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПометитьНаУдалениеУстаревшиеШаблоныЧеков(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
		|	ХранилищеШаблонов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХранилищеШаблонов КАК ХранилищеШаблонов
		|ГДЕ
		|	ХранилищеШаблонов.ТипШаблона = ЗНАЧЕНИЕ(Перечисление.ТипыШаблонов.УдалитьЧекККМ)
		|	И НЕ ХранилищеШаблонов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	НачатьТранзакцию();
	
	Попытка
		Пока Выборка.Следующий() Цикл
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ХранилищеШаблонов");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			ШаблонЧекаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ШаблонЧекаОбъект.УстановитьПометкуУдаления(Истина);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонЧекаОбъект);
		КонецЦикла;
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика пометки на удаление устаревших шаблонов чеков'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьРегистрациюИнтерфейсыСеансовПользователей(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Полный.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.Полный КАК Полный
	|ГДЕ
	|	Полный.ЭтотУзел = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СОтборами.Ссылка
	|ИЗ
	|	ПланОбмена.СОтборами КАК СОтборами
	|ГДЕ
	|	СОтборами.ЭтотУзел = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АвтономнаяРабота.Ссылка
	|ИЗ
	|	ПланОбмена.АвтономнаяРабота КАК АвтономнаяРабота
	|ГДЕ
	|	АвтономнаяРабота.ЭтотУзел = ЛОЖЬ";
	
	УзлыОбмена = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если УзлыОбмена.Количество() Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.РегистрыСведений.ИнтерфейсСеансовПользователей);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПометитьНаУдалениеУстаревшиеШаблоныЭтикетокИЦенников(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	УдалитьШаблоныЭтикетокИЦенников.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УдалитьШаблоныЭтикетокИЦенников КАК УдалитьШаблоныЭтикетокИЦенников
	|ГДЕ
	|	НЕ УдалитьШаблоныЭтикетокИЦенников.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	НачатьТранзакцию();
	
	Попытка
		Пока Выборка.Следующий() Цикл
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.УдалитьШаблоныЭтикетокИЦенников");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			ШаблонЭтикетокИЦенниковОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ШаблонЭтикетокИЦенниковОбъект.УстановитьПометкуУдаления(Истина);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонЭтикетокИЦенниковОбъект);
		КонецЦикла;
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика пометки на удаление устаревших шаблонов этикеток и ценников'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьИспользованиеЛичногоКабинета(ПараметрыОбработчика) Экспорт
	ЛичныйКабинетСервиса.ОбновитьИспользованиеЛичногоКабинета();
КонецПроцедуры

Процедура ОбновитьШаблоныЭтикетокИЦенников(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ХранилищеШаблонов.Ссылка КАК Ссылка,
	|	""Справочник.ХранилищеШаблонов"" КАК ТипШаблонаСтрокой
	|ИЗ
	|	Справочник.ХранилищеШаблонов КАК ХранилищеШаблонов
	|ГДЕ
	|	(ХранилищеШаблонов.ТипШаблона = ЗНАЧЕНИЕ(Перечисление.ТипыШаблонов.ЭтикеткаЦенник)
	|			ИЛИ ХранилищеШаблонов.ТипШаблона = ЗНАЧЕНИЕ(Перечисление.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШаблоныЭтикетокИЦенниковБПО.Ссылка,
	|	""Справочник.ШаблоныЭтикетокИЦенниковБПО""
	|ИЗ
	|	Справочник.ШаблоныЭтикетокИЦенниковБПО КАК ШаблоныЭтикетокИЦенниковБПО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	НачатьТранзакцию();
	
	Попытка
		
		ШаблонПоУмолчанию = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаПоУмолчанию");
		ШаблонЦенникАкционный = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаЦенникАкционный");
		Шаблон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблона");
		
		ТекстЗапросаШаблонаПоУмолчанию = ШаблонПоУмолчанию.НаборыДанных.НаборДанных.Запрос;
		ТекстЗапросаШаблонаЦенникАкционный = ШаблонЦенникАкционный.НаборыДанных.НаборДанных.Запрос;
		ТекстЗапросаШаблона = Шаблон.НаборыДанных.НаборДанных.Запрос;
		
		ТекстыЗапросовПоХешСуммам = Новый Соответствие;
		ТекстыЗапросовПоХешСуммам.Вставить(Base64Значение("4lj1lnPP+ruF1sTuPDpYOg=="),
			ТекстЗапросаШаблонаПоУмолчанию);
		ТекстыЗапросовПоХешСуммам.Вставить(Base64Значение("yU4kbVq6B9JHZ45NI8oTFg=="),
			ТекстЗапросаШаблонаПоУмолчанию);
		ТекстыЗапросовПоХешСуммам.Вставить(Base64Значение("Vtt0uPkO/eKb5WfheD7ANQ=="),
			ТекстЗапросаШаблонаПоУмолчанию);
		ТекстыЗапросовПоХешСуммам.Вставить(Base64Значение("c1vtx1IUVSTCyg+l526e+Q=="),
			ТекстЗапросаШаблонаЦенникАкционный);
		ТекстыЗапросовПоХешСуммам.Вставить(Base64Значение("NJmu60nPU8T9u994LDKt8g=="),
			ТекстЗапросаШаблона);
		
		СКДПоХешСуммам = Новый Соответствие;
		СКДПоХешСуммам.Вставить(Base64Значение("Tp5w/s4FTACdfEI6hheW8g=="), ШаблонПоУмолчанию);
		СКДПоХешСуммам.Вставить(Base64Значение("4eqf+FQqRhTD3aVXIrbRBw=="), ШаблонПоУмолчанию);
		СКДПоХешСуммам.Вставить(Base64Значение("dSUOp3aAS7c/maknKWHw/w=="), ШаблонПоУмолчанию);
		СКДПоХешСуммам.Вставить(Base64Значение("KezAu0tScpKyIRHSYmrQQw=="), ШаблонЦенникАкционный);
		СКДПоХешСуммам.Вставить(Base64Значение("BLbh6hjWdXFBvwPg/yX6bg=="), ШаблонЦенникАкционный);
		СКДПоХешСуммам.Вставить(Base64Значение("f10Zz3l2dtxbzOIICgEdzA=="), ШаблонЦенникАкционный);
		СКДПоХешСуммам.Вставить(Base64Значение("1oUJItIkqP5R1V05OPG5Jw=="), Шаблон);
		СКДПоХешСуммам.Вставить(Base64Значение("spo+UsiwMSg4lbyNIIu78Q=="), Шаблон);
		СКДПоХешСуммам.Вставить(Base64Значение("Y8CpTG7jFpvo0Ipva7WZZA=="), Шаблон);
		
		Пока Выборка.Следующий() Цикл
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(Выборка.ТипШаблонаСтрокой);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СКД = ШаблонОбъект.СхемаКомпоновкиДанных.Получить();
			Если СКД = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ (СКД.НаборыДанных.Количество() = 1
				И ТипЗнч(СКД.НаборыДанных[0]) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"))Тогда
				Продолжить;
			КонецЕсли;
			ТекстЗапросаСКД = СКД.НаборыДанных[0].Запрос;
			
			ОбъектХеш = Новый ХешированиеДанных(ХешФункция.MD5);
			ОбъектХеш.Добавить(ТекстЗапросаСКД);
			
			ТекстЗапросаПоХешСумме = ТекстыЗапросовПоХешСуммам.Получить(ОбъектХеш.ХешСумма);
			СКДПоХешСумме = СКДПоХешСуммам.Получить(ОбъектХеш.ХешСумма);
			
			Если НЕ ТекстЗапросаПоХешСумме = Неопределено Тогда
				СКД.НаборыДанных[0].Запрос = ТекстЗапросаПоХешСумме;
				ШаблонОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);
			ИначеЕсли НЕ СКДПоХешСумме = Неопределено Тогда
				ШаблонОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКДПоХешСумме);
			Иначе
				Продолжить;
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
		КонецЦикла;
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика обновления шаблонов этикеток и ценников'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьСуммуДокументаСписаниеЗапасов(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	СписаниеЗапасов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеЗапасов.Запасы КАК СписаниеЗапасовЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеЗапасов КАК СписаниеЗапасов
	|		ПО СписаниеЗапасовЗапасы.Ссылка = СписаниеЗапасов.Ссылка
	|		И СписаниеЗапасовЗапасы.Сумма <> 0
	|ГДЕ
	|	СписаниеЗапасов.СуммаДокумента = 0
	|	И СписаниеЗапасов.Проведен = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Сумма = ДокументОбъект.Запасы.Итог("Сумма");
			ДокументОбъект.СуммаДокумента = Сумма;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика заполнения реквизита СуммаДокумента в документе СписаниеЗапасов'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьФлагиОтсрочкиНачисленийБаллов(ПараметрыОбработчика) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	БонусныеПрограммы.Ссылка КАК Ссылка,
	|	БонусныеПрограммы.НачислятьПередДнемРождения КАК Было_НачислятьПередДнемРождения,
	|	БонусныеПрограммы.ДнейПередДнемРождения > 0 КАК НачислятьПередДнемРождения,
	|	БонусныеПрограммы.СписыватьПослеДняРождения КАК Было_СписыватьПослеДняРождения,
	|	БонусныеПрограммы.ДнейПослеДняРождения > 0 КАК СписыватьПослеДняРождения,
	|	БонусныеПрограммы.ОтсрочкаДнейРегистрацияКарты > 0 КАК ИспользоватьОтсрочкуРегистрацияКарты,
	|	БонусныеПрограммы.ИспользоватьОтсрочкуРегистрацияКарты КАК Было_ИспользоватьОтсрочкуРегистрацияКарты,
	|	БонусныеПрограммы.ДнейСписанияРегистрацияКарты > 0 КАК СписыватьБаллыРегистрацииКарты,
	|	БонусныеПрограммы.СписыватьБаллыРегистрацииКарты КАК Было_СписыватьБаллыРегистрацииКарты
	|ИЗ
	|	Справочник.БонусныеПрограммы КАК БонусныеПрограммы
	|ГДЕ
	|	БонусныеПрограммы.ДнейПослеДняРождения > 0
	|	И НЕ БонусныеПрограммы.СписыватьПослеДняРождения
	|	ИЛИ БонусныеПрограммы.ДнейПередДнемРождения > 0
	|	И НЕ БонусныеПрограммы.НачислятьПередДнемРождения
	|	ИЛИ БонусныеПрограммы.ОтсрочкаДнейРегистрацияКарты > 0
	|	И НЕ БонусныеПрограммы.ИспользоватьОтсрочкуРегистрацияКарты
	|	ИЛИ БонусныеПрограммы.ДнейСписанияРегистрацияКарты > 0
	|	И НЕ БонусныеПрограммы.СписыватьБаллыРегистрацииКарты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	НачатьТранзакцию();
	
	Попытка
		Пока Выборка.Следующий() Цикл
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.БонусныеПрограммы");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			БонуснаяПрограмма = Выборка.Ссылка.ПолучитьОбъект();
			ЗАполнитьЗначенияСвойств(БонуснаяПрограмма,Выборка,, "Ссылка");
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(БонуснаяПрограмма);
		КонецЦикла;
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика пометки на удаление устаревших шаблонов этикеток и ценников'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	КонецПопытки;
КонецПроцедуры

Процедура ОбновитьВидыНалоговЕНП(ПараметрыОбработчика) Экспорт
	
	ЕстьОшибки = Ложь;
	НачатьТранзакцию();
	
	Попытка

		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();

		ЭлементНалогЕНП = Справочники.ВидыНалогов.ЕдиныйНалоговыйПлатеж.ПолучитьОбъект();
		ЭлементНалогЕНП.Наименование = НСтр("ru = 'ЕНП'", КодОсновногоЯзыка);
		ЭлементНалогЕНП.СчетУчета = ПланыСчетов.Управленческий.ЕдиныйНалоговыйСчет;
		ЭлементНалогЕНП.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
		ЭлементНалогЕНП.ВидНалога = Перечисления.ВидыНалогов.ЕдиныйНалоговыйПлатеж;
		ЭлементНалогЕНП.КодБК = "18201061201010000510";
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементНалогЕНП);

		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика обновления видов налогов по ЕНП'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ЕстьОшибки = Истина;

	КонецПопытки;

	ПараметрыОбработчика.ОбработкаЗавершена = Не ЕстьОшибки;

КонецПроцедуры

Процедура ЗаполнитьОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС(ПараметрыОбработчика) Экспорт
	
	ЕстьОшибки = Ложь;
	НачатьТранзакцию();
	
	Попытка

		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();

		ЭлементОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС = Справочники.ВидыНалогов.ОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС.ПолучитьОбъект();
		ЭлементОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС.Наименование = НСтр("ru = 'Обеспечительный платеж при ввозе товаров из ЕАЭС'", КодОсновногоЯзыка);
		ЭлементОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС.Код = "01-000017";
		ЭлементОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС.СчетУчета = ПланыСчетов.Управленческий.Налоги;
		ЭлементОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
		ЭлементОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС.ВидНалога = Перечисления.ВидыНалогов.ОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС;
		ЭлементОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС.КодБК = "18210403000011000110";
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементОбеспечительныйПлатежПриВвозеТоваровИзЕАЭС);

		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика Заполнить обеспечительный платеж при ввозе товаров из ЕАЭС'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ЕстьОшибки = Истина;

	КонецПопытки;

	ПараметрыОбработчика.ОбработкаЗавершена = Не ЕстьОшибки;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
