
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	СписокЗадач.КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(НастройкиОформленияСпискаЗадач());
	
	Если НЕ Параметры.Свойство("Показатель") Тогда
		Организация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Организация = Справочники.Организации.ПредопределеннаяОрганизация();
		КонецЕсли;
		
		Если Параметры.Свойство("Задача") Тогда
			Задача = Параметры.Задача;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗадач, "Задача", Задача, , ,
				ЗначениеЗаполнено(Задача));
		КонецЕсли;
	КонецЕсли;
	
	ТолькоПросмотр = Не ПравоДоступа("Изменение", Метаданные.Справочники.ЗаписиКалендаряПодготовкиОтчетности); 
	
	УстановитьУсловноеОформление(); 	
	
	МассивРасчетныхЗадач = КалендарьОтчетностиПовтИсп.ПолучитьМассивРасчетныхЗадач();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗадач, "Организация", Организация, , ,
		ЗначениеЗаполнено(Организация));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗадач, "МассивРасчетныхЗадач",
		МассивРасчетныхЗадач);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗадач, "ТекущаяДата", ТекущаяДатаСеанса());	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗадачОсталосьДней", "Видимость",
	Истина);
	
	МесяцБудущее = Месяц(ТекущаяДатаСеанса());
	ГодБудущее = Год(ТекущаяДатаСеанса());
	ГодАрхив = ГодБудущее;
	Если МесяцБудущее < 3 Тогда
		МесяцБудущее = 3;
		ГодАрхив = ГодАрхив -1;
	ИначеЕсли МесяцБудущее < 6 Тогда
		МесяцБудущее = 6;
	ИначеЕсли МесяцБудущее < 9 Тогда
		МесяцБудущее = 9;
	ИначеЕсли МесяцБудущее < 12 Тогда
		МесяцБудущее = 12;
	Иначе
		МесяцБудущее = 3;
		ГодБудущее = ГодБудущее + 1;
	КонецЕсли;
	
	НастройкиКнопок = Новый Структура("ТекущиеПлатежи,ТекущиеДокументы,БудущиеПлатежи,БудущиеДокументы,АрхивПлатежи,АрхивДокументы",
										Истина, Истина, Ложь, Ложь, Ложь, Ложь);
	ТекущиеДокументы = Истина;
	ТекущиеПлатежи   = Истина;
	
	Если Параметры.Свойство("Показатель") Тогда
		Если Параметры.Показатель = "ТекущиеПлатежи" ИЛИ  Параметры.Показатель = "КоличествоТекущихПлатежей" Тогда
			НастройкиКнопок.Вставить("ТекущиеДокументы", Ложь);
			ТекущиеДокументы = Ложь;
			ТекущиеПлатежи   = Истина;
		ИначеЕсли Параметры.Показатель = "КоличествоТекущихДокументов"  Тогда
			НастройкиКнопок.Вставить("ТекущиеПлатежи", Ложь);
			ТекущиеПлатежи   = Ложь;
			ТекущиеДокументы   = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЗапуститьОбновлениеДанныхНаСервере();
	
	НастроитьОтображениеСумм();
	Элементы.СписокЗадач.ТолькоПросмотр = ТолькоПросмотр;
	
	УстановитьОформленияБаннераОПереносеСроков();

	АдаптацияФормыТакси();
	АдаптацияФормыМобильныйКлиент();
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЖдатьЗавершенияФоновогоЗадания();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменениеСостоянияСобытияКалендаря" Тогда
		Элементы.СписокЗадач.Обновить();
		НастроитьОтображениеСумм();
	ИначеЕсли ИмяСобытия = "Запись_Организации" И Параметр = Организация Тогда
		УправлениеФормой(ЭтотОбъект, Организация,Задача);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ПерейтиПоСсылкеИзБаннера(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ГиперссылкаПереносСроковВРегионах" Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ГиперссылкаПереносСроковВРегионах());
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ГиперссылкаПереносСроковУСН" Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ГиперссылкаПереносСроковУСН());
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки  = "ГиперссылкаСтатьяЕНП" Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ГиперссылкаСтатьяЕНП());
	Иначе
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ТекущиеПлатежиПриИзменении(Элемент)
	НастроитьОтображениеКнопок(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеДокументыПриИзменении(Элемент)
	НастроитьОтображениеКнопок(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура БудущиеПлатежиПриИзменении(Элемент)
	НастроитьОтображениеКнопок(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура БудущиеДокументыПриИзменении(Элемент)
	НастроитьОтображениеКнопок(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура АрхивПлатежиПриИзменении(Элемент)
	НастроитьОтображениеКнопок(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура АрхивДокументыПриИзменении(Элемент)
	НастроитьОтображениеКнопок(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	НастроитьОтображениеСумм();
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	НастроитьОтображениеСумм();
КонецПроцедуры

&НаКлиенте
Процедура ГодАрхивПриИзменении(Элемент)
	НастроитьОтображениеСумм();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачаПриИзменении(Элемент)

	ПриИзмененииЗадачи();
	
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияПредупрежденияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", Новый Структура("Ключ,ЗадачаОтчетности", Организация, Задача));
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация4ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗадачОсталосьДней", "Видимость",
	Ложь);                      
	
	Если ЗапуститьОбновлениеДанныхНаСервере() Тогда
		
		ЖдатьЗавершенияФоновогоЗадания();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
	
КонецПроцедуры
  
&НаКлиенте
Процедура Задача1ПриИзменении(Элемент)
	
	ПриИзмененииЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура Организация1ПриИзменении(Элемент)
	ПриИзмененииОрганизации();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗадач

&НаКлиенте
Процедура СписокЗадачОбработкаЗапросаОбновления()
	НастроитьОтображениеСумм();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтруктураСобытия = Новый Структура("СобытиеКалендаря, СостояниеСобытия, Организация",
			ТекДанные.СобытиеКалендаря,
			ТекДанные.Состояние,
			ТекДанные.Организация);
		ИмяФормыЗадачи = ПолучитьИмяФормыПоЗадачеИСостоянию(ТекДанные.Задача, СтруктураСобытия);
		Если Не ПустаяСтрока(ИмяФормыЗадачи) Тогда  
			Если ИмяФормыЗадачи = "Обработка.ОбработкиНалоговИОтчетности.Форма.ОписанияЗадачИСтартВыполнения" Тогда
				СтруктураСобытия.Вставить("ЗаписьКалендаря", ТекДанные.Ссылка);
			КонецЕсли; 
			
			ОткрытьФорму(ИмяФормыЗадачи, СтруктураСобытия,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отчеты(Команда)
	
	ОтчетПоНалогам = НайтиОтчетПоНалогам();
	Если Не ЗначениеЗаполнено(ОтчетПоНалогам) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыОткрытия = Новый Структура;
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, ОтчетПоНалогам, ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗадач(Команда)
	
	Если ЗапуститьОбновлениеДанныхНаСервере() Тогда
		
		ЖдатьЗавершенияФоновогоЗадания();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВАрхив(Команда)

	Для Каждого СтрокаДляОбработки Из Элементы.СписокЗадач.ПолучитьСтрокиДляОбработки() Цикл
		ТекущиеДанныеСтроки = Элементы.СписокЗадач.ДанныеСтроки(СтрокаДляОбработки);
		ПеренестиЗадачуВАрхивСервер(ТекущиеДанныеСтроки.Организация, ТекущиеДанныеСтроки.СобытиеКалендаря,
			ТекущиеДанныеСтроки.Ссылка);
	КонецЦикла;
	
	Элементы.СписокЗадач.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьВАктуальные(Команда)

	Для Каждого СтрокаДляОбработки Из Элементы.СписокЗадач.ПолучитьСтрокиДляОбработки() Цикл
		ТекущиеДанныеСтроки = Элементы.СписокЗадач.ДанныеСтроки(СтрокаДляОбработки);
		ВернутьЗадачуИзАрхиваСервер(ТекущиеДанныеСтроки.Организация, ТекущиеДанныеСтроки.СобытиеКалендаря,
			ТекущиеДанныеСтроки.Ссылка);
	КонецЦикла;
	
	Элементы.СписокЗадач.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииОрганизации()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗадач, "Организация", Организация, , ,
		ЗначениеЗаполнено(Организация));
	
	Если ЗапуститьОбновлениеДанныхНаСервере() Тогда
		
		ЖдатьЗавершенияФоновогоЗадания();
		
	КонецЕсли;
	НастроитьОтображениеСумм();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЗадачи()
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗадач, "Задача", Задача, , ,
		ЗначениеЗаполнено(Задача));
	
	Если ЗапуститьОбновлениеДанныхНаСервере() Тогда
		
		ЖдатьЗавершенияФоновогоЗадания();
		
	КонецЕсли;
	НастроитьОтображениеСумм();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма, Организация, Знач Задача)
	
	Элементы = Форма.Элементы;
	
	Если Не ЗначениеЗаполнено(Организация) И Не ЗначениеЗаполнено(Задача) Тогда
		Элементы.СтраницаКалендарьОтчетности.Видимость = Истина;
		Элементы.СтраницаВсеЗадачиЗавершены.Видимость = Ложь;
		Элементы.СтраницаЗадачаНеприменима.Видимость = Ложь;
	Иначе
		Если РегламентированнаяОтчетностьУСН.УстановитьПрименимостьЗадачиПоОрганизации(Организация, Задача) Тогда
			Элементы.СтраницаКалендарьОтчетности.Видимость = Истина;
			Элементы.СтраницаВсеЗадачиЗавершены.Видимость = Ложь;
			Элементы.СтраницаЗадачаНеприменима.Видимость = Ложь;
		Иначе
			Элементы.СтраницаКалендарьОтчетности.Видимость = Ложь;
			Элементы.СтраницаВсеЗадачиЗавершены.Видимость = Ложь;
			Элементы.СтраницаЗадачаНеприменима.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	Элементы.ГруппаШапка1.Видимость = Элементы.СтраницаЗадачаНеприменима.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента 		= ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных("СписокЗадачОрганизация");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Организация", ВидСравненияКомпоновкиДанных.НеРавно, Справочники.Организации.ПустаяСсылка());

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);

КонецПроцедуры

&НаСервере
Функция НастройкиОформленияСпискаЗадач()
	
	НастройкиКомпоновкиДанных = Новый НастройкиКомпоновкиДанных;
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		Неопределено, -1, НСтр("ru = 'Просрочено'"), ЦветаПалитры.Красный);
		
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		0, 0, НСтр("ru = 'Сегодня'"), ЦветаПалитры.Красный);
		
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		1, 1, НСтр("ru = 'Завтра'"), ЦветаПалитры.Желтый);

	Шаблон = НСтр("ru = 'Осталось %1'");
	
	Для РазностьДат = 2 По 6 Цикл

		СтрокаРазностьДат = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(";%1 день;;%1 дня;%1 дней;%1 дня",
			РазностьДат);
		
		ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
			РазностьДат, РазностьДат, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, СтрокаРазностьДат),
			ЦветаПалитры.Желтый);
		
	КонецЦикла;
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		7, 13, НСтр("ru = 'Осталась неделя'"), ЦветаПалитры.Желтый);
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		14, 18, НСтр("ru = 'Осталось 2 недели'"), ЦветаПалитры.Желтый);
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		19, 22, НСтр("ru = 'Осталось 3 недели'"), ЦветаПалитры.Желтый);
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		23, 34, НСтр("ru = 'Остался месяц'"), ЦветаПалитры.Желтый);
	
	// Используем пробел в качестве представления пустой строки, т.к. пустая строка в условном оформлении игнорируется
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		35, Неопределено, " ", Неопределено);
		

	// Добавляем оформление для случая, когда отчет не сдан.
	ЭлементУсловногоОформления = НастройкиКомпоновкиДанных.УсловноеОформление.Элементы.Добавить();
	ОформляемоеСвойство = ИмяСвойстваУсловногоОформленияКолонкиЦветом(ЭтоВариантИнтерфейса85);
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(ОформляемоеСвойство,
		ЦветаПалитры.Красный);
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(ОформляемоеСвойство, НСтр("ru = 'Отчет не сдан'"));
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Состояние");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.СостоянияСобытийКалендаря.ОтчетНеСдан;
	
	ЭлементПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ЭлементПоля.Использование = Истина;
	ЭлементПоля.Поле          = Новый ПолеКомпоновкиДанных("ОсталосьДней");
	
	// Добавляем оформление для случая, когда отчет сдан в налоговой.
	
	ЭлементУсловногоОформления = НастройкиКомпоновкиДанных.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(ОформляемоеСвойство, ЦветаПалитры.Зеленый);
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Отчет сдан!'"));
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Состояние");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.СостоянияСобытийКалендаря.Завершить;
	ЭлементПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ЭлементПоля.Использование = Истина;
	ЭлементПоля.Поле          = Новый ПолеКомпоновкиДанных("ОсталосьДней");
	
	// Добавляем оформление для случая, когда отчет в архиве
	ЭлементУсловногоОформления = НастройкиКомпоновкиДанных.УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(ОформляемоеСвойство, ЦветаПалитры.Зеленый);
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'В архиве'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(ОформляемоеСвойство, ЦветаПалитры.Серый);
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("КартинкаЗадачи");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ВАрхиве = Новый СписокЗначений;
	ВАрхиве.Добавить(2);
	ВАрхиве.Добавить(3);
	ЭлементОтбора.ПравоеЗначение = ВАрхиве;
	ЭлементПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ЭлементПоля.Использование = Истина;
	ЭлементПоля.Поле          = Новый ПолеКомпоновкиДанных("ОсталосьДней");
	
	Возврат НастройкиКомпоновкиДанных;
	
КонецФункции

&НаСервере
Процедура ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных, НижняяГраница, ВерхняяГраница, Текст,
	Знач ЗначениеСвойстваОформления)
	
	ПутьКДаннымПоля = "ОсталосьДней";
	
	ЭлементУсловногоОформления = НастройкиКомпоновкиДанных.УсловноеОформление.Элементы.Добавить();

	Если ЗначениеСвойстваОформления = Неопределено Тогда
		ОформляемоеСвойство = "ТипОтметки";
		ЗначениеСвойстваОформления = ТипОтметкиЯчейкиТаблицы.Нет
	Иначе
		ОформляемоеСвойство = ИмяСвойстваУсловногоОформленияКолонкиЦветом(ЭтоВариантИнтерфейса85);
	КонецЕсли;

	//Если цвет оформления не задан, отключаем видимость
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(ОформляемоеСвойство, ЗначениеСвойстваОформления);
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Текст);
	
	Если НижняяГраница = Неопределено Тогда
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = ВерхняяГраница;
		
	ИначеЕсли ВерхняяГраница = Неопределено Тогда
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = НижняяГраница;
		
	ИначеЕсли НижняяГраница = ВерхняяГраница Тогда
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = НижняяГраница;
		
	Иначе
		
		ГруппаЭлементовОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаЭлементовОтбора.Использование = Истина;
		ГруппаЭлементовОтбора.ТипГруппы     = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = НижняяГраница;
		
		ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = ВерхняяГраница;
		
	КонецЕсли;
	
	ЭлементПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ЭлементПоля.Использование = Истина;
	ЭлементПоля.Поле          = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
	
КонецПроцедуры

&НаСервере
// Запускает фоновое задание обновления Задач отчетности.
//
Функция ЗапуститьОбновлениеДанныхНаСервере()
	
	Если ТолькоПросмотр ИЛИ  МонопольныйРежим() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ФоновоеЗаданиеЗадачЗапущено Тогда
		// Надо ждать
		Возврат Истина;
	КонецЕсли;   
	
	КлючФоновогоЗадания = "ОбновлениеЗадачОтчетности";
	Если Объект.Организация <> Неопределено Тогда 
		КлючФоновогоЗадания = КлючФоновогоЗадания + Объект.Организация.УникальныйИдентификатор();
	КонецЕсли;
	
	ЕстьАктивныеФоновыеЗаданияОбновлениеЗадачОтчетности = КалендарьОтчетности.ЕстьАктивныеФоновыеЗаданияОбновлениеЗадачОтчетности(КлючФоновогоЗадания);
	Если ЕстьАктивныеФоновыеЗаданияОбновлениеЗадачОтчетности Тогда
		// Надо ждать
		Возврат Истина;
	КонецЕсли;
	
	ПараметрыФункции = Новый Структура();
	ПараметрыФункции.Вставить("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));  	
	
	НаименованиеЗадания = НСтр("ru = 'Обновление списка задач отчетности'");
	ИмяПроцедуры = "КалендарьОтчетности.ЗаполнитьВФоне";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение = 0; 
	ПараметрыВыполнения.КлючФоновогоЗадания = КлючФоновогоЗадания;

	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	Результат = ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыФункции, ПараметрыВыполнения);
	
	ФоновоеЗаданиеЗадачИдентификатор   = Результат.ИдентификаторЗадания;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗаполнитьСписокЗадачНаСервереЗавершение();
	Иначе
		// Начнем ждать
		ФоновоеЗаданиеЗадачЗапущено = Истина;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции  

&НаСервере
Процедура ЗаполнитьСписокЗадачНаСервереЗавершение()
	
	Элементы.СписокЗадач.Обновить();
	УправлениеФормой(ЭтотОбъект, Организация, Задача);
	
КонецПроцедуры


&НаКлиенте
Процедура ЖдатьЗавершенияФоновогоЗадания()
	
	Если ФоновоеЗаданиеЗадачЗапущено Тогда
		
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьЗавершениеДлительнойОперации",
			1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьЗавершениеДлительнойОперации()
	
	Если ФоновоеЗаданиеЗадачЗапущено Тогда
		
		Если ЗаданиеВыполнено(ФоновоеЗаданиеЗадачИдентификатор) Тогда
			
			ФоновоеЗаданиеЗадачЗапущено = Ложь;
			ОповеститьОбИзменении(Тип("СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ФоновоеЗаданиеЗадачЗапущено Тогда
		// Продолжим ожидание
		ПодключитьОбработчикОжидания(
			"Подключаемый_ПроверитьЗавершениеДлительнойОперации",
			1,
			Истина);
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект, Организация, Задача);
	НастроитьОтображениеКнопок();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(Знач ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Процедура ПеренестиЗадачуВАрхивСервер(Организация, СобытиеКалендаря, СсылкаЗаписи)
	
	Ссылка = Справочники.ЗаписиКалендаряПодготовкиОтчетности.ПолучитьЗаписьКалендаря(Организация, СобытиеКалендаря,
		СсылкаЗаписи);
	Если Ссылка <> Неопределено Тогда
		Запись = Ссылка.ПолучитьОбъект();
		Запись.Завершено = Истина;
		НачатьТранзакцию();
		
		Попытка
			Запись.Заблокировать();
			Запись.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			// Вероятно запущен еще один процесс обновления
			// Поэтому не обрабатываем исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(
				НСтр("ru='Запись календаря подготовки отчетности.Ошибка'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				Ссылка,
				ТекстСообщения);
			
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВернутьЗадачуИзАрхиваСервер(Организация, СобытиеКалендаря, СсылкаЗаписи)
	
	Ссылка = Справочники.ЗаписиКалендаряПодготовкиОтчетности.ПолучитьЗаписьКалендаря(Организация, СобытиеКалендаря,
		СсылкаЗаписи);
	Если Ссылка <> Неопределено Тогда
		Запись = Ссылка.ПолучитьОбъект();
		Запись.Завершено = Ложь;
		НачатьТранзакцию();
		
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ЗаписиКалендаряПодготовкиОтчетности");
			Блокировка.Заблокировать();
			Запись.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			// Вероятно запущен еще один процесс обновления
			// Поэтому не обрабатываем исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(
				НСтр("ru='Запись календаря подготовки отчетности.Ошибка'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				Ссылка,
				ТекстСообщения);
			
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;

	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФормыПоЗадачеИСостоянию(Задача, Состояние)
	Возврат Справочники.ЗаписиКалендаряПодготовкиОтчетности.ПолучитьИмяФормыПоЗадачеИСостоянию(Задача, Состояние);
КонецФункции


&НаКлиенте
Процедура НастроитьОтображениеКнопок(ИмяКоманды = Неопределено)
	Если ИмяКоманды <> Неопределено Тогда
		НастройкиКнопок[ИмяКоманды] = ЭтотОбъект[ИмяКоманды];
	КонецЕсли;
	
	НастроитьОтображениеСписка();
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеСумм()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ЗаписиКалендаряПодготовкиОтчетности.СуммаНалога), 0) КАК СуммаНалога,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(КалендарьПодготовкиОтчетности.Задача, КалендарьПерсональныхЗадачОтчетности.Задача) В (&МассивРасчетныхЗадач)
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ), 0) КАК КоличествоДокументов,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(КалендарьПодготовкиОтчетности.Задача, КалендарьПерсональныхЗадачОтчетности.Задача) В (&МассивРасчетныхЗадач)
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК КоличествоПлатежей
	|ИЗ
	|	Справочник.ЗаписиКалендаряПодготовкиОтчетности КАК ЗаписиКалендаряПодготовкиОтчетности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО (Организации.Ссылка = ЗаписиКалендаряПодготовкиОтчетности.Организация)
	|			И (НЕ Организации.ПометкаУдаления)
	|			И (Организации.ИспользуетсяОтчетность)
	|			И (НЕ ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|		ПО ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря = КалендарьПодготовкиОтчетности.Ссылка
	|			И (НЕ ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КалендарьПерсональныхЗадачОтчетности КАК КалендарьПерсональныхЗадачОтчетности
	|		ПО ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря = КалендарьПерсональныхЗадачОтчетности.Ссылка
	|			И (НЕ КалендарьПерсональныхЗадачОтчетности.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ДатаПервогоВходаВСистему КАК ДатаПервогоВходаВСистему
	|		ПО (ИСТИНА)
	|ГДЕ
	|	&Условие
	|	И НЕ(ЕСТЬNULL(КалендарьПодготовкиОтчетности.ДатаНачалаИнформирования, КалендарьПерсональныхЗадачОтчетности.ДатаНачалаИнформирования) > &ТекущаяДата
	|				И ЗаписиКалендаряПодготовкиОтчетности.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытийКалендаря.НеНачато))
	|	И НЕ(ЗаписиКалендаряПодготовкиОтчетности.Завершено
	|				ИЛИ ЕСТЬNULL(КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия, КалендарьПерсональныхЗадачОтчетности.ДатаОкончанияСобытия) < ДатаПервогоВходаВСистему.Значение
	|					И ЗаписиКалендаряПодготовкиОтчетности.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытийКалендаря.НеНачато))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ЗаписиКалендаряПодготовкиОтчетности.СуммаНалога), 0) КАК СуммаНалога,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(КалендарьПодготовкиОтчетности.Задача, КалендарьПерсональныхЗадачОтчетности.Задача) В (&МассивРасчетныхЗадач)
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ), 0) КАК КоличествоДокументов,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(КалендарьПодготовкиОтчетности.Задача, КалендарьПерсональныхЗадачОтчетности.Задача) В (&МассивРасчетныхЗадач)
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК КоличествоПлатежей
	|ИЗ
	|	Справочник.ЗаписиКалендаряПодготовкиОтчетности КАК ЗаписиКалендаряПодготовкиОтчетности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО (Организации.Ссылка = ЗаписиКалендаряПодготовкиОтчетности.Организация)
	|			И (НЕ Организации.ПометкаУдаления)
	|			И (Организации.ИспользуетсяОтчетность)
	|			И (НЕ ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|		ПО ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря = КалендарьПодготовкиОтчетности.Ссылка
	|			И (НЕ ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КалендарьПерсональныхЗадачОтчетности КАК КалендарьПерсональныхЗадачОтчетности
	|		ПО ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря = КалендарьПерсональныхЗадачОтчетности.Ссылка
	|			И (НЕ КалендарьПерсональныхЗадачОтчетности.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ДатаПервогоВходаВСистему КАК ДатаПервогоВходаВСистему
	|		ПО (ИСТИНА)
	|ГДЕ
	|	&Условие
	|	И &ТекущаяДата < ЕСТЬNULL(КалендарьПодготовкиОтчетности.ДатаНачалаИнформирования, КалендарьПерсональныхЗадачОтчетности.ДатаНачалаИнформирования)
	|	И ЕСТЬNULL(КалендарьПодготовкиОтчетности.ДатаНачалаИнформирования, КалендарьПерсональныхЗадачОтчетности.ДатаНачалаИнформирования) <= &ДоКонцаДата
	|	И ЗаписиКалендаряПодготовкиОтчетности.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытийКалендаря.НеНачато)
	|	И НЕ(ЗаписиКалендаряПодготовкиОтчетности.Завершено
	|				ИЛИ ЕСТЬNULL(КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия, КалендарьПерсональныхЗадачОтчетности.ДатаОкончанияСобытия) < ДатаПервогоВходаВСистему.Значение
	|					И ЗаписиКалендаряПодготовкиОтчетности.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытийКалендаря.НеНачато))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ЗаписиКалендаряПодготовкиОтчетности.СуммаНалога), 0) КАК СуммаНалога,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(КалендарьПодготовкиОтчетности.Задача, КалендарьПерсональныхЗадачОтчетности.Задача) В (&МассивРасчетныхЗадач)
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ), 0) КАК КоличествоДокументов,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(КалендарьПодготовкиОтчетности.Задача, КалендарьПерсональныхЗадачОтчетности.Задача) В (&МассивРасчетныхЗадач)
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК КоличествоПлатежей
	|ИЗ
	|	Справочник.ЗаписиКалендаряПодготовкиОтчетности КАК ЗаписиКалендаряПодготовкиОтчетности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО (Организации.Ссылка = ЗаписиКалендаряПодготовкиОтчетности.Организация)
	|			И (НЕ Организации.ПометкаУдаления)
	|			И (Организации.ИспользуетсяОтчетность)
	|			И (НЕ ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|		ПО ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря = КалендарьПодготовкиОтчетности.Ссылка
	|			И (НЕ ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КалендарьПерсональныхЗадачОтчетности КАК КалендарьПерсональныхЗадачОтчетности
	|		ПО ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря = КалендарьПерсональныхЗадачОтчетности.Ссылка
	|			И (НЕ КалендарьПерсональныхЗадачОтчетности.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ДатаПервогоВходаВСистему КАК ДатаПервогоВходаВСистему
	|		ПО (ИСТИНА)
	|ГДЕ
	|	&Условие
	|	И (ЗаписиКалендаряПодготовкиОтчетности.Завершено
	|			ИЛИ ЕСТЬNULL(КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия, КалендарьПерсональныхЗадачОтчетности.ДатаОкончанияСобытия) < ДатаПервогоВходаВСистему.Значение
	|				И ЗаписиКалендаряПодготовкиОтчетности.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытийКалендаря.НеНачато))
	|	И (ЕСТЬNULL(КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия, КалендарьПерсональныхЗадачОтчетности.ДатаОкончанияСобытия) МЕЖДУ &АрхивНачало И &АрхивКонец
	|			ИЛИ ЕСТЬNULL(КалендарьПодготовкиОтчетности.ДатаНачалаСобытия, КалендарьПерсональныхЗадачОтчетности.ДатаНачалаСобытия) МЕЖДУ &АрхивНачало И &АрхивКонец)";
	
	Запрос.УстановитьПараметр("МассивРасчетныхЗадач", КалендарьОтчетностиПовтИсп.ПолучитьМассивРасчетныхЗадач());
	
	ТекстДляЗамены = "";
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстДляЗамены = "Организации.Ссылка = &Организация";
		Запрос.УстановитьПараметр("Организация",Организация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Задача) Тогда
		ТекстДляЗамены = ?(ПустаяСтрока(ТекстДляЗамены),"",ТекстДляЗамены +" И ") + "ЕСТЬNULL(КалендарьПодготовкиОтчетности.Задача, КалендарьПерсональныхЗадачОтчетности.Задача) = &Задача";
		Запрос.УстановитьПараметр("Задача",Задача);
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстДляЗамены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "Истина");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", ТекстДляЗамены);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	БудущееДоКонца = КонецМесяца(Дата(ГодБудущее,МесяцБудущее,1));
	АрхивНачало = Дата(ГодАрхив,1,1);
	АрхивКонец = КонецГода(Дата(ГодАрхив,1,1));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗадач, "АрхивНачало",    АрхивНачало);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗадач, "АрхивКонец",     АрхивКонец);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗадач, "ДоКонцаДата", БудущееДоКонца);
	
	Запрос.УстановитьПараметр("ДоКонцаДата", БудущееДоКонца);
	Запрос.УстановитьПараметр("АрхивНачало", АрхивНачало);
	Запрос.УстановитьПараметр("АрхивКонец",  АрхивКонец);
	
	Пакет =  Запрос.ВыполнитьПакет();
	// Текущие задачи
	Результат = Пакет[0].Выбрать();
	Если Результат.Следующий() Тогда		
		
		ПредставлениеЧисла = СтрокаСЧислом(";%1 платеж; ;%1 платежа;%1 платежей;%1 платежа", Результат.КоличествоПлатежей,
			ВидЧисловогоЗначения.Количественное, "Л=ru; ЧН=0");
		Элементы.ТекущиеПлатежи.Заголовок = НСтр("ru = ' " + ПредставлениеЧисла + " на '")
			+ Строка(Результат.СуммаНалога) + НСтр("ru = ' руб.'");
			
		ПредставлениеЧисла = СтрокаСЧислом(";%1 документ; ;%1 документа;%1 документов;%1 документа",
			Результат.КоличествоДокументов, ВидЧисловогоЗначения.Количественное, "Л=ru; ЧН=0");
		Элементы.ТекущиеДокументы.Заголовок = НСтр("ru = ' " + ПредставлениеЧисла + " по отчетности'");
		
	КонецЕсли;
	
	// Будущие задачи
	Результат = Пакет[1].Выбрать();
	Если Результат.Следующий() Тогда
		
		ПредставлениеЧисла = СтрокаСЧислом(";%1 платеж; ;%1 платежа;%1 платежей;%1 платежа", Результат.КоличествоПлатежей,
			ВидЧисловогоЗначения.Количественное, "Л=ru; ЧН=0");
		Элементы.БудущиеПлатежи.Заголовок = НСтр("ru = ' " + ПредставлениеЧисла +" на '")
			+ Строка(Результат.СуммаНалога) + НСтр("ru = ' руб.'");
			
		ПредставлениеЧисла = СтрокаСЧислом(";%1 документ; ;%1 документа;%1 документов;%1 документа",
			Результат.КоличествоДокументов, ВидЧисловогоЗначения.Количественное, "L=ru; ЧН=0");
		Элементы.БудущиеДокументы.Заголовок = НСтр("ru = ' " + ПредставлениеЧисла + " по отчетности'");
		
	КонецЕсли;
	
	// Архивные задачи
	Результат = Пакет[2].Выбрать();
	Если Результат.Следующий() Тогда
		
		ПредставлениеЧисла = СтрокаСЧислом(";%1 платеж; ;%1 платежа;%1 платежей;%1 платежа", Результат.КоличествоПлатежей,
			ВидЧисловогоЗначения.Количественное, "Л=ru; ЧН=0");
		Элементы.АрхивПлатежи.Заголовок = НСтр("ru = ' " + ПредставлениеЧисла + " на '")
			+ Строка(Результат.СуммаНалога) + НСтр("ru = ' руб.'");
			
		ПредставлениеЧисла = СтрокаСЧислом(";%1 документ; ;%1 документа;%1 документов;%1 документа",
			Результат.КоличествоДокументов, ВидЧисловогоЗначения.Количественное, "L=ru; ЧН=0");
		Элементы.АрхивДокументы.Заголовок = НСтр("ru = ' " + ПредставлениеЧисла + " по отчетности'");
		
	КонецЕсли;
	
	НастроитьОтображениеСписка();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеСписка()
	
	ХотяБыОднаНастройкаВключена = Ложь;
	Для Каждого КомандаНастройки Из НастройкиКнопок Цикл
		Если КомандаНастройки.Значение Тогда
			ХотяБыОднаНастройкаВключена = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ГруппаОтборПоПараметрам = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		СписокЗадач.КомпоновщикНастроек.Настройки.Отбор.Элементы,
		"ОтборПоПараметрам",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	Для Каждого КомандаНастройки Из НастройкиКнопок Цикл
		Если ХотяБыОднаНастройкаВключена Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтборПоПараметрам,КомандаНастройки.Ключ,КомандаНастройки.Значение, ВидСравненияКомпоновкиДанных.Равно,,КомандаНастройки.Значение);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗадач, КомандаНастройки.Ключ,
				КомандаНастройки.Значение, , , Ложь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция НайтиОтчетПоНалогам()
	Возврат Справочники.ВариантыОтчетов.НайтиПоНаименованию("Расчеты по налогам");
КонецФункции

&НаСервере
Процедура УстановитьОформленияБаннераОПереносеСроков() 
	
	Если ТекущаяДатаСеанса() > '20220101' И ТекущаяДатаСеанса() < '20230101' Тогда
		ВывестиБаннерПереносСроковУплатыНалогов();
	ИначеЕсли ТекущаяДатаСеанса() > '20230101' И ТекущаяДатаСеанса() < '20240101' Тогда
		ВывестиБаннерЕНП();
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ВывестиБаннерПереносСроковУплатыНалогов()

	СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
		Организация, ТекущаяДатаСеанса());
	ПрименяетсяУСН = СистемаНалогообложения.ПрименяетсяАУСН;
	
	ПрименяетсяУСН = Истина;
	
	Если ПрименяетсяУСН Тогда
		КраткоеПредставлениеСообщения = НСтр("ru = 'Перенос сроков'");
		ТекстЗаголовка = НСтр("ru='Перенос сроков уплаты налогов в 2022 году'");
		ТекстСообщения= СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru='В некоторых регионах <a href=""ГиперссылкаПереносСроковВРегионах"">перенесены</a> сроки уплаты налогов, а также для ряда отраслей <a href = ""ГиперссылкаПереносСроковУСН"">продлены</a> сроки уплаты налога и аванса по УСН'"));
		
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		ПараметрыСообщения.Заголовок = ТекстЗаголовка;
		ПараметрыСообщения.КраткоеПредставление = КраткоеПредставлениеСообщения;	
		ПараметрыСообщения.Сообщение = ТекстСообщения;
		ПараметрыСообщения.Обработчик = "Подключаемый_ПерейтиПоСсылкеИзБаннера";
		ПараметрыСообщения.ТипСообщения = "Предупреждение";
		ПараметрыСообщения.Скрываемый = Ложь;
		
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);		
	Иначе
		КраткоеПредставлениеСообщения = НСтр("ru = 'Перенос сроков'");
		ТекстЗаголовка = НСтр("ru='Перенос сроков уплаты налогов в 2022 году'");
		ТекстСообщения= СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru='В некоторых регионах <a href=""ГиперссылкаПереносСроковВРегионах"">перенесены</a> сроки уплаты налогов.'"));
		
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		ПараметрыСообщения.Заголовок = ТекстЗаголовка;
		ПараметрыСообщения.КраткоеПредставление = КраткоеПредставлениеСообщения;	
		ПараметрыСообщения.Сообщение = ТекстСообщения;
		ПараметрыСообщения.Обработчик = "Подключаемый_ПерейтиПоСсылкеИзБаннера";
		ПараметрыСообщения.ТипСообщения = "Предупреждение";
		ПараметрыСообщения.Скрываемый = Ложь;
		
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ВывестиБаннерЕНП()

	КраткоеПредставлениеСообщения = НСтр("ru = 'Единый налоговый платеж'");
	ТекстЗаголовка = НСтр("ru='Единый налоговый платеж в 1С:УНФ'");
	ТекстСообщения= СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru='<a href=""ГиперссылкаСтатьяЕНП"">Читать</a> про состав, сроки отчетности и уплаты, порядок действий в 1С:УНФ.'"));
	
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.Заголовок = ТекстЗаголовка;
	ПараметрыСообщения.КраткоеПредставление = КраткоеПредставлениеСообщения;	
	ПараметрыСообщения.Сообщение = ТекстСообщения;
	ПараметрыСообщения.Обработчик = "Подключаемый_ПерейтиПоСсылкеИзБаннера";
	ПараметрыСообщения.ТипСообщения = "Предупреждение";
	ПараметрыСообщения.Скрываемый = Ложь;
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);

КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция ГиперссылкаПереносСроковВРегионах()
	
	Возврат "https://its.1c.ru/docs/reshedule2022";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ГиперссылкаПереносСроковУСН()
	
	Возврат "https://its.1c.ru/bmk/reschedule2022/usn";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ГиперссылкаСтатьяЕНП()
	
	Возврат "https://v8.1c.ru/metod/article/edinyy-nalogovyy-platezh-s-1-yanvarya-2023-goda-chto-takoe-i-kak-platit-v-1s-unf.htm";
	
КонецФункции


&НаСервереБезКонтекста
Функция ИмяСвойстваУсловногоОформленияКолонкиЦветом(ЭтоВариантИнтерфейса85)
	
	ИмяСвойства = ?(ЭтоВариантИнтерфейса85, "ЦветОтметки", "ЦветФона");
	Возврат ИмяСвойства;
	
КонецФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если ЭтоВариантИнтерфейса85 Тогда
		Возврат;
	КонецЕсли;

	Элементы.СписокЗадачКонтекстноеМенюПеренестиВЗавершенные.Отображение = ОтображениеКнопки.Текст;
	Элементы.СписокЗадачКонтекстноеМенюВернутьВАктуальные.Отображение = ОтображениеКнопки.Текст;

КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыМобильныйКлиент()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаНастоящее.РастягиватьПоГоризонтали = Истина;
	Элементы.ГруппаБудущее.РастягиватьПоГоризонтали = Истина;
	Элементы.ГруппаАрхив.РастягиватьПоГоризонтали = Истина;
	Элементы.Месяц.Ширина = 0;
	Элементы.Месяц.РастягиватьПоГоризонтали = Истина;
	Элементы.Год.РастягиватьПоГоризонтали = Истина;
	Элементы.ГодАрхив.РастягиватьПоГоризонтали = Истина;
	
	Элементы.Задача.АвтоМаксимальнаяШирина = Истина;
	Элементы.Организация.АвтоМаксимальнаяШирина = Истина;
	
КонецПроцедуры

#КонецОбласти

