///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ПроверкаКонтрагента".
// ОбщийМодуль.ПроверкаКонтрагента.
// 
// Серверные процедуры проверки контрагента:
//  - отображение индексов СПАРК Риски;
//  - служебные процедуры.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Создает таблицу данных программы для использования в методе
// ПроверкаКонтрагентаПереопределяемый.ДополнитьИнформациюДаннымиПрограммы().
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица данных программы. Колонки:
//		* Ссылка - СправочникСсылка - ссылка на данные программы;
//		* Представление - Строка - представление данных программы;
//		* Описание - Строка - описание данных программы.
//
Функция НоваяТаблицаДанныеПрограммы() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Ссылка",        Справочники.ТипВсеСсылки());
	Результат.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Описание",      Новый ОписаниеТипов("Строка"));
	Возврат Результат;
	
КонецФункции

// Создает описание данных программы для использования в методе
// ПроверкаКонтрагентаПереопределяемый.ДополнитьИнформациюДаннымиПрограммы().
//
// Возвращаемое значение:
//	Структура - описание данных программы. Поля:
//		* Ссылка - ЛюбаяСсылка - ссылка на программы;
//		* Представление - Строка - представление данных программы;
//		* Описание - Строка - описание данных программы;
//		* ПримечаниеПредставление - Строка - представление примечания;
//		* ПримечаниеОписание - Строка - описание примечания.
//
Функция НовыеДанныеПрограммы() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("Представление");
	Результат.Вставить("Описание");
	Результат.Вставить("ПримечаниеПредставление");
	Результат.Вставить("ПримечаниеОписание");
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриСозданииНаСервереСПАРК(
		Форма,
		КонтрагентОбъект,
		Контрагент,
		ВидКонтрагента,
		ПараметрыОтображения,
		ИспользованиеРазрешено,
		СтандартнаяОбработкаБиблиотекой) Экспорт
		
	Если Не СтрНачинаетсяС(Форма.ИмяФормы, "Обработка.ПроверкаКонтрагента.Форма") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработкаБиблиотекой = Ложь;
	
	ОтобразитьИндексыСПАРК(
		Форма.ИндексыСПАРКРиски,
		КонтрагентОбъект,
		Контрагент,
		ВидКонтрагента,
		Форма);
	
	ПоказатьУведомленияСПАРКРиски(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтобразитьИндексыСПАРК(
		РезультатИндексыКонтрагента,
		КонтрагентОбъект,
		Контрагент,
		ВидКонтрагента,
		Форма) Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СПАРКРиски") Тогда
		Возврат;
	КонецЕсли;
	
	МодульСПАРКРиски = ОбщегоНазначения.ОбщийМодуль("СПАРКРиски");
	
	ИспользованиеРазрешено = Форма.НастройкиСПАРКРиски.ИспользованиеРазрешено;
	
	Если ИспользованиеРазрешено
			И (ТипЗнч(РезультатИндексыКонтрагента) <> Тип("Структура")) Тогда
		РезультатИндексыКонтрагента = МодульСПАРКРиски.ИндексыСПАРККонтрагента(
			Контрагент,
			ВидКонтрагента);
	КонецЕсли;
	
	Форма.ИндексыСПАРКРиски = РезультатИндексыКонтрагента;
	ПроверкаКонтрагентаКлиентСервер.ОтобразитьИндексыСПАРК(
		РезультатИндексыКонтрагента,
		КонтрагентОбъект,
		Контрагент,
		Форма,
		ИспользованиеРазрешено);
	
КонецПроцедуры

Процедура ПоказатьУведомленияСПАРКРиски(Форма)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СПАРКРиски") Тогда
		Возврат;
	КонецЕсли;
	
	МодульСПАРКРиски = ОбщегоНазначения.ОбщийМодуль("СПАРКРиски");
	МодульСПАРКРискиКлиентСервер = ОбщегоНазначения.ОбщийМодуль("СПАРКРискиКлиентСервер");
	Форма.УведомленияМонитораПортала.Вставить(
		"СПАРКРиски",
		МодульСПАРКРиски.УведомлениеПользователя(
			МодульСПАРКРискиКлиентСервер.ИдентификаторУслугиИндикаторыРиска()));
	
	Если Форма.УведомленияМонитораПортала.СПАРКРиски = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.Идентификатор = "УведомлениеПользователяСПАРКРиски";
	ПараметрыСообщения.КраткоеПредставление = Форма.УведомленияМонитораПортала.СПАРКРиски.КраткоеПредставление;
	ПараметрыСообщения.Сообщение = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru='%1 <a href=""СсылкаПодробнееСПАРКРиски"">Подробнее</a>.'"),
		Форма.УведомленияМонитораПортала.СПАРКРиски.ТекстУведомления);
	ПараметрыСообщения.Обработчик = "СПАРКРискиКлиент.ОбработкаНавигационнойСсылкиВажногоСообщения";
	ОбщегоНазначения.ДобавитьВажноеСообщение(Форма, ПараметрыСообщения);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(Форма);
	
КонецПроцедуры

Процедура ЗаписатьОшибкуВЖурналРегистрации(Сообщение) Экспорт
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Проверка контрагента'",ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		Сообщение);
	
КонецПроцедуры

Функция ЭтоШиринаЭкранаРасширеннойВерсии(ШиринаЭкрана) Экспорт
	
	Возврат ШиринаЭкрана > 1600;
	
КонецФункции

#КонецОбласти