
#Область СлужебныеПроцедурыИФункции

Функция ОтветственныеЛицаОрганизации(Организация, Сведения, ДатаСведений) Экспорт
	
	Возврат ЗарплатаКадрыБазовый.ОтветственныеЛицаОрганизации(Организация, Сведения, ДатаСведений);
	
КонецФункции

Функция УсловияЗапросаПроверкиНеобходимостиЗаполненияПодчиненныхПодразделений(Запрос, ИсточникДанных) Экспорт
	
	Возврат ЗарплатаКадрыБазовый.УсловияЗапросаПроверкиНеобходимостиЗаполненияПодчиненныхПодразделений(Запрос, ИсточникДанных);

КонецФункции

Процедура ЗаполнитьПодчиненноеПодразделение(ПодразделениеОбъект, ИсточникДанных) Экспорт
	
	ЗарплатаКадрыБазовый.ЗаполнитьПодчиненноеПодразделение(ПодразделениеОбъект, ИсточникДанных);
		
КонецПроцедуры

Функция ЭтоОбъектЗарплатноКадровойБиблиотеки(ПолноеИмяОбъектаМетаданных) Экспорт
	
	Возврат ЗарплатаКадрыБазовый.ЭтоОбъектЗарплатноКадровойБиблиотеки(ПолноеИмяОбъектаМетаданных);
	
КонецФункции

Функция ЭтоБазоваяВерсияКонфигурации() Экспорт
	Возврат ЗарплатаКадрыБазовый.ЭтоБазоваяВерсияКонфигурации();
КонецФункции

// См. ЗарплатаКадры.ИспользуютсяДокументыОплатыВедомостей.
Функция ИспользуютсяДокументыОплатыВедомостей() Экспорт
	Возврат ЗарплатаКадрыБазовый.ИспользуютсяДокументыОплатыВедомостей();
КонецФункции

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// См. ЗарплатаКадры.ЗарегистрироватьОплатуВедомостей.
Процедура ЗарегистрироватьОплатуВедомостей(ПлатежныйДокумент, Организация, Ведомости, ФизическиеЛица = Неопределено, ДатаОперации = Неопределено, Отказ = Ложь) Экспорт
	ЗарплатаКадрыБазовый.ЗарегистрироватьОплатуВедомостей(ПлатежныйДокумент, Организация, Ведомости, ФизическиеЛица, ДатаОперации, Отказ);	
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбораСправочникаОрганизации(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	ЗарплатаКадрыБазовый.ОбработкаПолученияДанныхВыбораСправочникаОрганизации(ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

#Область БлокФункцийПолученияЗначенийПоУмолчанию

Процедура ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения, ДатаЗначений) Экспорт
	ЗарплатаКадрыБазовый.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения, ДатаЗначений);
КонецПроцедуры

// Массив поддерживаемых идентификаторов значений по умолчанию.
Функция СписокДоступныхЗначенийПоУмолчанию() Экспорт
	Возврат ЗарплатаКадрыБазовый.СписокДоступныхЗначенийПоУмолчанию();
КонецФункции

#КонецОбласти

#Область БазоваяФункциональность

Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	ЗарплатаКадрыБазовый.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
КонецПроцедуры

#КонецОбласти

#Область БизнесПроцессыИЗадачи

Процедура ПриЗаполненииНаборовЗначенийДоступаБизнесПроцессовИЗадач(Объект, Таблица) Экспорт
	ЗарплатаКадрыБазовый.ПриЗаполненииНаборовЗначенийДоступаБизнесПроцессовИЗадач(Объект, Таблица);
КонецПроцедуры

#КонецОбласти

#Область ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.
Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт
	
	ЗарплатаКадрыБазовый.ОпределитьОбъектыСКомандамиОтчетов(Объекты);
	
КонецПроцедуры

// См. ОтчетыПереопределяемый.ПриСозданииНаСервере.
Процедура ПриСозданииНаСервереФормыОтчета(Форма, Отказ, СтандартнаяОбработка) Экспорт
	ЗарплатаКадрыБазовый.ПриСозданииНаСервереФормыОтчета(Форма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область Взаимодействия

Процедура ПриЗаполненииНаборовЗначенийДоступаВзаимодействий(Объект, Таблица) Экспорт
	ЗарплатаКадрыБазовый.ПриЗаполненииНаборовЗначенийДоступаВзаимодействий(Объект, Таблица);
КонецПроцедуры

#КонецОбласти

#Область Пользователи

Процедура ПриОпределенииНазначенияРолей(НазначениеРолей) Экспорт
	ЗарплатаКадрыБазовый.ПриОпределенииНазначенияРолей(НазначениеРолей)
КонецПроцедуры

#КонецОбласти

#Область ПрофилиБезопасности

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам.
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзмененияДанных

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения.
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	ЗарплатаКадрыБазовый.ПриЗаполненииРазделовДатЗапретаИзменения(Разделы);
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	ЗарплатаКадрыБазовый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
КонецПроцедуры

#КонецОбласти

#Область КалендарныеГрафики

Процедура ПриОбновленииПроизводственныхКалендарей(УсловияОбновления) Экспорт
	ЗарплатаКадрыБазовый.ПриОбновленииПроизводственныхКалендарей(УсловияОбновления)
КонецПроцедуры

Процедура ПриОбновленииДанныхЗависимыхОтПроизводственныхКалендарей(УсловияОбновления) Экспорт
	ЗарплатаКадрыБазовый.ПриОбновленииДанныхЗависимыхОтПроизводственныхКалендарей(УсловияОбновления)	
КонецПроцедуры

Процедура ПриЗаполненииИзменяемыхОбъектовЗависимыхОтПроизводственныхКалендарей(ИзменяемыеОбъекты) Экспорт
	ЗарплатаКадрыБазовый.ПриЗаполненииИзменяемыхОбъектовЗависимыхОтПроизводственныхКалендарей(ИзменяемыеОбъекты)
КонецПроцедуры
#КонецОбласти

#Область ПрефиксацияСправочниковПоОрганизации

Процедура ПолучитьПрефиксообразующиеРеквизиты(Объекты) Экспорт
	ЗарплатаКадрыБазовый.ПолучитьПрефиксообразующиеРеквизиты(Объекты);
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайлами

Процедура ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников) Экспорт
	ЗарплатаКадрыБазовый.ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников);
КонецПроцедуры

#КонецОбласти

#Область СозданиеНаОсновании

// См. СозданиеНаОснованииПереопределяемый.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании.
Процедура ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты);
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	ЗарплатаКадрыБазовый.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
КонецПроцедуры

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииНаименованийНаборовСвойств.
Процедура ПриПолученииНаименованийНаборовСвойств(Наименования, КодЯзыка) Экспорт
	
КонецПроцедуры

// См. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта.
Процедура ЗаполнитьНаборыСвойствОбъекта(Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ЗапретРедактированияРеквизитовОбъектов

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами
//
Процедура ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты) Экспорт
	ЗарплатаКадрыБазовый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты)
КонецПроцедуры

#КонецОбласти

#Область КонтрольВеденияУчета

// См. КонтрольВеденияУчетаПереопределяемый.ПриОпределенииПроверок.
Процедура ПриОпределенииПроверок(ГруппыПроверок, Проверки) Экспорт
	ЗарплатаКадрыБазовый.ПриОпределенииПроверок(ГруппыПроверок, Проверки);
КонецПроцедуры

#КонецОбласти

#Область ЦентрМониторинга

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	ЗарплатаКадрыБазовый.ПриСбореПоказателейСтатистикиКонфигурации();
КонецПроцедуры

#КонецОбласти

#Область НастройкиПрограммы

// См. НастройкиПрограммыПереопределяемый.НастройкиПользователейИПравПриСозданииНаСервере.
Процедура НастройкиПользователейИПравПриСозданииНаСервере(Форма) Экспорт
	
	ЗарплатаКадрыБазовый.НастройкиПользователейИПравПриСозданииНаСервере(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ТехнологияСервиса

Процедура ПриВключенииРазделенияПоОбластямДанных() Экспорт
	ЗарплатаКадрыБазовый.ПриВключенииРазделенияПоОбластямДанных();
КонецПроцедуры

Процедура УстановитьПраваПоУмолчанию(Пользователь) Экспорт
	ЗарплатаКадрыБазовый.УстановитьПраваПоУмолчанию(Пользователь)
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаЗагрузкаДанных

// Заполняет массив типов неразделенных данных, для которых поддерживается сопоставление ссылок
// при загрузке данных в другую информационную базу.
//
// Параметры:
//  Типы - Массив(ОбъектМетаданных).
//
Процедура ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	ЗарплатаКадрыБазовый.ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы);
КонецПроцедуры

// Заполняет массив типов неразделенных данных, для которых не требуется сопоставление ссылок
// при загрузке данных в другую информационную базу, т.к. корректное сопоставление ссылок
// гарантируется с помощью других механизмов.
//
// Параметры:
//  Типы - Массив(ОбъектМетаданных).
//
Процедура ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	ЗарплатаКадрыБазовый.ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы);
КонецПроцедуры

#КонецОбласти

#Область ПоставляемыеДанные

Процедура ПолучитьОбработчикиПоставляемыхДанных(Обработчики) Экспорт
	ЗарплатаКадрыБазовый.ПолучитьОбработчикиПоставляемыхДанных(Обработчики)	
КонецПроцедуры

#КонецОбласти

#Область ОчередьЗаданий

// См. ЗарплатаКадры.ПриПолученииСпискаШаблонов.
//
Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	
КонецПроцедуры

// См. ЗарплатаКадры.ПриПолученииСпискаШаблонов.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд.
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд);
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииСоставаНастроекПодключаемыхОбъектов.
Процедура ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса) Экспорт
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область РегламентныеЗадания

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
КонецПроцедуры

// См. БлокировкаРаботыСВнешнимиРесурсамиПереопределяемый.ПриЗапретеРаботыСВнешнимиРесурсами
Процедура ПриЗапретеРаботыСВнешнимиРесурсами() Экспорт

КонецПроцедуры

#КонецОбласти

#Область ТекущиеДела

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриОпределенииОбработчиковТекущихДел(Обработчики) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииОбработчиковТекущихДел(Обработчики);
	
КонецПроцедуры

// См. ТекущиеДелаПереопределяемый.ПриОтключенииТекущихДел.
Процедура ПриОтключенииТекущихДел(ОтключаемыеДела) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОтключенииТекущихДел(ОтключаемыеДела);
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений

// См. ШаблоныСообщенийПереопределяемый.ПриОпределенииНастроек
Процедура ПриОпределенииНастроекШаблоновСообщений(Настройки) Экспорт
	
КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриПодготовкеШаблонаСообщения
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, НазначениеШаблона, ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриФормированииСообщения
Процедура ПриФормированииСообщения(Сообщение, НазначениеШаблона, ПредметСообщения, ПараметрыШаблона) Экспорт
	
	
КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриЗаполненииПочтыПолучателейВСообщении
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, НазначениеШаблона, ПредметСообщения) Экспорт

КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриЗаполненииТелефоновПолучателейВСообщении
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, НазначениеШаблона, ПредметСообщения) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РегламентированнаяОтчетность
//


// См. ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.ВыгрузитьДокумент.
Функция ВыгрузитьДокумент(Ссылка, УникальныйИдентификатор = Неопределено) Экспорт
	
	Возврат ЗарплатаКадрыБазовый.ВыгрузитьДокумент(Ссылка, УникальныйИдентификатор);
	
КонецФункции
//

// Функция возвращает сведения об организации.
//
// Параметры:
//  Организация			- ссылка на элемент справочника "Организации";
//  ДатаЗначения		- дата, на которую нужно получить сведения;
//  СписокПоказателей	- список показателей, значения которых нужно вернуть.
//  
// Возвращаемое значение:
//  Структура с ключами из списка показателей и возвращаемыми значениями.
//
Функция ПолучитьСведенияОбОрганизации(Знач Организация, Знач ДатаЗначения = Неопределено, Знач СписокПоказателей = Неопределено) Экспорт
	Возврат ЗарплатаКадрыБазовый.ПолучитьСведенияОбОрганизации(Организация, ДатаЗначения, СписокПоказателей);
КонецФункции

// Процедура заполняет список используемых регламентированных отчетов.
//
Процедура ЗаполнитьСписокРегламентированныхОтчетов(СписокРегламентированныхОтчетов) Экспорт
	ЗарплатаКадрыБазовый.ЗаполнитьСписокРегламентированныхОтчетов(СписокРегламентированныхОтчетов);
КонецПроцедуры

// Процедура заполняет структуру показателей.
// Ключ структуры - идентификатор показателя.
// Значение структуры - массив из двух элементов:
// 	- признак автозаполнения показателя,
//	- признак расшифровки показателя.
//
// Параметры:
// 	ПоказателиОтчета - структура показателей отчета,
// 	ИДОтчета         - идентификатор отчета,
//	ИДРедакцииОтчета - идентификатор редакции формы отчета.
//  ПараметрыОтчета  - Структура - структура параметров отчета.
//
Процедура ЗаполнитьПоказателиРегламентированногоОтчета(ПоказателиОтчета, ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета = Неопределено) Экспорт
	ЗарплатаКадрыБазовый.ЗаполнитьПоказателиРегламентированногоОтчета(ПоказателиОтчета, ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета);
КонецПроцедуры

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
Процедура ЗаполнитьРегламентированныйОтчет(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт
	ЗарплатаКадрыБазовый.ЗаполнитьРегламентированныйОтчет(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер);
КонецПроцедуры

// Для ЗарплатаКадры.ПолучитьНастройкиВидимостиЭлементовФормы возвращает характеристику показываемой формы регламентированного отчета.
//  
// Возвращаемое значение:
//  Булево, истина - если рассматриваемую форму заполнять автоматически мы еще не умеем.
//
Функция НоваяФормаРегламентированногоОтчета(ИДОтчета, ИДРедакцииОтчета) Экспорт
	Возврат	ЗарплатаКадрыБазовый.НоваяФормаРегламентированногоОтчета(ИДОтчета, ИДРедакцииОтчета)
КонецФункции

// Функция возвращает имя справочника обособленных подразделений,
// используемого для автоматического заполнения статистической отчетности.
//
// Пример:
//  Возврат "ПодразделенияОрганизаций";
//
Функция ИмяСправочникаОбособленныхПодразделений() Экспорт
	
	Возврат ЗарплатаКадрыБазовый.ИмяСправочникаОбособленныхПодразделений();
	
КонецФункции

// Функция возвращает имя реквизита справочника подразделений, который
// определяет, является ли подразделение обособленным (в трактовке Росстата).
// Используется для автоматического заполнения статистической отчетности.
//
// Тип реквизита - Булево.
// Если значение реквизита равно Истина - подразделение является обособленным.
// Если значение реквизита равно Ложь - подразделение не является обособленным.
//
// Пример:
//  Возврат "ИмеетНомерТерриториальногоОрганаРосстата";
//
Функция ИмяРеквизитаПризнакаОбособленногоПодразделения() Экспорт
	
	Возврат ЗарплатаКадрыБазовый.ИмяРеквизитаПризнакаОбособленногоПодразделения();
	
КонецФункции

// Процедура переопределяет свойства объекта, с которыми он будет отображен в форме Отчетность.
// Параметры:
//  СвойстваОбъектов  - ТаблицаЗначений - (см. РегламентированнаяОтчетностьПереопределяемый.ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность).
Процедура ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(СвойстваОбъектов) Экспорт
	ЗарплатаКадрыБазовый.ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(СвойстваОбъектов);		
КонецПроцедуры

// Определяет свойства, касающиеся общих свойств объектов конфигураций-потребителей для отображения в форме Отчетность
// и возможности создания новый объектов из формы Отчетность.
//
// Параметры:
//  ТаблицаОписания  - ТаблицаЗначений -  (см. РегламентированнаяОтчетностьПереопределяемый.ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности).
//
Процедура ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания) Экспорт
	ЗарплатаКадрыБазовый.ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания);	
КонецПроцедуры

// Процедура переопределяет обработчик подписки на событие "ЗаписьОбъектовРегламентированнойОтчетности*".
//
// Параметры: - (см. РегламентированнаяОтчетностьПереопределяемый.ЗаписьОбъектовРегламентированнойОтчетности).
//
Процедура ЗаписьОбъектовРегламентированнойОтчетности(Ссылка, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Получает код ОКПО обособленного подразделения
// 
// Параметры:
//   Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//   КодОКПО       - Строка(14) - код ОКПО обособленного подразделения.
Процедура ПолучитьКодОКПОПодразделения(Знач Подразделение, КодОКПО) Экспорт 
	ЗарплатаКадрыБазовый.ПолучитьКодОКПОПодразделения(Подразделение, КодОКПО);
КонецПроцедуры

// Получает код органа ФСГС обособленного подразделения
// 
// Параметры:
//   Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//   КодФСГС       - Строка(5) - код органа ФСГС для подразделения (например, "23-45").
//
Процедура ПолучитьКодОрганаФСГСПодразделения(Подразделение, КодФСГС) Экспорт 
	ЗарплатаКадрыБазовый.ПолучитьКодОрганаФСГСПодразделения(Подразделение, КодФСГС);
КонецПроцедуры

// См. РегламентированнаяОтчетностьПереопределяемый.ОтчетыПриАктивизацииСтрокиНаСервере.
Процедура ОтчетыПриАктивизацииСтрокиНаСервере(СсылкаНаОбъект) Экспорт
	ЗарплатаКадрыБазовый.ОтчетыПриАктивизацииСтрокиНаСервере(СсылкаНаОбъект);
КонецПроцедуры

// См. РегламентированнаяОтчетностьПереопределяемый.ФормаРегламентированнойОтчетности_ПриСозданииНаСервере.
Процедура ФормаРегламентированнойОтчетности_ПриСозданииНаСервере(Форма) Экспорт
	ЗарплатаКадрыБазовый.ФормаРегламентированнойОтчетности_ПриСозданииНаСервере(Форма);
КонецПроцедуры

#КонецОбласти

#Область Печать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	
КонецПроцедуры

// Дополнительные настройки списка команд печати.
//
// Параметры:
//  НастройкиСписка - Структура - модификаторы списка команд печати.
//   * МенеджерКомандПечати     - МенеджерОбъекта - менеджер объекта, в котором формируется список команд печати;
//   * АвтоматическоеЗаполнение - Булево - заполнять команды печати из объектов, входящих в состав журнала.
//                                         Значение по умолчанию: Истина.
//
Процедура ПриПолученииНастроекСпискаКомандПечати(НастройкиСписка) Экспорт
	
	ЗарплатаКадрыБазовый.ПриПолученииНастроекСпискаКомандПечати(НастройкиСписка);
	
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииНастроекПечати
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииНастроекПечати(Настройки);
	
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриДобавленииКомандПечати
Процедура ПриДобавленииКомандПечати(ИмяФормы, КомандыПечати) Экспорт
	ЗарплатаКадрыБазовый.ПриДобавленииКомандПечати(ИмяФормы, КомандыПечати);
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриПолученииКомандПечати.
Процедура ПриПолученииКомандПечати(КомандыПечати, ИмяОбъекта) Экспорт
	
	ЗарплатаКадрыБазовый.ПриПолученииКомандПечати(КомандыПечати, ИмяОбъекта);
	
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовПечатнойФормы.
Процедура ПриОпределенииОбъектовПечатнойФормы(ОбъектыПечатнойФормы, ИдентификаторПечатнойФормы, ИмяМенеджераПечати, ПараметрыПечати) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииОбъектовПечатнойФормы(ОбъектыПечатнойФормы, ИдентификаторПечатнойФормы, ИмяМенеджераПечати, ПараметрыПечати);
	
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриПечати.
Процедура ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ЗарплатаКадрыБазовый.ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

// См. УправлениеПечатьюМультиязычностьПереопределяемый.ПриОпределенииДоступныхДляПереводаМакетов
Процедура ПриОпределенииДоступныхДляПереводаМакетов(Макеты) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииДоступныхДляПереводаМакетов(Макеты);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронноеВзаимодействие

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьСоответствиеСправочников.
Процедура ЭлектронноеВзаимодействиеПриОпределенииСоответствияСправочников(СоответствиеСправочников) Экспорт
	
	ЗарплатаКадрыБазовый.ЭлектронноеВзаимодействиеПриОпределенииСоответствияСправочников(СоответствиеСправочников);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	ЗарплатаКадрыБазовый.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа.
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	ЗарплатаКадрыБазовый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	ЗарплатаКадрыБазовый.ПриЗаполненииОграниченияДоступа(Список, Ограничение);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	ЗарплатаКадрыБазовый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа.
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ЗарплатаКадрыБазовый.ПриЗаполненииВидовДоступа(ВидыДоступа);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииИспользованияВидаДоступа.
Процедура ПриЗаполненииИспользованияВидаДоступа(ИмяВидаДоступа, Использование) Экспорт
	
	ЗарплатаКадрыБазовый.ПриЗаполненииИспользованияВидаДоступа(ИмяВидаДоступа, Использование);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтернетПоддержкаПользователей

// См. ИнтернетПоддержкаПользователейПереопределяемый.ПриИзмененииДанныхАутентификацииИнтернетПоддержки.
Процедура ПриИзмененииДанныхАутентификацииИнтернетПоддержки(ДанныеПользователя) Экспорт
	
	
	
КонецПроцедуры

// ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

// См. РаботаСКлассификаторамиПереопределяемый.ПриДобавленииКлассификаторов.
Процедура ПриДобавленииКлассификаторов(Классификаторы) Экспорт
	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры = Неопределено) Экспорт
	
КонецПроцедуры

// Конец ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

#КонецОбласти

// См. ЗарплатаКадры.ДобавитьКомандуПереходаКОбработкеРедактированиюЗаконодательныхЗначений.
Процедура ДобавитьКомандуПереходаКОбработкеРедактированиюЗаконодательныхЗначений(Форма, КоманднаяПанельФормы) Экспорт
	ЗарплатаКадрыБазовый.ДобавитьКомандуПереходаКОбработкеРедактированиюЗаконодательныхЗначений(Форма, КоманднаяПанельФормы);
КонецПроцедуры

Функция РегистраторыПереносаДанных() Экспорт
	Возврат ЗарплатаКадрыБазовый.РегистраторыПереносаДанных();
КонецФункции

#Область УправлениеОтборамиВФормахСДинамическимСписком

Процедура НастроитьМодифицирующийПараметрОтбора(СтрокаПараметра, Список, МетаданныеОбъекта, Элементы) Экспорт
	
КонецПроцедуры

Процедура ДополнитьОписаниеМодифицирующегоПараметраОтбора(ИмяПараметра, ОписаниеПараметра, ИмяМодификации) Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура ОбновитьЗначенияМинимальнойОплатыТрудаРФ(ТекстXML, ПолучатьДанныеИзСервиса) Экспорт
	ЗарплатаКадрыБазовый.ОбновитьЗначенияМинимальнойОплатыТрудаРФ(ТекстXML, ПолучатьДанныеИзСервиса);
КонецПроцедуры

// Выполняет начальное заполнение справочников и регистров сведений. Поддерживаются
// следующие имена объектов метаданных:
//
// Подсистема РасчетЗарплаты:
//		РегистрСведений.МинимальнаяОплатаТрудаРФ
//
// Подсистема УчетНДФЛ:
//		Справочник.ВидыВычетовНДФЛ
//		Справочник.ВидыДоходовНДФЛ
//		Справочник.СтатусыНалогоплательщиковПоНДФЛ
//		РегистрСведений.ВычетыПоДоходамНДФЛ
//		РегистрСведений.РазмерВычетовНДФЛ.
//
// Подсистема УчетСтраховыхВзносов:
//		Справочник.ВидыДоходовПоСтраховымВзносам
//		Справочник.ВидыТарифовСтраховыхВзносов
//		РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов
//		РегистрСведений.СтраховыеВзносыСкидкиКДоходам
//		РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией
//		РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда
//		РегистрСведений.ТарифыСтраховыхВзносов.
//
// Подсистема ПерсонифицированныйУчет;
//		Справочник.ВидыОбщественноПолезнойДеятельностиСЗВК
//		Справочник.ОснованияДосрочногоНазначенияПенсии
//		Справочник.ОснованияДосрочногоНазначенияПенсииДляСЗВК
//		Справочник.ПараметрыИсчисляемогоСтраховогоСтажа
//		Справочник.ТерриториальныеУсловияПФР
//		РегистрСведений.ДопустимыеСочетанияКодовГруппСтажа.
//
// Подсистема УчетПособийСоциальногоСтрахования:
//		РегистрСведений.МаксимальныйРазмерЕжемесячнойСтраховойВыплаты
//
Процедура УстановитьНачальныеЗначения(ИменаОбъектовМетаданных) Экспорт

	ЗарплатаКадрыБазовый.УстановитьНачальныеЗначения(ИменаОбъектовМетаданных);

КонецПроцедуры

Процедура ПроверитьВозможностьСменыГоловнойОрганизации(Организация, Отказ) Экспорт
	
	ЗарплатаКадрыБазовый.ПроверитьВозможностьСменыГоловнойОрганизации(Организация, Отказ);
	
КонецПроцедуры

Функция ОписанияРегистровСодержащихРегистрацииВНалоговомОргане() Экспорт
	
	Возврат ЗарплатаКадрыБазовый.ОписанияРегистровСодержащихРегистрацииВНалоговомОргане();
	
КонецФункции

// ЗарплатаКадрыПодсистемы.ПодписиДокументов

// См. ПодписиДокументовПереопределяемый.ПриОпределенииРолейПодписантов.
Процедура ПриОпределенииРолейПодписантов(РолиПодписантов) Экспорт
	ЗарплатаКадрыБазовый.ПриОпределенииРолейПодписантов(РолиПодписантов);
КонецПроцедуры


Процедура ОбработкаПолученияФормыСтатьиРасходовЗарплата(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	// в базовой реализации не переопределяется
	
КонецПроцедуры

// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов

Процедура ПроверитьИсключенияПроверкиЗапретаИзменения(Объект, ПроверкаЗапретаИзменения, УзелПроверкиЗапретаЗагрузки, ВерсияОбъекта) Экспорт
	
		
КонецПроцедуры

// Предназначена для использования в ОбщегоНазначенияПереопределяемый.ЗаполнитьТаблицуПереименованияОбъектовМетаданных.
//
// Заполняет переименования тех объектов метаданных, которые невозможно
// автоматически найти по типу, но ссылки на которые требуется сохранять
// в базе данных (например: подсистемы, роли).
//
// Подробнее: см. ОбщегоНазначения.ДобавитьПереименование().
//
Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	
	ЗарплатаКадрыБазовый.ПриДобавленииПереименованийОбъектовМетаданных(Итог);
	
КонецПроцедуры

Процедура ОбработкаДокументовПечатныхФорм() Экспорт
	
	ЗарплатаКадрыБазовый.ОбработкаДокументовПечатныхФорм();
	
КонецПроцедуры

// СтандартныеПодсистемы.ПоискИУдалениеДублей

Процедура ПриОпределенииОбъектовСПоискомДублей(Объекты) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииОбъектовСПоискомДублей(Объекты);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПоискИУдалениеДублей

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ПриОпределенииОбъектовСКомандамиУчетаОригиналов.
Процедура ПриОпределенииОбъектовСКомандамиУчетаОригиналов(СписокОбъектов) Экспорт
	
КонецПроцедуры

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ПриОпределенииМногосотрудниковыхДокументов.
Процедура ПриОпределенииМногосотрудниковыхДокументов(СписокОбъектов) Экспорт
	
КонецПроцедуры

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ЗаполнитьТаблицуУчетаОригиналов.
Процедура ЗаполнитьТаблицуУчетаОригиналов(ТаблицаУчетаОригиналов) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

// СтандартныеПодсистемы.ИнформацияПриЗапуске

// См. ИнформацияПриЗапускеПереопределяемый.ОпределитьНастройки.
Процедура ОпределитьНастройки(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ИнформацияПриЗапуске

// СтандартныеПодсистемы.КонтактнаяИнформация

// См. УправлениеКонтактнойИнформацией.ПриОпределенииНастроек
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииНастроек(Настройки);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#Область РаботаСФайлами

// См. РаботаСФайламиПереопределяемый.ПриСозданииФормыСпискаФайлов.
Процедура ПриСозданииФормыСпискаФайлов(Форма) Экспорт
	
	ЗарплатаКадрыБазовый.ПриСозданииФормыСпискаФайлов(Форма);
	
КонецПроцедуры

// См. РаботаСФайламиПереопределяемый.ПриСозданииФормыЭлементаФайлов.
Процедура ПриСозданииФормыЭлементаФайлов(Форма) Экспорт
	
	ЗарплатаКадрыБазовый.ПриСозданииФормыЭлементаФайлов(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияС1СДокументооборот

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ДополнитьСоответствиеТипов.
Процедура ДополнитьСоответствиеТипов(Таблица) Экспорт
	
	ЗарплатаКадрыБазовый.ДополнитьСоответствиеТипов(Таблица);
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ЗаполнитьРеквизитыИзПотребителя.
Процедура ЗаполнитьРеквизитыОбъектаДокументооборота(Прокси, ОбъектXDTO, СсылкаНаПотребитель) Экспорт
	
	ЗарплатаКадрыБазовый.ЗаполнитьРеквизитыОбъектаДокументооборота(Прокси, ОбъектXDTO, СсылкаНаПотребитель);
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриЗаполненииСвойстваОбъектаXDTOПоЗначению.
Процедура ПриЗаполненииСвойстваОбъектаXDTOПоЗначению(Значение, Свойства, ТипОбъекта, ИмяСвойства, ТипСвойства,
		СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриИзмененииСостоянияСогласования.
Процедура ПриИзмененииСостоянияСогласования(ПредметСогласования, Состояние, ВызовИзФормыОбъекта) Экспорт
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриОпределенииЗначенияРеквизитаПоОбъектуXDTO.
Процедура ПриОпределенииЗначенияРеквизитаПоОбъектуXDTO(Результат, ЗначениеЗаполнения, ТипРеквизита, ИмяРеквизита,
		ТипОбъекта, Объект, ЭтоДополнительноеСвойство, Свойство, ПараметрыВыбора) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииЗначенияРеквизитаПоОбъектуXDTO(
		Результат,
		ЗначениеЗаполнения,
		ТипРеквизита,
		ИмяРеквизита,
		ТипОбъекта,
		Объект,
		ЭтоДополнительноеСвойство,
		Свойство,
		ПараметрыВыбора);
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриОпределенииНеобходимостиВыводитьКомандуПрисоединенныхФайловДО.
Процедура ПриОпределенииНеобходимостиВыводитьКомандуПрисоединенныхФайловДО(Форма, Результат, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриОпределенииОбновляемыхРеквизитовПроведенногоДокумента.
Процедура ПриОпределенииОбновляемыхРеквизитовПроведенногоДокумента(ПолноеИмя, ОбновляемыеРеквизиты) Экспорт
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотПереопределяемый.ПриОпределенииСокращенногоНаименованияКонфигурации.
Процедура ПриОпределенииСокращенногоНаименованияКонфигурации(СокращенноеНаименование) Экспорт
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриСозданииПоСсылке.
Процедура ПриСозданииПоСсылке(ОбъектИС, ОбъектXDTO, ЗаполняемыйОбъектИС) Экспорт
	
	ЗарплатаКадрыБазовый.ПриСозданииПоСсылке(ОбъектИС, ОбъектXDTO, ЗаполняемыйОбъектИС);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияС1САрхивом

// См. ОбменСАрхивомПереопределяемый.ПриСозданииНаСервере.
Процедура ПриСозданииНаСервере(Форма, ПараметрыРазмещения, ЭтоФормаОбъекта) Экспорт

	ЗарплатаКадрыБазовый.ПриСозданииНаСервере(Форма, ПараметрыРазмещения, ЭтоФормаОбъекта);
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ЭтоФормаОбъекта.
Функция ЭтоФормаОбъекта(Форма) Экспорт
	
	Возврат ЗарплатаКадрыБазовый.ЭтоФормаОбъекта(Форма);
	
КонецФункции

// См. ОбменСАрхивомПереопределяемый.ИмяРеквизитаФормыСодержащегоИнтегрируемыйОбъект.
Функция ИмяРеквизитаФормыСодержащегоИнтегрируемыйОбъект(Форма) Экспорт
	
	Возврат ЗарплатаКадрыБазовый.ИмяРеквизитаФормыСодержащегоИнтегрируемыйОбъект(Форма);

КонецФункции

// См. ОбменСАрхивомПереопределяемый.ПриОпределенииИменИсключаемыхКоманд.
Процедура ПриОпределенииИменИсключаемыхКоманд(Форма, ИменаИсключаемыхКоманд) Экспорт
	
	ЗарплатаКадрыБазовый.ПриОпределенииИменИсключаемыхКоманд(Форма, ИменаИсключаемыхКоманд);
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.УстановитьВидимостьИДоступностьКоманд.
Процедура УстановитьВидимостьИДоступностьКоманд(Форма, СтандартнаяОбработка) Экспорт
	
	ЗарплатаКадрыБазовый.УстановитьВидимостьИДоступностьКоманд(Форма, СтандартнаяОбработка);
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ПроверитьГотовностьДокументаКОтправке.
Процедура ПроверитьГотовностьДокументаКОтправке(Ссылка, Отказ) Экспорт

	ЗарплатаКадрыБазовый.ПроверитьГотовностьДокументаКОтправке(Ссылка, Отказ);
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ТаблицаДанныхНСИДляВыгрузки.
Функция ТаблицаДанныхНСИДляВыгрузки(СсылкиНаОбъектыНСИ, ТипОбъектаXDTO) Экспорт
	
	Возврат ЗарплатаКадрыБазовый.ТаблицаДанныхНСИДляВыгрузки(СсылкиНаОбъектыНСИ, ТипОбъектаXDTO);
	
КонецФункции

// См. ОбменСАрхивомПереопределяемый.ОбновитьВидыДокументовПриОбновленииКонфигурации.
Процедура ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика) Экспорт
	
	ЗарплатаКадрыБазовый.ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика);

КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.СоздатьДокументыБИА.
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	
	Возврат ЗарплатаКадрыБазовый.СоздатьДокументыБИА(СсылкаНаОбъектИсточник);
	
КонецФункции

// См. ОбменСАрхивомПереопределяемый.ПриЗаписиКонстантыИнтеграцияС1САрхивом.
Процедура ПриЗаписиКонстантыИнтеграцияС1САрхивом(Объект, Отказ) Экспорт
	
	ЗарплатаКадрыБазовый.ПриЗаписиКонстантыИнтеграцияС1САрхивом(Объект, Отказ);
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьРегистрацииВОрганеСтатистики(ПараметрыОбновления = Неопределено) Экспорт
	
	ЗарплатаКадрыБазовый.ЗаполнитьРегистрацииВОрганеСтатистики(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ПриОпределенииИнформацииОНачислениях(Кэш, Результат, ВидыРасчета) Экспорт
	ЗарплатаКадрыБазовый.ПриОпределенииИнформацииОНачислениях(Кэш, Результат, ВидыРасчета);
КонецПроцедуры

Процедура ПриОпределенииИнформацииОбУдержаниях(Кэш, Результат, ВидыРасчета) Экспорт
	ЗарплатаКадрыБазовый.ПриОпределенииИнформацииОбУдержаниях(Кэш, Результат, ВидыРасчета);
КонецПроцедуры

#Область ЗадачиБухгалтера

// См. ДокументооборотСКОПереопределяемый.ОбновитьИЗаполнитьТребованияФНС.
Процедура ОбновитьИЗаполнитьТребованияФНС(Организация, Дата) Экспорт
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ПолучитьДоступныеВидыДействийКалендаряБухгалтера.
Процедура ПолучитьДоступныеВидыДействийКалендаряБухгалтера(МассивДоступныхДействий) Экспорт
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьКорректныеИдентификаторыТребованийОтчетов.
Процедура ЗаполнитьКорректныеИдентификаторыТребованийОтчетов(ИдентификаторыТребований) Экспорт
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ПолучитьПравилаИсключения.
Процедура ПолучитьПравилаИсключения(МенеджерВременныхТаблиц) Экспорт
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ДополнитьПредопределенныеПравила.
Процедура ДополнитьПредопределенныеПравила(Правила, ВерсияПравил) Экспорт
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.УстановитьВерсиюДополнительныхПравилПредставленияОтчетовУплатыНалогов.
Процедура УстановитьВерсиюДополнительныхПравилПредставленияОтчетовУплатыНалогов(ВерсияДополнительныхПравил) Экспорт
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ПриОпределенииТекстаЗапросаСпискаЗадач.
Процедура ПриОпределенииТекстаЗапросаСпискаЗадач(СписокЗадач) Экспорт
	
КонецПроцедуры

// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействия.
Процедура ПриОпределенииОписанияДействия(ОписаниеДействия, Событие) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияФормированиеПлатежныхПорученийНаУплатуНалогов
//
Процедура ПриОпределенииОписанияДействияФормированиеПлатежныхПорученийНаУплатуНалогов(Событие, ОписаниеДействия) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияВыплатаЗарплатыИУплатаНДФЛ
//
Процедура ПриОпределенииОписанияДействияВыплатаЗарплатыИУплатаНДФЛ(Событие, Аванс, ОписаниеДействия) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияСведенияЭТКЕжемесячные
//
Процедура ПриОпределенииОписанияДействияСведенияЭТКЕжемесячные(Событие, ОписаниеДействия) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПолучитьСвязанныеЗадачиВыплатыЗарплаты
//
Процедура ПолучитьСвязанныеЗадачиВыплатыЗарплаты(ТаблицаЗадач, РеквизитыДокумента, ПравилоВыплатыЗарплатыАванс) Экспорт

КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ЗаполнитьСсылкиНаРеглОтчеты
//
Процедура ЗаполнитьСсылкиНаРеглОтчеты(ПараметрыРеглОтчетов) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииПризнакаДокументВыполняетЗадачу
//
Процедура ПриОпределенииПризнакаДокументВыполняетЗадачу(ДокументВыполняетЗадачу, ДокументОбъект) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ОпределитьРеквизитыПлатежаПоДаннымДокумента
//
Процедура ОпределитьРеквизитыПлатежаПоДаннымДокумента(РеквизитыПлатежа, ДокументСсылка) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераСтатистикаПереопределяемый.УстановитьТекстЗапросаРеспондентыРосстата
//
Процедура УстановитьТекстЗапросаРеспондентыРосстата(ТекстЗапроса) Экспорт

КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераСтатистикаПереопределяемый.ОпределитьОрганизациюПоРеспонденту
//
Процедура ОпределитьОрганизациюПоРеспонденту(Организация, Респондент)Экспорт

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияПрименяетРайонныйКоэффициент
//
Процедура ОпределитьОрганизацияПрименяетРайонныйКоэффициент(ПрименятьРайонныйКоэффициент, Организация, Период) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияПрименяетСевернуюНадбавку
//
Процедура ОпределитьОрганизацияПрименяетСевернуюНадбавку(ПрименятьСевернуюНадбавку, Организация, Период) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияРаботаетВСельскойМестности
//
Процедура ОпределитьОрганизацияРаботаетВСельскойМестности(РаботаетВСельскойМестности, Организация, Период) Экспорт

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьДоговорыПодряда
//
Процедура ОпределитьЕстьДоговорыПодряда(ДоговорыПодряда, Организация, Период, Периодичность) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьДокументыОтпускаБезСодержания
//
Процедура ОпределитьЕстьДокументыОтпускаБезСодержания(ОтпускаБезСодержания, Организация, Период, Периодичность) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьСотрудники_ЧАЭС
//
Процедура ОпределитьЕстьСотрудники_ЧАЭС(Сотрудники_ЧАЭС, Организация, Период) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьИспользуетсяТрудНаемныхРаботников
//
Процедура ОпределитьИспользуетсяТрудНаемныхРаботников(Признак, УсловияПримененияПравил, Организация) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьВыплачиваетсяЗарплата
//
Процедура ОпределитьВыплачиваетсяЗарплата(Признак, УсловияПримененияПравил, Организация, Период) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЗарегистрированыКадровыеМероприятия
//
Процедура ОпределитьЗарегистрированыКадровыеМероприятия(Признак, УсловияПримененияПравил, Организация, Период, Периодичность) Экспорт

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьСведенияОДоходахНДФЛ
//
Процедура ПроверитьСведенияОДоходахНДФЛ(ЕстьДоходы, Организация, НачалоПериода, КонецПериода) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьСведенияОДоходахНДФЛ
//
Процедура ОпределитьПлательщикЕНП(ПлательщикЕНП, Организация, Период) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЭтоПлательщикТорговогоСбора
//
Процедура ОпределитьЭтоПлательщикТорговогоСбора(ПлательщикТорговогоСбора, Организация, Период) Экспорт

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ЕстьНалогКУплатеПоДекларации3НДФЛ
//
Процедура УточнитьЕстьНалогКУплатеПоДекларации3НДФЛ(ЕстьНалог, Организация, Период) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ЕстьЗадолженностьУчредителейПоОплатеУставногоКапитала
//
Процедура ОпределитьЭтоОбособленноеПодразделение(ЭтоОбособленноеПодразделение, Организация) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.УсловиеВыполняется
//
Процедура ПроверитьПлательщикФиксированныхВзносов(Плательщик, Организация, Период) Экспорт

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.УсловиеВыполняется
//
Процедура ПроверитьПорядокУплатыФиксированныхСтраховыхВзносов(УсловиеВыполняется, Условие, Организация, Период) Экспорт

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.УсловиеВыполняется
//
Процедура ПроверитьПлательщикФиксированныхВзносовНаДатуЗакрытия(Плательщик, Организация, Период, ДатаЗакрытия) Экспорт
	
КонецПроцедуры

// Подробнее
// См. РегистрыСведений.НалогиОтчеты.ПодготовитьДанные
//
Процедура ОпределитьНалогиПорядокКоторыхУстанавливаетсяНаМестах(СписокНалогов) Экспорт
	
КонецПроцедуры

// Подробнее
// См. РегистрыСведений.НалогиОтчеты.ПодготовитьДанные
//
Процедура ОпределитьПорядокУплатыРегиональныхМестныхНалогов(ПорядокУплаты, Организация, ТекущаяДата) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьУчетЗарплатыИКадровВЭтойПрограмме
//
Процедура ОпределитьУчетЗарплатыИКадровВЭтойПрограмме(УсловиеВыполняется) Экспорт
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьНачисляютсяДополнительныеВзносыЧленамЛетныхЭкипажейИлиШахтерам
//
Процедура ОпределитьНачисляютсяДополнительныеВзносыЧленамЛетныхЭкипажейИлиШахтерам(УсловиеВыполняется, Организация) Экспорт
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ОпределитьОтправлятьУведомления
//
Процедура ОпределитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище) Экспорт
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ОпределитьОтправлятьУведомленияСЭДО
//
Процедура ОпределитьОтправлятьУведомленияСЭДО(ОтправлятьУведомления, ВладелецДанныхВХранилище, ОтправлятьУведомленияСЭДОПоЭлектроннойПочте) Экспорт
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ОпределитьПолучателя
//
Процедура ОпределитьПолучателя(Получатель, ВладелецДанныхВХранилище) Экспорт
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ЗаполнитьАдресИнформационнойБазы
//
Процедура ЗаполнитьАдресИнформационнойБазы(АдресИнформационнойБазы, ВладелецДанныхВХранилище) Экспорт
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.УстановитьОтправлятьУведомления
//
Процедура УстановитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище, КлючДанных) Экспорт

КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.УстановитьПолучателя
//
Процедура УстановитьПолучателя(Получатель, ВладелецДанныхВХранилище) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриПолученииПравилПредоставленияОтчетаУплатыНДФЛПредпринимателя
//
Процедура ПриПолученииПравилПредоставленияОтчетаУплатыНДФЛПредпринимателя(Правила, Организация, Период) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияНалоговыйПлатежОтчетУведомление
//
Процедура ПриОпределенииОписанияДействияНалоговыйПлатежОтчетУведомление(ОписаниеДействия, Правило, Событие, ПолноеИмяПравила) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииЗадачСвязанныхСОтчетом
//
Процедура ПриОпределенииЗадачСвязанныхСОтчетом(ЗадачиСвязанныеСОтчетом, Документ, СвойстваОтчета, ИсточникОтчета) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриПолученииОтбораНалоговыеОрганы
//
Процедура ПриПолученииОтбораНалоговыеОрганы(ОтборНалоговыеОрганы, Организация, КодНалоговогоОргана) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.УдалитьНеЗаполненныеЭлементыМассива
//
Процедура УдалитьНеЗаполненныеЭлементыМассива(МассивЭлементов) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ЗаполнитьДоступныеОрганизацииДляОтбора
//
Процедура ЗаполнитьДоступныеОрганизацииДляОтбора(Результат, Организация, ПравоНаИзменение) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.РегулярныеПлатежи
//
Процедура ПриОпределенииНоваяТаблицаПлатежи(ТаблицаПлатежи, ТаблицаЗадач) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьКорректныйПериодВводаДокументов
//
Процедура ЗаполнитьКорректныйПериодВводаДокументов(КорректныйПериод) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьИмяЗадачиБухгалтера
//
Процедура ПолучитьИмяЗадачиБухгалтера(ИмяЗадачи, ВидНалога, Организация, Период) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьОсобыеСрокиСверкиИмущественныхНалогов
//
Процедура ПолучитьОсобыеСрокиСверкиИмущественныхНалогов(ОсобыеСрокиСверки, Организация) Экспорт

КонецПроцедуры

Процедура ЗаполнитьТаблицуСоответствияЗадачБухгалтераДляУведомлений(ВидыКодыНалогов) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьЭтоПравилоУплатыВзносовСДоходов
//
Процедура ПроверитьЭтоПравилоУплатыВзносовСДоходов(ЭтоПравилоУплатыВзносовСДоходов, Правило) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ЗаполнитьДоступныеОрганизации
//
Процедура ЗаполнитьДоступныеОрганизации(ДоступныеОрганизации) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ЗаполнитьДоступныеОрганизацииПоRLS
//
Процедура ЗаполнитьДоступныеОрганизацииПоRLS(ВсеОрганизации) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриПолученииЗадачНовыхОрганизаций
//
Процедура ПриПолученииЗадачНовыхОрганизаций(ЗадачиОрганизаций) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриПолученииТиповПравил
//
Процедура ПриПолученииТиповПравил(ТипыПравил) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.СоздатьПравилоВыплатаЗарплатыУплатаНДФЛ
//
Процедура СоздатьПравилоВыплатаЗарплатыУплатаНДФЛ(МенеджерВременныхТаблиц, Организация, ОтборПравил) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.СоздатьПравилаУплатыНалоговНаМестах
//
Процедура СоздатьПравилаУплатыНалоговНаМестах(МенеджерВременныхТаблиц, Организация, ИмяЗадачи = "", ТекущийПериод = Неопределено) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.УстановитьОтборПоОсновнойОрганизации
//
Процедура УстановитьОтборПоОсновнойОрганизации(Форма, ИмяСписка = "Список", ИмяРеквизита = "Организация", ЗначениеОтбора = Неопределено) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ДополнитьДанныеЗаполненияПриОднофирменномУчете
//
Процедура ДополнитьДанныеЗаполненияПриОднофирменномУчете(ДанныеЗаполнения, ИмяРеквизитаОрганизация) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьПравоРедактированияНалогиОтчеты
//
Процедура ПроверитьПравоРедактированияНалогиОтчеты(Право) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ДополнитьЗапросПриПолученииАктуальныхПравил
//
Процедура ДополнитьЗапросПриПолученииАктуальныхПравил(Запрос, ТекстЗапроса) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьКорректностьЗагружаемогоТребования
//
Процедура ПроверитьКорректностьЗагружаемогоТребования(Некорректное, КорректныеИдентификаторы, МассивДоступныхДействий, ИдентификаторЗадачи, ИдентификаторТребования, Действие) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриСозданииНаСервереСписокЗадачНастройка
//
Процедура ПриСозданииНаСервереСписокЗадачНастройка(Форма) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриСозданииНаСервереСписокЗадач
//
Процедура ПриСозданииНаСервереСписокЗадач(Форма) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьПоддерживается1СФинОтчетность
//
Процедура ПроверитьПоддерживается1СФинОтчетность(Поддерживается1СФинОтчетность) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ВосстановитьОтборСписка
//
Процедура ВосстановитьОтборСписка(Список, Настройки, ИмяОтбора) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьУсловияПримененияПравил
//
Процедура ЗаполнитьУсловияПримененияПравил(Условия, Организация, НачалоПериода, КонецПериода) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ДобавитьОформляемоеПоле
//
Процедура ДобавитьОформляемоеПоле(КоллекцияОформляемыхПолей, ИмяПоля) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьСтруктуруИзРезультатаЗапроса
//
Процедура ПолучитьСтруктуруИзРезультатаЗапроса(СтруктураПараметров, РезультатЗапроса) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьБаннерНаСервере
//
Процедура ПолучитьБаннерНаСервере(РезультатПолученияБаннера, СторонниеСертификаты, ПоказатьПредыдущий, Форма) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьПравоВыполненияЗадачи
//
Процедура ПолучитьПравоВыполненияЗадачи(ЕстьПраво, Задача) Экспорт
	
КонецПроцедуры 

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ЗаполнитьСобытияКалендаряБухгалтера
//
Процедура ЗаполнитьСобытияКалендаряБухгалтера(ЗадачиОрганизаций, Организации, ОтборЗадач) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьДанныеЗадачиБухгалтера
//
Процедура ПолучитьДанныеЗадачиБухгалтера(ДанныеЗадачиБухгалтера, Организация) Экспорт

КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьКоличествоПросроченныхСобытийКалендаряБухгалтера
//
Процедура ПолучитьКоличествоПросроченныхСобытийКалендаряБухгалтера(КоличествоПросроченных, Организации, ОтборЗадач) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьОрганизацииДанныеКоторыхДоступныПользователю
//
Процедура ПолучитьОрганизацииДанныеКоторыхДоступныПользователю(ДоступныеОрганизации, ПравоНаИзменение, Пользователь) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьДатуНачалаДеятельности
//
Процедура ПолучитьДатуНачалаДеятельности(Дата, Организация) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьДатуПостановкиНаУчетНалогоплательщика
//
Процедура ПолучитьДатуПостановкиНаУчетНалогоплательщика(Дата, Организация, КонецФинансовогоПериода) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераВызовСервера.ИмяФормыНалогиОтчеты
//
Процедура ПриОпределенииИмениФормыНалогиОтчеты(ИмяФормы) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.КалендарьОтчетностиПриСозданииНаСервере
//
Процедура КалендарьОтчетностиПриСозданииНаСервере(Форма, Параметры, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииСтатусовЗадачПоДокументамСЭДО
//
Процедура ПриОпределенииСтатусовЗадачПоДокументамСЭДО(ТаблицаЗадач, ЗадачиСоСтатусами, Запрос) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ОпределитьЭтоДокументСЗВ_ТД
//
Процедура ОпределитьЭтоДокументСЗВ_ТД(ЭтоДокументСЗВ_ТД, Документ) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ЗаполнитьДанныеПлатежей
//
Процедура ЗаполнитьДанныеПлатежей(ДанныеПлатежей, Параметры) Экспорт
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриОпределенииТиповПравила
//
Процедура ПриОпределенииСпискаТиповПравила(СписокТипов) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ПриУстановкеТекстаЗапросаДанныеПриложения
//
Процедура ПриУстановкеТекстаЗапросаДанныеПриложения(ТекстЗапроса) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ПриЗаполненииНаименованияОрганизацииОблачногоПриложения
//
Процедура ПриЗаполненииНаименованияОрганизацииОблачногоПриложения(Организация, Наименование) Экспорт
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.УстановитьПараметрыВыводаКалендаряОтчетности
//
Процедура УстановитьПараметрыВыводаКалендаряОтчетности(ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьРасписаниеДокументыСЭДО
//
Процедура ЗаполнитьРасписаниеДокументыСЭДО(Запрос, Расписание) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьЗаписьРасписанияДокументСЭДО
//
Процедура ЗаполнитьЗаписьРасписанияДокументСЭДО(Запрос, Расписание) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриОпределенииЗапросаИзменений
//
Процедура ПриОпределенииЗапросаИзменений(Запрос) Экспорт
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ВТЗадачиПоКадровымМероприятиям
//
Процедура ВТЗадачиПоКадровымМероприятиям(Запрос, ИмяТаблицы) Экспорт
	
КонецПроцедуры

// См. ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.ПриИзмененииСтатусаОтправкиДокумента.
Функция ПриИзмененииСтатусаОтправкиДокумента(Ссылка, СтатусОтправки) Экспорт
	
КонецФункции

// Подробнее
// См. ЭлектронныйДокументооборотСКонтролирующимиОрганамиПереопределяемый.ПриИзмененииРучногоСтатуса
//
Процедура ПриИзмененииРучногоСтатуса(Ссылка, Статус) Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьДанныеПодписанта(Объект, ПолеПодписанта, ПолеДолжностиПодписанта) Экспорт
	ЗарплатаКадрыБазовый.ЗаполнитьДанныеПодписанта(Объект, ПолеПодписанта, ПолеДолжностиПодписанта);
КонецПроцедуры

#Область ПроцессыОбработкиДокументов

// См. ПроцессыОбработкиДокументовОбработчикиПереопределяемый.ОписаниеДополнительныхОбработчиков.
Процедура ПриОпределенииОписанияДополнительныхОбработчиковПОД(МассивОбработчиков) Экспорт

КонецПроцедуры

// См. ПроцессыОбработкиДокументовОбработчикиПереопределяемый.ИзменитьСтатусЗаявкиНаПолучениеОбразовательногоСертификата.
Процедура ИзменитьСтатусЗаявкиНаПолучениеОбразовательногоСертификата(Параметры) Экспорт

КонецПроцедуры

#КонецОбласти

Процедура АдаптацияДокументы(Форма) Экспорт
	
	ЗарплатаКадрыБазовый.АдаптацияДокументы(Форма);
	
КонецПроцедуры

#КонецОбласти
