 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовоеУсловноеОформление = Список.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Используется", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, "Наименование");
	РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, "ДатаСоздания");
	РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, "Использование");
	РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, "Автор");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Серый50УНФ); 
	
КонецПроцедуры

#КонецОбласти