
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ОформитьИнтерфейсДляМобильногоКлиентаНаСервере();
	КонецЕсли;
	
	ИспользуетсяНесколькоОрганизацийЭД = ИнтеграцияЭДО.ИспользуетсяНесколькоОрганизаций();
	Если Не ИспользуетсяНесколькоОрганизацийЭД Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Организация", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОрганизацияКонтейнера",
			"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОрганизацияПриглашения",
			"Видимость", Ложь);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НаправлениеЭДОСтрокой) Тогда
		НаправлениеЭДОСтрокой = "ПустаяСсылка";
	КонецЕсли;
	
	СостоянияЗавершенногоЭДО.ЗагрузитьЗначения(ЭлектронныеДокументыЭДО.СостоянияЗавершенногоЭДО());
	
	ЗаполнитьСписокВыбораВидовДокументов();
	
	ИзменитьВидимостьДоступностьНаСервере();
	
	НавигационнаяСсылка = "e1cib/app/" + ИмяФормы;
	
	УстановитьЗначениеПустогоКонтрагента();
	
	УстановитьУсловноеОформление();
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	КонтекстныеПодсказкиБЭД.КонтекстныеПодсказки_ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПанельКонтекстныхНовостей);
	СформироватьКонтекст();
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ИмяСпискаДокументов = Элементы.Список.Имя;
	ВидыЭлементовОтбораСпискаДокументов = ВидыЭлементовОтбораСпискаДокументов(ЭтотОбъект);
	
	Для Каждого ВидЭлементаОтбора Из ВидыЭлементовОтбораСпискаДокументов Цикл
		ОтборПоЭлементуПриЗагрузкеИзНастроек(ЭтотОбъект, ИмяСпискаДокументов, ВидЭлементаОтбора.Значение, Настройки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияСостоянияЭДО() Тогда
		
		Элементы.Список.Обновить();
		Элементы.ВсеКонтейнеры.Обновить();
		
	ИначеЕсли ИмяСобытия = "ОбновитьСостояниеПриглашений" Тогда
		
		Элементы.ВсеПриглашения.Обновить();
		
	КонецЕсли;
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	КонтекстныеПодсказкиБЭДКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьКнопкиОтборовДокументов(ЭтотОбъект);
	ОбновитьКнопкиОтборовТранспортныхКонтейнеров(ЭтотОбъект);
	ОбновитьКнопкиОтборовПриглашений(ЭтотОбъект);
	
	ОбновитьВидимостьДоступностьКомандКонтейнеров();
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	КонтекстныеПодсказкиБЭДКлиент.КонтекстныеНовости_ПриОткрытии(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидЭДПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоВидуЭлектронногоДокумента(Элементы.Список.Имя,
		ВидыЭлементовОтбораСпискаДокументов(ЭтотОбъект).ВидЭД);
	ПриИзмененииОтборовДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеЭДОПриИзменении(Элемент)
	
	НаправлениеЭДО = ПредопределенноеЗначение("Перечисление.НаправленияЭДО." + НаправлениеЭДОСтрокой);
	УстановитьОтборВСпискеПоЭлементуКлиентСервер(Список, ВидыЭлементовОтбораСпискаДокументов(ЭтотОбъект).НаправлениеЭДО,
		НаправлениеЭДО);
	ПриИзмененииОтборовДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЭДОПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоСостояниюЭДОКлиентСервер(Список,
		ВидыЭлементовОтбораСпискаДокументов(ЭтотОбъект).СостояниеЭДО, СостояниеЭДО, СостоянияЗавершенногоЭДО);
	ПриИзмененииОтборовДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтраженВУчетеПриИзменении(Элемент)
	
	УстановитьОтборВСпискеОтраженВУчетеКлиентСервер(Список,
		ВидыЭлементовОтбораСпискаДокументов(ЭтотОбъект).ОтраженВУчете, ОтраженВУчете);
	ПриИзмененииОтборовДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриглашенияПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоЭлементуКлиентСервер(ВсеПриглашения, "Организация", ОрганизацияПриглашения);
	ОбновитьКнопкиОтборовПриглашений(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриглашенияПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоЭлементуКлиентСервер(ВсеПриглашения, "Контрагент", КонтрагентПриглашения);
	ОбновитьКнопкиОтборовПриглашений(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриглашенияПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоЭлементуКлиентСервер(ВсеПриглашения, "СтатусПриглашения", СтатусПриглашения);
	ОбновитьКнопкиОтборовПриглашений(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоЭлементуКлиентСервер(Список, ВидыЭлементовОтбораСпискаДокументов(ЭтотОбъект).Контрагент,
		Контрагент);
	ПриИзмененииОтборовДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоЭлементуКлиентСервер(Список, ВидыЭлементовОтбораСпискаДокументов(ЭтотОбъект).Организация,
		Организация);
	ПриИзмененииОтборовДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоПериодуКлиентСервер(Список, "ДатаДокумента", Период);
	ПриИзмененииОтборовДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияКонтейнераПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоЭлементуКлиентСервер(ВсеКонтейнеры, "Организация", ОрганизацияКонтейнера);
	ОбновитьКнопкиОтборовТранспортныхКонтейнеров(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентКонтейнераПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоЭлементуКлиентСервер(ВсеКонтейнеры, "Контрагент", КонтрагентКонтейнера);
	ОбновитьКнопкиОтборовТранспортныхКонтейнеров(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеКонтейнераПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоЭлементуКлиентСервер(ВсеКонтейнеры, "Направление", НаправлениеКонтейнера);
	ОбновитьКнопкиОтборовТранспортныхКонтейнеров(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусКонтейнераПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПоЭлементуКлиентСервер(ВсеКонтейнеры, "Статус", СтатусКонтейнера);
	ОбновитьВидимостьДоступностьКомандКонтейнеров();
	ОбновитьКнопкиОтборовТранспортныхКонтейнеров(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокумент(ТекущиеДанные.Документооборот);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если ИнтерфейсДокументовЭДОВызовСервера.ТребуетсяВыборФайлаПередСозданиемНовогоПроизвольногоДокумента() Тогда
		ИнтерфейсДокументовЭДОКлиент.ОткрытьНовыйПроизвольныйЭлектронныйДокументСВыборомФайла();
		Возврат;
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьНовыйЭлектронныйДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ОбновитьКнопкиОтборовДокументов(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВсеКонтейнеры

&НаКлиенте
Процедура ВсеКонтейнерыПриАктивизацииСтроки(Элемент)
	
	ОбновитьВидимостьДоступностьКомандКонтейнеров();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеКонтейнерыПриНаведении(Элемент, Строка, Поле)
	
	ОбновитьВидимостьДоступностьКомандКонтейнеров();
	
КонецПроцедуры

&НаСервере
Процедура ВсеКонтейнерыПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ОбновитьКнопкиОтборовТранспортныхКонтейнеров(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВсеПриглашения

&НаСервере
Процедура ВсеПриглашенияПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ОбновитьКнопкиОтборовПриглашений(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометкаУдаления(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйДокумент = ТекущиеДанные.Документооборот;
	ПометкаУдаления = ТекущиеДанные.ПометкаУдаления;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
	ДополнительныеПараметры.Вставить("ПометкаУдаления", ПометкаУдаления);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьПометкуУдаленияВопрос", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщегоНазначенияБЭДКлиент.ЗадатьВопросНаУстановкуПометкиУдаления(ПометкаУдаления, ОписаниеОповещения);
 
КонецПроцедуры

&НаКлиенте
Процедура Распечатать(Команда)
	
	Если Не ПроверитьВыбранныеДокументы() Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеДокументы = ВыбранныеДокументыСписка();
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьФормуПечатиЭлектронныхДокументов(ВыбранныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПроизвольныйДокумент(Команда)
	
	Если ИнтерфейсДокументовЭДОВызовСервера.ТребуетсяВыборФайлаПередСозданиемНовогоПроизвольногоДокумента() Тогда
		ИнтерфейсДокументовЭДОКлиент.ОткрытьНовыйПроизвольныйЭлектронныйДокументСВыборомФайла();
		Возврат;
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьНовыйЭлектронныйДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтветственного(Команда)
	
	Если Не ПроверитьВыбранныеДокументы() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборГруппПользователей", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Документообороты = ВыбранныеДокументыСписка();
	
	ДополнительныеПараметры = Новый Структура("КоличествоКОбработке", Документообороты.Количество());
	
	ОбработкаОповещения = Новый ОписаниеОповещения("УстановитьОтветственногоОповещениеОЗавершении", ЭтотОбъект,
		ДополнительныеПараметры);
	ИнтерфейсДокументовЭДОКлиент.ПеренаправитьЭлектронныеДокументы(Документообороты, ОбработкаОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Распаковать(Команда)
	
	НераспакованныеКонтейнерыСписок = Элементы.ВсеКонтейнеры.ПолучитьСтрокиДляОбработки();
	
	СинхронизацияЭДОКлиент.РаспаковатьТранспортныеКонтейнеры(НераспакованныеКонтейнерыСписок);
 	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКонтейнерыЭДНаДиск(Команда)
	
	ДанныеФайлов = ПолучитьДанныеПрисоединенныхФайловКонтейнеровЭДНаСервере(
		Элементы.ВсеКонтейнеры.ПолучитьСтрокиДляОбработки(), УникальныйИдентификатор);
	
	МассивФайлов = Новый Массив;
	Для Каждого ДанныеФайла Из ДанныеФайлов Цикл
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(
			ДанныеФайла.ИмяФайла, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
		МассивФайлов.Добавить(ОписаниеФайла);
	КонецЦикла;
	
	Если МассивФайлов.Количество() Тогда
		ФайловаяСистемаКлиент.СохранитьФайлы(Неопределено, МассивФайлов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЭлектронныеДокументыВФорматеPDF(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьВыбранныеДокументы() Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументы = ВыбранныеДокументыСписка();
	ИнтерфейсДокументовЭДОКлиент.ВыгрузитьЭлектронныеДокументыВФорматеPDF(ЭлектронныеДокументы, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЭлектронныеДокументыДляФНС(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьВыбранныеДокументы() Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументы = ВыбранныеДокументыСписка();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЭлектронныеДокументыДляФНСЗавершение", ЭтотОбъект);
	
	Если ЕстьНезавершенныеДокументы(ЭлектронныеДокументы) Тогда
		Если ЭлектронныеДокументы.Количество() = 1 Тогда
			ТекстВопроса = НСтр("ru = 'Для документа не завершен электронный документооборот.'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Для некоторых документов не завершен электронный документооборот.'");
		КонецЕсли;
		ТекстВопроса = ТекстВопроса + " " + НСтр("ru = 'Продолжить выгрузку?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДокументооборотЦеликом(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьВыбранныеДокументы() Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументы = ВыбранныеДокументыСписка();
	ИнтерфейсДокументовЭДОКлиент.ВыгрузитьДокументооборотЦеликом(ЭлектронныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПользовательскиеОтборыДокументов(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПриОкончанииНастройкиСпискаДокументов", ЭтотОбъект);
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьНастройкиОтборовСписка(Оповещение, ЭтотОбъект, Список.КомпоновщикНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПользовательскиеОтборыТранспортныхКонтейнеров(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПриОкончанииНастройкиСпискаТранспортныхКонтейнеров", ЭтотОбъект);
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьНастройкиОтборовСписка(Оповещение, ЭтотОбъект,
		ВсеКонтейнеры.КомпоновщикНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПользовательскиеОтборыПриглашений(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПриОкончанииНастройкиСпискаПриглашений", ЭтотОбъект);
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьНастройкиОтборовСписка(Оповещение, ЭтотОбъект,
		ВсеПриглашения.КомпоновщикНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура СравнитьДанныеЭД(Команда)
	
	#Если ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Тогда
		
		ВыбранныеДокументы = ВыбранныеДокументыСписка();
		
		Если ВыбранныеДокументы.Количество() <> 2 Тогда
			ТекстСообщения = НСтр("ru = 'Необходимо выбрать 2 документа.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Представления = ПредставлениеЭлектронныхДокументов(ВыбранныеДокументы);
		
		ИмяФайла1 = ПолучитьИмяВременногоФайла("mxl");
		ИмяФайла2 = ПолучитьИмяВременногоФайла("mxl");
		
		Представления[0].Записать(ИмяФайла1);
		Представления[1].Записать(ИмяФайла2);
		
		Сравнение = Новый СравнениеФайлов;
		Сравнение.СпособСравнения = СпособСравненияФайлов.ТабличныйДокумент;
		Сравнение.ПервыйФайл = ИмяФайла1;
		Сравнение.ВторойФайл = ИмяФайла2;
		Сравнение.ПоказатьРазличияМодально();
		
		НачатьУдалениеФайлов(Новый ОписаниеОповещения(), ИмяФайла1);
		НачатьУдалениеФайлов(Новый ОписаниеОповещения(), ИмяФайла2);
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьПометкуУдаленияВопрос(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено
		Или Ответ.Значение <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьПометкуУдаления(ДополнительныеПараметры);
	
	Оповестить(ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияТекущихДелЭДО(), , ВладелецФормы);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПометкуУдаления(Знач ДополнительныеПараметры)
	
	СсылкаОбъект = ДополнительныеПараметры.ЭлектронныйДокумент.ПолучитьОбъект();
	СсылкаОбъект.УстановитьПометкуУдаления(Не ДополнительныеПараметры.ПометкаУдаления);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВыбранныеДокументы()
	
	Если Элементы.Список.ПолучитьСтрокиДляОбработки().Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо выбрать хотя бы один документ.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначениеПустогоКонтрагента()
	
	ПустойКонтрагент = ИнтеграцияЭДО.ПолучитьПустуюСсылку("Контрагенты");
	ПустаяОрганизация = ИнтеграцияЭДО.ПолучитьПустуюСсылку("Организации");
	
	ВсеПриглашения.Параметры.УстановитьЗначениеПараметра("ПустойКонтрагент", ПустойКонтрагент);
	ВсеПриглашения.Параметры.УстановитьЗначениеПараметра("ПустаяОрганизация", ПустаяОрганизация);
	ВсеПриглашения.Параметры.УстановитьЗначениеПараметра("ПустойУчастникЭДО", Неопределено);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборВСпискеПоЭлементуКлиентСервер(СписокДанных, ВидЭлемента, ЗначениеЭлемента)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДанных, ВидЭлемента,
		ЗначениеЭлемента, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ЗначениеЭлемента));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборВСпискеПоПериодуКлиентСервер(СписокДанных, ВидЭлемента, ЗначениеЭлемента)
	
	ГруппаБыстрыйОтбор = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(
		СписокДанных.Отбор.Элементы, "ГруппаОтбораПериод");
	Если ГруппаБыстрыйОтбор = Неопределено Тогда
		ГруппаБыстрыйОтбор = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			СписокДанных.Отбор.Элементы, "ГруппаОтбораПериод", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, ВидЭлемента,
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ЗначениеЭлемента.ДатаНачала, "ОтборПериодДатаНачала");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаБыстрыйОтбор, ВидЭлемента,
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ЗначениеЭлемента.ДатаОкончания, "ОтборПериодДатаОкончания");
	КонецЕсли;
	
	ГруппаБыстрыйОтбор.Использование = ЗначениеЗаполнено(ЗначениеЭлемента);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаБыстрыйОтбор, Неопределено, ЗначениеЭлемента.ДатаНачала,
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно, "ОтборПериодДатаНачала", ЗначениеЗаполнено(ЗначениеЭлемента));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаБыстрыйОтбор, Неопределено, ЗначениеЭлемента.ДатаОкончания,
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, "ОтборПериодДатаОкончания", ЗначениеЗаполнено(ЗначениеЭлемента));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборВСпискеОтраженВУчетеКлиентСервер(СписокДанных, ВидЭлемента, ЗначениеЭлемента)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДанных, ВидЭлемента,
		ЗначениеЭлемента, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЭлемента);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборВСпискеПоСостояниюЭДОКлиентСервер(СписокДанных, ВидЭлемента, ЗначениеЭлемента,
	СостоянияЗавершенногоЭДО)
	
	Если ЗначениеЭлемента = 2 Тогда
		ВидСравненияЭлемента = ВидСравненияКомпоновкиДанных.НеВСписке;
	Иначе
		ВидСравненияЭлемента = ВидСравненияКомпоновкиДанных.ВСписке;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДанных, ВидЭлемента,
		СостоянияЗавершенногоЭДО, ВидСравненияЭлемента,, ЗначениеЗаполнено(ЗначениеЭлемента));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборВСпискеПоВидуЭлектронногоДокумента(Знач ИмяСписка, Знач ИмяРеквизита)
	
	СписокДанных = ЭтотОбъект[ИмяСписка];
	ВидДокумента = ЭтотОбъект[ИмяРеквизита];
	ИмяГруппыОтбора = "ГруппаОтбора" + ИмяРеквизита;
	
	ГруппаБыстрыйОтбор = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		СписокДанных.Отбор.Элементы, ИмяГруппыОтбора, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		ГруппаБыстрыйОтбор.Использование = Ложь;
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаБыстрыйОтбор, "ВидДокумента", ВидСравненияКомпоновкиДанных.Равно, ВидДокумента);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьДоступностьНаСервере()
	
	#Если Не ТолстыйКлиентУправляемоеПриложение И Не ТолстыйКлиентОбычноеПриложение Тогда
		Элементы.СписокСравнитьДанныеЭД.Видимость = Ложь;
	#КонецЕсли
	
	Если Не ЭлектронныеДокументыЭДО.ЕстьПравоОбработкиДокументов() Тогда
		Элементы.СписокУстановитьОтветственного.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеЭлектронныхДокументов(Знач Документообороты)
	
	МассивПредставлений = Новый Массив;
	
	Для Каждого Документооборот Из Документообороты Цикл
		ЭД = ЭлектронныеДокументыЭДО.СообщениеОтправителя(Документооборот);
		ПараметрыПолученияПредставления = ЭлектронныеДокументыЭДО.НовыеПараметрыПолученияПредставленияДанныхСообщенияПоСсылке();
		ПараметрыПолученияПредставления.Сообщение = ЭД;
		ПараметрыПолученияПредставления.ВыводитьШтампыПодписей = Ложь;
		ПредставлениеДанныхСообщения =
			ЭлектронныеДокументыЭДО.ПредставлениеДанныхСообщенияПоСсылке(ПараметрыПолученияПредставления);
		МассивПредставлений.Добавить(ПредставлениеДанныхСообщения.ПредставлениеДокумента);
	КонецЦикла;
	
	Возврат МассивПредставлений;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПрисоединенныхФайловКонтейнеровЭДНаСервере(Знач КонтейнерыЭД, Знач УникальныйИдентификатор)
	
	ФайлыКонтейнеровЭД = СинхронизацияЭДО.ПрисоединенныеФайлыТранспортныхКонтейнеров(КонтейнерыЭД);
	
	ДанныеФайлов = Новый Массив;
	Для Каждого ФайлыКонтейнера Из ФайлыКонтейнеровЭД Цикл
		Для Каждого ФайлКонтейнера Из ФайлыКонтейнера.Значение Цикл
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(ФайлКонтейнера, УникальныйИдентификатор);
			ДанныеФайлов.Добавить(ДанныеФайла);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДанныеФайлов;
	
КонецФункции

&НаСервере
Процедура ОтборПоЭлементуПриЗагрузкеИзНастроек(Форма, ИмяСписка, ВидЭлемента, Настройки)
	
	СписокДанных = ЭтотОбъект[ИмяСписка];
	ЗначениеЭлемента = Настройки.Получить(ВидЭлемента);
	
	ВидыЭлементовОтбораСпискаДокументов = ВидыЭлементовОтбораСпискаДокументов(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ЗначениеЭлемента) Тогда
		Форма[ВидЭлемента] = ЗначениеЭлемента;
		
		Если ВидЭлемента = ВидыЭлементовОтбораСпискаДокументов.ВидЭД Тогда
			УстановитьОтборВСпискеПоВидуЭлектронногоДокумента(ИмяСписка, ВидЭлемента);
		ИначеЕсли ВидЭлемента = ВидыЭлементовОтбораСпискаДокументов.Период Тогда
			УстановитьОтборВСпискеПоПериодуКлиентСервер(СписокДанных, "ДатаДокумента", ЗначениеЭлемента);
		ИначеЕсли ВидЭлемента = ВидыЭлементовОтбораСпискаДокументов.СостояниеЭДО Тогда
			УстановитьОтборВСпискеПоСостояниюЭДОКлиентСервер(СписокДанных, "СостояниеЭДО",
				ЗначениеЭлемента, СостоянияЗавершенногоЭДО);
		ИначеЕсли ВидЭлемента = ВидыЭлементовОтбораСпискаДокументов.ОтраженВУчете Тогда
			УстановитьОтборВСпискеОтраженВУчетеКлиентСервер(СписокДанных, "ОтраженВУчете", ЗначениеЭлемента);
		Иначе
			УстановитьОтборВСпискеПоЭлементуКлиентСервер(СписокДанных, ВидЭлемента, ЗначениеЭлемента);
		КонецЕсли;
	КонецЕсли;
	
	Настройки.Удалить(ВидЭлемента);
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
// Возвращаемое значение:
//  Структура - Структура:
//   * Период - Строка
//   * Организация - Строка
//   * Контрагент - Строка
//   * ВидЭД - Строка
//   * НаправлениеЭДО - Строка
//   * СостояниеЭДО - Строка
//   * ОтраженВУчете - Строка
//
&НаКлиентеНаСервереБезКонтекста
Функция ВидыЭлементовОтбораСпискаДокументов(Форма)
	
	ВидыЭлементовОтбора = Новый Структура;
	ВидыЭлементовОтбора.Вставить("Период", Форма.Элементы.Период.Имя);
	ВидыЭлементовОтбора.Вставить("Организация", Форма.Элементы.Организация.Имя);
	ВидыЭлементовОтбора.Вставить("Контрагент", Форма.Элементы.Контрагент.Имя);
	ВидыЭлементовОтбора.Вставить("ВидЭД", Форма.Элементы.ВидЭД.Имя);
	ВидыЭлементовОтбора.Вставить("НаправлениеЭДО", Форма.Элементы.НаправлениеЭДО.Имя);
	ВидыЭлементовОтбора.Вставить("СостояниеЭДО", Форма.Элементы.СостояниеЭДО.Имя);
	ВидыЭлементовОтбора.Вставить("ОтраженВУчете", Форма.Элементы.ОтраженВУчете.Имя);

	Возврат ВидыЭлементовОтбора;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииОтборовДокументов()
	
	ОбновитьКнопкиОтборовДокументов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииНастройкиСпискаДокументов(Настройки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Настройки) <> Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Список.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Настройки);
	
	ОбработатьПересеченияПользовательскихИБыстрыхОтборов(Список);
	
	ПриИзмененииОтборовДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииНастройкиСпискаТранспортныхКонтейнеров(Настройки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Настройки) <> Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	ВсеКонтейнеры.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Настройки);
	
	ОбработатьПересеченияПользовательскихИБыстрыхОтборов(ВсеКонтейнеры);
	
	ОбновитьКнопкиОтборовТранспортныхКонтейнеров(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииНастройкиСпискаПриглашений(Настройки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Настройки) <> Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	ВсеПриглашения.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Настройки);
	
	ОбработатьПересеченияПользовательскихИБыстрыхОтборов(ВсеПриглашения);
	
	ОбновитьКнопкиОтборовПриглашений(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКнопкиОтборовДокументов(Форма)
	
	КоличествоОтборов = 0;
	
	ПользовательскийОтбор = ПользовательскийОтборСписка(Форма.Список);
	Для Каждого ЭлементОтбора Из ПользовательскийОтбор.Элементы Цикл
		Если ЭлементОтбора.Использование Тогда
			КоличествоОтборов = КоличествоОтборов + 1;
		КонецЕсли;
	КонецЦикла;
	
	ПоляБыстрыхОтборов = "Период,Организация,Контрагент,ВидЭД,НаправлениеЭДО,ОтраженВУчете,СостояниеЭДО";
	Для Каждого ПолеБыстрогоОтбора Из СтрРазделить(ПоляБыстрыхОтборов, ",") Цикл
		Если ЗначениеЗаполнено(Форма[ПолеБыстрогоОтбора])
			И Форма[ПолеБыстрогоОтбора] <> Ложь Тогда
			КоличествоОтборов = КоличествоОтборов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КоличествоОтборов) Тогда
		ТекстКнопкиОтбора = НСтр("ru = 'Настройки списка (%1)'");
		ТекстКнопкиОтбора = СтрШаблон(ТекстКнопкиОтбора, Строка(КоличествоОтборов));
	Иначе
		ТекстКнопкиОтбора = НСтр("ru = 'Настройки списка'");
	КонецЕсли;
	Форма.Элементы.ГруппаДокументыОтборы.Заголовок = ТекстКнопкиОтбора;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКнопкиОтборовТранспортныхКонтейнеров(Форма)
	
	КоличествоОтборов = 0;
	
	ПользовательскийОтбор = ПользовательскийОтборСписка(Форма.ВсеКонтейнеры);
	Для Каждого ЭлементОтбора Из ПользовательскийОтбор.Элементы Цикл
		Если ЭлементОтбора.Использование Тогда
			КоличествоОтборов = КоличествоОтборов + 1;
		КонецЕсли;
	КонецЦикла;
	
	ПоляБыстрыхОтборов = "ОрганизацияКонтейнера,КонтрагентКонтейнера,НаправлениеКонтейнера,СтатусКонтейнера";
	Для Каждого ПолеБыстрогоОтбора Из СтрРазделить(ПоляБыстрыхОтборов, ",") Цикл
		Если ЗначениеЗаполнено(Форма[ПолеБыстрогоОтбора])
			И Форма[ПолеБыстрогоОтбора] <> Ложь Тогда
			КоличествоОтборов = КоличествоОтборов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КоличествоОтборов) Тогда
		ТекстКнопкиОтбора = НСтр("ru = 'Настройки списка (%1)'");
		ТекстКнопкиОтбора = СтрШаблон(ТекстКнопкиОтбора, Строка(КоличествоОтборов));
	Иначе
		ТекстКнопкиОтбора = НСтр("ru = 'Настройки списка'");
	КонецЕсли;
	Форма.Элементы.ГруппаКонтейнерыОтборы.Заголовок = ТекстКнопкиОтбора;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКнопкиОтборовПриглашений(Форма)
	
	КоличествоОтборов = 0;
	
	ПользовательскийОтбор = ПользовательскийОтборСписка(Форма.ВсеПриглашения);
	Для Каждого ЭлементОтбора Из ПользовательскийОтбор.Элементы Цикл
		Если ЭлементОтбора.Использование Тогда
			КоличествоОтборов = КоличествоОтборов + 1;
		КонецЕсли;
	КонецЦикла;
	
	ПоляБыстрыхОтборов = "ОрганизацияПриглашения,КонтрагентПриглашения,СтатусПриглашения";
	Для Каждого ПолеБыстрогоОтбора Из СтрРазделить(ПоляБыстрыхОтборов, ",") Цикл
		Если ЗначениеЗаполнено(Форма[ПолеБыстрогоОтбора])
			И Форма[ПолеБыстрогоОтбора] <> Ложь Тогда
			КоличествоОтборов = КоличествоОтборов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КоличествоОтборов) Тогда
		ТекстКнопкиОтбора = НСтр("ru = 'Настройки списка (%1)'");
		ТекстКнопкиОтбора = СтрШаблон(ТекстКнопкиОтбора, Строка(КоличествоОтборов));
	Иначе
		ТекстКнопкиОтбора = НСтр("ru = 'Настройки списка'");
	КонецЕсли;
	Форма.Элементы.ГруппаПриглашенияОтборы.Заголовок = ТекстКнопкиОтбора;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПользовательскийОтборСписка(Знач Список)

	ИдентификаторНастройки = Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
	ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторНастройки);

	Если ПользовательскийОтбор = Неопределено Тогда
		ПользовательскийОтбор = Новый ОтборКомпоновкиДанных();
	КонецЕсли;

	Возврат ПользовательскийОтбор;

КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЗачеркнутыйШрифт85БЭД);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	// Невалидные подписи по МЧД
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.Красный);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЕстьНевалидныеПодписиПоМЧД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЭлектронныеДокументыДляФНСЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументы = ВыбранныеДокументыСписка();
	ИнтерфейсДокументовЭДОКлиент.ВыгрузитьЭлектронныеДокументыДляФНС(ЭлектронныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступностьКомандКонтейнеров()
	
	Если СтатусКонтейнера = ПредопределенноеЗначение("Перечисление.СтатусыТранспортныхСообщенийБЭД.КРаспаковке")
		Или СтатусКонтейнера = ПредопределенноеЗначение("Перечисление.СтатусыТранспортныхСообщенийБЭД.Неизвестный") Тогда
		Элементы.ВсеКонтейнерыРаспаковатьВыделенныеКонтейнеры.Видимость = Истина;
	Иначе
		Элементы.ВсеКонтейнерыРаспаковатьВыделенныеКонтейнеры.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

#Область ПересечениеПользовательскихИБыстрыхОтборов

&НаКлиенте
Процедура ОбработатьПересеченияПользовательскихИБыстрыхОтборов(ТекущийСписок)
	
	ПользовательскийОтбор = ПользовательскийОтборСписка(ТекущийСписок);
	
	ЭлементыОтбора = Новый Соответствие;
	ЗаполнитьЭлементыДляОбработкиПересеченийПользовательскихИБыстрыхОтборов(ЭлементыОтбора, ПользовательскийОтбор);
	
	ЭлементыУдалить = Новый Массив;
	
	Для каждого КлючЗначениеЭлементаОтбора Из ЭлементыОтбора Цикл
		
		ПолеОтбора = КлючЗначениеЭлементаОтбора.Ключ;
		ЭлементыОтбора = КлючЗначениеЭлементаОтбора.Значение;
		
		Если Не ОбработатьПересечениеОтборов(ТекущийСписок, ПолеОтбора, ЭлементыОтбора) Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			ЭлементыУдалить.Добавить(ЭлементОтбора);
		КонецЦикла;
		
	КонецЦикла;
	
	УдалитьПользовательскиеОтборы(ЭлементыУдалить, ПользовательскийОтбор);
	
КонецПроцедуры

&НаКлиенте
Функция ОбработатьПересечениеОтборов(ТекущийСписок, ПолеОтбора, ЭлементыОтбора)
	
	Если ПолеОтбора = Новый ПолеКомпоновкиДанных("ДатаДокумента") Тогда
		Возврат ОбработатьПересечениеОтборовПериод(ЭлементыОтбора);
	КонецЕсли;
	
	Если ЭлементыОтбора.Количество() <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭлементОтбора = ЭлементыОтбора[0];
	
	Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		ПравоеЗначение = ЭлементОтбора.ПравоеЗначение;
	ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
		И ЭлементОтбора.ПравоеЗначение.Количество() = 1 Тогда
		ПравоеЗначение = ЭлементОтбора.ПравоеЗначение[0].Значение;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПравоеЗначение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПолеОтбора = Новый ПолеКомпоновкиДанных("Организация")
		И Элементы.Организация.Видимость Тогда
		Организация = ПравоеЗначение;
		УстановитьОтборВСпискеПоЭлементуКлиентСервер(ТекущийСписок, "Организация", Организация);
	ИначеЕсли ПолеОтбора = Новый ПолеКомпоновкиДанных("Контрагент") Тогда
		Контрагент = ПравоеЗначение;
		УстановитьОтборВСпискеПоЭлементуКлиентСервер(ТекущийСписок, "Контрагент", Контрагент);
	ИначеЕсли ПолеОтбора = Новый ПолеКомпоновкиДанных("ВидДокумента") Тогда
		ВидЭД = ПравоеЗначение;
		УстановитьОтборВСпискеПоВидуЭлектронногоДокумента("Список", "ВидЭД");
	ИначеЕсли ПолеОтбора = Новый ПолеКомпоновкиДанных("ОтраженВУчете")
		И ПравоеЗначение = Истина Тогда
		ОтраженВУчете = ПравоеЗначение;
		УстановитьОтборВСпискеОтраженВУчетеКлиентСервер(ТекущийСписок, "ОтраженВУчете", ОтраженВУчете);
	ИначеЕсли ПолеОтбора = Новый ПолеКомпоновкиДанных("НаправлениеЭДО") Тогда
		Возврат ОбработатьПересечениеОтборовНаправлениеЭДО(ЭлементОтбора, ПравоеЗначение);
	ИначеЕсли ПолеОтбора = Новый ПолеКомпоновкиДанных("Направление") Тогда
		НаправлениеКонтейнера = ПравоеЗначение;
		УстановитьОтборВСпискеПоЭлементуКлиентСервер(ТекущийСписок, "Направление", НаправлениеКонтейнера);
	ИначеЕсли ПолеОтбора = Новый ПолеКомпоновкиДанных("Статус") Тогда
		СтатусКонтейнера = ПравоеЗначение;
		УстановитьОтборВСпискеПоЭлементуКлиентСервер(ТекущийСписок, "Статус", СтатусКонтейнера);
	ИначеЕсли ПолеОтбора = Новый ПолеКомпоновкиДанных("СтатусПриглашения") Тогда
		СтатусПриглашения = ПравоеЗначение;
		УстановитьОтборВСпискеПоЭлементуКлиентСервер(ТекущийСписок, "СтатусПриглашения", СтатусПриглашения);	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ОбработатьПересечениеОтборовПериод(ЭлементыОтбора)
	
	Если ЭлементыОтбора.Количество() > 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДатаНачалаПериода = Неопределено;
	ДатаОкончанияПериода = Неопределено;
	
	Для каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			ДатаНачалаПериода = ЭлементОтбора.ПравоеЗначение;
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			ДатаОкончанияПериода = ЭлементОтбора.ПравоеЗначение;
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
			И ЭлементыОтбора.Количество() = 1 Тогда
			ДатаНачалаПериода = ЭлементОтбора.ПравоеЗначение;
			ДатаОкончанияПериода = ЭлементОтбора.ПравоеЗначение;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭлементыОтбора.Количество() = 2
		И (ДатаНачалаПериода = Неопределено Или ДатаОкончанияПериода = Неопределено) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Период.ДатаНачала = ?(ДатаНачалаПериода = Неопределено, Дата(1, 1, 1), ДатаНачалаПериода);
	Период.ДатаОкончания = ?(ДатаОкончанияПериода = Неопределено, Дата(1, 1, 1), ДатаОкончанияПериода);
	УстановитьОтборВСпискеПоПериодуКлиентСервер(Список, "ДатаДокумента", Период);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ОбработатьПересечениеОтборовНаправлениеЭДО(ЭлементОтбора, ПравоеЗначение)
	
	Если ПравоеЗначение = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Входящий") Тогда
		НаправлениеЭДОСтрокой = "Входящий";
	ИначеЕсли ПравоеЗначение = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Исходящий") Тогда
		НаправлениеЭДОСтрокой = "Исходящий";
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	НаправлениеЭДО = ПравоеЗначение;
	УстановитьОтборВСпискеПоЭлементуКлиентСервер(Список, "НаправлениеЭДО", НаправлениеЭДО);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЭлементыДляОбработкиПересеченийПользовательскихИБыстрыхОтборов(ЭлементыОтбора, ГруппаОтборов)
		
	Для каждого ЭлементОтбора Из ГруппаОтборов.Элементы Цикл
		
		Если Не ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")
			И ЭлементОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ Тогда
			ЗаполнитьЭлементыДляОбработкиПересеченийПользовательскихИБыстрыхОтборов(ЭлементыОтбора, ЭлементОтбора);
			Продолжить;
		КонецЕсли; 
		
		ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
		
		Если ЭлементыОтбора[ПолеОтбора] = Неопределено Тогда
			ЭлементыОтбора[ПолеОтбора] = Новый Массив;
		КонецЕсли;
		ЭлементыОтбора[ПолеОтбора].Добавить(ЭлементОтбора);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПользовательскиеОтборы(ЭлементыОтбора, ПользовательскийОтбор)
	
	Для каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")
			И ЭлементОтбора.Элементы.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементОтбора.Родитель <> Неопределено Тогда
			Если ЭлементыОтбора.Найти(ЭлементОтбора.Родитель) = Неопределено Тогда
				ЭлементыОтбора.Добавить(ЭлементОтбора.Родитель);
			КонецЕсли;
			ЭлементОтбора.Родитель.Элементы.Удалить(ЭлементОтбора);
		Иначе
			ПользовательскийОтбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаЭлектронныхДокументов

&НаСервереБезКонтекста
Функция ЕстьНезавершенныеДокументы(Знач ЭлектронныеДокументы)
	
	Возврат ЭлектронныеДокументыЭДО.НезавершенныеДокументы(ЭлектронныеДокументы).Количество() <> 0;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура УстановитьОтветственногоОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	ОчиститьСообщения();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоОбработанных = Результат.КоличествоОбработанных.КоличествоДокументов;
	Ответственный = Результат.КоличествоОбработанных.Ответственный;
	
	Если КоличествоОбработанных > 0 Тогда
		
		Элементы.Список.Обновить();
		
		ТекстСообщения = НСтр("ru='Для %КоличествоОбработанных% из %КоличествоВсего% выделенных эл.документов
			|установлен ответственный ""%Ответственный%""'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоОбработанных%", КоличествоОбработанных);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоВсего%", ДополнительныеПараметры.КоличествоКОбработке);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ответственный%", Ответственный);
		ТекстЗаголовка = НСтр("ru='Ответственный ""%Ответственный%"" установлен'");
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Ответственный%", Ответственный);
		ПоказатьОповещениеПользователя(ТекстЗаголовка, , ТекстСообщения, БиблиотекаКартинок.Информация32);
		
	Иначе
		
		ТекстСообщения = НСтр("ru='Ответственный ""%Ответственный%"" не установлен ни для одного эл.документа.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ответственный%", Ответственный);
		ТекстЗаголовка = НСтр("ru='Ответственный ""%Ответственный%"" не установлен'");
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Ответственный%", Ответственный);
		ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВидовДокументов()
	
	ВидыДокументов = ИнтерфейсДокументовЭДО.ВидыЭлектронныхДокументовДоступныеДляОтборов();
	Элементы.ВидЭД.СписокВыбора.ЗагрузитьЗначения(ВидыДокументов);
	
КонецПроцедуры

&НаКлиенте
Функция ВыбранныеДокументыСписка()
	
	ВыбранныеДокументы = Новый Массив;
	
	ВыделенныеСтроки = ОбщегоНазначенияБЭДКлиент.СтрокиТаблицыДляОбработки(Элементы.Список);
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
	
		ВыбранныеДокументы.Добавить(Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока).Документооборот);
	
	КонецЦикла;
	
	Возврат ВыбранныеДокументы;
	
КонецФункции

#Область КонтекстныеПодсказки

&НаСервере
Процедура СформироватьКонтекст(КатегорииПересчета = Неопределено)
	
	Если Не КонтекстныеПодсказкиБЭД.ФункционалКонтекстныхПодсказокДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстныеПодсказкиБЭД.ОтобразитьАктуальныеДляКонтекстаНовости(ЭтотОбъект);
	
КонецПроцедуры

// Процедура показывает новости, требующие прочтения (важные и очень важные).
//
&НаКлиенте
Процедура Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии()

	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	КонтекстныеПодсказкиБЭДКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриОткрытии(ЭтотОбъект, ИдентификаторыСобытийПриОткрытии);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПанельКонтекстныхНовостей_ЭлементУправленияНажатие(Элемент)
	
	КонтекстныеПодсказкиБЭДКлиент.ЭлементУправленияНажатие(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПанельКонтекстныхНовостейОбработкаНавигационнойСсылки(Элемент, ПараметрНавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтекстныеПодсказкиБЭДКлиент.ПанельКонтекстныхНовостей_ЭлементПанелиНовостейОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		ПараметрНавигационнаяСсылка,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // КонтекстныеПодсказки

#Область МобильныйКлиент

&НаСервере
Процедура ОформитьИнтерфейсДляМобильногоКлиентаНаСервере()
	
	ИнтерфейсДокументовЭДО.СкрытьВсеЭлементыФормы(Элементы);
	
	ВидимыеЭлементы = "Страницы, ЭлектронныеДокументы, ГруппаДокументыОтборы, Период, Организация, Контрагент, ВидЭД,
		|НаправлениеЭДО, СостояниеЭД, ОтраженВУчете, Список, СписокВидДокумента, СписокНаправлениеЭДО,
		|СписокНомерДокумента, СписокДатаДокумента, СписокКонтрагент, СписокОрганизация, СписокСостояниеЭДО";
	
	ИнтерфейсДокументовЭДО.УстановитьВидимостьЭлементов(Элементы, ВидимыеЭлементы);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Список", "Шапка", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Список", "ПутьКДаннымКартинкиСтроки", "");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
