&НаСервере
Процедура ПриСозданииНаСервере()
	
	УчастникЭДОИзПараметров = Неопределено;
	Если Параметры.Свойство("УчастникЭДО", УчастникЭДОИзПараметров) Тогда
		Запись.УчастникЭДО = УчастникЭДОИзПараметров;
	КонецЕсли;
	
	СтруктураАдреса = Неопределено;
	Параметры.Свойство("СтруктураАдреса", СтруктураАдреса);
	Если СтруктураАдреса <> Неопределено Тогда
		СтруктураАдреса.Свойство("Значение", Запись.Адрес);
		СтруктураАдреса.Свойство("Представление", Запись.ПредставлениеАдреса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ПредставлениеАдреса) = Ложь Тогда
		Запись.ПредставлениеАдреса = ОбменСГИСЭПД.ПредставлениеКонтактнойИнформации(Запись.Адрес);
	КонецЕсли;
	
	ОформлениеИнтерейса85ПриСозданииНаСервере();
	
КонецПроцедуры


#Область Интерфейс85

&НаСервере
Процедура ОформлениеИнтерейса85ПриСозданииНаСервере()

	Если КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5 Тогда
		Элементы.Основной.ВидФлажка = ВидФлажка.Выключатель;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
