///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Описывает структуру ошибки.
// Возвращаемое значение:
//  Структура - Структура для описания ошибки:
//  * КодОшибки - Строка - 
//  * ОписаниеОшибки - Строка -
//  * Детализация - Массив из Строка -
//  * НоменклатураНеНайдена - Массив из Структура -
//
Функция НоваяОшибка() Экспорт
    
    Результат = Новый Структура;
    Результат.Вставить( "КодОшибки", "" );
    Результат.Вставить( "ОписаниеОшибки", "" );
    Результат.Вставить( "Детализация", Новый Массив );
    Результат.Вставить( "НоменклатураНеНайдена", Новый Массив );
    
	Возврат Результат;
    
КонецФункции

// Проверка на использование интеграции с маркетплейсом Ozon.
// Возвращаемое значение:
//  Булево - Признак использования.
//
Функция ИспользуетсяИнтеграцияСМаркетплейсомOzon() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ИспользуетсяИнтеграция
	|ИЗ
	|	Справочник.УчетныеЗаписиМаркетплейсов КАК УчетныеЗаписиМаркетплейсов
	|ГДЕ
	|	УчетныеЗаписиМаркетплейсов.ПометкаУдаления = ЛОЖЬ";
	Запрос = Новый Запрос(ТекстЗапроса);
	Если Запрос.Выполнить().Пустой() Тогда
		ИспользуетсяИнтеграция = Ложь;
	Иначе
		ИспользуетсяИнтеграция = Истина;
	КонецЕсли;
	
	Возврат ИспользуетсяИнтеграция;
КонецФункции

// Проверка на использование интеграции с маркетплейсом Wildberries.
// Возвращаемое значение:
//  Булево - Признак использования.
//
Функция ИспользуетсяИнтеграцияСМаркетплейсомWildberries() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Результат
	|ИЗ
	|	Справочник.УчетныеЗаписиМаркетплейсов КАК УчетныеЗаписиМаркетплейсов
	|ГДЕ
	|	УчетныеЗаписиМаркетплейсов.ПометкаУдаления = ЛОЖЬ
	|	И УчетныеЗаписиМаркетплейсов.ВидМаркетплейса = &ВидМаркетплейса";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр( "ВидМаркетплейса", Перечисления.ВидыМаркетплейсов.МаркетплейсWildberries );

	УстановитьПривилегированныйРежим( Истина );
	Результат = Не Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим( Ложь );
	
	Возврат Результат;
КонецФункции

#Область РаботаСВнешнимиРесурсами

// Параметры работы с сервисом авторизации.
// 
// Возвращаемое значение:
//  Структура - Параметры работы с сервисом авторизации:
// * Сервер - Строка - 
// * Порт - Число - 
// * Протокол - Строка - 
// * ШаблонОшибки - Строка - 
// * ШаблонОшибкиСКодом - Строка - 
// * ТипОбъектОшибка - ТипОбъектаXDTO - 
Функция ПараметрыРаботыССервисомАвторизации() Экспорт

	ПараметрыРаботы = ПараметрыСоединения();
	ПараметрыРаботы.Сервер = "oauth.yandex.ru";
	ПараметрыРаботы.Вставить("ШаблонОшибки", НСтр("ru = 'При выполнении метода API %1 возникла ошибка: %2'"));
	ПараметрыРаботы.Вставить("ШаблонОшибкиСКодом", НСтр("ru = 'При выполнении метода API %1 возникла ошибка: (%2) %3'"));
	ПараметрыРаботы.Вставить("ТипОбъектОшибка", ФабрикаXDTO.Тип("oauth.yandex.ru", "error"));

	Возврат ПараметрыРаботы;

КонецФункции


// Параметры работы с яндекс диском.
// 
// Возвращаемое значение:
//  Структура - Параметры работы с яндекс диском:
// * Сервер - Строка - 
// * Порт - Число - 
// * Протокол - Строка - 
// * ШаблонОшибки - Строка - 
// * ШаблонОшибкиСКодом - Строка - 
// * ТипОбъектОшибка - ТипОбъектаXDTO - 
Функция ПараметрыРаботыСЯндексДиском() Экспорт

	ПараметрыРаботы = ПараметрыСоединения();
	ПараметрыРаботы.Сервер = "cloud-api.yandex.net";
	ПараметрыРаботы.Порт = 443;
	ПараметрыРаботы.Вставить("ШаблонОшибки", НСтр("ru = 'При выполнении метода API %1 возникла ошибка: %2'"));
	ПараметрыРаботы.Вставить("ШаблонОшибкиСКодом", НСтр("ru = 'При выполнении метода API %1 возникла ошибка: (%2) %3'"));
	ПараметрыРаботы.Вставить("ТипОбъектОшибка", ФабрикаXDTO.Тип("cloud-api.yandex.net/v1/disk", "error"));

	Возврат ПараметрыРаботы;

КонецФункции

// Возвращает значение свойства структуры
//
// Параметры:
//  ПараметрСтруктура - Структура - Структура для получения значения свойства.
//  ПараметрСвойство - Строка - Ключ свойства структуры.
//  ЗначениеПоУмолчанию   - Произвольный - Возвращаемое значение если свойство не задано в структуре
// 
// Возвращаемое значение:
//  Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию
//
Функция СтруктураСвойствоЗначениеПолучить( ПараметрСтруктура, ПараметрСвойство, ЗначениеПоУмолчанию = Неопределено ) Экспорт
	Если ТипЗнч( ПараметрСтруктура ) = Тип( "Структура" ) Тогда
		Если ПараметрСтруктура.Свойство( ПараметрСвойство ) = Истина Тогда
			Возврат ПараметрСтруктура[ ПараметрСвойство ];
		Иначе
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
КонецФункции

// Возвращает общие параметры приложения для использования в механизмах сервиса.
// Возвращаемое значение:
//  Структура - Дополненная структура функции ПараметрыПриложения().
//
Функция ПараметрыПриложенияЯндексДиск() Экспорт

	ПараметрыПриложенияЯндекс = ПараметрыПриложения();
	ПараметрыПриложенияЯндекс.ИдентификаторПриложения = "ЯндексДиск";
	ПараметрыПриложенияЯндекс.client_id = "17d0ffccaae840dba48edd4e246f6f27";
	ПараметрыПриложенияЯндекс.client_secret = "80ebf05fe140474d9b7adbdf6ade7e4e";

	Возврат ПараметрыПриложенияЯндекс;

КонецФункции

// Формирует HTTPЗапрос по переданным данным.
// Параметры:
//  Адрес - Строка - Путь к ресурсу на сервере.
//  ТелоЗапроса - Строка, ДвоичныеДанные - Источник для установки тела запроса.
//     Применимо для методов HTTP: OPTIONS, PATCH, POST и PUT.
//  ДополнительныеЗаголовки - Соответствие Из Строка - Заголовки запроса. Могут перезаписывать обязательные заголовки функции.
//     Названия заголовков не зависят от регистра букв.
// 
// Возвращаемое значение:
//  HTTPЗапрос - Подготовленный для отправки запрос HTTP.
//
Функция ЗапросHTTP(Адрес, ТелоЗапроса = "", ДополнительныеЗаголовки = Неопределено) Экспорт

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("charset", "UTF-8");
	Заголовки.Вставить("accept", "application/json");
	Заголовки.Вставить("content-type", "application/json");

	Если ДополнительныеЗаголовки <> Неопределено Тогда
		Для каждого Заголовок Из ДополнительныеЗаголовки Цикл
			Заголовки.Вставить(НРег(Заголовок.Ключ), Заголовок.Значение);
		КонецЦикла;
	КонецЕсли;

	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);

	Если Не ПустаяСтрока(ТелоЗапроса) Тогда
		Если ТипЗнч(ТелоЗапроса) = Тип("ДвоичныеДанные") Тогда
			Запрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
		Иначе
			Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

//  Записывает список ключей и значений по адресу в защищенное хранилище.
// Параметры:
//  УчетнаяЗаписьМаркетплейса - СправочникСсылка.УчетныеЗаписиМаркетплейсов - Используется для формирования адреса в хранилище.
//  ПараметрыПриложения       - Структура - Используется для формирования адреса в хранилище. Подробнее см. ПараметрыПриложения().
//  ДанныеПриложения          - Структура, Соответствие Из Строка - Источник пар ключ/значение для записи в защищенное хранилище.
//
Процедура ЗаписатьДанныеПриложенияВХранилище(УчетнаяЗаписьМаркетплейса, ПараметрыПриложения, ДанныеПриложения) Экспорт

	АдресВХранилище = Строка(УчетнаяЗаписьМаркетплейса.УникальныйИдентификатор()) + "/" + ПараметрыПриложения.ИдентификаторПриложения;
	УстановитьПривилегированныйРежим(Истина);
	Для каждого ЭлементДанных Из ДанныеПриложения Цикл
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(АдресВХранилище, ЭлементДанных.Значение, ЭлементДанных.Ключ);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Получает данные приложения из хранилища.
//
// Параметры:
//  УчетнаяЗаписьМаркетплейса - СправочникСсылка.УчетныеЗаписиМаркетплейсов - Используется для формирования адреса в хранилище.
//  ПараметрыПриложения       - Структура - Используется для формирования адреса в хранилище. Подробнее см. ПараметрыПриложения().
//  Ключи                     - Строка - Имена ключей, разделенные запятыми.
// 
// Возвращаемое значение:
//  Произвольный, Структура, Неопределено - данные из безопасного хранилища. Если указан один ключ,
//                            то возвращается его значение, иначе структура.
//                            Если данные отсутствуют - Неопределенно.
//
Функция ПолучитьДанныеПриложенияИзХранилища(УчетнаяЗаписьМаркетплейса, ПараметрыПриложения, Ключи) Экспорт

	АдресВХранилище = Строка(УчетнаяЗаписьМаркетплейса.УникальныйИдентификатор()) + "/" + ПараметрыПриложения.ИдентификаторПриложения;
	УстановитьПривилегированныйРежим(Истина);
	Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(АдресВХранилище, Ключи);

КонецФункции

#Область РаботаСЯндексАвторизацией

// Формирует адрес для интерактивного запроса кода подтверждения.
// Параметры:
//  КодПриложения- Строка - Код приложения Яндекс, для которого запрашивается доступ.
// 
// Возвращаемое значение:
//  Строка - Адрес для перехода на страницу запроса кода подтверждения.
//
Функция АдресЗапросаКодаПодтверждения(КодПриложения) Экспорт

	ТипОбъекта = ФабрикаXDTO.Тип("oauth.yandex.ru", "authorizeRequest");
	ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъекта);
	ОбъектXDTO.client_id = КодПриложения;

	ПараметрыСоединения = ПараметрыРаботыССервисомАвторизации();

	Метод = "authorize";

	СтрокаСоединения = ПротоколПоУмолчанию(ПараметрыСоединения.Порт) + ПараметрыСоединения.Сервер + "/" + Метод + ПараметрыЗапроса(ОбъектXDTO, ТипОбъекта);

	Возврат СтрокаСоединения;

КонецФункции

// Запрашивает токены авторизации приложения по коду подтверждения от пользователя.
// Параметры:
//  Приложение       - Структура - Подробности см. в функции ПараметрыПриложения().
//  КодПодтверждения - Строка - Код подтверждения, указанный пользователем.
// 
// Возвращаемое значение:
//  Структура - Результат обмена кода подтверждения на ключи доступа для приложения:
//              Содержит ключи: Отказ, token_type, access_token, expires_in, refresh_token.
//
Функция ЗапроситьТокеныАвторизацииПоКоду(Приложение, КодПодтверждения) Экспорт

	ПараметрыРаботы = ПараметрыРаботыССервисомАвторизации();

	ТипОбъекта = ФабрикаXDTO.Тип("oauth.yandex.ru", "tokenRequest");
	ЗапросОбъект = ФабрикаXDTO.Создать(ТипОбъекта);
	ЗапросОбъект.code = КодПодтверждения;
	ЗапросОбъект.client_id = Приложение.client_id;
	ЗапросОбъект.client_secret = Приложение.client_secret;

	ТелоЗапроса = ПараметрыЗапроса(ЗапросОбъект, ТипОбъекта, Ложь);
	Метод = "token";

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовки.Вставить("Content-Length", СтрДлина(ТелоЗапроса));

	Запрос = ЗапросHTTP(Метод, ТелоЗапроса, Заголовки);
	РезультатОтправки = ВыполнитьЗапросHTTP(ПараметрыРаботы, Запрос);

	ПараметрыОтвета = Новый Структура( "Отказ, token_type, access_token", Истина);
	ПараметрыОтвета.Вставить( "expires_in" );
	ПараметрыОтвета.Вставить( "refresh_token" );
	ПараметрыОтвета.Вставить( "ТекстОшибки", "" );

	ТекстОшибки = "";
	Если РезультатОтправки.Отказ Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатОтправки.ТекстОшибки);
		ТекстОшибки = ТекстОшибки + " (E1841457)";
		
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		//@skip-check constructor-function-return-section
		
		ПараметрыОтвета.ТекстОшибки = ТекстОшибки;
		
		Возврат ПараметрыОтвета;
	КонецЕсли;

	Если РезультатОтправки.КодСостояния = 200 Тогда
		РезультатПриведения = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ФабрикаXDTO.Тип("oauth.yandex.ru", "tokenResponse"));
		Если РезультатПриведения.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатПриведения.ТекстОшибки);
			ТекстОшибки = ТекстОшибки + " (E375946)";
			
			ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		Иначе
			ЗаполнитьЗначенияСвойств(ПараметрыОтвета, РезультатПриведения.Объект);
			ПараметрыОтвета.Отказ = Ложь;
		КонецЕсли;
	Иначе
		РезультатПриведенияКОшибке = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ПараметрыРаботы.ТипОбъектОшибка);
		Если РезультатПриведенияКОшибке.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, РезультатОтправки.КодСостояния, РезультатОтправки.ТекстОтвета);
			ТекстОшибки = ТекстОшибки + " (E1284745)";
		Иначе
			ОтветОбъект = РезультатПриведенияКОшибке.Объект;
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, ОтветОбъект.error, ОтветОбъект.error_description);
			ТекстОшибки = ТекстОшибки + " (E18461)";
		КонецЕсли;
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю( ТекстОшибки );

		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );			
		
	КонецЕсли;
    
    ПараметрыОтвета.ТекстОшибки = ТекстОшибки;
    
	//@skip-check constructor-function-return-section
	Возврат ПараметрыОтвета;

КонецФункции

// Запрашивает токены авторизации приложения по токену обновления.
// Параметры:
//  Приложение      - Структура - Подробности см. в функции ПараметрыПриложения().
//  ТокенОбновления - Строка - Токен обновления, полученный при предыдущем запросе.
// 
// Возвращаемое значение:
//  Структура - Результат обновления токенов доступа для приложения.
//              Содержит ключи: Отказ, token_type, access_token, expires_in, refresh_token.
//
Функция ОбновитьТокеныАвторизации(Приложение, ТокенОбновления) Экспорт

	ПараметрыРаботы = ПараметрыРаботыССервисомАвторизации();

	ТипОбъекта = ФабрикаXDTO.Тип("oauth.yandex.ru", "refreshRequest");
	ЗапросОбъект = ФабрикаXDTO.Создать(ТипОбъекта);
	ЗапросОбъект.refresh_token = ТокенОбновления;
	ЗапросОбъект.client_id = Приложение.client_id;
	ЗапросОбъект.client_secret = Приложение.client_secret;

	ТелоЗапроса = ПараметрыЗапроса(ЗапросОбъект, ТипОбъекта, Ложь);
	Метод = "token";

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовки.Вставить("Content-Length", СтрДлина(ТелоЗапроса));

	Запрос = ЗапросHTTP(Метод, ТелоЗапроса, Заголовки);
	РезультатОтправки = ВыполнитьЗапросHTTP(ПараметрыРаботы, Запрос);

	ПараметрыОтвета = Новый Структура("Отказ, token_type, access_token", Истина);
	ПараметрыОтвета.Вставить( "expires_in" ); 
	ПараметрыОтвета.Вставить( "refresh_token" );

	Если РезультатОтправки.Отказ Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатОтправки.ТекстОшибки);
		ТекстОшибки = ТекстОшибки + " (E9752457)";
		
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		//@skip-check constructor-function-return-section
		Возврат ПараметрыОтвета;
	КонецЕсли;

	Если РезультатОтправки.КодСостояния = 200 Тогда
		РезультатПриведения = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ФабрикаXDTO.Тип("oauth.yandex.ru", "tokenResponse"));
		Если РезультатПриведения.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатПриведения.ТекстОшибки);
			ТекстОшибки = ТекстОшибки + " (E918471)";
			
			ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		Иначе
			ЗаполнитьЗначенияСвойств(ПараметрыОтвета, РезультатПриведения.Объект);
			ПараметрыОтвета.Отказ = Ложь;
		КонецЕсли;
	Иначе
		РезультатПриведенияКОшибке = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ПараметрыРаботы.ТипОбъектОшибка);
		Если РезультатПриведенияКОшибке.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, РезультатОтправки.КодСостояния, РезультатОтправки.ТекстОтвета);
			ТекстОшибки = ТекстОшибки + " (E148129)";
		Иначе
			ОтветОбъект = РезультатПриведенияКОшибке.Объект;
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, ОтветОбъект.error, ОтветОбъект.error_description);
			ТекстОшибки = ТекстОшибки + " (E3791747)";
		КонецЕсли;
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю( ТекстОшибки );
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
	КонецЕсли;

	//@skip-check constructor-function-return-section
	Возврат ПараметрыОтвета;

КонецФункции

#КонецОбласти

#Область РаботаСЯндексДиском

// Получает из хранилища токен доступа, выданный приложению для работы с сервисом Яндекс.Диск.
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиМаркетплейсов - Используется для формирования адреса в хранилище.
// 
// Возвращаемое значение:
//  Строка - Токен доступа приложения.
//
Функция ПолучитьТокенДоступаЯндексДиск(УчетнаяЗапись) Экспорт

	ПараметрыПриложенияЯндекс = ПараметрыПриложенияЯндексДиск();
	ТокенДоступа = ПолучитьДанныеПриложенияИзХранилища(УчетнаяЗапись, ПараметрыПриложенияЯндекс, "access_token");

	Возврат ТокенДоступа;

КонецФункции

// Получает метаинформацию о файле или каталоге с помощью запроса GET к методу v1/disk/resources.
// Параметры:
//  ТокенДоступа       - Строка - Access_token приложения.
//  ПрисоединенныйФайл - СправочникСсылка.НоменклатураПрисоединенныеФайлы - Файл, по которому запрашивается информация от сервиса.
//  СписокПолей        - Строка - Имена реквизитов, разделенные запятой. Подробности см. в описании метода API.
// 
// Возвращаемое значение:
//  Структура - Содержит свойство "Отказ" (булево) и значения запрошенных полей.
//
Функция ПолучитьИнформациюОРесурсе(ТокенДоступа, ПрисоединенныйФайл, СписокПолей = "name") Экспорт

	СписокКлючей = "Отказ, КодСостояния" + ?(ПустаяСтрока(СписокПолей), "", ", ") + СписокПолей;

	ИнформацияОРесурсе = Новый Структура(СписокКлючей, Истина);
	ПараметрыРаботы = ПараметрыРаботыСЯндексДиском();
	ПутьКФайлуНаЯДиске = ПутьКРесурсу(ПрисоединенныйФайл);

	ТипОбъекта = ФабрикаXDTO.Тип("cloud-api.yandex.net/v1/disk", "metainfoRequest");
	ЗапросОбъект = ФабрикаXDTO.Создать(ТипОбъекта);
	ЗапросОбъект.path = ПутьКФайлуНаЯДиске;
	ЗапросОбъект.fields = СписокПолей;

	Метод = "v1/disk/resources";

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Authorization", "OAuth " + ТокенДоступа);

	Запрос = ЗапросHTTP(Метод + ПараметрыЗапроса(ЗапросОбъект, ТипОбъекта),, Заголовки);
	РезультатОтправки = ВыполнитьЗапросHTTP(ПараметрыРаботы, Запрос, "GET");

	ИнформацияОРесурсе.КодСостояния = РезультатОтправки.КодСостояния;

	Если РезультатОтправки.Отказ Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатОтправки.ТекстОшибки);
		ТекстОшибки = ТекстОшибки + " (E382957)";
		
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		Возврат ИнформацияОРесурсе;
	КонецЕсли;

	Если РезультатОтправки.КодСостояния = 200 Тогда
		РезультатПриведения = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ФабрикаXDTO.Тип("cloud-api.yandex.net/v1/disk", "metainfoResponse"));
		Если РезультатПриведения.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатПриведения.ТекстОшибки);
			ТекстОшибки = ТекстОшибки + " (E3822457)";
			
			ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		Иначе
			ОтветОбъект = РезультатПриведения.Объект;
			ЗаполнитьЗначенияСвойств(ИнформацияОРесурсе, ОтветОбъект);
			ИнформацияОРесурсе.Отказ = Ложь;
		КонецЕсли;
	Иначе
		РезультатПриведенияКОшибке = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ПараметрыРаботы.ТипОбъектОшибка);
		Если РезультатПриведенияКОшибке.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, РезультатОтправки.КодСостояния, РезультатОтправки.ТекстОтвета);
			ТекстОшибки = ТекстОшибки + " (E3142457)";
		Иначе
			ОтветОбъект = РезультатПриведенияКОшибке.Объект;
			ВладелецФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( ПрисоединенныйФайл, "ВладелецФайла" );
			ТекстОшибкиПояснение = Строка( ОтветОбъект.description ) + ": " + ВладелецФайла + ": " + ПрисоединенныйФайл;
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, ОтветОбъект.error, ТекстОшибкиПояснение);
			ТекстОшибки = ТекстОшибки + " (E3751457)";
		КонецЕсли;
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
	КонецЕсли;

	Возврат ИнформацияОРесурсе;

КонецФункции

// Загружает файл на сервис Яндекс.Диск в папку приложения и публикует его.
// Параметры:
//  ТокенДоступа          - Строка - Access_token приложения.
//  ПрисоединенныйФайл    - СправочникСсылка.НоменклатураПрисоединенныеФайлы - Файл, который загружается на сервис.
//  ОбновитьФайлНаСервисе - Булево - признак обновления.
// 
// Возвращаемое значение:
//  Структура - Содержит путь к файлу на сервисе, публичную ссылку и признак отказа в выполнении операции:
//  * ПутьКФайлуНаЯДиске - Строка -
//  * ПубличнаяСсылка - Строка - 
//  * Отказ - Булево -
//  * ОписаниеОшибки - Строка -   
//
Функция ЗагрузитьФайлНаСервис(ТокенДоступа, ПрисоединенныйФайл, ОбновитьФайлНаСервисе = Истина) Экспорт
    
    РезультатПубликации = Новый Структура;
    РезультатПубликации.Вставить("ПутьКФайлуНаЯДиске", "" );
    РезультатПубликации.Вставить("ПубличнаяСсылка", "");
    РезультатПубликации.Вставить("Отказ", Истина);
    РезультатПубликации.Вставить("ОписаниеОшибки", "");
    
    Если ПустаяСтрока( ТокенДоступа ) Тогда
		РезультатПубликации.Отказ = Истина;
		РезультатПубликации.ОписаниеОшибки = НСтр( "ru = 'Не задан токен для подключения к Яндекс.Диск'" );
		Возврат РезультатПубликации;
    КонецЕсли;
    
	ПараметрыРаботы = ПараметрыРаботыСЯндексДиском();
	ПутьКФайлуНаЯДиске = ПутьКРесурсу(ПрисоединенныйФайл);
	РезультатПубликации.ПутьКФайлуНаЯДиске = ПутьКФайлуНаЯДиске;
    
	ТипОбъекта = ФабрикаXDTO.Тип("cloud-api.yandex.net/v1/disk", "uploadGetRequest");
	ЗапросОбъект = ФабрикаXDTO.Создать(ТипОбъекта);
	ЗапросОбъект.path = ПутьКФайлуНаЯДиске;

	Метод = "v1/disk/resources/upload";

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Authorization", "OAuth " + ТокенДоступа);

	Запрос = ЗапросHTTP(Метод + ПараметрыЗапроса(ЗапросОбъект, ТипОбъекта),, Заголовки);
	РезультатОтправки = ВыполнитьЗапросHTTP(ПараметрыРаботы, Запрос, "GET");

	Если РезультатОтправки.Отказ Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатОтправки.ТекстОшибки);
		ТекстОшибки = ТекстОшибки + " (E49247)";
		
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		Возврат РезультатПубликации;
	КонецЕсли;

	Если РезультатОтправки.КодСостояния = 200 Тогда
		РезультатПриведения = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ФабрикаXDTO.Тип("cloud-api.yandex.net/v1/disk", "uploadGetResponse"));
		Если РезультатПриведения.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатПриведения.ТекстОшибки);
			ТекстОшибки = ТекстОшибки + " (E159472)";
			
			ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
			Возврат РезультатПубликации;
		Иначе
			ОтветОбъект = РезультатПриведения.Объект;
		КонецЕсли;
	Иначе
		РезультатПриведенияКОшибке = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ПараметрыРаботы.ТипОбъектОшибка);
		Если РезультатПриведенияКОшибке.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, РезультатОтправки.КодСостояния, РезультатОтправки.ТекстОтвета);
			ТекстОшибки = ТекстОшибки + " (E48417)";
		Иначе
			ОтветОбъект = РезультатПриведенияКОшибке.Объект;
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, ОтветОбъект.error, ОтветОбъект.description);
			ТекстОшибки = ТекстОшибки + " (E29421)";
		КонецЕсли;
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		Возврат РезультатПубликации;
	КонецЕсли;


	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(ОтветОбъект.href);

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "image/jpeg");

	ПараметрыСоединения = ПараметрыСоединения();
	ПараметрыСоединения.Сервер = СтруктураURI.Хост;
	ПараметрыСоединения.Порт = СтруктураURI.Порт;
	ТелоЗапроса = РаботаСФайлами.ДвоичныеДанныеФайла(ПрисоединенныйФайл, Ложь);
	Если ТелоЗапроса = Неопределено Тогда
		Возврат РезультатПубликации;
	КонецЕсли;

	Метод = СтруктураURI.ПутьНаСервере;

	Запрос = ЗапросHTTP(Метод, ТелоЗапроса, Заголовки);
	Параметры = Новый Структура( "ТелоСтроковоеПредставление", "<Двоичные данные: " + ПрисоединенныйФайл + ">" );
	РезультатОтправки = ВыполнитьЗапросHTTP(ПараметрыСоединения, Запрос, "PUT", Параметры );
	Параметры.ТелоСтроковоеПредставление = "";

	Если РезультатОтправки.Отказ Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатОтправки.ТекстОшибки);
		ТекстОшибки = ТекстОшибки + " (E213024)";
		
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		
		Возврат РезультатПубликации;
	КонецЕсли;

	Если Не ЗапросУспешноОбработан(РезультатОтправки.КодСостояния) Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатОтправки.КодСостояния, РезультатОтправки.ТекстОшибки);
		ТекстОшибки = ТекстОшибки + " (E2131941)";
		
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		
		Возврат РезультатПубликации;
	КонецЕсли;

	Если Не ЗапросУспешноОбработан(РезультатОтправки.КодСостояния) Тогда
		РезультатПриведенияКОшибке = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ПараметрыРаботы.ТипОбъектОшибка);
		Если РезультатПриведенияКОшибке.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, РезультатОтправки.КодСостояния, РезультатОтправки.ТекстОтвета);
			ТекстОшибки = ТекстОшибки + " (E2131932)";
		Иначе
			ОтветОбъект = РезультатПриведенияКОшибке.Объект;
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, ОтветОбъект.error, ОтветОбъект.description);
			ТекстОшибки = ТекстОшибки + " (E278352)";
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		
		Возврат РезультатПубликации;
	КонецЕсли;


	ТипОбъекта = ФабрикаXDTO.Тип("cloud-api.yandex.net/v1/disk", "publishRequest");
	ЗапросОбъект = ФабрикаXDTO.Создать(ТипОбъекта);
	ЗапросОбъект.path = ПутьКФайлуНаЯДиске;
	ЗапросОбъект.fields = "public_key";

	Метод = "v1/disk/resources/publish";

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Authorization", "OAuth " + ТокенДоступа);

	Запрос = ЗапросHTTP(Метод + ПараметрыЗапроса(ЗапросОбъект, ТипОбъекта),, Заголовки);
	РезультатОтправки = ВыполнитьЗапросHTTP(ПараметрыРаботы, Запрос, "PUT");

	Если РезультатОтправки.Отказ Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатОтправки.ТекстОшибки);
		ТекстОшибки = ТекстОшибки + " (E92591)";
		
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		
		Возврат РезультатПубликации;
	КонецЕсли;

	Если РезультатОтправки.КодСостояния = 200 Тогда
		РезультатПриведения = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ФабрикаXDTO.Тип("cloud-api.yandex.net/v1/disk", "publishResponse"));
		Если РезультатПриведения.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатПриведения.ТекстОшибки);
			ТекстОшибки = ТекстОшибки + " (E925914)";
			
			ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
			
			Возврат РезультатПубликации;
		Иначе
			ОтветОбъект = РезультатПриведения.Объект;
		КонецЕсли;
	Иначе
		РезультатПриведенияКОшибке = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ПараметрыРаботы.ТипОбъектОшибка);
		Если РезультатПриведенияКОшибке.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, РезультатОтправки.КодСостояния, РезультатОтправки.ТекстОтвета);
			ТекстОшибки = ТекстОшибки + " (E910342)";
		Иначе
			ОтветОбъект = РезультатПриведенияКОшибке.Объект;

			ВладелецФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( ПрисоединенныйФайл, "ВладелецФайла" );
			ТекстОшибкиПояснение = Строка( ОтветОбъект.description ) + ": " + ВладелецФайла + ": " + ПрисоединенныйФайл;
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, ОтветОбъект.error, ТекстОшибкиПояснение);
			ТекстОшибки = ТекстОшибки + " (E1234017)";
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		
		Возврат РезультатПубликации;
	КонецЕсли;

	ИнформацияОРесурсе = ПолучитьИнформациюОРесурсе(ТокенДоступа, ПрисоединенныйФайл, "public_url");

	Если Не ИнформацияОРесурсе.Отказ Тогда
		РезультатПубликации.ПубличнаяСсылка = ИнформацияОРесурсе.public_url;
		РезультатПубликации.Отказ = Ложь;
	КонецЕсли;
	Возврат РезультатПубликации;

КонецФункции

// Удаляет ресурс с сервиса Яндекс.Диск из папки приложения.
// Параметры:
//  ТокенДоступа       - Строка - Access_token приложения.
//  ПутьКФайлуНаЯДиске - Строка - Путь к файлу на сервисе. Возвращается функцией ЗагрузитьФайлНаСервис().
// 
// Возвращаемое значение:
//  Булево - Признак успешного завершения операции удаления файла.
//
Функция УдалитьФайлССервиса(ТокенДоступа, ПутьКФайлуНаЯДиске) Экспорт

	ПараметрыРаботы = ПараметрыРаботыСЯндексДиском();

	ТипОбъекта = ФабрикаXDTO.Тип("cloud-api.yandex.net/v1/disk", "deleteRequest");
	ЗапросОбъект = ФабрикаXDTO.Создать(ТипОбъекта);
	ЗапросОбъект.path = ПутьКФайлуНаЯДиске;

	Метод = "v1/disk/resources";

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Authorization", "OAuth " + ТокенДоступа);

	Запрос = ЗапросHTTP(Метод + ПараметрыЗапроса(ЗапросОбъект, ТипОбъекта),, Заголовки);
	РезультатОтправки = ВыполнитьЗапросHTTP(ПараметрыРаботы, Запрос, "DELETE");

	Если РезультатОтправки.Отказ Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибки, Метод, РезультатОтправки.ТекстОшибки);
		ТекстОшибки = ТекстОшибки + " (E123109)";
		
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		
		Возврат Ложь;
	КонецЕсли;

	Если Не ЗапросУспешноОбработан(РезультатОтправки.КодСостояния) Тогда
		РезультатПриведенияКОшибке = ПривестиКТипуОбъекта(РезультатОтправки.ТекстОтвета, ПараметрыРаботы.ТипОбъектОшибка);
		Если РезультатПриведенияКОшибке.Отказ Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, Метод, РезультатОтправки.КодСостояния, РезультатОтправки.ТекстОтвета);
			ТекстОшибки = ТекстОшибки + " (E942245)";
		Иначе
			ОтветОбъект = РезультатПриведенияКОшибке.Объект;
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрыРаботы.ШаблонОшибкиСКодом, 
			ПараметрыРаботы.Сервер + ": " + Метод + ": DELETE", ОтветОбъект.error, ОтветОбъект.description + ": " + ОтветОбъект.message + ": " + ЗапросОбъект.path );
			ТекстОшибки = ТекстОшибки + " (E817414)";
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации(ОписаниеСобытияДляЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, , Истина );
		
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеСобытияДляЖурналаРегистрации()

	Возврат НСтр("ru = 'Интеграция с маркетплейсами'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

// Формирует строку параметров запроса (QUERY).
// Параметры:
//  ОбъектXDTO          - ОбъектXDTO - Объект, из реквизитов с формой "атрибут" которого формируется строка.
//  ТипОбъекта          - ТипОбъектаXDTO - Тип объекта из операнда ОбъектXDTO.
//  ДобавитьРазделитель - Булево - Добавить к строке предваряющий разделитель (знак вопроса)
// 
// Возвращаемое значение:
//  Строка - Строковое представление параметров запроса для использования в URI.
//
Функция ПараметрыЗапроса(ОбъектXDTO, ТипОбъекта, ДобавитьРазделитель = Истина)

	СтрокиПараметров = Новый Массив;

	Для Каждого Свойство Из ТипОбъекта.Свойства Цикл
		Если Свойство.Форма = ФормаXML.Атрибут Тогда
			СтрокиПараметров.Добавить(Свойство.Имя + "=" + КодироватьСтроку(XMLСтрока(ОбъектXDTO[Свойство.Имя]), СпособКодированияСтроки.КодировкаURL));
		КонецЕсли;
	КонецЦикла;

	Если СтрокиПараметров.Количество() > 0 Тогда
		Если ДобавитьРазделитель Тогда
			Возврат "?" + СтрСоединить(СтрокиПараметров, "&");
		Иначе
			Возврат СтрСоединить(СтрокиПараметров, "&");
		КонецЕсли;
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

Функция ПараметрыСоединения()

	Возврат Новый Структура("Сервер, Порт, Протокол", "", 443, "https");

КонецФункции

// Возвращает описание приложения Яндекс.
// Возвращаемое значение:
//  Структура - Описание приложения Яндекс.
//              Содержит ключи: client_id, client_secret.
//
Функция ПараметрыПриложения()

	Возврат Новый Структура("ИдентификаторПриложения, client_id, client_secret", "", "", "");

КонецФункции

// Анализирует код состояния запроса после обработки сервером на корректность (диапазон 200-299).
//  Применяется в случаях возврата сервером множества значений кода состояния.
// Параметры:
//  КодСостояния - Число - Код состояния запроса HTTP.
// 
// Возвращаемое значение:
//  Булево - Признак успешной обработки запроса сервером.
//
Функция ЗапросУспешноОбработан(КодСостояния)

	Возврат КодСостояния >= 200 И КодСостояния <= 299;

КонецФункции

// Проверяет строку на допустимость использования в качестве метода HTTP согласно разделу 4 RFC 7231.
// Параметры:
//  Метод	 - Строка - Переданный метод HTTP.
// 
// Возвращаемое значение:
//  Булево - Признак допустимости метода HTTP.
//
Функция МетодHTTPДопустим(Метод)

	Методы = Новый Структура("DELETE, GET, POST");
	Методы.Вставить( "PUT" );
	
	Возврат Методы.Свойство(ВРег(Метод)) <> Неопределено;

КонецФункции

Функция ПротоколПоУмолчанию(Порт)

	ПортыПоУмолчанию = Новый Соответствие;
	ПортыПоУмолчанию.Вставить(80, "http://");
	ПортыПоУмолчанию.Вставить(443, "https://");
	ПортыПоУмолчанию.Вставить(21, "ftp://");
	ПортыПоУмолчанию.Вставить(990, "ftps://");

	Протокол = ПортыПоУмолчанию.Получить(Порт);
	Если Протокол = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат Протокол;
	КонецЕсли;

КонецФункции

// Формирует и отправляет запрос HTTP с анализом ответа сервера.
// Параметры:
//  ПараметрыПодключения - Структура - Параметры подключения к серверу. Подробнее см. ПараметрыСоединения().
//  Запрос               - HTTPЗапрос - Запрос для отправки.
//  МетодHTTP            - Строка - Метод HTTP из допустимых по разделу 4 RFC 7231.
//  Параметры - Структура - Дополнительные параметры
// 
// Возвращаемое значение:
//  Структура - Информация об отправке и обработке запроса сервером.
//              Содержит ключи: КодСостояния, ТекстОтвета, Отказ, ТекстОшибки.
//
Функция ВыполнитьЗапросHTTP(ПараметрыПодключения, Запрос, МетодHTTP = "POST", Параметры = Неопределено)

	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси(ПараметрыПодключения.Протокол);
	ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	Соединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер, ПараметрыПодключения.Порт,,, Прокси, 20, ЗащищенноеСоединение, Ложь);

	Ответ = Новый Структура();
	Ответ.Вставить("КодСостояния", 0);
	Ответ.Вставить("ТекстОтвета", "");
	Ответ.Вставить("Отказ", Ложь);
	Ответ.Вставить("ТекстОшибки", "");

	Если Не МетодHTTPДопустим(МетодHTTP) Тогда
		ШаблонОшибки = НСтр("ru = 'Указан недопустимый метод HTTP (%1)'");
		Ответ.Отказ = Истина;
		Ответ.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, МетодHTTP);
		Возврат Ответ;
	КонецЕсли;

	Если ОбменСВнешнимиСистемамиЛогированиеПовтИсп.ЛогированиеВключено() Тогда
		СтекВызоваСтр = ОбменСВнешнимиСистемамиЛогирование.СтекВызоваПолучить();
		
		HTTPСоединениеПредставление = ОбменСВнешнимиСистемамиЛогирование.ОбъектПредставление( Соединение );
		HTTPЗапросПредставление = ОбменСВнешнимиСистемамиЛогирование.ОбъектПредставление( Запрос, , Параметры );
		ЛогКомментарий = НСтр("ru = 'HTTP: Запрос: Метод:'") + " " + МетодHTTP + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков() 
		+ HTTPЗапросПредставление + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков()
		+ HTTPСоединениеПредставление + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков()
		+ НСтр("ru = 'Стек вызовов:'") + Символы.ПС + СтекВызоваСтр;
		ЛогПараметры = Новый Структура;
		ЛогПараметры.Вставить( "Сервер", Соединение.Сервер );
		ЛогПараметры.Вставить( "АдресРесурса", Запрос.АдресРесурса );
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, , , ЛогПараметры );
	КонецЕсли;	

	Попытка
		//@skip-check bsl-legacy-check-dynamic-feature-access
		РезультатЗапроса = Соединение.ВызватьHTTPМетод(ВРег(МетодHTTP), Запрос);

		Ответ.КодСостояния = РезультатЗапроса.КодСостояния;
		Ответ.ТекстОтвета = РезультатЗапроса.ПолучитьТелоКакСтроку("UTF8");
		
		Если ОбменСВнешнимиСистемамиЛогированиеПовтИсп.ЛогированиеВключено() Тогда
			СтекВызоваСтр = ОбменСВнешнимиСистемамиЛогирование.СтекВызоваПолучить();
			
			HTTPСоединениеПредставление = ОбменСВнешнимиСистемамиЛогирование.ОбъектПредставление( Соединение );
			HTTPОтветПредставление = ОбменСВнешнимиСистемамиЛогирование.ОбъектПредставление( РезультатЗапроса );
			ЛогКомментарий = НСтр("ru = 'HTTP: Ответ: Метод:'") + " " + МетодHTTP + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков() 
			+ HTTPОтветПредставление + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков()
			+ HTTPСоединениеПредставление + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков()
			+ НСтр("ru = 'Стек вызовов:'") + " " + Символы.ПС + СтекВызоваСтр;
			ЛогЭтоОшибка = (РезультатЗапроса.КодСостояния > 201);
			ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, , ЛогЭтоОшибка, ЛогПараметры );
		КонецЕсли;	
		
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'При отправке запроса на сервер %1 возникла ошибка: %2'"),
			ПараметрыПодключения.Сервер,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	
		Ответ.Отказ = Истина;
		Ответ.ТекстОшибки = ТекстОшибки;
	КонецПопытки;

	Возврат Ответ;

КонецФункции   

// Выполняет попытку приведения строки в формате JSON к указанному типу объекта XDTO.
// Параметры:
//  ТекстОбъекта - Строка - Строковое описание объекта в формате JSON.
//  ТипОбъекта   - ТипОбъектаXDTO - Тип объекта для приведения.
// 
// Возвращаемое значение:
//  Структура - Результат выполнения приведения.
//              Содержит ключи: Объект, Отказ, ТекстОшибки;
//
Функция ПривестиКТипуОбъекта(ТекстОбъекта, ТипОбъекта)

	РезультатПриведения = Новый Структура("Объект, Отказ, ТекстОшибки", Неопределено, Ложь, "");

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ТекстОбъекта);
		РезультатПриведения.Объект = ФабрикаXDTO.ПрочитатьJSON(ЧтениеJSON, ТипОбъекта);
	Исключение
		РезультатПриведения.Отказ = Истина;
		РезультатПриведения.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат РезультатПриведения

КонецФункции

// Возвращает путь к ресурсу (папке или файлу) относительно папки приложения.
// Параметры:
//  ПрисоединенныйФайл - СправочникСсылка.НоменклатураПрисоединенныеФайлы - Файл, по которому запрашивается информация от сервиса.
// 
// Возвращаемое значение:
//  Строка - Путь к ресурсу в кодировке URL.
//
Функция ПутьКРесурсу(ПрисоединенныйФайл)
	
	Значения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрисоединенныйФайл, "ДатаМодификацииУниверсальная,Расширение");
	
	Результат = "app:/" + ПрисоединенныйФайл.УникальныйИдентификатор()
	+ Формат(Значения.ДатаМодификацииУниверсальная, "ДФ=ггггММддччммсс") + "." + Значения.Расширение;
	
	Возврат Результат;

КонецФункции

Функция НоменклатураИзображенияПолучить( НоменклатураИлиХарактеристика, ИзображенияДляНоменклатурыИХарактеристики = Ложь, Параметры = Неопределено ) Экспорт

	Если ТипЗнч( НоменклатураИлиХарактеристика ) = Тип( "СправочникСсылка.Номенклатура" ) Тогда
		Номенклатура = НоменклатураИлиХарактеристика;
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	Иначе
	    Характеристика = НоменклатураИлиХарактеристика;
	    
	    Если ИзображенияДляНоменклатурыИХарактеристики = Истина Тогда
			//@skip-check bsl-legacy-check-string-literal
			НоменклатураИлиКатегория = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( Характеристика, "Владелец" );
			
			Если ТипЗнч( НоменклатураИлиКатегория ) = Тип( "СправочникСсылка.КатегорииНоменклатуры" ) Тогда
				Номенклатура = СтруктураСвойствоЗначениеПолучить( Параметры, "Номенклатура", Справочники.Номенклатура.ПустаяСсылка() );
			Иначе
				Номенклатура = НоменклатураИлиКатегория;
			КонецЕсли;
			
		Иначе
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;

	ВладелецФайлов = ?(ЗначениеЗаполнено(Характеристика), Характеристика, Номенклатура );
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Ссылка,
	|	НоменклатураПрисоединенныеФайлы.ВладелецФайла КАК Владелец,
	|	&ВладелецФайлов КАК ВладелецФайлов,
	|	НоменклатураПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	НоменклатураПрисоединенныеФайлы.ДатаМодификацииУниверсальная КАК ДатаМодификацииУниверсальная,
	|	НоменклатураПрисоединенныеФайлы.Расширение КАК Расширение
	|ПОМЕСТИТЬ ВТПрисоединенныеФайлы
	|ИЗ
	|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|ГДЕ
	|	НоменклатураПрисоединенныеФайлы.ВладелецФайла = &Номенклатура
	|	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
	|	И НоменклатураПрисоединенныеФайлы.Расширение В(&РасширенияИзображений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатурыПрисоединенныеФайлы.Ссылка,
	|	ХарактеристикиНоменклатурыПрисоединенныеФайлы.ВладелецФайла,
	|	&ВладелецФайлов,
	|	ХарактеристикиНоменклатурыПрисоединенныеФайлы.ДатаСоздания,
	|	ХарактеристикиНоменклатурыПрисоединенныеФайлы.ДатаМодификацииУниверсальная,
	|	ХарактеристикиНоменклатурыПрисоединенныеФайлы.Расширение
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатурыПрисоединенныеФайлы КАК ХарактеристикиНоменклатурыПрисоединенныеФайлы
	|ГДЕ
	|	ХарактеристикиНоменклатурыПрисоединенныеФайлы.ВладелецФайла = &Характеристика
	|	И НЕ ХарактеристикиНоменклатурыПрисоединенныеФайлы.ПометкаУдаления
	|	И ХарактеристикиНоменклатурыПрисоединенныеФайлы.Расширение В(&РасширенияИзображений)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПрисоединенныеФайлы.Ссылка КАК Ссылка,
	|	ВТПрисоединенныеФайлы.Владелец КАК Владелец,
	|	ЕСТЬNULL(СортировкаФайловДляСайта.Сортировка, 0) КАК Сортировка,
	|	ЕСТЬNULL(СортировкаФайловДляСайта.ВыгружатьНаСайт, ИСТИНА) КАК ВыгружатьНаСайт,
	|	&ВладелецФайлов КАК ВладелецФайлов,
	|	ВТПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	ВТПрисоединенныеФайлы.ДатаМодификацииУниверсальная КАК ДатаМодификацииУниверсальная,
	|	ВТПрисоединенныеФайлы.Расширение КАК Расширение,
	|	ВЫБОР
	|		КОГДА ВТПрисоединенныеФайлы.Расширение В (&РасширенияИзображений)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоИзображение
	|ПОМЕСТИТЬ ВТПрисоединенныеФайлыСортировка
	|ИЗ
	|	ВТПрисоединенныеФайлы КАК ВТПрисоединенныеФайлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СортировкаФайловДляСайта КАК СортировкаФайловДляСайта
	|		ПО (СортировкаФайловДляСайта.Файл = ВТПрисоединенныеФайлы.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Номенклатура КАК Номенклатура,
	|	&Характеристика КАК Характеристика,
	|	ВТПрисоединенныеФайлыСортировка.Ссылка КАК Файл,
	|	ВТПрисоединенныеФайлыСортировка.Сортировка КАК Сортировка,
	|	ВТПрисоединенныеФайлыСортировка.ВыгружатьНаСайт КАК ВыгружатьНаСайт,
	|	ВТПрисоединенныеФайлыСортировка.Владелец КАК Владелец,
	|	ВТПрисоединенныеФайлыСортировка.ВладелецФайлов КАК ВладелецФайлов,
	|	ВТПрисоединенныеФайлыСортировка.ДатаСоздания КАК ДатаСоздания,
	|	ВТПрисоединенныеФайлыСортировка.ДатаМодификацииУниверсальная КАК ДатаМодификацииУниверсальная,
	|	ВТПрисоединенныеФайлыСортировка.Расширение КАК Расширение,
	|	ВТПрисоединенныеФайлыСортировка.ЭтоИзображение КАК ЭтоИзображение
	|ИЗ
	|	ВТПрисоединенныеФайлыСортировка КАК ВТПрисоединенныеФайлыСортировка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка";
	
	
	РасширенияИзображений = ИнтеграцияСМаркетплейсомOzonСервер.РасширенияИзображений();
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("ВладелецФайлов", ВладелецФайлов);
	Запрос.УстановитьПараметр("РасширенияИзображений", РасширенияИзображений);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаФайлов = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаФайлов;
КонецФункции

// Помещает содержимое присоединенного файла во временное хранилище и возвращает адрес
//
// Параметры:
//  Ссылка  - СправочникСсылка.НоменклатураПрисоединенныеФайлы, 
//  		  СправочникСсылка.ХарактеристикиНоменклатурыПрисоединенныеФайлы - ссылка на справочник
//  Адрес - Строка - адрес во временном хранилище.
// 
// Возвращаемое значение:
//  Строка - адрес во временном хранилище
//
Функция ПрисоединенныйФайлВоВременноеХранилище( Ссылка, Адрес = Неопределено ) Экспорт
	ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла( Ссылка, Ложь );
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Адрес );
КонецФункции

Функция СоставИСортировкаФайловДляСайтаЗаписать( ТаблицаФайлов ) Экспорт

	НачатьТранзакцию();
	
	Попытка
		
		Сортировка = 1;
		Для Каждого ТаблицаФайловСтрока Из ТаблицаФайлов Цикл
			ТаблицаФайловСтрока.Сортировка = Сортировка;
			Сортировка = Сортировка + 1;
			
			МЗ = РегистрыСведений.СортировкаФайловДляСайта.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ , ТаблицаФайловСтрока);
			МЗ.Записать();
		КонецЦикла;
		
		Если ИспользуетсяИнтеграцияСМаркетплейсомOzon() Тогда
			ИнтеграцияСМаркетплейсомOzonСервер.СоставИСортировкаФайловДляСайтаЗаписать( ТаблицаФайлов );
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ПредставлениеОшибки);
		
		ЛогКомментарий = НСтр("ru = 'СоставИСортировкаФайловДляСайтаЗаписать: Ошибка:'") + " " + ПредставлениеОшибки;
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, , Истина );
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

// Проверяет является ли указанное значение файлом картинки.
// 
// Параметры:
//   ПроверяемоеЗначение - ДвоичныеДанные, Строка - данные картинки или адрес во временном хранилище.
// 
// Возвращаемое значение:
//   Булево - это файл картинки.
//
Функция ЭтоФайлКартинки(ПроверяемоеЗначение) Экспорт
	
	ЭтоФайлКартинки = Истина;
	ДвоичныеДанныеИзображения = ПроверяемоеЗначение;
	
	Если ЭтоАдресВременногоХранилища(ПроверяемоеЗначение) Тогда
		ДвоичныеДанныеИзображения = ПолучитьИзВременногоХранилища(ПроверяемоеЗначение);
	КонецЕсли;
	
	МеханизмКартинка = Новый Картинка(ДвоичныеДанныеИзображения);
	Если МеханизмКартинка.Формат() = Неопределено 
		 ИЛИ МеханизмКартинка.Формат() = ФорматКартинки.НеизвестныйФормат Тогда
		ЭтоФайлКартинки = Ложь;
	КонецЕсли;
	
	Возврат ЭтоФайлКартинки;
	
КонецФункции


// Получение двоичных данных по адресу URL, например изображения.
//
// Параметры:
//   ВнешнийАдрес - Строка - адрес URL картинки.
// 
// Возвращаемое значение:
//   Структура - см. ПолучениеФайловИзИнтернета.СкачатьФайлВоВременноеХранилище
//
Функция ДанныеФайлаПоВнешнейСсылке(Знач ВнешнийАдрес) Экспорт
	
	Ответ = ПолучениеФайловИзИнтернета.СкачатьФайлВоВременноеХранилище(ВнешнийАдрес, Неопределено, Истина);
	//@skip-check constructor-function-return-section
	Возврат Ответ;
	
КонецФункции

// Подготавливает состав результата записи загружаемых данных.
// 
// Возвращаемое значение:
//   Структура - результат записи:
//     * ОписаниеОшибки  - Строка - Описание ошибки.
//     * СсылкаНаОбъект  - Неопределено, ЛюбаяСсылка - ссылка на созданный при загрузке объект.
//     * Ссылки          - Массив из ЛюбаяСсылка - все записанные ссылки для заполнения параметра отбора динамического
//                           списка формы Справочники.УчетныеЗаписиМаркетплейсов.Формы.ВыгрузкаЗагрузкаДанных.
//     * СостоянияСсылок - Соответствие из КлючИЗначение - описание ошибки.
//     * Служебное       - Произвольный, Неопределено - любые дополнительные данные.
//
Функция НовыйРезультатЗаписиЗагружаемыхДанных() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОписаниеОшибки",  "");
	Результат.Вставить("СсылкаНаОбъект",  Неопределено);
	Результат.Вставить("Ссылки",          Новый Массив);
	Результат.Вставить("СостоянияСсылок", Новый Соответствие);
	Результат.Вставить("Служебное",       Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Создает документы заказов клиента.
//
// Параметры:
//   Результат - Структура - 
//   ТаблицаЗаказов     - ТаблицаЗначений - подготовленная таблица данных для загрузки.
//   Параметры          - Структура - параметры заполнения документов:
//     * ВидТорговойПлощадки          - ПеречислениеСсылка.ВидыМаркетплейсов - вид торговой площадки;
//     * УчетнаяЗапись                - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись торговой площадки;
//     * ВалютаУчета                  - СправочникСсылка.Валюты, Неопределено - валюта учета учетной записи;
//     * Организация                  - СправочникСсылка.Организации - организация в шапке;
//     * Контрагент                   - СправочникСсылка.Контрагенты - контрагент в шапке;
//     * Договор                      - СправочникСсылка.ДоговорыКонтрагентов - договор в шапке;
//     * КодОшибки                    - Строка - код ошибки для результат выполнения;
//     * СобытиеЖурналаРегистрации    - Строка - наименование события для записей в журнале регистрации;
//     * ЗагружатьНезаполненныеСтроки - Булево - добавлять ли строки с несопоставленными показателями;
//     * ПерезаписатьДокументы        - Булево - перезаписывать ли существующие документы;
//     * ОчиститьТабличныеЧасти       - Булево - очищать табличные части документов перед обработкой;
//     * ОбработатьВариантОбеспечения - Булево - заполнять вариант обеспечения с возможным переносом строк;
//     * ПараметрыОбработки           - Структура Из КлючИЗначение, Неопределено - параметры обработки табличных частей документов;
//     * ТекстЗапроса                 - Строка - текст запроса для обработки заказов;
//     * ЗаписатьНеобработанныеЗаказы - Булево - записать необработанные заказы торговой площадки в специализированный регистр сведений.
//   ПараметрыПрогресса - Структура - 
//
// Возвращаемое значение:
//   См. НоваяОшибка.
//
Функция ЗаказыКлиентовЗаписать(Результат, ТаблицаЗаказов, Параметры, ПараметрыПрогресса = Неопределено) Экспорт
	
	Ошибка = НоваяОшибка();

	Если Не ЗначениеЗаполнено(Параметры.УчетнаяЗапись) Тогда
	
		ТекстОшибки = НСтр("ru = 'Не указана учетная запись торговой площадки.'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
		
		Ошибка.КодОшибки = Параметры.КодОшибки;
		Ошибка.ОписаниеОшибки = ТекстОшибки;
		
		Возврат Ошибка;
	КонецЕсли;

	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( Параметры.УчетнаяЗапись, "ВидМаркетплейса" );
	
	ДоступныеСостоянияДокументов = ДоступныеСостоянияДокументов();
	СозданныеДокументы = Новый Соответствие; 
	НастройкиСкладов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	*
	|ИЗ
	|	РегистрСведений.ЗаказыТорговыхПлощадок КАК ЗаказыТорговыхПлощадок";
		
	ЗаказыТорговыхПлощадок = Запрос.Выполнить().Выгрузить();
	ЗаказыТорговыхПлощадок.Колонки.Добавить("ДополнительныеСведения");
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("Организация", Параметры.Организация);
	ДанныеЗаполнения.Вставить("Валюта", Параметры.ВалютаУчета );
	ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", Параметры.ХозяйственнаяОперация);
	ДанныеЗаполнения.Вставить("Контрагент", Параметры.Контрагент);
	ДанныеЗаполнения.Вставить("Договор", Параметры.Договор);
	ДанныеЗаполнения.Вставить("ВидЗаказа", Параметры.ВидЗаказа);
	
	ЗаказыСостоянияСопоставление = ЗаказыСостоянияСопоставлениеПолучить( Параметры.УчетнаяЗапись );
	
	Если Параметры.ПараметрыОбработки = Неопределено Тогда
		Параметры.ПараметрыОбработки = Новый Структура;
		Параметры.ПараметрыОбработки.Вставить("СтруктураДействий", Неопределено);
		Параметры.ПараметрыОбработки.Вставить("ПересчитатьКоличествоЕдиниц", Ложь);
		Параметры.ПараметрыОбработки.Вставить("ЗаполнитьВариантОбеспечения", Ложь);
		Параметры.ПараметрыОбработки.Вставить("ЗаполнитьЦены", Ложь);
		Параметры.ПараметрыОбработки.Вставить("ОчиститьАвтоматическуюСкидку", Истина);
		Параметры.ПараметрыОбработки.Вставить("ПересчитатьЦенаВключаетНДС", Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Параметры.ТекстЗапроса;
	
	ТаблицаСкладов = ИнтеграцияСМаркетплейсомOzonСервер.ПолучитьСопоставленныеСклады(Параметры.УчетнаяЗапись, Ложь, Истина);
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", Параметры.УчетнаяЗапись);
	Запрос.УстановитьПараметр("ТаблицаЗаказов", ТаблицаЗаказов);
	Запрос.УстановитьПараметр("ТаблицаСкладов", ТаблицаСкладов);
	Запрос.УстановитьПараметр("ИспользоватьУпаковкиНоменклатуры", Ложь );
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицаОстатков = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("Номенклатура, Характеристика, Склад");
	
	ВыборкаНомерДокумента = РезультатЗапроса[РезультатЗапроса.ВГраница() - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВсегоСтрок = ВыборкаНомерДокумента.Количество();
	НомерТекущейСтроки = 1;
	ПроцентВыполнения = 0;
	
	Если ВсегоСтрок = 0 Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Данные для загрузки заказов с торговой площадки <%1> отсутствуют.'",
				ОбщегоНазначения.КодОсновногоЯзыка()), Параметры.УчетнаяЗапись );
		
		Ошибка.КодОшибки = Параметры.КодОшибки;
		Ошибка.ОписаниеОшибки = ТекстОшибки;
		
		Возврат Ошибка;
	КонецЕсли;
	
	Пока ВыборкаНомерДокумента.Следующий() Цикл
	
		Если ПараметрыПрогресса <> Неопределено Тогда
			УстановитьПроцентПрогресса(	ВсегоСтрок,	НомерТекущейСтроки,	ПроцентВыполнения,	ПараметрыПрогресса);
		КонецЕсли;
		
		ЗаказКлиентаОбъект = Неопределено;
		ЗаказКлиентаСсылка = Неопределено;
		ЗаказКлиентаСостояние = ДоступныеСостоянияДокументов.СостояниеНеОбновлен;
		НовыйЗаказ = Неопределено;
		
		ВыборкаДанных = ВыборкаНомерДокумента.Выбрать();
		Пока ВыборкаДанных.Следующий() Цикл
			
			ТаблицаЗаказовСтрока = ТаблицаЗаказов.Найти( ВыборкаДанных.НомерОтправления, "НомерОтправления" );	
			
			Если ЗаказКлиентаОбъект = Неопределено Тогда
				
				ЗаказКлиентаСсылка = ВыборкаДанных.ЗаказКлиентаСсылка;
				
				Если Не ЗначениеЗаполнено(ЗаказКлиентаСсылка) Тогда
					ЗаказКлиентаСсылка = СозданныеДокументы.Получить(ВыборкаНомерДокумента.НомерДокумента);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЗаказКлиентаСсылка) Тогда

					// Существующий документ
					Если Не Параметры.ПерезаписатьДокументы Тогда
						Прервать;
					КонецЕсли;
					
					ЗаказКлиентаОбъект = ЗаказКлиентаСсылка.ПолучитьОбъект();
					ЗаказКлиентаСостояние = ДоступныеСостоянияДокументов.СостояниеНеОбновлен;
					
					ТекстОшибки = ЗаблокироватьДокумент(ЗаказКлиентаОбъект, Параметры.СобытиеЖурналаРегистрации);
					
					Если Не ПустаяСтрока(ТекстОшибки) Тогда
						Ошибка.КодОшибки = Параметры.КодОшибки;
						Ошибка.Детализация.Добавить(ТекстОшибки);
						
						ЗаказКлиентаОбъект = Неопределено;
						
						Прервать;
					КонецЕсли;
					
				Иначе
					// Новый документ
					ЗаказКлиентаОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
					ЗаказКлиентаСостояние = ДоступныеСостоянияДокументов.СостояниеНовый;
				КонецЕсли;
				
				НовыйЗаказ = ЗаказыТорговыхПлощадок.Добавить();
				
				НовыйЗаказ.УчетнаяЗапись = Параметры.УчетнаяЗапись;
				НовыйЗаказ.Заказ = Неопределено;
				
				ЗаказСтатусНаСайте = Перечисления.СтатусыЗаказовТорговыхПлощадок.ПолучитьПоПредставлению(
 				ВыборкаДанных.СтатусОтправления, ВыборкаДанных.ПодстатусОтправления);
 				
 				ПричинаОтмены = ЗаказыПричинаОтменыСсылкаПолучитьСоздать( ВидМаркетплейса,	Параметры.УчетнаяЗапись, 
 				ВыборкаДанных.ИдентификаторПричиныОтмены, ТаблицаЗаказовСтрока.ПричинаОтмены );
 				
				НовыйЗаказ.Статус = ЗаказСтатусНаСайте;
				
				НовыйЗаказ.ДатаПлановойОтгрузки = ВыборкаДанных.ДатаСборки;
				НовыйЗаказ.ИдентификаторЗаказа = ВыборкаДанных.ИдентификаторЗаказа;
				НовыйЗаказ.НомерЗаказа = ВыборкаДанных.НомерЗаказа;
				НовыйЗаказ.НомерОтправления = ВыборкаДанных.НомерОтправления;
				НовыйЗаказ.ИдентификаторСкладаТорговойПлощадки = ВыборкаДанных.ИдентификаторСклада;
				НовыйЗаказ.ДатаУстановкиСтатуса = ТекущаяДатаСеанса();
				НовыйЗаказ.ДатаСозданияЗаказа = ВыборкаДанных.ДатаОтправления;
				НовыйЗаказ.НомерРодительскогоОтправления = ВыборкаДанных.НомерРодительскогоОтправления;
				НовыйЗаказ.НаименованиеСкладаТорговойПлощадки = ВыборкаДанных.НаименованиеСклада;
				
				НовыйЗаказ.ТребуетсяЗаполнениеСведенийПоТоварам = ВыборкаНомерДокумента.ТребуетсяГТД
				Или ВыборкаНомерДокумента.ТребуетсяРНПТ
				Или ВыборкаНомерДокумента.ТребуетсяСтранаПроисхождения
				Или ВыборкаНомерДокумента.ТребуетсяМаркировка
				Или ВыборкаНомерДокумента.ТребуетсяУИНЮвелирногоИзделия;
				
				НовыйЗаказ.ДополнительныеСведения = Новый Массив;
				
				АдресДоставки = Новый Массив;
				АдресДоставки.Добавить(ВыборкаДанных.РегионДоставки);
				АдресДоставки.Добавить(ВыборкаДанных.ГородДоставки);
				АдресДоставки.Добавить(ВыборкаДанных.АдресДоставки);
				
				ДанныеЗаполнения.Вставить( "НомерПоДаннымКлиента", ВыборкаДанных.НомерДокумента );
				ДанныеЗаполнения.Вставить( "ДатаПоДаннымКлиента", ВыборкаДанных.ДатаОтправления );
				ДанныеЗаполнения.Вставить( "Склад", ВыборкаДанных.Склад );
				ДанныеЗаполнения.Вставить( "АдресДоставки", СтрСоединить(АдресДоставки, ", ") );
				ДанныеЗаполнения.Вставить( "ПричинаОтмены", ПричинаОтмены );
				
				// добавим в Комментарий номер и дату Ozon сверху	
				НомерДатаЗаказаСтрокойШаблон = НСтр( "ru = 'Загружен из Ozon: №%1 от %2'" );
				НомерДатаЗаказаСтрокой = СтрШаблон( НомерДатаЗаказаСтрокойШаблон,
				ДанныеЗаполнения.НомерПоДаннымКлиента, ДанныеЗаполнения.ДатаПоДаннымКлиента);
				Если СтрНайти( ЗаказКлиентаОбъект.Комментарий, НомерДатаЗаказаСтрокой ) = 0 Тогда
					КомментарийЗаказаСтроки = Новый Массив;
					КомментарийЗаказаСтроки.Добавить( НомерДатаЗаказаСтрокой );
					Если Не ПустаяСтрока( ЗаказКлиентаОбъект.Комментарий ) > 0 Тогда
						КомментарийЗаказаСтроки.Добавить( ЗаказКлиентаОбъект.Комментарий );
					КонецЕсли;
					КомментарийЗаказа = СтрСоединить( КомментарийЗаказаСтроки, Символы.ПС );
				Иначе
					КомментарийЗаказа = ЗаказКлиентаОбъект.Комментарий;
				КонецЕсли;
				ДанныеЗаполнения.Вставить( "Комментарий", КомментарийЗаказа );
				
				ЗаказСостояние1СЭлемент = ЗаказыСостоянияСопоставление.Получить( ЗаказСтатусНаСайте );
				Если ЗаказСостояние1СЭлемент = Неопределено Тогда
					ЗаказСостояние1С = Параметры.ЗаказСостояниеПоУмолчанию;
					РезервироватьТовар = Истина;
				Иначе
					ЗаказСостояние1С = ЗаказСостояние1СЭлемент.Состояние1С; 
					РезервироватьТовар = ЗаказСостояние1СЭлемент.РезервироватьТовар;
				КонецЕсли;
				
				ДанныеЗаполнения.Вставить( "СостояниеЗаказа", ЗаказСостояние1С );
				ДанныеЗаполнения.Вставить( "СостояниеЗаказаНаСайте", ЗаказСтатусНаСайте );
				
				НастройкиСклада = НастройкиСкладов.Получить(ВыборкаДанных.ИдентификаторСклада);
				Если НастройкиСклада = Неопределено Тогда
					//@skip-check query-in-loop
					НастройкиСклада = НастройкиСклада(Параметры.УчетнаяЗапись, ВыборкаДанных.ИдентификаторСклада);
					НастройкиСкладов.Вставить(ВыборкаДанных.ИдентификаторСклада, НастройкиСклада);
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеЗаполнения, НастройкиСклада, Истина);
				
				Если ЗаказКлиентаЗаполнить(ЗаказКлиентаОбъект, ДанныеЗаполнения, Параметры.СобытиеЖурналаРегистрации, Параметры.Договор) Тогда
						
					Если ЗаказКлиентаСостояние <> ДоступныеСостоянияДокументов.СостояниеНовый Тогда
						ЗаказКлиентаСостояние = ДоступныеСостоянияДокументов.СостояниеОбновлен;
					КонецЕсли;
					
				Иначе
					ЗаполнитьЗначенияСвойств(ЗаказКлиентаОбъект, ДанныеЗаполнения);
					ЗаказКлиентаСостояние = ДоступныеСостоянияДокументов.СостояниеОшибкиЗаполнения;
				КонецЕсли;
				
				Если Параметры.ОчиститьТабличныеЧасти Тогда
					ЗаказКлиентаОбъект.Запасы.Очистить();
				КонецЕсли;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ВыборкаДанных.Номенклатура) Тогда
				НоменклатураНеНайденаЭлемент = Новый Структура( "ИдентификаторПубликации, ПредставлениеОбъектаМаркетплейса", 
				ВыборкаДанных.ИдентификаторПубликации, ВыборкаДанных.ПредставлениеОбъектаМаркетплейса );
				
				Ошибка.НоменклатураНеНайдена.Добавить( НоменклатураНеНайденаЭлемент );
			КонецЕсли;
			
			Если Не Параметры.ЗагружатьНезаполненныеСтроки
					И Не ЗначениеЗаполнено(ВыборкаДанных.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			// Заполнение строки табличной части
			СтрокаТабличнойЧасти = ЗаказКлиентаОбъект.Запасы.Добавить();
			
			СтрокаТабличнойЧасти.Номенклатура = ВыборкаДанных.Номенклатура;
			СтрокаТабличнойЧасти.Содержание = "" + ВыборкаДанных.ПредставлениеОбъектаМаркетплейса + " ( " + ВыборкаДанных.ИдентификаторSKU + " )";
			СтрокаТабличнойЧасти.Характеристика = ВыборкаДанных.Характеристика;
			СтрокаТабличнойЧасти.ТипНоменклатурыЗапас = Истина;
			
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = ВыборкаДанных.ЕдиницаИзмерения;
			
			СтрокаТабличнойЧасти.Количество = ВыборкаДанных.Количество;
			
			Если РезервироватьТовар = Истина Тогда
				СтрокаТабличнойЧасти.Резерв = ВыборкаДанных.Количество;
			Иначе
				СтрокаТабличнойЧасти.Резерв = 0;
			КонецЕсли;
			
			СтрокаТабличнойЧасти.Цена = ВыборкаДанных.Цена;
			СтрокаТабличнойЧасти.Сумма = ВыборкаДанных.Сумма;
			СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв = ВыборкаДанных.Склад;
			СтрокаТабличнойЧасти.КлючСвязи = СтрокаТабличнойЧасти.НомерСтроки;
			СтрокаТабличнойЧасти.ИдентификаторСтроки = "";
			СтрокаТабличнойЧасти.ДатаОтгрузки = ЗаказКлиентаОбъект.ДатаОтгрузки;
			
			СтрокаТабличнойЧасти.СуммаСкидкиНаценки = ВыборкаДанных.СуммаСкидки;
			
		КонецЦикла;
		
		Если ЗаказКлиентаОбъект <> Неопределено Тогда
			Если ЗаказКлиентаОбъект.Запасы.Количество() > 0 Тогда
				
				Если Не ЗаказКлиентаДозаполнитьТЧ(ЗаказКлиентаОбъект, Параметры.ПараметрыОбработки ) Тогда
					ЗаказКлиентаСостояние = ДоступныеСостоянияДокументов.СостояниеОшибкиЗаполнения;
				КонецЕсли;
				
				// Запись и проведение документа
				РезультатЗаписиДокумента = ЗаписатьПровестиДокумент(ЗаказКлиентаОбъект, 
					Истина, Параметры.СобытиеЖурналаРегистрации);
					
				ЗаказКлиентаСостояние = ?( РезультатЗаписиДокумента.ЗаписьВыполнена, 
				ЗаказКлиентаСостояние, ДоступныеСостоянияДокументов.СостояниеНеОбновлен );
					
				Если ЗаказКлиентаСостояние <> ДоступныеСостоянияДокументов.СостояниеНовый Тогда
					ЗаказКлиентаОбъект.Разблокировать();
				КонецЕсли;
				
				Если Не ПустаяСтрока(РезультатЗаписиДокумента.ОписаниеОшибки) Тогда
					Ошибка.Детализация.Добавить(РезультатЗаписиДокумента.ОписаниеОшибки);
				КонецЕсли;
			
			ИначеЕсли Не ЗаказКлиентаОбъект.ЭтоНовый() И Параметры.ПерезаписатьДокументы Тогда
				// Запись и пометка на удаление документа
				ЗаказКлиентаОбъект.ПометкаУдаления = Истина;
				
				РезультатЗаписиДокумента = ЗаписатьПровестиДокумент(ЗаказКлиентаОбъект, 
					Ложь, Параметры.СобытиеЖурналаРегистрации);
					
				ЗаказКлиентаСостояние = ?(РезультатЗаписиДокумента.ЗаписьВыполнена, 
					ЗаказКлиентаСостояние, 
					ДоступныеСостоянияДокументов.СостояниеНеОбновлен);
					
				ЗаказКлиентаОбъект.Разблокировать();
				
				Если Не ПустаяСтрока(РезультатЗаписиДокумента.ОписаниеОшибки) Тогда
					Ошибка.Детализация.Добавить(РезультатЗаписиДокумента.ОписаниеОшибки);
				КонецЕсли;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ЗаказКлиентаСсылка) Тогда
				ЗаказКлиентаСсылка = ЗаказКлиентаОбъект.Ссылка;
			КонецЕсли;
			
			СозданныеДокументы.Вставить(ВыборкаНомерДокумента.НомерДокумента, ЗаказКлиентаСсылка);
			НовыйЗаказ.Заказ = ЗаказКлиентаСсылка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаказКлиентаСсылка) 
				И Результат.Ссылки.Найти(ЗаказКлиентаСсылка) = Неопределено Тогда
			Результат.Ссылки.Добавить(ЗаказКлиентаСсылка);
			Результат.СостоянияСсылок.Вставить(ЗаказКлиентаСсылка, ЗаказКлиентаСостояние);
		КонецЕсли;
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
	КонецЦикла;
	
	// Новые необработанные заказы торговой площадки
	Если Параметры.ЗаписатьНеобработанныеЗаказы
			И ЗаказыТорговыхПлощадок.Количество() > 0 Тогда
		
		НачатьТранзакцию();
		
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок");
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Разделяемый;
			ЭлементБлокировкиДанных.ИсточникДанных = ЗаказыТорговыхПлощадок;
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Заказ", "Заказ");
			БлокировкаДанных.Заблокировать();
			
			Для Каждого СтрокаТаблицыЗначений Из ЗаказыТорговыхПлощадок Цикл
				Если ЗначениеЗаполнено(СтрокаТаблицыЗначений.Заказ) Тогда
					
					Запись = РегистрыСведений.ЗаказыТорговыхПлощадок.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицыЗначений);
					Запись.ТребуетсяПолучениеЭтикеток = (Запись.Статус = Перечисления.СтатусыЗаказовТорговыхПлощадок.ГотовКОтгрузке);
					Запись.Записать(Параметры.ПерезаписатьДокументы);
					
					НаборЗаписей = РегистрыСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Заказ.Установить(СтрокаТаблицыЗначений.Заказ);
					НаборЗаписей.Прочитать();
					НаборЗаписей.Очистить();
					Для Каждого ЭлементКоллекции Из СтрокаТаблицыЗначений.ДополнительныеСведения Цикл
						Запись = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(Запись, ЭлементКоллекции);
						Запись.Заказ = СтрокаТаблицыЗначений.Заказ;
					КонецЦикла;
					НаборЗаписей.Записать(Истина);
					
				КонецЕсли;
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			Ошибка.КодОшибки = Параметры.КодОшибки;
			
			ОписаниеОшибкиШаблон = НСтр("ru = 'При записи заказов с торговой площадки <%1> возникли ошибки: %2'",
			ОбщегоНазначения.КодОсновногоЯзыка());
			
			Ошибка.ОписаниеОшибки = СтрШаблон( ОписаниеОшибкиШаблон, Параметры.УчетнаяЗапись, ТекстОшибки );
			
			Ошибка.Детализация.Добавить(ТекстОшибки);
				
			ЗаписьЖурналаРегистрации( Параметры.СобытиеЖурналаРегистрации,
			УровеньЖурналаРегистрации.Ошибка,,,	ТекстОшибки );
				
			ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( Ошибка.ОписаниеОшибки, Параметры.УчетнаяЗапись, Истина );
				
		КонецПопытки;
	КонецЕсли;
	
	Возврат Ошибка;
	
КонецФункции

Функция ЗаказыПричинаОтменыСсылкаПолучитьСоздать( ВидМаркетплейса, УчетнаяЗапись, ПричинаОтменыИдентификатор, ПричинаОтменыНаименование ) Экспорт
	
	Результат = Неопределено;
	
	Если ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon") Тогда
		
		Результат = ИнтеграцияСМаркетплейсомOzonСервер.ЗаказыПричинаОтменыСсылкаПолучитьСоздать( УчетнаяЗапись, 
		ПричинаОтменыИдентификатор, ПричинаОтменыНаименование );
		
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

// Заполняет заказ клиента данными из другого объекта.
//
// Параметры:
//   ЗаказКлиентаОбъект          - ДокументОбъект.ЗаказПокупателя - заказ клиента к заполнению.
//   ДанныеЗаполнения            - Структура Из КлючИЗначение - данные заполнения. 
//   ИмяСобытия                  - Строка - имя события журнала регистрации.
//   Договор					 - СправочникСсылка.ДоговорыКонтрагентов - Договор из настроек интеграции 
//
// Возвращаемое значение:
//   Булево - результат заполнения документа.
//
Функция ЗаказКлиентаЗаполнить( ЗаказКлиентаОбъект, ДанныеЗаполнения, ИмяСобытия, Договор )
	
	Попытка
	
		ЗаполнитьЗначенияСвойств(ЗаказКлиентаОбъект, ДанныеЗаполнения);
		ЗаказКлиентаОбъект.Заполнить(ДанныеЗаполнения);
		
	Исключение
		ЗаписьЖурналаРегистрации(ИмяСобытия, 
			УровеньЖурналаРегистрации.Ошибка,
			ЗаказКлиентаОбъект.Метаданные(),
			ЗаказКлиентаОбъект.Ссылка,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Возврат Ложь;
	КонецПопытки;
	
	ЗаказКлиентаОбъект.ПометкаУдаления = Ложь;
	ЗаказКлиентаОбъект.Дата = ДанныеЗаполнения.Дата;
	ЗаказКлиентаОбъект.Организация = ДанныеЗаполнения.Организация;
	ЗаказКлиентаОбъект.ХозяйственнаяОперация = ДанныеЗаполнения.ХозяйственнаяОперация;

	ЗаказКлиентаОбъект.СтруктурнаяЕдиницаПродажи = ДанныеЗаполнения.Склад;
	ЗаказКлиентаОбъект.СтруктурнаяЕдиницаРезерв = ДанныеЗаполнения.Склад;
	
	Если Не ЗначениеЗаполнено(ЗаказКлиентаОбъект.Контрагент) Тогда
		ЗаказКлиентаОбъект.Контрагент = ДанныеЗаполнения.Контрагент;
	КонецЕсли;

	// Проверка на отличие производится т.к. в обработчике заполнения заказа клиента договор может заполниться другим 
	// основным договором, если их несколько
	Если Не ЗначениеЗаполнено(ЗаказКлиентаОбъект.Договор) Или ЗаказКлиентаОбъект.Договор <> Договор Тогда
		ЗаказКлиентаОбъект.Договор = Договор;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказКлиентаОбъект.Договор)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиентаОбъект.Договор, "Организация") <> ЗаказКлиентаОбъект.Организация Тогда
		ЗаказКлиентаОбъект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ЗаказКлиентаОбъект.ДатаОтгрузки = ТекущаяДатаСеанса();
	
	Если ЗаказКлиентаОбъект.ЭтоНовый() Тогда
		ЗаказКлиентаОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	Если ДанныеЗаполнения.СостояниеЗаказаНаСайте = Перечисления.СтатусыЗаказовТорговыхПлощадок.Отменен Тогда
		ЗаказКлиентаОбъект.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен;
		ЗаказКлиентаОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Отменен;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Выполняет постобработку табличной части "Товары" для заказа клиента.
//
// Параметры:
//   ЗаказКлиентаОбъект             - ДокументОбъект.ЗаказПокупателя - заказ клиента к заполнению.
//   Параметры                      - Структура - параметры обработки табличной части: 
//     * СтруктураДействий            - Структура Из КлючИЗначение - структура с действиями, которые нужно произвести;
//                                    - Неопределено - использовать структуру действий по умолчанию.
//     * ПересчитатьКоличествоЕдиниц  - Булево - необходимо ли выполнять пересчет количества.
//     * ЗаполнитьЦены                - Булево - заполнять ли цены товаров.
//     * ЗаполнитьВариантОбеспечения  - Булево - заполнять ли варианты обеспечения.
//     * ОчиститьАвтоматическуюСкидку - Булево - очистить признак автоматических скидок.
//     * ПересчитатьЦенаВключаетНДС   - Булево - требуется ли обратный пересчет цен и сумм с (без) НДС.
//   ИмяСобытия                     - Строка - имя события журнала регистрации. 
//
// Возвращаемое значение:
//   Булево - результат обработки табличной части.
//
Функция ЗаказКлиентаДозаполнитьТЧ( ЗаказКлиентаОбъект, Параметры )
	
	Если ЗаказКлиентаОбъект.Запасы.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// ставка НДС
	НастройкиЗаполненияНДС = НалогиУНФ.НастройкиНДСОрганизации( ЗаказКлиентаОбъект.Организация, , ЗаказКлиентаОбъект.Дата );
    НоменклатураВДокументахСервер.ОбновитьСтавкуНДСТабличнойЧасти( ЗаказКлиентаОбъект, "Запасы", Истина, НастройкиЗаполненияНДС.ВидСтавкиНДС );
	
	Возврат Истина;
	
КонецФункции

// Выполняет запись и (или) проведение документа.
//
// Параметры:
//   ДокументОбъект    - ДокументОбъект - документ к записи и (или) проведению.
//   Провести          - Булево - признак проведения документа. 
//   ИмяСобытия        - Строка - имя события журнала регистрации.
//   ЗаписатьПриОшибке - Булево - признак записи при неудачной попытке проведения документа. 
//
// Возвращаемое значение:
//   См. НовыйРезультатЗаписиДокументов.
//
Функция ЗаписатьПровестиДокумент(ДокументОбъект, Провести, ИмяСобытия, ЗаписатьПриОшибке = Истина) Экспорт
	
	Результат = НовыйРезультатЗаписиДокументов();
	
	ОписаниеОшибкиЗаписи    = "";
	ПодробноеОписаниеОшибки = "";
	
	Если Провести И ДокументОбъект.ПроверитьЗаполнение() Тогда
		// Проведение документа
		Попытка
			
			УстановитьПривилегированныйРежим(Истина);
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			УстановитьПривилегированныйРежим(Ложь);
			
			Результат.ЗаписьВыполнена = Истина;
			
		Исключение
			ОписаниеОшибкиЗаписи = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ПодробноеОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;
	
	Если Не Результат.ЗаписьВыполнена И ЗаписатьПриОшибке Тогда
		// Запись при неудачной попытке проведения
		Попытка
		
			Если Не ДокументОбъект.ЭтоНовый() И ДокументОбъект.Проведен Тогда
				РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
			Иначе
				РежимЗаписи = РежимЗаписиДокумента.Запись;
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Истина);
			ДокументОбъект.Записать(РежимЗаписи);
			УстановитьПривилегированныйРежим(Ложь);
			
			Результат.ЗаписьВыполнена = Истина;
			
		Исключение
			ОписаниеОшибкиЗаписи = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ПодробноеОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ОписаниеОшибкиЗаписи) Тогда
		Результат.ОписаниеОшибки = ОписаниеОшибкиЗаписи;
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, 
			УровеньЖурналаРегистрации.Ошибка,
			ДокументОбъект.Метаданные(),
			ДокументОбъект.Ссылка,
			ПодробноеОписаниеОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Конструктор результата записи и (или) проведения документа.
//
// Возвращаемое значение:
//   Структура - результат записи и (или) проведения документа:
//     * ЗаписьВыполнена - Булево - результат записи;
//     * ОписаниеОшибки  - Строка - описание ошибки при выполнении процедуры записи.
//
Функция НовыйРезультатЗаписиДокументов()
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаписьВыполнена", Ложь);
	Результат.Вставить("ОписаниеОшибки",  "");
	
	Возврат Результат;
	
КонецФункции

// Выполняет блокировку документа от изменения другими режимами или пользователями.
//
// Параметры:
//   ДокументОбъект - ДокументОбъект - документ к блокировке.
//   ИмяСобытия     - Строка - имя события журнала регистрации. 
//
// Возвращаемое значение:
//   Строка - описание ошибки при выполнении блокировки документа.
//
Функция ЗаблокироватьДокумент(ДокументОбъект, ИмяСобытия) Экспорт
	
	ОписаниеОшибки = "";
	
	Попытка
		ДокументОбъект.Заблокировать();
		
	Исключение
		ШаблонОшибки = НСтр("ru = 'Не удалось заблокировать ""%1"" по причине: %2. Подробнее см. в журнале регистрации.'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонОшибки,
			ДокументОбъект.Ссылка,
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, 
			УровеньЖурналаРегистрации.Ошибка,
			ДокументОбъект.Метаданные().ПредставлениеОбъекта,
			ДокументОбъект.Ссылка,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат ОписаниеОшибки;
	
КонецФункции

// Возвращает сохраненные настройки склада торговой площадки.
//
// Параметры:
//   УчетнаяЗапись       - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись.
//   ИдентификаторСклада - Строка - идентификатор склада торговой площадки.
//
// Возвращаемое значение:
//   Структура из КлючИЗначение - список реквизитов с их значениями.
//
Функция НастройкиСклада(УчетнаяЗапись, ИдентификаторСклада) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоответствияОбъектовМаркетплейсов.ИдентификаторОбъектаМаркетплейса КАК ИмяРеквизита,
		|	СоответствияОбъектовМаркетплейсов.Объект1С КАК Значение,
		|	СоответствияОбъектовМаркетплейсов.ДополнительныеСведения КАК ЗначениеСтрока
		|ИЗ
		|	РегистрСведений.СоответствияОбъектовМаркетплейсов КАК СоответствияОбъектовМаркетплейсов
		|ГДЕ
		|	СоответствияОбъектовМаркетплейсов.УчетнаяЗаписьМаркетплейса = &УчетнаяЗапись
		|	И СоответствияОбъектовМаркетплейсов.ВидОбъектаМаркетплейса = Значение(Перечисление.ВидыОбъектовМаркетплейсов.Склад)
		|	И СоответствияОбъектовМаркетплейсов.ИдентификаторОбъектаМаркетплейса В(&ИменаРеквизитов)
		|	И СоответствияОбъектовМаркетплейсов.ИдентификаторВладельцаОбъектаМаркетплейса = &ИдентификаторСклада";

	Запрос.УстановитьПараметр("УчетнаяЗапись",       УчетнаяЗапись);
	Запрос.УстановитьПараметр("ИдентификаторСклада", ИдентификаторСклада);

	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ВидМаркетплейса");
	ИменаРеквизитов = РеквизитыНастроекСкладаFBS(ВидМаркетплейса);

	Запрос.УстановитьПараметр("ИменаРеквизитов",     ИменаРеквизитов);

	НастройкиСклада = Новый Структура;

	ВыборкаРезультата = Запрос.Выполнить().Выбрать();
	Пока ВыборкаРезультата.Следующий() Цикл
		НастройкиСклада.Вставить(ВыборкаРезультата.ИмяРеквизита,
			?(ВыборкаРезультата.Значение = "ДополнительныеСведения", ВыборкаРезультата.ЗначениеСтрока, ВыборкаРезультата.Значение));
	КонецЦикла;

	Возврат НастройкиСклада;

КонецФункции

// Возвращает список имен реквизитов настроек склада FBS.
//
// Параметры:
//   ВидМаркетплейса - ПеречислениеСсылка.ВидыМаркетплейсов - вид площадки для получения имен реквизитов настроек.
//
// Возвращаемое значение:
//   Массив из Строка - список имен реквизитов, если без типов данных.
//
Функция РеквизитыНастроекСкладаFBS(ВидМаркетплейса) Экспорт

	ИменаРеквизитов = Новый Массив;

	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		ИменаРеквизитов.Добавить("АдресДоставкиПеревозчика");
		ИменаРеквизитов.Добавить("АдресДоставкиПеревозчикаЗначение");
		ИменаРеквизитов.Добавить("АдресДоставкиПеревозчикаЗначенияПолей");
		ИменаРеквизитов.Добавить("ЗонаДоставки");
		ИменаРеквизитов.Добавить("Курьер");
		ИменаРеквизитов.Добавить("ПеревозчикПартнер");
		ИменаРеквизитов.Добавить("СпособДоставки");
		ИменаРеквизитов.Добавить("ВремяДоставкиС");
		ИменаРеквизитов.Добавить("ВремяДоставкиПо");
	КонецЕсли;

	Возврат ИменаРеквизитов;

КонецФункции

Процедура УстановитьПроцентПрогресса(Знач ВсегоОбрабатываемыхОбъектов, ИндексТекущегоОбъекта,
			ВыполненоПроцентовИтерации, ПараметрыПрогресса) Экспорт

	ВсегоОбрабатываемыхОбъектов = ?(ВсегоОбрабатываемыхОбъектов = 0, 1, ВсегоОбрабатываемыхОбъектов);

	ТекущийПроцентВыполнения = Окр(ИндексТекущегоОбъекта / ВсегоОбрабатываемыхОбъектов, 1);
	Если ВыполненоПроцентовИтерации = ТекущийПроцентВыполнения Тогда
		Возврат;
	КонецЕсли;

	ВыполненоПроцентовИтерации = ТекущийПроцентВыполнения;

	Процент = ИндексТекущегоОбъекта * (ПараметрыПрогресса.ШагИтерацииВПроцентах / ВсегоОбрабатываемыхОбъектов)
		+ ПараметрыПрогресса.ПрогрессВыполнения;
	МодульДлительныеОперации = ОбщегоНазначения.ОбщийМодуль("ДлительныеОперации");
	МодульДлительныеОперации.СообщитьПрогресс(Процент);

КонецПроцедуры

// Возвращает доступные состояния документов, отображаемые в списке загруженных документов.
//
// Возвращаемое значение:
//   Структура:
//     * СостояниеНовый            - Строка - документ новый.
//     * СостояниеОбновлен         - Строка - документ переоформлен.
//     * СостояниеНеОбновлен       - Строка - документ не обновлен.
//     * СостояниеОшибкиЗаполнения - Строка - ошибки при заполнении документа.
//
Функция ДоступныеСостоянияДокументов() Экспорт

	ДоступныеСостоянияДокументов = Новый Структура;
	ДоступныеСостоянияДокументов.Вставить("СостояниеНовый", НСтр("ru = 'Создан новый'"));
	ДоступныеСостоянияДокументов.Вставить("СостояниеОбновлен", НСтр("ru = 'Обновлен'"));
	ДоступныеСостоянияДокументов.Вставить("СостояниеНеОбновлен", НСтр("ru = 'Не обновлен'"));
	ДоступныеСостоянияДокументов.Вставить("СостояниеОшибкиЗаполнения", НСтр("ru = 'Ошибки заполнения'"));

	Возврат ДоступныеСостоянияДокументов;

КонецФункции

// Выполняет загрузку заказов (отправлений) с торговой площадки.
// Используется регламентным заданием.
//
// Параметры:
//   УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись подключения к сервису.
//   Параметры     - Структура из КлючИЗначение - параметры задаются в модуле маркетплейса.
//
// Возвращаемое значение:
//   См. НоваяОшибка.
//
Функция ЗаказыЗагрузитьСТорговойПлощадки(УчетнаяЗапись, Параметры) Экспорт
	
	Ошибка = НоваяОшибка();
	
	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ВидМаркетплейса");
	
	Если ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon") Тогда
		Ошибка = ИнтеграцияСМаркетплейсомOzonСервер.ЗаказыЗагрузитьСТорговойПлощадки( УчетнаяЗапись, Параметры );
	КонецЕсли;
	
	Возврат Ошибка;
	
КонецФункции

// Возвращает имя события журнала регистрации при работе с торговой площадкой.
//
// Параметры:
//   Источник - Неопределено - для получения общего имени события;
//            - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись торговой площадки;
//            - ПеречислениеСсылка.ВидыМаркетплейсов - вид торговой площадки.
//
// Возвращаемое значение:
//   Строка - Наименование события для записей в журнале регистрации.
//
Функция СобытиеЖурналаРегистрации(Знач Источник = Неопределено) Экспорт

	Если Источник = Неопределено Тогда
		ИмяСобытия = НСтр("ru = 'Интеграция с маркетплейсами'", ОбщегоНазначения.КодОсновногоЯзыка());
	Иначе
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.УчетныеЗаписиМаркетплейсов") Тогда
			Источник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ВидМаркетплейса");
		КонецЕсли;
		
		Если Источник = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда
			ИмяСобытия = ИнтеграцияСЯндексМаркетСервер.СобытиеЖурналаРегистрации();
		ИначеЕсли Источник = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
			ИмяСобытия = ИнтеграцияСМаркетплейсомOzonСервер.СобытиеЖурналаРегистрации();
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИмяСобытия;

КонецФункции


// Обновляет статусы заказов (отправлений) с торговой площадки.
// Используется регламентным заданием.
//
// Параметры:
//   УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись подключения к сервису.
//   Параметры     - Структура из КлючИЗначение - параметры задаются в модуле маркетплейса.
//
// Возвращаемое значение:
//   См. НоваяОшибка.
//
Функция ЗаказыОбновитьСтатусыСТорговойПлощадки(УчетнаяЗапись, Параметры) Экспорт
	
	Ошибка = НоваяОшибка();
	
	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ВидМаркетплейса");
	
	Если ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon") Тогда
		Ошибка = ИнтеграцияСМаркетплейсомOzonСервер.ЗаказыОбновитьСтатусыСТорговойПлощадки(
			УчетнаяЗапись,
			Параметры);
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Ошибка;
	
КонецФункции

Функция ЗаказыСостоянияСопоставлениеПолучить( УчетнаяЗапись ) Экспорт
	
	Результат = Новый Соответствие;
	
	ЗапросТекст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиМаркетплейсовЗаказыСостоянияСопоставление.СостояниеСайт КАК СостояниеСайт,
	|	УчетныеЗаписиМаркетплейсовЗаказыСостоянияСопоставление.Состояние1С КАК Состояние1С,
	|	УчетныеЗаписиМаркетплейсовЗаказыСостоянияСопоставление.РезервироватьТовар КАК РезервироватьТовар
	|ИЗ
	|	Справочник.УчетныеЗаписиМаркетплейсов.ЗаказыСостоянияСопоставление КАК
	|		УчетныеЗаписиМаркетплейсовЗаказыСостоянияСопоставление";
	ЗапросОбъект = Новый Запрос( ЗапросТекст );
	ЗапросОбъект.УстановитьПараметр( "УчетнаяЗапись", УчетнаяЗапись );
	ЗапросВыборка = ЗапросОбъект.Выполнить().Выбрать();
	Пока ЗапросВыборка.Следующий() Цикл
		
		Элемент = Новый Структура( "Состояние1С, РезервироватьТовар",
		ЗапросВыборка.Состояние1С, ЗапросВыборка.РезервироватьТовар );
		 
		Результат.Вставить( ЗапросВыборка.СостояниеСайт, Элемент );
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

функция ТоварыИдентификаторыНовый() Экспорт
	
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов( "Строка",, Новый КвалификаторыСтроки( 50, ДопустимаяДлина.Переменная) );
	ОписаниеТиповСтрока250 = Новый ОписаниеТипов( "Строка",, Новый КвалификаторыСтроки( 250, ДопустимаяДлина.Переменная) );
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить( "Идентификатор", ОписаниеТиповСтрока50 );// sku
	Результат.Колонки.Добавить( "Артикул", ОписаниеТиповСтрока50 ); // offer_id
	Результат.Колонки.Добавить( "Штрихкод", ОписаниеТиповСтрока50 ); // barcode
	
	Результат.Колонки.Добавить( "Наименование", ОписаниеТиповСтрока250 ); // name
	
	Возврат Результат;
КонецФункции

Функция ОтчетОРеализацииТоваровДанныеНовый() Экспорт
	
	Результат = новый Структура;
	
	ТипСтрока = Новый ОписаниеТипов( "Строка" );
	ТипКоличество = Новый ОписаниеТипов( "Число", Новый КвалификаторыЧисла( 15, 3 ) );
	ТипСумма = Новый ОписаниеТипов( "Число", Новый КвалификаторыЧисла( 15, 2 ) );
	
	ТипНоменклатура = Новый ОписаниеТипов( "СправочникСсылка.Номенклатура" );
	ТипХарактеристикаНоменклатуры = Новый ОписаниеТипов( "СправочникСсылка.ХарактеристикиНоменклатуры" );
	ТипСтавкаНДС = Новый ОписаниеТипов( "СправочникСсылка.СтавкиНДС" );
	ТипЕдиницаИзмерения = Новый ОписаниеТипов( "СправочникСсылка.КлассификаторЕдиницИзмерения" );
	
	Шапка = Новый Структура;
	
	Шапка.Вставить( "УчетнаяЗаписьМаркетплейса", Справочники.УчетныеЗаписиМаркетплейсов.ПустаяСсылка() );
	
	Шапка.Вставить( "Организация", Справочники.Организации.ПустаяСсылка() );
	Шапка.Вставить( "ОрганизацияНаименование", ТипСтрока );
	Шапка.Вставить( "ОрганизацияИНН", ТипСтрока );
	Шапка.Вставить( "ОрганизацияКПП", ТипСтрока );
	
	Шапка.Вставить( "Контрагент", Справочники.Контрагенты.ПустаяСсылка() );
	Шапка.Вставить( "КонтрагентНаименование", ТипСтрока );
	Шапка.Вставить( "КонтрагентИНН", ТипСтрока );
	Шапка.Вставить( "КонтрагентКПП", ТипСтрока );
	
	Шапка.Вставить( "ДоговорКонтрагента", Справочники.ДоговорыКонтрагентов.ПустаяСсылка() );
	Шапка.Вставить( "ДатаДоговора", Дата( 1, 1, 1) );
	Шапка.Вставить( "НомерДоговора", "" );
	
	Шапка.Вставить( "ДатаВходящегоДокумента", Дата( 1, 1, 1 ) );
	Шапка.Вставить( "НомерВходящегоДокумента", "" );
	
	Шапка.Вставить( "Комментарий", "" );
	
	Результат.Вставить( "Шапка", Шапка );
	
	ТоварыПродажи = Новый ТаблицаЗначений;
	ТоварыПродажи.Колонки.Добавить( "Наименование", ТипСтрока );

	ТоварыПродажи.Колонки.Добавить( "Номенклатура", ТипНоменклатура );
	ТоварыПродажи.Колонки.Добавить( "Характеристика", ТипХарактеристикаНоменклатуры );
	ТоварыПродажи.Колонки.Добавить( "ЕдиницаИзмерения", ТипЕдиницаИзмерения );

	ТоварыПродажи.Колонки.Добавить( "Идентификатор", ТипСтрока );
	ТоварыПродажи.Колонки.Добавить( "Артикул", ТипСтрока );
	ТоварыПродажи.Колонки.Добавить( "ШтрихКод", ТипСтрока);

	ТоварыПродажи.Колонки.Добавить( "Количество", ТипКоличество );
	ТоварыПродажи.Колонки.Добавить( "Цена", ТипСумма );
	ТоварыПродажи.Колонки.Добавить( "Сумма", ТипСумма );
	
	ТоварыПродажи.Колонки.Добавить( "СуммаПередачи", ТипСумма );
	ТоварыПродажи.Колонки.Добавить( "СуммаВознаграждения", ТипСумма );
	
	ТоварыПродажи.Колонки.Добавить( "СтавкаНДС", ТипСтавкаНДС );
	ТоварыПродажи.Колонки.Добавить( "СуммаНДС", ТипСумма );
	
	ТоварыПродажи.Колонки.Добавить( "ИдентификаторОтчета", ТипСтрока );

	ТоварыПродажи.Колонки.Добавить( "БаллыЗаСкидки", ТипСумма );
	ТоварыПродажи.Колонки.Добавить( "ИтогоКомиссияСУчетомСкидокИНаценки", ТипСумма );
	ТоварыПродажи.Колонки.Добавить( "ДоплатаЗаСчетМаркетплейса", ТипСумма );
	ТоварыПродажи.Колонки.Добавить( "БазовоеВознаграждениеМаркетплейса", ТипСумма );
	
	ТоварыПродажи.Колонки.Добавить( "ВыплатыЛояльностиПартнеровЗеленыеЦены", ТипСумма );
	ТоварыПродажи.Колонки.Добавить( "ВыплатыЛояльностиПартнеровЗвезды", ТипСумма );
	ТоварыПродажи.Колонки.Добавить( "ВыплатыЛояльностиПартнеровАПВЗ", ТипСумма );
	
	ТоварыПродажи.Колонки.Добавить( "Доплата", ТипСумма );
	
	ТоварыПродажи.Колонки.Добавить( "ИтогоКНачислению", ТипСумма );


	Результат.Вставить( "ТоварыПродажи", ТоварыПродажи );
	
	
	ТоварыВозвраты = ТоварыПродажи.СкопироватьКолонки();
	
	Результат.Вставить( "ТоварыВозвраты", ТоварыВозвраты );
	
	Результат.Вставить( "НоменклатураПоИдентификаторамНеСопоставлена", ТоварыИдентификаторыНовый() );
	
	Возврат Результат;
	
КонецФункции

Функция ОтчетОРеализацииТоваровПолучить( Параметры ) Экспорт

	Результат = Новый Структура;
	
	УчетнаяЗаписьМаркетплейса = Параметры.УчетнаяЗаписьМаркетплейса;
	//@skip-check bsl-legacy-check-string-literal
	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( УчетнаяЗаписьМаркетплейса, "ВидМаркетплейса" );
	
	Если ВидМаркетплейса = ПредопределенноеЗначение( "Перечисление.ВидыМаркетплейсов.МаркетплейсOzon" ) Тогда
		
		Результат = ИнтеграцияСМаркетплейсомOzonСервер.ОтчетОРеализацииТоваровПолучить( УчетнаяЗаписьМаркетплейса, Параметры );
		
	КонецЕсли;

	Возврат Результат;
КонецФункции

Функция ОтчетОРеализацииТоваровЗаполнитьШапкуПоОрганизации( ОбъектДляЗаполнения, Организация )

	НалогиУНФ.ЗаполнитьНДСВключенВСтоимостьВДокументе( ОбъектДляЗаполнения );
	
	ЗначенияДляЗаполненияОбъекта = Новый Структура;
	//ЗначенияДляЗаполненияОбъекта.Вставить( "Номер", "" );
	
	ПодписьДокументовУНФ.ДополнитьПодписямиОрганизации( ЗначенияДляЗаполненияОбъекта, ОбъектДляЗаполнения );
	ЗаполнитьЗначенияСвойств( ОбъектДляЗаполнения, ЗначенияДляЗаполненияОбъекта );
	
	ВидСтавкиНДСПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( Организация, "ВидСтавкиНДСПоУмолчанию" );
	СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС( ВидСтавкиНДСПоУмолчанию, ОбъектДляЗаполнения.Дата );
	ОбъектДляЗаполнения.СтавкаНДСВознаграждения = СтавкаНДС;
	
	Если Не ЗначениеЗаполнено( ОбъектДляЗаполнения.Договор ) Тогда
		ОбъектДляЗаполнения.Договор = 
		Справочники.ДоговорыКонтрагентов.ПоДокументуКонтрагентуОрганизацииИВидуОперации(
		ОбъектДляЗаполнения.Ссылка, ОбъектДляЗаполнения.Контрагент, ОбъектДляЗаполнения.Организация );
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ОрганизацияПоИННКППНайти( ИНН, КПП = "" ) Экспорт
    
    Результат = Справочники.Организации.ПустаяСсылка();
    
	ЗапросОбъект = Новый Запрос;

	ЗапросТекст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ИНН = &ИНН
	|	И Организации.ПометкаУдаления = ЛОЖЬ
	|	И &УсловиеКПП";

	Если ПустаяСтрока( КПП ) Тогда
		ЗапросТекст = СтрЗаменить( ЗапросТекст, "И &УсловиеКПП", "" );
	Иначе
		ЗапросОбъект.УстановитьПараметр( "КПП", КПП );
		ЗапросТекст = СтрЗаменить( ЗапросТекст, "И &УсловиеКПП", "И Организации.КПП = &КПП" );
	КонецЕсли;

	ЗапросОбъект.Текст = ЗапросТекст;
	ЗапросОбъект.УстановитьПараметр( "ИНН", ИНН );
	
	ЗапросВыборка = ЗапросОбъект.Выполнить().Выбрать();
	Если ЗапросВыборка.Следующий() Тогда
		Результат = ЗапросВыборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КонтрагентПоИННКППНайти( ИНН, КПП = "" ) Экспорт
    
    Результат = Справочники.Контрагенты.ПустаяСсылка();
    
	ЗапросОбъект = Новый Запрос;

	ЗапросТекст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И &УсловиеКПП";

	Если ПустаяСтрока( КПП ) Тогда
		ЗапросТекст = СтрЗаменить( ЗапросТекст, "И &УсловиеКПП", "" );
	Иначе
		ЗапросОбъект.УстановитьПараметр( "КПП", КПП );
		ЗапросТекст = СтрЗаменить( ЗапросТекст, "И &УсловиеКПП", "И Контрагенты.КПП = &КПП" );
	КонецЕсли;

	ЗапросОбъект.Текст = ЗапросТекст;
	ЗапросОбъект.УстановитьПараметр( "ИНН", ИНН );
	
	ЗапросВыборка = ЗапросОбъект.Выполнить().Выбрать();
	Если ЗапросВыборка.Следующий() Тогда
		Результат = ЗапросВыборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДоговорКонтрагентаПоНомеруИДатеНайти( Организация, Контрагент, НомерДоговора, ДатаДоговора ) Экспорт
    
    Результат = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
    
	ЗапросОбъект = Новый Запрос;

	ЗапросТекст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = ДоговорыКонтрагентов.Организация
	|	И ДоговорыКонтрагентов.ДатаДоговора = &ДатаДоговора
	|	И ДоговорыКонтрагентов.НомерДоговора = &НомерДоговора";

	ЗапросОбъект.Текст = ЗапросТекст;
	ЗапросОбъект.УстановитьПараметр( "Организация", Организация );
	ЗапросОбъект.УстановитьПараметр( "Контрагент", Контрагент );
	ЗапросОбъект.УстановитьПараметр( "НомерДоговора", НомерДоговора );
	ЗапросОбъект.УстановитьПараметр( "ДатаДоговора", ДатаДоговора );
	
	ЗапросВыборка = ЗапросОбъект.Выполнить().Выбрать();
	Если ЗапросВыборка.Следующий() Тогда
		Результат = ЗапросВыборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОтчетКомиссионераПоОтчетуОРеализацииТоваровЗаполнить( ОтчетОРеализацииТоваровДанные, ОбъектДляЗаполнения ) Экспорт

	Результат = Новый Структура;
    Результат.Вставить( "НоменклатураПоИдентификаторамНеСопоставлена", Неопределено );
    Результат.Вставить( "ОбъектДляЗаполненияИзменен", Истина );
    
	УчетнаяЗаписьМаркетплейса = ОтчетОРеализацииТоваровДанные.Данные.Шапка.УчетнаяЗаписьМаркетплейса;
	
	НоменклатураПоИдентификаторамНеСопоставлена =
	ОтчетОРеализацииТоваровДанные.Данные.НоменклатураПоИдентификаторамНеСопоставлена;
	Если НоменклатураПоИдентификаторамНеСопоставлена.Количество() > 0 Тогда
		
		Результат.НоменклатураПоИдентификаторамНеСопоставлена = НоменклатураПоИдентификаторамНеСопоставлена;
		
		ТекстСообщенияШаблон = 
		НСтр( "ru = 'Импорт отчета о реализации из Ozon: Не найдена номенклатура в базе 1С по данным Ozon: %1.
               |Необходимо выполнить сопоставление номенклатуры и повторить загрузку.'" );
		ТекстСообщения = СтрШаблон( ТекстСообщенияШаблон, НоменклатураПоИдентификаторамНеСопоставлена.Количество() );
		ОбщегоНазначения.СообщитьПользователю( ТекстСообщения );
		
		Если ОбменСВнешнимиСистемамиЛогирование.ЛогированиеВключено( УчетнаяЗаписьМаркетплейса ) Тогда
		
			ЛогКомментарий = ТекстСообщения + Символы.ПС + Символы.ПС
			+ НСтр( "ru = 'Таблица идентификаторов'" ) + ":" + Символы.ПС
			+ ОбменСВнешнимиСистемамиЛогирование.ОбъектПредставление( НоменклатураПоИдентификаторамНеСопоставлена );
			ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, УчетнаяЗаписьМаркетплейса, Истина );
			
		КонецЕсли;
		
	КонецЕсли;
	
	Шапка = ОтчетОРеализацииТоваровДанные.Данные.Шапка;
	ТоварыПродажи = ОтчетОРеализацииТоваровДанные.Данные.ТоварыПродажи;
	ТоварыВозвраты = ОтчетОРеализацииТоваровДанные.Данные.ТоварыВозвраты;

	#Область Шапка

	ОбъектДляЗаполнения.Организация = Шапка.Организация;
	ОбъектДляЗаполнения.Контрагент = Шапка.Контрагент;
	ОбъектДляЗаполнения.Договор = Шапка.ДоговорКонтрагента;

	ОтчетОРеализацииТоваровЗаполнитьШапкуПоОрганизации( ОбъектДляЗаполнения, Шапка.Организация );

	ОбъектДляЗаполнения.Дата = Шапка.ДатаВходящегоДокумента;

	ОбъектДляЗаполнения.НомерВходящегоДокумента = Шапка.НомерВходящегоДокумента;
	ОбъектДляЗаполнения.ДатаВходящегоДокумента = Шапка.ДатаВходящегоДокумента;

	КомментарийШаблон = НСтр( "ru = 'Импорт из Ozon %1: %2 от %3'" );
	ОбъектДляЗаполнения.Комментарий = СтрШаблон( КомментарийШаблон, ТекущаяДатаСеанса(), 
	ОбъектДляЗаполнения.НомерВходящегоДокумента, 
	Формат( ОбъектДляЗаполнения.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy" ) )
	+ Символы.ПС + ОбъектДляЗаполнения.Комментарий;

	#КонецОбласти

	НастройкиЗаполненияНДС = НалогиУНФ.НастройкиНДСОрганизации( ОбъектДляЗаполнения.Организация, ,
	ОбъектДляЗаполнения.Дата );

	СпособРаспределенияАвто = Перечисления.СпособыЗачетаИРаспределенияПлатежей.Авто;


	// ТЧ Покупатели
	ОбъектДляЗаполнения.Покупатели.Очистить();
	ПокупателиСтрока = ОбъектДляЗаполнения.Покупатели.Добавить();
	ПокупателиСтрока.КлючСвязи = 1;
	ПокупателиСтрока.Покупатель = Шапка.Контрагент;

	#Область ТЧ_Запасы

	ОбъектДляЗаполнения.Запасы.Очистить();
	Для Каждого ТоварыПродажиСтрока Из ТоварыПродажи Цикл
		
		ЗапасыСтрока = ОбъектДляЗаполнения.Запасы.Добавить();
		
		ЗапасыСтрока.КлючСвязи = 1;
		
		ЗапасыСтрока.Номенклатура = ТоварыПродажиСтрока.Номенклатура;
		ЗапасыСтрока.Характеристика = ТоварыПродажиСтрока.Характеристика;
		
		ЗапасыСтрока.ЕдиницаИзмерения = ТоварыПродажиСтрока.ЕдиницаИзмерения;
		ЗапасыСтрока.СтавкаНДС = ТоварыПродажиСтрока.СтавкаНДС;
		
		ЗапасыСтрока.Количество = ?( ТоварыПродажиСтрока.Количество = 0, 1, ТоварыПродажиСтрока.Количество );
		ЗапасыСтрока.Сумма = ТоварыПродажиСтрока.Сумма + ТоварыПродажиСтрока.Доплата;
		ЗапасыСтрока.Цена = ЗапасыСтрока.Сумма/ЗапасыСтрока.Количество;
		
		ЗапасыСтрока.Всего = ЗапасыСтрока.Сумма;
		ЗапасыСтрока.СуммаВознаграждения = 0;
		ЗапасыСтрока.СпособРаспределения = СпособРаспределенияАвто;
		
	КонецЦикла;

	// ставка НДС
	НоменклатураВДокументахСервер.ОбновитьСтавкуНДСТабличнойЧасти( ОбъектДляЗаполнения,
	"Запасы", Истина, НастройкиЗаполненияНДС.ВидСтавкиНДС );

	#КонецОбласти

	ПокупателиСтрока.Всего = ОбъектДляЗаполнения.Запасы.Итог( "Всего" );

	// ТЧ Покупатели возвраты
	ОбъектДляЗаполнения.ПокупателиВозвраты.Очистить();
	ПокупателиВозвратыСтрока = ОбъектДляЗаполнения.ПокупателиВозвраты.Добавить();
	ПокупателиВозвратыСтрока.КлючСвязи = 1;
	ПокупателиВозвратыСтрока.Покупатель = Шапка.Контрагент;

	#Область ТЧ_ЗапасыВозвраты

	ОбъектДляЗаполнения.ЗапасыВозвраты.Очистить();
	Для Каждого ТоварыВозвратыСтрока Из ТоварыВозвраты Цикл
		
		ЗапасыВозвратыСтрока = ОбъектДляЗаполнения.ЗапасыВозвраты.Добавить();
		
		ЗапасыВозвратыСтрока.КлючСвязи = 1;
		
		ЗапасыВозвратыСтрока.Номенклатура = ТоварыВозвратыСтрока.Номенклатура;
		ЗапасыВозвратыСтрока.Характеристика = ТоварыВозвратыСтрока.Характеристика;
		
		ЗапасыВозвратыСтрока.ЕдиницаИзмерения = ТоварыВозвратыСтрока.ЕдиницаИзмерения;
		ЗапасыВозвратыСтрока.СтавкаНДС = ТоварыВозвратыСтрока.СтавкаНДС;
		
		ЗапасыВозвратыСтрока.Количество = ?( ТоварыВозвратыСтрока.Количество = 0, 1, ТоварыВозвратыСтрока.Количество );
		ЗапасыВозвратыСтрока.Сумма = ТоварыВозвратыСтрока.Сумма + ТоварыВозвратыСтрока.Доплата;
		ЗапасыВозвратыСтрока.Цена = ЗапасыВозвратыСтрока.Сумма/ЗапасыВозвратыСтрока.Количество;
		
		ЗапасыВозвратыСтрока.Всего = ЗапасыВозвратыСтрока.Сумма;
		ЗапасыВозвратыСтрока.СуммаВознаграждения = 0;
		ЗапасыВозвратыСтрока.СпособРаспределения = СпособРаспределенияАвто;
		
	КонецЦикла;

	// ставка НДС
	НоменклатураВДокументахСервер.ОбновитьСтавкуНДСТабличнойЧасти( ОбъектДляЗаполнения, 
	"ЗапасыВозвраты", Истина, НастройкиЗаполненияНДС.ВидСтавкиНДС );

	#КонецОбласти

	ПокупателиВозвратыСтрока.Всего = ОбъектДляЗаполнения.ЗапасыВозвраты.Итог( "Всего" );
	        
	Возврат Результат;
КонецФункции

Функция ОтчетОРеализацииТоваровПолучитьИОтчетКомиссионераЗаполнить( Параметры ) Экспорт

	Результат = Новый Структура;

	Если ТипЗнч( Параметры ) <> Тип( "Структура" ) Тогда
		Возврат Результат;
	КонецЕсли;

	// получить данные о продажах для заполнения объекта
	ОтчетОРеализацииТоваровДанные = ОтчетОРеализацииТоваровПолучить( Параметры );
	
	Если ЗначениеЗаполнено( ОтчетОРеализацииТоваровДанные.Ошибка.ОписаниеОшибки ) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОтчетКомиссионераПоОтчетуОРеализацииТоваровЗаполнить( ОтчетОРеализацииТоваровДанные, Параметры );
	
	Возврат Результат;
КонецФункции

Функция ВыполнитьЗагрузкуНовыхЗаказов(ДанныеУчетнойЗаписи, Знач ИдентификаторФормы, Знач ВыделенныеСтроки) Экспорт

	//@skip-check bsl-legacy-check-string-literal
	ДанныеУчетнойЗаписи.ВидМаркетплейса =
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеУчетнойЗаписи.УчетнаяЗапись, "ВидМаркетплейса");

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Ozon. Загрузка заказов.'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ИмяМетода = "ИнтеграцияСМаркетплейсамиСервер.ЗаказыЗагрузитьСТорговойПлощадки";
	
	ОкончаниеПериода = КонецДня(ТекущаяДатаСеанса());
	НачалоПериода    = НачалоДня(ДобавитьМесяц(ОкончаниеПериода, -1));
	
	Если ВыделенныеСтроки = Неопределено Тогда
		ИдентификаторыЗаказов = Неопределено;
	Иначе
		ИдентификаторыЗаказов = Новый Массив;
		
		Для Каждого ДанныеВыделеннойСтроки Из ВыделенныеСтроки Цикл
			ИдентификаторыЗаказов.Добавить(ДанныеВыделеннойСтроки.ИдентификаторЗаказа);
			
			НачалоПериода    = Мин(НачалоПериода, ДанныеВыделеннойСтроки.ДатаСозданияОтправления);
			ОкончаниеПериода = Макс(ОкончаниеПериода, ДанныеВыделеннойСтроки.ДатаСозданияОтправления);
		КонецЦикла;
	КонецЕсли;
	
	Если ДанныеУчетнойЗаписи.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		ПараметрыФункции = ИнтеграцияСМаркетплейсомOzonСервер.НовыйПараметрыЗагрузкиЗаказов();
		ПараметрыФункции.НачалоПериода       = НачалоДня(НачалоПериода);
		ПараметрыФункции.ОкончаниеПериода    = КонецДня(ОкончаниеПериода);
		ПараметрыФункции.ИдентификаторЗаказа = ИдентификаторыЗаказов;
		Если ВыделенныеСтроки = Неопределено Тогда
			// Загрузка только новых заказов.
			ПараметрыФункции.СтатусОтправления = "awaiting_packaging";
		КонецЕсли;
	Иначе
		ПараметрыФункции = Новый Структура;
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяМетода,
		ДанныеУчетнойЗаписи.УчетнаяЗапись,
		ПараметрыФункции);

КонецФункции

// Выполняет перенос (копирование) элементов справочника "Номенклатура партнеров" между владельцами.
//
// Параметры:      
//   Параметры   - см. ИнтеграцияСМаркетплейсамиКлиентСервер.ПараметрыИзмененияВладельцаТоварногоКаталога.
//   Скопировать - Булево - Истина, если скопировать элементы.
//
// Возвращаемое значение:
//   См. НоваяОшибка.
//
Функция ПеренестиНоменклатуруПартнера(Параметры, Скопировать = Истина) Экспорт
	
	Ошибка = НоваяОшибка();
	
	Если Ошибка.Детализация = Неопределено Тогда
		Ошибка.Детализация = Новый Массив;
	КонецЕсли;
	
	Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
		"ИнтеграцияСМаркетплейсамиСервер.ПеренестиНоменклатуруПартнера");
	
	Если Параметры.ВидТорговойПлощадки = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда
		ИмяРегистраСведений       = "СтатусыПубликацииТоваровЯндексМаркет";
		ИмяИзмеренияУчетнаяЗапись = "УчетнаяЗапись";
	ИначеЕсли Параметры.ВидТорговойПлощадки = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		ИмяРегистраСведений       = "СтатусыПубликацииОбъектовМаркетплейсаOzon";
		ИмяИзмеренияУчетнаяЗапись = "УчетнаяЗаписьМаркетплейса";
	ИначеЕсли ИнтеграцияСМаркетплейсамиСИ.ЭтоМаркетплейсСИ(Параметры.ВидТорговойПлощадки) И Не Скопировать Тогда
		ИмяРегистраСведений       = "";
		ИмяИзмеренияУчетнаяЗапись = "";
	Иначе
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неизвестный вид торговой площадки %1.'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			Строка(Параметры.ВидТорговойПлощадки));
		
		Ошибка.КодОшибки      = "НоменклатураКонтрагентов_Запись";
		Ошибка.ОписаниеОшибки = ТекстОшибки;
			
		Возврат Ошибка;
	КонецЕсли;
	
	ИмяРегистра = СтрШаблон("РегистрСведений.%1", ИмяРегистраСведений);
	
	ПараметрыОбработки = НовыеПараметрыОбработкиДанныхНоменклатурыПартнераДляПереноса();
	ПараметрыОбработки.ПрефиксИмпортируемыеТовары = "ИмпортируемыеТовары";
	ПараметрыОбработки.ПрефиксСтатусыПубликации = "СтатусыПубликации";
	ПараметрыОбработки.КопироватьЭлементы = Скопировать;
	
	Если Скопировать Тогда
		
		ПараметрыОбработки.ИмпортируемыеТоварыСтарые = РегистрыСведений.ИмпортируемыеТоварыТорговыхПлощадок.СоздатьНаборЗаписей();
		ПараметрыОбработки.ИмпортируемыеТоварыНовые = РегистрыСведений.ИмпортируемыеТоварыТорговыхПлощадок.СоздатьНаборЗаписей();
		
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяРегистра);
		
		ПараметрыОбработки.СтатусыПубликацииСтарые = Менеджер.СоздатьНаборЗаписей(); // РегистрСведенийНаборЗаписей.СтатусыПубликацииОбъектовМаркетплейсаOzon, РегистрСведенийНаборЗаписей.СтатусыПубликацииТоваровЯндексМаркет
		ПараметрыОбработки.СтатусыПубликацииНовые = Менеджер.СоздатьНаборЗаписей(); // РегистрСведенийНаборЗаписей.СтатусыПубликацииОбъектовМаркетплейсаOzon, РегистрСведенийНаборЗаписей.СтатусыПубликацииТоваровЯндексМаркет
		
	КонецЕсли;
	
	ПакетЗапросов = ДанныеНоменклатурыПартнераДляПереноса(
		ИмяРегистра,
		ИмяИзмеренияУчетнаяЗапись,
		Параметры,
		ПараметрыОбработки);
	
	РезультатЗапросаПоГруппам = ПакетЗапросов[0];
	РезультатЗапроса = ПакетЗапросов[1];
	
	Если РезультатЗапросаПоГруппам.Пустой()
			И РезультатЗапроса.Пустой()
			И Не Параметры.ОбрабатыватьЗаписиБезВладельца Тогда
		Возврат Ошибка;
	КонецЕсли;
	
	ПараметрыОбработки.ИменаКолонокИмпортируемыеТовары = ИменаКолонокРезультатаЗапросаПоПрефиксу(
		РезультатЗапроса, ПараметрыОбработки.ПрефиксИмпортируемыеТовары);
		
	ПараметрыОбработки.ИменаКолонокСтатусыПубликации = ИменаКолонокРезультатаЗапросаПоПрефиксу(
		РезультатЗапроса, ПараметрыОбработки.ПрефиксСтатусыПубликации);
	
	ЗаполняемыеСвойстваЭлемента = ИменаРеквизитовСправочникаНоменклатураКонтрагентов(Ложь);
	ЗаполняемыеСвойстваГруппы = ИменаРеквизитовСправочникаНоменклатураКонтрагентов(Истина);
	
	ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	ИспользоватьУпаковкиНоменклатуры       = ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения");
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		Если Скопировать Тогда
			
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ИмпортируемыеТоварыТорговыхПлощадок");
			ЭлементБлокировкиДанных.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных(
				"УчетнаяЗапись", ПараметрыОбработки.ПрефиксИмпортируемыеТовары + "УчетнаяЗапись");
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных(
				"НоменклатураПартнера", ПараметрыОбработки.ПрефиксИмпортируемыеТовары + "НоменклатураПартнера");
			
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить(ИмяРегистра);
			ЭлементБлокировкиДанных.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных(
				ИмяИзмеренияУчетнаяЗапись, ПараметрыОбработки.ПрефиксСтатусыПубликации + ИмяИзмеренияУчетнаяЗапись);
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных(
				"Номенклатура", ПараметрыОбработки.ПрефиксСтатусыПубликации + "Номенклатура");
			
			Если Параметры.ВидТорговойПлощадки = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
				ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных(
					"НоменклатураПартнера", ПараметрыОбработки.ПрефиксСтатусыПубликации + "НоменклатураПартнера");
			КонецЕсли;
			
			Если ИспользоватьХарактеристикиНоменклатуры Тогда
				ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных(
					"Характеристика", ПараметрыОбработки.ПрефиксСтатусыПубликации + "Характеристика");
			КонецЕсли;
			
			Если ИспользоватьУпаковкиНоменклатуры Тогда
				ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных(
					"Упаковка", ПараметрыОбработки.ПрефиксСтатусыПубликации + "Упаковка");
			КонецЕсли;
			
		Иначе
			
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.НоменклатураКонтрагентов");
			ЭлементБлокировкиДанных.ИсточникДанных = РезультатЗапросаПоГруппам;
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Ссылка", "ПредыдущаяСсылка");
			
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.НоменклатураКонтрагентов");
			ЭлементБлокировкиДанных.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Ссылка", "ПредыдущаяСсылка");
			
		КонецЕсли;
		
		БлокировкаДанных.Заблокировать();
		
		ПараметрыОбработки.РезультатЗапроса = РезультатЗапросаПоГруппам;
		ПараметрыОбработки.ЗаполняемыеСвойства = ЗаполняемыеСвойстваГруппы;
		ПараметрыОбработки.ЭтоОбработкаГрупп = Истина;
		
		ПеренестиНоменклатуруПартнераСлужебный(
			Параметры.ВидТорговойПлощадки, Параметры.НовыйВладелец, Ошибка, ПараметрыОбработки);
		
		ПараметрыОбработки.РезультатЗапроса = РезультатЗапроса;
		ПараметрыОбработки.ЗаполняемыеСвойства = ЗаполняемыеСвойстваЭлемента;
		ПараметрыОбработки.ЭтоОбработкаГрупп = Ложь;
		
		ПеренестиНоменклатуруПартнераСлужебный(
			Параметры.ВидТорговойПлощадки, Параметры.НовыйВладелец, Ошибка, ПараметрыОбработки);
		
		Если ПараметрыОбработки.ИмпортируемыеТоварыСтарые <> Неопределено
				И ПараметрыОбработки.ИмпортируемыеТоварыСтарые.Количество() > 0 Тогда
			ПараметрыОбработки.ИмпортируемыеТоварыСтарые.Записать(РежимЗамещения.Удаление);
		КонецЕсли;
		
		Если ПараметрыОбработки.ИмпортируемыеТоварыНовые <> Неопределено
				И ПараметрыОбработки.ИмпортируемыеТоварыНовые.Количество() > 0 Тогда
			ПараметрыОбработки.ИмпортируемыеТоварыНовые.Записать(РежимЗамещения.Слияние);
		КонецЕсли;
		
		Если ПараметрыОбработки.СтатусыПубликацииСтарые <> Неопределено
				И ПараметрыОбработки.СтатусыПубликацииСтарые.Количество() > 0 Тогда
			ПараметрыОбработки.СтатусыПубликацииСтарые.Записать(РежимЗамещения.Удаление);
		КонецЕсли;
		
		Если ПараметрыОбработки.СтатусыПубликацииНовые <> Неопределено
				И ПараметрыОбработки.СтатусыПубликацииНовые.Количество() > 0 Тогда
			ПараметрыОбработки.СтатусыПубликацииНовые.Записать(РежимЗамещения.Слияние);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		Если Скопировать Тогда
			ШаблонОшибки = НСтр("ru = 'При копировании позиций товарного каталога возникли ошибки: %1.'",
				ОбщегоНазначения.КодОсновногоЯзыка());
		Иначе
			ШаблонОшибки = НСтр("ru = 'При переносе позиций товарного каталога возникли ошибки: %1.'",
				ОбщегоНазначения.КодОсновногоЯзыка());
		КонецЕсли;
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонОшибки,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(Параметры.ВидТорговойПлощадки),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
		
		Ошибка.КодОшибки      = "НоменклатураКонтрагентов_Запись";
		Ошибка.ОписаниеОшибки = ТекстОшибки;
			
		Возврат Ошибка;
	КонецПопытки;
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(
		Замер, 
		ПараметрыОбработки.КоличествоОбработано / 100);
	
	ОтправитьСерверноеУведомлениеНаКлиент(Параметры.ИмяСобытияОповещения, Параметры.УчетнаяЗапись);
	
	Возврат Ошибка;
	
КонецФункции


Функция ИменаКолонокРезультатаЗапросаПоПрефиксу(РезультатЗапроса, Префикс)
	
	Результат = Новый Массив; // Массив из Строка
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		
		Если Не СтрНачинаетсяС(Колонка.Имя, Префикс) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКолонки = Сред(Колонка.Имя, СтрДлина(Префикс) + 1);
		
		Если ИмяКолонки = "ЕстьДанные" Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(ИмяКолонки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Конструктор параметров обработки данных номенклатуры партнера.
// 
// Возвращаемое значение:
//  Структура:
//   * РезультатЗапроса - Неопределено, РезультатЗапроса - элемент пакета запросов из см. ДанныеНоменклатурыПартнераДляПереноса. 
//   * Дубли - Соответствие из КлючИЗначение:
//      ** Ключ - Строка - идентификатор элемента или наименование группы.
//      ** Значение - СправочникСсылка.НоменклатураКонтрагентов - элемент справочника.
//   * Родители - Соответствие из КлючИЗначение:
//      ** Ключ - СправочникСсылка.НоменклатураКонтрагентов - группа номенклатуры прежнего владельца.
//      ** Значение - СправочникСсылка.НоменклатураКонтрагентов - группа номенклатуры нового владельца.
//   * ЗаполняемыеСвойства - Строка - имена заполняемых свойств через запятую.
//   * ЭтоОбработкаГрупп - Булево - признак создания групп номенклатуры контрагентов.
//   * КопироватьЭлементы - Булево - признак необходимости копировать элементы вместо изменения владельца.
//   * КоличествоОбработано - Число - количество обработанных элементов.
//   * ИмпортируемыеТоварыСтарые - Неопределено - если КопироватьЭлементы = Ложь.
//                               - РегистрСведенийНаборЗаписей.ИмпортируемыеТоварыТорговыхПлощадок
//   * ИмпортируемыеТоварыНовые - Неопределено - если КопироватьЭлементы = Ложь.
//                              - РегистрСведенийНаборЗаписей.ИмпортируемыеТоварыТорговыхПлощадок
//   * СтатусыПубликацииСтарые - Неопределено - если КопироватьЭлементы = Ложь.
//                             - РегистрСведенийНаборЗаписей.СтатусыПубликацииОбъектовМаркетплейсаOzon
//                             - РегистрСведенийНаборЗаписей.СтатусыПубликацииТоваровЯндексМаркет
//   * СтатусыПубликацииНовые - Неопределено - если КопироватьЭлементы = Ложь.
//                            - РегистрСведенийНаборЗаписей.СтатусыПубликацииОбъектовМаркетплейсаOzon
//                            - РегистрСведенийНаборЗаписей.СтатусыПубликацииТоваровЯндексМаркет
//   * ПрефиксИмпортируемыеТовары - Строка - префикс полей запроса для данных регистра импортируемых товаров.
//   * ПрефиксСтатусыПубликации - Строка - префикс полей запроса для данных регистра со статусами публикации.
//   * ИменаКолонокИмпортируемыеТовары - Массив из Строка - имена полей запроса для данных регистра импортируемых товаров.
//   * ИменаКолонокСтатусыПубликации - Массив из Строка - имена полей запроса для данных регистра со статусами публикации.
//
Функция НовыеПараметрыОбработкиДанныхНоменклатурыПартнераДляПереноса()
	
	Результат = Новый Структура;
	
	Результат.Вставить("РезультатЗапроса", Неопределено);
	Результат.Вставить("Дубли", Новый Соответствие);
	Результат.Вставить("Родители", Новый Соответствие);
	Результат.Вставить("ЗаполняемыеСвойства", "");
	Результат.Вставить("ЭтоОбработкаГрупп", Ложь);
	Результат.Вставить("КопироватьЭлементы", Ложь);
	Результат.Вставить("КоличествоОбработано", 0);
	
	Результат.Вставить("ИмпортируемыеТоварыСтарые", Неопределено);
	Результат.Вставить("ИмпортируемыеТоварыНовые", Неопределено);
	Результат.Вставить("СтатусыПубликацииСтарые", Неопределено);
	Результат.Вставить("СтатусыПубликацииНовые", Неопределено);
	
	Результат.Вставить("ПрефиксИмпортируемыеТовары", "");
	Результат.Вставить("ПрефиксСтатусыПубликации", "");
	Результат.Вставить("ИменаКолонокИмпортируемыеТовары", Новый Массив);
	Результат.Вставить("ИменаКолонокСтатусыПубликации", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеНоменклатурыПартнераДляПереноса(ИмяРегистра, ИмяИзмеренияУчетнаяЗапись, Параметры, ПараметрыОбработки)
	
	ТекстЗапросаПолейНоменклатураКонтрагентов = ТекстЗапросаПолейОбъектаМетаданных(
		"Справочник.НоменклатураКонтрагентов", "ПредыдущаяНоменклатураКонтрагентов");
	
	Тексты = Новый Массив; // Массив из Строка
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПредыдущаяНоменклатураКонтрагентов.Ссылка КАК ПредыдущаяСсылка,
		|	ПредыдущаяНоменклатураКонтрагентов.Родитель КАК РеквизитУпорядочивания,
		|	ЕСТЬNULL(НоваяНоменклатураКонтрагентов.Ссылка, ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)) КАК НоваяСсылка,
		|	ЛОЖЬ КАК ИмпортируемыеТоварыЕстьДанные,
		|	ЛОЖЬ КАК СтатусыПубликацииЕстьДанные,
		|	&ТекстЗапросаПоляСправочника КАК Поля
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК ПредыдущаяНоменклатураКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоваяНоменклатураКонтрагентов
		|		ПО (НоваяНоменклатураКонтрагентов.Владелец = &НовыйВладелец)
		|			И (НоваяНоменклатураКонтрагентов.Наименование = ПредыдущаяНоменклатураКонтрагентов.Наименование)
		|			И (НоваяНоменклатураКонтрагентов.ЭтоГруппа)
		|ГДЕ
		|	ПредыдущаяНоменклатураКонтрагентов.Владелец = &ТекущийВладелец
		|	И ПредыдущаяНоменклатураКонтрагентов.ЭтоГруппа";
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстЗапросаПоляСправочника КАК Поля",
		ТекстЗапросаПолейНоменклатураКонтрагентов);
		
	Если Не ПараметрыОбработки.КопироватьЭлементы Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
			|	И НоваяНоменклатураКонтрагентов.Ссылка ЕСТЬ NULL";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитУпорядочивания";
	
	Тексты.Добавить(ТекстЗапроса);
	
	Если ПараметрыОбработки.КопироватьЭлементы Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ПредыдущаяНоменклатураКонтрагентов.Ссылка КАК ПредыдущаяСсылка,
			|	ЕСТЬNULL(НоваяНоменклатураКонтрагентов.Ссылка, ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)) КАК НоваяСсылка,
			|	ИмпортируемыеТовары.НоменклатураПартнера ЕСТЬ НЕ NULL  КАК ИмпортируемыеТоварыЕстьДанные,
			|	СтатусыПубликации.НоменклатураПартнера ЕСТЬ НЕ NULL  КАК СтатусыПубликацииЕстьДанные,
			|	&ТекстЗапросаПоляСправочника КАК Поля,
			|	&ТекстЗапросаПоляРегистраИмпортируемыеТовары КАК Поля1,
			|	&ТекстЗапросаПоляРегистраСтатусыПубликации КАК Поля2
			|ИЗ
			|	Справочник.НоменклатураКонтрагентов КАК ПредыдущаяНоменклатураКонтрагентов
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоваяНоменклатураКонтрагентов
			|		ПО (НоваяНоменклатураКонтрагентов.Владелец = &НовыйВладелец)
			|			И (НоваяНоменклатураКонтрагентов.Идентификатор = ПредыдущаяНоменклатураКонтрагентов.Идентификатор)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИмпортируемыеТоварыТорговыхПлощадок КАК ИмпортируемыеТовары
			|		ПО (ИмпортируемыеТовары.НоменклатураПартнера = ПредыдущаяНоменклатураКонтрагентов.Ссылка)
			|			И (ИмпортируемыеТовары.УчетнаяЗапись = &УчетнаяЗапись)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТекстЗапросаПолноеИмяРегистра КАК СтатусыПубликации
			|		ПО (СтатусыПубликации.НоменклатураПартнера = ПредыдущаяНоменклатураКонтрагентов.Ссылка)
			|			И (&ТекстЗапросаИмяПоляУчетнаяЗапись = &УчетнаяЗапись)
			|ГДЕ
			|	ПредыдущаяНоменклатураКонтрагентов.Владелец = &ТекущийВладелец
			|	И НЕ ПредыдущаяНоменклатураКонтрагентов.ЭтоГруппа";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТекстЗапросаПолноеИмяРегистра", ИмяРегистра);
		
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса,
			"&ТекстЗапросаИмяПоляУчетнаяЗапись",
			СтрШаблон("СтатусыПубликации.%1", ИмяИзмеренияУчетнаяЗапись));
		
		ТекстЗапросаПоляРегистраИмпортируемыеТовары = ТекстЗапросаПолейОбъектаМетаданных(
			"РегистрСведений.ИмпортируемыеТоварыТорговыхПлощадок",
			"ИмпортируемыеТовары", ,
			ПараметрыОбработки.ПрефиксИмпортируемыеТовары);
		
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса,
			"&ТекстЗапросаПоляРегистраИмпортируемыеТовары КАК Поля1",
			ТекстЗапросаПоляРегистраИмпортируемыеТовары);
		
		ТекстЗапросаПоляРегистраСтатусыПубликации = ТекстЗапросаПолейОбъектаМетаданных(
			ИмяРегистра,
			"СтатусыПубликации", ,
			ПараметрыОбработки.ПрефиксСтатусыПубликации);
		
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса,
			"&ТекстЗапросаПоляРегистраСтатусыПубликации КАК Поля2",
			ТекстЗапросаПоляРегистраСтатусыПубликации);
		
	Иначе
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ПредыдущаяНоменклатураКонтрагентов.Ссылка КАК ПредыдущаяСсылка,
			|	ЕСТЬNULL(НоваяНоменклатураКонтрагентов.Ссылка, ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)) КАК НоваяСсылка,
			|	ЛОЖЬ КАК ИмпортируемыеТоварыЕстьДанные,
			|	ЛОЖЬ КАК СтатусыПубликацииЕстьДанные,
			|	&ТекстЗапросаПоляСправочника КАК Поля
			|ИЗ
			|	Справочник.НоменклатураКонтрагентов КАК ПредыдущаяНоменклатураКонтрагентов
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоваяНоменклатураКонтрагентов
			|		ПО (НоваяНоменклатураКонтрагентов.Владелец = &НовыйВладелец)
			|			И (НоваяНоменклатураКонтрагентов.Идентификатор = ПредыдущаяНоменклатураКонтрагентов.Идентификатор)
			|ГДЕ
			|	ПредыдущаяНоменклатураКонтрагентов.Владелец = &ТекущийВладелец
			|	И НЕ ПредыдущаяНоменклатураКонтрагентов.ЭтоГруппа
			|	И НоваяНоменклатураКонтрагентов.Ссылка ЕСТЬ NULL";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстЗапросаПоляСправочника КАК Поля",
		ТекстЗапросаПолейНоменклатураКонтрагентов);
	
	ТекстЗапроса = ТекстЗапроса + "
			|УПОРЯДОЧИТЬ ПО
			|	ПредыдущаяСсылка";
	
	Тексты.Добавить(ТекстЗапроса);
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос.УстановитьПараметр("УчетнаяЗапись",   Параметры.УчетнаяЗапись);
	Запрос.УстановитьПараметр("ТекущийВладелец", Параметры.ТекущийВладелец);
	Запрос.УстановитьПараметр("НовыйВладелец",   Параметры.НовыйВладелец);
	
	УстановитьПривилегированныйРежим(Истина);
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПакетЗапросов;
	
КонецФункции

Процедура ПеренестиНоменклатуруПартнераСлужебный(ВидТорговойПлощадки, НовыйВладелец, Ошибка, ПараметрыОбработки)
	
	ВыборкаДанных = ВыборкаДанныхРезультатаЗапросаНоменклатураПартнераДляПереноса(
		ПараметрыОбработки.РезультатЗапроса);
	
	Пока ВыборкаДанных.СледующийПоЗначениюПоля("ПредыдущаяСсылка") Цикл
		
		Если ПараметрыОбработки.ЭтоОбработкаГрупп Тогда
			НоменклатураКонтрагентовСсылка = ПараметрыОбработки.Дубли.Получить(ВыборкаДанных.Наименование);
		Иначе
			НоменклатураКонтрагентовСсылка = ПараметрыОбработки.Дубли.Получить(ВыборкаДанных.Идентификатор);
		КонецЕсли;
		
		Если ПараметрыОбработки.КопироватьЭлементы И ЗначениеЗаполнено(ВыборкаДанных.НоваяСсылка) Тогда
			НоменклатураКонтрагентовСсылка = ВыборкаДанных.НоваяСсылка; // СправочникСсылка.НоменклатураКонтрагентов
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НоменклатураКонтрагентовСсылка) Тогда
			
			Если ПараметрыОбработки.КопироватьЭлементы Тогда
				
				Если ПараметрыОбработки.ЭтоОбработкаГрупп Тогда
					НоменклатураКонтрагентовОбъект = Справочники.НоменклатураКонтрагентов.СоздатьГруппу();
				Иначе
					НоменклатураКонтрагентовОбъект = Справочники.НоменклатураКонтрагентов.СоздатьЭлемент();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(
					НоменклатураКонтрагентовОбъект, ВыборкаДанных, ПараметрыОбработки.ЗаполняемыеСвойства);
				НоменклатураКонтрагентовОбъект.Родитель = ПараметрыОбработки.Родители.Получить(
					ВыборкаДанных.Родитель);
				
			Иначе
				НоменклатураКонтрагентовОбъект = ВыборкаДанных.ПредыдущаяСсылка.ПолучитьОбъект();
				НоменклатураКонтрагентовОбъект.ОбменДанными.Загрузка = Истина;
			КонецЕсли;
			
			НоменклатураКонтрагентовОбъект.Владелец             = НовыйВладелец;
			НоменклатураКонтрагентовОбъект.ВладелецНоменклатуры = НовыйВладелец;
			
			Попытка
				
				НоменклатураКонтрагентовОбъект.Записать();
				НоменклатураКонтрагентовСсылка = НоменклатураКонтрагентовОбъект.Ссылка;
				
				Если Не ПараметрыОбработки.КопироватьЭлементы Тогда
					// Не выполнять кэширование данных
				ИначеЕсли ПараметрыОбработки.ЭтоОбработкаГрупп Тогда
					ПараметрыОбработки.Дубли.Вставить(ВыборкаДанных.Наименование, НоменклатураКонтрагентовСсылка);
					ПараметрыОбработки.Родители.Вставить(ВыборкаДанных.ПредыдущаяСсылка, НоменклатураКонтрагентовСсылка);
				Иначе
					ПараметрыОбработки.Дубли.Вставить(ВыборкаДанных.Идентификатор, НоменклатураКонтрагентовСсылка);
				КонецЕсли;
				
			Исключение
				
				Если ПараметрыОбработки.КопироватьЭлементы Тогда
					ШаблонОшибки = НСтр("ru = 'При копировании позиции товарного каталога %1 возникли ошибки.'",
						ОбщегоНазначения.КодОсновногоЯзыка());
				Иначе
					ШаблонОшибки = НСтр("ru = 'При переносе позиции товарного каталога %1 возникли ошибки.'",
						ОбщегоНазначения.КодОсновногоЯзыка());
				КонецЕсли;
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонОшибки,
					Строка(ВыборкаДанных.ПредыдущаяСсылка));
				
				Ошибка.КодОшибки = "НоменклатураКонтрагентов_Запись";
				Ошибка.Детализация.Добавить(ТекстОшибки);
				
				ЗаписьЖурналаРегистрации(
					СобытиеЖурналаРегистрации(ВидТорговойПлощадки),
					УровеньЖурналаРегистрации.Ошибка, , ,
					ТекстОшибки);
				
			КонецПопытки;
			
		ИначеЕсли ПараметрыОбработки.КопироватьЭлементы И ПараметрыОбработки.ЭтоОбработкаГрупп Тогда
			ПараметрыОбработки.Родители.Вставить(ВыборкаДанных.ПредыдущаяСсылка, НоменклатураКонтрагентовСсылка);
		КонецЕсли;
		
		Если Не ПараметрыОбработки.КопироватьЭлементы
				Или ПараметрыОбработки.ЭтоОбработкаГрупп
				Или Не ЗначениеЗаполнено(НоменклатураКонтрагентовСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Пока ВыборкаДанных.Следующий() Цикл
			
			Если ВыборкаДанных.ИмпортируемыеТоварыЕстьДанные Тогда
				
				СтараяСтрокаИмпортируемыеТовары = ПараметрыОбработки.ИмпортируемыеТоварыСтарые.Добавить();
				НоваяСтрокаИмпортируемыеТовары = ПараметрыОбработки.ИмпортируемыеТоварыНовые.Добавить();
				
				Для Каждого ИмяКолонки Из ПараметрыОбработки.ИменаКолонокИмпортируемыеТовары Цикл
					
					Значение = ВыборкаДанных[ПараметрыОбработки.ПрефиксИмпортируемыеТовары + ИмяКолонки];
					
					СтараяСтрокаИмпортируемыеТовары[ИмяКолонки] = Значение;
					НоваяСтрокаИмпортируемыеТовары[ИмяКолонки] = Значение;
					
				КонецЦикла;
				
				НоваяСтрокаИмпортируемыеТовары.НоменклатураПартнера = НоменклатураКонтрагентовСсылка;
				
			КонецЕсли;
			
			Если ВыборкаДанных.СтатусыПубликацииЕстьДанные Тогда
				
				СтараяСтрокаСтатусыПубликации = ПараметрыОбработки.СтатусыПубликацииСтарые.Добавить();
				НоваяСтрокаСтатусыПубликации = ПараметрыОбработки.СтатусыПубликацииНовые.Добавить();
				
				Для Каждого ИмяКолонки Из ПараметрыОбработки.ИменаКолонокСтатусыПубликации Цикл
					
					Значение = ВыборкаДанных[ПараметрыОбработки.ПрефиксСтатусыПубликации + ИмяКолонки]; // Произвольный
					
					СтараяСтрокаСтатусыПубликации[ИмяКолонки] = Значение;
					НоваяСтрокаСтатусыПубликации[ИмяКолонки] = Значение;
					
				КонецЦикла;
				
				НоваяСтрокаСтатусыПубликации.НоменклатураПартнера = НоменклатураКонтрагентовСсылка;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПараметрыОбработки.КоличествоОбработано = ПараметрыОбработки.КоличествоОбработано + ВыборкаДанных.Количество();
	
КонецПроцедуры

Функция ИменаРеквизитовСправочникаНоменклатураКонтрагентов(ТолькоРеквизитыГруппы)
	
	ИменаРеквизитов = Новый Массив; // Массив из Строка
	ИменаРеквизитов.Добавить("Наименование");
	ИменаРеквизитов.Добавить("ПометкаУдаления");
	
	ВариантыИспользования = Новый Массив; // Массив из ИспользованиеРеквизита
	ВариантыИспользования.Добавить(Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппыИЭлемента);
	Если ТолькоРеквизитыГруппы Тогда
		ВариантыИспользования.Добавить(Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы);
	Иначе
		ВариантыИспользования.Добавить(Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента);
	КонецЕсли;
	
	Для Каждого Реквизит Из Метаданные.Справочники.НоменклатураКонтрагентов.Реквизиты Цикл
		Если ВариантыИспользования.Найти(Реквизит.Использование) <> Неопределено Тогда
			ИменаРеквизитов.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Результат = СтрСоединить(ИменаРеквизитов, ",");
	Возврат Результат;
	
КонецФункции

// Дополняет состав ошибки.
//
// Параметры:
//   Приемник - см. НоваяОшибка.
//   Источник - см. НоваяОшибка.
//
Процедура ДополнитьОшибку(Приемник, Источник) Экспорт

	Если ПустаяСтрока(Источник.КодОшибки) Тогда
		Возврат;
	ИначеЕсли ПустаяСтрока(Приемник.КодОшибки) Тогда
		Приемник = Источник;
	Иначе
		Если Не ЗначениеЗаполнено(Приемник.Детализация) Тогда
			ОписаниеОшибки = Новый Массив;
			Если Не ПустаяСтрока(Приемник.ОписаниеОшибки) Тогда
				ОписаниеОшибки.Добавить(Приемник.ОписаниеОшибки);
			КонецЕсли;
			Если Не ПустаяСтрока(Источник.ОписаниеОшибки) Тогда
				ОписаниеОшибки.Добавить(Источник.ОписаниеОшибки);
			КонецЕсли;
			
			Приемник.ОписаниеОшибки = ?(ОписаниеОшибки.Количество() > 0, СтрСоединить(ОписаниеОшибки, Символы.ПС), "");;
			Приемник.Детализация = Источник.Детализация;
		Иначе
			Если ТипЗнч(Приемник.Детализация) = Тип("Массив") Тогда
				Детализация = Приемник.Детализация;
			Иначе
				Детализация = Новый Массив;
				Детализация.Добавить(Приемник.Детализация);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Источник.Детализация) Тогда
				СоставОшибкиИсточника = ?(ПустаяСтрока(Источник.ОписаниеОшибки), "", Источник.ОписаниеОшибки + ":" + Символы.ПС)
					+ СтрСоединить(Источник.Детализация, Символы.ПС + "   ");
			Иначе
				СоставОшибкиИсточника = Источник.ОписаниеОшибки;
			КонецЕсли;
			
			Детализация.Добавить(СоставОшибкиИсточника);
			
			Приемник.Детализация = Детализация;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Отправляет уведомление с сервера на клиент через МенеджерУведомленийКлиента с ключом серверных уведомлений подсистемы.
//
// Параметры:
//  ИмяСобытияОповещения - Строка - оповещение для уточнения события, которое будет передано на клиент.
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись торговой площадки.
//
Процедура ОтправитьСерверноеУведомлениеНаКлиент(ИмяСобытияОповещения, УчетнаяЗапись) Экспорт
	
	Если ПустаяСтрока(ИмяСобытияОповещения) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеУведомления = ИнтеграцияСМаркетплейсамиКлиентСервер.НовыеДанныеСерверногоУведомления();
	
	ДанныеУведомления.ИмяСобытияОповещения = ИмяСобытияОповещения;
	ДанныеУведомления.УчетнаяЗапись        = УчетнаяЗапись;
	
	УведомленияКлиента.ОтправитьУведомление(
		ИнтеграцияСМаркетплейсамиКлиентСервер.КлючСерверныхУведомлений(), ДанныеУведомления);
	
КонецПроцедуры

// Формирует текст запроса для выбора всех полей объекта метаданных.
//
// Параметры:
//   ИмяОбъектаМетаданных - Строка - имя объекта метаданных, например:"РегистрСведений.ЗаказыТорговыхПлощадок".
//   ПсевдонимТаблицы     - Строка - имя таблицы в запросе, из которой выполняется выборка данных.
//   ИсключаемыеПоля      - Неопределено, Массив из Строка - исключаемые из запроса поля. Для исключения полей
//                          табличных частей необходимо их указать в виде "ИмяТабличнойЧасти.ИмяИсключаемогоПоля".
//   ПрефиксПолей         - Строка - префикс для полей, выбираемых в запросе.
//
// Возвращаемое значение:
//   Строка - текст запроса для выбора полей объекта.
//
Функция ТекстЗапросаПолейОбъектаМетаданных(ИмяОбъектаМетаданных, ПсевдонимТаблицы, Знач ИсключаемыеПоля = Неопределено,
			ПрефиксПолей = "") Экспорт
	
	Если ИсключаемыеПоля = Неопределено Тогда
		ИсключаемыеПоля = Новый Массив;
	КонецЕсли;
	
	МетаданныеРегистра = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ИмяОбъектаМетаданных);
	
	Кандидаты = Новый Структура;
	Кандидаты.Вставить("Измерения", Неопределено);
	Кандидаты.Вставить("Ресурсы", Неопределено);
	Кандидаты.Вставить("СтандартныеРеквизиты", Неопределено);
	Кандидаты.Вставить("Реквизиты", Неопределено);
	Кандидаты.Вставить("ТабличныеЧасти", Неопределено);
	
	ЗаполнитьЗначенияСвойств(Кандидаты, МетаданныеРегистра);
	
	ПустыеЗначенияПолей = Новый Соответствие;
	ДобавляемыеПоля = Новый Массив; // Массив из Строка
	
	ДобавитьПоляКоллекцииМетаданных(
		Кандидаты.Измерения, ДобавляемыеПоля, ИсключаемыеПоля, ПустыеЗначенияПолей);
	ДобавитьПоляКоллекцииМетаданных(
		Кандидаты.Ресурсы, ДобавляемыеПоля, ИсключаемыеПоля, ПустыеЗначенияПолей);
	ДобавитьПоляКоллекцииМетаданных(
		Кандидаты.СтандартныеРеквизиты, ДобавляемыеПоля, ИсключаемыеПоля, ПустыеЗначенияПолей);
	ДобавитьПоляКоллекцииМетаданных(
		Кандидаты.Реквизиты, ДобавляемыеПоля, ИсключаемыеПоля, ПустыеЗначенияПолей);
	
	ПоляРегистра = Новый Массив; // Массив из Строка
	
	Для Каждого ИмяПоля Из ДобавляемыеПоля Цикл
		
		ПустоеЗначение = ПустыеЗначенияПолей.Получить(ИмяПоля);
		ТекстПоля = СтрШаблон("ЕСТЬNULL(%1.%2, %3) КАК %4%2", ПсевдонимТаблицы, ИмяПоля, ПустоеЗначение, ПрефиксПолей);
		ПоляРегистра.Добавить(ТекстПоля);
		
	КонецЦикла;
	
	Если Кандидаты.ТабличныеЧасти <> Неопределено Тогда
		
		Для Каждого ТабличнаяЧасть Из Кандидаты.ТабличныеЧасти Цикл // ОбъектМетаданныхТабличнаяЧасть
			
			ИмяТабличнойЧасти = ТабличнаяЧасть.Имя;
			
			ДобавляемыеПоляТабличнойЧасти = Новый Массив;
			
			ДобавитьПоляКоллекцииМетаданных(
				ТабличнаяЧасть.СтандартныеРеквизиты,
				ДобавляемыеПоляТабличнойЧасти,
				ИсключаемыеПоля, ,
				ИмяТабличнойЧасти);
				
			ДобавитьПоляКоллекцииМетаданных(
				ТабличнаяЧасть.Реквизиты,
				ДобавляемыеПоляТабличнойЧасти,
				ИсключаемыеПоля, ,
				ИмяТабличнойЧасти);
			
			ПоляТабличнойЧасти = Новый Массив; // Массив из Строка
			
			Для Каждого ИмяПоля Из ДобавляемыеПоляТабличнойЧасти Цикл
				ПоляТабличнойЧасти.Добавить(СтрШаблон("	%1 КАК %1", ИмяПоля));
			КонецЦикла;
			
			ТекстЗапросаПоляТабличнойЧасти = СтрСоединить(ПоляТабличнойЧасти, "," + Символы.ПС);
			
			ТекстПоляВыборкиТабличнойЧасти = СтрШаблон(
				"%1.%2.(
				|	Ссылка КАК Ссылка,
				|%3
				|) КАК %4%2",
				ПсевдонимТаблицы,
				ИмяТабличнойЧасти,
				ТекстЗапросаПоляТабличнойЧасти,
				ПрефиксПолей);
			
			ПоляРегистра.Добавить(ТекстПоляВыборкиТабличнойЧасти);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат = СтрСоединить(ПоляРегистра, "," + Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - РезультатЗапроса - элемент пакета запросов из см. ДанныеНоменклатурыПартнераДляПереноса.
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - содержит все поля справочника НоменклатураКонтрагентов, а также дополнительно:
//      * ПредыдущаяСсылка - СправочникСсылка.НоменклатураКонтрагентов - ссылка номенклатуры предыдущего владельца.
//      * НоваяСсылка - СправочникСсылка.НоменклатураКонтрагентов - ссылка номенклатуры нового владельца.
//      * Родитель - СправочникСсылка.НоменклатураКонтрагентов - ссылка на родителя номенклатуры предыдущего владельца.
//      * Идентификатор - Строка - идентификатор номенклатуры контрагента.
//      * Наименование - Строка - наименование номенклатуры контрагента.
//      * ИмпортируемыеТоварыЕстьДанные - Булево - признак наличия данных в регистре импортируемых товаров.
//      * СтатусыПубликацииЕстьДанные - Булево - признак наличия данных в регистре со статусами публикации.
//
Функция ВыборкаДанныхРезультатаЗапросаНоменклатураПартнераДляПереноса(РезультатЗапроса)
	Возврат РезультатЗапроса.Выбрать();
КонецФункции

// Параметры:
//  КоллекцияМетаданных - Неопределено -
//                      - Массив из ОбъектМетаданныхИзмерение - 
//                      - Массив из ОбъектМетаданныхРесурс - 
//                      - Массив из ОбъектМетаданныхРеквизит - 
//  ДобавляемыеПоля     - Массив из Строка - 
//  ИсключаемыеПоля     - Массив из Строка - 
//  ПустыеЗначенияПолей - Неопределено - 
//                      - Соответствие из Строка - 
//  ИмяТабличнойЧасти   - Строка - 
//
Процедура ДобавитьПоляКоллекцииМетаданных(КоллекцияМетаданных, ДобавляемыеПоля, ИсключаемыеПоля,
			ПустыеЗначенияПолей = Неопределено, ИмяТабличнойЧасти = "")
	
	Если КоллекцияМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОбъектМетаданных Из КоллекцияМетаданных Цикл
		
		ИмяПоля = ОбъектМетаданных.Имя;
		
		Если ПустаяСтрока(ИмяТабличнойЧасти) Тогда
			ИмяИсключаемогоПоля = ИмяПоля;
		Иначе
			ИмяИсключаемогоПоля = СтрШаблон("%1.%2", ИмяТабличнойЧасти, ИмяПоля);
		КонецЕсли;
		
		Если ИсключаемыеПоля.Найти(ИмяИсключаемогоПоля) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавляемыеПоля.Добавить(ИмяПоля);
		
		Если ПустыеЗначенияПолей = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТипПоля = ОбъектМетаданных.Тип;
		ПустоеЗначениеПоля = "НЕОПРЕДЕЛЕНО";
		
		Если ТипПоля.Типы().Количество() = 1 Тогда
			ТипЗначения = ТипПоля.Типы()[0];
			
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗначения) Тогда
				МетаданныеПоТипу = Метаданные.НайтиПоТипу(ТипЗначения);
				ПустоеЗначениеПоля = СтрШаблон("ЗНАЧЕНИЕ(%1.ПустаяСсылка)", МетаданныеПоТипу.ПолноеИмя());
				
			ИначеЕсли ТипЗначения = Тип("Строка") Тогда
				ПустоеЗначениеПоля = """""";
				
			ИначеЕсли ТипЗначения = Тип("Число") Тогда
				ПустоеЗначениеПоля = "0";
				
			ИначеЕсли ТипЗначения = Тип("Дата") Тогда
				ПустоеЗначениеПоля = "ДАТАВРЕМЯ(1, 1, 1)";
				
			ИначеЕсли ТипЗначения = Тип("Булево") Тогда
				ПустоеЗначениеПоля = "ЛОЖЬ";
			КонецЕсли;
			
		КонецЕсли;
		
		ПустыеЗначенияПолей.Вставить(ИмяПоля, ПустоеЗначениеПоля);
		
	КонецЦикла;
	
КонецПроцедуры

// Создание / изменение регламентного задания.
// 
// Параметры:
//  ПараметрыЗадания - Структура - ключевые параметры задания. Свойства:
//   * Метаданные - ОбъектМетаданныхРегламентноеЗадание - Регламентное задание
//   * Ключ - Строка - Ключ
//   * Использование - Булево - Использование задания
//  Наименование - Строка - Используется только, если Создавать = Истина
//  Создавать - Булево - Создать регламентное задание, если такое не найдено и Использование = Истина
Процедура СоздатьИзменитьРегламентноеЗадание(ПараметрыЗадания, Наименование = "", Создавать = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыПоиска = Новый Структура("Метаданные, Ключ", Неопределено, "");
	ЗаполнитьЗначенияСвойств(ПараметрыПоиска, ПараметрыЗадания);
	НайденныеРегламентныеЗадания = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыПоиска);
	КоличествоНайденныхЗаданий = НайденныеРегламентныеЗадания.Количество();
	
	Если КоличествоНайденныхЗаданий = 0 И ПараметрыЗадания.Использование И Создавать Тогда
		
		Если Не ОбщегоНазначения.РазделениеВключено() Тогда
			Если ПустаяСтрока(Наименование) Тогда
				ПараметрыЗадания.Вставить("Наименование",
					ИнтеграцияСМаркетплейсамиКлиентСервер.СформироватьНаименованиеРегламентногоЗадания(
						ПараметрыЗадания.Метаданные.Синоним, ПараметрыЗадания.Метаданные.ИмяМетода));
			Иначе
				ПараметрыЗадания.Вставить("Наименование", Наименование);
			КонецЕсли;
		КонецЕсли;
		
		РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		
	ИначеЕсли НайденныеРегламентныеЗадания.Количество() > 0 Тогда
		
		Для Каждого НайденноеРегламентноеЗадания Из НайденныеРегламентныеЗадания Цикл
			Если НайденноеРегламентноеЗадания.Использование <> ПараметрыЗадания.Использование Тогда
				РегламентныеЗаданияСервер.ИзменитьЗадание(НайденноеРегламентноеЗадания.УникальныйИдентификатор, ПараметрыЗадания);
			КонецЕсли;
			Если ПараметрыЗадания.Использование Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Выгружает цены на маркетплейсы.
// 
// Параметры:
//   УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиМаркетплейсов - Учетная запись
//   ДополнительныеПараметры - Неопределено, Структура - Возможные ключи дополнительных параметров:
//    * ПоРасписанию - Булево - признак автоматического или ручного запуска регламентного задания.
//    * АдресРезультата - Строка - Адрес временного хранилища, в которое необходимо положить результат выполнения функции.
//    * ТаблицаТоваров        - ТаблицаЗначений - список товаров:
//      ** УчетнаяЗапись        - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись подключения к сервису;
//      ** Номенклатура         - СправочникСсылка.Номенклатура - номенклатура;
//      ** Характеристика       - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика;
//      ** Упаковка             - СправочникСсылка.УпаковкиЕдиницыИзмерения - упаковка.
Процедура ВыгрузитьЦеныНаМаркетплейсы(УчетнаяЗапись, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВыгрузкаЦенНаМаркетплейсы);
	
	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ВидМаркетплейса");
	
	Если ИнтеграцияСМаркетплейсамиСИ.ЭтоМаркетплейсСИ(ВидМаркетплейса) Тогда
		Если ДополнительныеПараметры = Неопределено Тогда
			ДополнительныеПараметры = Новый Структура;
		КонецЕсли;
		ДополнительныеПараметры.Вставить("ВидМаркетплейса", ВидМаркетплейса);
		ИнтеграцияСМаркетплейсамиСИ.ВыгрузитьЦеныТоваровРегламентнымЗаданием(УчетнаяЗапись, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

// Выгружает остатки товаров на маркетплейсы.
// 
// Параметры:
//   УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиМаркетплейсов - Учетная запись
//   ДополнительныеПараметры - Неопределено, Структура - см. ДополнительныеПараметрыРегламентногоЗадания
Процедура ВыгрузитьОстаткиНаМаркетплейсы(УчетнаяЗапись, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВыгрузкаОстатковНаМаркетплейсы);
	
	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ВидМаркетплейса");
	
	Если ИнтеграцияСМаркетплейсамиСИ.ЭтоМаркетплейсСИ(ВидМаркетплейса) Тогда
		Если ДополнительныеПараметры = Неопределено Тогда
			ДополнительныеПараметры = Новый Структура;
		КонецЕсли;
		ДополнительныеПараметры.Вставить("ВидМаркетплейса", ВидМаркетплейса);
		
		ИнтеграцияСМаркетплейсамиСИ.ВыгрузитьОстаткиТоваровРегламентнымЗаданием(УчетнаяЗапись, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
