#Область ПрограммныйИнтерфейс

// Возвращает признак возможности использования режима расчета зарплаты для
// небольших организаций.
//
// Возвращаемое значение;
//		Булево - Возвращает Истина, если использование возможно, Ложь - нет.
//
Функция РасчетЗарплатыДляНебольшихОрганизацийВозможен() Экспорт
	
	РасчетВозможен = Истина;
	
	ТекущиеКоличества = ТекущееКоличествоСотрудников();
	Если ТекущиеКоличества.Количество() > 0 Тогда
		
		МаксимальноеКоличествоСотрудниковВОрганизации = ТекущиеКоличества[0].КоличествоСотрудников;
		РасчетВозможен = (МаксимальноеКоличествоСотрудниковВОрганизации <= ПорогЗапрета());
		
	КонецЕсли;
	
	Возврат РасчетВозможен;
	
КонецФункции

// Включает режима расчета зарплаты для небольших организаций", если его использование возможно 
//
Процедура УстановитьФОРасчетЗарплатыДляНебольшихОрганизаций() Экспорт
	
	Константы.РасчетЗарплатыДляНебольшихОрганизаций.Установить(
		Константы.ИспользоватьНачислениеЗарплаты.Получить() И РасчетЗарплатыДляНебольшихОрганизацийВозможен());
	
КонецПроцедуры

// Создает новый график работы организации
//
// Параметры:
//  Организация               - СправочникСсылка.Организации
//  ПроизводственныйКалендарь - СправочникСсылка.ПроизводственныеКалендари
//
// Возвращаемое значение:
//  СправочникСсылка.Календари
//
Функция НовыйГрафикРаботыОрганизации(Организация, ПроизводственныйКалендарь) Экспорт
	
	НовыйГрафикРаботы = Справочники.Календари.СоздатьЭлемент();
	НовыйГрафикРаботы.ВладелецГрафика = Организация;
	НовыйГрафикРаботы.Наименование    = НСтр("ru = 'Пятидневная рабочая неделя'");
	
	Если ЗначениеЗаполнено(ПроизводственныйКалендарь) Тогда
		НовыйГрафикРаботы.ПроизводственныйКалендарь = ПроизводственныйКалендарь;
	Иначе
		НовыйГрафикРаботы.ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	КонецЕсли;
	
	НовыйГрафикРаботы.СпособЗаполнения          = Перечисления.СпособыЗаполненияГрафикаРаботы.ПоНеделям;
	НовыйГрафикРаботы.ДатаНачала                = Дата(2000, 1, 1);
	НовыйГрафикРаботы.УчитыватьПраздники         = Истина;
	
	// График работы в предпраздничные дни
	ПериодРаботы = НовыйГрафикРаботы.РасписаниеРаботы.Добавить();
	ПериодРаботы.НомерДня = 0;
	ПериодРаботы.ВремяНачала    = Дата(1, 1, 1, 9, 0, 0);
	ПериодРаботы.ВремяОкончания = Дата(1, 1, 1, 13, 0, 0);
	
	ПериодРаботы = НовыйГрафикРаботы.РасписаниеРаботы.Добавить();
	ПериодРаботы.НомерДня = 0;
	ПериодРаботы.ВремяНачала    = Дата(1, 1, 1, 14, 0, 0);
	ПериодРаботы.ВремяОкончания = Дата(1, 1, 1, 17, 0, 0);
	
	// Заполняем недельный цикл как пятидневку.
	Для НомерДня = 1 По 7 Цикл
		
		НовыйГрафикРаботы.ШаблонЗаполнения.Добавить().ДеньВключенВГрафик = НомерДня <= 5;
		Если НомерДня < 6 Тогда
			
			ПериодРаботы = НовыйГрафикРаботы.РасписаниеРаботы.Добавить();
			ПериодРаботы.НомерДня = НомерДня;
			ПериодРаботы.ВремяНачала = Дата(1, 1, 1, 9, 0, 0);
			ПериодРаботы.ВремяОкончания = Дата(1, 1, 1, 13, 0, 0);
			
			ПериодРаботы = НовыйГрафикРаботы.РасписаниеРаботы.Добавить();
			ПериодРаботы.НомерДня = НомерДня;
			ПериодРаботы.ВремяНачала = Дата(1, 1, 1, 14, 0, 0);
			ПериодРаботы.ВремяОкончания = Дата(1, 1, 1, 18, 0, 0);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НовыйГрафикРаботы;
	
КонецФункции

// Формирует табличную часть Сотрудники, документа НачислениеЗарплаты.
//
// Параметры:
//		Объект  - ДокументОбъект.НачислениеЗарплаты
//
Процедура СформироватьТабличнуюЧастьСотрудники(Объект) Экспорт
	
	Объект.Сотрудники.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТНачисленияПоОтсутствиям(Запрос.МенеджерВременныхТаблиц, Истина, Объект.МесяцНачисления, Объект.Организация, Объект.Подразделение, , Объект.Ссылка);
	СоздатьВТНачисленияПоПремиям(Запрос.МенеджерВременныхТаблиц, Истина, Объект.МесяцНачисления, Объект.Организация, Объект.Подразделение, , Объект.Ссылка);
	
	Запрос.УстановитьПараметр("Начисления", Объект.Начисления.Выгрузить());
	Запрос.УстановитьПараметр("НачисленияПоДоговорам", Объект.НачисленияПоДоговорам.Выгрузить());
	Запрос.УстановитьПараметр("Удержания", Объект.Удержания.Выгрузить());
	Запрос.УстановитьПараметр("НДФЛ", Объект.НДФЛ.Выгрузить());
	Запрос.УстановитьПараметр("Взносы", Объект.Взносы.Выгрузить());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыНачисления.ОтработаноДней КАК ОтработаноДней,
		|	НачислениеЗарплатыНачисления.ОтработаноЧасов КАК ОтработаноЧасов,
		|	НачислениеЗарплатыНачисления.Результат КАК Результат
		|ПОМЕСТИТЬ ВТНачисленияДокументаПредварительно
		|ИЗ
		|	&Начисления КАК НачислениеЗарплатыНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисления.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(НачислениеЗарплатыНачисления.ОтработаноДней) КАК ОтработаноДней,
		|	МАКСИМУМ(НачислениеЗарплатыНачисления.ОтработаноЧасов) КАК ОтработаноЧасов,
		|	СУММА(НачислениеЗарплатыНачисления.Результат) КАК Начислено
		|ПОМЕСТИТЬ ВТНачисленияДокумента
		|ИЗ
		|	ВТНачисленияДокументаПредварительно КАК НачислениеЗарплатыНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНачисления.Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисления.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыНачисленияПоДоговорам.Результат КАК Результат
		|ПОМЕСТИТЬ ВТНачисленияПоДоговорамДокументаПредварительно
		|ИЗ
		|	&НачисленияПоДоговорам КАК НачислениеЗарплатыНачисленияПоДоговорам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник КАК Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыНачисленияПоДоговорам.Результат) КАК Начислено
		|ПОМЕСТИТЬ ВТНачисленияПоДоговорамДокумента
		|ИЗ
		|	ВТНачисленияПоДоговорамДокументаПредварительно КАК НачислениеЗарплатыНачисленияПоДоговорам
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник КАК Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыНачисленияПоДоговорам.Результат) КАК Договоры
		|ПОМЕСТИТЬ ВТДоговорыДокумента
		|ИЗ
		|	ВТНачисленияПоДоговорамДокументаПредварительно КАК НачислениеЗарплатыНачисленияПоДоговорам
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыУдержания.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыУдержания.Результат КАК Результат
		|ПОМЕСТИТЬ ВТУдержанияДокументаПредварительно
		|ИЗ
		|	&Удержания КАК НачислениеЗарплатыУдержания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыУдержания.Сотрудник КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыУдержания.Результат) КАК Удержано
		|ПОМЕСТИТЬ ВТУдержанияДокумента
		|ИЗ
		|	ВТУдержанияДокументаПредварительно КАК НачислениеЗарплатыУдержания
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыУдержания.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачислениеЗарплатыНДФЛ.Налог КАК Налог
		|ПОМЕСТИТЬ ВТНДФЛДокументаПредварительно
		|ИЗ
		|	&НДФЛ КАК НачислениеЗарплатыНДФЛ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыНДФЛ.Налог) КАК НДФЛ
		|ПОМЕСТИТЬ ВТНДФЛДокумента
		|ИЗ
		|	ВТНДФЛДокументаПредварительно КАК НачислениеЗарплатыНДФЛ
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНДФЛ.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	&ПоляВзносов КАК ПоляВзносов
		|ПОМЕСТИТЬ ВТВзносыДокументаПредварительно
		|ИЗ
		|	&Взносы КАК НачислениеЗарплатыВзносы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыВзносы.ПоляВзносов) КАК ПоляВзносов
		|ПОМЕСТИТЬ ВТВзносыДокумента
		|ИЗ
		|	ВТВзносыДокументаПредварительно КАК НачислениеЗарплатыВзносы
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыВзносы.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияДокумента.Сотрудник КАК Сотрудник,
		|	НачисленияДокумента.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудникиПредварительно
		|ИЗ
		|	ВТНачисленияДокумента КАК НачисленияДокумента
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТНачисленияПоДоговорамДокумента.Сотрудник,
		|	ВТНачисленияПоДоговорамДокумента.ФизическоеЛицо
		|ИЗ
		|	ВТНачисленияПоДоговорамДокумента КАК ВТНачисленияПоДоговорамДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УдержанияДокумента.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТУдержанияДокумента КАК УдержанияДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиПредварительно КАК СотрудникиПредварительно
		|		ПО УдержанияДокумента.ФизическоеЛицо = СотрудникиПредварительно.ФизическоеЛицо
		|ГДЕ
		|	СотрудникиПредварительно.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НДФЛДокумента.ФизическоеЛицо
		|ИЗ
		|	ВТНДФЛДокумента КАК НДФЛДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиПредварительно КАК СотрудникиПредварительно
		|		ПО НДФЛДокумента.ФизическоеЛицо = СотрудникиПредварительно.ФизическоеЛицо
		|ГДЕ
		|	СотрудникиПредварительно.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВзносыДокумента.ФизическоеЛицо
		|ИЗ
		|	ВТВзносыДокумента КАК ВзносыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиПредварительно КАК СотрудникиПредварительно
		|		ПО ВзносыДокумента.ФизическоеЛицо = СотрудникиПредварительно.ФизическоеЛицо
		|ГДЕ
		|	СотрудникиПредварительно.ФизическоеЛицо ЕСТЬ NULL";
		
	ПоляВзносов = СтрРазделить(УчетСтраховыхВзносовКлиентСервер.РассчитываемыеВзносы(), ",");
	ТекстЗапросаПолей = "";
	ТекстЗапросаСуммПолей = "";
	
	ДобавитьЗапятую = Ложь;
	Для каждого ПолеВзносов Из  ПоляВзносов Цикл
		
		Если ДобавитьЗапятую Тогда
			
			ТекстЗапросаПолей = ТекстЗапросаПолей + ",
				|	";
				
			ТекстЗапросаСуммПолей = ТекстЗапросаСуммПолей + ",
				|	";
			
		Иначе
			ДобавитьЗапятую = Истина;
		КонецЕсли;
		
		ТекстЗапросаПолей = ТекстЗапросаПолей + "НачислениеЗарплатыВзносы." + ПолеВзносов + " КАК " + ПолеВзносов;
		ТекстЗапросаСуммПолей = ТекстЗапросаСуммПолей + "СУММА(НачислениеЗарплатыВзносы." + ПолеВзносов + ") КАК " + ПолеВзносов;
			
	КонецЦикла;
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляВзносов КАК ПоляВзносов", ТекстЗапросаПолей);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(НачислениеЗарплатыВзносы.ПоляВзносов) КАК ПоляВзносов", ТекстЗапросаСуммПолей);
	
	ПоляВыборкиНДФЛ = Новый Массив;
	ПоляСуммированияНДФЛ = Новый Массив;
	Для каждого ИмяКолонки Из УчетНДФЛ.РесурсыИсчисленногоНалогаВМассиве("Налог") Цикл
		ПоляВыборкиНДФЛ.Добавить(СтрШаблон("НачислениеЗарплатыНДФЛ.%1 КАК %1", ИмяКолонки));
		ПоляСуммированияНДФЛ.Добавить(СтрШаблон("НачислениеЗарплатыНДФЛ.%1", ИмяКолонки));
	КонецЦикла;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НачислениеЗарплатыНДФЛ.Налог КАК Налог",
		СтрСоединить(ПоляВыборкиНДФЛ, "," + Символы.ПС));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(НачислениеЗарплатыНДФЛ.Налог) КАК НДФЛ",
		СтрШаблон("СУММА(%1) КАК НДФЛ", СтрСоединить(ПоляСуммированияНДФЛ, " + ")));
	
	ФизическиеЛицаБезСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТСотрудникиПредварительно.Сотрудник,
		|	ВТСотрудникиПредварительно.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	ВТСотрудникиПредварительно КАК ВТСотрудникиПредварительно";
	
	Если ФизическиеЛицаБезСотрудников.Количество() > 0 Тогда
		
		КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛиц(
			Запрос.МенеджерВременныхТаблиц,
			Истина,
			ФизическиеЛицаБезСотрудников,
			Объект.Организация,
			Объект.МесяцНачисления,
			КонецМесяца(Объект.МесяцНачисления));
		
		Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОсновныеСотрудникиФизическихЛиц.Сотрудник,
			|	ОсновныеСотрудникиФизическихЛиц.ФизическоеЛицо
			|ИЗ
			|	ВТОсновныеСотрудникиФизическихЛиц КАК ОсновныеСотрудникиФизическихЛиц";
		
	КонецЕсли; 
	
	Запрос.Выполнить();
	
	Объект.Сотрудники.Загрузить(ТаблицаСотрудники(Запрос.МенеджерВременныхТаблиц));
	
КонецПроцедуры

// Формирует табличную часть Сотрудники, документа НачислениеЗарплаты.
//
// Параметры:
//		Объект  - ДокументОбъект.НачислениеЗарплаты
//
Процедура СформироватьТабличнуюЧастьСотрудникиПремии(Объект) Экспорт
	
	Объект.Сотрудники.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Начисления", Объект.Начисления.Выгрузить());
	Запрос.УстановитьПараметр("ЗависимыеНачисления", Объект.ЗависимыеНачисления.Выгрузить());
	Запрос.УстановитьПараметр("Удержания", Объект.Удержания.Выгрузить());
	Запрос.УстановитьПараметр("НДФЛ", Объект.НДФЛ.Выгрузить());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыНачисления.Результат КАК Результат
		|ПОМЕСТИТЬ ВТНачисленияДокументаПредварительно
		|ИЗ
		|	&Начисления КАК НачислениеЗарплатыНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисления.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыНачисления.Результат) КАК Начислено
		|ПОМЕСТИТЬ ВТНачисленияДокумента
		|ИЗ
		|	ВТНачисленияДокументаПредварительно КАК НачислениеЗарплатыНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНачисления.Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисления.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыЗависимыеНачисления.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыЗависимыеНачисления.Результат КАК Результат
		|ПОМЕСТИТЬ ВТНачислениеЗарплатыЗависимыеНачисленияПредварительно
		|ИЗ
		|	&ЗависимыеНачисления КАК НачислениеЗарплатыЗависимыеНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыЗависимыеНачисления.Сотрудник КАК Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыЗависимыеНачисления.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыЗависимыеНачисления.Результат) КАК ЗависимыеНачисления
		|ПОМЕСТИТЬ ВТЗависимыеНачисленияПремии
		|ИЗ
		|	ВТНачислениеЗарплатыЗависимыеНачисленияПредварительно КАК НачислениеЗарплатыЗависимыеНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыЗависимыеНачисления.Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыЗависимыеНачисления.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыЗависимыеНачисления.Сотрудник КАК Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыЗависимыеНачисления.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыЗависимыеНачисления.Результат) КАК Договоры
		|ПОМЕСТИТЬ ВТЗарплатыЗависимыеНачисления
		|ИЗ
		|	ВТНачислениеЗарплатыЗависимыеНачисленияПредварительно КАК НачислениеЗарплатыЗависимыеНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыЗависимыеНачисления.Сотрудник,
		|	ВЫРАЗИТЬ(НачислениеЗарплатыЗависимыеНачисления.Сотрудник КАК Справочник.Сотрудники).ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыУдержания.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыУдержания.Результат КАК Результат
		|ПОМЕСТИТЬ ВТУдержанияДокументаПредварительно
		|ИЗ
		|	&Удержания КАК НачислениеЗарплатыУдержания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыУдержания.Сотрудник КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыУдержания.Результат) КАК Удержано
		|ПОМЕСТИТЬ ВТУдержанияДокумента
		|ИЗ
		|	ВТУдержанияДокументаПредварительно КАК НачислениеЗарплатыУдержания
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыУдержания.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачислениеЗарплатыНДФЛ.Налог КАК Налог
		|ПОМЕСТИТЬ ВТНДФЛДокументаПредварительно
		|ИЗ
		|	&НДФЛ КАК НачислениеЗарплатыНДФЛ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыНДФЛ.Налог) КАК НДФЛ
		|ПОМЕСТИТЬ ВТНДФЛДокумента
		|ИЗ
		|	ВТНДФЛДокументаПредварительно КАК НачислениеЗарплатыНДФЛ
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНДФЛ.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияДокумента.Сотрудник КАК Сотрудник,
		|	НачисленияДокумента.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудникиПредварительно
		|ИЗ
		|	ВТНачисленияДокумента КАК НачисленияДокумента
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТЗарплатыЗависимыеНачисления.Сотрудник,
		|	ВТЗарплатыЗависимыеНачисления.ФизическоеЛицо
		|ИЗ
		|	ВТЗарплатыЗависимыеНачисления КАК ВТЗарплатыЗависимыеНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УдержанияДокумента.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТУдержанияДокумента КАК УдержанияДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиПредварительно КАК СотрудникиПредварительно
		|		ПО УдержанияДокумента.ФизическоеЛицо = СотрудникиПредварительно.ФизическоеЛицо
		|ГДЕ
		|	СотрудникиПредварительно.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НДФЛДокумента.ФизическоеЛицо
		|ИЗ
		|	ВТНДФЛДокумента КАК НДФЛДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиПредварительно КАК СотрудникиПредварительно
		|		ПО НДФЛДокумента.ФизическоеЛицо = СотрудникиПредварительно.ФизическоеЛицо
		|ГДЕ
		|	СотрудникиПредварительно.ФизическоеЛицо ЕСТЬ NULL";
	
	ПоляВыборкиНДФЛ = Новый Массив;
	ПоляСуммированияНДФЛ = Новый Массив;
	Для каждого ИмяКолонки Из УчетНДФЛ.РесурсыИсчисленногоНалогаВМассиве("Налог") Цикл
		ПоляВыборкиНДФЛ.Добавить(СтрШаблон("НачислениеЗарплатыНДФЛ.%1 КАК %1", ИмяКолонки));
		ПоляСуммированияНДФЛ.Добавить(СтрШаблон("НачислениеЗарплатыНДФЛ.%1", ИмяКолонки));
	КонецЦикла;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НачислениеЗарплатыНДФЛ.Налог КАК Налог",
		СтрСоединить(ПоляВыборкиНДФЛ, "," + Символы.ПС));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(НачислениеЗарплатыНДФЛ.Налог) КАК НДФЛ",
		СтрШаблон("СУММА(%1) КАК НДФЛ", СтрСоединить(ПоляСуммированияНДФЛ, " + ")));
	
	ФизическиеЛицаБезСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТСотрудникиПредварительно.Сотрудник,
		|	ВТСотрудникиПредварительно.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	ВТСотрудникиПредварительно КАК ВТСотрудникиПредварительно";
	
	Если ФизическиеЛицаБезСотрудников.Количество() > 0 Тогда
		
		КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛиц(
			Запрос.МенеджерВременныхТаблиц,
			Истина,
			ФизическиеЛицаБезСотрудников,
			Объект.Организация,
			Объект.МесяцНачисления,
			КонецМесяца(Объект.МесяцНачисления));
		
		Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОсновныеСотрудникиФизическихЛиц.Сотрудник,
			|	ОсновныеСотрудникиФизическихЛиц.ФизическоеЛицо
			|ИЗ
			|	ВТОсновныеСотрудникиФизическихЛиц КАК ОсновныеСотрудникиФизическихЛиц";
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(Сотрудники.Сотрудник) КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(ЕСТЬNULL(НДФЛДокумента.НДФЛ, 0)) КАК НДФЛ,
		|	МАКСИМУМ(ЕСТЬNULL(УдержанияДокумента.Удержано, 0)) КАК ПрочееУдержано,
		|	МАКСИМУМ(ЕСТЬNULL(УдержанияДокумента.Удержано, 0)) + МАКСИМУМ(ЕСТЬNULL(НДФЛДокумента.НДФЛ, 0)) КАК ВсегоУдержано
		|ПОМЕСТИТЬ ВТУдержанияСотрудников
		|ИЗ
		|	ВТСотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержанияДокумента КАК УдержанияДокумента
		|		ПО Сотрудники.ФизическоеЛицо = УдержанияДокумента.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДФЛДокумента КАК НДФЛДокумента
		|		ПО Сотрудники.ФизическоеЛицо = НДФЛДокумента.ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСотрудников.Сотрудник КАК Сотрудник,
		|	ВЫРАЗИТЬ(ТаблицаСотрудников.Сотрудник КАК Справочник.Сотрудники).Наименование КАК СотрудникНаименование,
		|	ТаблицаСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияДокумента.Начислено КАК Начислено,
		|	ЗависимыеНачисленияПремии.ЗависимыеНачисления КАК ЗависимыеНачисления,
		|	ЕСТЬNULL(НачисленияДокумента.Начислено, 0) + ЕСТЬNULL(ЗависимыеНачисленияПремии.ЗависимыеНачисления, 0) КАК ВсегоНачислено,
		|	УдержанияСотрудников.НДФЛ КАК НДФЛ,
		|	УдержанияСотрудников.ПрочееУдержано КАК ПрочееУдержано,
		|	УдержанияСотрудников.ВсегоУдержано КАК ВсегоУдержано
		|ИЗ
		|	ВТСотрудники КАК ТаблицаСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержанияСотрудников КАК УдержанияСотрудников
		|		ПО ТаблицаСотрудников.Сотрудник = УдержанияСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияДокумента КАК НачисленияДокумента
		|		ПО ТаблицаСотрудников.Сотрудник = НачисленияДокумента.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗависимыеНачисленияПремии КАК ЗависимыеНачисленияПремии
		|		ПО ТаблицаСотрудников.Сотрудник = ЗависимыеНачисленияПремии.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаСотрудников.Сотрудник
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТаблицаСотрудники = Запрос.Выполнить().Выгрузить();
	
	Объект.Сотрудники.Загрузить(ТаблицаСотрудники);
	
КонецПроцедуры

// Заполняет табличную часть Удержания, плановыми удержаниями сотрудников. При заданной
// таблице значений ДобавляемыеНачисления производится дозаполнение табличной части Удержания.
//
// Параметры:
//  Объект                - ДокументОбъект.НачислениеЗарплаты
//  ДобавляемыеНачисления - ТаблицаЗначений - состав колонок идентичен табличной части Начисления
//                                            документа НачислениеЗарплаты.
//
Процедура ЗаполнитьРезультатУдержаний(Объект, ДобавляемыеНачисления = Неопределено, РеквизитНачислениеИмя = "") Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("РасчетЗарплатыДляНебольшихОрганизаций")
		ИЛИ НЕ РасчетЗарплатыДляНебольшихОрганизацийВозможен() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДобавляемыеНачисления = Неопределено Тогда
		Объект.Удержания.Очистить();
		Начисления = Объект.Начисления.Выгрузить();
		Если Объект.НачисленияПоДоговорам.Количество() > 0 Тогда
			
			Начисления.Колонки.Начисление.Имя = "НачислениеПВР";
			Начисления.Колонки.Добавить("Начисление", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления,ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний"));
			Для Каждого СтрокаНачислений Из Начисления Цикл
				СтрокаНачислений.Начисление = СтрокаНачислений.НачислениеПВР;
			КонецЦикла;
			Для Каждого СрокаДоговра Из Объект.НачисленияПоДоговорам Цикл
				СтрокаНачисления = Начисления.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНачисления, СрокаДоговра);
				СтрокаНачисления.Начисление = Перечисления.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Начисления = ДобавляемыеНачисления;
	КонецЕсли;
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Начисления.Колонки, "Начисление") Тогда
		Начисления.Колонки.Добавить("Начисление", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления"));
		Начисления.ЗаполнитьЗначения(Объект[РеквизитНачислениеИмя], "Начисление");
	КонецЕсли;
	
	
	ИсполнительныеЛисты.РассчитатьУдержанияПоИсполнительнымЛистам(Объект, Начисления);
	
КонецПроцедуры

#Область ДатыЗапретаИзменения

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Премия", "ДатаЗапрета", "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям","Период", "Зарплата", "Организация");
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗащитаПерсональныхДанных

// См. ЗащитаПерсональныхДанныхПереопределяемый.ЗаполнитьСведенияОПерсональныхДанных.
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	Документы.НачислениеЗарплаты.ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений)
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.БольничныйЛист, Истина);
	Списки.Вставить(Метаданные.Справочники.БольничныйЛистПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ИсполнительныйЛист, Истина);
	Списки.Вставить(Метаданные.Справочники.ИсполнительныйЛистПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.НачислениеЗарплаты, Истина);
	Списки.Вставить(Метаданные.Справочники.НачислениеЗарплатыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.Отпуск, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтпускПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ОтпускБезСохраненияОплаты, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтпускБезСохраненияОплатыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.Премия, Истина);
	Списки.Вставить(Метаданные.Справочники.ПремияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.НачислениеЗарплаты, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УсловияУдержанияПоИсполнительномуДокументу, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям, Истина);
	
КонецПроцедуры

#КонецОбласти

// Возвращает текущее количество работающих сотрудников организации.
//
// Параметры:
//		Организация - СправочникСсылка.Организации
//
// Возвращаемое значение:
//		Число
//
Функция КоличествоСотрудниковОрганизации(Организация) Экспорт
	
	КоличествоСотрудников = 0;
	
	КоличестваСотрудников = ТекущееКоличествоСотрудников(Организация);
	Если КоличестваСотрудников.Количество() > 0 Тогда
		КоличествоСотрудников = КоличестваСотрудников[0].КоличествоСотрудников;
	КонецЕсли; 
	
	Возврат КоличествоСотрудников;
	
КонецФункции

// Возвращает текст предупреждения об ограничениях использования режима расчета зарплаты
// для небольших организаций, если количество сотрудников, достигло порогового значения.
//
// Параметры:
//		Организация - СправочникСсылка.Организации
//
// Возвращаемое значение:
//		Строка
//
Функция ТекстПредупрежденияОбОграниченияхРежимаРасчетаЗарплатыДляНебольшихОрганизаций(Организация, ПредыдущееКоличествоСотрудников) Экспорт
	
	ТекстПредупреждения = "";
	КоличествоСотрудников = КоличествоСотрудниковОрганизации(Организация);
	Если ПредыдущееКоличествоСотрудников < КоличествоСотрудников
		И КоличествоСотрудников > ПорогЗапрета() - ПорогПредупреждения() Тогда
		
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			РасчетЗарплатыДляНебольшихОрганизацийПереопределяемый.ТекстСообщенияОПриближенииКМаксимальноДопустимомуКоличествуРаботающихСотрудников(),
			ПорогЗапрета(),
			Организация,
			КоличествоСотрудников);
				
	КонецЕсли; 
	
	Возврат ТекстПредупреждения;
	
КонецФункции

// Запоминает во временном хранилище текущее количество работающих сотрудников организации.
//
// Параметры:
//		Форма		- ФормаКлиентскогоПриложения
//		Организация - СправочникСсылка.Организации
//
Процедура ЗапомнитьТекущееКоличествоСотрудников(Форма, Организация) Экспорт
	
	Если Форма.ПолучитьФункциональнуюОпциюФормы("РасчетЗарплатыДляНебольшихОрганизаций")
		И ЗначениеЗаполнено(Организация) Тогда
		
		Форма.ТекущееКоличествоСотрудников = КоличествоСотрудниковОрганизации(Организация);
		
	КонецЕсли; 
	
КонецПроцедуры

// Возвращает максимально возможное количество сотрудников, при  котором возможно
// использование режима расчета зарплаты для небольших организаций.
//
// Возвращаемое значение;
//		Число
//
Функция ПорогЗапрета() Экспорт
	
	Возврат 60;
	
КонецФункции

// Уточняет отработанное время в табличной части Начисления.
//
// Параметры:
//  Объект     - ДокументОбъект.НачислениеЗарплаты
//  Начисления - ДанныеФормыКоллекция, ТабличнаяЧасть
//
Процедура ЗаполнитьРезультатНачисления(Объект, Начисления) Экспорт
	
	Если ПрименяетсяАУСН() Тогда
		ЗаполнитьНачисленияДокументаПоОрганизации(Начисления, Объект);
	КонецЕсли;
	
	КалендарьОрганизации = РасчетЗарплатыДляНебольшихОрганизацийПовтИсп.КалендарьОрганизации(Объект.Организация);
	Если КалендарьОрганизации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "МесяцНачисления") Тогда
		МесяцНачисления = Объект.МесяцНачисления;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ПериодРегистрации") Тогда
		МесяцНачисления = Объект.ПериодРегистрации;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СписокКатегорий", КатегорииОтсутствий());
	Запрос.УстановитьПараметр("СписокКатегорийИсключений",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска));
	
	НачалоПериода = НачалоДня(МесяцНачисления);
	КонецПериода = НачалоДня(КонецМесяца(НачалоПериода));
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Запрос.УстановитьПараметр("НачалоПериода", МесяцНачисления);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(МесяцНачисления));
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ПерваяПоловинаМесяца") Тогда
		Если Объект.ПерваяПоловинаМесяца Тогда
			ОкончаниеПериода = РасчетЗарплатыДляНебольшихОрганизацийПовтИсп.ДатаРасчетаАванса(МесяцНачисления);
			ОкончаниеПериода = РасчетЗарплатыДляНебольшихОрганизаций.ДатаСобытияСУчетомНерабочихДней(ОкончаниеПериода, Объект.Организация);
			Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НачисленияУдержанияПоСотрудникам.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА НачисленияУдержанияПоСотрудникам.ДатаНачала < &НачалоПериода
		|			ТОГДА &НачалоПериода
		|		ИНАЧЕ НачисленияУдержанияПоСотрудникам.ДатаНачала
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА НачисленияУдержанияПоСотрудникам.ДатаОкончания > &ОкончаниеПериода
		|			ТОГДА &ОкончаниеПериода
		|		ИНАЧЕ НачисленияУдержанияПоСотрудникам.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончания
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|ГДЕ
		|	НачисленияУдержанияПоСотрудникам.Организация = &Организация
		|	И НачисленияУдержанияПоСотрудникам.ДатаНачала <= &ОкончаниеПериода
		|	И НачисленияУдержанияПоСотрудникам.ДатаОкончания >= &НачалоПериода
		|	И НачисленияУдержанияПоСотрудникам.Регистратор <> &Ссылка
		|	И НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
		|	И НачисленияУдержанияПоСотрудникам.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени В (&СписокКатегорий)
		|			И НЕ НачисленияУдержанияПоСотрудникам.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени В (&СписокКатегорийИсключений)";
	
	ВытесненноеВремяПоСотрудникам = Новый Соответствие;
	
	ТаблицаВытеснений = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаВытеснения Из ТаблицаВытеснений Цикл
		
		ДатаОкончания = СтрокаВытеснения.ДатаОкончания;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ПерваяПоловинаМесяца") Тогда
			Если Объект.ПерваяПоловинаМесяца Тогда
				ДатаОкончания = Мин(ДатаОкончания, РасчетЗарплатыДляНебольшихОрганизацийПовтИсп.ДатаРасчетаАванса(МесяцНачисления));
			КонецЕсли;
		КонецЕсли;
		
		РабочихДнейЧасов = РасчетЗарплатыБазовый.РабочихДнейЧасовВПериоде(КалендарьОрганизации, СтрокаВытеснения.ДатаНачала, ДатаОкончания);
		
		ВытесненноеВремяСотрудника = ВытесненноеВремяПоСотрудникам.Получить(СтрокаВытеснения.ФизическоеЛицо);
		Если ВытесненноеВремяСотрудника = Неопределено Тогда
			
			ВытесненноеВремяСотрудника = Новый Структура("ДатаНачала,ДатаОкончания,Дней,Часов,ПредпраздничныхДней",
				СтрокаВытеснения.ДатаНачала, СтрокаВытеснения.ДатаОкончания, 0, 0, 0);
			
		КонецЕсли;
		
		ВытесненноеВремяСотрудника.Дней =
			ВытесненноеВремяСотрудника.Дней + РабочихДнейЧасов.Дней;
		ВытесненноеВремяСотрудника.Часов = 
			ВытесненноеВремяСотрудника.Часов + РабочихДнейЧасов.Часов;
		ВытесненноеВремяСотрудника.ПредпраздничныхДней =
			ВытесненноеВремяСотрудника.ПредпраздничныхДней + РабочихДнейЧасов.ПредпраздничныхДней;
		
		ВытесненноеВремяПоСотрудникам.Вставить(СтрокаВытеснения.ФизическоеЛицо, ВытесненноеВремяСотрудника);
		
	КонецЦикла;
	
	КоэффициентыПересчета = Новый Соответствие;
	
	Если ВытесненноеВремяПоСотрудникам.Количество() > 0 Тогда
		
		Если ТипЗнч(Начисления) = Тип("ДанныеФормыКоллекция") Тогда
			СотрудникиНачислений = Начисления.Выгрузить(, "Сотрудник").ВыгрузитьКолонку("Сотрудник");
		Иначе
			СотрудникиНачислений = Начисления.ВыгрузитьКолонку("Сотрудник");
		КонецЕсли;
		
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СотрудникиНачислений, "ФизическоеЛицо,ДатаПриема,ДатаЗавершенияРаботы,ДоляНеполногоРабочегоВремени");
		КатегорииНачислений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ОбщегоНазначения.ВыгрузитьКолонку(Начисления, "Начисление"), "КатегорияНачисленияИлиНеоплаченногоВремени");
		
		Для каждого СтрокаНачислений Из Начисления Цикл
			
			Если КатегорииНачислений[СтрокаНачислений.Начисление] = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда Тогда
				
				Если ЗначениеЗаполнено(СтрокаНачислений.ОтработаноДней) И СтрокаНачислений.ОтработаноДней > 0 Тогда
					
					ОтработаноДней = СтрокаНачислений.ОтработаноДней;
					
					ДанныеСотрудника = КадровыеДанные.Найти(СтрокаНачислений.Сотрудник, "Сотрудник");
					Если ДанныеСотрудника <> Неопределено Тогда
						
						ВытеснениеСотрудника = ВытесненноеВремяПоСотрудникам.Получить(ДанныеСотрудника.ФизическоеЛицо);
						Если ВытеснениеСотрудника <> Неопределено Тогда
							
							СтрокаНачисленийДатаНачала = Макс(ДанныеСотрудника.ДатаПриема, МесяцНачисления);
							Если ЗначениеЗаполнено(ДанныеСотрудника.ДатаЗавершенияРаботы) Тогда
								СтрокаНачисленийДатаОкончания = Мин(ДанныеСотрудника.ДатаЗавершенияРаботы, КонецМесяца(МесяцНачисления));
							Иначе
								СтрокаНачисленийДатаОкончания = КонецМесяца(МесяцНачисления);
							КонецЕсли;
							
							Если ВытеснениеСотрудника.ДатаНачала >= СтрокаНачисленийДатаНачала И ВытеснениеСотрудника.ДатаНачала <= СтрокаНачисленийДатаОкончания
								Или ВытеснениеСотрудника.ДатаОкончания >= СтрокаНачисленийДатаНачала И ВытеснениеСотрудника.ДатаОкончания <= СтрокаНачисленийДатаОкончания Тогда
								
								Если ВытеснениеСотрудника.ДатаНачала >= СтрокаНачисленийДатаНачала И ВытеснениеСотрудника.ДатаОкончания <= СтрокаНачисленийДатаОкончания Тогда
									
									Дней                = ВытеснениеСотрудника.Дней;
									Часов               = ВытеснениеСотрудника.Часов;
									ПредпраздничныхДней = ВытеснениеСотрудника.ПредпраздничныхДней;
									
								Иначе
									
									ДатаНачала = Макс(ВытеснениеСотрудника.ДатаНачала, СтрокаНачисленийДатаНачала);
									ДатаОкончания = Мин(ВытеснениеСотрудника.ДатаОкончания, СтрокаНачисленийДатаОкончания);
									
									РабочихДнейЧасов = РасчетЗарплатыБазовый.РабочихДнейЧасовВПериоде(КалендарьОрганизации, ДатаНачала, ДатаОкончания);
									
									Дней                = РабочихДнейЧасов.Дней;
									Часов               = РабочихДнейЧасов.Часов;
									ПредпраздничныхДней = РабочихДнейЧасов.ПредпраздничныхДней;
									
								КонецЕсли;
							
								// Для расчета отработанного времени с учетом доли неполного времени сначала "возвращаем" часы, на которые
								// короче предпраздничный день: 1 час за каждый день (т.к. прибавляем количество предпраздничных дней).
								// После поправки отработанного времени на долю неполного времени, количество предпраздничных часов вычитаем
								// (предпраздничный день короче на 1 час независимо от того какова доля рабочего времени).
								Часов = Макс(0,
									(Часов + ПредпраздничныхДней) *
										ДанныеСотрудника.ДоляНеполногоРабочегоВремени - ПредпраздничныхДней);
								
								СтрокаНачислений.ОтработаноДней = СтрокаНачислений.ОтработаноДней - Дней;
								Если СтрокаНачислений.ОтработаноДней < 0 Тогда
									СтрокаНачислений.ОтработаноДней = 0;
								КонецЕсли;
								
								СтрокаНачислений.ОтработаноЧасов = СтрокаНачислений.ОтработаноЧасов - Часов;
								Если СтрокаНачислений.ОтработаноЧасов < 0 Тогда
									СтрокаНачислений.ОтработаноЧасов = 0;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если СтрокаНачислений.ОтработаноДней <> ОтработаноДней Тогда
						КоэффициентыПересчета.Вставить(СтрокаНачислений.Сотрудник, СтрокаНачислений.ОтработаноДней / ОтработаноДней);
					КонецЕсли;
					
				Иначе
					
					ДанныеСотрудника = КадровыеДанные.Найти(СтрокаНачислений.Сотрудник, "Сотрудник");
					Если ДанныеСотрудника <> Неопределено Тогда
						
						ВытеснениеСотрудника = ВытесненноеВремяПоСотрудникам.Получить(ДанныеСотрудника.ФизическоеЛицо);
						Если ВытеснениеСотрудника <> Неопределено
							И ВытеснениеСотрудника.Дней = 0 Тогда
							
							Если КоэффициентыПересчета.Получить(СтрокаНачислений.Сотрудник) = Неопределено Тогда
								КоэффициентыПересчета.Вставить(СтрокаНачислений.Сотрудник, 0);
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если КоэффициентыПересчета.Количество() > 0 Тогда
		
		Для каждого ОписаниеКоэффициентаПересчета Из КоэффициентыПересчета Цикл
			
			КоэффициентПересчета = ОписаниеКоэффициентаПересчета.Значение;
			СтрокиНачислений = Начисления.НайтиСтроки(Новый Структура("Сотрудник", ОписаниеКоэффициентаПересчета.Ключ));
			Для каждого СтрокаНачислений Из СтрокиНачислений Цикл
				СтрокаНачислений.Результат = СтрокаНачислений.Результат * КоэффициентПересчета;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события формы документа НачислениеЗарплаты.
//
// Параметры:
//		Форма - ФормаКлиентскогоПриложения
//
Процедура ПриСозданииФормыДокументаНачислениеЗарплаты(Форма) Экспорт
	
	Если Форма.Параметры.Ключ.Пустая() Тогда
		ПриПолученииДанных(Форма);
	КонецЕсли; 
	
	Если НЕ ПолучитьФункциональнуюОпцию("РасчетЗарплатыДляНебольшихОрганизаций")
		ИЛИ НЕ РасчетЗарплатыДляНебольшихОрганизацийВозможен() Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"ГлавноеСтраница",
			"Видимость",
			Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"УдержанияКонтрагент",
			"Видимость",
			Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

// При чтении данных документа НачислениеЗарплаты в форму, дозаполняет
// вторичные данные ТЧ Сотрудники.
//
// Параметры:
//		Форма - ФормаКлиентскогоПриложения
//
Процедура ПриПолученииДанных(Форма) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("РасчетЗарплатыДляНебольшихОрганизаций")
		ИЛИ НЕ РасчетЗарплатыДляНебольшихОрганизацийВозможен() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТНачисленияПоОтсутствиям(Запрос.МенеджерВременныхТаблиц, Истина, Форма.Объект.МесяцНачисления, Форма.Объект.Организация, Форма.Объект.Подразделение, , Форма.Объект.Ссылка);
	СоздатьВТНачисленияПоПремиям(Запрос.МенеджерВременныхТаблиц, Истина, Форма.Объект.МесяцНачисления, Форма.Объект.Организация, Форма.Объект.Подразделение, , Форма.Объект.Ссылка);
	
	Запрос.УстановитьПараметр("Ссылка", Форма.Объект.Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыНачисления.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(НачислениеЗарплатыНачисления.ОтработаноДней) КАК ОтработаноДней,
		|	МАКСИМУМ(НачислениеЗарплатыНачисления.ОтработаноЧасов) КАК ОтработаноЧасов,
		|	СУММА(НачислениеЗарплатыНачисления.Результат) КАК Начислено
		|ПОМЕСТИТЬ ВТНачисленияДокумента
		|ИЗ
		|	Документ.НачислениеЗарплаты.Начисления КАК НачислениеЗарплатыНачисления
		|ГДЕ
		|	НачислениеЗарплатыНачисления.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНачисления.Сотрудник,
		|	НачислениеЗарплатыНачисления.Сотрудник.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыНачисленияПоДоговорам.Результат) КАК Договоры
		|ПОМЕСТИТЬ ВТДоговорыДокумента
		|ИЗ
		|	Документ.НачислениеЗарплаты.НачисленияПоДоговорам КАК НачислениеЗарплатыНачисленияПоДоговорам
		|ГДЕ
		|	НачислениеЗарплатыНачисленияПоДоговорам.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник,
		|	НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыУдержания.Сотрудник КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыУдержания.Результат) КАК Удержано
		|ПОМЕСТИТЬ ВТУдержанияДокумента
		|ИЗ
		|	Документ.НачислениеЗарплаты.Удержания КАК НачислениеЗарплатыУдержания
		|ГДЕ
		|	НачислениеЗарплатыУдержания.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыУдержания.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыНДФЛ.Налог) КАК НДФЛ
		|ПОМЕСТИТЬ ВТНДФЛДокумента
		|ИЗ
		|	Документ.НачислениеЗарплаты.НДФЛ КАК НачислениеЗарплатыНДФЛ
		|ГДЕ
		|	НачислениеЗарплатыНДФЛ.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНДФЛ.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(&ПоляВзносов) КАК ПоляВзносов
		|ПОМЕСТИТЬ ВТВзносыДокумента
		|ИЗ
		|	Документ.НачислениеЗарплаты.Взносы КАК НачислениеЗарплатыВзносы
		|ГДЕ
		|	НачислениеЗарплатыВзносы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыВзносы.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыСотрудники.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	Документ.НачислениеЗарплаты.Сотрудники КАК НачислениеЗарплатыСотрудники
		|ГДЕ
		|	НачислениеЗарплатыСотрудники.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник,
		|	НачислениеЗарплатыНачисленияПоДоговорам.Сотрудник.ФизическоеЛицо
		|ИЗ
		|	Документ.НачислениеЗарплаты.НачисленияПоДоговорам КАК НачислениеЗарплатыНачисленияПоДоговорам
		|ГДЕ
		|	НачислениеЗарплатыНачисленияПоДоговорам.Ссылка = &Ссылка";
		
	ПоляВзносов = СтрРазделить(УчетСтраховыхВзносовКлиентСервер.РассчитываемыеВзносы(), ",");
	ТекстЗапросаСуммПолей = "";
	
	ДобавитьЗапятую = Ложь;
	Для каждого ПолеВзносов Из  ПоляВзносов Цикл
		
		Если ДобавитьЗапятую Тогда
			
			ТекстЗапросаСуммПолей = ТекстЗапросаСуммПолей + ",
				|	";
			
		Иначе
			ДобавитьЗапятую = Истина;
		КонецЕсли;
		
		ТекстЗапросаСуммПолей = ТекстЗапросаСуммПолей + "СУММА(НачислениеЗарплатыВзносы." + ПолеВзносов + ") КАК " + ПолеВзносов;
			
	КонецЦикла;
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(&ПоляВзносов) КАК ПоляВзносов", ТекстЗапросаСуммПолей);
	
	Запрос.Выполнить();
	
	ТаблицаСотрудники = ТаблицаСотрудники(Запрос.МенеджерВременныхТаблиц);
	
	Для каждого СтрокаТЧСотрудники Из Форма.Объект.Сотрудники Цикл
		
		СтрокиТаблицы = ТаблицаСотрудники.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧСотрудники.Сотрудник));
		Если СтрокиТаблицы.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧСотрудники, СтрокиТаблицы[0],
				"ФизическоеЛицо,ОтработаноДней,ОтработаноЧасов,Начислено,ОтпускаБольничные,Премии,Договоры,ВсегоНачислено,"
					+ "НДФЛ,ПрочееУдержано,ВсегоУдержано,Взносы");
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик события формы документа Премия.
//
// Параметры:
//		Форма - ФормаКлиентскогоПриложения
//
Процедура ПриСозданииФормыДокументаПремия(Форма) Экспорт
	
	Если Форма.Параметры.Ключ.Пустая() Тогда
		ПриПолученииДанныхПремии(Форма);
	КонецЕсли; 
	
	Если НЕ ПолучитьФункциональнуюОпцию("РасчетЗарплатыДляНебольшихОрганизаций")
		ИЛИ НЕ РасчетЗарплатыДляНебольшихОрганизацийВозможен() Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"ГлавноеСтраница",
			"Видимость",
			Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

// При чтении данных документа Премия в форму, дозаполняет
// вторичные данные ТЧ Сотрудники.
//
// Параметры:
//		Форма - ФормаКлиентскогоПриложения
//
Процедура ПриПолученииДанныхПремии(Форма) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("РасчетЗарплатыДляНебольшихОрганизаций")
		ИЛИ НЕ РасчетЗарплатыДляНебольшихОрганизацийВозможен() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый  МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", Форма.Объект.Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыНачисления.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыНачисления.Результат) КАК Начислено
		|ПОМЕСТИТЬ ВТНачисленияДокумента
		|ИЗ
		|	Документ.Премия.Начисления КАК НачислениеЗарплатыНачисления
		|ГДЕ
		|	НачислениеЗарплатыНачисления.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНачисления.Сотрудник,
		|	НачислениеЗарплатыНачисления.Сотрудник.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыЗависимыеНачисления.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыЗависимыеНачисления.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыЗависимыеНачисления.Результат) КАК ЗависимыеНачисления
		|ПОМЕСТИТЬ ВТЗависимыеНачисленияПремии
		|ИЗ
		|	Документ.Премия.ЗависимыеНачисления КАК НачислениеЗарплатыЗависимыеНачисления
		|ГДЕ
		|	НачислениеЗарплатыЗависимыеНачисления.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыЗависимыеНачисления.Сотрудник,
		|	НачислениеЗарплатыЗависимыеНачисления.Сотрудник.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыУдержания.Сотрудник КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыУдержания.Результат) КАК Удержано
		|ПОМЕСТИТЬ ВТУдержанияДокумента
		|ИЗ
		|	Документ.Премия.Удержания КАК НачислениеЗарплатыУдержания
		|ГДЕ
		|	НачислениеЗарплатыУдержания.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыУдержания.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачислениеЗарплатыНДФЛ.Налог + НачислениеЗарплатыНДФЛ.НалогСПревышения + НачислениеЗарплатыНДФЛ.НалогСПревышенияПоСтавке18 + НачислениеЗарплатыНДФЛ.НалогСПревышенияПоСтавке20 + НачислениеЗарплатыНДФЛ.НалогСПревышенияПоСтавке22) КАК НДФЛ
		|ПОМЕСТИТЬ ВТНДФЛДокумента
		|ИЗ
		|	Документ.Премия.НДФЛ КАК НачислениеЗарплатыНДФЛ
		|ГДЕ
		|	НачислениеЗарплатыНДФЛ.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНДФЛ.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыСотрудники.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	Документ.Премия.Сотрудники КАК НачислениеЗарплатыСотрудники
		|ГДЕ
		|	НачислениеЗарплатыСотрудники.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачислениеЗарплатыЗависимыеНачисления.Сотрудник,
		|	НачислениеЗарплатыЗависимыеНачисления.Сотрудник.ФизическоеЛицо
		|ИЗ
		|	Документ.Премия.ЗависимыеНачисления КАК НачислениеЗарплатыЗависимыеНачисления
		|ГДЕ
		|	НачислениеЗарплатыЗависимыеНачисления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(Сотрудники.Сотрудник) КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(ЕСТЬNULL(НДФЛДокумента.НДФЛ, 0)) КАК НДФЛ,
		|	МАКСИМУМ(ЕСТЬNULL(УдержанияДокумента.Удержано, 0)) КАК ПрочееУдержано,
		|	МАКСИМУМ(ЕСТЬNULL(УдержанияДокумента.Удержано, 0)) + МАКСИМУМ(ЕСТЬNULL(НДФЛДокумента.НДФЛ, 0)) КАК ВсегоУдержано
		|ПОМЕСТИТЬ ВТУдержанияСотрудников
		|ИЗ
		|	ВТСотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержанияДокумента КАК УдержанияДокумента
		|		ПО Сотрудники.ФизическоеЛицо = УдержанияДокумента.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДФЛДокумента КАК НДФЛДокумента
		|		ПО Сотрудники.ФизическоеЛицо = НДФЛДокумента.ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСотрудников.Сотрудник КАК Сотрудник,
		|	ВЫРАЗИТЬ(ТаблицаСотрудников.Сотрудник КАК Справочник.Сотрудники).Наименование КАК СотрудникНаименование,
		|	ТаблицаСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияДокумента.Начислено КАК Начислено,
		|	ЗависимыеНачисленияПремии.ЗависимыеНачисления КАК ЗависимыеНачисления,
		|	ЕСТЬNULL(НачисленияДокумента.Начислено, 0) + ЕСТЬNULL(ЗависимыеНачисленияПремии.ЗависимыеНачисления, 0) КАК ВсегоНачислено,
		|	УдержанияСотрудников.НДФЛ КАК НДФЛ,
		|	УдержанияСотрудников.ПрочееУдержано КАК ПрочееУдержано,
		|	УдержанияСотрудников.ВсегоУдержано КАК ВсегоУдержано
		|ИЗ
		|	ВТСотрудники КАК ТаблицаСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержанияСотрудников КАК УдержанияСотрудников
		|		ПО ТаблицаСотрудников.Сотрудник = УдержанияСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияДокумента КАК НачисленияДокумента
		|		ПО ТаблицаСотрудников.Сотрудник = НачисленияДокумента.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗависимыеНачисленияПремии КАК ЗависимыеНачисленияПремии
		|		ПО ТаблицаСотрудников.Сотрудник = ЗависимыеНачисленияПремии.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаСотрудников.Сотрудник
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТаблицаСотрудники = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЧСотрудники Из Форма.Объект.Сотрудники Цикл
		
		СтрокиТаблицы = ТаблицаСотрудники.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧСотрудники.Сотрудник));
		Если СтрокиТаблицы.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧСотрудники, СтрокиТаблицы[0],
				"ФизическоеЛицо,Начислено,ЗависимыеНачисления,ВсегоНачислено,"
					+ "НДФЛ,ПрочееУдержано,ВсегоУдержано");
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает таблицу значений, содержащую сумму начислений по больничным листам
// и отпускам сотрудников.
//
// Параметры:
//		СписокСотрудников		- Массив, элементу - СправочникСсылка.Сотрудники.
//		МесяцНачисления			- Дата, первое число месяца за который получаются данные.
//		Организация				- СправочникСсылка.Организации
//		Подразделение			- СправочникСсылка.ПодразделенияОрганизаций
//									если подразделение не указывать, сведения будут собираться без
//									учета подразделения.
//		ИсключаемыйРегистратор - ДокументСсылка.НачислениеЗарплаты
//
// Возвращаемое значение:
//		ТаблицаЗначений - содержит колонки.
//			* Сотрудник			- СправочникСсылка.Сотрудники
//			* ФизическоеЛицо	- СправочникСсылка.ФизическиеЛица
//			* Сумма				- Число
//
Функция СведенияНачисленийПоОтсутствиям(СписокСотрудников, МесяцНачисления, Организация, Подразделение, ИсключаемыйРегистратор) Экспорт
	
	РезультатЗапроса = СоздатьВТНачисленияПоОтсутствиям(
		Новый МенеджерВременныхТаблиц,
		Истина,
		МесяцНачисления,
		Организация,
		Подразделение,
		СписокСотрудников,
		ИсключаемыйРегистратор,
		"");
		
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Возвращает данные о заработке для расчета среднего заработка пособий ФСС.
//
// Параметры:
//		Сотрудник			- СправочникСсылка.Сотрудники
//		Организация			- СправочникСсылка.Организации
//		ДатаНачалаСобытия	- Дата
//		РасчетныеГоды		- Массив, года за которые рассчитывается заработок.
// Возвращаемое значение%
//		Соответствие
//
Функция ДанныеОЗаработкеДляРасчетаСреднегоФСС(Сотрудник, Организация, ДатаНачалаСобытия, РасчетныеГоды) Экспорт
	
	ДанныеОЗаработке = Новый Соответствие;
	
	ПараметрыЗаполнения = УчетПособийСоциальногоСтрахования.ПараметрыЗаполненияСправкиОЗаработкеИДняхОтсутствия(Неопределено);
	ПараметрыЗаполнения.Сотрудник = Сотрудник;
	ПараметрыЗаполнения.Организация = Организация;
	ПараметрыЗаполнения.РасчетныеГоды = РасчетныеГоды;
	ПараметрыЗаполнения.ГодНачала = ПараметрыЗаполнения.РасчетныеГоды[0];
	ПараметрыЗаполнения.ГодОкончания = ПараметрыЗаполнения.РасчетныеГоды[1];
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо"));
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(ПараметрыЗаполнения.Организация));
	Запрос.УстановитьПараметр("ОграничиватьРазмерЗаработка", ПараметрыЗаполнения.ОграничиватьРазмерЗаработка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&ФизическоеЛицо КАК ФизическоеЛицо,
		|	&ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ПОМЕСТИТЬ ВТФизЛицаОрганизаций";
		
	Запрос.Выполнить();
	
	УчетСтраховыхВзносов.СформироватьВТРасширенныеСведенияОДоходахИВзносах(Дата(ПараметрыЗаполнения.ГодНачала, 1, 1), КонецГода(Дата(ПараметрыЗаполнения.ГодОкончания, 1, 1)), ПараметрыЗаполнения.Организация, Запрос.МенеджерВременныхТаблиц, Истина, , , , Истина);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	ГОД(СведенияОДоходах.Период) КАК Год,
		|	МЕСЯЦ(СведенияОДоходах.Период) КАК Месяц,
		|	СУММА(СведенияОДоходах.БазаДляРасчетаПособий) КАК Сумма
		|ИЗ
		|	ВТРасширенныеСведенияОДоходах КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	ГОД(СведенияОДоходах.Период),
		|	МЕСЯЦ(СведенияОДоходах.Период)
		|
		|ИМЕЮЩИЕ
		|	СУММА(СведенияОДоходах.БазаДляРасчетаПособий) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Год,
		|	Месяц";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Год") Цикл
		
		СведенияГода = ДанныеОЗаработке.Получить(Выборка.Год);
		Если СведенияГода = Неопределено Тогда
			СведенияГода = Новый Соответствие;
		КонецЕсли; 
		
		Пока Выборка.СледующийПоЗначениюПоля("Месяц") Цикл
				
			СведенияМесяца = СведенияГода.Получить(Выборка.Месяц);
			Если СведенияМесяца = Неопределено Тогда
				СведенияМесяца = Новый Структура("Заработок,ДнейБолезниУходаЗаДетьми", Новый Массив, 0);
				СведенияГода.Вставить(Выборка.Месяц, СведенияМесяца);
			КонецЕсли; 
			
			Пока Выборка.Следующий() Цикл
				СведенияМесяца.Заработок.Добавить(
					Новый Структура("ФизическоеЛицо,Период,Начисление,Сумма",
						Выборка.ФизическоеЛицо,
						Дата(Выборка.Год, Выборка.Месяц, 1),
						Выборка.Начисление,
						Выборка.Сумма));
			КонецЦикла;
		КонецЦикла;
		
		ДанныеОЗаработке.Вставить(Выборка.Год, СведенияГода);
		
	КонецЦикла;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БольничныйЛист.ДатаНачала,
		|	БольничныйЛист.ДатаОкончания
		|ИЗ
		|	Документ.БольничныйЛист КАК БольничныйЛист
		|ГДЕ
		|	БольничныйЛист.Проведен
		|	И БольничныйЛист.Сотрудник = &Сотрудник
		|	И БольничныйЛист.ДатаНачала <= &ОкончаниеВторогоГода
		|	И БольничныйЛист.ДатаОкончания >= &НачалоПервогоГода";
		
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("НачалоПервогоГода", НачалоГода(Дата(ПараметрыЗаполнения.ГодНачала, 1, 1)));
	Запрос.УстановитьПараметр("ОкончаниеВторогоГода", КонецГода(Дата(ПараметрыЗаполнения.ГодОкончания, 1, 1)));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ДатаНачала = Выборка.ДатаНачала;
			ДатаОкончания = Выборка.ДатаОкончания;
			
			Если ДатаНачала < Дата(ПараметрыЗаполнения.ГодНачала, 1, 1) Тогда
				ДатаНачала = Дата(ПараметрыЗаполнения.ГодНачала, 1, 1);
			КонецЕсли;
			
			Пока ДатаНачала <= ДатаОкончания Цикл
				
				Год = Год(ДатаНачала);
				Если Год = ПараметрыЗаполнения.ГодНачала
					Или Год = ПараметрыЗаполнения.ГодОкончания Тогда
					
					Месяц = Месяц(ДатаНачала);
					ДатаОкончанияВМесяце = Мин(НачалоДня(КонецМесяца(ДатаНачала)), ДатаОкончания);
					
					СведенияГода = ДанныеОЗаработке.Получить(Год);
					Если СведенияГода = Неопределено Тогда
						СведенияГода = Новый Соответствие;
					КонецЕсли; 
					
					СведенияМесяца = СведенияГода.Получить(Месяц);
					Если СведенияМесяца = Неопределено Тогда
						СведенияМесяца = Новый Структура("Заработок,ДнейБолезниУходаЗаДетьми", Новый Массив, 0);
					КонецЕсли; 
					
					ДнейБолезниУходаЗаДетьми = (КонецДня(ДатаОкончанияВМесяце) - ДатаНачала + 1) / 86400;
					СведенияМесяца.ДнейБолезниУходаЗаДетьми = СведенияМесяца.ДнейБолезниУходаЗаДетьми + ДнейБолезниУходаЗаДетьми;
					
					СведенияГода.Вставить(Месяц, СведенияМесяца);
					ДанныеОЗаработке.Вставить(Год, СведенияГода);
					
				КонецЕсли; 
				
				ДатаНачала = КонецМесяца(ДатаНачала) + 1;
				
			КонецЦикла;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Возврат ДанныеОЗаработке;
	
КонецФункции

// Возвращает структуру, содержащую параметры получения среднего заработка для расчета отпусков.
//
//	Возвращаемое значение:
//	Структура
//
Функция ПараметрыПолученияДанныхСреднегоОбщего() Экспорт
	
	ПараметрыПолученияДанныхСреднего = Новый Структура;
	
	ПараметрыПолученияДанныхСреднего.Вставить("ТаблицыПоСотруднику"); 
	ПараметрыПолученияДанныхСреднего.Вставить("ДатаНачалаПериода"); 
	ПараметрыПолученияДанныхСреднего.Вставить("ДатаОкончанияПериода"); 
	ПараметрыПолученияДанныхСреднего.Вставить("ДатаНачалаСобытия", '00010101');
	
	Возврат	ПараметрыПолученияДанныхСреднего;
	
КонецФункции

// Возвращает результат расчета среднего заработка для расчета отпусков.
//
// Параметры:
//		ПараметрыПолученияДанныхСреднего - Структура
//
// Возвращаемое значение:
//		Структура
//
Функция ДанныеРасчетаСреднегоЗаработкаОбщего(ПараметрыПолученияДанныхСреднего) Экспорт
	
	НачислениеРайонныйКоэффициент = ПланыВидовРасчета.Начисления.НачислениеРайонныйКоэффициент();
	НачислениеСевернаяНадбавка = ПланыВидовРасчета.Начисления.НачислениеСевернаяНадбавка();
	
	ДанныеОНачислениях 			= ПараметрыПолученияДанныхСреднего.ТаблицыПоСотруднику["ДанныеОНачислениях"]; 
	ДанныеОВремени 				= ПараметрыПолученияДанныхСреднего.ТаблицыПоСотруднику["ДанныеОВремени"]; 
	ДатаНачалаПериода 			= ПараметрыПолученияДанныхСреднего.ДатаНачалаПериода; 
	ДатаОкончанияПериода 		= ПараметрыПолученияДанныхСреднего.ДатаОкончанияПериода; 
	ДатаНачалаСобытия 			= ПараметрыПолученияДанныхСреднего.ДатаНачалаСобытия;
	
	Заработок = Новый ТаблицаЗначений;
	Заработок.Колонки.Добавить("Месяц", 						Новый ОписаниеТипов("Дата"));
	Заработок.Колонки.Добавить("Сумма", 						Новый ОписаниеТипов("Число"));
	Заработок.Колонки.Добавить("СуммаРК", 						Новый ОписаниеТипов("Число"));
	Заработок.Колонки.Добавить("СуммаСН",						Новый ОписаниеТипов("Число"));
	Заработок.Колонки.Добавить("Учтено", 						Новый ОписаниеТипов("Число"));
	Заработок.Колонки.Добавить("УчтеноРК", 						Новый ОписаниеТипов("Число"));
	Заработок.Колонки.Добавить("УчтеноСН", 						Новый ОписаниеТипов("Число"));
	Заработок.Колонки.Добавить("Год", 							Новый ОписаниеТипов("Число"));
	Заработок.Колонки.Добавить("КоличествоМесяцев", 			Новый ОписаниеТипов("Число"));
	Заработок.Колонки.Добавить("МесячнаяЧасть", 				Новый ОписаниеТипов("Число"));
	Заработок.Колонки.Добавить("КоэффициентНормирования",		Новый ОписаниеТипов("Число"));
	Заработок.Колонки.Добавить("СоставнаяЧасть",				Новый ОписаниеТипов("ПеречислениеСсылка.УчетНачисленийВСреднемЗаработкеОбщий"));
	
	ОтработанноеВремя = Новый ТаблицаЗначений;
	ОтработанноеВремя.Колонки.Добавить("Месяц", 							Новый ОписаниеТипов("Дата"));
	ОтработанноеВремя.Колонки.Добавить("КалендарныхДней", 					Новый ОписаниеТипов("Число"));
	ОтработанноеВремя.Колонки.Добавить("Учтено", 							Новый ОписаниеТипов("Число"));
	ОтработанноеВремя.Колонки.Добавить("ОтработаноПятидневка", 				Новый ОписаниеТипов("Число"));
	ОтработанноеВремя.Колонки.Добавить("НормаПятидневка", 					Новый ОписаниеТипов("Число"));
	
	ДанныеОВремениПоПериодам = Новый Соответствие;
	
	Для Каждого СтрокаВремени Из ДанныеОВремени Цикл
		
		// Используем данные только за рассчитываемый период.
		Если СтрокаВремени.Период < ДатаНачалаПериода Или СтрокаВремени.Период > ДатаОкончанияПериода Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОтработанноеВремя = СтрокаКоллекцииПоПериоду(ОтработанноеВремя, СтрокаВремени.Период);
		
		СтрокаОтработанноеВремя.КалендарныхДней      = СтрокаВремени.ОтработаноДнейКалендарных;
		СтрокаОтработанноеВремя.ОтработаноПятидневка = СтрокаВремени.ОтработаноДнейПятидневка;
		СтрокаОтработанноеВремя.НормаПятидневка      = СтрокаВремени.НормаДнейПроизводственныйКалендарь;
		
		// Если отработано календарных дней меньше, 
		// чем всего в месяце уменьшаем среднемесячное количество дней пропорционально.
		ДнейПериода = КоличествоУчтенныхДнейОтпуска(ДатаНачалаСобытия, СтрокаВремени.Период, СтрокаВремени.ОтработаноДнейКалендарных);
		СтрокаОтработанноеВремя.Учтено = ДнейПериода;
		
	КонецЦикла;	
	
	ДоляВремени = ДоляОтработанногоВремени(ОтработанноеВремя);
	КоличествоМесяцевПериодаРасчета = КоличествоМесяцевПериодаРасчетаСреднего(ДатаНачалаПериода, ДатаОкончанияПериода);
	
	ОтражатьДолюВремени = Ложь;
	
	Для Каждого СтрокаНачислений Из ДанныеОНачислениях Цикл
		
		// Используем данные только за рассчитываемый период.
		Если СтрокаНачислений.Период < ДатаНачалаПериода 
			Или СтрокаНачислений.Период > ДатаОкончанияПериода Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЭтоПремияПроцентом(СтрокаНачислений.СоставнаяЧасть) 
			И Не ЭтоПремияФиксированнойСуммой(СтрокаНачислений.СоставнаяЧасть) Тогда
			СтрокаЗаработка = СтрокаКоллекцииПоПериоду(Заработок, СтрокаНачислений.Период);
			Если ЗначениеЗаполнено(СтрокаЗаработка.СоставнаяЧасть) Тогда
				СтрокаЗаработка = СтрокаКоллекцииПоОтбору(Заработок,
					Новый Структура("Месяц, СоставнаяЧасть",
						СтрокаНачислений.Период, Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПустаяСсылка()));
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаНачислений.Начисление) Тогда
				Если СтрокаНачислений.Начисление = НачислениеРайонныйКоэффициент Тогда
					СтрокаЗаработка.СуммаРК 	= СтрокаЗаработка.СуммаРК + СтрокаНачислений.Сумма;
				ИначеЕсли СтрокаНачислений.Начисление = НачислениеСевернаяНадбавка Тогда
					СтрокаЗаработка.СуммаСН 	= СтрокаЗаработка.СуммаСН + СтрокаНачислений.Сумма;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаЗаработка.Сумма 	= СтрокаЗаработка.Сумма + СтрокаНачислений.Сумма;
			
			СтрокаЗаработка.Учтено 		= Окр(СтрокаЗаработка.Сумма, 2);
			СтрокаЗаработка.УчтеноРК 	= Окр(СтрокаЗаработка.СуммаРК, 2);
			СтрокаЗаработка.УчтеноСН 	= Окр(СтрокаЗаработка.СуммаСН, 2);
			Продолжить;
		КонецЕсли;
		
		// Является премией
		КоличествоМесяцев = СтрокаНачислений.КоличествоМесяцев;
		Если ЭтоПремияГодовая(СтрокаНачислений.СоставнаяЧасть) Тогда
			КоличествоМесяцев = 12;
		Иначе	
			Если Не ЗначениеЗаполнено(СтрокаНачислений.КоличествоМесяцев) Тогда
				КоличествоМесяцев = 1;
			КонецЕсли;
		КонецЕсли;
		
		КоэффициентПремии = 1;
		Если КоличествоМесяцев > КоличествоМесяцевПериодаРасчета И Не ЭтоПремияПроцентом(СтрокаНачислений.СоставнаяЧасть) Тогда
			КоэффициентПремии = КоличествоМесяцевПериодаРасчета / КоличествоМесяцев;
		КонецЕсли;
		
		ДоляВремениПремии = 1;
		// Если премия фиксированной суммой, рассчитываем коэффициент нормирования.
		Если ЭтоПремияФиксированнойСуммой(СтрокаНачислений.СоставнаяЧасть) Тогда
			ДоляВремениПремии = ДоляВремени;
		КонецЕсли;
		// Или если премия начислена за время, не входящее в расчетный период.
		Если ЭтоПремияПроцентом(СтрокаНачислений.СоставнаяЧасть) Тогда
			Если ПремияНачисленаЗаВремяНеВходящееВРасчетныйПериод(СтрокаНачислений, ДатаНачалаПериода, ДатаОкончанияПериода) Тогда
				ДоляВремениПремии = ДоляВремени;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаПремии = СтрокаКоллекцииПоОтбору(Заработок,
			Новый Структура("Месяц, СоставнаяЧасть, Год, КоличествоМесяцев, КоэффициентНормирования",
				СтрокаНачислений.Период, СтрокаНачислений.СоставнаяЧасть, СтрокаНачислений.Год, КоличествоМесяцев, ДоляВремениПремии));
		СтрокаПремии.Сумма                   = СтрокаПремии.Сумма + СтрокаНачислений.Сумма;
		СтрокаПремии.Учтено                  = СтрокаПремии.Учтено + Окр(СтрокаНачислений.Сумма * КоэффициентПремии * ДоляВремениПремии, 2);
		СтрокаПремии.МесячнаяЧасть           = СтрокаПремии.МесячнаяЧасть + Окр(СтрокаНачислений.Сумма / КоличествоМесяцев, 2);
		
	КонецЦикла;
	
	Заработок.Сортировать("Месяц");
	ОтработанноеВремя.Сортировать("Месяц");
	
	Итоги = Новый Структура;
	Итоги.Вставить("ВсегоЗаработка",				Заработок.Итог("Учтено"));
	Итоги.Вставить("ВсегоЗаработкаРК",				Заработок.Итог("УчтеноРК"));
	Итоги.Вставить("ВсегоЗаработкаСН",				Заработок.Итог("УчтеноСН"));
	Итоги.Вставить("ВсегоКалендарныхДней", 			ОтработанноеВремя.Итог("КалендарныхДней"));
	Итоги.Вставить("ВсегоДнейЧасов", 				ОтработанноеВремя.Итог("Учтено"));
	Итоги.Вставить("ВсегоОтработаноПятидневка", 	ОтработанноеВремя.Итог("ОтработаноПятидневка"));
	Итоги.Вставить("ВсегоНормаПятидневка", 			ОтработанноеВремя.Итог("НормаПятидневка"));
	
	ВсегоЗаработок = ?(Итоги.ВсегоДнейЧасов = 0, 0, Итоги.ВсегоЗаработка / Итоги.ВсегоДнейЧасов);
	Итоги.Вставить("СреднедневнойЗаработок", 		Окр(ВсегоЗаработок, 2));
	ВсегоЗаработок = ?(Итоги.ВсегоДнейЧасов = 0, 0, Итоги.ВсегоЗаработкаРК / Итоги.ВсегоДнейЧасов);
	Итоги.Вставить("СреднедневнойЗаработокРК", 		Окр(ВсегоЗаработок, 2));
	ВсегоЗаработок = ?(Итоги.ВсегоДнейЧасов = 0, 0, Итоги.ВсегоЗаработкаСН / Итоги.ВсегоДнейЧасов);
	Итоги.Вставить("СреднедневнойЗаработокСН", 		Окр(ВсегоЗаработок, 2));
	
	Возврат Новый Структура("Итоги,Заработок,ОтработанноеВремя", Итоги, Заработок, ОтработанноеВремя);
	
КонецФункции

// Возвращает количество учетных дней отпуска.
//
// Параметры:
//		ДатаСобытия					- Дата
//		Месяц						- Дата
//		ОтработаноДнейКалендарных	- Число
//
// Возвращаемое значение:
//		Число
//
Функция КоличествоУчтенныхДнейОтпуска(ДатаСобытия, Месяц, ОтработаноДнейКалендарных) Экспорт
	
	Возврат Окр(КоличествоДнейВМесяцеДляОплатыОтпусков(ДатаСобытия) * (ОтработаноДнейКалендарных / ЗарплатаКадрыКлиентСервер.КоличествоДнейМесяца(Месяц)), 2);
	
КонецФункции

// Возвращает среднее количество дней в месяце для оплаты отпусков.
//
// Параметры:
//		ДатаНачалаСобытия - Дата
//
// Возвращаемое значение:
//		Число
//
Функция КоличествоДнейВМесяцеДляОплатыОтпусков(ДатаНачалаСобытия) Экспорт
	
	Возврат ?(Не ЗначениеЗаполнено(ДатаНачалаСобытия), 29.4, ?(ДатаНачалаСобытия < ДатаИзмененияКоличестваДнейДляОтпускных(), 29.4, 29.3));	

КонецФункции

// Возвращает данные для расчета среднего заработка, для расчета отпусков.
//
// Параметры:
//		Сотрудник				- СправочникСсылка.Сотрудники
//		Организация				- СправочникСсылка.Организации
//		НачалоПериодаРасчета	- Дата
//		ОкончаниеПериодаРасчета - Дата
//
// Возвращаемое значение:
//		Структура
//
Функция ДанныеДляРасчетаОбщегоСреднегоЗаработкаСотрудника(Сотрудник, Организация, НачалоПериодаРасчета, ОкончаниеПериодаРасчета, РазворачиватьПоНачислениям = Ложь) Экспорт
	
	ДанныеДляРасчета = Новый Структура("ДанныеОНачислениях,ДанныеОВремени");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериодаРасчета);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(ВЫБОР
		|				КОГДА ТекущиеКадровыеДанныеСотрудников.ДатаПриема > &НачалоПериода
		|					ТОГДА ТекущиеКадровыеДанныеСотрудников.ДатаПриема
		|				ИНАЧЕ &НачалоПериода
		|			КОНЕЦ, ДЕНЬ)) КАК НачалоПериода,
		|	МАКСИМУМ(КОНЕЦПЕРИОДА(ВЫБОР
		|				КОГДА ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения < &ОкончаниеПериода
		|						И ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения
		|				ИНАЧЕ &ОкончаниеПериода
		|			КОНЕЦ, ДЕНЬ)) КАК ОкончаниеПериода
		|ПОМЕСТИТЬ ВТПериодыРаботыФизическихЛиц
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И ТекущиеКадровыеДанныеСотрудников.Сотрудник = &Сотрудник
		|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <= &ОкончаниеПериода
		|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
		|	И (ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения >= &НачалоПериода
		|			ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))
		|
		|СГРУППИРОВАТЬ ПО
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация";
	
	Запрос.Выполнить();
	
	СоздатьВТНачисленияЗарплаты(Запрос.МенеджерВременныхТаблиц, "ВТНачисления");
	СоздатьВТПериодыОтсутствий(Запрос.МенеджерВременныхТаблиц, "ВТОтсутствияПредварительно");
	
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", РасчетЗарплатыДляНебольшихОрганизацийПовтИсп.ПроизводственныйКалендарьОрганизации(Организация));
	Запрос.УстановитьПараметр("НачисленияИсключения",   ПланыВидовРасчета.Начисления.НачисленияПоОтбору(
		Новый Структура("КатегорияНачисленияИлиНеоплаченногоВремени",  КатегорииОтсутствий()))); 
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Отсутствия.ДатаНачала, МЕСЯЦ) КАК Период,
		|	Отсутствия.Сотрудник КАК Сотрудник,
		|	Отсутствия.ДатаНачала КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА Отсутствия.ДатаОкончания > НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Отсутствия.ДатаНачала, МЕСЯЦ), ДЕНЬ)
		|			ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Отсутствия.ДатаНачала, МЕСЯЦ), ДЕНЬ)
		|		ИНАЧЕ Отсутствия.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончания,
		|	ВЫБОР
		|		КОГДА Отсутствия.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОплачиваемыйОтпуск
		|ПОМЕСТИТЬ ВТОтсутствия
		|ИЗ
		|	ВТОтсутствияПредварительно КАК Отсутствия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ОтсутствияСледующийМесяц.ДатаОкончания, МЕСЯЦ),
		|	ОтсутствияСледующийМесяц.Сотрудник,
		|	НАЧАЛОПЕРИОДА(ОтсутствияСледующийМесяц.ДатаОкончания, МЕСЯЦ),
		|	ОтсутствияСледующийМесяц.ДатаОкончания,
		|	ВЫБОР
		|		КОГДА ОтсутствияСледующийМесяц.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	ВТОтсутствияПредварительно КАК ОтсутствияСледующийМесяц
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ОтсутствияСледующийМесяц.ДатаОкончания, ДЕНЬ) > НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ОтсутствияСледующийМесяц.ДатаНачала, МЕСЯЦ), ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Отсутствия.ДатаНачала КАК ДатаНачала,
		|	ДанныеПроизводственногоКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ ВТРабочиеПраздничныеДни
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтсутствия КАК Отсутствия
		|		ПО (ДанныеПроизводственногоКалендаря.Дата МЕЖДУ Отсутствия.ДатаНачала И Отсутствия.ДатаОкончания)
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|	И ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
		|	И ДанныеПроизводственногоКалендаря.ДатаПереноса = ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Отсутствия.ДатаНачала,
		|	ДанныеПроизводственногоКалендаря.ДатаПереноса
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтсутствия КАК Отсутствия
		|		ПО (ДанныеПроизводственногоКалендаря.ДатаПереноса МЕЖДУ Отсутствия.ДатаНачала И Отсутствия.ДатаОкончания)
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|	И ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
		|	И ДанныеПроизводственногоКалендаря.ДатаПереноса <> ДАТАВРЕМЯ(1, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Отсутствия.ДатаНачала КАК ДатаНачала,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочиеПраздничныеДни.Дата) КАК ДнейПраздников
		|ПОМЕСТИТЬ ВТПраздничныеДниОтсутствий
		|ИЗ
		|	ВТРабочиеПраздничныеДни КАК РабочиеПраздничныеДни
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтсутствия КАК Отсутствия
		|		ПО РабочиеПраздничныеДни.ДатаНачала = Отсутствия.ДатаНачала
		|
		|СГРУППИРОВАТЬ ПО
		|	Отсутствия.ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Отсутствия.Период КАК Период,
		|	Отсутствия.Сотрудник КАК Сотрудник,
		|	СУММА(РАЗНОСТЬДАТ(Отсутствия.ДатаНачала, Отсутствия.ДатаОкончания, ДЕНЬ) + 1) - СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА Отсутствия.ОплачиваемыйОтпуск
		|					ТОГДА ПраздничныеДниОтсутствий.ДнейПраздников
		|				ИНАЧЕ 0
		|			КОНЕЦ, 0)) КАК НеОтработанныеДни
		|ПОМЕСТИТЬ ВТНеОтработанныеДни
		|ИЗ
		|	ВТОтсутствия КАК Отсутствия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПраздничныеДниОтсутствий КАК ПраздничныеДниОтсутствий
		|		ПО Отсутствия.ДатаНачала = ПраздничныеДниОтсутствий.ДатаНачала
		|
		|СГРУППИРОВАТЬ ПО
		|	Отсутствия.Сотрудник,
		|	Отсутствия.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтработанноеВремяПоСотрудникам.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ОтработанноеВремяПоСотрудникам.ОтработаноДней) КАК ОтработаноДней,
		|	ОтработанноеВремяПоСотрудникам.Период КАК Период
		|ПОМЕСТИТЬ ВТОтработанныеДни
		|ИЗ
		|	РегистрНакопления.ОтработанноеВремяПоСотрудникам КАК ОтработанноеВремяПоСотрудникам
		|ГДЕ
		|	ОтработанноеВремяПоСотрудникам.Организация = &Организация
		|	И ОтработанноеВремяПоСотрудникам.Сотрудник = &Сотрудник
		|	И ОтработанноеВремяПоСотрудникам.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И НЕ ОтработанноеВремяПоСотрудникам.Начисление В (&НачисленияИсключения)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтработанноеВремяПоСотрудникам.Сотрудник,
		|	ОтработанноеВремяПоСотрудникам.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.Период КАК Период,
		|	Начисления.Начисление КАК Начисление,
		|	ПериодыРаботыФизическихЛиц.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ПериодыРаботыФизическихЛиц.Сотрудник КАК Сотрудник,
		|	СУММА(ЕСТЬNULL(Начисления.Сумма, 0)) КАК Сумма,
		|	РАЗНОСТЬДАТ(Начисления.ДатаНачала, Начисления.ДатаОкончания, ДЕНЬ) + 1 КАК КалендарныеРабочиеДни,
		|	ЕСТЬNULL(НеОтработанныеКалендарныеДни.НеОтработанныеДни, 0) КАК НеОтработанныеДни,
		|	Начисления.Год КАК Год,
		|	Начисления.ДатаНачалаБазовогоПериода КАК ДатаНачалаБазовогоПериода,
		|	Начисления.КоличествоМесяцев КАК КоличествоМесяцев,
		|	Начисления.СоставнаяЧасть КАК СоставнаяЧасть,
		|	СУММА(ЕСТЬNULL(ОтработанныеДни.ОтработаноДней, 0)) КАК ОтработаноДней
		|ПОМЕСТИТЬ ВТДанныеДляРасчета
		|ИЗ
		|	ВТНачисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНеОтработанныеДни КАК НеОтработанныеКалендарныеДни
		|		ПО Начисления.Период = НеОтработанныеКалендарныеДни.Период
		|			И Начисления.Сотрудник = НеОтработанныеКалендарныеДни.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРаботыФизическихЛиц КАК ПериодыРаботыФизическихЛиц
		|		ПО Начисления.Сотрудник = ПериодыРаботыФизическихЛиц.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтработанныеДни КАК ОтработанныеДни
		|		ПО Начисления.Период = ОтработанныеДни.Период
		|			И Начисления.Сотрудник = ОтработанныеДни.Сотрудник
		|ГДЕ
		|	(Начисления.Год = 0
		|			ИЛИ Начисления.Год = ГОД(ДОБАВИТЬКДАТЕ(&ОкончаниеПериода, МЕСЯЦ, 1)) - 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Период,
		|	Начисления.Начисление,
		|	ПериодыРаботыФизическихЛиц.ГоловнаяОрганизация,
		|	ПериодыРаботыФизическихЛиц.Сотрудник,
		|	РАЗНОСТЬДАТ(Начисления.ДатаНачала, Начисления.ДатаОкончания, ДЕНЬ) + 1,
		|	ЕСТЬNULL(НеОтработанныеКалендарныеДни.НеОтработанныеДни, 0),
		|	Начисления.Год,
		|	Начисления.ДатаНачалаБазовогоПериода,
		|	Начисления.КоличествоМесяцев,
		|	Начисления.СоставнаяЧасть
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.Сотрудник КАК Сотрудник,
		|	Начисления.Сумма КАК Сумма,
		|	Начисления.Начисление КАК Начисление,
		|	Начисления.Период КАК Период,
		|	Начисления.Год КАК Год,
		|	Начисления.ДатаНачалаБазовогоПериода КАК ДатаНачалаБазовогоПериода,
		|	Начисления.КоличествоМесяцев КАК КоличествоМесяцев,
		|	Начисления.СоставнаяЧасть КАК СоставнаяЧасть
		|ИЗ
		|	ВТНачисления КАК Начисления
		|ГДЕ
		|	(Начисления.Год = 0
		|			ИЛИ Начисления.Год = ГОД(ДОБАВИТЬКДАТЕ(&ОкончаниеПериода, МЕСЯЦ, 1)) - 1)";
	
	ДанныеДляРасчета.ДанныеОНачислениях = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДляРасчета.Период КАК Период,
		|	ДанныеДляРасчета.КалендарныеРабочиеДни - ДанныеДляРасчета.НеОтработанныеДни КАК ОтработаноДнейКалендарных,
		|	ДанныеДляРасчета.ОтработаноДней КАК ОтработаноДнейПятидневка
		|ПОМЕСТИТЬ ВТДанныеОВремени
		|ИЗ
		|	ВТДанныеДляРасчета КАК ДанныеДляРасчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДляРасчета.Период,
		|	ДанныеДляРасчета.ОтработаноДней,
		|	ДанныеДляРасчета.КалендарныеРабочиеДни - ДанныеДляРасчета.НеОтработанныеДни
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТДанныеОВремени.Период КАК Период,
		|	ВТДанныеОВремени.ОтработаноДнейКалендарных КАК ОтработаноДнейКалендарных,
		|	ВТДанныеОВремени.ОтработаноДнейПятидневка КАК ОтработаноДнейПятидневка,
		|	СУММА(ВЫБОР
		|			КОГДА ДанныеПроизводственногоКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НормаДнейПроизводственныйКалендарь
		|ИЗ
		|	ВТДанныеОВремени КАК ВТДанныеОВремени
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|		ПО (ВТДанныеОВремени.Период = НАЧАЛОПЕРИОДА(ДанныеПроизводственногоКалендаря.Дата, МЕСЯЦ))
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТДанныеОВремени.Период,
		|	ВТДанныеОВремени.ОтработаноДнейКалендарных,
		|	ВТДанныеОВремени.ОтработаноДнейПятидневка";
	
	ДанныеДляРасчета.ДанныеОВремени = Запрос.Выполнить().Выгрузить();
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, НачалоПериодаРасчета, ОкончаниеПериодаРасчета);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Периоды.Период КАК Месяц
		|ПОМЕСТИТЬ ВТНедостающиеМесяцы
		|ИЗ
		|	ВТПериоды КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисления КАК Начисления
		|		ПО Периоды.Период = Начисления.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДляРасчета КАК ДанныеДляРасчета
		|		ПО Периоды.Период = ДанныеДляРасчета.Период
		|ГДЕ
		|	Начисления.Период ЕСТЬ NULL
		|	И ДанныеДляРасчета.Период ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если ЗарплатаКадры.ВТСодержитСтроки(Запрос.МенеджерВременныхТаблиц, "ВТНедостающиеМесяцы") Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ОтпускСреднийЗаработокОбщий.Ссылка,
			|	ОтпускСреднийЗаработокОбщий.Ссылка.Дата,
			|	ОтпускСреднийЗаработокОбщий.Период
			|ПОМЕСТИТЬ ВТДокументыДаты
			|ИЗ
			|	Документ.Отпуск.СреднийЗаработокОбщий КАК ОтпускСреднийЗаработокОбщий
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНедостающиеМесяцы КАК НедостающиеМесяцы
			|		ПО ОтпускСреднийЗаработокОбщий.Период = НедостающиеМесяцы.Месяц
			|ГДЕ
			|	ОтпускСреднийЗаработокОбщий.Ссылка.Проведен
			|	И ОтпускСреднийЗаработокОбщий.Ссылка.Сотрудник = &Сотрудник
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОтпускОтработанноеВремяДляСреднегоОбщий.Ссылка,
			|	ОтпускОтработанноеВремяДляСреднегоОбщий.Ссылка.Дата,
			|	ОтпускОтработанноеВремяДляСреднегоОбщий.Период
			|ИЗ
			|	Документ.Отпуск.ОтработанноеВремяДляСреднегоОбщий КАК ОтпускОтработанноеВремяДляСреднегоОбщий
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНедостающиеМесяцы КАК НедостающиеМесяцы
			|		ПО ОтпускОтработанноеВремяДляСреднегоОбщий.Период = НедостающиеМесяцы.Месяц
			|ГДЕ
			|	ОтпускОтработанноеВремяДляСреднегоОбщий.Ссылка.Проведен
			|	И ОтпускОтработанноеВремяДляСреднегоОбщий.Ссылка.Сотрудник = &Сотрудник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДокументыДаты.Период,
			|	МАКСИМУМ(ДокументыДаты.Дата) КАК Дата
			|ПОМЕСТИТЬ ВТПоследниеДатыПериодов
			|ИЗ
			|	ВТДокументыДаты КАК ДокументыДаты
			|
			|СГРУППИРОВАТЬ ПО
			|	ДокументыДаты.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ДокументыДаты.Ссылка) КАК Ссылка,
			|	ДокументыДаты.Период
			|ПОМЕСТИТЬ ВТДокументыПериодов
			|ИЗ
			|	ВТПоследниеДатыПериодов КАК ПоследниеДатыПериодов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыДаты КАК ДокументыДаты
			|		ПО ПоследниеДатыПериодов.Период = ДокументыДаты.Период
			|			И ПоследниеДатыПериодов.Дата = ДокументыДаты.Дата
			|
			|СГРУППИРОВАТЬ ПО
			|	ДокументыДаты.Период";
		
		Запрос.Выполнить();
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ОтпускСреднийЗаработокОбщий.Сотрудник КАК Сотрудник,
			|	ОтпускСреднийЗаработокОбщий.Период КАК Период,
			|	ОтпускСреднийЗаработокОбщий.Начисление КАК Начисление,
			|	ОтпускСреднийЗаработокОбщий.Сумма КАК Сумма,
			|	ОтпускСреднийЗаработокОбщий.Год КАК Год,
			|	ОтпускСреднийЗаработокОбщий.ДатаНачалаБазовогоПериода КАК ДатаНачалаБазовогоПериода,
			|	ОтпускСреднийЗаработокОбщий.КоличествоМесяцев КАК КоличествоМесяцев,
			|	ОтпускСреднийЗаработокОбщий.СоставнаяЧасть КАК СоставнаяЧасть
			|ИЗ
			|	Документ.Отпуск.СреднийЗаработокОбщий КАК ОтпускСреднийЗаработокОбщий
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыПериодов КАК ВТДокументыПериодов
			|		ПО ОтпускСреднийЗаработокОбщий.Ссылка = ВТДокументыПериодов.Ссылка
			|			И ОтпускСреднийЗаработокОбщий.Период = ВТДокументыПериодов.Период";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ДанныеДляРасчета.ДанныеОНачислениях.Добавить(), Выборка);
			КонецЦикла;
			
		КонецЕсли;
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ОтпускОтработанноеВремяДляСреднегоОбщий.Период КАК Период,
			|	ОтпускОтработанноеВремяДляСреднегоОбщий.ОтработаноДнейКалендарных КАК ОтработаноДнейКалендарных,
			|	ОтпускОтработанноеВремяДляСреднегоОбщий.НормаДнейПроизводственныйКалендарь КАК НормаДнейПроизводственныйКалендарь,
			|	ОтпускОтработанноеВремяДляСреднегоОбщий.ОтработаноДнейПятидневка КАК ОтработаноДнейПятидневка
			|ИЗ
			|	Документ.Отпуск.ОтработанноеВремяДляСреднегоОбщий КАК ОтпускОтработанноеВремяДляСреднегоОбщий
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыПериодов КАК ДокументыПериодов
			|		ПО ОтпускОтработанноеВремяДляСреднегоОбщий.Ссылка = ДокументыПериодов.Ссылка
			|			И ОтпускОтработанноеВремяДляСреднегоОбщий.Период = ДокументыПериодов.Период";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ДанныеДляРасчета.ДанныеОВремени.Добавить(), Выборка);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не РазворачиватьПоНачислениям Тогда
		ДанныеДляРасчета.ДанныеОНачислениях.Свернуть("Сотрудник,Период", "Сумма");
	КонецЕсли;
	
	Возврат ДанныеДляРасчета;
	
КонецФункции

// Возвращает коэффициент отработанного времени используемый для нормирования премий при расчете среднего заработка.
//
Функция ДоляОтработанногоВремени(ОтработанноеВремя) Экспорт
	
	ДоляОтработанногоВремени = 1;
	
	Норма = 0;
	Отработано = 0;
	
	Норма = ИтогиПоПолю(ОтработанноеВремя, "НормаПятидневка");
	Отработано = ИтогиПоПолю(ОтработанноеВремя, "ОтработаноПятидневка");
	
	Если Норма > 0 Тогда
		ДоляОтработанногоВремени = Отработано / Норма;
	КонецЕсли;
	
	Возврат Окр(ДоляОтработанногоВремени, 8);
	
КонецФункции

Функция ЭтоПремияПроцентом(СоставнаяЧастьЗаработка)
	Возврат СоставнаяЧастьЗаработка = ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом") 
			Или СоставнаяЧастьЗаработка = ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом");
КонецФункции 

Функция ЭтоПремияФиксированнойСуммой(СоставнаяЧастьЗаработка)
	Возврат СоставнаяЧастьЗаработка = ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой") 
			Или СоставнаяЧастьЗаработка = ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой");
КонецФункции 

Функция ЭтоПремияГодовая(СоставнаяЧастьЗаработка)
	Возврат СоставнаяЧастьЗаработка = ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом") 
			Или СоставнаяЧастьЗаработка = ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой");
КонецФункции 

Функция ПремияНачисленаЗаВремяНеВходящееВРасчетныйПериод(СтрокаНачислений, ДатаНачалаПериода, ДатаОкончанияПериода)
	
	ПремияНачисленаЗаВремяНеВходящееВРасчетныйПериод = Ложь;
	
	Если ЗначениеЗаполнено(СтрокаНачислений.ДатаНачалаБазовогоПериода) Тогда
		Если СтрокаНачислений.ДатаНачалаБазовогоПериода < ДатаНачалаПериода 
			Или СтрокаНачислений.ДатаНачалаБазовогоПериода > ДатаОкончанияПериода Тогда
			ПремияНачисленаЗаВремяНеВходящееВРасчетныйПериод = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПремияНачисленаЗаВремяНеВходящееВРасчетныйПериод
	
КонецФункции 

Функция РассчитатьПремиюПоПроценту(Объект, ПроцентПремии) Экспорт
	
	РезультатРасчета = Новый Соответствие;
	
	КатегорииНачислений = Новый Массив;
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",          Объект.Организация);
	Запрос.УстановитьПараметр("ДатаНачалаПериода",    Объект.ДатаНачалаБазовогоПериода);
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", КонецМесяца(Объект.ДатаОкончанияБазовогоПериода));
	Запрос.УстановитьПараметр("Сотрудники",           ОбщегоНазначения.ВыгрузитьКолонку(Объект.Начисления, "Сотрудник", Истина));
	Запрос.УстановитьПараметр("КатегорииНачислений",  КатегорииНачислений);
	Запрос.УстановитьПараметр("ПроцентПремии",        ПроцентПремии);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленияУдержанияПоСотрудникам.Сотрудник КАК Сотрудник,
	|	СУММА(НачисленияУдержанияПоСотрудникам.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
	|		ПО НачисленияУдержанияПоСотрудникам.НачислениеУдержание = Начисления.Ссылка
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникам.ПериодДействия МЕЖДУ &ДатаНачалаПериода И &ДатаОкончанияПериода
	|	И НачисленияУдержанияПоСотрудникам.Организация = &Организация
	|	И НачисленияУдержанияПоСотрудникам.Сотрудник В(&Сотрудники)
	|	И НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
	|	И НачисленияУдержанияПоСотрудникам.ДокументОснование = НЕОПРЕДЕЛЕНО
	|	И Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииНачислений)
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияУдержанияПоСотрудникам.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ВЫРАЗИТЬ(ВТ_Сотрудники.Сумма * &ПроцентПремии /100 КАК ЧИСЛО(15, 2)) КАК Сумма
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РезультатРасчета.Вставить(Выборка.Сотрудник, Выборка.Сумма);
	КонецЦикла;
	
	Возврат РезультатРасчета;
	
КонецФункции

// Возвращает признак того, что в месяце начисления есть работающие сотрудники
//
// Параметры;
//		МесяцНачисления	- Дата
//		Организация		- СправочникСсылка.Организации
//		Подразделение	- СправочникСсылка.ПодразделенияОрганизаций, Неопределено
//
// Возвращаемое значение:
//		Булево - Истина, если в месяце начисления есть работающие сотрудники
//
Функция ВМесяцеНачисленияЕстьРаботавшиеСотрудники(МесяцНачисления, Организация, Подразделение = Неопределено) Экспорт
	
	Результат = Ложь;
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.Организация = Организация;
	ПараметрыПолученияСотрудников.Подразделение = Подразделение;
	ПараметрыПолученияСотрудников.НачалоПериода = МесяцНачисления;
	ПараметрыПолученияСотрудников.ОкончаниеПериода = КонецМесяца(МесяцНачисления);
	ПараметрыПолученияСотрудников.КадровыеДанные = "ДатаПриема,ДатаЗавершенияРаботы";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников);
	
	Если ЗарплатаКадры.ВТСодержитСтроки(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОрганизации") Тогда
		
		Запрос.УстановитьПараметр("КатегорииОтсутствий", КатегорииОтсутствий());
		Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
			|	ВЫБОР
			|		КОГДА СотрудникиОрганизации.ДатаПриема > &МесяцНачисления
			|			ТОГДА СотрудникиОрганизации.ДатаПриема
			|		ИНАЧЕ &МесяцНачисления
			|	КОНЕЦ КАК ДатаНачала,
			|	ВЫБОР
			|		КОГДА СотрудникиОрганизации.ДатаЗавершенияРаботы <> ДАТАВРЕМЯ(1, 1, 1)
			|				И СотрудникиОрганизации.ДатаЗавершенияРаботы < НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ДЕНЬ)
			|			ТОГДА СотрудникиОрганизации.ДатаЗавершенияРаботы
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ДЕНЬ)
			|	КОНЕЦ КАК ДатаОкончания,
			|	НачисленияУдержанияПоСотрудникам.ДатаНачала КАК ДатаНачалаОтсутствия,
			|	НачисленияУдержанияПоСотрудникам.ДатаОкончания КАК ДатаОкончанияОтсутствий
			|ИЗ
			|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
			|		ПО СотрудникиОрганизации.Сотрудник = НачисленияУдержанияПоСотрудникам.Сотрудник
			|			И (НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.ДатаНачала, МЕСЯЦ) = &МесяцНачисления)
			|			И (НачисленияУдержанияПоСотрудникам.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииОтсутствий))
			|
			|УПОРЯДОЧИТЬ ПО
			|	Сотрудник";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.ДатаНачалаОтсутствия) Тогда
				
				Результат = Истина;
				Прервать;
				
			КонецЕсли;
			
			РабочихДнейЧасов = РабочихДнейЧасовВПериодеОрганизации(Выборка.ДатаНачала, Выборка.ДатаОкончания, Организация);
			
			РабочихДней = 0;
			Пока Выборка.Следующий() Цикл
				
				РабочихДнейЧасовВПериоде = РабочихДнейЧасовВПериодеОрганизации(Выборка.ДатаНачалаОтсутствия, Выборка.ДатаОкончанияОтсутствий, Организация);
				РабочихДней = РабочихДней + РабочихДнейЧасовВПериоде.Дней;
				
			КонецЦикла;
			
			Если РабочихДнейЧасов.Дней <> РабочихДней Тогда
				
				Результат = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоДатаВыплатыАванса(Знач Организация, Знач МесяцНачисления, Знач Дата) Экспорт
	
	ДатыВыплаты = РасчетЗарплатыДляНебольшихОрганизацийПовтИсп.ДатыВыплатыОрганизации(Организация, МесяцНачисления);
	МесяцНачисления = НачалоМесяца(МесяцНачисления);
	Дата = НачалоДня(Дата);
	
	Если МесяцНачисления > КонецМесяца(Дата) Тогда
		Возврат Истина;
	ИначеЕсли МесяцНачисления = НачалоМесяца(Дата) И Дата <= ДатыВыплаты.Аванс Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ДополнитьРезультатНачисленияПоДоговорам(Объект) Экспорт
	
	Если Не ОрганизацияПрименяетАУСН(Объект.Организация, Объект.МесяцНачисления) Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаНачисления Из Объект.НачисленияПоДоговорам Цикл
		СтрокаНачисления.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН;
	КонецЦикла;
	
КонецПроцедуры

Функция ДатаСобытияСУчетомНерабочихДней(ДатаСобытия, Организация, ДатаНакануне = Истина) Экспорт

	ДатаСобытияСУчетомНерабочихДней = ДатаСобытия;

	Даты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДатаСобытия);
	КалендарьОрганизации = РасчетЗарплатыДляНебольшихОрганизацийПовтИсп.КалендарьОрганизации(Организация);
		
	Если ТипЗнч(КалендарьОрганизации) <> Тип("СправочникСсылка.ПроизводственныеКалендари") Тогда
		Параметры = ГрафикиРаботы.ПараметрыПолученияБлижайшихДатПоГрафику();
		Параметры.ПолучатьПредшествующие = ДатаНакануне;
		ДатыРабочихДней = ГрафикиРаботы.БлижайшиеДатыВключенныеВГрафик(КалендарьОрганизации, Даты, Параметры);
	Иначе
		Параметры = КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат();
		Параметры.ПолучатьПредшествующие              = ДатаНакануне;
		Параметры.ПолучатьДатыЕслиКалендарьНеЗаполнен = Истина;
		ДатыРабочихДней = КалендарныеГрафики.БлижайшиеРабочиеДаты(КалендарьОрганизации, Даты, Параметры);
	КонецЕсли;
	
	Если ДатыРабочихДней <> Неопределено Тогда
		ДатаСобытияСУчетомНерабочихДней = ДатыРабочихДней.Получить(НачалоДня(ДатаСобытия));
	КонецЕсли;
	
	Возврат ДатаСобытияСУчетомНерабочихДней;
	
КонецФункции

Функция КоличествоДнейКомпенсацииУдержанияОтпуска(Организация, Сотрудник, Период) Экспорт
	
	СведенияПоОтпуску = Новый Структура();
	СведенияПоОтпуску.Вставить("ДнейКомпенсацииУдержанияОтпуска", 0);
	СведенияПоОтпуску.Вставить("РабочийГодС",                     Дата(1,1,1));
	СведенияПоОтпуску.Вставить("РабочийГодПо",                    Дата(1,1,1));
	
	РасчетЗарплатыДляНебольшихОрганизацийПереопределяемый.РассчитатьКоличествоДнейКомпенсацииУдержанияОтпуска(Организация, Сотрудник, Период, СведенияПоОтпуску);
	
	Возврат СведенияПоОтпуску;
	
КонецФункции

Функция КоличествоПраздничныхДнейКалендаря(Календарь, ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Календарь", Календарь);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &Календарь
	|	И ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Дата").Количество();
	
КонецФункции

Функция КалендарныеДниМесяцаБезПраздников(Календарь, Период) Экспорт
	
	КоличествоПраздничныхДней = КоличествоПраздничныхДнейКалендаря(Календарь, НачалоМесяца(Период), КонецМесяца(Период));
	КалендарныеДниМесяцаБезПраздников = День(КонецМесяца(Период)) - КоличествоПраздничныхДней;
	
	Возврат КалендарныеДниМесяцаБезПраздников;
	
КонецФункции

// Функция определяет состав видов удержания НДФЛ, 
//	исключаемых из состава расчетной базы.
//
Функция ВидыНДФЛДополненияРасчетнойБазыУдержаний() Экспорт 
	
	ВидыНачислений = Перечисления.ВидыОсобыхНачисленийИУдержаний.СтрокиИсчисленныхНалогов();
	ВидыНачислений.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛДоходыКонтрагентов);
	ВидыНачислений.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛПрочиеРасчетыСПерсоналом);
	ВидыНачислений.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НФДЛДивиденды);
	ВидыНачислений.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НФДЛДивидендыСотрудникам);
	ВидыНачислений.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛРасчетыСБывшимиСотрудниками);
	
	Возврат ВидыНачислений;
	
КонецФункции

// Функция вычисляет итоговое значение колонки переданной коллекции
//
Функция ИтогиПоПолю(Коллекция, ИмяПоля, Отбор = Неопределено) Экспорт
	
	ИтогиПоПолю = 0;
	
	Для Каждого Элемент Из Коллекция Цикл
		Если Отбор <> Неопределено Тогда 
			СоответствуетОтбору = Истина;
			Для Каждого КлючИЗначение Из Отбор Цикл 
				Если Элемент[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда 
					СоответствуетОтбору = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не СоответствуетОтбору Тогда 
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ИтогиПоПолю = ИтогиПоПолю + Элемент[ИмяПоля]; 
	КонецЦикла;
	
	Возврат ИтогиПоПолю;
	
КонецФункции

Функция ДополнительныеПараметрыРегистрацииДанныхСреднегоЗаработка(ИменаТаблиц = "Начисления") Экспорт
	
	МассивИмен = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаТаблиц);
	
	ДополнительныеПараметры = Новый Структура(
		"МесяцНачисления,
		|Таблицы");
	ДополнительныеПараметры.МесяцНачисления = "Ссылка.МесяцНачисления";
	
	ДополнительныеПараметры.Таблицы = Новый Структура;
	Для Каждого ИмяТаблицы Из МассивИмен Цикл
		ИменаПолей = Новый Структура(
			"ДатаДействия,
			|ПериодДействия,
			|Начисление,
			|НачалоБазовогоПериода, 
			|ОкончаниеБазовогоПериода,
			|ДатаНачала, 
			|ДатаОкончания");
		ИменаПолей.ДатаДействия = "ДатаНачала";
		ИменаПолей.ПериодДействия = "ПериодДействия";
		ИменаПолей.Начисление = "Начисление";
		ИменаПолей.НачалоБазовогоПериода = "ДатаНачала";
		ИменаПолей.ОкончаниеБазовогоПериода = "ДатаОкончания";
		ИменаПолей.ДатаНачала = "ДатаНачала";
		ИменаПолей.ДатаОкончания = "ДатаОкончания";
		ДополнительныеПараметры.Таблицы.Вставить(ИмяТаблицы, ИменаПолей);
	КонецЦикла;
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Процедура ЗаполнитьТаблицыДляРегистрацииДанныхСреднегоЗаработка(ДанныеДляПроведения, ДокументСсылка, СписокФизическихЛиц = Неопределено) Экспорт

	ДополнительныеПараметры = ДополнительныеПараметрыРегистрацииДанныхСреднегоЗаработка("Начисления,ЗависимыеНачисления");
	
	ДанныеДляПроведения.НачисленияДляСреднегоЗаработка = ПустаяТаблицаДляРегистрацииДанныхСреднегоЗаработка();
	
	// Метаданные документа используем для обращения к таблице.
	МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипЗнч(ДокументСсылка));
	
	ДополнительныеПараметры.МесяцНачисления = "Ссылка.ПериодРегистрации";
	ДополнительныеПараметры.Таблицы.Начисления.ДатаДействия = "Ссылка.ПериодРегистрации";
	ДополнительныеПараметры.Таблицы.Начисления.ПериодДействия = "Ссылка.ПериодРегистрации";
	ДополнительныеПараметры.Таблицы.Начисления.Начисление = "Ссылка.ВидПремии";
	ДополнительныеПараметры.Таблицы.Начисления.НачалоБазовогоПериода = "Ссылка.ДатаНачалаБазовогоПериода";
	ДополнительныеПараметры.Таблицы.Начисления.ОкончаниеБазовогоПериода = "Ссылка.ДатаОкончанияБазовогоПериода";
	
	ДополнительныеПараметры.Таблицы.ЗависимыеНачисления.ДатаДействия = "Ссылка.ПериодРегистрации";
	ДополнительныеПараметры.Таблицы.ЗависимыеНачисления.ПериодДействия = "Ссылка.ПериодРегистрации";
	ДополнительныеПараметры.Таблицы.ЗависимыеНачисления.НачалоБазовогоПериода = "Ссылка.ДатаНачалаБазовогоПериода";
	ДополнительныеПараметры.Таблицы.ЗависимыеНачисления.ОкончаниеБазовогоПериода = "Ссылка.ДатаОкончанияБазовогоПериода";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	// Составляем текст запроса создания временной таблицы.
	ТекстЗапроса = "";
	ПерваяТаблица = Истина;
	Для Каждого КлючИЗначение Из ДополнительныеПараметры.Таблицы Цикл
		ИмяТаблицы = КлючИЗначение.Ключ;
		ИменаПолей = КлючИЗначение.Значение;
		
		МетаданныеТаблицы = МетаданныеДокумента.ТабличныеЧасти[ИмяТаблицы];
		
		Если Не ПерваяТаблица Тогда
			ТекстЗапроса = ТекстЗапроса + "
				|ОБЪЕДИНИТЬ ВСЕ
				|";
		КонецЕсли;
		ТекстОбъединения = 
			"ВЫБРАТЬ
			|	ТаблицаНачислений.Ссылка КАК ДокументСсылка,
			|	ТаблицаНачислений.ДатаДействия КАК ДатаДействия,
			|	ТаблицаНачислений.ПериодДействия КАК ПериодДействия,
			|	ТаблицаНачислений.МесяцНачисления КАК МесяцНачисления,
			|	ТаблицаНачислений.Начисление КАК Начисление,
			|	ТаблицаНачислений.НачалоБазовогоПериода КАК НачалоБазовогоПериода,
			|	ТаблицаНачислений.ОкончаниеБазовогоПериода КАК ОкончаниеБазовогоПериода,
			|	ТаблицаНачислений.ДатаНачала КАК ДатаНачала,
			|	ТаблицаНачислений.ДатаОкончания КАК ДатаОкончания,
			|	ТаблицаНачислений.НомерСтроки КАК НомерСтроки,
			|	ТаблицаНачислений.Сотрудник КАК Сотрудник,
			|	ТаблицаНачислений.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ТаблицаНачислений.Ссылка.Организация КАК Организация,
			|	ТаблицаНачислений.Результат КАК Сумма,
			|	ТаблицаНачислений.Подразделение КАК Подразделение,
			|	ТаблицаНачислений.ДокументОснование КАК ДокументОснование,
			|	ТаблицаНачислений.ИсходныйДокумент КАК ИсходныйДокумент
			|ПОМЕСТИТЬ ВТЗаписиНачислений
			|ИЗ
			|	#ТаблицаНачислений КАК ТаблицаНачислений
			|ГДЕ
			|	ТаблицаНачислений.Ссылка = &ДокументСсылка";
		
		Если СписокФизическихЛиц <> Неопределено Тогда
			
			ТекстОбъединения = ТекстОбъединения + "
				|	И ТаблицаНачислений.Сотрудник.ФизическоеЛицо В (&СписокФизическихЛиц)";
			
		КонецЕсли;
		
		Если Не ПерваяТаблица Тогда
			
			ТекстОбъединения = СтрЗаменить(ТекстОбъединения, "ПОМЕСТИТЬ ВТЗаписиНачислений", "");
			
			Если СписокФизическихЛиц <> Неопределено Тогда
				Запрос.УстановитьПараметр("СписокФизическихЛиц", СписокФизическихЛиц);
			КонецЕсли;
			
		КонецЕсли;
		
		ТекстОбъединения = СтрЗаменить(ТекстОбъединения, "#ТаблицаНачислений", МетаданныеДокумента.ПолноеИмя() + "." + ИмяТаблицы);
		Для Каждого КлючИЗначениеПолей Из ИменаПолей Цикл
			ИмяПоля = КлючИЗначениеПолей.Ключ;
			ТекстОбращения = КлючИЗначениеПолей.Значение;
			Если ТекстОбращения = Неопределено Тогда
				ТекстОбъединения = СтрЗаменить(ТекстОбъединения, "ТаблицаНачислений." + ИмяПоля + " КАК " + ИмяПоля, "НЕОПРЕДЕЛЕНО КАК " + ИмяПоля);
			Иначе
				Если СтрНачинаетсяС(ТекстОбращения, "#") Тогда
					НовыйТекст = Сред(ТекстОбращения, 2) + " КАК " + ИмяПоля;
				Иначе
					НовыйТекст = "ТаблицаНачислений." + ТекстОбращения + " КАК " + ИмяПоля;
				КонецЕсли;
				ТекстОбъединения = СтрЗаменить(ТекстОбъединения, "ТаблицаНачислений." + ИмяПоля + " КАК " + ИмяПоля, НовыйТекст);
			КонецЕсли;
		КонецЦикла;
		ТекстОбъединения = СтрЗаменить(ТекстОбъединения, "ТаблицаНачислений.МесяцНачисления КАК МесяцНачисления", "ТаблицаНачислений." + ДополнительныеПараметры.МесяцНачисления + " КАК МесяцНачисления");
		РеквизитыТабличнойЧасти = МетаданныеТаблицы.Реквизиты;
		Если РеквизитыТабличнойЧасти.Найти("ДокументОснование") = Неопределено Тогда
			ТекстОбъединения = СтрЗаменить(ТекстОбъединения, "ТаблицаНачислений.ДокументОснование КАК ДокументОснование", "НЕОПРЕДЕЛЕНО КАК ДокументОснование");
		КонецЕсли;
		Если РеквизитыТабличнойЧасти.Найти("ИсходныйДокумент") = Неопределено Тогда
			ТекстОбъединения = СтрЗаменить(ТекстОбъединения, "ТаблицаНачислений.ИсходныйДокумент КАК ИсходныйДокумент", "НЕОПРЕДЕЛЕНО КАК ИсходныйДокумент");
		КонецЕсли;
		
		// Добавляем объединение в общий запрос.
		ТекстЗапроса = ТекстЗапроса + ТекстОбъединения;
		ПерваяТаблица = Ложь;
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка) КАК СтатьяФинансирования,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка) КАК СтатьяРасходов,
		|	ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка) КАК СпособОтраженияЗарплатыВБухучете,
		|	ЛОЖЬ КАК ОблагаетсяЕНВД,
		|	ЗаписиНачислений.Сумма КАК Сумма,
		|	ЗаписиНачислений.*
		|ИЗ
		|	ВТЗаписиНачислений КАК ЗаписиНачислений";
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	// Проверяем тип регистратора
	Если Не ДанныеДляПроведения.НачисленияДляСреднегоЗаработка.Колонки.ДокументСсылка.ТипЗначения.СодержитТип(ТипЗнч(ДокументСсылка)) Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Тип «%1» не включен в состав типов колонки ДокументСсылка таблицы для регистрации данных среднего заработка.'"),
			ТипЗнч(ДокументСсылка));
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеДляПроведения.НачисленияДляСреднегоЗаработка.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

Функция ПустаяТаблицаДляРегистрацииДанныхСреднегоЗаработка() Экспорт
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	ТипыРегистраторов = Новый Массив;
	ТипыРегистраторов.Добавить(Тип("ДокументСсылка.Премия"));
	
	ТаблицаДанных.Колонки.Добавить("ДокументСсылка", Новый ОписаниеТипов(ТипыРегистраторов));
	
	ТаблицаДанных.Колонки.Добавить("ДатаДействия", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("ПериодДействия", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("МесяцНачисления", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("НачалоБазовогоПериода", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("ОкончаниеБазовогоПериода", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаДанных.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаДанных.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("Начисление", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления, ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний"));
	ТаблицаДанных.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"), Новый КвалификаторыЧисла(15, 2));
	ТаблицаДанных.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("СтатьяФинансирования", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ТаблицаДанных.Колонки.Добавить("СпособОтраженияЗарплатыВБухучете", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете"));
	ТаблицаДанных.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("СправочникСсылка.СтатьиРасходовЗарплата"));
	ТаблицаДанных.Колонки.Добавить("ОблагаетсяЕНВД", Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ЗарегистрироватьДанныеСреднегоЗаработка(Движения, Отказ, Начисления, ЗаписыватьДвижения = Ложь) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТНачисленияПоТаблицеНачисления(МенеджерВременныхТаблиц, Начисления);
	ЗарегистрироватьДанныеОбщегоСреднегоЗаработка(Движения, Отказ, МенеджерВременныхТаблиц, ЗаписыватьДвижения);
	
КонецПроцедуры

Процедура СоздатьВТНачисленияПоТаблицеНачисления(МенеджерВременныхТаблиц, Начисления)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Начисления", Начисления);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Начисления.ДокументСсылка КАК ДокументСсылка,
		|	Начисления.Сотрудник КАК Сотрудник,
		|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Начисления.Организация КАК Организация,
		|	Начисления.Начисление КАК Начисление,
		|	Начисления.ДатаДействия КАК ДатаДействия,
		|	Начисления.МесяцНачисления КАК МесяцНачисления,
		|	Начисления.ПериодДействия КАК ПериодДействия,
		|	Начисления.ДатаНачала КАК ДатаНачала,
		|	Начисления.ДатаОкончания КАК ДатаОкончания,
		|	Начисления.НачалоБазовогоПериода КАК НачалоБазовогоПериода,
		|	Начисления.ОкончаниеБазовогоПериода КАК ОкончаниеБазовогоПериода,
		|	Начисления.Сумма КАК Сумма,
		|	Начисления.Подразделение КАК Подразделение,
		|	Начисления.НомерСтроки КАК НомерСтроки,
		|	Начисления.СтатьяФинансирования КАК СтатьяФинансирования,
		|	Начисления.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	Начисления.СтатьяРасходов КАК СтатьяРасходов,
		|	Начисления.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД
		|ПОМЕСТИТЬ ВТНачисленияПредварительно
		|ИЗ
		|	&Начисления КАК Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияПредварительно.ДокументСсылка КАК ДокументСсылка,
		|	НачисленияПредварительно.Сотрудник КАК Сотрудник,
		|	НачисленияПредварительно.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияПредварительно.Организация КАК Организация,
		|	НачисленияПредварительно.Начисление КАК Начисление,
		|	НачисленияПредварительно.ДатаДействия КАК ДатаДействия,
		|	НачисленияПредварительно.МесяцНачисления КАК МесяцНачисления,
		|	НачисленияПредварительно.ПериодДействия КАК ПериодДействия,
		|	НачисленияПредварительно.ДатаНачала КАК ДатаНачала,
		|	НачисленияПредварительно.ДатаОкончания КАК ДатаОкончания,
		|	НачисленияПредварительно.НачалоБазовогоПериода КАК НачалоБазовогоПериода,
		|	НачисленияПредварительно.ОкончаниеБазовогоПериода КАК ОкончаниеБазовогоПериода,
		|	СУММА(НачисленияПредварительно.Сумма) КАК Сумма,
		|	НачисленияПредварительно.НомерСтроки КАК НомерСтроки,
		|	НачисленияПредварительно.СтатьяФинансирования КАК СтатьяФинансирования,
		|	НачисленияПредварительно.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	НачисленияПредварительно.СтатьяРасходов КАК СтатьяРасходов,
		|	НачисленияПредварительно.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД
		|ПОМЕСТИТЬ ВТНачисления
		|ИЗ
		|	ВТНачисленияПредварительно КАК НачисленияПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияПредварительно.ДокументСсылка,
		|	НачисленияПредварительно.Сотрудник,
		|	НачисленияПредварительно.ФизическоеЛицо,
		|	НачисленияПредварительно.Организация,
		|	НачисленияПредварительно.Начисление,
		|	НачисленияПредварительно.ДатаДействия,
		|	НачисленияПредварительно.МесяцНачисления,
		|	НачисленияПредварительно.ПериодДействия,
		|	НачисленияПредварительно.ДатаНачала,
		|	НачисленияПредварительно.ДатаОкончания,
		|	НачисленияПредварительно.НачалоБазовогоПериода,
		|	НачисленияПредварительно.ОкончаниеБазовогоПериода,
		|	НачисленияПредварительно.НомерСтроки,
		|	НачисленияПредварительно.СтатьяФинансирования,
		|	НачисленияПредварительно.СпособОтраженияЗарплатыВБухучете,
		|	НачисленияПредварительно.СтатьяРасходов,
		|	НачисленияПредварительно.ОблагаетсяЕНВД";
		
	Запрос.Выполнить();
	
	ИменаВТ = Новый Массив;
	ИменаВТ.Добавить("ВТНачисленияПредварительно");
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, ИменаВТ);
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеОбщегоСреднегоЗаработка(Движения, Отказ, МенеджерВременныхТаблиц, ЗаписыватьДвижения = Ложь)
	
	ЗарегистрироватьНачисленияДляРасчетаОбщегоСреднегоЗаработка(Движения, Отказ, МенеджерВременныхТаблиц, ЗаписыватьДвижения);
	
КонецПроцедуры

Процедура ЗарегистрироватьНачисленияДляРасчетаОбщегоСреднегоЗаработка(Движения, Отказ, МенеджерВременныхТаблиц, ЗаписыватьДвижения = Ложь)
	
	Регистратор = Движения.ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Отбор.Регистратор.Значение;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КОНЕЦПЕРИОДА(Начисления.МесяцНачисления, МЕСЯЦ) КАК Период,
	               |	Начисления.Сотрудник КАК Сотрудник
	               |ПОМЕСТИТЬ ВТСписокСотрудников
	               |ИЗ
	               |	ВТНачисления КАК Начисления";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		Запрос.МенеджерВременныхТаблиц, "ВТСписокСотрудников");
	
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, "ДатаПриема");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Начисления.ДатаДействия КАК ДатаДействия,
		|	Начисления.ПериодДействия КАК ПериодДействия,
		|	Начисления.ДатаНачала КАК ДатаНачала,
		|	Начисления.ДатаОкончания КАК ДатаОкончания,
		|	Начисления.МесяцНачисления КАК МесяцНачисления,
		|	Начисления.НомерСтроки КАК НомерСтроки,
		|	Начисления.Сотрудник КАК Сотрудник,
		|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Начисления.Организация КАК Организация,
		|	Начисления.СтатьяФинансирования КАК СтатьяФинансирования,
		|	Начисления.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	Начисления.СтатьяРасходов КАК СтатьяРасходов,
		|	Начисления.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	Начисления.Начисление КАК Начисление,
		|	Начисления.НачалоБазовогоПериода КАК НачалоБазовогоПериода,
		|	Начисления.ОкончаниеБазовогоПериода КАК ОкончаниеБазовогоПериода,
		|	Начисления.ДокументСсылка КАК ДокументСсылка,
		|	Начисления.Сумма КАК Сумма,
		|	ЕСТЬNULL(КадровыеДанные.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриема
		|ПОМЕСТИТЬ ВТНачисленияОбщегоСреднегоЗаработка
		|ИЗ
		|	ВТНачисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанные
		|		ПО Начисления.Сотрудник = КадровыеДанные.Сотрудник
		|			И (КОНЕЦПЕРИОДА(Начисления.МесяцНачисления, МЕСЯЦ) = КадровыеДанные.Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.ДокументСсылка КАК ДокументСсылка,
		|	Начисления.Начисление КАК Начисление,
		|	Начисления.ПериодДействия КАК Период,
		|	Начисления.ДатаДействия КАК ДатаДействия,
		|	Начисления.Сотрудник КАК Сотрудник,
		|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Начисления.Организация КАК Организация,
		|	Начисления.СтатьяФинансирования КАК СтатьяФинансирования,
		|	Начисления.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	Начисления.СтатьяРасходов КАК СтатьяРасходов,
		|	Начисления.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	ВЫБОР
		|		КОГДА ВидыРасчета.СреднийЗаработокОбщий В (&ГодовыеПремии)
		|			ТОГДА ГОД(Начисления.НачалоБазовогоПериода)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Год,
		|	ВЫРАЗИТЬ(Начисления.Начисление КАК ПланВидовРасчета.Начисления).КоличествоМесяцевБазовогоПериода КАК КоличествоМесяцев,
		|	ВЫБОР
		|		КОГДА Начисления.ДатаПриема > Начисления.НачалоБазовогоПериода
		|			ТОГДА Начисления.ДатаПриема
		|		ИНАЧЕ Начисления.НачалоБазовогоПериода
		|	КОНЕЦ КАК ДатаНачалаБазовогоПериода,
		|	Начисления.Сумма КАК Сумма,
		|	Начисления.ПериодДействия КАК ПериодДействия,
		|	Начисления.ДатаНачала КАК ДатаНачала,
		|	Начисления.ДатаОкончания КАК ДатаОкончания,
		|	Начисления.МесяцНачисления КАК МесяцНачисления,
		|	Начисления.НомерСтроки КАК НомерСтроки,
		|	Начисления.НачалоБазовогоПериода КАК НачалоБазовогоПериода,
		|	Начисления.ОкончаниеБазовогоПериода КАК ОкончаниеБазовогоПериода,
		|	ВидыРасчета.СреднийЗаработокОбщий КАК СоставнаяЧасть,
		|	Начисления.ДатаПриема КАК ДатаПриема
		|ПОМЕСТИТЬ ВТНачисленияПредварительно
		|ИЗ
		|	ВТНачисленияОбщегоСреднегоЗаработка КАК Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК ВидыРасчета
		|		ПО (ВидыРасчета.Ссылка = Начисления.Начисление)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНачисленияПредварительно.ДокументСсылка КАК ДокументСсылка,
		|	ВТНачисленияПредварительно.Сотрудник КАК Сотрудник,
		|	ВТНачисленияПредварительно.СоставнаяЧасть КАК СоставнаяЧасть,
		|	ВТНачисленияПредварительно.Год КАК Год,
		|	ВТНачисленияПредварительно.КоличествоМесяцев КАК КоличествоМесяцев,
		|	ВТНачисленияПредварительно.ДатаНачалаБазовогоПериода КАК ДатаНачалаБазовогоПериода
		|ПОМЕСТИТЬ ВТСоставнаяЧасть
		|ИЗ
		|	ВТНачисленияПредварительно КАК ВТНачисленияПредварительно
		|ГДЕ
		|	ВТНачисленияПредварительно.СоставнаяЧасть <> ЗНАЧЕНИЕ(Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТНачисленияПредварительно.ДокументСсылка,
		|	ВТНачисленияПредварительно.Сотрудник,
		|	ВТНачисленияПредварительно.СоставнаяЧасть,
		|	ВТНачисленияПредварительно.ДатаНачалаБазовогоПериода,
		|	ВТНачисленияПредварительно.Год,
		|	ВТНачисленияПредварительно.КоличествоМесяцев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияПредварительно.ДокументСсылка КАК ДокументСсылка,
		|	НачисленияПредварительно.Начисление КАК Начисление,
		|	НачисленияПредварительно.Период КАК Период,
		|	НачисленияПредварительно.ДатаДействия КАК ДатаДействия,
		|	НачисленияПредварительно.Сотрудник КАК Сотрудник,
		|	НачисленияПредварительно.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияПредварительно.Организация КАК Организация,
		|	НачисленияПредварительно.СтатьяФинансирования КАК СтатьяФинансирования,
		|	НачисленияПредварительно.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	НачисленияПредварительно.СтатьяРасходов КАК СтатьяРасходов,
		|	НачисленияПредварительно.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	ВЫБОР
		|		КОГДА ВТСоставнаяЧасть.Год ЕСТЬ NULL
		|			ТОГДА НачисленияПредварительно.Год
		|		ИНАЧЕ ВТСоставнаяЧасть.Год
		|	КОНЕЦ КАК Год,
		|	ВЫБОР
		|		КОГДА ВТСоставнаяЧасть.КоличествоМесяцев ЕСТЬ NULL
		|			ТОГДА НачисленияПредварительно.КоличествоМесяцев
		|		ИНАЧЕ ВТСоставнаяЧасть.КоличествоМесяцев
		|	КОНЕЦ КАК КоличествоМесяцев,
		|	ВЫБОР
		|		КОГДА ВТСоставнаяЧасть.ДатаНачалаБазовогоПериода ЕСТЬ NULL
		|			ТОГДА НачисленияПредварительно.ДатаНачалаБазовогоПериода
		|		ИНАЧЕ ВТСоставнаяЧасть.ДатаНачалаБазовогоПериода
		|	КОНЕЦ КАК ДатаНачалаБазовогоПериода,
		|	НачисленияПредварительно.Сумма КАК Сумма,
		|	НачисленияПредварительно.ПериодДействия КАК ПериодДействия,
		|	НачисленияПредварительно.ДатаНачала КАК ДатаНачала,
		|	НачисленияПредварительно.ДатаОкончания КАК ДатаОкончания,
		|	НачисленияПредварительно.МесяцНачисления КАК МесяцНачисления,
		|	НачисленияПредварительно.НомерСтроки КАК НомерСтроки,
		|	НачисленияПредварительно.НачалоБазовогоПериода КАК НачалоБазовогоПериода,
		|	НачисленияПредварительно.ОкончаниеБазовогоПериода КАК ОкончаниеБазовогоПериода,
		|	НачисленияПредварительно.ДатаПриема КАК ДатаПриема,
		|	ВЫБОР
		|		КОГДА ВТСоставнаяЧасть.СоставнаяЧасть ЕСТЬ NULL
		|			ТОГДА НачисленияПредварительно.СоставнаяЧасть
		|		ИНАЧЕ ВТСоставнаяЧасть.СоставнаяЧасть
		|	КОНЕЦ КАК СоставнаяЧасть
		|ПОМЕСТИТЬ ВТНачисления
		|ИЗ
		|	ВТНачисленияПредварительно КАК НачисленияПредварительно
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоставнаяЧасть КАК ВТСоставнаяЧасть
		|		ПО НачисленияПредварительно.ДокументСсылка = ВТСоставнаяЧасть.ДокументСсылка
		|			И НачисленияПредварительно.Сотрудник = ВТСоставнаяЧасть.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНачисленияПредварительно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСоставнаяЧасть";
	
	Запрос.УстановитьПараметр("Премии", Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.Премии());
	Запрос.УстановитьПараметр("ГодовыеПремии", Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ГодовыеПремии());
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Период КАК Период,
		|	Сотрудники.ГоловнойСотрудник КАК Сотрудник,
		|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Начисления.Организация КАК Организация,
		|	Начисления.СтатьяФинансирования КАК СтатьяФинансирования,
		|	Начисления.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	Начисления.СтатьяРасходов КАК СтатьяРасходов,
		|	Начисления.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	Начисления.Год КАК Год,
		|	Начисления.КоличествоМесяцев КАК КоличествоМесяцев,
		|	Начисления.ДатаНачалаБазовогоПериода КАК ДатаНачалаБазовогоПериода,
		|	Начисления.Начисление КАК Начисление,
		|	СУММА(Начисления.Сумма) КАК Сумма,
		|	Начисления.ДатаНачала КАК ДатаНачала,
		|	Начисления.СоставнаяЧасть КАК СоставнаяЧасть,
		|	Начисления.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ВТНачисления КАК Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО (Сотрудники.Ссылка = Начисления.Сотрудник)
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.ГоловнойСотрудник,
		|	Начисления.СтатьяФинансирования,
		|	Начисления.СпособОтраженияЗарплатыВБухучете,
		|	Начисления.СтатьяРасходов,
		|	Начисления.ОблагаетсяЕНВД,
		|	Начисления.Период,
		|	Начисления.Сотрудник,
		|	Начисления.ФизическоеЛицо,
		|	Начисления.Организация,
		|	Начисления.ДатаНачалаБазовогоПериода,
		|	Начисления.Год,
		|	Начисления.КоличествоМесяцев,
		|	Начисления.Начисление,
		|	Начисления.ДатаНачала,
		|	Начисления.СоставнаяЧасть,
		|	Начисления.ДатаОкончания
		|
		|ИМЕЮЩИЕ
		|	СУММА(Начисления.Сумма) <> 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Движения.ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Записывать = Истина;
	КонецЕсли;
	
	ВыборкаДанныеПоНачислениям = РезультатЗапроса.Выбрать();
	Пока ВыборкаДанныеПоНачислениям.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Добавить(), ВыборкаДанныеПоНачислениям);
	КонецЦикла;
	
	Если ЗаписыватьДвижения Тогда
		Движения.ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Записать();
		Движения.ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Записывать = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция ГодГодовыхПремий(ДатаНачалаСобытия) Экспорт
	Возврат Год(ДобавитьМесяц(ДатаНачалаСобытия, -12));
КонецФункции

// Заполняет таблицу значений, содержащую данные для начисления зарплаты.
//
// Параметры:
// 	см. РасчетЗарплаты.РезультатНачисленияРасчетаЗарплаты
//	МесяцНачисления - в базовой реализации начисления получаются 
//	только за месяц в целом, а не за произвольный период.
//
Функция РезультатНачисленияРасчетаПремии(Организация, МесяцНачисления, Документ, Подразделение, Сотрудники) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Регистратор",            Документ);
	Запрос.УстановитьПараметр("ПланируемаяДатаВыплаты", КонецМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("КатегорияИсключение",    Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска);
	Запрос.УстановитьПараметр("НачисленияИсключения",   ПланыВидовРасчета.Начисления.НачисленияПоОтбору(
		Новый Структура("КатегорияНачисленияИлиНеоплаченногоВремени", 
			Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)));
	
	КадровыеДанныеДокумента = "ГоловнаяОрганизация,Организация,Подразделение,ПроцентСевернойНадбавки,ДоляНеполногоРабочегоВремени,ДатаРождения";
	КадровыеДанные = КадровыеДанныеДокумента;
	Если ЗарплатаКадры.ДополнитьКадровымиДаннымиНастройкиПорядкаСписка(КадровыеДанные) Тогда
		ПоляСортировки = Сред(КадровыеДанные, СтрДлина(КадровыеДанныеДокумента) + 2);
	Иначе
		ПоляСортировки = "";
	КонецЕсли;
	
	Если Сотрудники = Неопределено Тогда
		
		ИмяВТСотрудникиОрганизации = "ВТСотрудникиОрганизацииПредварительно";
		
		// Получаем сотрудников, работавших в организации из подсистемы КадровыйУчет.
		ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолученияСотрудниковОрганизаций.Организация 					= Организация;
		ПараметрыПолученияСотрудниковОрганизаций.Подразделение 					= Подразделение;
		ПараметрыПолученияСотрудниковОрганизаций.ОтбиратьПоГоловнойОрганизации 	= Ложь;
		ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода 					= МесяцНачисления;
		ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода 				= КонецМесяца(МесяцНачисления);
		ПараметрыПолученияСотрудниковОрганизаций.КадровыеДанные					= КадровыеДанные;
		
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудниковОрганизаций, ИмяВТСотрудникиОрганизации);
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СотрудникиОрганизации.Период КАК Период,
			|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
			|	СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СотрудникиОрганизации.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	СотрудникиОрганизации.Организация КАК Организация,
			|	СотрудникиОрганизации.Подразделение КАК Подразделение,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СотрудникиОрганизации.ДоляНеполногоРабочегоВремени, 0) = 0
			|			ТОГДА 1
			|		ИНАЧЕ СотрудникиОрганизации.ДоляНеполногоРабочегоВремени
			|	КОНЕЦ КАК ДоляНеполногоРабочегоВремени,
			|	СотрудникиОрганизации.ТарифнаяСтавка КАК ТарифнаяСтавка,
			|	СотрудникиОрганизации.ПроцентСевернойНадбавки КАК ПроцентСевернойНадбавки,
			|	СотрудникиОрганизации.ДатаРождения КАК ДатаРождения
			|ПОМЕСТИТЬ ВТСотрудникиОрганизации
			|ИЗ
			|	ВТСотрудникиОрганизацииПредварительно КАК СотрудникиОрганизации
			|ГДЕ
			|	(СотрудникиОрганизации.ДатаЗавершенияРаботы = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ СотрудникиОрганизации.ДатаЗавершенияРаботы > &ПланируемаяДатаВыплаты)
			|	И СотрудникиОрганизации.Подразделение В ИЕРАРХИИ(&Подразделение)";
			
		Если Не ПустаяСтрока(ПоляСортировки) Тогда
			
			СтрокаЗамены = "СотрудникиОрганизации.ДатаРождения КАК ДатаРождения";
			ПоляСортировки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПоляСортировки);
			
			Для Каждого ПолеСортировки Из ПоляСортировки Цикл
				СтрокаЗамены = СтрокаЗамены + "," + Символы.ПС + Символы.Таб
					+ "СотрудникиОрганизации." + ПолеСортировки + " КАК " + ПолеСортировки;
			КонецЦикла;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СотрудникиОрганизации.ДатаРождения КАК ДатаРождения", СтрокаЗамены);
			
		КонецЕсли; 
			
		Если Не ЗначениеЗаполнено(Подразделение) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СотрудникиОрганизации.Подразделение В ИЕРАРХИИ(&Подразделение)", "");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.Выполнить();
		
	Иначе
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	&Период КАК Период,
			|	Сотрудники.Ссылка КАК Сотрудник
			|ПОМЕСТИТЬ ВТСотрудникиПериоды
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	Сотрудники.Ссылка В(&Сотрудники)";
		
		Запрос.УстановитьПараметр("Период", КонецМесяца(МесяцНачисления));
		Запрос.УстановитьПараметр("Месяц", НачалоМесяца(МесяцНачисления));
		Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
		Запрос.Выполнить();
		
		ОписательВТ = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиПериоды");
		ОписательВТ.ИмяВТКадровыеДанныеСотрудников = "ВТСотрудникиОрганизации";
		
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВТ, Истина, КадровыеДанные);
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	КадровыеДанныеСотрудников.Подразделение КАК Подразделение,
		|	КадровыеДанныеСотрудников.ДоляНеполногоРабочегоВремени КАК ДоляНеполногоРабочегоВремени
		|ПОМЕСТИТЬ ВТДанныеНачисленийПоСотрудникам
		|ИЗ
		|	ВТСотрудникиОрганизации КАК КадровыеДанныеСотрудников";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	КадровыеДанныеСотрудников.Подразделение КАК Подразделение,
		|	ЕСТЬNULL(КадровыеДанныеСотрудников.ДоляНеполногоРабочегоВремени, 0) КАК ДоляНеполногоРабочегоВремени
		|ПОМЕСТИТЬ ВТДанныеНачисленийПоСотрудникам
		|ИЗ
		|	ВТСотрудникиОрганизации КАК КадровыеДанныеСотрудников
		|
		|СГРУППИРОВАТЬ ПО
		|	КадровыеДанныеСотрудников.Сотрудник,
		|	КадровыеДанныеСотрудников.Подразделение,
		|	ЕСТЬNULL(КадровыеДанныеСотрудников.ДоляНеполногоРабочегоВремени, 0)";
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
	Возврат ТаблицаЗаполненияНачисленийПремии(Запрос.МенеджерВременныхТаблиц, Организация, МесяцНачисления);
	
КонецФункции

Функция ТаблицаЗаполненияНачисленийПремии(МенеджерВременныхТаблиц, Организация, МесяцНачисления) Экспорт
	
	Запрос = Новый запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеНачисленийПоСотрудникам.Сотрудник КАК Сотрудник,
		|	ДанныеНачисленийПоСотрудникам.Подразделение КАК Подразделение,
		|	ДанныеНачисленийПоСотрудникам.ДоляНеполногоРабочегоВремени КАК ДоляНеполногоРабочегоВремени
		|ПОМЕСТИТЬ ВТСводныеДанныеНачисленийПоСотрудникам
		|ИЗ
		|	ВТДанныеНачисленийПоСотрудникам КАК ДанныеНачисленийПоСотрудникам
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеНачисленийПоСотрудникам.Сотрудник,
		|	ДанныеНачисленийПоСотрудникам.Подразделение,
		|	ДанныеНачисленийПоСотрудникам.ДоляНеполногоРабочегоВремени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыеДанныеСотрудников.Период КАК Период,
		|	ВЫРАЗИТЬ(КадровыеДанныеСотрудников.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник,
		|	ВЫРАЗИТЬ(КадровыеДанныеСотрудников.Подразделение КАК Справочник.ПодразделенияОрганизаций) КАК Подразделение,
		|	СводныеДанныеНачисленийПоСотрудникам.ДоляНеполногоРабочегоВремени КАК ДоляНеполногоРабочегоВремени,
		|	КадровыеДанныеСотрудников.ПроцентСевернойНадбавки КАК ПроцентСевернойНадбавки,
		|	КадровыеДанныеСотрудников.Подразделение.РайонныйКоэффициент КАК РайонныйКоэффициент
		|ПОМЕСТИТЬ ВТДанныеПоКоэффициентамСотрудников
		|ИЗ
		|	ВТСотрудникиОрганизации КАК КадровыеДанныеСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСводныеДанныеНачисленийПоСотрудникам КАК СводныеДанныеНачисленийПоСотрудникам
		|		ПО КадровыеДанныеСотрудников.Сотрудник = СводныеДанныеНачисленийПоСотрудникам.Сотрудник
		|			И КадровыеДанныеСотрудников.Подразделение = СводныеДанныеНачисленийПоСотрудникам.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеПоКоэффициентамСотрудников.Период КАК Период,
		|	ДанныеПоКоэффициентамСотрудников.Подразделение КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ВТПодразделенияПериоды
		|ИЗ
		|	ВТДанныеПоКоэффициентамСотрудников КАК ДанныеПоКоэффициентамСотрудников";
		
	Запрос.Выполнить();
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ТерриториальныеУсловияПФР",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТПодразделенияПериоды", "СтруктурнаяЕдиница"));
		
	СписокКатегорий = Новый Массив;
	СписокКатегорий.Добавить(Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда);
	СписокКатегорий.Добавить(Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки);
	
	Запрос.УстановитьПараметр("СписокКатегорийНадбавок", СписокКатегорий);
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.РасчетЗарплаты") Тогда
		МодульРасчетЗарплатыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("РасчетЗарплатыДляНебольшихОрганизаций");
		Запрос.УстановитьПараметр("СписокКатегорийНадбавок",
			МодульРасчетЗарплатыДляНебольшихОрганизаций.КатегорииДоходаНадбавок(Организация, МесяцНачисления));
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеПоСотрудникам.Сотрудник КАК Сотрудник,
		|	ДанныеПоСотрудникам.Подразделение КАК Подразделение,
		|	NULL КАК Начисление,
		|	ИСТИНА КАК ВходитВБазуРКиСН,
		|	0 КАК КоэффициентПересчета,
		|	ДанныеПоСотрудникам.ДоляНеполногоРабочегоВремени КАК ДоляНеполногоРабочегоВремени
		|ИЗ
		|	ВТДанныеНачисленийПоСотрудникам КАК ДанныеПоСотрудникам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК КадровыеДанныеСотрудников
		|		ПО ДанныеПоСотрудникам.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеПоКоэффициентамСотрудников.Сотрудник,
		|	ДанныеПоКоэффициентамСотрудников.Подразделение,
		|	Начисления.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеПоКоэффициентамСотрудников.РайонныйКоэффициент - 1,
		|	ДанныеПоКоэффициентамСотрудников.ДоляНеполногоРабочегоВремени
		|ИЗ
		|	ВТДанныеПоКоэффициентамСотрудников КАК ДанныеПоКоэффициентамСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО (Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.РайонныйКоэффициент))
		|			И (ДанныеПоКоэффициентамСотрудников.РайонныйКоэффициент <> 1)
		|			И (Начисления.КатегорияДохода В (&СписокКатегорийНадбавок))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК КадровыеДанныеСотрудников
		|		ПО ДанныеПоКоэффициентамСотрудников.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПоКоэффициентамСотрудников.Сотрудник,
		|	ДанныеПоКоэффициентамСотрудников.Подразделение,
		|	Начисления.Ссылка,
		|	ДанныеПоКоэффициентамСотрудников.ДоляНеполногоРабочегоВремени,
		|	ДанныеПоКоэффициентамСотрудников.РайонныйКоэффициент - 1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеПоКоэффициентамСотрудников.Сотрудник,
		|	ДанныеПоКоэффициентамСотрудников.Подразделение,
		|	Начисления.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеПоКоэффициентамСотрудников.ПроцентСевернойНадбавки / 100,
		|	ДанныеПоКоэффициентамСотрудников.ДоляНеполногоРабочегоВремени
		|ИЗ
		|	ВТДанныеПоКоэффициентамСотрудников КАК ДанныеПоКоэффициентамСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО (Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.СевернаяНадбавка))
		|			И (ДанныеПоКоэффициентамСотрудников.ПроцентСевернойНадбавки <> 0)
		|			И (Начисления.КатегорияДохода В (&СписокКатегорийНадбавок))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТерриториальныеУсловияПФРСрезПоследних КАК ТерриториальныеУсловия
		|		ПО ДанныеПоКоэффициентамСотрудников.Период = ТерриториальныеУсловия.Период
		|			И ДанныеПоКоэффициентамСотрудников.Подразделение = ТерриториальныеУсловия.СтруктурнаяЕдиница
		|			И (ТерриториальныеУсловия.ПрименятьСевернуюНадбавку)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК КадровыеДанныеСотрудников
		|		ПО ДанныеПоКоэффициентамСотрудников.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПоКоэффициентамСотрудников.Сотрудник,
		|	ДанныеПоКоэффициентамСотрудников.Подразделение,
		|	Начисления.Ссылка,
		|	ДанныеПоКоэффициентамСотрудников.ДоляНеполногоРабочегоВремени,
		|	ДанныеПоКоэффициентамСотрудников.ПроцентСевернойНадбавки / 100
		|
		|УПОРЯДОЧИТЬ ПО
		|	Начисление";
	
	ЗарплатаКадры.ДополнитьТекстЗапросаУпорядочиваниемСотрудниковПоВТСДаннымиПорядка(Запрос, "КадровыеДанныеСотрудников");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьВТНачисленияЗарплаты(МенеджерВременныхТаблиц, ИмяВТНачисленияЗарплаты = "ВТНачисленияЗарплаты") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	СписокКатегорий = КатегорииОтсутствий();
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиРайонногоКоэффициентаВСреднемЗаработке);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиСевернойНадбавкиВСреднемЗаработке);
	
	Запрос.УстановитьПараметр("СписокКатегорий", СписокКатегорий);
	Запрос.УстановитьПараметр("ПремииПроцентом", Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.Премии());
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачисленияУдержанияПоСотрудникам.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	НачисленияУдержанияПоСотрудникам.Сотрудник КАК Сотрудник,
		|	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачисленияУдержанияПоСотрудникам.Сумма - ВЫБОР
		|			КОГДА НЕ ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.СоставнаяЧасть ЕСТЬ NULL
		|				ТОГДА ВЫБОР
		|						КОГДА НЕ ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.СоставнаяЧасть В (&ПремииПроцентом)
		|							ТОГДА ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Сумма
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ) КАК Период,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ) > ПериодыРаботыФизическихЛиц.НачалоПериода
		|			ТОГДА НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ)
		|		ИНАЧЕ ПериодыРаботыФизическихЛиц.НачалоПериода
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ) < ПериодыРаботыФизическихЛиц.ОкончаниеПериода
		|			ТОГДА КОНЕЦПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ)
		|		ИНАЧЕ ПериодыРаботыФизическихЛиц.ОкончаниеПериода
		|	КОНЕЦ КАК ДатаОкончания,
		|	НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК Начисление,
		|	ЕСТЬNULL(ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Год, 0) КАК Год,
		|	ЕСТЬNULL(ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.ДатаНачалаБазовогоПериода, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаБазовогоПериода,
		|	ЕСТЬNULL(ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.КоличествоМесяцев, 0) КАК КоличествоМесяцев,
		|	ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.СоставнаяЧасть КАК СоставнаяЧасть
		|ПОМЕСТИТЬ ВТНачисленияЗарплаты
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыРаботыФизическихЛиц КАК ПериодыРаботыФизическихЛиц
		|		ПО НачисленияУдержанияПоСотрудникам.Организация.ГоловнаяОрганизация = ПериодыРаботыФизическихЛиц.ГоловнаяОрганизация
		|			И НачисленияУдержанияПоСотрудникам.Сотрудник = ПериодыРаботыФизическихЛиц.Сотрудник
		|			И НачисленияУдержанияПоСотрудникам.Период <= ПериодыРаботыФизическихЛиц.ОкончаниеПериода
		|			И (НачисленияУдержанияПоСотрудникам.Период >= НАЧАЛОПЕРИОДА(ПериодыРаботыФизическихЛиц.НачалоПериода, МЕСЯЦ))
		|			И (НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено))
		|			И (НЕ НачисленияУдержанияПоСотрудникам.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени В (&СписокКатегорий))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям КАК ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям
		|		ПО НачисленияУдержанияПоСотрудникам.ДокументОснование = ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Регистратор
		|			И НачисленияУдержанияПоСотрудникам.Сотрудник = ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Сотрудник
		|			И НачисленияУдержанияПоСотрудникам.НачислениеУдержание = ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Начисление
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияУдержанияПоСотрудникам.Организация.ГоловнаяОрганизация,
		|	НачисленияУдержанияПоСотрудникам.Сотрудник,
		|	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо,
		|	НачисленияУдержанияПоСотрудникам.Период,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ) > ПериодыРаботыФизическихЛиц.НачалоПериода
		|			ТОГДА НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ)
		|		ИНАЧЕ ПериодыРаботыФизическихЛиц.НачалоПериода
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ) < ПериодыРаботыФизическихЛиц.ОкончаниеПериода
		|			ТОГДА КОНЕЦПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ)
		|		ИНАЧЕ ПериодыРаботыФизическихЛиц.ОкончаниеПериода
		|	КОНЕЦ,
		|	НачисленияУдержанияПоСотрудникам.НачислениеУдержание,
		|	ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.СоставнаяЧасть,
		|	ЕСТЬNULL(ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Год, 0),
		|	ЕСТЬNULL(ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.ДатаНачалаБазовогоПериода, ДАТАВРЕМЯ(1, 1, 1)),
		|	ЕСТЬNULL(ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.КоличествоМесяцев, 0)
		|
		|ИМЕЮЩИЕ
		|	СУММА(НачисленияУдержанияПоСотрудникам.Сумма - ВЫБОР
		|			КОГДА НЕ ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.СоставнаяЧасть ЕСТЬ NULL
		|				ТОГДА ВЫБОР
		|						КОГДА НЕ ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.СоставнаяЧасть В (&ПремииПроцентом)
		|							ТОГДА ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Сумма
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) <> 0";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТНачисленияЗарплаты", ИмяВТНачисленияЗарплаты);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТПериодыОтсутствий(МенеджерВременныхТаблиц, ИмяВТПериодыОтсутствий = "ВТПериодыОтсутствий") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СписокКатегорий", КатегорииОтсутствий());
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОтработанноеВремяПоСотрудникам.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ОтработанноеВремяПоСотрудникам.Сотрудник КАК Сотрудник,
		|	ОтработанноеВремяПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА НачисленияУдержанияПоСотрудникам.ДатаНачала > ПериодыРаботыФизическихЛиц.НачалоПериода
		|			ТОГДА НачисленияУдержанияПоСотрудникам.ДатаНачала
		|		ИНАЧЕ ПериодыРаботыФизическихЛиц.НачалоПериода
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА НачисленияУдержанияПоСотрудникам.ДатаОкончания < ПериодыРаботыФизическихЛиц.ОкончаниеПериода
		|			ТОГДА НачисленияУдержанияПоСотрудникам.ДатаОкончания
		|		ИНАЧЕ ПериодыРаботыФизическихЛиц.ОкончаниеПериода
		|	КОНЕЦ КАК ДатаОкончания,
		|	ОтработанноеВремяПоСотрудникам.Регистратор КАК СсылкаНаДокумент,
		|	БольничныйЛист.ПричинаНетрудоспособности КАК ПричинаНеРаботы,
		|	ОтработанноеВремяПоСотрудникам.Начисление.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени
		|ПОМЕСТИТЬ ВТПериодыОтсутствий
		|ИЗ
		|	РегистрНакопления.ОтработанноеВремяПоСотрудникам КАК ОтработанноеВремяПоСотрудникам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыРаботыФизическихЛиц КАК ПериодыРаботыФизическихЛиц
		|			ПО НачисленияУдержанияПоСотрудникам.Организация.ГоловнаяОрганизация = ПериодыРаботыФизическихЛиц.ГоловнаяОрганизация
		|				И НачисленияУдержанияПоСотрудникам.Сотрудник = ПериодыРаботыФизическихЛиц.Сотрудник
		|				И НачисленияУдержанияПоСотрудникам.ДатаНачала <= ПериодыРаботыФизическихЛиц.ОкончаниеПериода
		|				И НачисленияУдержанияПоСотрудникам.ДатаОкончания >= ПериодыРаботыФизическихЛиц.НачалоПериода
		|		ПО ОтработанноеВремяПоСотрудникам.Период = НачисленияУдержанияПоСотрудникам.Период
		|			И ОтработанноеВремяПоСотрудникам.Регистратор = НачисленияУдержанияПоСотрудникам.Регистратор
		|			И ОтработанноеВремяПоСотрудникам.ИдентификаторСтроки = НачисленияУдержанияПоСотрудникам.ИдентификаторСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.БольничныйЛист КАК БольничныйЛист
		|		ПО ОтработанноеВремяПоСотрудникам.Регистратор = БольничныйЛист.Ссылка
		|ГДЕ
		|	ОтработанноеВремяПоСотрудникам.Начисление.КатегорияНачисленияИлиНеоплаченногоВремени В(&СписокКатегорий)
		|	И НЕ ОтработанноеВремяПоСотрудникам.Регистратор ССЫЛКА Документ.Увольнение";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТПериодыОтсутствий", ИмяВТПериодыОтсутствий);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.УнифицированнаяФормаТ13);
	
КонецПроцедуры

Процедура УстановитьИсключаемыеПунктыМенюВводаНаОснованииСотрудников(ИсключаемыеПунктыМеню) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("РасчетЗарплатыДляНебольшихОрганизаций") Тогда
		ИсключаемыеПунктыМеню.Добавить("Документы.БольничныйЛист");
		ИсключаемыеПунктыМеню.Добавить("Документы.Отпуск");
		ИсключаемыеПунктыМеню.Добавить("Документы.ОтпускБезСохраненияОплаты");
	КонецЕсли; 
	
КонецПроцедуры

// Возвращает максимально возможное значение разницы между максимально возможным количеством
// сотрудников и фактическим количеством сотрудников, при достижении которого выдаются предупреждения
// об ограничениях применения режима расчета зарплаты для небольших организаций.
//
// Возвращаемое значение:
//		Число
//
Функция ПорогПредупреждения()
	
	Возврат 5;
	
КонецФункции

Функция ТекущееКоличествоСотрудников(Организация = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Отборы = Новый Массив;
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		Отборы, "ОформленПоТрудовомуДоговору", "=", Истина);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		Отборы, "ДатаПриема", "<>", "ДАТАВРЕМЯ(1, 1, 1)");
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		Отборы, "ДатаУвольнения", "=", "ДАТАВРЕМЯ(1, 1, 1)");
	
	Если Организация <> Неопределено Тогда
		
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
			Отборы, "ТекущаяОрганизация", "=", Организация);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	КадровыйУчет.СоздатьВТТекущиеКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, 
		Ложь, Отборы, "ТекущаяОрганизация");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация КАК Организация,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТекущиеКадровыеДанныеСотрудников.Сотрудник) КАК КоличествоСотрудников
		|ИЗ
		|	ВТТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|
		|СГРУППИРОВАТЬ ПО
		|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоСотрудников УБЫВ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СоздатьВТНачисленияПоОтсутствиям(МенеджерВременныхТаблиц, ТолькоРазрешенные, МесяцНачисления, Организация, Подразделение = Неопределено, СписокСотрудников = Неопределено, ИсключаемыйРегистратор = Неопределено, ИмяВТНачисленияПоОтсутствиям = "ВТНачисленияПоОтсутствиям")
	
	КатегорииОтсутствий = КатегорииОтсутствий();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СписокКатегорий",        КатегорииОтсутствий);
	Запрос.УстановитьПараметр("НачисленияИсключения",   ПланыВидовРасчета.Начисления.НачисленияПоОтбору(
		Новый Структура("КатегорияНачисленияИлиНеоплаченногоВремени", КатегорииОтсутствий)));
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачисленияУдержанияПоСотрудникам.Сотрудник КАК Сотрудник,
		|	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
		|					И (ВЫРАЗИТЬ(НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК ПланВидовРасчета.Начисления).КатегорияНачисленияИлиНеоплаченногоВремени В (&СписокКатегорий)
		|						ИЛИ ВЫРАЗИТЬ(НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК ПланВидовРасчета.Начисления).ОсновнойВидРасчета В (&НачисленияИсключения))
		|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Удержано)
		|					И НачисленияУдержанияПоСотрудникам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НДФЛ)
		|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДФЛ
		|ПОМЕСТИТЬ ВТНачисленияПоОтсутствиям
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|ГДЕ
		|	НачисленияУдержанияПоСотрудникам.Период = &МесяцНачисления
		|	И НачисленияУдержанияПоСотрудникам.Организация = &Организация
		|	И НачисленияУдержанияПоСотрудникам.Подразделение В ИЕРАРХИИ(&Подразделение)
		|	И НачисленияУдержанияПоСотрудникам.Сотрудник В(&СписокСотрудников)
		|	И НачисленияУдержанияПоСотрудникам.Регистратор <> &ИсключаемыйРегистратор
		|	И ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоСотрудникам.Регистратор) <> ТИП(Документ.НачислениеЗарплаты)
		|	И ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоСотрудникам.Регистратор) <> ТИП(Документ.Премия)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияУдержанияПоСотрудникам.Сотрудник,
		|	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НачисленияУдержанияПоСотрудникам.Подразделение В ИЕРАРХИИ(&Подразделение)", "");
	КонецЕсли;
	
	Если СписокСотрудников = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НачисленияУдержанияПоСотрудникам.Сотрудник В(&СписокСотрудников)", "");
	Иначе
		Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	КонецЕсли;
	
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТНачисленияПоОтсутствиям", ИмяВТНачисленияПоОтсутствиям);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СоздатьВТНачисленияПоПремиям(МенеджерВременныхТаблиц, ТолькоРазрешенные, МесяцНачисления, Организация, Подразделение = Неопределено, СписокСотрудников = Неопределено, ИсключаемыйРегистратор = Неопределено, ИмяВТНачисленияПоПремиям = "ВТНачисленияПоПремиям")
	
	СписокКатегорий = КатегорииПремий();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокКатегорий, КатегорииРКиСН());
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СписокКатегорий", СписокКатегорий);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачисленияУдержанияПоСотрудникам.Сотрудник КАК Сотрудник,
		|	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
		|					И ВЫРАЗИТЬ(НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК ПланВидовРасчета.Начисления).КатегорияНачисленияИлиНеоплаченногоВремени В (&СписокКатегорий)
		|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Удержано)
		|					И НачисленияУдержанияПоСотрудникам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НДФЛ)
		|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДФЛ,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Удержано)
		|					И НачисленияУдержанияПоСотрудникам.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
		|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Удержано
		|ПОМЕСТИТЬ ВТНачисленияПоПремиям
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|ГДЕ
		|	НачисленияУдержанияПоСотрудникам.Период = &МесяцНачисления
		|	И НачисленияУдержанияПоСотрудникам.Организация = &Организация
		|	И НачисленияУдержанияПоСотрудникам.Подразделение В ИЕРАРХИИ(&Подразделение)
		|	И НачисленияУдержанияПоСотрудникам.Сотрудник В(&СписокСотрудников)
		|	И НачисленияУдержанияПоСотрудникам.Регистратор <> &ИсключаемыйРегистратор
		|	И ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоСотрудникам.Регистратор) = ТИП(Документ.Премия)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияУдержанияПоСотрудникам.Сотрудник,
		|	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НачисленияУдержанияПоСотрудникам.Подразделение В ИЕРАРХИИ(&Подразделение)", "");
	КонецЕсли;
	
	Если СписокСотрудников = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НачисленияУдержанияПоСотрудникам.Сотрудник В(&СписокСотрудников)", "");
	Иначе
		Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	КонецЕсли;
	
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТНачисленияПоПремиям", ИмяВТНачисленияПоПремиям);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ТаблицаСотрудники(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(Сотрудники.Сотрудник) КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ЕСТЬNULL(ОтпускаБольничные.НДФЛ, 0) + ЕСТЬNULL(Премии.НДФЛ, 0)) КАК НДФЛОтпускаБольничныеПремии,
		|	МАКСИМУМ(ЕСТЬNULL(НДФЛДокумента.НДФЛ, 0)) + СУММА(ЕСТЬNULL(ОтпускаБольничные.НДФЛ, 0)) + СУММА(ЕСТЬNULL(Премии.НДФЛ, 0)) КАК НДФЛ,
		|	МАКСИМУМ(ЕСТЬNULL(УдержанияДокумента.Удержано, 0) + ЕСТЬNULL(Премии.Удержано, 0)) КАК ПрочееУдержано,
		|	МАКСИМУМ(ЕСТЬNULL(УдержанияДокумента.Удержано, 0)) + МАКСИМУМ(ЕСТЬNULL(НДФЛДокумента.НДФЛ, 0)) + СУММА(ЕСТЬNULL(ОтпускаБольничные.НДФЛ, 0)) + СУММА(ЕСТЬNULL(Премии.НДФЛ, 0)) + ЕСТЬNULL(Премии.Удержано, 0) КАК ВсегоУдержано,
		|	МАКСИМУМ(&Взносы) КАК Взносы
		|ПОМЕСТИТЬ ВТУдержанияСотрудников
		|ИЗ
		|	ВТСотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержанияДокумента КАК УдержанияДокумента
		|		ПО Сотрудники.ФизическоеЛицо = УдержанияДокумента.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДФЛДокумента КАК НДФЛДокумента
		|		ПО Сотрудники.ФизическоеЛицо = НДФЛДокумента.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВзносыДокумента КАК ВзносыДокумента
		|		ПО Сотрудники.ФизическоеЛицо = ВзносыДокумента.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияПоОтсутствиям КАК ОтпускаБольничные
		|		ПО Сотрудники.Сотрудник = ОтпускаБольничные.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияПоПремиям КАК Премии
		|		ПО Сотрудники.Сотрудник = Премии.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.ФизическоеЛицо,
		|	Премии.Удержано
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСотрудников.Сотрудник КАК Сотрудник,
		|	ВЫРАЗИТЬ(ТаблицаСотрудников.Сотрудник КАК Справочник.Сотрудники).Наименование КАК СотрудникНаименование,
		|	ТаблицаСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияДокумента.ОтработаноДней КАК ОтработаноДней,
		|	НачисленияДокумента.ОтработаноЧасов КАК ОтработаноЧасов,
		|	НачисленияДокумента.Начислено КАК Начислено,
		|	ДоговорыДокумента.Договоры КАК Договоры,
		|	ЕСТЬNULL(НачисленияПоОтсутствиям.Сумма, 0) КАК ОтпускаБольничные,
		|	ЕСТЬNULL(Премии.Сумма, 0) КАК Премии,
		|	УдержанияСотрудников.НДФЛОтпускаБольничныеПремии КАК НДФЛОтпускаБольничныеПремии,
		|	ЕСТЬNULL(НачисленияДокумента.Начислено, 0) + ЕСТЬNULL(НачисленияПоОтсутствиям.Сумма, 0) + ЕСТЬNULL(ДоговорыДокумента.Договоры, 0) + ЕСТЬNULL(Премии.Сумма, 0) КАК ВсегоНачислено,
		|	УдержанияСотрудников.НДФЛ КАК НДФЛ,
		|	УдержанияСотрудников.ПрочееУдержано КАК ПрочееУдержано,
		|	УдержанияСотрудников.ВсегоУдержано КАК ВсегоУдержано,
		|	УдержанияСотрудников.Взносы КАК Взносы
		|ИЗ
		|	ВТСотрудники КАК ТаблицаСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержанияСотрудников КАК УдержанияСотрудников
		|		ПО ТаблицаСотрудников.Сотрудник = УдержанияСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияДокумента КАК НачисленияДокумента
		|		ПО ТаблицаСотрудников.Сотрудник = НачисленияДокумента.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияПоОтсутствиям КАК НачисленияПоОтсутствиям
		|		ПО ТаблицаСотрудников.Сотрудник = НачисленияПоОтсутствиям.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговорыДокумента КАК ДоговорыДокумента
		|		ПО ТаблицаСотрудников.Сотрудник = ДоговорыДокумента.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияПоПремиям КАК Премии
		|		ПО ТаблицаСотрудников.Сотрудник = Премии.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаСотрудников.Сотрудник
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ПоляВзносов = СтрРазделить(УчетСтраховыхВзносовКлиентСервер.РассчитываемыеВзносы(), ",");
	ТекстЗапросаПолей = "";
	
	ДобавитьПлюс = Ложь;
	Для каждого ПолеВзносов Из ПоляВзносов Цикл
		
		Если ДобавитьПлюс Тогда
			ТекстЗапросаПолей = ТекстЗапросаПолей + " + ";
		Иначе
			ДобавитьПлюс = Истина;
		КонецЕсли;
		
		ТекстЗапросаПолей = ТекстЗапросаПолей + "ВзносыДокумента." + ПолеВзносов;
		
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "МАКСИМУМ(&Взносы) КАК Взносы", "МАКСИМУМ(" + ТекстЗапросаПолей + ") КАК Взносы");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СтрокаКоллекцииПоПериоду(Коллекция, Месяц)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Месяц", Месяц);
	
	НайденныеСтроки = Коллекция.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрокаКоллекции = НайденныеСтроки[0];
	Иначе
		СтрокаКоллекции = Коллекция.Добавить();
		СтрокаКоллекции.Месяц = Месяц;
	КонецЕсли;
	
	Возврат  СтрокаКоллекции
	
КонецФункции

Функция СтрокаКоллекцииПоОтбору(Коллекция, Отбор)
	
	НайденныеСтроки = Коллекция.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрокаКоллекции = НайденныеСтроки[0];
	Иначе
		СтрокаКоллекции = Коллекция.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКоллекции, Отбор);
	КонецЕсли;
	
	Возврат  СтрокаКоллекции
	
КонецФункции

// Функция возвращает количество месяцев между двумя датами.
//
Функция КоличествоМесяцевПериодаРасчетаСреднего(ДатаНачалаПериода, ДатаОкончанияПериода)
	
	Возврат (Год(ДатаОкончанияПериода) - Год(ДатаНачалаПериода)) * 12 + Месяц(ДатаОкончанияПериода) - Месяц(ДатаНачалаПериода) + 1;	
	
КонецФункции	

Функция ДатаИзмененияКоличестваДнейДляОтпускных()

	Возврат '20140402'

КонецФункции

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.БольничныйЛист);
	СписокОбъектов.Добавить(Документы.ИсполнительныйЛист);
	СписокОбъектов.Добавить(Документы.НачислениеЗарплаты);
	СписокОбъектов.Добавить(Документы.Отпуск);
	СписокОбъектов.Добавить(Документы.Премия);
	СписокОбъектов.Добавить(ЖурналыДокументов.НачислениеЗарплаты);
	СписокОбъектов.Добавить(Документы.ОтпускБезСохраненияОплаты);
	
КонецПроцедуры

Функция КатегорииОтсутствий() Экспорт
	
	СписокКатегорий = Новый Массив;
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛиста);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоПрофзаболевание);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоНесчастныйСлучайНаПроизводстве);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодам);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.БолезньБезОплаты);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускБезОплаты);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска);
	
	Возврат СписокКатегорий;
	
КонецФункции

Функция КатегорииПремий() Экспорт
	
	СписокКатегорий = Новый Массив;
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Премия);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КвартальнаяПремия);
	
	Возврат СписокКатегорий;
	
КонецФункции

Функция КатегорииРКиСН() Экспорт
	
	СписокКатегорий = Новый Массив;
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.РайонныйКоэффициент);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.СевернаяНадбавка);
	
	Возврат СписокКатегорий;
	
КонецФункции

Функция РабочихДнейЧасовВПериоде(Календарь, НачалоПериода, ОкончаниеПериода) Экспорт
	
	РабочихДнейЧасов = Новый Структура("Дней,Часов,ПредпраздничныхДней", 0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Календарь", Календарь);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	
	ГрафикиРаботы.СоздатьВТРасписанияРаботыНаПериод(
		Запрос.МенеджерВременныхТаблиц, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Календарь), НачалоПериода, ОкончаниеПериода);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасписанияРаботы.ДатаГрафика КАК День,
		|	СУММА(РАЗНОСТЬДАТ(ЕСТЬNULL(РасписанияРаботы.ВремяНачала, ДАТАВРЕМЯ(1, 1, 1, 10, 0, 0)), ЕСТЬNULL(РасписанияРаботы.ВремяОкончания, ДАТАВРЕМЯ(1, 1, 1, 18, 0, 0)), МИНУТА)) / 60 КАК Часы,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТДатыНомераДней.ПредпраздничныйДень, ЛОЖЬ)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПредпраздничныйДень
		|ПОМЕСТИТЬ ВТ_РабочихДнейЧасов
		|ИЗ
		|	ВТРасписанияРаботы КАК РасписанияРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДатыНомераДней КАК ВТДатыНомераДней
		|		ПО РасписанияРаботы.ДатаГрафика = ВТДатыНомераДней.ДатаГрафика
		|			И РасписанияРаботы.ГрафикРаботы = ВТДатыНомераДней.ГрафикРаботы
		|
		|СГРУППИРОВАТЬ ПО
		|	РасписанияРаботы.ДатаГрафика,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТДатыНомераДней.ПредпраздничныйДень, ЛОЖЬ)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочихДнейЧасов.День) КАК Дней,
		|	СУММА(РабочихДнейЧасов.Часы) КАК Часов,
		|	СУММА(РабочихДнейЧасов.ПредпраздничныйДень) КАК ПредпраздничныхДней
		|ПОМЕСТИТЬ ВТ_РабочееВремяПоГрафику
		|ИЗ
		|	ВТ_РабочихДнейЧасов КАК РабочихДнейЧасов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_РабочееВремяПоГрафику.Дней, 0) КАК Дней,
		|	ЕСТЬNULL(ВТ_РабочееВремяПоГрафику.Часов, 0) КАК Часов,
		|	ЕСТЬNULL(ВТ_РабочееВремяПоГрафику.ПредпраздничныхДней, 0) КАК ПредпраздничныхДней
		|ИЗ
		|	ВТ_РабочееВремяПоГрафику КАК ВТ_РабочееВремяПоГрафику";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РабочихДнейЧасов, Выборка);
	КонецЕсли;
	
	Возврат РабочихДнейЧасов;
	
КонецФункции

Функция КоличествоДнейОтпуска(ДатаНачалаОтпуска, ДатаОкончанияОтпуска, Организация) Экспорт
	
	КоличествоДней = 0;
	
	Если ЗначениеЗаполнено(ДатаНачалаОтпуска) И ДатаНачалаОтпуска <= ДатаОкончанияОтпуска Тогда
		
		КоличествоДней = КонецДня(ДатаОкончанияОтпуска) - НачалоДня(ДатаНачалаОтпуска) + 1;
		КоличествоДней = КоличествоДней / 86400;
		
		ПроизводственныйКалендарь = РасчетЗарплатыДляНебольшихОрганизацийПовтИсп.ПроизводственныйКалендарьОрганизации(Организация);
		Если ПроизводственныйКалендарь <> Неопределено Тогда
			
			РазностьДат = РасчетЗарплатыБазовый.РазностьДатПроизводственныхКалендарейПоВидамДней(
				ПроизводственныйКалендарь , ДатаНачалаОтпуска, ДатаОкончанияОтпуска);
				
			КоличествоДней = КоличествоДней - РазностьДат.Получить(Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КоличествоДней;
	
КонецФункции

Функция РабочихДнейЧасовВПериодеОрганизации(ДатаНачала, ДатаОкончания, Организация) Экспорт
	
	РабочихДнейЧасовВПериоде = Неопределено;
	Если ЗначениеЗаполнено(ДатаНачала) И ДатаНачала <= ДатаОкончания Тогда
		
		КалендарьОрганизации = РасчетЗарплатыДляНебольшихОрганизацийПовтИсп.КалендарьОрганизации(Организация);
		Если КалендарьОрганизации <> Неопределено Тогда
			
			РабочихДнейЧасовВПериоде = РасчетЗарплатыБазовый.РабочихДнейЧасовВПериоде(
				КалендарьОрганизации, ДатаНачала, ДатаОкончания);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РабочихДнейЧасовВПериоде;
	
КонецФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РасчетЗарплатыДляНебольшихОрганизаций.УстановитьФОРасчетЗарплатыДляНебольшихОрганизаций";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.8.50";
	Обработчик.Процедура = "РасчетЗарплатыДляНебольшихОрганизаций.ЗарегистрироватьНачисленияЗарплатыКакУчтенныеПриРасчетеНДФЛ";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("bac17069-e442-4393-9ba5-35272791a6c6");
	Обработчик.Комментарий = НСтр("ru = 'Регистрация Начислений зарплаты как учтенных при расчете НДФЛ документов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.8.112";
	Обработчик.Процедура = "РасчетЗарплатыДляНебольшихОрганизаций.ЗаполнитьТабличнуюЧастьНДФЛВедомостейНаВыплатуЗарплаты";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.2";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("aa691371-3704-4445-bbee-7e35030f3c22");
	Обработчик.Процедура = "РасчетЗарплатыДляНебольшихОрганизаций.СоздатьНачислениеОтпускБезОплаты";
	Обработчик.Комментарий = НСтр("ru='Создает начисление ""Отпуск без оплаты""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.133";
	Обработчик.Процедура = "РасчетЗарплатыДляНебольшихОрганизаций.ЗаполнитьУдержаноОтпусковИБольничных";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("272531fe-ad76-4e3e-bbfa-3a099afaba66");
	Обработчик.Комментарий = НСтр("ru = 'Заполняет реквизит ""Удержано"" отпусков и больничных листов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.14.14";
	Обработчик.Процедура = "РасчетЗарплатыДляНебольшихОрганизаций.СоздатьГрафикиРаботыОрганизаций";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0c737488-ca51-4722-b545-f13d6cd9dee8");
	Обработчик.Комментарий = НСтр("ru = 'Создание графиков работы организаций.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.14.20";
	Обработчик.Процедура = "ПланыВидовРасчета.Начисления.ЗаполнитьВидДоходаИсполнительногоПроизводства";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение вида дохода исполнительного производства в начислениях'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.22.43";
	Обработчик.Процедура = "ПланыВидовРасчета.Начисления.ЗаполнитьВидДоходаИсполнительногоПроизводства2022";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение новых видов дохода исполнительного производства в начислениях'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.25.3";
	Обработчик.Процедура = "ПланыВидовРасчета.Начисления.УточнитьКодДоходаНДФЛОтпускаАУСН";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Комментарий = НСтр("ru = 'Уточнение кодов доходов начислений при АУСН'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.22";
	Обработчик.Процедура = "ПланыВидовРасчета.Начисления.УточнитьКодДоходаНДФЛКатегориюОписаниеРКиСН";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Комментарий = НСтр("ru = 'Уточнение кода дохода, категории по НДФЛ для РК и СН'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.57";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("76e8bf53-0ea2-4f08-a8d6-116e3873739b");
	Обработчик.Процедура = "РасчетЗарплатыДляНебольшихОрганизаций.СоздатьНачислениеКомпенсацияОтпуска";
	Обработчик.Комментарий = НСтр("ru='Создает начисление ""Компенсация отпуска""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.36.2";
	Обработчик.Процедура = "РасчетЗарплаты.ЗаполнитьПланВидовРасчета";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.36.35";
	Обработчик.Процедура = "РасчетЗарплатыДляНебольшихОрганизаций.ЗаполнитьОсновнойВидРасчетаНачисленийОплатыДолейРКСН";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет реквизит ОсновнойВидРасчета в начислениях оплаты долей РКСН'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.36.36";
	Обработчик.Процедура = "РасчетЗарплатыДляНебольшихОрганизаций.СоздатьНачисленияОплатыДолейРКиСН";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("5f886479-be84-407f-ba34-756ec6b9e536");
	Обработчик.Комментарий = НСтр("ru = 'Создание начислений оплаты долей РКСН.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.37.36";
	Обработчик.Процедура = "РасчетЗарплатыДляНебольшихОрганизаций.СоздатьНачисленияДолейРКиСНБЛ";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ae82f281-22e3-11f1-8174-4cedfb43b11a");
	Обработчик.Комментарий = НСтр("ru = 'Создание начислений оплаты долей РКСН для больничного.'");
	
КонецПроцедуры

Процедура ЗарегистрироватьНачисленияЗарплатыКакУчтенныеПриРасчетеНДФЛ(ПараметрыОбновления = Неопределено) Экспорт
	
	УчетНДФЛ.ЗарегистрироватьДокументыКакУчтенныеПриРасчетеНДФЛ("НачислениеЗарплаты", ПараметрыОбновления)
	
КонецПроцедуры

Процедура ЗаполнитьУдержаноОтпусковИБольничных(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 500
		|	БольничныйЛистНДФЛ.Ссылка КАК Ссылка,
		|	СУММА(БольничныйЛистНДФЛ.Налог) КАК Удержано
		|ИЗ
		|	Документ.БольничныйЛист.НДФЛ КАК БольничныйЛистНДФЛ
		|
		|СГРУППИРОВАТЬ ПО
		|	БольничныйЛистНДФЛ.Ссылка
		|
		|ИМЕЮЩИЕ
		|	ЕСТЬNULL(СУММА(БольничныйЛистНДФЛ.Налог), 0) <> БольничныйЛистНДФЛ.Ссылка.Удержано
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 500
		|	ОтпускНДФЛ.Ссылка,
		|	СУММА(ОтпускНДФЛ.Налог)
		|ИЗ
		|	Документ.Отпуск.НДФЛ КАК ОтпускНДФЛ
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтпускНДФЛ.Ссылка
		|
		|ИМЕЮЩИЕ
		|	ЕСТЬNULL(СУММА(ОтпускНДФЛ.Налог), 0) <> ОтпускНДФЛ.Ссылка.Удержано";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 500", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, Выборка.Ссылка.Метаданные().ПолноеИмя(), "Ссылка", Выборка.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектДокумента.Удержано = Выборка.Удержано;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДокумента);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьГрафикиРаботыОрганизаций(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Организации.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА УдалитьПроизводственныеКалендариОрганизаций.ПроизводственныйКалендарь.Код ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ПроизводственныеКалендари.ПустаяСсылка)
		|		ИНАЧЕ УдалитьПроизводственныеКалендариОрганизаций.ПроизводственныйКалендарь
		|	КОНЕЦ КАК ПроизводственныйКалендарь
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Календари КАК Календари
		|		ПО Организации.Ссылка = Календари.ВладелецГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдалитьПроизводственныеКалендариОрганизаций КАК УдалитьПроизводственныеКалендариОрганизаций
		|		ПО Организации.Ссылка = УдалитьПроизводственныеКалендариОрганизаций.Организация
		|ГДЕ
		|	Календари.Ссылка ЕСТЬ NULL";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Пока Выборка.Следующий() Цикл
		
		НовыйГрафикРаботы = НовыйГрафикРаботыОрганизации(Выборка.Ссылка, Выборка.ПроизводственныйКалендарь);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйГрафикРаботы, Истина, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

#Область ЗаполнитьТабличнуюЧастьНДФЛВедомостейНаВыплатуЗарплаты

Процедура ЗаполнитьТабличнуюЧастьНДФЛВедомостейНаВыплатуЗарплаты() Экспорт
	
	// Для оплаченных ведомостей 
	// НДФЛ заполняем по движениям платежных документов.
	ЗаполнитьТабличнуюЧастьНДФЛВедомостейНаВыплатуЗарплатыОплаченных();		
	
	// Для проведенных, но не оплаченных ведомостей
	// НДФЛ рассчитываем по данным учета.
	ЗаполнитьТабличнуюЧастьНДФЛВедомостейНаВыплатуЗарплатыНеОплаченных();		
	
	// Не проведенные ведомости не обновляем.
	
КонецПроцедуры	

Процедура ЗаполнитьТабличнуюЧастьНДФЛВедомостейНаВыплатуЗарплатыОплаченных()
	
	КолонкиНДФЛ =
		"ФизическоеЛицо,
		|МесяцНалоговогоПериода,
		|КатегорияДохода,
		|СтавкаНалогообложенияРезидента,
		|КодДохода,
		|Сумма,
		|Подразделение,
		|ДокументОснование,
		|РегистрацияВНалоговомОргане,
		|Сумма";
	
	// Выбираем оплаченные ведомости с пустым НДФЛ
	Запрос = ЗапросВедомостейНаВыплатуЗарплатыСПустымНДФЛ(Истина);
	ВедомостиБезНДФЛ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	// Получаем выдачу зарплаты по этим ведомостям.
	Запрос.УстановитьПараметр("ВедомостиБезНДФЛ", ВедомостиБезНДФЛ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаВедомостей.Регистратор КАК Регистратор,
	|	ОплатаВедомостей.Ведомость КАК Ведомость,
	|	ОплатаВедомостей.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты КАК ОплатаВедомостей
	|ГДЕ
	|	ОплатаВедомостей.Ведомость В(&ВедомостиБезНДФЛ)";		
	ОплатаВедомостей = Запрос.Выполнить().Выгрузить();
	ОплатаВедомостей.Индексы.Добавить("Регистратор");

	// Определяем платежные документы, регистрировавшие оплаты по обновляемым ведомостям.
	ПлатежныеДокументы = ОбщегоНазначения.ВыгрузитьКолонку(ОплатаВедомостей, "Регистратор", Истина);
	
	// Переносим НДФЛ из платежных документов в ведомости
	
	// Накопитель НДФЛ ведомостей (ведомость - таблица НДФЛ)
	НФДЛВедомостей = Новый Соответствие;
	Ведомость = Документы.ВедомостьНаВыплатуЗарплатыВКассу.СоздатьДокумент();
	Для Каждого ВедомостьБезНДФЛ Из ВедомостиБезНДФЛ Цикл
		 НФДЛВедомостей.Вставить(
		 	ВедомостьБезНДФЛ, 
			Ведомость.НДФЛ.ВыгрузитьКолонки(КолонкиНДФЛ));
	КонецЦикла;
	
	// Из движений платежного документа переносим налог
	// в накопитель НДФЛ оплаченных этим документом ведомостей
	Для Каждого ПлатежныйДокумент Из ПлатежныеДокументы Цикл
		
		// Ведомости и физические лица, зарплата которым выдана текущим документом
		ОплатыПлатежногоДокумента = ОплатаВедомостей.НайтиСтроки(Новый Структура("Регистратор", ПлатежныйДокумент));
		Ведомости = ОбщегоНазначения.ВыгрузитьКолонку(ОплатыПлатежногоДокумента, "Ведомость",      Истина);
		ФизЛица   = ОбщегоНазначения.ВыгрузитьКолонку(ОплатыПлатежногоДокумента, "ФизическоеЛицо", Истина);
		
		// суммы к выплате оплаченных документом ведомостей
		Выплаты = ВзаиморасчетыССотрудниками.ДанныеВедомостейДляОплатыДокументом(ПлатежныйДокумент, Ведомости, ФизЛица, Неопределено);
		Выплаты.Свернуть("Ведомость, ФизическоеЛицо", "СуммаКВыплате");
		Выплаты.Индексы.Добавить("ФизическоеЛицо");
		
		// удержанный документом налог
		НДФЛДокумента = РегистрыНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СоздатьНаборЗаписей();
		НДФЛДокумента.Отбор.Регистратор.Установить(ПлатежныйДокумент);
		НДФЛДокумента.Прочитать();
		НДФЛДокумента = НДФЛДокумента.Выгрузить(, СтрЗаменить(КолонкиНДФЛ, Символы.ПС, " ")); // СтрЗаменить - обход ошибки платформы.
		НДФЛДокумента.Индексы.Добавить("ФизическоеЛицо");
		
		// Пополняем налогами физлица накопитель НДФЛ ведомостей
		Для Каждого ФизЛицо Из ФизЛица Цикл
			НДФЛФизлица = НДФЛДокумента.Скопировать(Новый Структура("ФизическоеЛицо", ФизЛицо));
			ВедомостиСФизЛицом = Выплаты.Скопировать(Новый Структура("ФизическоеЛицо", ФизЛицо), "Ведомость, СуммаКВыплате");
			ВедомостиСФизЛицом.Свернуть("Ведомость", "СуммаКВыплате");
			
			Если ВедомостиСФизЛицом.Количество() = 1 Тогда
				// Физлицо в платежном документе проходит по единственной ведомости,
				// весь налог работника можно переносить в эту ведомость.
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
					НДФЛФизлица, 
					НФДЛВедомостей[ВедомостиСФизЛицом[0].Ведомость]);
			Иначе	
				// Физлицо входит в несколько ведомостей, оплаченных одним документом,
				// налог работника необходимо распределить между этими ведомостями.
				// Разносим пропорционально суммам выплат по физлицу в ведомостях.
				// Не строго, но правдоподобно.
				ОбщаяСуммаНалогаФизлица = НДФЛФизлица.Итог("Сумма");
				СуммыНалогаПоВедомостям = 
					ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
						ОбщаяСуммаНалогаФизлица,
						ВедомостиСФизЛицом.ВыгрузитьКолонку("СуммаКВыплате"),
						0);
				Если СуммыНалогаПоВедомостям = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Для Индекс = 0 По ВедомостиСФизЛицом.Количество()-1 Цикл
					НДФЛВедомости = НДФЛФизлица.Скопировать();
					ЗарплатаКадры.РазнестиСуммуПоБазе(СуммыНалогаПоВедомостям[Индекс], НДФЛВедомости, "Сумма", 0);
					ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
						НДФЛВедомости, 
						НФДЛВедомостей[ВедомостиСФизЛицом[Индекс].Ведомость]);
					КонецЦикла;
			КонецЕсли		
		КонецЦикла;	
			
	КонецЦикла;	
	
	// Собранный налог переносим в ведомости
	Для Каждого НФДЛВедомости Из НФДЛВедомостей Цикл
		
		Ведомость = НФДЛВедомости.Ключ.ПолучитьОбъект();
		
		Ведомость.УстановитьНДФЛ(НФДЛВедомости.Значение);
		
		// Ведомости могла быть оплачена частично.
		// Для физлиц без налога рассчитываем его.
		
		ФизЛицаВедомости = Ведомость.Состав.ВыгрузитьКолонку("ФизическоеЛицо");
		ФизЛицаНДФЛ      = Ведомость.НДФЛ.ВыгрузитьКолонку("ФизическоеЛицо");
		ФизЛицаБезНалога = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ФизЛицаВедомости, ФизЛицаНДФЛ);
		ФизЛицаБезНалога = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ФизЛицаБезНалога);
		
		Если ФизЛицаБезНалога.Количество() > 0 Тогда
			ЗаполнитьТабличнуюЧастьНДФЛВедомостиНаВыплатуЗарплатыРасчетно(Ведомость, ФизЛицаБезНалога);
		КонецЕсли;	
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Ведомость);
		
	КонецЦикла	
	
КонецПроцедуры	

Процедура ЗаполнитьТабличнуюЧастьНДФЛВедомостейНаВыплатуЗарплатыНеОплаченных()

	// Выбираем не оплаченные ведомости
	Запрос = ЗапросВедомостейНаВыплатуЗарплатыСПустымНДФЛ(Ложь);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Ведомость = Выборка.Ссылка.ПолучитьОбъект();
		
		ЗаполнитьТабличнуюЧастьНДФЛВедомостиНаВыплатуЗарплатыРасчетно(Ведомость);
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Ведомость);
		
	КонецЦикла	
	
КонецПроцедуры	

Функция ЗапросВедомостейНаВыплатуЗарплатыСПустымНДФЛ(Оплаченные)
	
	// Выбираем для обновления проведенные ведомости,
	// имеющие заполненную ТЧ Зарплата и пустую ТЧ НДФЛ
	// наличие оплаты проверяем в зависимости от параметра вызова.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплаты.Ссылка КАК Ссылка,
	|	ВедомостьНаВыплатуЗарплаты.Дата КАК Дата
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк КАК ВедомостьНаВыплатуЗарплаты
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплаты.Проведен
	|	И &Оплаченные В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА КАК ЕстьОплата
	|			ИЗ
	|				РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты КАК ОплатаВедомостей
	|			ГДЕ
	|				ОплатаВедомостей.Ведомость = ВедомостьНаВыплатуЗарплаты.Ссылка)
	|	И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА КАК ЕстьЗарплата
	|			ИЗ
	|				Документ.ВедомостьНаВыплатуЗарплатыВБанк.Зарплата КАК ВедомостьЗарплата
	|			ГДЕ
	|				ВедомостьЗарплата.Ссылка = ВедомостьНаВыплатуЗарплаты.Ссылка)
	|	И НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА КАК ЕстьНДФЛ
	|				ИЗ
	|					Документ.ВедомостьНаВыплатуЗарплатыВБанк.НДФЛ КАК ВедомостьСостав
	|				ГДЕ
	|					ВедомостьСостав.Ссылка = ВедомостьНаВыплатуЗарплаты.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплаты.Ссылка,
	|	ВедомостьНаВыплатуЗарплаты.Дата
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВКассу КАК ВедомостьНаВыплатуЗарплаты
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплаты.Проведен
	|	И &Оплаченные В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА КАК ЕстьОплата
	|			ИЗ
	|				РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты КАК ОплатаВедомостей
	|			ГДЕ
	|				ОплатаВедомостей.Ведомость = ВедомостьНаВыплатуЗарплаты.Ссылка)
	|	И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА КАК ЕстьЗарплата
	|			ИЗ
	|				Документ.ВедомостьНаВыплатуЗарплатыВКассу.Зарплата КАК ВедомостьЗарплата
	|			ГДЕ
	|				ВедомостьЗарплата.Ссылка = ВедомостьНаВыплатуЗарплаты.Ссылка)
	|	И НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА КАК ЕстьНДФЛ
	|				ИЗ
	|					Документ.ВедомостьНаВыплатуЗарплатыВКассу.НДФЛ КАК ВедомостьСостав
	|				ГДЕ
	|					ВедомостьСостав.Ссылка = ВедомостьНаВыплатуЗарплаты.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка";
	
	Если Оплаченные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Оплаченные", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Оплаченные", "НЕ ИСТИНА");
	КонецЕсли;
	
	Возврат Запрос
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьНДФЛВедомостиНаВыплатуЗарплатыРасчетно(Ведомость, ФизическиеЛица = Неопределено)
	
	Если Ведомость.ВводНачальныхДанных Тогда
		Возврат
	КонецЕсли;
	
	// Проверка заполнения обязательных полей, необходимых для расчета НДФЛ
	Если Не	ЗначениеЗаполнено(Ведомость.Организация)
		Или Не ЗначениеЗаполнено(Ведомость.СпособВыплаты)
		Или Не ЗначениеЗаполнено(Ведомость.ПериодРегистрации)
		Или Не ЗначениеЗаполнено(Ведомость.Дата) Тогда
		Возврат
	КонецЕсли;
	
	// Контроль битых ссылок
	ОбязательныеСсылки = Новый Массив;
	ОбязательныеСсылки.Добавить(Ведомость.Организация);
	ОбязательныеСсылки.Добавить(Ведомость.СпособВыплаты);
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ОбязательныеСсылки, "ПометкаУдаления").Количество()
		<> ОбязательныеСсылки.Количество() Тогда
		Возврат
	КонецЕсли;	
	
	Если ФизическиеЛица = Неопределено Тогда
		СтрокиЗарплатыФизЛиц = Неопределено
	Иначе
		СтрокиЗарплатыФизЛиц = Новый Массив;
		Для Каждого СтрокаЗарплаты Из Ведомость.Зарплата Цикл
			Если ФизическиеЛица.Найти(СтрокаЗарплаты.ФизическоеЛицо) <> Неопределено Тогда
				СтрокиЗарплатыФизЛиц.Добавить(СтрокаЗарплаты);
			КонецЕсли
		КонецЦикла;	
	КонецЕсли;	
	
	Зарплата = 
		Ведомость.Зарплата.Выгрузить(
			СтрокиЗарплатыФизЛиц,
			"ФизическоеЛицо,
			|ДокументОснование, 
			|СтатьяФинансирования, 
			|СтатьяРасходов, 
			|ВидДоходаИсполнительногоПроизводства,
			|КВыплате");
	
	МенеджерВедомости = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ведомость.Ссылка);
	ПараметрыЗаполнения = МенеджерВедомости.ПараметрыЗаполненияПоОбъекту(Ведомость);
	
	НДФЛ = ВедомостьНаВыплатуЗарплаты.НалогиКУдержанию(
		Зарплата, 
		ПараметрыЗаполнения.ОписаниеОперации, 
		ПараметрыЗаполнения.ПараметрыРасчетаНДФЛ, 
		ПараметрыЗаполнения.Финансирование,
		Ведомость.Ссылка);
		
	Ведомость.УстановитьНДФЛ(НДФЛ, ФизическиеЛица);
	
КонецПроцедуры	

#КонецОбласти

Процедура СоздатьНачислениеОтпускБезОплаты(ПараметрыОбновления = Неопределено) Экспорт
	
	ПланыВидовРасчета.Начисления.СоздатьНачислениеОтпускБезОплаты();
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

Процедура СоздатьНачислениеКомпенсацияОтпуска(ПараметрыОбновления = Неопределено) Экспорт
	
	ПланыВидовРасчета.Начисления.СоздатьНачислениеКомпенсацияОтпуска();
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

#КонецОбласти

Процедура ПодготовитьНачисленияАУСН() Экспорт
	
	КатегорииДохода = Новый Массив;
	КатегорииДохода.Добавить(Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда);
	КатегорииДохода.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы);
	КатегорииДохода.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности);
	КатегорииДохода.Добавить(Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КатегорииДохода", КатегорииДохода);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Начисления.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачисленияАУСН КАК НачисленияАУСН
		|		ПО Начисления.Ссылка = НачисленияАУСН.Начисление
		|ГДЕ
		|	Начисления.КатегорияДохода В(&КатегорииДохода)
		|	И НачисленияАУСН.НачислениеАУСН ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		
		НачатьТранзакцию();
		Попытка
			
			Пока Выборка.Следующий() Цикл
				НовоеНачислениеПриАУСН(Выборка.Ссылка);
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Подготовка начислений АУСН'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(Ошибка));
			
			ОтменитьТранзакцию();
			ВызватьИсключение ПодробноеПредставлениеОшибки(Ошибка);
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьНачислениеПриАУСН(НачислениеОбъект) Экспорт
	
	Если Не ЭтоКонтролируемаяКатегорияДоходаПриАУСН(НачислениеОбъект.КатегорияДохода) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Начисление", НачислениеОбъект.Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачисленияАУСН.НачислениеАУСН КАК Начисление
		|ИЗ
		|	РегистрСведений.НачисленияАУСН КАК НачисленияАУСН
		|ГДЕ
		|	НачисленияАУСН.Начисление = &Начисление
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачисленияАУСН.Начисление
		|ИЗ
		|	РегистрСведений.НачисленияАУСН КАК НачисленияАУСН
		|ГДЕ
		|	НачисленияАУСН.НачислениеАУСН = &Начисление
		|	И НЕ НачисленияАУСН.Начисление В
		|				(ВЫБРАТЬ
		|					РегистрСведений.НачисленияАУСН.НачислениеАУСН
		|				ИЗ
		|					РегистрСведений.НачисленияАУСН)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		НовоеНачислениеПриАУСН(НачислениеОбъект);
	Иначе
		Выборка.Следующий();
		ЗеркальноеНачисление = Выборка.Начисление.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ЗеркальноеНачисление, НачислениеОбъект, , "КатегорияДохода,Ссылка,ВерсияДанных");
		ЗеркальноеНачисление.ДополнительныеСвойства.Вставить("ЗаписьНачисленияПриАУСН");
		ЗеркальноеНачисление.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПрименяетсяАУСН() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	РегистрСведений.ПрименяемыеТарифыСтраховыхВзносов КАК ПрименяемыеТарифыСтраховыхВзносов
		|ГДЕ
		|	ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.АУСН)";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПрименяетсяАУСНИДругиеВидыТарифов()
	
	Если Не ПрименяетсяАУСН() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	РегистрСведений.ПрименяемыеТарифыСтраховыхВзносов КАК ПрименяемыеТарифыСтраховыхВзносов
		|ГДЕ
		|	ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа <> ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.АУСН)";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура УстановитьОтображениеЭлементовУправленияФормыНачисления(УправляемаяФорма) Экспорт
	
	Если Не ПрименяетсяАУСН() Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеКатегории = ДоступныеКатегорииДоходов(УправляемаяФорма.Объект.КатегорияДохода);
	Если ДоступныеКатегории.Количество() > 1 Тогда
		
		ПараметрыВыбора = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ДоступныеКатегории)));
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			УправляемаяФорма.Элементы,
			"КатегорияДохода",
			"ПараметрыВыбора",
			Новый ФиксированныйМассив(ПараметрыВыбора));
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			УправляемаяФорма.Элементы,
			"КатегорияДохода",
			"ТолькоПросмотр",
			Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			УправляемаяФорма.Элементы,
			"КатегорияДохода",
			"ТолькоПросмотр",
			ЭтоКонтролируемаяКатегорияДоходаПриАУСН(УправляемаяФорма.Объект.КатегорияДохода));
	КонецЕсли;
	
КонецПроцедуры

Функция ДоступныеКатегорииДоходов(КатегорияДохода)
	
	СписокКатегорий = Новый Массив;
	Если КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы 
		Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности Тогда
		
		СписокКатегорий.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы);
		СписокКатегорий.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности);
	КонецЕсли;
	
	Возврат СписокКатегорий;
	
КонецФункции

Процедура ФормаДокументаУстановитьПараметрыВыбораНачислений(УправляемаяФорма, Организация, Период) Экспорт
	
	Если Не ПрименяетсяАУСН() Тогда
		Возврат;
	КонецЕсли;
	
	КатегорииДоходовНДФЛ = КатегорииДоходовНДФЛПриАУСН(Организация, Период);
	ПараметрыВыбора = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый ПараметрВыбора("Отбор.КатегорияДохода", Новый ФиксированныйМассив(КатегорииДоходовНДФЛ)));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		УправляемаяФорма.Элементы,
		"НачисленияНачисление",
		"ПараметрыВыбора",
		Новый ФиксированныйМассив(ПараметрыВыбора));
	
КонецПроцедуры

Процедура ДополнитьОтборНачислений(ОтборНачислений, Организация, Период) Экспорт
	
	Если Не ПрименяетсяАУСН() Тогда
		Возврат;
	КонецЕсли;
	
	ОтборНачислений.Вставить("КатегорияДохода", КатегорииДоходовНДФЛПриАУСН(Организация, Период));
	
КонецПроцедуры

Функция КатегорииДоходовНДФЛПриАУСН(Организация, Период)
	
	КатегорииДоходовНДФЛ = Перечисления.КатегорииДоходовНДФЛ.ВсеЗначения();
	КатегорииДоходовНДФЛ.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПустаяСсылка());
	Если ОрганизацияПрименяетАУСН(Организация, Период) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(
			КатегорииДоходовНДФЛ, Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(
			КатегорииДоходовНДФЛ, Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(
			КатегорииДоходовНДФЛ, Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(
			КатегорииДоходовНДФЛ, Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(
			КатегорииДоходовНДФЛ, Перечисления.КатегорииДоходовНДФЛ.ОплатаТрудаАУСН);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(
			КатегорииДоходовНДФЛ, Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(
			КатегорииДоходовНДФЛ, Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН);
	КонецЕсли;
	
	Возврат КатегорииДоходовНДФЛ;
	
КонецФункции

Процедура НачисленияФормаСпискаПриСозданииНаСервере(УправляемаяФорма) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		УправляемаяФорма.Элементы,
		"КатегорияДохода",
		"Видимость",
		ПрименяетсяАУСНИДругиеВидыТарифов());
	
КонецПроцедуры

Функция ЭтоКонтролируемаяКатегорияДоходаПриАУСН(КатегорияДохода)
	
	Возврат КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда
		Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ОплатаТрудаАУСН
		Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы
		Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности
		Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН
		Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки
		Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН;
	
КонецФункции

Функция НовоеНачислениеПриАУСН(Источник)
	
	КатегорияДохода = Источник.КатегорияДохода;
	Если Источник.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда Тогда
		
		КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ОплатаТрудаАУСН;
	ИначеЕсли Источник.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы
		Или Источник.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности Тогда
		
		КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН;
	ИначеЕсли Источник.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ОплатаТрудаАУСН Тогда
		
		КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда;
	ИначеЕсли Источник.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН Тогда
		
		КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы;
	ИначеЕсли Источник.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки Тогда
		
		КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН;
	ИначеЕсли Источник.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН Тогда
		
		КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки;
		
	КонецЕсли;
	
	КодДоходаНДФЛ = Источник.КодДоходаНДФЛ;
	Если Источник.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска
		Или Источник.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска Тогда
		Если КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности
			Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы Тогда
			КодДоходаНДФЛ = УчетНДФЛПовтИсп.Доход2012();
		ИначеЕсли КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы
			И Источник.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска Тогда
			КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.Код2013;
		Иначе
			КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	ОсновнойВидРасчета = Источник.ОсновнойВидРасчета;
	Если Источник.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиРайонногоКоэффициентаВСреднемЗаработке Или
		Источник.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиСевернойНадбавкиВСреднемЗаработке Тогда
		
		НачисленияПриАУСН = НачисленияПриАУСН(Истина);
		ОсновнойВидРасчета = НачисленияПриАУСН(Истина).Получить(Источник.ОсновнойВидРасчета);
	КонецЕсли;
	
	Отбор = Новый Структура("КатегорияНачисленияИлиНеоплаченногоВремени,ОсновнойВидРасчета,КатегорияДохода",
		Источник.КатегорияНачисленияИлиНеоплаченногоВремени, ОсновнойВидРасчета, КатегорияДохода);
	Начисления = ПланыВидовРасчета.Начисления.НачисленияПоОтбору(Отбор);
	Если ЗначениеЗаполнено(Начисления) Тогда
		НачислениеАУСНСсылка = Начисления[0];
	Иначе
		НачислениеАУСН = Источник.Скопировать();
		НачислениеАУСН.КатегорияДохода = КатегорияДохода;
		НачислениеАУСН.КатегорияНачисленияИлиНеоплаченногоВремени = Источник.КатегорияНачисленияИлиНеоплаченногоВремени;
		НачислениеАУСН.КодДоходаНДФЛ = КодДоходаНДФЛ;
		НачислениеАУСН.ОсновнойВидРасчета = ОсновнойВидРасчета;
		НачислениеАУСН.ДополнительныеСвойства.Вставить("ЗаписьНачисленияПриАУСН");
		НачислениеАУСН.Записать();
		НачислениеАУСНСсылка = НачислениеАУСН.Ссылка;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.НачисленияАУСН.СоздатьМенеджерЗаписи();
	Если КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда
		Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы 
		Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности
		Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки Тогда
		
		МенеджерЗаписи.Начисление = НачислениеАУСНСсылка;
		МенеджерЗаписи.НачислениеАУСН = Источник.Ссылка;
	Иначе
		
		МенеджерЗаписи.Начисление = Источник.Ссылка;
		МенеджерЗаписи.НачислениеАУСН = НачислениеАУСНСсылка;
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	
	Возврат НачислениеАУСНСсылка;
	
КонецФункции

Функция ОрганизацияПрименяетАУСН(Организация, Период)
	
	ПрименяемыйТариф = РегистрыСведений.ПрименяемыеТарифыСтраховыхВзносов.ПолучитьПоследнее(
		Период,
		Новый Структура("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация)));
	
	Возврат ПрименяемыйТариф.ВидТарифа = Справочники.ВидыТарифовСтраховыхВзносов.АУСН;
	
КонецФункции

Функция НачисленияОрганизацииПриАУСН(Организация, МесяцНачисления)
	
	ПрименяетсяАУСН = ОрганизацияПрименяетАУСН(Организация, МесяцНачисления);
	Возврат НачисленияПриАУСН(ПрименяетсяАУСН);
	
КонецФункции

Функция НачисленияПриАУСН(ПрименяетсяАУСН)
	
	НачисленияОрганизации = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачисленияАУСН.Начисление КАК Начисление,
		|	НачисленияАУСН.НачислениеАУСН КАК НачислениеАУСН
		|ИЗ
		|	РегистрСведений.НачисленияАУСН КАК НачисленияАУСН";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ПрименяетсяАУСН Тогда
			НачисленияОрганизации.Вставить(Выборка.Начисление, Выборка.НачислениеАУСН);
		Иначе
			НачисленияОрганизации.Вставить(Выборка.НачислениеАУСН, Выборка.Начисление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НачисленияОрганизации;
	
КонецФункции

Процедура ЗаполнитьНачисленияДокументаПоОрганизации(Начисления, Объект)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "МесяцНачисления") Тогда
		МесяцНачисления = Объект.МесяцНачисления;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ПериодРегистрации") Тогда
		МесяцНачисления = Объект.ПериодРегистрации;
	Иначе
		Возврат;
	КонецЕсли;
	
	НачисленияОрганизации = НачисленияОрганизацииПриАУСН(Объект.Организация, МесяцНачисления);
	Для Каждого СтрокаНачисления Из Начисления Цикл
		НачислениеАУСН = НачисленияОрганизации.Получить(СтрокаНачисления.Начисление);
		Если НачислениеАУСН <> Неопределено Тогда
			СтрокаНачисления.Начисление = НачислениеАУСН;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция КатегорииДоходаНадбавок(Организация, Период) Экспорт
	
	СписокКатегорий = Новый Массив;
	Если ОрганизацияПрименяетАУСН(Организация, Период) Тогда
		СписокКатегорий.Добавить(Перечисления.КатегорииДоходовНДФЛ.ОплатаТрудаАУСН);
		СписокКатегорий.Добавить(Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН);
	Иначе
		СписокКатегорий.Добавить(Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда);
		СписокКатегорий.Добавить(Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки);
	КонецЕсли;
	Возврат СписокКатегорий;
	
КонецФункции

Процедура СоздатьНачисленияОплатыДолейРКиСН(ПараметрыОбновления = Неопределено) Экспорт
	
	ПланыВидовРасчета.Начисления.СоздатьНачисленияОплатыДолейРКиСН();
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

Процедура СоздатьНачисленияДолейРКиСНБЛ(ПараметрыОбновления = Неопределено) Экспорт
	
	Категории = Новый Массив;
	Категории.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛиста);
	Категории.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя);
	Категории.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоНесчастныйСлучайНаПроизводстве);
	Категории.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоПрофзаболевание);
	ПланыВидовРасчета.Начисления.СоздатьНачисленияОплатыДолейРКиСН(Категории);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

Процедура ЗаполнитьОсновнойВидРасчетаНачисленийОплатыДолейРКСН(ПараметрыОбновления = Неопределено) Экспорт
	
	ВидыОперацийПоЗарплате = Новый Массив;
	ВидыОперацийПоЗарплате.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск);
	ВидыОперацийПоЗарплате.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка КАК Ссылка,
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
		|	Начисления.ВидОперацииПоЗарплате КАК ВидОперацииПоЗарплате,
		|	ВЫБОР
		|		КОГДА Начисления.КатегорияДохода В (&КатегорииАУСН)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоАУСН
		|ПОМЕСТИТЬ ВТНачисленияДолейРКСН
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В(&КатегорииНачисленийОплатыДолейРКиСН)
		|	И Начисления.ВидОперацииПоЗарплате В(&ВидыОперацийПоЗарплате)
		|	И Начисления.ОсновнойВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяССылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Начисления.Ссылка КАК Ссылка,
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
		|	Начисления.ВидОперацииПоЗарплате КАК ВидОперацииПоЗарплате,
		|	ВЫБОР
		|		КОГДА Начисления.КатегорияДохода В (&КатегорииАУСН)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоАУСН
		|ПОМЕСТИТЬ ВТОсновныеВидыРасчета
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В(&КатегорииНачисленийДляВыделенияРКиСН)
		|	И Начисления.ВидОперацииПоЗарплате В(&ВидыОперацийПоЗарплате)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНачисленияДолейРКСН.Ссылка КАК НачислениеОплатыДолиРКСН,
		|	ВТОсновныеВидыРасчета.Ссылка КАК ОсновнойВидРасчета
		|ИЗ
		|	ВТНачисленияДолейРКСН КАК ВТНачисленияДолейРКСН
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеВидыРасчета КАК ВТОсновныеВидыРасчета
		|		ПО ВТНачисленияДолейРКСН.ВидОперацииПоЗарплате = ВТОсновныеВидыРасчета.ВидОперацииПоЗарплате
		|			И ВТНачисленияДолейРКСН.ЭтоАУСН = ВТОсновныеВидыРасчета.ЭтоАУСН";
	
	Запрос.УстановитьПараметр("ВидыОперацийПоЗарплате", ВидыОперацийПоЗарплате);
	Запрос.УстановитьПараметр("КатегорииНачисленийОплатыДолейРКиСН", ПланыВидовРасчета.Начисления.КатегорииНачисленийОплатыДолейРКиСН());
	Запрос.УстановитьПараметр("КатегорииАУСН", Перечисления.КатегорииДоходовНДФЛ.ДоходыАУСН());
	Запрос.УстановитьПараметр("КатегорииНачисленийДляВыделенияРКиСН", ПланыВидовРасчета.Начисления.КатегорииНачисленийДляВыделенияРКиСН());
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ОсновнойВидРасчета) Тогда
			НачислениеОбъект = Выборка.НачислениеОплатыДолиРКСН.ПолучитьОбъект();
			НачислениеОбъект.ОсновнойВидРасчета = Выборка.ОсновнойВидРасчета;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НачислениеОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

Функция ЗапросВТНачисленияОрганизаций(ИмяВременнойТаблицыОтборовСотрудников, ПоляОтбораСотрудников) Экспорт
	
	КатегорииДоходаАУСН = Новый Массив;
	КатегорииДоходаАУСН.Добавить(Перечисления.КатегорииДоходовНДФЛ.ОплатаТрудаАУСН);
	КатегорииДоходаАУСН.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН);
	КатегорииДоходаАУСН.Добавить(Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КатегорииДоходаАУСН", КатегорииДоходаАУСН);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПрименяемыеТарифыСтраховыхВзносов.Период) КАК Период,
		|	КадровыеДанныеСотрудников.Сотрудник.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ПОМЕСТИТЬ ВТПериодыТарифов
		|ИЗ
		|	ВТСотрудникиОрганизации КАК КадровыеДанныеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрименяемыеТарифыСтраховыхВзносов КАК ПрименяемыеТарифыСтраховыхВзносов
		|		ПО КадровыеДанныеСотрудников.Сотрудник.ГоловнаяОрганизация = ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация
		|			И КадровыеДанныеСотрудников.Период >= ПрименяемыеТарифыСтраховыхВзносов.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	КадровыеДанныеСотрудников.Сотрудник.ГоловнаяОрганизация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыТарифов.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.АУСН)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПрименяетсяАУСН
		|ПОМЕСТИТЬ ВТПрименениеАУСНОрганизаций
		|ИЗ
		|	ВТПериодыТарифов КАК ПериодыТарифов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрименяемыеТарифыСтраховыхВзносов КАК ПрименяемыеТарифыСтраховыхВзносов
		|		ПО ПериодыТарифов.ГоловнаяОрганизация = ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация
		|			И ПериодыТарифов.Период = ПрименяемыеТарифыСтраховыхВзносов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрименениеАУСНОрганизаций.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Начисления.Ссылка КАК Начисление
		|ПОМЕСТИТЬ ВТНачисленияОрганизаций
		|ИЗ
		|	ВТПрименениеАУСНОрганизаций КАК ПрименениеАУСНОрганизаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачисленияАУСН КАК НачисленияАУСН
		|			ПО Начисления.Ссылка = НачисленияАУСН.НачислениеАУСН
		|		ПО (ПрименениеАУСНОрганизаций.ПрименяетсяАУСН)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрименениеАУСНОрганизаций.ГоловнаяОрганизация,
		|	Начисления.Ссылка
		|ИЗ
		|	ВТПрименениеАУСНОрганизаций КАК ПрименениеАУСНОрганизаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО (НЕ Начисления.КатегорияДохода В (&КатегорииДоходаАУСН))
		|ГДЕ
		|	НЕ ПрименениеАУСНОрганизаций.ПрименяетсяАУСН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПериодыТарифов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПрименениеАУСНОрганизаций";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТСотрудникиОрганизации", ИмяВременнойТаблицыОтборовСотрудников);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "КадровыеДанныеСотрудников.Сотрудник", "КадровыеДанныеСотрудников." + ПоляОтбораСотрудников.Сотрудник);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "КадровыеДанныеСотрудников.Период", "КадровыеДанныеСотрудников." + ПоляОтбораСотрудников.Период);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти
