#Область СлужебныйПрограммныйИнтерфейс

Функция АдресДанныхПроверкиМаркируемойПродукцииЧекККМ(ПараметрыСканирования, Знач Объект, УникальныйИдентификатор) Экспорт
	
	ТаблицаШтрихкодов = Объект.АкцизныеМарки.Выгрузить();
	ШтрихкодыМаркируемойПродукции = ТаблицаШтрихкодов.ВыгрузитьКолонку("АкцизнаяМарка");
	
	МассивУпаковок    = Новый Массив();
	КэшИсходныхДанных = Новый Соответствие();
	
	Для Каждого ШтрихкодУпаковки Из ШтрихкодыМаркируемойПродукции Цикл
		
		НовыйЭлемент = ШтрихкодированиеИС.НовыйЭлементКоллекцииУпаковокДляРаспределенияПоТоварам();
		НовыйЭлемент.ШтрихкодУпаковки = ШтрихкодУпаковки;
		
		МассивУпаковок.Добавить(НовыйЭлемент);
		
		КэшИсходныхДанных.Вставить(ШтрихкодУпаковки, НовыйЭлемент);
		
	КонецЦикла;

	Для Каждого СтрокаТаблицы Из ТаблицаШтрихкодов Цикл
		
		ДанныеРезультата = КэшИсходныхДанных.Получить(СтрокаТаблицы.АкцизнаяМарка);
		Если ДанныеРезультата = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДанныеРезультата, СтрокаТаблицы,, "ШтрихкодУпаковки");
		
	КонецЦикла;
	
	ТаблицаМаркируемойПродукции = ПроверкаИПодборПродукцииИС.ТаблицаПродукцииДокумента(Объект);
	
	Для Каждого Элемент Из ТаблицаМаркируемойПродукции Цикл
		
		Если ТипЗнч(Элемент.Серия) = Тип("СправочникСсылка.ПартииНоменклатуры") 
			Или ТипЗнч(Элемент.Серия) = Тип("СправочникСсылка.СерииНоменклатуры") И НЕ ЗначениеЗаполнено(Элемент.Серия) Тогда
			Элемент.Серия = Неопределено;
		КонецЕсли;
		
	КонецЦикла;

	ДанныеХранилища = Новый Структура("МассивУпаковок, ТаблицаМаркируемойПродукции",
		МассивУпаковок,
		ТаблицаМаркируемойПродукции);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеХранилища, УникальныйИдентификатор);
	
КонецФункции

Функция ПолучитьСтруктурнуюЕдиницуПоУмолчанию(Документ) Экспорт
	
	ПравилаЗаполненияДляСтруктурнойЕдиницы = Новый Соответствие;
	ЗаполнениеОбъектовУНФПереопределяемый.ПриОпределенииПравилУстановкиСтруктурныхЕдиниц(
	ПравилаЗаполненияДляСтруктурнойЕдиницы);
	
	ПредопределеннаяСтруктурнаяЕдиница = ПравилаЗаполненияДляСтруктурнойЕдиницы[ТипЗнч(Документ.ПолучитьОбъект())];
	
	Возврат ПредопределеннаяСтруктурнаяЕдиница;
	
КонецФункции

Функция АдресДанныхПроверкиМаркируемойПродукцииРМК(ПараметрыСканирования, Знач Объект, УникальныйИдентификатор) Экспорт
	
	МассивУпаковок = Новый Массив();
	ТаблицаМаркируемойПродукции = ПроверкаИПодборПродукцииИС.ТаблицаПродукцииДокумента(Неопределено);
	
	ДанныеХранилища = Новый Структура("МассивУпаковок, ТаблицаМаркируемойПродукции",
		МассивУпаковок,
		ТаблицаМаркируемойПродукции);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеХранилища, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти