#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	УстановитьПодменюПодсистемыПечати();
	
	// КомандыПечатиЗаказов
	ИспользоватьШаблоныПечатиКП = ПолучитьФункциональнуюОпцию("ИспользоватьШаблоныПечатиОфисныхДокументов");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПодменюКоммерческоеПредложениеЗаказов", "Видимость", ИспользоватьШаблоныПечатиКП);
	// Конец КомандыПечатиЗаказов
	
	// УНФ.ОтборыСписка
	ОпределитьПорядокПредопределенныхОтборовНаСервере();
	ВосстановитьОтборыСписковПриСозданииНаСервере();
	// Конец УНФ.ОтборыСписка
	
	УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("АктуальнаяДатаСеанса", НачалоДня(ТекущаяДатаСеанса()));
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(СписокЗаказов);
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(СписокОтчетПереработчика);
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(СписокРасходнаяНакладная);
	
	// УНФ.ПанельКонтактнойИнформации
	КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформацияОтчетПереработчика",
		"СписокОтчетПереработчикаКонтекстноеМеню");
	// Конец УНФ.ПанельКонтактнойИнформации
	
	ВремяЗадержкиОбработчиковОжидания = 0.3;
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВремяЗадержкиОбработчиковОжидания = ДокументыУНФКлиент.ВремяЗадержкиОбработчиковОжидания();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		//УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		//Конец УНФ.ОтборыСписка
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// УНФ.ПанельКонтактнойИнформации
	Если КонтактнаяИнформацияПанельУНФКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьПанельКонтактнойИнформации();
	КонецЕсли;
	// Конец УНФ.ПанельКонтактнойИнформации
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеПериодаТаксиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, ИмяСписка(), "Дата", СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, ИмяСписка(), "Дата", СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект);
	ТекущаяСтраница = Элементы[СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо];
	Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СвернутьРазвернутьПанельОтборов();
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект);
	ТекущаяСтраница = Элементы[СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо];
	Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокКонтактыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект);
	ТекущаяСтраница = Элементы[СтруктураИменЭлементов.Контакты];
	Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокОтчетПереработчикаПриАктивизацииСтроки(Элемент)
	
	ЭтотОбъект.КИ_НужноИзменитьДанныеПриАктивизацииСтрокиТаблицы =
	КонтактнаяИнформацияПанельУНФКлиент.НужноИзменитьКонтактнуюИнформациюПриАктивизацииСтрокиТаблицы(
	ЭтотОбъект, Элемент, ТекущийКонтрагент, "Контрагент");
	
	Если ЭтотОбъект.КИ_НужноИзменитьДанныеПриАктивизацииСтрокиТаблицы Тогда
		ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчик", ВремяЗадержкиОбработчиковОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Копирование Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;

	Отказ = Истина;

	СтруктураПараметров = Новый Структура;
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМеток, СтруктураПараметров, "Контрагент");
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМеток, СтруктураПараметров, "Организация");

	ИмяФормыСтрока = РаботаСФормойДокументаКлиент.ИмяДокументаПоТипу(Параметр);

	ВидОперации = Неопределено;

	Если ИмяФормыСтрока = "ЗаказПоставщику" Тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПоставщику.ЗаказНаПереработку");
	ИначеЕсли ИмяФормыСтрока = "РасходнаяНакладная" Тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку");
	КонецЕсли;

	СтруктураПараметров.Вставить("ВидОперации", ВидОперации);

	ОткрытьФорму("Документ." + ИмяФормыСтрока + ".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения",
		СтруктураПараметров));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	
	ИмяМетки = СтрЗаменить(ЭтотОбъект.ТекущийЭлемент.Имя, "НастроитьОтборы", "");
	
	ИмяРеквизитаСписка = "Список" + ИмяМетки;
	ИмяТЧДанныеМеток = "ДанныеМеток" + ИмяМетки;
	ИмяТЧДанныеОтборов = "ДанныеОтборов" + ИмяМетки;
	ИмяГруппыОтборов = "ГруппаОтборы" + ИмяМетки;
	ИмяПредопределенныеОтборыПоУмолчанию = "ПредопределенныеОтборыПоУмолчанию" + ИмяМетки;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизитаСписка", ИмяРеквизитаСписка);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеОтборов", ИмяТЧДанныеОтборов);
	ДополнительныеПараметры.Вставить("ИмяГруппыОтборов", ИмяГруппыОтборов);
	ДополнительныеПараметры.Вставить("ИмяПредопределенныеОтборыПоУмолчанию", ИмяПредопределенныеОтборыПоУмолчанию);
	
	РаботаСОтборамиКлиент.НастроитьОтборыНажатие(ЭтотОбъект, ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры), ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеОтборы(Команда)
	
	ИмяМетки = СтрЗаменить(ЭтотОбъект.ТекущийЭлемент.Имя, "СброситьВсеОтборы", "");
	
	ИмяРеквизитаСписка = "Список" + ИмяМетки;
	ИмяТЧДанныеМеток = "ДанныеМеток" + ИмяМетки;
	ИмяТЧДанныеОтборов = "ДанныеОтборов" + ИмяМетки;
	
	СтруктураИменЭлементовПанелиОтборов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект);
	
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, ИмяРеквизитаСписка, "Дата", СтруктураИменЭлементовПанелиОтборов);
	СброситьВсеМеткиОтбораНаСервере(ИмяРеквизитаСписка, ИмяТЧДанныеМеток, СтруктураИменЭлементовПанелиОтборов, ИмяТЧДанныеОтборов);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	СвернутьРазвернутьПанельОтборов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ИмяТекущегоСписка = ИмяСписка();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы[ИмяТекущегоСписка]);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ИмяТекущегоСписка = ИмяСпискаСервер();
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы[ИмяТекущегоСписка], Результат);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ИмяТекущегоСписка = ИмяСписка();
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы[ИмяТекущегоСписка]);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ПанельКонтактнойИнформации

&НаКлиенте
Процедура Подключаемый_ОбработатьАктивизациюСтрокиСписка()

	ОбновитьПанельКонтактнойИнформации();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПанельКонтактнойИнформации()

	ДанныеПанелиКИ = ДанныеПанелиКонтактнойИнформации(ТекущийКонтрагент);
	КонтактнаяИнформацияПанельУНФКлиент.ЗаполнитьДанныеПанелиКИ(ЭтотОбъект, ДанныеПанелиКИ);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПанелиКонтактнойИнформации(Контрагент)

	Возврат КонтактнаяИнформацияПанельУНФ.ДанныеПанелиКонтактнойИнформации(Контрагент);

КонецФункции

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока,
		Поле, СтандартнаяОбработка);

КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(Элемент)

	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(ЭтотОбъект, Элемент);

КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыполнитьКоманду(Команда)

	КонтактнаяИнформацияПанельУНФКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ТекущийКонтрагент);

КонецПроцедуры

#КонецОбласти

#Область Отборы

&НаСервере
Процедура ОпределитьПорядокПредопределенныхОтборовНаСервере()

	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект, "ГруппаОтборыОтчетПереработчика",
		"ПредопределенныеОтборыПоУмолчаниюОтчетПереработчика");
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект, "ГруппаОтборыЗаказов",
		"ПредопределенныеОтборыПоУмолчаниюЗаказов");
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект, "ГруппаОтборыРасходнаяНакладная",
		"ПредопределенныеОтборыПоУмолчаниюРасходнаяНакладная");

КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект);
	НовоеЗначениеВидимость = НЕ Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость, СтруктураИменЭлементов);
	
	//Обход проблемы: Количество фильтров индекс
	ЗначениеКоличествоФильтров = ЭтотОбъект[СтруктураИменЭлементов.ИмяРеквизитаКоличествоФильтров];
	ТекстовыйЗаголовокИндексаФильтров = СтрШаблон("(%1)", ЗначениеКоличествоФильтров);
	Элементы[СтруктураИменЭлементов.ИндексФильтрыТакси].Заголовок = ТекстовыйЗаголовокИндексаФильтров;
	ВидимостьЗначков = Не НовоеЗначениеВидимость И ЗначениеКоличествоФильтров <> 0;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СтруктураИменЭлементов.ИндексыФильтры, "Видимость", ВидимостьЗначков);
	//Обход проблемы: Количество фильтров индекс
	ЭтотОбъект[СтруктураИменЭлементов.ИмяРеквизитаКоличествоФильтровИндекс] = Мин(ЗначениеКоличествоФильтров, 10);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьОтборыСписковПриСозданииНаСервере()
	
	// Обход проблемы: Ширина панели
	Интерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ШиринаПанели = ?(Интерфейс85, 37, 35);
	
	// РасходнаяНакладная
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "РасходнаяНакладная");
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокРасходнаяНакладная, "СписокРасходнаяНакладная", СтруктураИменЭлементов,,,, "ДанныеМетокРасходнаяНакладная",, "ДанныеОтборовРасходнаяНакладная", "ГруппаОтборыРасходнаяНакладная");
	
	// Обход проблемы: Картинка фильтры
	Элементы[СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо].Картинка = БиблиотекаКартинок.ФильтрПустой;
	// Обход проблемы: Ширина панели
	Элементы[СтруктураИменЭлементов.ПраваяПанель].Ширина = 0;
	Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Ширина = ШиринаПанели;
	// Обход проблемы: Свернутая панель
	Если Не Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Видимость Тогда
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].Отображение = ОтображениеКнопки.Картинка;
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Развернуть правую панель'");
	Иначе
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].Отображение = ОтображениеКнопки.КартинкаИТекст;
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Свернуть правую панель'")
	КонецЕсли;
	
	// Заказы поставщикам
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "Заказов");
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокЗаказов, "СписокЗаказов", СтруктураИменЭлементов,,,, "ДанныеМетокЗаказов",, "ДанныеОтборовЗаказов", "ГруппаОтборыЗаказов");
	
	// Обход проблемы: Картинка фильтры
	Элементы[СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо].Картинка = БиблиотекаКартинок.ФильтрПустой;
	// Обход проблемы: Ширина панели
	Элементы[СтруктураИменЭлементов.ПраваяПанель].Ширина = 0;
	Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Ширина = ШиринаПанели;
	// Обход проблемы: Свернутая панель
	Если Не Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Видимость Тогда
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].Отображение = ОтображениеКнопки.Картинка;
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Развернуть правую панель'");
	Иначе
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].Отображение = ОтображениеКнопки.КартинкаИТекст;
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Свернуть правую панель'")
	КонецЕсли;
	
	// ОтчетПереработчика
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "ОтчетПереработчика");
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокОтчетПереработчика, "СписокОтчетПереработчика", СтруктураИменЭлементов,,,, "ДанныеМетокОтчетПереработчика",, "ДанныеОтборовОтчетПереработчика", "ГруппаОтборыОтчетПереработчика");
	
	// Обход проблемы: Картинка фильтры
	Элементы[СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо].Картинка = БиблиотекаКартинок.ФильтрПустой;
	// Обход проблемы: Ширина панели
	Элементы[СтруктураИменЭлементов.ПраваяПанель].Ширина = 0;
	Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Ширина = ШиринаПанели;
	// Обход проблемы: Свернутая панель
	Если Не Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Видимость Тогда
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].Отображение = ОтображениеКнопки.Картинка;
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Развернуть правую панель'");
	Иначе
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].Отображение = ОтображениеКнопки.КартинкаИТекст;
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Свернуть правую панель'")
	КонецЕсли;
	
	// Обход проблемы: Свернутая панель
	Элементы.СвернутьПравуюПанель.Отображение = ОтображениеКнопки.Авто;
	Элементы.СвернутьПравуюПанель.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Свернуть правую панель'");
	
	// Журнал
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список, "Список");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	// Журнал
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "Страница");
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "Список", СтруктураИменЭлементов,,, "ДанныеМеток", "ДанныеОтборов", "ГруппаОтборы");
	
	// РасходнаяНакладная
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "РасходнаяНакладная");
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "СписокРасходнаяНакладная", СтруктураИменЭлементов,,, "ДанныеМетокРасходнаяНакладная", "ДанныеОтборовРасходнаяНакладная", "ГруппаОтборыРасходнаяНакладная");
	
	// Заказы покупателей
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "Заказов");
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "СписокЗаказов", СтруктураИменЭлементов,,, "ДанныеМетокЗаказов", "ДанныеОтборовЗаказов", "ГруппаОтборыЗаказов");
	
	// ОтчетПереработчика
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "ОтчетПереработчика");
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "СписокОтчетПереработчика", СтруктураИменЭлементов,,, "ДанныеМетокОтчетПереработчика", "ДанныеОтборовОтчетПереработчика", "ГруппаОтборыОтчетПереработчика");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение,
	ПредставлениеЗначения = "")

	Если ПредставлениеЗначения = "" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли;

	ИмяСписка = ИмяСпискаСервер();

	ИмяТчМеток = ИмяТчДанныхМетокСервер();

	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение,
		ПредставлениеЗначения, , , ИмяТчМеток);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, ЭтотОбъект[ИмяСписка], ИмяПоляОтбораСписка, , , ИмяТчМеток);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтборовЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НастройкаОтборовЗавершениеНаСервере(Результат.АдресВыбранныеОтборы, Результат.АдресУдаленныеОтборы,
		ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура НастройкаОтборовЗавершениеНаСервере(АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры)

	Если ДополнительныеПараметры = Неопределено Тогда
		ИмяРеквизитаСписка = "Список";
		ИмяТЧДанныеМеток = "ДанныеМеток";
		ИмяТЧДанныеОтборов = "ДанныеОтборов";
	Иначе
		ИмяРеквизитаСписка = ДополнительныеПараметры.ИмяРеквизитаСписка;
		ИмяТЧДанныеМеток = ДополнительныеПараметры.ИмяТЧДанныеМеток;
		ИмяТЧДанныеОтборов = ДополнительныеПараметры.ИмяТЧДанныеОтборов;
	КонецЕсли;

	РаботаСОтборами.НастройкаОтборовЗавершение(ЭтотОбъект, АдресВыбранныеОтборы, АдресУдаленныеОтборы,
		ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ОтборЗаказОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	УстановитьМеткуИОтборСписка("ДокументОснование", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	УстановитьМеткуИОтборСписка("Ответственный", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "Страница" Тогда
		СмещениеНаименованияМетки = 1;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаЗаказов" Тогда
		СмещениеНаименованияМетки = 2;
	Иначе
		СмещениеНаименованияМетки = 3;
	КонецЕсли;

	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + СмещениеНаименованияМетки);
	УдалитьМеткуОтбора(МеткаИД);

КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	ИмяМетки = СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя, "Страница", "");
	ИмяСписка = ИмяСпискаСервер();
	ИмяПравойПанели = ИмяПанелиМетокОтбора();
	ИмяТЧДанныеОтборов = "ДанныеОтборов" + ИмяМетки;

	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, ЭтотОбъект[ИмяСписка], МеткаИД, ИмяСписка,
		ИмяТчДанныхМетокСервер(), , ИмяПравойПанели, , ИмяТЧДанныеОтборов);

КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры)

	Возврат РаботаСОтборами.ПараметрыДляОткрытияФормыСНастройкамиОтборов(ЭтотОбъект, ДополнительныеПараметры);

КонецФункции

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ОтборПриИзменении(Элемент)

	Подключаемый_ОтборПриИзмененииНаСервере(Элемент.Имя, Элемент.Родитель.Имя);

КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборПриИзмененииНаСервере(ЭлементИмя, ЭлементРодительИмя)

	ПоискМетки = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	Если СтрЗаканчиваетсяНа(ПоискМетки, "ОтчетПереработчика") Тогда
		ИмяРеквизитаСписка = "СписокОтчетПереработчика";
		ИмяТЧДанныеМеток = "ДанныеМетокОтчетПереработчика";
		ИмяТЧДанныеОтборов = "ДанныеОтборовОтчетПереработчика";
	ИначеЕсли СтрЗаканчиваетсяНа(ПоискМетки, "Заказов") Тогда
		ИмяРеквизитаСписка = "СписокЗаказов";
		ИмяТЧДанныеМеток = "ДанныеМетокЗаказов";
		ИмяТЧДанныеОтборов = "ДанныеОтборовЗаказов";
	ИначеЕсли СтрЗаканчиваетсяНа(ПоискМетки, "РасходнаяНакладная") Тогда
		ИмяРеквизитаСписка = "СписокРасходнаяНакладная";
		ИмяТЧДанныеМеток = "ДанныеМетокРасходнаяНакладная";
		ИмяТЧДанныеОтборов = "ДанныеОтборовРасходнаяНакладная";
	Иначе
		ИмяРеквизитаСписка = "Список";
		ИмяТЧДанныеМеток = "ДанныеМеток";
		ИмяТЧДанныеОтборов = "ДанныеОтборов";
	КонецЕсли;

	РаботаСОтборами.Подключаемый_ОтборПриИзменении(ЭтотОбъект, ЭлементИмя, ЭлементРодительИмя, ИмяРеквизитаСписка,
		ИмяТЧДанныеМеток, ИмяТЧДанныеОтборов);

КонецПроцедуры

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ОтборОчистка(Элемент)

	Подключаемый_ОтборОчисткаНаСервере(Элемент.Имя, Элемент.Родитель.Имя);

КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборОчисткаНаСервере(ЭлементИмя, ЭлементРодительИмя)

	ПоискМетки = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;

	Если СтрЗаканчиваетсяНа(ПоискМетки, "ОтчетПереработчика") Тогда
		ИмяРеквизитаСписка = "СписокОтчетПереработчика";
		ИмяТЧДанныеМеток = "ДанныеМетокОтчетПереработчика";
		ИмяТЧДанныеОтборов = "ДанныеОтборовОтчетПереработчика";
	ИначеЕсли СтрЗаканчиваетсяНа(ПоискМетки, "Заказов") Тогда
		ИмяРеквизитаСписка = "СписокЗаказов";
		ИмяТЧДанныеМеток = "ДанныеМетокЗаказов";
		ИмяТЧДанныеОтборов = "ДанныеОтборовЗаказов";
	ИначеЕсли СтрЗаканчиваетсяНа(ПоискМетки, "РасходнаяНакладная") Тогда
		ИмяРеквизитаСписка = "СписокРасходнаяНакладная";
		ИмяТЧДанныеМеток = "ДанныеМетокРасходнаяНакладная";
		ИмяТЧДанныеОтборов = "ДанныеОтборовРасходнаяНакладная";
	Иначе
		ИмяРеквизитаСписка = "Список";
		ИмяТЧДанныеМеток = "ДанныеМеток";
		ИмяТЧДанныеОтборов = "ДанныеОтборов";
	КонецЕсли;

	РаботаСОтборами.Подключаемый_ОтборОчистка(ЭтотОбъект, ЭлементИмя, ИмяРеквизитаСписка, ИмяТЧДанныеМеток,
		ИмяТЧДанныеОтборов);

КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере(ИмяРеквизитаСписка, ИмяТЧДанныеМеток, СтруктураИменПредставленияПериода,
	ИмяТЧДанныеОтборов)
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, ЭтотОбъект[ИмяРеквизитаСписка], , ИмяРеквизитаСписка,
		ИмяТЧДанныеМеток, СтруктураИменПредставленияПериода, ИмяТЧДанныеОтборов);
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	УстановитьМеткуИОтборСписка("Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
КонецПроцедуры

&НаСервере
Функция ИмяТчДанныхМетокСервер()

	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	//
	Если ИмяСтраницы = "СтраницаОтчетПереработчика" Тогда
		Возврат "ДанныеМетокОтчетПереработчика"
	ИначеЕсли
	ИмяСтраницы = "СтраницаЗаказов" Тогда
		Возврат "ДанныеМетокЗаказов"
	ИначеЕсли
	ИмяСтраницы = "СтраницаРасходнаяНакладная" Тогда
		Возврат "ДанныеМетокРасходнаяНакладная"
	ИначеЕсли
	ИмяСтраницы = "Страница" Тогда
		Возврат "ДанныеМеток"
	КонецЕсли
	;

	Возврат "";

КонецФункции

&НаСервере
Функция ИмяПанелиМетокОтбора()
	//
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	//
	Если ИмяСтраницы = "СтраницаОтчетПереработчика" Тогда
		Возврат "СтраницаОтчетПереработчикаПраваяПанель"
	ИначеЕсли
	ИмяСтраницы = "СтраницаЗаказов" Тогда
		Возврат "СтраницаЗаказовПраваяПанель"
	ИначеЕсли
	ИмяСтраницы = "СтраницаРасходнаяНакладная" Тогда
		Возврат "СтраницаРасходнаяНакладнаяПраваяПанель"
	ИначеЕсли
	ИмяСтраницы = "Страница" Тогда
		Возврат "ПраваяПанель"
	КонецЕсли
	;

	Возврат "";

КонецФункции

#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформлениеПоЦветамСостоянийСервер()
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеОтмененногоЗаказа(
		СписокЗаказов.КомпоновщикНастроек.Настройки.УсловноеОформление);
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеПоЦветамСостояний(
		СписокЗаказов.КомпоновщикНастроек.Настройки.УсловноеОформление,
		Метаданные.Справочники.СостоянияЗаказовПоставщикам.ПолноеИмя(),
		"СостояниеЗаказа",
		"СостояниеЗаказа");

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчик()
	
	ОбновитьКИ = ЭтотОбъект.КИ_НужноИзменитьДанныеПриАктивизацииСтрокиТаблицы;
	СписокПриАктивизацииСтрокиОбработчикНаСервере(ОбновитьКИ);
	
КонецПроцедуры

&НаСервере
Процедура СписокПриАктивизацииСтрокиОбработчикНаСервере(ОбновитьКИ)
	
	Если ОбновитьКИ Тогда
		КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, ТекущийКонтрагент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтруктураИменЭлементовПанелиОтборов(Форма, ИмяОбъекта = Неопределено)
	
	Если Не ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ИмяОбъекта = Форма.Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	КонецЕсли;
	
	ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "Страница", "");
	СтруктураИменЭлементов = РаботаСОтборамиКлиентСервер.ИменаЭлементовПравойПанели(ИмяОбъекта);
	
	Возврат СтруктураИменЭлементов;
	
КонецФункции

&НаКлиенте
Функция ИмяСписка()

	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;

	Если ИмяСтраницы = "СтраницаОтчетПереработчика" Тогда
		Возврат "СписокОтчетПереработчика"
	ИначеЕсли
	ИмяСтраницы = "СтраницаЗаказов" Тогда
		Возврат "СписокЗаказов"
	ИначеЕсли
	ИмяСтраницы = "СтраницаРасходнаяНакладная" Тогда
		Возврат "СписокРасходнаяНакладная"
	ИначеЕсли
	ИмяСтраницы = "Страница" Тогда
		Возврат "Список"
	КонецЕсли
	;

	Возврат "";

КонецФункции

&НаСервере
Функция ИмяСпискаСервер()

	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;

	Если ИмяСтраницы = "СтраницаОтчетПереработчика" Тогда
		Возврат "СписокОтчетПереработчика"
	ИначеЕсли
	ИмяСтраницы = "СтраницаЗаказов" Тогда
		Возврат "СписокЗаказов"
	ИначеЕсли
	ИмяСтраницы = "СтраницаРасходнаяНакладная" Тогда
		Возврат "СписокРасходнаяНакладная"
	ИначеЕсли
	ИмяСтраницы = "Страница" Тогда
		Возврат "Список"
	КонецЕсли
	;

	Возврат "";

КонецФункции

&НаСервере
Процедура УстановитьПодменюПодсистемыПечати()
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.ОтчетПереработчика"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКомандыОтчетПереработчика;
	ПараметрыРазмещения.ПрефиксГрупп = "ОтчетПереработчика";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ОтчетПереработчикаПодменюПечать);
	
	Массив.Очистить();
	Массив.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКомандыРасходнаяНакладная;
	ПараметрыРазмещения.ПрефиксГрупп = "РасходнаяНакладная";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечатьРасходнаяНакладная);
	
	Элементы.Переместить(Элементы.ПодменюПечатьФаксимилеРасходнаяНакладная,Элементы.ПодменюПечатьРасходнаяНакладная);
	
	Массив.Очистить();
	Массив.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКомандыЗаказов;
	ПараметрыРазмещения.ПрефиксГрупп = "Заказов";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечатьЗаказов);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если Не ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПредставлениеПериода.Видимость = Ложь;
	Элементы.ПредставлениеПериодаЗаказов.Видимость = Ложь;
	Элементы.ПредставлениеПериодаОтчетПереработчика.Видимость = Ложь;
	Элементы.ПредставлениеПериодаРасходнаяНакладная.Видимость = Ложь;
	
	Элементы.ПредставлениеПериодаТакси.Видимость = Истина;
	Элементы.ПредставлениеПериодаТаксиЗаказов.Видимость = Истина;
	Элементы.ПредставлениеПериодаТаксиОтчетПереработчика.Видимость = Истина;
	Элементы.ПредставлениеПериодаТаксиРасходнаяНакладная.Видимость = Истина;
	
	Элементы.ИндексФильтры.Видимость = Ложь;
	Элементы.ИндексФильтрыЗаказов.Видимость = Ложь;
	Элементы.ИндексФильтрыОтчетПереработчика.Видимость = Ложь;
	Элементы.ИндексФильтрыРасходнаяНакладная.Видимость = Ложь;
	
	Элементы.ИндексФильтрыТакси.Видимость = Истина;
	Элементы.ИндексФильтрыТаксиЗаказов.Видимость = Истина;
	Элементы.ИндексФильтрыТаксиОтчетПереработчика.Видимость = Истина;
	Элементы.ИндексФильтрыТаксиРасходнаяНакладная.Видимость = Истина;
	
КонецПроцедуры

#КонецОбласти
