
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеДоступомУНФ.РазрешеноРедактированиеЦенДокументов();
	
	Элементы.Список.ТолькоПросмотр = НЕ РазрешеноРедактированиеЦенДокументов;

	ЦенообразованиеСервер.УстановитьПараметрыДинамическогоСпискаВидовЦен(Список);
	
	// Установить основной элемент списка
	ОсновнойВидЦен	= ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойВидЦенПродажи");
	Список.Параметры.УстановитьЗначениеПараметра("ОсновнойВидЦен", ОсновнойВидЦен);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Недействителен", Ложь,,,
		Не Элементы.ПоказыватьНедействительных.Пометка);
		
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "ПоказатьПодсказкуОтбора")
		И Параметры.ПоказатьПодсказкуОтбора Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПанельИнформации",
				"Видимость", "Истина");
			
			ПрочитатьИУстановитьНастройкиФормы();
			
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	ПрочитатьПрайсЛисты();
	
	АдаптацияТакси(); 
	УстановитьОтображениеКомандыСброситьВсеОтборыНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

 &НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗначокДеталиНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Детали;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ВидЦены", Значение);
	Оповестить("Выбор_ВидЦены", ПараметрыВыбора, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗакрытьНажатие(Элемент)
	
	ДекорацияИнформацияЗакрытьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	
	СвернутьРазвернутьПанельОтборов();  
	
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

 &НаКлиенте
Процедура СвернутьПравуюПанель(Команда)     
	 
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры 

&НаКлиенте
Процедура СброситьВсеОтборы(Команда) 
	
	СброситьВсеМеткиОтбораНаСервере(); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказыватьНедействительных(Команда)
	
	Элементы.ПоказыватьНедействительных.Пометка = Не Элементы.ПоказыватьНедействительных.Пометка;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Недействителен",
		Ложь,
		,
		,
		Не Элементы.ПоказыватьНедействительных.Пометка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтображениеКомандыСброситьВсеОтборыНаСервере()
	
	Элементы.СброситьВсеОтборы.Видимость = КоличествоФильтров > 0;
	
КонецПроцедуры

&НаСервере
Процедура СброситьВсеФлажкиДереваОтборовНаСервере() 
	
	КоличествоФильтров = 0;
	КоличествоФильтровИндекс = 0; 
	КоличествоДопФильтров = 0;
	
	ОтборПрайсЛистыОбъект = РеквизитФормыВЗначение("ОтборПрайсЛисты");	
	
    Для Каждого КорневаяСтрокаДерева Из ОтборПрайсЛистыОбъект.Строки Цикл
        
        КорневаяСтрокаДерева.Флаг = Ложь;
        
        Для Каждого ПодчиненнаяСтрока Из КорневаяСтрокаДерева.Строки Цикл
            
            ПодчиненнаяСтрока.Флаг = Ложь;
            
        КонецЦикла;
        
    КонецЦикла;
     
    ЗначениеВРеквизитФормы(ОтборПрайсЛистыОбъект, "ОтборПрайсЛисты");
			
КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере() 
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Ссылка");

	СброситьВсеФлажкиДереваОтборовНаСервере();
	
	УстановитьОтображениеКомандыСброситьВсеОтборыНаСервере();  
	
КонецПроцедуры 

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов() 
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Интерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ИнтерфейсТакси = НЕ Интерфейс85;
	
	Элементы.ИндексФильтрыТакси.Видимость = ИнтерфейсТакси;
	Элементы.ИндексФильтры.Видимость = Интерфейс85; 

	Если НЕ Интерфейс85 Тогда 
		ОтображатьКоманднуюПанель = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	// Недоступный текст для недействительных
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаПалитры.Серый10УНФ;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Недействителен");
	Отбор.ПравоеЗначение 	= Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДекорацияИнформацияЗакрытьНаСервере()
	
	Элементы.ГруппаПанельИнформации.Видимость = Ложь;
	
	КлючОбъекта			= ИмяФормы + "/НастройкиФормы";
	КлючНастройки = "ОтображатьПанельИнформации";
	ТекущиеНастройки 	= ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастройки);
	
	Если ТекущиеНастройки = Неопределено Тогда
		ТекущиеНастройки = Новый ХранилищеЗначения(Новый Структура("Видимость", Ложь));
	КонецЕсли;
	
	ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта, КлючНастройки, ТекущиеНастройки);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьИУстановитьНастройкиФормы()
	
	КлючОбъекта			= ИмяФормы + "/НастройкиФормы";
	КлючНастройки = "ОтображатьПанельИнформации";
	ТекущиеНастройки 	= ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастройки);
	
	Если ТекущиеНастройки <> Неопределено 
		И ТипЗнч(ТекущиеНастройки) = Тип("ХранилищеЗначения") Тогда
		
		Элементы.ГруппаПанельИнформации.Видимость = ТекущиеНастройки.Получить().Видимость;
		
	КонецЕсли;
	
КонецПроцедуры

#Область БыстрыйОтбор

&НаСервере
Процедура ПрочитатьПрайсЛисты()
	
	Запрос = Новый Запрос("ВЫБРАТЬ ЛОЖЬ КАК Флаг, ПЛ.Ссылка КАК ПрайсЛист ИЗ Справочник.ПрайсЛисты КАК ПЛ ГДЕ НЕ ПЛ.ПометкаУдаления");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Элементы.ОтборПрайсЛисты.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСверху;
		
	Иначе
		
		ЗначениеВРеквизитФормы(РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией), "ОтборПрайсЛисты");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПрайсЛистыФлагПриИзменении(Элемент)
	
	ТекущаяСтрокаДерева = ОтборПрайсЛисты.НайтиПоИдентификатору(Элементы.ОтборПрайсЛисты.ТекущиеДанные.ПолучитьИдентификатор());
	УстановитьФлагУПодчиненных(ТекущаяСтрокаДерева.ПолучитьЭлементы(), ТекущаяСтрокаДерева.Флаг);
	
	ПрайсЛисты	= НайтиВыбранныеСтроки(ОтборПрайсЛисты.ПолучитьЭлементы());
	ВидыЦен		= ВидыЦенПрайсЛистов(ПрайсЛисты);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", ВидыЦен, ВидСравненияКомпоновкиДанных.ВСписке, , (ВидыЦен.Количество() > 0));
	
	КоличествоФильтров = ПрайсЛисты.Количество();
	КоличествоФильтровИндекс = Мин(ПрайсЛисты.Количество(), 10);    
	КоличествоДопФильтров = КоличествоФильтров;
	
	УстановитьОтображениеКомандыСброситьВсеОтборыНаСервере();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагУПодчиненных(СписокЭлементов, Флаг)
	
	Для Каждого СтрокаДерева Из СписокЭлементов Цикл
		
		СтрокаДерева.Флаг = Флаг;
		
		ДочерниеСтроки = СтрокаДерева.ПолучитьЭлементы();
		Если ДочерниеСтроки.Количество() > 0 Тогда
			
			УстановитьФлагУПодчиненных(ДочерниеСтроки, Флаг);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиВыбранныеСтроки(СписокЭлементов)
	
	ПрайсЛисты = Новый Массив;
	Для Каждого СтрокаДерева Из СписокЭлементов Цикл
		
		Если СтрокаДерева.Флаг Тогда
			
			ПрайсЛисты.Добавить(СтрокаДерева.ПрайсЛист);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПрайсЛисты;
	
КонецФункции

&НаСервере
Функция ВидыЦенПрайсЛистов(ПрайсЛисты)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ВидыЦен.ВидЦен КАК ВидЦен ИЗ Справочник.ПрайсЛисты.ВидыЦен КАК ВидыЦен ГДЕ ВидыЦен.Ссылка В(&ПрайсЛисты)");
	Запрос.УстановитьПараметр("ПрайсЛисты", ПрайсЛисты);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидЦен");
	
КонецФункции

#КонецОбласти

#КонецОбласти


