
#Область ОписаниеПеременных

//Эквайринговый терминал на котором выполняется операция НСПК
&НаКлиенте
Перем ВыбранныйЭквайринговыйТерминал;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КассаККМ", КассаККМ);
	Параметры.Свойство("ВидОплатыНСПК", ВидОплатыНСПК);
	Параметры.Свойство("ЭтоВозврат", ЭтоВозврат);
	Параметры.Свойство("СуммаЧека", СуммаЧека);
	Параметры.Свойство("СуммаПК", СуммаПК);
	Параметры.Свойство("ИдентификаторКорзиныНСПК", ИдентификаторКорзиныНСПК);
	Параметры.Свойство("КодТРУ", КодТРУ);
	Параметры.Свойство("ПредставлениеНоменклатуры", ПредставлениеНоменклатуры);
	
	Если Параметры.Свойство("ТоварныеПозиции") Тогда
		ТоварныеПозиции = Параметры.ТоварныеПозиции;
		ТоварыФСС.Очистить();
		Если ЗначениеЗаполнено(ТоварныеПозиции) Тогда
			Для Каждого ТоварнаяПозиция Из ТоварныеПозиции Цикл
				НоваяСтрока = ТоварыФСС.Добавить();
				НоваяСтрока.НомерПозиции = НоваяСтрока.ПолучитьИдентификатор();
				НоваяСтрока.НомерПозицииВозврата = 999;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТоварнаяПозиция);
				НоваяСтрока.Артикул = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварнаяПозиция.Номенклатура, "Код");
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Параметры.Свойство("ПроверятьЭквайринговыйТерминал", ПроверятьЭквайринговыйТерминал);
	Если Параметры.Свойство("ЭквайринговыеТерминалы") Тогда
		Терминалы = Параметры.ЭквайринговыеТерминалы;
		ЭквайринговыеТерминалы.Очистить();
		Если ЗначениеЗаполнено(Терминалы) Тогда
			Для Каждого Терминал Из Терминалы Цикл
				НоваяСтрока = ЭквайринговыеТерминалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Терминал);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Параметры.Свойство("ОтображатьСуммыДоплаты", ОтображатьСуммыДоплаты);
	Элементы.ГруппаСуммыДоплаты.Видимость = ОтображатьСуммыДоплаты;
	
	Если ЭтоВозврат Тогда
		Заголовок = НСтр("ru = 'Возврат оплаты электронным сертификатом'");
	Иначе
		Заголовок = НСтр("ru = 'Оплата электронным сертификатом'");
	КонецЕсли;
	
	ПредварительноеОдобрениеПолучено = Ложь;
	ВывестиПредварительноеОдобрениеНаПечать();
	УстановитьЗаголовкиОплаты(ЭтотОбъект);
	
	УказанИдентификаторКорзины = (ЗначениеЗаполнено(ИдентификаторКорзиныНСПК) И ЭтоВозврат) ИЛИ Не ЭтоВозврат;
	
	Элементы.ГруппаНомерСертификатаНСПК.Видимость = НЕ ЭтоВозврат;
	Элементы.ГруппаИдентификаторКорзины.Видимость = НЕ УказанИдентификаторКорзины;
	Элементы.ГруппаКомандыОплаты.Видимость = УказанИдентификаторКорзины;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если НЕ (ЭтоВозврат И НЕ ЗначениеЗаполнено(ИдентификаторКорзиныНСПК)) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			МассивШтрихкодов = МенеджерОборудованияКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			
			Если МассивШтрихкодов.Количество() > 0 Тогда
				ИдентификаторКорзиныНСПК = МассивШтрихкодов[0].Штрихкод;
				
				ДанныеШтрихкода = МенеджерОборудованияРМККлиент.РасшифроватьQRКодЧекаККТ(ИдентификаторКорзиныНСПК);
				Если ДанныеШтрихкода.Расшифрован Тогда
					СтруктураФискальногоПризнака = Новый Структура("НомерФискальногоНакопителя, ФискальныйПризнакЧека, ФискальныйЧекНомер",
															ДанныеШтрихкода.НомерФискальногоНакопителя,
															ДанныеШтрихкода.ФискальныйПризнак,
															ДанныеШтрихкода.НомерФискальногоДокумента);
															
					ПараметрыОперацииНСПК = ПолучитьПараметрыОперацииНСПКНаСервере();
					ЗаполнитьЗначенияСвойств(ПараметрыОперацииНСПК, СтруктураФискальногоПризнака);
					
					ОповещениеМетода = Новый ОписаниеОповещения("ПолучитьИдентификаторКорзиныЗавершение", ЭтотОбъект);
					МенеджерОборудованияРМККлиент.НачатьПолучениеИдентификатораКорзины(ОповещениеМетода, ПараметрыОперацииНСПК);
					
				Иначе
					ВвестиИдентификаторКорзиныНаКлиенте(Новый Структура("Результат, ИдентификаторКорзины", Истина, ИдентификаторКорзиныНСПК));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПКПриИзменении(Элемент)
	
	СуммаПК = Мин(СуммаПК, СуммаЧека - СуммаЭС);
	СуммаНаличные = СуммаЧека - СуммаЭС - СуммаПК;
	
	ПроверитьСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНаличныеПриИзменении(Элемент)
	
	ПроверитьСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСуммы()
	
	Сдача = Макс(0, -1 *(СуммаЧека - СуммаЭС - СуммаПК - СуммаНаличные));
	ОплатаДоступна = СуммаЧека = СуммаНаличные + СуммаПК + СуммаЭС - Сдача;
	Элементы.Оплатить.Доступность = ОплатаДоступна;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отменить(Команда)
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("Результат", Ложь);
	
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура Оплатить(Команда)
	
	Если НЕ ПредварительноеОдобрениеПолучено Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПолучениеПредварительногоОдобрения", ЭтотОбъект);
		ВыбратьТерминалДляВыполненияОпреации(ОписаниеОповещения);
		
	Иначе
		ПараметрыЗакрытия = Новый Структура();
		ПараметрыЗакрытия.Вставить("НачатьПробитиеЧека", СуммаЧека = СуммаЭС + СуммаПК + СуммаНаличные - Сдача);
		ПараметрыЗакрытия.Вставить("ИдентификаторКорзиныНСПК", ИдентификаторКорзиныНСПК);
		ПараметрыЗакрытия.Вставить("СуммаОплаченоСертификатамиНСПК", СуммаЭС);
		ПараметрыЗакрытия.Вставить("Результат", Истина);
		ПараметрыЗакрытия.Вставить("ЭквайринговыйТерминал", ВыбранныйЭквайринговыйТерминал);
		ПараметрыЗакрытия.Вставить("СуммаПК", СуммаПК);
		ПараметрыЗакрытия.Вставить("СуммаНаличные", СуммаНаличные);
		ПараметрыЗакрытия.Вставить("Сдача", Сдача);
		
		ТоварыОплаченныеЭС = ПодготовитьТоварыОплаченныеЭС();
		ПараметрыЗакрытия.Вставить("ТоварыОплаченныеЭС", ТоварыОплаченныеЭС);
		
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьИдентификаторКорзины(Команда)
	
	ВвестиИдентификаторКорзиныНаКлиенте(Новый Структура("Результат, ИдентификаторКорзины", Истина, ИдентификаторКорзиныНСПК));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСертификатовНСПККОплате(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПолучениеСертификатовНСПК", ЭтотОбъект);
	ВыбратьТерминалДляВыполненияОпреации(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИдентификаторыКорзинПокупокНСПК(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьИдентификаторыКорзинПокупокНСПКВопрос", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Загрузить историю продаж по товару %1?'");
	ТекстВопроса = СтрШаблон(ТекстВопроса, ПредставлениеНоменклатуры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТерминалДляВыполненияОпреации(ОписаниеОповещенияОперации)
	
	Если Не ЗначениеЗаполнено(ВыбранныйЭквайринговыйТерминал) Тогда
		КоличествоТерминалов = ЭквайринговыеТерминалы.Количество();
		Если КоличествоТерминалов = 1 Тогда
			ВыбранныйЭквайринговыйТерминал = ЭквайринговыеТерминалы[0].ПодключаемоеОборудование;
		ИначеЕсли КоличествоТерминалов > 1 Тогда
			СписокТерминалов = Новый СписокЗначений;
			Для Каждого ЭквайринговыйТерминал Из ЭквайринговыеТерминалы Цикл
				СписокТерминалов.Добавить(ЭквайринговыйТерминал.ПодключаемоеОборудование);
			КонецЦикла;
			ДополнительныеПараметры = Новый Структура("ОписаниеОповещенияОперации", ОписаниеОповещенияОперации);
			ОписаниеОповещенияВыбора = Новый ОписаниеОповещения("ОбработатьВыборТерминалаДляВыполненияОпреации",ЭтотОбъект, ДополнительныеПараметры);
			СписокТерминалов.ПоказатьВыборЭлемента(ОписаниеОповещенияВыбора, НСтр("ru='Выберите эквайринговый терминал'"));
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверятьЭквайринговыйТерминал И НЕ ЗначениеЗаполнено(ВыбранныйЭквайринговыйТерминал) Тогда
		Возврат;
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборТерминалаДляВыполненияОпреации(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		ВыбранныйЭквайринговыйТерминал = Результат.Значение;
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияОперации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОповещениеКомандНСПК

&НаКлиенте
Процедура ВыполнитьПолучениеСертификатовНСПК(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СледующаяОперация", "ПолучениеСпискаСертификатов");
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюНСПКЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	МенеджерОборудованияРМККлиент.НачатьПолучениеПараметровКарты(ОписаниеОповещения,
		Неопределено,
		ВыбранныйЭквайринговыйТерминал,
		Неопределено,
		Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПолучениеПредварительногоОдобрения(Результат, ДополнительныеПараметры) Экспорт
	
	ТоварныеПозиции = Новый Массив();
	ДополнительныеПараметры = Новый Структура();
	
	СледующаяОперация = "ПредварительноеОдобрениеИспользования";
	Если ЭтоВозврат Тогда
		СледующаяОперация = "ПредварительноеОдобрениеВозврата";
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("СледующаяОперация", СледующаяОперация);
	
	Для Каждого СтрокаТоваров Из ТоварыФСС Цикл
		ТоварнаяПозиция = Новый Структура();
		ТоварнаяПозиция.Вставить("НомерПозиции", СтрокаТоваров.НомерПозиции);
		ТоварнаяПозиция.Вставить("Артикул", СтрокаТоваров.Артикул);
		ТоварнаяПозиция.Вставить("КодТовараТРУ", СтрокаТоваров.КодТРУ);
		ТоварнаяПозиция.Вставить("Количество", СтрокаТоваров.Количество);
		ТоварнаяПозиция.Вставить("Цена", СтрокаТоваров.Цена);
		ТоварнаяПозиция.Вставить("НомерПозицииВозврата", СтрокаТоваров.НомерПозицииВозврата);
		ТоварнаяПозиция.Вставить("СертификатПоследниеЦифры", НомерСертификатаНСПК);
		ТоварнаяПозиция.Вставить("ИдентификаторСтроки", СтрокаТоваров.ИдентификаторСтроки);
		ТоварныеПозиции.Добавить(ТоварнаяПозиция);
	КонецЦикла;
	ДополнительныеПараметры.Вставить("ТоварныеПозиции", ТоварныеПозиции);
	
	Если ЭтоВозврат Тогда
		ДополнительныеПараметры.Вставить("ИдентификаторКорзины", ИдентификаторКорзиныНСПК);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюНСПКЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	МенеджерОборудованияРМККлиент.НачатьПолучениеПараметровКарты(ОписаниеОповещения,
		Неопределено,
		ВыбранныйЭквайринговыйТерминал,
		Неопределено,
		Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПолучениеИдентификаторовКорзинПокупокНСПК(Результат, ПараметрыОперации)Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СледующаяОперация", "ПолучениеИдентификаторовКорзинПокупокТСП");
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюНСПКЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	МенеджерОборудованияРМККлиент.НачатьПолучениеПараметровКарты(ОписаниеОповещения,
		Неопределено,
		ВыбранныйЭквайринговыйТерминал,
		Неопределено,
		Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьОперациюНСПКЗавершение(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		Если НЕ ЗначениеЗаполнено(ВыбранныйЭквайринговыйТерминал) Тогда
			ВыбранныйЭквайринговыйТерминал = РезультатВыполнения.ИдентификаторУстройства;
		КонецЕсли;
		
		ХешНомерКарты = ?(РезультатВыполнения.Свойство("ХешНомерКарты"), РезультатВыполнения.ХешНомерКарты, "");
		НомерКарты = ?(РезультатВыполнения.Свойство("НомерКарты"), РезультатВыполнения.НомерКарты, "");
		СсылкаНаПлатежныйСчет = ?(РезультатВыполнения.Свойство("СсылкаНаПлатежныйСчет"), РезультатВыполнения.СсылкаНаПлатежныйСчет, "");
		
		Если НЕ ДополнительныеПараметры = Неопределено И ДополнительныеПараметры.Свойство("СледующаяОперация") Тогда
			Если ДополнительныеПараметры.СледующаяОперация = "ПредварительноеОдобрениеИспользования" Тогда
				СогласоватьЭСНСПК(ДополнительныеПараметры.ТоварныеПозиции, ХешНомерКарты, СсылкаНаПлатежныйСчет);
			ИначеЕсли ДополнительныеПараметры.СледующаяОперация = "ПредварительноеОдобрениеВозврата" Тогда
				СогласоватьВозвратЭСНСПК(ДополнительныеПараметры.ТоварныеПозиции, ХешНомерКарты, СсылкаНаПлатежныйСчет);
			ИначеЕсли ДополнительныеПараметры.СледующаяОперация = "ПолучениеСпискаСертификатов" Тогда
				ПолучитьСертификатыЭСНСПК(ХешНомерКарты, СсылкаНаПлатежныйСчет);
			ИначеЕсли ДополнительныеПараметры.СледующаяОперация = "ПолучениеИдентификаторовКорзинПокупокТСП" Тогда
				ПолучитьИдентификаторыКорзинПокупокТСП(ХешНомерКарты, СсылкаНаПлатежныйСчет);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		ПредварительноеОдобрениеПолучено = Ложь;
		УстановитьЗаголовкиОплаты(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьЭСНСПК(ТоварныеПозиции, ХешНомерКарты, СсылкаНаПлатежныйСчет)
	
	ПараметрыОперацииНСПК = ПолучитьПараметрыОперацииНСПКНаСервере();
	ПараметрыОперацииНСПК.ХешНомерКарты = ХешНомерКарты;
	ПараметрыОперацииНСПК.СсылкаНаПлатежныйСчет = СсылкаНаПлатежныйСчет;
	ПараметрыОперацииНСПК.ТоварныеПозиции = ТоварныеПозиции;
	
	ПредварительноеОдобрениеПолучено = Ложь;
	
	ОповещениеМетода = Новый ОписаниеОповещения("ОбработатьРезультатОперацииНаКлиенте", ЭтотОбъект, ПараметрыОперацииНСПК);
	МенеджерОборудованияРМККлиент.НачатьПредварительноеОдобрениеИспользования(ОповещениеМетода, ПараметрыОперацииНСПК);
	
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьВозвратЭСНСПК(ТоварныеПозиции, ХешНомерКарты, СсылкаНаПлатежныйСчет)
	
	ПараметрыОперацииНСПК = ПолучитьПараметрыОперацииНСПКНаСервере(Истина);
	ПараметрыОперацииНСПК.ТоварныеПозиции = ТоварныеПозиции;
	ПараметрыОперацииНСПК.ХешНомерКарты = ХешНомерКарты;
	ПараметрыОперацииНСПК.СсылкаНаПлатежныйСчет = СсылкаНаПлатежныйСчет;
	
	ОповещениеМетода = Новый ОписаниеОповещения("ОбработатьПолучениеСоставаКорзиныНаКлиенте", ЭтотОбъект, ПараметрыОперацииНСПК);
	МенеджерОборудованияРМККлиент.НачатьПолучениеСоставаКорзины(ОповещениеМетода, ПараметрыОперацииНСПК);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучениеСоставаКорзиныНаКлиенте(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	РезультатВыполнения.Вставить("ПредыдущаяПокупка", Истина);
	ОбработатьРезультатНаСервере(РезультатВыполнения);
	РезультатВыполнения.Удалить("ПредыдущаяПокупка");
	
	Если НЕ РезультатВыполнения.Результат Тогда
		Возврат;
	КонецЕсли;
	
	ТоварныеПозиции = ДополнительныеПараметры.ТоварныеПозиции;
	
	// Удаление строк, которых не было в оригинальной продаже ЭС.
	СтрокиНеИзВозврата = ТоварыФСС.НайтиСтроки(Новый Структура("НомерПозицииВозврата", 999));
	
	Для каждого СтрокаНеИзВозврата Из СтрокиНеИзВозврата Цикл
		КоличествоТоварныхПозиций = ТоварныеПозиции.Количество();
		Для Индекс = 1 По КоличествоТоварныхПозиций Цикл
			СтрокаТовара = ТоварныеПозиции[КоличествоТоварныхПозиций - Индекс];
			Если СтрокаТовара.Артикул = СтрокаНеИзВозврата.Артикул И СтрокаТовара.ИдентификаторСтроки = СтрокаНеИзВозврата.ИдентификаторСтроки Тогда
				ТоварныеПозиции.Удалить(КоличествоТоварныхПозиций - Индекс);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Заполнение номера позиции в оригинальной продаже ЭС.
	Для каждого СтрокаПодтверждения Из ТоварныеПозиции Цикл
		СтрокаФСС = ТоварыФСС.НайтиПоИдентификатору(СтрокаПодтверждения.НомерПозиции);
		Если НЕ СтрокаФСС = Неопределено Тогда
			СтрокаПодтверждения.НомерПозицииВозврата = СтрокаФСС.НомерПозицииВозврата;
		КонецЕсли;
	КонецЦикла;
	
	ДополнительныеПараметры.ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	
	ПредварительноеОдобрениеПолучено = Ложь;
	ОповещениеМетода = Новый ОписаниеОповещения("ОбработатьРезультатОперацииНаКлиенте", ЭтотОбъект, ДополнительныеПараметры);
	МенеджерОборудованияРМККлиент.НачатьПредварительноеОдобрениеВозврата(ОповещениеМетода, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОперацииНСПКНаСервере(ПредыдущаяПокупка = Ложь)
	
	ПараметрыОперации = МенеджерОборудованияРМК.ПараметрыОперацииНСПК();
	
	Если ПредыдущаяПокупка Тогда
		ЭлектронныеСертификатыНСПКРМКПереопределяемый.ЗаполнитьПараметрыОперацииНСПКПоКассеККМ(ПараметрыОперации, КассаККМ, ИдентификаторКорзиныНСПК);
	Иначе
		ЭлектронныеСертификатыНСПКРМКПереопределяемый.ЗаполнитьПараметрыОперацииНСПКПоКассеККМ(ПараметрыОперации, КассаККМ);
	КонецЕсли;
	
	Возврат ПараметрыОперации;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатОперацииНаКлиенте(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ПредварительноеОдобрениеПолучено = Истина;
	КонецЕсли;
	ОбработатьРезультатНаСервере(РезультатВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатНаСервере(РезультатВыполнения);
	
	Если РезультатВыполнения.Результат Тогда
		
		Если РезультатВыполнения.Свойство("ИдентификаторКорзины") И НЕ ПустаяСтрока(РезультатВыполнения.ИдентификаторКорзины) Тогда
			ИдентификаторКорзиныНСПК = РезультатВыполнения.ИдентификаторКорзины;
		КонецЕсли;
		Если РезультатВыполнения.Свойство("СуммаСертификатами") Тогда
			СуммаЭС = РезультатВыполнения.СуммаСертификатами;
		КонецЕсли;
		Если ЭтоВозврат И СуммаПК > 0 Тогда
			Элементы.ГруппаСуммыДоплаты.Видимость = Истина;
			Элементы.СуммаПК.Видимость = Истина;
			Элементы.СуммаПК.Доступность = Ложь;
			
			Элементы.СуммаНаличные.Видимость = Ложь;
			Элементы.Сдача.Видимость = Ложь;
			
			Если СуммаПК > СуммаЧека - СуммаЭС Тогда
				СуммаПК = СуммаЧека - СуммаЭС;
			КонецЕсли;
		ИначеЕсли ОтображатьСуммыДоплаты Тогда
			СуммаПК = СуммаЧека - СуммаЭС;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ТоварныеПозиции") И РезультатВыполнения.ТоварныеПозиции.Количество() > 0 Тогда
			Для Каждого ТоварнаяПозиция Из РезультатВыполнения.ТоварныеПозиции Цикл
				
				СтрокаТовара = Неопределено;
				
				Если РезультатВыполнения.Свойство("ПредыдущаяПокупка") Тогда
					СтрокиТоваров = ТоварыФСС.НайтиСтроки(Новый Структура("Артикул, НомерПозицииВозврата", ТоварнаяПозиция.Артикул, 999));
					Если СтрокиТоваров.Количество()>0 Тогда
						СтрокаТовара = СтрокиТоваров[0];
					КонецЕсли;
				Иначе
					СтрокаТовара = ТоварыФСС.НайтиПоИдентификатору(ТоварнаяПозиция.НомерПозиции);
				КонецЕсли;
				
				Если СтрокаТовара = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если РезультатВыполнения.Свойство("ПредыдущаяПокупка") Тогда
					СтрокаТовара.НомерПозицииВозврата = ТоварнаяПозиция.НомерПозиции;
					Продолжить;
				КонецЕсли;
				
				ОсталосьРаспределить = СтрокаТовара.Количество;
				Если ТоварнаяПозиция.Свойство("Сертификаты") И ТоварнаяПозиция.Сертификаты.Количество() > 0 Тогда
					
					Для Каждого Сертификат Из ТоварнаяПозиция.Сертификаты Цикл
						
						Если Сертификат.Количество = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						СтрокаСертификата = СтрокаТовара.Сертификаты.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСертификата, Сертификат);
						
						КоличествоПоСертификату = СтрокаСертификата.Количество;
						СуммаПоСертификату = СтрокаСертификата.Количество * СтрокаСертификата.Цена;
						МаксимальнаяЦена = СтрокаСертификата.МаксимальнаяЦена;
						
						СтрокаТовара.НомерСертификатаФСС = НСтр("ru='*'") + Прав(Сертификат.Идентификатор, 6);
						СтрокаТовара.МаксимальнаяЦена = МаксимальнаяЦена;
						СтрокаТовара.КоличествоФСС = КоличествоПоСертификату;
						СтрокаТовара.СуммаФСС = СуммаПоСертификату;
						СтрокаТовара.ЦенаФСС =
							?(КоличествоПоСертификату = 0, СуммаПоСертификату, Окр(СуммаПоСертификату/КоличествоПоСертификату, 2));
						
						ОсталосьРаспределить = ОсталосьРаспределить - КоличествоПоСертификату;
						Если ОсталосьРаспределить > 0 Тогда
							СтрокаТовара.Количество = КоличествоПоСертификату;
							СтрокаТовара.Сумма = КоличествоПоСертификату * СтрокаТовара.Цена;
							
							НоваяСтрокаТовара = ТоварыФСС.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаТовара, СтрокаТовара,,
								"Сертификаты, МаксимальнаяЦена, КоличествоФСС, СуммаФСС, ЦенаФСС");
							НоваяСтрокаТовара.Количество = ОсталосьРаспределить;
							НоваяСтрокаТовара.Сумма = ОсталосьРаспределить * НоваяСтрокаТовара.Цена;
							НоваяСтрокаТовара.НомерСертификатаФСС = НСтр("ru=''");
							
							СтрокаТовара = НоваяСтрокаТовара;
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					
					СтрокаТовара.КоличествоФСС = ТоварнаяПозиция.Количество;
					СтрокаТовара.ЦенаФСС = ТоварнаяПозиция.Цена;
					СтрокаТовара.СуммаФСС = СтрокаТовара.КоличествоФСС*СтрокаТовара.ЦенаФСС;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ВывестиПредварительноеОдобрениеНаПечать();
		УстановитьЗаголовкиОплаты(ЭтотОбъект);
	Иначе
		ОписаниеОшибки =
			СтрШаблон(НСтр("ru='Ошибка: (%1) %2'"), РезультатВыполнения.КодРезультата, РезультатВыполнения.ОписаниеОшибки); 
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПредварительноеОдобрениеНаПечать()
	
	Таб = Новый ТабличныйДокумент();
	
	Макет = ПолучитьОбщийМакет("ПФ_MXL_ДанныеПроверкиТоваровФСС");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	Если ЭтоВозврат Тогда
		ЗаголовокТаблицы = НСтр("ru = 'Товары к возврату на электронный сертификат'");
	Иначе
		ЗаголовокТаблицы = НСтр("ru = 'Товары к оплате электронным сертификатом'");
	КонецЕсли;
	
	УстановитьПараметр(ОбластьЗаголовок, "ЗаголовокТаблицы", ЗаголовокТаблицы);
	
	Таб.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	Таб.Вывести(ОбластьШапка);
	
	СуммаЧекФСС = 0;
	ТекущийСертификатФСС = Неопределено;
	
	Для Каждого СтрокаТоваров Из ТоварыФСС Цикл
		
		Если НЕ ТекущийСертификатФСС = СтрокаТоваров.НомерСертификатаФСС Тогда
			
			ТекущийСертификатФСС = СтрокаТоваров.НомерСертификатаФСС;
			НомерСертификатаФСС = ?(ЗначениеЗаполнено(ТекущийСертификатФСС), ТекущийСертификатФСС, НСтр("ru='Без сертификата'"));
			
			ОбластьДанныхСтроки = Макет.ПолучитьОбласть("НомерСертификатаФСС");
			ОбластьДанныхСтроки.Параметры.Заполнить(Новый Структура("НомерСертификатаФСС", НомерСертификатаФСС));
			
			Таб.Вывести(ОбластьДанныхСтроки);
			
		КонецЕсли;
		
		ОбластьДанныхСтроки = Макет.ПолучитьОбласть("Строка");
		УстановитьПараметрМакетаНСПК(
			ОбластьДанныхСтроки,
			"Наименование",
			СтрШаблон("%1, %2", СтрокаТоваров.Артикул, СокрЛП(СтрокаТоваров.Номенклатура)));
		ОбластьДанныхСтроки.Параметры.Заполнить(СтрокаТоваров);
		Таб.Вывести(ОбластьДанныхСтроки);
		
		СуммаЧекФСС = СуммаЧекФСС + СтрокаТоваров.Сумма;
	КонецЦикла;
	
	ОбластПодвалФСС = Макет.ПолучитьОбласть("ПодвалФСС");
	УстановитьПараметр(ОбластПодвалФСС, "Сумма", СуммаЧекФСС);
	УстановитьПараметр(ОбластПодвалФСС, "СуммаФСС", СуммаЭС);
	Таб.Вывести(ОбластПодвалФСС);
	
	Если НЕ ЭтоВозврат Тогда
		
		ОбластПрочиеТовары = Макет.ПолучитьОбласть("ПрочиеТовары");
		УстановитьПараметр(ОбластПрочиеТовары, "Сумма", СуммаЧека - СуммаЧекФСС);
		Таб.Вывести(ОбластПрочиеТовары);
		
		ОбластПодвал = Макет.ПолучитьОбласть("Подвал");
		УстановитьПараметр(ОбластПодвал, "Сумма", СуммаЧека);
		Таб.Вывести(ОбластПодвал);
	КонецЕсли;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент = Таб;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПараметрМакетаНСПК(ОбластьМакета, ИмяПараметра, ЗначениеПараметра)
	
	ОбластьМакета.Параметры.Заполнить(Новый Структура(ИмяПараметра, ЗначениеПараметра));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиОплаты(Форма)
	
	Если Форма.ПредварительноеОдобрениеПолучено Тогда
		Если Форма.ЭтоВозврат Тогда
			ЗаголовокОплаты = НСтр("ru = 'Вернуть'");
			ТекстПодсказки = НСтр("ru = 'Возврат электронного сертификата должен производиться на карту, к которой приписываются электронные сертификаты покупателя.'");
		Иначе
			ЗаголовокОплаты = НСтр("ru='Оплатить'");
			Если Форма.СуммаЧека > Форма.СуммаЭС + Форма.СуммаПК + Форма.СуммаНаличные - Форма.Сдача Тогда
				ЗаголовокОплаты = НСтр("ru='Доплатить'");
			КонецЕсли;
			ТекстПодсказки = НСтр("ru = 'Доплата к электронному сертификату может производиться собственными средствами с той же карты,"
				"а также наличными.'");
		КонецЕсли;
	Иначе
		ЗаголовокОплаты = НСтр("ru = 'Проверить'");
		Если Форма.ЭтоВозврат Тогда
			ТекстПодсказки = НСтр("ru = 'Перед возвратом необходимо проверить доступную сумму к возврату электронного сертификата.'");
		Иначе
			ТекстПодсказки = НСтр("ru = 'Перед оплатой необходимо проверить доступную сумму к оплате электронного сертификата.'");
		КонецЕсли;
	КонецЕсли;
	Форма.Элементы.Оплатить.Заголовок = ЗаголовокОплаты;
	Форма.Элементы.ГруппаСуммы.РасширеннаяПодсказка.Заголовок = ТекстПодсказки;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПараметр(ОбластьМакета, ИмяПараметра, ЗначениеПараметра)
	
	ОбластьМакета.Параметры.Заполнить(Новый Структура(ИмяПараметра, ЗначениеПараметра));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИдентификаторКорзиныЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	ВвестиИдентификаторКорзиныНаКлиенте(РезультатВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиИдентификаторКорзиныНаКлиенте(РезультатВыполнения)
	
	Если НЕ (ТипЗнч(РезультатВыполнения) = Тип("Структура") И РезультатВыполнения.Свойство("Результат")) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибка = Ложь;
	Если РезультатВыполнения.Результат Тогда
		ИдентификаторКорзиныНСПК = РезультатВыполнения.ИдентификаторКорзины;
	Иначе
		ЕстьОшибка = Истина;
		ТекстОшибки = НСтр("ru = 'Не удалось получить идентификатор корзины по фискальному признаку чека'");
		ИдентификаторКорзиныНСПК = НСтр("ru=''");
	КонецЕсли;
	
	Если НЕ ЕстьОшибка И НЕ СтрДлина(ИдентификаторКорзиныНСПК) = 24 Тогда
		ЕстьОшибка = Истина;
		ТекстОшибки = НСтр("ru = 'Идентификатор корзины должен состоять из 24 символов.'");
	КонецЕсли;
	
	Если ЕстьОшибка Тогда
		Элементы.ПроверкаВозможностиОплаты.Заголовок = ТекстОшибки;
		Элементы.ПроверкаВозможностиОплаты.Видимость = Истина;
	Иначе
		Элементы.ПроверкаВозможностиОплаты.Видимость = Ложь;
		Элементы.ГруппаИдентификаторКорзины.Видимость = Ложь;
		Элементы.ГруппаКомандыОплаты.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификатыЭСНСПК(ХешНомерКарты, СсылкаНаПлатежныйСчет)
	
	ПараметрыОперации = ПолучитьПараметрыОперацииНСПКНаСервере();
	ПараметрыОперации.ХешНомерКарты = ХешНомерКарты;
	ПараметрыОперации.СсылкаНаПлатежныйСчет = СсылкаНаПлатежныйСчет;
	ОповещениеМетода = Новый ОписаниеОповещения("ПолучитьСертификатыЭСНСПКЗавершение", ЭтотОбъект, ПараметрыОперации);
	МенеджерОборудованияРМККлиент.НачатьПолучениеСпискаСертификатов(ОповещениеМетода, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификатыЭСНСПКЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ (ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("Результат")) Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Результат Тогда
		
		КоличествоДоступныхСертификатов = Результат.ДоступныеСертификаты.Количество();
		Если КоличествоДоступныхСертификатов > 0 Тогда
			
			ЭлементНомерНСПК = Элементы.НомерСертификатаНСПК;
			
			Если КоличествоДоступныхСертификатов = 1 Тогда
				НомерСертификатаНСПК = Прав(Результат.ДоступныеСертификаты[0].Идентификатор, 6);
			Иначе
				ЭлементНомерНСПК.СписокВыбора.Очистить();
				Для Каждого СертификатНСПК Из Результат.ДоступныеСертификаты Цикл
					
					МаскаСертификата = Прав(СертификатНСПК.Идентификатор, 6);
					ЭлементНомерНСПК.СписокВыбора.Вставить(0, МаскаСертификата, НСтр("ru='*'") + МаскаСертификата);
					
				КонецЦикла;
				
				ЭлементНомерНСПК.КнопкаВыпадающегоСписка = Истина;
				ЭлементНомерНСПК.КнопкаВыбора = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекстСообщения =
			СтрШаблон(НСтр("ru='Ошибка: (%1) %2'"), Результат.КодРезультата, Результат.ОписаниеОшибки);
			
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИдентификаторыКорзинПокупокНСПКВопрос(Результат, ПараметрыОперации)Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПолучениеИдентификаторовКорзинПокупокНСПК", ЭтотОбъект);
		ВыбратьТерминалДляВыполненияОпреации(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИдентификаторыКорзинПокупокТСП(ХешНомерКарты, СсылкаНаПлатежныйСчет)
	
	ПараметрыОперации = ПолучитьПараметрыОперацииНСПКНаСервере();
	ПараметрыОперации.ХешНомерКарты = ХешНомерКарты;
	ПараметрыОперации.СсылкаНаПлатежныйСчет = СсылкаНаПлатежныйСчет;
	ПараметрыОперации.КодТовараТРУ = КодТРУ;
	ОповещениеМетода = Новый ОписаниеОповещения("ПолучитьИдентификаторыКорзинПокупокТСПЗавершение", ЭтотОбъект, ПараметрыОперации);
	МенеджерОборудованияРМККлиент.НачатьПолучениеСпискаИдентификаторовКорзинПокупокТСП(ОповещениеМетода, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИдентификаторыКорзинПокупокТСПЗавершение(РезультатВыполнения, ПараметрыОперации) Экспорт
	
	Если НЕ (ТипЗнч(РезультатВыполнения) = Тип("Структура") И РезультатВыполнения.Свойство("Результат")) Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Результат Тогда
		Если РезультатВыполнения.ИдентификаторыКорзинПокупок.Количество() = 1 Тогда
			ИдентификаторКорзиныНСПК = РезультатВыполнения.ИдентификаторыКорзинПокупок[0].ИдентификаторКорзины;
		ИначеЕсли РезультатВыполнения.ИдентификаторыКорзинПокупок.Количество() > 1 Тогда
			
			ЭлементВыбор = Элементы.ИдентификаторКорзины;
			ЭлементВыбор.СписокВыбора.Очистить();
			Для Каждого ИдентификаторКорзиныПокупок Из РезультатВыполнения.ИдентификаторыКорзинПокупок Цикл
				ЭлементВыбор.СписокВыбора.Вставить(0, ИдентификаторКорзиныПокупок.ИдентификаторКорзины, Строка(ИдентификаторКорзиныПокупок.ДатаАвторизации));
			КонецЦикла;
			ЭлементВыбор.КнопкаВыпадающегоСписка = Истина;
			ЭлементВыбор.ПодсказкаВвода = Нстр("ru='Выберите ИД продажи'");
			
		КонецЕсли;
		
	Иначе
		
		ТекстСообщения =
			СтрШаблон(НСтр("ru='Ошибка: (%1) %2'"), РезультатВыполнения.КодРезультата, РезультатВыполнения.ОписаниеОшибки);
			
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьТоварыОплаченныеЭС()
	
	Результат = Новый Массив;
	
	ТаблицаТоваров = ТоварыФСС.Выгрузить();
	ТаблицаТоваров.Свернуть("ИдентификаторСтроки", "Количество, КоличествоФСС");
	
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		
		СтруктураСтроки = Новый Структура("ИдентификаторСтроки, Количество, КоличествоФСС");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТоваров);
		Результат.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти






