
#Область СлужебныйПрограммныйИнтерфейс

// Проверка статуса чека в сервисе облачная касса.
//
// Параметры:
//  Форма - Форма - форма в которой проверяется статус чека.
//  ДокументОснование - ОпределяемыйТип.ДокументОперацииОблачнойКассы - ссылка на документ по которому необходимо
//                                                                      проверить статус чека.
//  ОповещениеПриЗавершении - ОписаниеОповещения - событие описания оповещения при завершении операции.
//  ИдентификаторУстройстваФР - СправочникСсылка.ПодключаемоеОборудование - ссылка на оборудование.
//  ПараметрыОперации - Структура - параметры операции.
//
Процедура ПроверитьСтатусЧекаВОблаке(Форма, ДокументОснование, ОповещениеПриЗавершении, ИдентификаторУстройстваФР,
	ПараметрыОперации) Экспорт
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Пробитие чека'");
	ПараметрыОжидания.РежимОткрытияОкнаОжидания = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	
	РезультатВыполнения = ОборудованиеЧекопечатающиеОблачныеККТУНФВызовСервера.ПолучитьСтатусЧекаВОблаке(
		ДокументОснование,
		Форма.УникальныйИдентификатор);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("ДокументОснование", ДокументОснование);
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ДополнительныеПараметры.Вставить("ИдентификаторУстройстваФР", ИдентификаторУстройстваФР);
	ДополнительныеПараметры.Вставить("ПараметрыОперации", ПараметрыОперации);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ПроверитьСтатусЧекаВОблакеЗавершение", 
		ЭтотОбъект,
		ДополнительныеПараметры);
	
	Если РезультатВыполнения.Статус <> "Выполняется" Тогда
		ПроверитьСтатусЧекаВОблакеЗавершение(РезультатВыполнения, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Завершение проверки статуса чека в сервисе облачная касса.
// 
// Параметры:
//  РезультатВыполнения - см. ДлительныеОперацииКлиент.НовыйРезультатДлительнойОперации
//  ДополнительныеПараметры - Структура:
//   * Форма - ФормаКлиентскогоПриложения
//   * ДокументОснование - ОпределяемыйТип.ДокументОперацииОблачнойКассы - ссылка на документ по которому необходимо
//                                                                         проверить статус чека.
//   * ОповещениеПриЗавершении - ОписаниеОповещения - событие описания оповещения при завершении операции.
//   * ИдентификаторУстройстваФР - СправочникСсылка.ПодключаемоеОборудование - ссылка на оборудование.
//   * ПараметрыОперации - Структура - параметры операции.
//
Процедура ПроверитьСтатусЧекаВОблакеЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Форма                     = ДополнительныеПараметры.Форма;
	ДокументОснование         = ДополнительныеПараметры.ДокументОснование;
	ОповещениеПриЗавершении   = ДополнительныеПараметры.ОповещениеПриЗавершении;
	ИдентификаторУстройстваФР = ДополнительныеПараметры.ИдентификаторУстройстваФР;
	ПараметрыОперации         = ДополнительныеПараметры.ПараметрыОперации;
	
	Если РезультатВыполнения = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось проверить статус чека в сервисе облачной кассы.'");
		Результат = Новый Структура;
		Результат.Вставить("Результат", Ложь);
		Результат.Вставить("ОписаниеОшибки", ТекстОшибки);
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		ТекущийСтатус = РезультатОперации.ДанныеОперации.СтатусОперации;
		
		Если ТекущийСтатус = ОблачныеКассыКлиентСервер.СтатусОперацииВыполняется() Тогда
			
			ПроверитьСтатусЧекаВОблаке(
				Форма,
				ДокументОснование,
				ОповещениеПриЗавершении,
				ИдентификаторУстройстваФР,
				ПараметрыОперации);
			
		ИначеЕсли ТекущийСтатус = ОблачныеКассыКлиентСервер.СтатусОперацииВыполнена() Тогда
			
			ОборудованиеЧекопечатающиеОблачныеККТКлиент.ПроверитьСтатусЧека(
				ОповещениеПриЗавершении,
				Форма.УникальныйИдентификатор,
				ИдентификаторУстройстваФР,
				ПараметрыОперации);
			
		ИначеЕсли ТекущийСтатус = ОблачныеКассыКлиентСервер.СтатусОперацииОтменена() Тогда
			
			Результат = Новый Структура;
			Результат.Вставить("Результат", Ложь);
			Результат.Вставить("ОписаниеОшибки", ?(ЗначениеЗаполнено(РезультатОперации.СообщениеОбОшибке),
				РезультатОперации.СообщениеОбОшибке, НСтр("ru = 'Операция отменена'")));
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
			
		КонецЕсли;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Результат", Ложь);
		Результат.Вставить("ОписаниеОшибки", РезультатВыполнения.КраткоеПредставлениеОшибки);
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти