////////////////////////////////////////////////////////////////////////////////
// БАЗОВАЯ ФУНКЦИОНАЛЬНОСТЬ
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт
	
	Если НЕ ПустаяСтрока(Текст) 
		И (НЕ ЗначениеЗаполнено(Элемент.ОграничениеТипа)
		ИЛИ Элемент.ОграничениеТипа.СодержитТип(Тип("СправочникСсылка.Номенклатура"))) Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = БыстрыеФормыУНФВызовСервера.ДанныеВыбораНоменклатуры(ПараметрыПолученияДанных, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначенияЗаполненияПоПараметрамВыбора(ПараметрыВыбора)
	
	ВременнаяСтруктура = Новый Структура;
	ДобавитьПараметрыВыбораВСтруктуру(ВременнаяСтруктура, ПараметрыВыбора);
	
	ЗначенияЗаполнения = Новый Структура;
	Для каждого КлючИЗначение Из ВременнаяСтруктура.Отбор Цикл
		ЗначенияЗаполнения.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Возврат ЗначенияЗаполнения;
	
КонецФункции

Процедура ДобавитьПараметрыВыбораВСтруктуру(Структура, ПараметрыВыбора)
	
	Если НЕ Структура.Свойство("Отбор") Тогда
		Структура.Вставить("Отбор", Новый Структура);
	КонецЕсли;
	
	Для каждого ПараметрВыбора Из ПараметрыВыбора Цикл
		Если Найти(ПараметрВыбора.Имя, "Отбор.") <> 0 Тогда
			Структура.Отбор.Вставить(СтрЗаменить(ПараметрВыбора.Имя, "Отбор.", ""), ПараметрВыбора.Значение);
		ИначеЕсли Найти(ПараметрВыбора.Имя, ".") = 0 Тогда
			Структура.Вставить(ПараметрВыбора.Имя, ПараметрВыбора.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьНоменклатуруПоВиду(Элемент, ВидНоменклатуры, КодЕдиницыИзмерения = Неопределено)
	
	Наименование = Элемент.ТекстРедактирования;
	
	ПараметрыСоздания = Новый Структура;
	ПараметрыСоздания.Вставить("ЗначенияЗаполнения", ЗначенияЗаполненияПоПараметрамВыбора(Элемент.ПараметрыВыбора));
	
	ДополнительныеПараметрыСоздания = Новый Структура;
	ДополнительныеПараметрыСоздания.Вставить("Наименование", Наименование);
	Если ЗначениеЗаполнено(КодЕдиницыИзмерения) Тогда
		ДополнительныеПараметрыСоздания.Вставить("КодЕдиницыИзмерения", КодЕдиницыИзмерения);
	КонецЕсли;
	ПараметрыСоздания.Вставить("ДополнительныеПараметрыСоздания", ДополнительныеПараметрыСоздания);
	
	Возврат УчетКассовыхЧековПодотчетныхЛицВызовСервера.СоздатьНоменклатуруБыстро(ВидНоменклатуры, ПараметрыСоздания);
	
КонецФункции

Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		
		Если ВыбранноеЗначение.Свойство("НоменклатураВАрхиве") ТОгда
			
			ВыбранноеЗначение = ВыбранноеЗначение.НоменклатураВАрхиве;
			
		ИначеЕсли ВыбранноеЗначение.Свойство("ВидНоменклатуры") Тогда
			
			КодЕдиницыИзмерения = Неопределено;
			ВыбранноеЗначение.Свойство("КодЕдиницыИзмерения", КодЕдиницыИзмерения);
			ВыбранноеЗначение = СоздатьНоменклатуруПоВиду(Элемент, ВыбранноеЗначение.ВидНоменклатуры, КодЕдиницыИзмерения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт
	
	Если НЕ ПустаяСтрока(Текст) 
		И (НЕ ЗначениеЗаполнено(Элемент.ОграничениеТипа)
		ИЛИ Элемент.ОграничениеТипа.СодержитТип(Тип("СправочникСсылка.Контрагенты"))) Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = УчетКассовыхЧековПодотчетныхЛицВызовСервера.ДанныеВыбораКонтрагента(ПараметрыПолученияДанных, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
