#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "БезКатегории";
	Элемент.Наименование = НСтр("ru='<Без категории>'");
	Элемент.РеквизитДопУпорядочивания = 1;
	Элемент.ПризнакПредметаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Товар");
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.Заполнить(Неопределено);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюВидаОбъекта(Объект, "Справочник_Спецификации", "НаборСвойствСпецификации");
	УправлениеСвойствами.ПередЗаписьюВидаОбъекта(Объект, "Справочник_КомплектацииНоменклатуры", "НаборСвойствКомплектацииНоменклатуры");
	УправлениеСвойствами.ПередЗаписьюВидаОбъекта(Объект, "Справочник_ХарактеристикиНоменклатуры", "НаборСвойствХарактеристики");
	УправлениеСвойствами.ПередЗаписьюВидаОбъекта(Объект, "Справочник_Номенклатура", "НаборСвойств");
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

// Регистрирует данные для обработчика обновления перехода на конструктор настроек
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюКонструктораНастроек(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = Метаданные.Справочники.КатегорииНоменклатуры.ПолноеИмя();
	ПараметрыВыборки.СпособВыборки       = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	ДоступнаСледующаяСтраница = Истина;
	Курсор                    = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	СправочникКатегорииНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КатегорииНоменклатуры КАК СправочникКатегорииНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО ОписаниеНоменклатурыИС.Номенклатура = СправочникКатегорииНоменклатуры.Ссылка
		|ГДЕ
		|	СправочникКатегорииНоменклатуры.УдалитьВидПродукцииИС <> &ПустаяОсобенностьУчета
		|	И СправочникКатегорииНоменклатуры.Ссылка > &ДанныеКурсора
		|	И ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции, &ПустойКлючВидовПродукции) = &ПустойКлючВидовПродукции
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	Запрос.УстановитьПараметр("ПустаяОсобенностьУчета",   Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойКлючВидовПродукции", Справочники.КлючиВидовПродукцииИС.ПустаяСсылка());
	
	Пока ДоступнаСледующаяСтраница Цикл
		
		Запрос.УстановитьПараметр("ДанныеКурсора", Курсор);
		
		//@skip-check query-in-loop
		ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
		КоличествоСтрок    = ТаблицаНоменклатуры.Количество();
		
		Если КоличествоСтрок > 0 Тогда
			
			ИндексПоследнейСтроки = КоличествоСтрок - 1;
			ДанныеДляОбработки    = ТаблицаНоменклатуры.ВыгрузитьКолонку("Ссылка");
			
			ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ДанныеДляОбработки);
			
			Если КоличествоСтрок = 1000 Тогда
				Курсор = ТаблицаНоменклатуры[ИндексПоследнейСтроки].Ссылка;
			Иначе
				ДоступнаСледующаяСтраница = Ложь;
			КонецЕсли;
			
		Иначе
			ДоступнаСледующаяСтраница = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработка данных перехода на конструктор настроек видов продуции
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсиюКонструктораНастроек(Параметры) Экспорт
	
	ОбъектМетаданных      = ПустаяСсылка().Метаданные();
	ПолноеИмяОбъекта      = ОбъектМетаданных.ПолноеИмя();
	ОбработанныхОбъектов  = 0;
	ПроблемныхОбъектов    = 0;
	ОбновляемыеДанные     = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	ДанныеКеша            = Неопределено;
	ПроблемыПриОбновлении = Новый Соответствие();
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	КатегорииНоменклатуры      = ОбновляемыеДанные.ВыгрузитьКолонку("Ссылка");
	ОписанияНоменклатуры  = ОбщегоНазначенияИС.ОписаниеНоменклатуры(КатегорииНоменклатуры);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КатегорииНоменклатуры.Ссылка КАК Ссылка,
		|	КатегорииНоменклатуры.УдалитьВидПродукцииИС КАК ВидПродукцииИС,
		|	1 В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			1
		|		ИЗ
		|			Справочник.Номенклатура КАК Номенклатура
		|		ГДЕ
		|			Номенклатура.КатегорияНоменклатуры = КатегорииНоменклатуры.Ссылка
		|			И ЕСТЬNULL(Номенклатура.ВидАлкогольнойПродукции.Маркируемый, ЛОЖЬ)) КАК ЕстьПодакцизный,
		|	1 В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			1
		|		ИЗ
		|			Справочник.Номенклатура КАК Номенклатура
		|		ГДЕ
		|			Номенклатура.КатегорияНоменклатуры = КатегорииНоменклатуры.Ссылка
		|			И НЕ ЕСТЬNULL(Номенклатура.ВидАлкогольнойПродукции.Маркируемый, ЛОЖЬ)) КАК ЕстьНеподакцизный
		|ИЗ
		|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
		|ГДЕ
		|	КатегорииНоменклатуры.Ссылка В (&КатегорииНоменклатуры)";
	
	Запрос.УстановитьПараметр("КатегорииНоменклатуры", КатегорииНоменклатуры);
	
	ДанныеКОбработке = Запрос.Выполнить().Выбрать();
	
	Пока ДанныеКОбработке.Следующий() Цикл
		
		ПоляБлокировки = Новый Структура();
		ПоляБлокировки.Вставить("Номенклатура", ДанныеКОбработке.Ссылка);
		
		НачатьТранзакцию();
		
		Попытка
			
			ОбщегоНазначенияИС.УстановитьУправляемуюБлокировку(Метаданные.Справочники.КлючиВидовПродукцииИС.ПолноеИмя());
			ОбщегоНазначенияИС.УстановитьУправляемуюБлокировку(
				Метаданные.РегистрыСведений.ОписаниеНоменклатурыИС.ПолноеИмя(), ПоляБлокировки);
			
			ТекущееОписание = ОписанияНоменклатуры[ДанныеКОбработке.Ссылка];
			ВидПродукции    = ДанныеКОбработке.ВидПродукцииИС; // определить вид продукции по особенности учета
			
			ПропуститьОбработку       = Ложь;
			МаркируемаяПродукцияЕГАИС = Неопределено;
			
			Если ВидПродукции = Перечисления.ВидыПродукцииИС.Алкогольная Тогда
				Если ДанныеКОбработке.ЕстьПодакцизный И ДанныеКОбработке.ЕстьНеподакцизный
					Или Не ДанныеКОбработке.ЕстьПодакцизный И Не ДанныеКОбработке.ЕстьНеподакцизный Тогда
					ПропуститьОбработку = Истина; // по категории номенклатуры есть подакцизный и не подакцизный вид АП
				Иначе
					МаркируемаяПродукцияЕГАИС = ДанныеКОбработке.ЕстьПодакцизный;
				КонецЕсли;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ТекущееОписание.КлючВидовПродукции) И Не ПропуститьОбработку Тогда
				
				Если ЗначениеЗаполнено(ВидПродукции) Тогда
					
					КлючВидовПродукции = Справочники.КлючиВидовПродукцииИС.КлючПоЗначениюПеречисления(
						ВидПродукции,
						ДанныеКеша,
						МаркируемаяПродукцияЕГАИС);
					
					Если ЗначениеЗаполнено(КлючВидовПродукции) Тогда
						ТекущееОписание.КлючВидовПродукции = КлючВидовПродукции;
						РегистрыСведений.ОписаниеНоменклатурыИС.УстановитьОписание(ТекущееОписание);
					Иначе
						ПроблемыПриОбновлении[ДанныеКОбработке.Ссылка] = СтрШаблон(
							НСтр("ru = 'Не удалось определить ключ видов продукции для вида номенклатуры ""%1"" при переходе на конструктор настроек видов продукции'"),
							ДанныеКОбработке.Ссылка);
					КонецЕсли;
					
				Иначе
				
					ПроблемыПриОбновлении[ДанныеКОбработке.Ссылка] = СтрШаблон(
						НСтр("ru = 'Не удалось определить вид продукции (перечисление) для вида номенклатуры ""%1"" при переходе на конструктор настроек видов продукции'"),
						ДанныеКОбработке.Ссылка);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ДанныеКОбработке.Ссылка);
			
			ОбработанныхОбъектов = ОбработанныхОбъектов + 1;
			
			ЗафиксироватьТранзакцию();
			
		Исключение

			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Не удалось обработать номенклатуру ""%1"" при переходе на конструктор настроек видов продукции по причине:
					       |%2'"),
				ДанныеКОбработке.Ссылка,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				ОбъектМетаданных,,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого НеобработанныйОбъект Из ПроблемыПриОбновлении Цикл
		ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(
			НеобработанныйОбъект.Ключ,
			НеобработанныйОбъект.Значение,
			Параметры);
	КонецЦикла;
	
	Если ОбработанныхОбъектов = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые данные ""%1"": %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектМетаданных.Синоним, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция ""%1"": %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектМетаданных.Синоним, ОбработанныхОбъектов);
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			ОбъектМетаданных,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов = Параметры.ПрогрессВыполнения.ОбработаноОбъектов
		+ ОбработанныхОбъектов;
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли