
#Область СлужебныеПроцедурыИФункции

// Проверка статуса чека документа основания в сервисе облачная касса.
//
// Параметры:
//  ДокументОснование - ОпределяемыйТип.ДокументОперацииОблачнойКассы - ссылка на документ инициирующий пробитие чека.
//  УникальныйИдентификатор - УникальныйИдентификатор - уникальный идентификатор формы, во временное хранилище которой 
//                                                  необходимо поместить результат выполнения процедуры.
//
Функция ПолучитьСтатусЧекаВОблаке(ДокументОснование, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение статуса чека в сервисе.'");
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументОснование", ДокументОснование);
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"ОбщегоНазначенияРМКУНФ.ПолучитьСтатусЧекаВОблаке",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти