
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(ДокументыПоступления);
	
	МассивВидовОпераци = Новый Массив;
	МассивВидовОпераци.Добавить(Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию);
	МассивВидовОпераци.Добавить(Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика);
		
	ДокументыПоступления.Параметры.УстановитьЗначениеПараметра("Организация",               Параметры.Организация);
	ДокументыПоступления.Параметры.УстановитьЗначениеПараметра("Контрагент",                Параметры.Контрагент);
	ДокументыПоступления.Параметры.УстановитьЗначениеПараметра("Договор",                   Параметры.Договор);
	ДокументыПоступления.Параметры.УстановитьЗначениеПараметра("ТекущийДокумент",           Параметры.ТекущийДокумент);
	ДокументыПоступления.Параметры.УстановитьЗначениеПараметра("МассивВыбранныхДокументов", Параметры.МассивВыбранныхДокументов);
	ДокументыПоступления.Параметры.УстановитьЗначениеПараметра("МассивВидовОпераций",       МассивВидовОпераци);
	
	Если НЕ Параметры.ПоОдномуДокументу Тогда
		Элементы.ДокументыПоступления.РежимВыделения = РежимВыделенияТаблицы.Множественный
	КонецЕсли;
	
	Элементы.ДокументыПоступления.ТекущаяСтрока = Параметры.ТекущийДокумент;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработкаВыбораЗначения();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗначения()
	
	Если Параметры.ПоОдномуДокументу Тогда
		ТекущиеДанные = Элементы.ДокументыПоступления.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
	
		Если ТекущиеДанные.ДокументУжеВыбран Тогда 
			ПоказатьПредупреждение( , НСтр("ru='Этот документ уже выбран'"));
			Возврат;
		КонецЕсли;
		
		Результат = Новый Массив;
		Результат.Добавить(ТекущиеДанные.Ссылка);
		
	Иначе
		
		Результат = Новый Массив;
		Для Каждого ВыделеннаяСтрока Из Элементы.ДокументыПоступления.ПолучитьСтрокиДляОбработки() Цикл
				
			Если ТипЗнч(ВыделеннаяСтрока) = Тип("Число") Тогда
				Результат.Добавить(Элементы.ДокументыПоступления.ДанныеСтроки(ВыделеннаяСтрока).Ссылка);
			Иначе
				Результат.Добавить(ВыделеннаяСтрока.Ссылка);
			КонецЕсли;
		КонецЦикла
		
	КонецЕсли;
	
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры 

&НаКлиенте
Процедура ДокументыПоступленияВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОбработкаВыбораЗначения();

КонецПроцедуры

#КонецОбласти

