
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено( Параметры.ВидМаркетплейса ) Тогда
		ВидМаркетплейса = Параметры.ВидМаркетплейса;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ВидМаркетплейса", ВидМаркетплейса, ВидСравненияКомпоновкиДанных.Равно);
		
		Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда
			ЗаголовокДополнение = НСтр("ru = 'Яндекс.Маркет'");
			Элементы.Организация.Видимость = Ложь;
			Элементы.ИсточникКатегории.Видимость = Ложь;
		ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
			ЗаголовокДополнение = НСтр("ru = 'Ozon'");
		ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсWildberries Тогда
			ЗаголовокДополнение = НСтр("ru = 'Wildberries'");
		КонецЕсли;
		
		Элементы.Код.Видимость = Ложь;
		Элементы.ВидМаркетплейса.Видимость = Ложь;
		Элементы.ИдентификаторКлиента.Видимость = Ложь;
		Заголовок = СтрШаблон(НСтр("ru = 'Интеграции с %1'"), ЗаголовокДополнение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено( ВидМаркетплейса ) Тогда
		Элементы.ГруппаСоздать.Видимость = Ложь;
	Иначе
		Элементы.КнопкаСоздать.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "УдалениеИнтеграцииМаркетплейса"
	Или ИмяСобытия = "ЗаписьИнтеграцииМаркетплейса" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Асинх Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;

    Если ЗначениеЗаполнено( ВидМаркетплейса ) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить( "ВидМаркетплейса", ВидМаркетплейса );
		ОткрытьФорму( "Справочник.УчетныеЗаписиМаркетплейсов.Форма.ФормаЭлемента", ПараметрыФормы, , ВидМаркетплейса );
	Иначе
		СписокВыбора = Новый СписокЗначений;
		
		СписокВыбора.Добавить( 
			ПредопределенноеЗначение( "Перечисление.ВидыМаркетплейсов.МаркетплейсЯндексМаркет" ), 
			НСтр("ru = 'Яндекс маркет'"), , 
			БиблиотекаКартинок.ЯндексМаркетЛоготип );
			
		СписокВыбора.Добавить( 
			ПредопределенноеЗначение( "Перечисление.ВидыМаркетплейсов.МаркетплейсOzon" ), 
			"Ozon", , 
			БиблиотекаКартинок.ЛоготипOzon2 );
		
		РезультатВыбора = Ждать СписокВыбора.ВыбратьЭлементАсинх( НСтр( "ru = 'Выберите вид маркетплейса'" ) );
		СписокВидовМаркетплейсовПослеВыбора( РезультатВыбора, Неопределено );
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СписокВидовМаркетплейсовПослеВыбора( Значение, ДополнительныеПараметры ) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранВидМаркетплейса = Значение.Значение;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить( "ВидМаркетплейса", ВыбранВидМаркетплейса );
	ОткрытьФорму( "Справочник.УчетныеЗаписиМаркетплейсов.Форма.ФормаЭлемента", ПараметрыФормы, , ВыбранВидМаркетплейса );
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСоздатьOzon(Команда)
	ВыбранВидМаркетплейса = ПредопределенноеЗначение( "Перечисление.ВидыМаркетплейсов.МаркетплейсOzon" );
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить( "ВидМаркетплейса", ВыбранВидМаркетплейса );
	ОткрытьФорму( "Справочник.УчетныеЗаписиМаркетплейсов.Форма.ФормаЭлемента", ПараметрыФормы, , ВыбранВидМаркетплейса );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСоздатьЯндексМаркет(Команда)
	ВыбранВидМаркетплейса = ПредопределенноеЗначение( "Перечисление.ВидыМаркетплейсов.МаркетплейсЯндексМаркет" );
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить( "ВидМаркетплейса", ВыбранВидМаркетплейса );
	ОткрытьФорму( "Справочник.УчетныеЗаписиМаркетплейсов.Форма.ФормаЭлемента", ПараметрыФормы, , ВыбранВидМаркетплейса );
КонецПроцедуры

#КонецОбласти