

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сертификат", Сертификат);
	
	Пояснение = "";
	Если Параметры.Свойство("Пояснение", Пояснение) И ЗначениеЗаполнено(Пояснение) Тогда
		Элементы.Пояснение.Заголовок = Пояснение;
	КонецЕсли;
	
	Если Не ИнтерфейсПользователяБЭДКлиентСервер.ЭтоИнтерфейсВерсия8_5() Тогда
		Элементы.ОК.Заголовок = НСтр("ru = 'ОК'");
		ИнтерфейсДокументовЭДО.ПереместитьЭлемент(Элементы, "ОК", "ГруппаВводаПароля");
		Элементы.Пароль.РастягиватьПоГоризонтали = Ложь;
		Элементы.Пароль.АвтоМаксимальнаяШирина = Истина;
		Элементы.Пояснение.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ЗавершениеРаботыПрограммы = ЗавершениеРаботы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ЭлектроннаяПодписьКлиент.УстановитьПарольСертификата(Сертификат, Пароль);
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти