
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрыВыполненияКоманды.Окно = Неопределено Тогда
		Источник = Неопределено;
		Уникальность = "ПрограммыЛояльности";
	Иначе
		Источник = ПараметрыВыполненияКоманды.Источник;
		Уникальность = ПараметрыВыполненияКоманды.Уникальность;
	КонецЕсли;
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("АктивироватьБонусы", Истина);
	ОткрытьФорму("Обработка.БонусныеПрограммы.Форма", 
		ПараметрыОткрытия, 
		Источник, 
		Уникальность, 
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти