
#Область ОбработчикиСобытий

&НаКлиенте
// Процедура обработки команды.
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыФормы = Новый Структура();
	
	Отбор = Новый Структура("Маршрут", ПараметрКоманды);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.ПравилаМаршрутизацииЗаявок.ФормаСписка", ПараметрыФормы,
																		ПараметрыВыполненияКоманды.Источник,
																		ПараметрыВыполненияКоманды.Уникальность,
																		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти