#Область ПрограммныйИнтерфейс

Процедура ЗаказыПоставщикам(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт

	ПараметрыФормы = РасчетПотребностейВызовСервера.РеквизитыЗаказа(Источник);
	
	Если ПараметрыФормы.Свойство("ЗаказПокупателя")
		И ТипЗнч(ПараметрыФормы.ЗаказПокупателя) = Тип("Массив") Тогда
		
		Если ПараметрыФормы.ЗаказПокупателя.Количество() = 1 Тогда
			ПараметрыФормы.ЗаказПокупателя = ПараметрыФормы.ЗаказПокупателя[0];
		Иначе
			ПараметрыФормы.Удалить("ЗаказПокупателя");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыФормы.Свойство("ЗаказПокупателя")
		И ПараметрыФормы.Свойство("ВидОперации")
		И РаботаСЗаявкамиКлиентСервер.ЭтоЗаявка(ПараметрыФормы.ВидОперации) Тогда
		ВызватьИсключение РаботаСЗаявкамиКлиентСервер.СообщениеОНеобходимостиПереводаЗаявкиВЗаказ(
		ПараметрыФормы.ЗаказПокупателя);
	КонецЕсли;
	
	ОткрытьФорму(
		"Обработка.РасчетПотребностей.Форма", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник);

	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"РасчетПотребностейКлиент.ЗаказыПоставщикам",
		ПараметрыВыполненияКоманды.Источник);    
		
КонецПроцедуры        

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОперацииПослеФормирования(Форма, ПараметрыФормы) Экспорт
	
	Если ПараметрыФормы.РезультатФоновогоЗадания.Статус <> "Выполняется" 
		И ПараметрыФормы.РезультатФоновогоЗадания.Статус <> "Ошибка" 
		И Не ПараметрыФормы.ПлоскийСписок Тогда
		
		Для каждого Строка Из Форма.Запасы.ПолучитьЭлементы() Цикл
			Форма.Элементы.Запасы.Свернуть(Строка.ПолучитьИдентификатор());
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция РаспределитьПоИсточнику(ПараметрыФормы, ТекСтр, СтрокаИсточник, Распределить, Пропустить) Экспорт
	
	Изменено 	= (СтрокаИсточник.Заказать <> Распределить);
	Пропустить  = Ложь;
	
	Если Изменено Тогда               
		
		Если СтрокаИсточник.Лимит > 0
			И СтрокаИсточник.СпособПополнения <> ПредопределенноеЗначение("Перечисление.СпособыПополненияЗапасов.Перемещение")
			Тогда
			
			Заказать = СтрокаИсточник.Лимит;
			
		Иначе
			Заказать = Распределить;
		КонецЕсли; 

	Иначе
		Заказать	 = 0;
	КонецЕсли;
	
	Возврат Заказать;
	
КонецФункции

Функция РаспределитьПоЗаказу(ПараметрыФормы, ТекСтр, ВложеннаяСтрока, Распределить, Пропустить) Экспорт

	Пропустить  = Ложь;
	
	Возврат ВложеннаяСтрока.Дефицит;
	
КонецФункции

Функция РаспределитьПоПериоду(ПараметрыФормы, ТекСтр, ВложеннаяСтрока, Распределить, Пропустить) Экспорт
	
	Пропустить  = Ложь;

	Возврат ВложеннаяСтрока.Дефицит;
	
КонецФункции

Функция РаспределитьПоДефициту(ПараметрыФормы, ТекСтр, ВложеннаяСтрока, Распределить, Пропустить) Экспорт
	
	Пропустить  = Ложь;

	Возврат ВложеннаяСтрока.Дефицит;
	
КонецФункции

Функция СформироватьПредставлениеПериодаАнализа(ДатаНачала, ДатаОкончания) Экспорт

	ДатаКалендаряНачало 	= НачалоДня(ДатаНачала);
	ДатаКалендаряОкончание 	= КонецДня(ДатаОкончания);
	
	Если Месяц(ДатаКалендаряНачало) = Месяц(ДатаКалендаряОкончание) 
		И Год(ДатаКалендаряНачало) = Год(ДатаКалендаряОкончание) Тогда
		
		ДеньРасписанияНачало = Формат(ДатаКалендаряНачало, "ДФ=дд");
		ДеньНеделиРасписанияНачало = ПредставлениеДняНедели(ДатаКалендаряНачало);
		ДеньРасписанияОкончание = Формат(ДатаКалендаряОкончание, "ДФ=дд");
		ДеньНеделиРасписанияОкончание = ПредставлениеДняНедели(ДатаКалендаряОкончание);
		
		МесяцРасписания = Формат(ДатаКалендаряНачало, "ДФ=МММ");
		ГодРасписания = Формат(Год(ДатаКалендаряНачало), "ЧГ=0");
		
		Представление = СтрШаблон(НСтр("ru = '%1 %2 - %3 %4 %5, %6'"), ДеньНеделиРасписанияНачало, ДеньРасписанияНачало, 
			ДеньНеделиРасписанияОкончание, ДеньРасписанияОкончание, МесяцРасписания, ГодРасписания);
		
	Иначе
		
		ДеньРасписанияНачало = Формат(ДатаКалендаряНачало, "ДФ=дд");
		ДеньНеделиРасписанияНачало = ПредставлениеДняНедели(ДатаКалендаряНачало);
		МесяцРасписанияНачало = Формат(ДатаКалендаряНачало, "ДФ=МММ");
		ДеньРасписанияОкончание = Формат(ДатаКалендаряОкончание, "ДФ=дд");
		ДеньНеделиРасписанияОкончание = ПредставлениеДняНедели(ДатаКалендаряОкончание);
		МесяцРасписанияОкончание = Формат(ДатаКалендаряОкончание, "ДФ=МММ");
		
		Если Год(ДатаКалендаряНачало) = Год(ДатаКалендаряОкончание) Тогда
			ГодРасписания = Формат(Год(ДатаКалендаряНачало), "ЧГ=0");
			Представление = СтрШаблон(НСтр("ru = '%1 %2 %3 - %4 %5 %6, %7'"), ДеньНеделиРасписанияНачало, 
				ДеньРасписанияНачало, МесяцРасписанияНачало, ДеньНеделиРасписанияОкончание, ДеньРасписанияОкончание, 
				МесяцРасписанияОкончание, ГодРасписания);
		Иначе
			ГодРасписанияНачало = Формат(Год(ДатаКалендаряНачало), "ЧГ=0");
			ГодРасписанияОкончание = Формат(Год(ДатаКалендаряОкончание), "ЧГ=0");
			Представление = СтрШаблон(НСтр("ru = '%1 %2 %3 %4 - %5 %6 %7 %8'"), ДеньНеделиРасписанияНачало, 
				ДеньРасписанияНачало, МесяцРасписанияНачало, ГодРасписанияНачало, ДеньНеделиРасписанияОкончание, 
				ДеньРасписанияОкончание, МесяцРасписанияОкончание, ГодРасписанияОкончание);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПериодПродажПоУмолчанию() Экспорт
	
	ДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	Результат = Новый СтандартныйПериод(НачалоДня(ДатаСеанса - 28 * 24 * 60 * 60), НачалоДня(ДатаСеанса) - 1);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеДняНедели(ДеньНеделиКалендаря)
	
	НомерДняНедели = ДеньНедели(ДеньНеделиКалендаря);
	Если НомерДняНедели = 1 Тогда
		
		Возврат НСтр("ru = 'Пн'");
		
	ИначеЕсли НомерДняНедели = 2 Тогда
		
		Возврат НСтр("ru = 'Вт'");
		
	ИначеЕсли НомерДняНедели = 3 Тогда
		
		Возврат НСтр("ru = 'Ср'");
		
	ИначеЕсли НомерДняНедели = 4 Тогда
		
		Возврат НСтр("ru = 'Чт'");
		
	ИначеЕсли НомерДняНедели = 5 Тогда
		
		Возврат НСтр("ru = 'Пт'");
		
	ИначеЕсли НомерДняНедели = 6 Тогда
		
		Возврат НСтр("ru = 'Сб'");
		
	Иначе
		
		Возврат НСтр("ru = 'Вс'");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
