#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Установить функциональную опцию для оплаты картами, если включена розничная торговля
// Версия 3.0.13
//
Процедура УстановитьФОДляИспользованияОплатыПлатежнымиКартами() Экспорт
	
	ВключенаРозничнаяТорговля = Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Получить();
	Если ВключенаРозничнаяТорговля <> Истина Тогда
		
		ТекстСообщения = НСтр(
		"ru='Процедура УстановитьФОДляИспользованияОплатыПлатежнымиКартами успешно отработала, опция НЕ установлена'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Обработки.НачалоРаботыСПрограммой, ,
		ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	Константы.ФункциональнаяОпцияИспользоватьОплатуКартами.Установить(Истина);
	
	ТекстСообщения = НСтр(
	"ru='Процедура УстановитьФОДляИспользованияОплатыПлатежнымиКартами успешно отработала, опция установлена'",
	ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(
	ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.Обработки.НачалоРаботыСПрограммой, ,
	ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли