#Область ПрограммныйИнтерфейс

// Помещает содержимое присоединенного файла во временное хранилище и возвращает адрес
//
// Параметры:
//  Ссылка - СправочникСсылка.НоменклатураПрисоединенныеФайлы, 
//  		 СправочникСсылка.ХарактеристикиНоменклатурыПрисоединенныеФайлы - ссылка на справочник "Присоединенные файлы".
//  Адрес - Строка - адрес во временном хранилище.
// 
// Возвращаемое значение:
//  Строка - адрес во временном хранилище
//
Функция ПрисоединенныйФайлВоВременноеХранилище( Ссылка, Адрес = Неопределено ) Экспорт
	Возврат ИнтеграцияСМаркетплейсамиСервер.ПрисоединенныйФайлВоВременноеХранилище( Ссылка, Адрес );
КонецФункции

// Возвращает Данные номенклатуры контрагентов.
//
// Параметры:
//   Ссылки - СправочникСсылка.НоменклатураКонтрагентов - номенклатура контрагента.
//
// Возвращаемое значение:
//   Массив из см. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента.
//
Функция НоменклатураКонтрагентовПоСсылкам(Знач Ссылки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураКонтрагентов.ВладелецНоменклатуры КАК Владелец, //!!!!! .Владелец
		|	НоменклатураКонтрагентов.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ втОтбор
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|ГДЕ
		|	НоменклатураКонтрагентов.Ссылка В(&Ссылки)";
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	
	Возврат СопоставлениеНоменклатурыКонтрагентов.ДанныеНоменклатурыКонтрагентаПоЗапросу(Запрос);
	
КонецФункции

#КонецОбласти