
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	ВывестиБаннеры();
	
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	УстановитьУсловноеОформление();
	УстановитьУсловноеОформлениеПоСостояниямСобытий();
	УстановитьУсловноеОформлениеОтмененныхСобытий();
	УстановитьОтборТекущиеДела();
	
	Если Параметры.Свойство("ТипСобытия") Тогда
		ТипСобытия = Параметры.ТипСобытия;
	КонецЕсли;
	
	//@skip-check optional-form-parameter-access
	Если Параметры.Свойство("ТипСобытия") И Параметры.ТипСобытия = Перечисления.ТипыСобытий.ЭлектронноеПисьмо Тогда
		ЗаполнитьПочтовыеЯщики();
		УстановитьОтборПоПочтовомуЯщикуНаСервере();
	КонецЕсли;
	
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("Контакт") И ЗначениеЗаполнено(Параметры.Контакт) Тогда
		КонтекстКонтакт = Параметры.Контакт;
	КонецЕсли;

	Если Параметры.Свойство("ПульсБизнеса") Тогда   
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'События: Пульс бизнеса'");
	КонецЕсли;
	
	ЛидыДоступны = РаботаСЛидами.ЛидыДоступны();
	Если Не ЛидыДоступны Тогда
		Список.Параметры.УстановитьЗначениеПараметра("НетДоступаКЛидам",Истина);
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборСпам", ОтборСпам);
	
	Если Элементы.СписокГруппаСоздатьОбертка.Видимость Тогда
		Элементы.СписокГруппаСоздатьОбертка.Видимость = ПравоДоступа("Добавление", Метаданные.Документы.Событие);
	КонецЕсли;
	
	УстановитьОтборПоКонтактам();
	
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("ДокументОснование") И ЗначениеЗаполнено(Параметры.ДокументОснование) Тогда
		УстановитьОтборПоДокументОснование(Параметры.ДокументОснование);
	КонецЕсли;
	
	КонтекстноеОткрытие = Параметры.Свойство("ТекущиеДела") Или Параметры.Свойство("Контакт") Или Параметры.Свойство("ДокументОснование") Или Параметры.Свойство("ПульсБизнеса");
	
	ЗаполнитьКомандыИзмененияСостояния();
	
	ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(ОтборПериод);
	
	// УНФ.ПанельКонтактнойИнформации
	КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформация", "СписокКонтекстноеМеню");
	// Конец УНФ.ПанельКонтактнойИнформации
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	РежимОткрытияОкна = ?(Параметры.РежимВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца, РежимОткрытияОкнаФормы.Независимый);
	
	ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи = ПолучитьФункциональнуюОпцию("ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "ФормаСоздатьЗапись", "Видимость", ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи);
	
	ПредпросмотрПриСозданииНаСервере();
	
	ВремяЗадержкиОбработчиковОжиданияПриАктивизацииСписка = 0.3;
	
	Если Параметры.Свойство("ТипСобытия") Тогда
		ОтборТипСобытия = Параметры.ТипСобытия;
	КонецЕсли;
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	// УНФ.ОтборыСписка
	ИменаНетиповыхОтборов = "ОтборВходящееИсходящее,ОтборПропущенные,ОтборСпам";
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	Если НЕ КонтекстноеОткрытие Тогда
		
		РаботаСОтборами.ВосстановитьНастройкиОтборов(
		ЭтотОбъект,
		Список, , ,
		Новый Структура("ОтборПериод", "НачалоСобытия"),
		ОтборТипСобытия, , , , , ,
		"Контакты,ГруппаРаботаСОтборами,ЗначокКонтакты",
		ТипСобытия = Перечисления.ТипыСобытий.ЭлектронноеПисьмо);
		
	Иначе
		РаботаСОтборами.ОпределитьОтображениеПравойПанели(ЭтотОбъект, , "Контакты,ГруппаРаботаСОтборами,ГруппаОтступ");
		РаботаСОтборамиКлиентСервер.УстановитьОтображениеКомандыСброситьВсеОтборы(ЭтотОбъект);
		РаботаСОтборами.СвернутьРазвернутьОтборыНаСервере(ЭтотОбъект, Ложь);
	КонецЕсли;
	// Конец УНФ.ОтборыСписка
	
	УправлениеФормойСервер(Истина);
	
	АдаптацияМобильныйКлиент();
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнениеВремениОбработчиковОжидания();
	
	ОтобразитьПочтовыеЯщикиПриОткрытии();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы И НЕ КонтекстноеОткрытие Тогда
		//УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		//Конец УНФ.ОтборыСписка
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СостоянияСобытий" Тогда
		УстановитьУсловноеОформлениеПоСостояниямСобытий();
		ЗаполнитьКомандыИзмененияСостояния();
	ИначеЕсли ИмяСобытия = "Запись_Событие" Тогда		
		Элементы.Список.Обновить();
	КонецЕсли;
	
	Если ИмяСобытия = ЭлектроннаяПочтаУНФКлиентСервер.ИмяСобытияУчетнаяЗаписьОбновлена() Тогда
		Если НЕ ПочтовыеСлужбыПодключены Тогда
			НастроитьГруппуПочтоваяСлужба();
			НачатьПроверкуПочты(ЭлектроннаяПочтаУНФКлиентСервер.РежимЗагрузкиНовыеСообщения());
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьСеансовыеДанные" Тогда
		ОбработатьРезультатЗапросаТокена(Параметр, );
	КонецЕсли;
	
	ОбработкаОповещенияУчетныеЗаписи(ИмяСобытия, Параметр, Источник);
	ОбработкаОповещенияЗагруженыНовыеПисьма(ИмяСобытия, Параметр, Источник);
	
	НужноПоказатьСодержание =
	ИмяСобытия = "Запись_Контрагент"
	Или ИмяСобытия = "Запись_КонтактноеЛицо"
	Или ИмяСобытия = РаботаСЛидамиКлиентСервер.КлючОповещения()
	Или ИмяСобытия = "Запись_ЭлектронноеПисьмо"
	Или ИмяСобытия = "Запись_Событие";
	Если НужноПоказатьСодержание Тогда
		ПодключитьОбработчикОжидания("ПоказатьСодержаниеПисьмаОбработчик", 0.1, Истина);
	КонецЕсли;
	
	// УНФ.ПанельКонтактнойИнформации
	Если КонтактнаяИнформацияПанельУНФКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьПанельКонтактнойИнформацииСервер();
	КонецЕсли;
	// Конец УНФ.ПанельКонтактнойИнформации
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборКонтакты = Новый Массив;
	ОтборКонтакты.Добавить(ВыбранноеЗначение);
	
	ДополнитьОтборПоКонтрагентуЛидами(ОтборКонтакты, КонтекстКонтакт);
	ДополнитьОтборПоКонтрагентуКонтактами(ОтборКонтакты, ВыбранноеЗначение);
	ДополнитьОтборАдресатамиПисем(ОтборКонтакты, ВыбранноеЗначение);
	
	УстановитьМеткуИОтборСписка("ТЧУчастники.Контакт", Элемент.Родитель.Имя, ОтборКонтакты, Строка(ВыбранноеЗначение));
	
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПропущенныеПриИзменении(Элемент)
	
	УстановитьОтборПропущенные();
	ОбновитьФильтрыПоДополнительнымФильтрам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСпамПриИзменении(Элемент)
	
	УстановитьОтборСпам();
	ОбновитьФильтрыПоДополнительнымФильтрам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Ответственный", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипСобытияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ТипСобытия", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Состояние", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВажностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Важность", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПроектОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Проект", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПисьмаДокументСформирован(Элемент)
	
	ГипертекстКлиент.ПрименитьНастройкиОтображения(Элемент.Документ);
	ГипертекстКлиент.СтилизоватьПерепискуСЦитированием(Элемент.Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПисьмаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		ЭтоСпам = Ложь;
	Иначе
		ЭтоСпам = Элементы.Список.ТекущиеДанные.ЭтоСпам;
	КонецЕсли;
	
	ЭлектроннаяПочтаУНФКлиент.ПредпросмотрПриНажатии(
	Элемент, ДанныеСобытия, СтандартнаяОбработка, ЭтотОбъект, ЭтоСпам);
	
	ОбработкаНажатияДляЗагрузкиСообщения(ДанныеСобытия.Element);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВходящееИсходящееПриИзменении(Элемент)
	
	УстановитьОтборВходящееИсходящее();
	УправлениеФормой();
	
	ОбновитьФильтрыПоДополнительнымФильтрам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборУчетнаяЗаписьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("УчетнаяЗапись", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьПочтовуюСлужбуОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокКонтактыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Контакты;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаТаксиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "НачалоСобытия");
	
КонецПроцедуры

&НаКлиенте
Процедура ПраваяПанельСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Контакты Тогда
		ПраваяПанельСтраницыПриСменеСтраницыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "НачалоСобытия");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаОчистка(Элемент, СтандартнаяОбработка)
	
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "Список", "НачалоСобытия");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактыКонтрагентНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.Список.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначениеАсинх(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПочтовыеЯщикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	ПочтовыеЯщикиВыборНаСервере(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЭтотОбъект.КИ_НужноИзменитьДанныеПриАктивизацииСтрокиТаблицы =
	КонтактнаяИнформацияПанельУНФКлиент.НужноИзменитьКонтактнуюИнформациюПриАктивизацииСтрокиТаблицы(
	ЭтотОбъект, Элемент, ТекущееСобытие, "Ссылка")
	И Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Контакты;
	
	НужноЗаполнитьПредпросмотрПриАктивизацииСтрокиСписка = НужноЗаполнитьПредпросмотрНаОснованииРеквизитов(Ложь);
	ЗаполнитьНеобходимостьПоказатьПредпросмотрЕслиНужно(НужноЗаполнитьПредпросмотрПриАктивизацииСтрокиСписка);
	
	ПодключитьОбработчикОжидания(
	"СписокПриАктивизацииСтрокиОбработчик",
	ВремяЗадержкиОбработчиковОжиданияПриАктивизацииСписка,
	Истина);
	
	Если Не ЭтоСписокПисем Тогда
		
		Если Элемент.ТекущиеДанные = Неопределено Или ТипЗнч(Элемент.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеСтроки = Элемент.ТекущиеДанные;
		Элементы.ПереходКДополнительнымДаннымВсеСобытия.Доступность = 
		(ДанныеСтроки.ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ЭлектронноеПисьмо"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЭтоСписокПисем Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка = Неопределено Тогда
		Если ТипЗнч(Элемент.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Возврат;
		КонецЕсли;
		ДанныеСтроки = Элемент.ТекущиеДанные;
	ИначеЕсли ТипЗнч(Строка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	Иначе
		ДанныеСтроки = Элемент.ДанныеСтроки(Строка);
	КонецЕсли;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПереходКДополнительнымДаннымВсеСобытия.Доступность = 
	(ДанныеСтроки.ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ЭлектронноеПисьмо"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("СозданиеФормы"
		+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));
	
	ЗаполняемоеЗначение = Новый Структура;
	Если Копирование Тогда
		ЗаполняемоеЗначение.Вставить("ТипСобытия", Элемент.ТекущиеДанные.ТипСобытия);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ТипСобытия)Тогда
		ЗаполняемоеЗначение.Вставить("ТипСобытия", Параметры.ТипСобытия);
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(ОтборОснование) Тогда
		
		Отказ = Истина;
		
		ЗаполняемоеЗначение.Вставить("ОснованиеЗаполнения", ОтборОснование);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗаполняемоеЗначение);
		ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли ЗначениеЗаполнено(КонтекстКонтакт) Тогда
		
		Отказ = Истина;
		
		ЗаполняемоеЗначение.Вставить("ОснованиеЗаполнения", КонтекстКонтакт);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗаполняемоеЗначение);
		ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыФормы);
		
	Иначе
		
		ОтборПоКонтрагенту = ПолучитьОтборПоКонтрагенту();
		
		Если ОтборПоКонтрагенту <> Неопределено Тогда
			
			Отказ = Истина;
			
			ЗаполняемоеЗначение.Вставить("ОснованиеЗаполнения", ОтборПоКонтрагенту);
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗаполняемоеЗначение);
			ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыФормы);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормы"
		+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	УстановитьУсловноеОформлениеСтрокСписка(Строки, Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	
	Если Не ПочтовыеСлужбыПодключены Тогда
		Возврат;
	КонецЕсли;
	
	НачатьПроверкуПочты(ЭлектроннаяПочтаУНФКлиентСервер.РежимЗагрузкиНовыеСообщения());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПочтовыеЯщики

&НаКлиенте
Процедура ПочтовыеЯщикиПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ПочтовыеЯщикиКонтекстноеМенюНастроитьПочтовыеЯщикиУчетнойЗаписи.Видимость = ЗначениеЗаполнено(Элемент.ТекущиеДанные.УчетнаяЗапись);
	ПодключитьОбработчикОжидания("УстановитьОтборПоПочтовомуЯщику", 0.3, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПочтовыеЯщикиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	
	СтрокаПочтовыеЯщики = ПочтовыеЯщики.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
	ДоступноПеретаскивание = ТипЗнч(СтрокаПочтовыеЯщики.ПочтовыйЯщик) = Тип("СправочникСсылка.ПочтовыеЯщикиУчетныхЗаписей")
	И ЗначениеЗаполнено(СтрокаПочтовыеЯщики.ПочтовыйЯщик);
	
	Если Не ДоступноПеретаскивание Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	
	ПараметрыПеретаскивания.Значение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаПочтовыеЯщики.ПочтовыйЯщик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПочтовыеЯщикиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если Строка = Неопределено Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	СтрокаПочтовыеЯщики = ПочтовыеЯщики.НайтиПоИдентификатору(Строка);
	ДоступноПеретаскивание = ТипЗнч(СтрокаПочтовыеЯщики.ПочтовыйЯщик) = Тип("СправочникСсылка.ПочтовыеЯщикиУчетныхЗаписей")
		И ЗначениеЗаполнено(СтрокаПочтовыеЯщики.ПочтовыйЯщик);
	Если Не ДоступноПеретаскивание Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Перемещение;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПочтовыеЯщикиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Массив")
		Или ПараметрыПеретаскивания.Значение.Количество() = 0
		Или ТипЗнч(ПараметрыПеретаскивания.Значение[0]) <> Тип("ДокументСсылка.Событие")Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПочтовыеЯщики = ПочтовыеЯщики.НайтиПоИдентификатору(Строка);
	ДоступноПеретаскивание = ТипЗнч(СтрокаПочтовыеЯщики.ПочтовыйЯщик) = Тип("СправочникСсылка.ПочтовыеЯщикиУчетныхЗаписей")
		И ЗначениеЗаполнено(СтрокаПочтовыеЯщики.ПочтовыйЯщик);
	Если Не ДоступноПеретаскивание Тогда
		Возврат;
	КонецЕсли;
	
	ПоместитьПисьмаВПочтовыйЯщикНаСервере(ПараметрыПеретаскивания.Значение, СтрокаПочтовыеЯщики.ПочтовыйЯщик);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Баннеры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(Команда)
	
	ПрефиксКоманд = ОбщегоНазначенияКлиентСервер.ПрефиксКомандСкрытияВажногоСообщения();
	
	Если СтрНачинаетсяС(Команда.Имя, ПрефиксКоманд + Элементы.ГруппаУчетныеЗаписиОтключены.Имя)
		Или СтрНачинаетсяС(Команда.Имя, ПрефиксКоманд + Элементы.ГруппаПроизошлаОшибка.Имя) Тогда
		
		Элементы.ГруппаБаннерыОшибкиЗагрузки.Видимость = Ложь;
		
	ИначеЕсли СтрНачинаетсяС(Команда.Имя, ПрефиксКоманд + Элементы.НебезопасноеСодержимое.Имя) Тогда
		
		Элементы.НебезопасноеСодержимое.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БаннерУчетныеЗаписиОтключены_НастроитьУчетныеЗаписи(Команда)
	
	ОткрытьНастройкиУчетныхЗаписей();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БаннерОшибкаЗагрузки_НастроитьУчетныеЗаписи(Команда)
	
	ОткрытьНастройкиУчетныхЗаписей();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БаннерОшибкаЗагрузки_ПовторитьЗагрузку(Команда)
	
	НачатьПроверкуПочты(ЭлектроннаяПочтаУНФКлиентСервер.РежимЗагрузкиНовыеСообщения());
	Элементы.ГруппаБаннерыОшибкиЗагрузки.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БаннерНебезопасноеСодержимое_ПоказатьВсеКартинки(Команда)
	
	//@skip-check module-self-reference
	ЭлектроннаяПочтаУНФКлиент.НебезопасноеСодержимоеНажатие(
	ЭтотОбъект.Предпросмотр_СсылкаНаСобытие,
	Элементы.ТекстПисьма,
	Элементы.НебезопасноеСодержимое);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БаннерПроизошлаОшибкаПриЗагрузкеПисьма_НастроитьУчетныеЗаписи()
	
	ОткрытьНастройкиУчетныхЗаписей();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БаннерПроизошлаОшибкаПриЗагрузкеПисьма_ПовторитьЗагрузкуСообщения()
	
	ЗагрузитьСообщениеСПочтовогоСервера();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БаннерСпам_ЭтоНеСпам()
	
	Если Элементы.Список.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	Событие = Элементы.Список.ТекущиеДанные.Ссылка;
	Подключаемый_БаннерСпам_ЭтоНеСпамНаСервере(Событие);
	ОповеститьОбИзменении(Тип("ДокументСсылка.Событие"));
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СоздатьЗапись(Команда)
	
	СоздатьСобытие(ПредопределенноеЗначение("Перечисление.ТипыСобытий.Запись"));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛичнаяВстреча(Команда)
	
	СоздатьСобытие(ПредопределенноеЗначение("Перечисление.ТипыСобытий.ЛичнаяВстреча"));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПрочее(Команда)
	
	СоздатьСобытие(ПредопределенноеЗначение("Перечисление.ТипыСобытий.Прочее"));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСообщениеSMS(Команда)
	
	СоздатьСобытие(ПредопределенноеЗначение("Перечисление.ТипыСобытий.СообщениеSMS"));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТелефонныйЗвонок(Команда)
	
	СоздатьСобытие(ПредопределенноеЗначение("Перечисление.ТипыСобытий.ТелефонныйЗвонок"));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлектронноеПисьмо(Команда)
	
	СоздатьСобытие(ПредопределенноеЗначение("Перечисление.ТипыСобытий.ЭлектронноеПисьмо"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьКакПрочтенныеНепрочтенные(Команда)
	
	ВыделенныеСобытия = ВыделенныеСобытия();
	Если ВыделенныеСобытия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПометитьКакПрочтенныеНепрочтенныеНаСервере(ВыделенныеСобытия);
	ОповеститьОбИзменении(Тип("ДокументСсылка.Событие"));
	Если ВыделенныеСобытия.Количество() > 1 Тогда
		ЗаголовокОповещения = НСтр("ru = 'Установлена прочитанность писем'");
		ПоказатьОповещениеПользователя(ЗаголовокОповещения,,, БиблиотекаКартинок.ИнформацияБаннерЦветной);
	Иначе
		ЗаголовокОповещения = НСтр("ru = 'Установлена прочитанность письма'");
		ПоказатьОповещениеПользователя(ЗаголовокОповещения,
			ПолучитьНавигационнуюСсылку(ВыделенныеСобытия[0]), ВыделенныеСобытия[0], БиблиотекаКартинок.ИнформацияБаннерЦветной);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьКакСпамНеСпам(Команда)
	
	ВыделенныеСобытия = ВыделенныеСобытия();
	Если ВыделенныеСобытия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПометитьКакСпамНеСпамНаСервереБезКонтекста(ВыделенныеСобытия);
	ОповеститьОбИзменении(Тип("ДокументСсылка.Событие"));
	
КонецПроцедуры

&НаКлиенте
Процедура Ответить(Команда)
	
	ОтветитьПереслать(ЭлектроннаяПочтаУНФКлиентСервер.КомандаОтветить());
	
КонецПроцедуры

&НаКлиенте
Процедура Переслать(Команда)
	
	ОтветитьПереслать(ЭлектроннаяПочтаУНФКлиентСервер.КомандаПереслать());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьВсем(Команда)
	
	ОтветитьПереслать(ЭлектроннаяПочтаУНФКлиентСервер.КомандаОтветитьВсем());
	
КонецПроцедуры

&НаКлиенте
Процедура ВажностьВысокая(Команда)
	
	УстановитьВажность("Высокая");
	
КонецПроцедуры

&НаКлиенте
Процедура ВажностьНормальная(Команда)
	
	УстановитьВажность("Нормальная");
	
КонецПроцедуры

&НаКлиенте
Процедура ВажностьНизкая(Команда)
	
	УстановитьВажность("Низкая");

КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормыДляПисем(Команда)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьИзменениеНастроекФормы", ЭтотОбъект);
	ОткрытьФорму("Документ.Событие.Форма.ФормаНастройкаСписка",,,,,,ОповещениеОЗакрытии);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормыДляВсехСобытий(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьИзменениеНастроекФормыВсехСобытий", ЭтотОбъект);
	
	ПараметрыВФорму = Новый Структура;
	ПараметрыВФорму.Вставить("НастройкаСпискаСобытий", Истина);
	ОткрытьФорму("Документ.Событие.Форма.ФормаНастройкаСписка", ПараметрыВФорму, , , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПочтовыеЯщикиУчетнойЗаписи(Команда)
	ПараметрыФормы = Новый Структура("УчетнаяЗапись", Элементы.ПочтовыеЯщики.ТекущиеДанные.УчетнаяЗапись);
	ОткрытьФорму("РегистрСведений.НастройкиЗагрузкиПисем.Форма.ФормаНастройки",  ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПереслатьПисьмоКакВложение(Команда)
	Результат = ПолучитьДанныеПисемДляВложения(
	Элементы.Список.ПолучитьСтрокиДляОбработки());
	ТипСобытия = Результат.ТипСобытия;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ТипСобытия", ТипСобытия);
	ЗначенияЗаполнения.Вставить("АдресВременногоХранилища", Результат.Адрес);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьЗагрузкуСообщения(Команда)
	
	ЗагрузитьСообщениеСПочтовогоСервера();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИзменитьСостояние(Команда)
	
	События = Элементы.Список.ПолучитьСтрокиДляОбработки();
	
	СостоянияДокументовКлиент.УстановитьСостояние(Команда.Имя, ДоступныеСостояния, События);	
	
	ИмяСобытия = СостоянияДокументовКлиент.ПолучитьИмяСобытияОповещения(Тип("ДокументСсылка.Событие"));
	
	Если События.Количество() = 1 Тогда 
		Оповестить(ИмяСобытия, , События[0]);
	Иначе
		Оповестить(ИмяСобытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	
	ИмяРеквизитаСписка = "Список";
	ИмяТЧДанныеМеток = "ДанныеМеток";
	ИмяТЧДанныеОтборов = "ДанныеОтборов";
	ИмяГруппыОтборов = "ГруппаОтборы";
	ИмяПредопределенныеОтборыПоУмолчанию = "ПредопределенныеОтборыПоУмолчанию";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизитаСписка", ИмяРеквизитаСписка);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеОтборов", ИмяТЧДанныеОтборов);
	ДополнительныеПараметры.Вставить("ИмяГруппыОтборов", ИмяГруппыОтборов);
	ДополнительныеПараметры.Вставить("ИмяПредопределенныеОтборыПоУмолчанию", ИмяПредопределенныеОтборыПоУмолчанию);
	
	ОтборыДляИсключения = Новый Массив;
	ОтборыДляИсключения.Добавить("Просмотрено");
	ОтборыДляИсключения.Добавить("Неотвеченный");
	ДополнительныеПараметры.Вставить("ОтборыДляИсключения", ОтборыДляИсключения);
	
	РаботаСОтборамиКлиент.НастроитьОтборыНажатие(ЭтотОбъект, ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры), ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеОтборы(Команда)
	
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, , "НачалоСобытия");
	
	ОтборВходящееИсходящее = Неопределено;
	ОтборПропущенные = Ложь;
	ОтборСпам = Ложь;
	КоличествоДопФильтров = 0;
	УстановитьОтборВходящееИсходящее();
	УстановитьОтборПропущенные();
	УстановитьОтборСпам();
	
	СброситьВсеМеткиОтбораНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПочту(Команда)
	
	Если Не ПочтовыеСлужбыПодключены Тогда
		Возврат;
	КонецЕсли;
	
	НачатьПроверкуПочты(ЭлектроннаяПочтаУНФКлиентСервер.РежимЗагрузкиНовыеСообщения());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПредыдущиеПисьма(Команда)
	
	Если Не ПочтовыеСлужбыПодключены Тогда
		Возврат;
	КонецЕсли;
	
	НачатьПроверкуПочты(ЭлектроннаяПочтаУНФКлиентСервер.РежимЗагрузкиПредыдущиеСообщения());
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКВложениям(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДляПередачи = Новый Структура;
	ПараметрыДляПередачи.Вставить("Ссылка", Элементы.Список.ТекущиеДанные.Ссылка);
	
	Если ЭтоМобильныйКлиент Тогда
		НазваниеФормы = "Документ.Событие.Форма.ФормаЕдиногоПросмотраВложенийМК";
	Иначе
		НазваниеФормы = "Документ.Событие.Форма.ФормаЕдиногоПросмотраВложений";
	КонецЕсли;
	ОткрытьФорму(НазваниеФормы, ПараметрыДляПередачи, , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКИстории(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДляПередачи = Новый Структура;
	ПараметрыДляПередачи.Вставить("ДокументСсылка", Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Документ.Событие.Форма.ФормаИсторииПереписки", ПараметрыДляПередачи, , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПредпросмотрНет(Команда)
	ИзменитьОтображениеПредпросмотра("Нет");
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПредпросмотрСнизу(Команда)
	ИзменитьОтображениеПредпросмотра("Снизу");
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПредпросмотрСправа(Команда)
	ИзменитьОтображениеПредпросмотра("Справа");
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПочтовуюПапку(Команда)
	
	ВыбратьПочтовуюПапкуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФильтры(Команда)
	
	ОткрытьФильтрыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьУстановкуФильтров(Команда)
	
	ПрименитьУстановкуФильтровНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПредпросмотрПисьма

&НаСервере
Процедура ПредпросмотрПриСозданииНаСервере()
	
	ЭлектроннаяПочтаУНФ.ПредпросмотрПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСодержаниеПисьмаОбработчик()
	
	ПоказатьСодержаниеПисьма(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСодержаниеПисьма(ПринудительноОбновитьСодержание = Ложь)
	
	НужноЗаполнитьПредпросмотр = НужноЗаполнитьПредпросмотр(ПринудительноОбновитьСодержание);
	Если НужноЗаполнитьПредпросмотр Тогда
		ЗаполнитьПредпросмотрНаОсновеПисьма();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НужноЗаполнитьПредпросмотр(ПринудительноОбновитьСодержание = Ложь)
	
	Если Не НужноЗаполнитьПредпросмотрНаОснованииРеквизитов(ПринудительноОбновитьСодержание) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат НужноЗаполнитьПредпросмотрНаОснованииПисьма();
	
КонецФункции

&НаКлиенте
Функция НужноЗаполнитьПредпросмотрНаОснованииПисьма()
	
	ЭтотОбъект.Предпросмотр_СсылкаНаСобытие = Элементы.Список.ТекущаяСтрока;
	Элементы.НебезопасноеСодержимое.Видимость = Ложь;
	
	Если Элементы.Список.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Элементы.Список.ТекущиеДанные.ЗагрузитьПриОткрытии Тогда
		
		ЭлектроннаяПочтаУНФКлиент.ДобавитьКомандуЗагрузкиПисьма(ТекстПисьма);
		Элементы.СодержаниеПисьма.ТекущаяСтраница = Элементы.ТекстHTML;
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция НужноЗаполнитьПредпросмотрНаОснованииРеквизитов(ПринудительноОбновитьСодержание = Ложь)
	
	Возврат Элементы.Список.ТекущаяСтрока <> Неопределено
	И Элементы.Список.ТекущиеДанные <> Неопределено
	И Не ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
	И Элементы.СодержаниеПисьма.Видимость
	И (Элементы.Список.ТекущаяСтрока <> ЭтотОбъект.Предпросмотр_СсылкаНаСобытие Или ПринудительноОбновитьСодержание);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьНеобходимостьПоказатьПредпросмотрЕслиНужно(Значение)
	
	ЭтотОбъект.Предпросмотр_НужноЗаполнитьПредпросмотрПриАктивизацииСтрокиТаблицы = Значение;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредпросмотрНаОсновеПисьма()
	
	//@skip-check module-self-reference
	РезультатЗаполнения = ЭлектроннаяПочтаУНФ.ЗаполнитьПредпросмотр(
	ЭтотОбъект.Предпросмотр_СсылкаНаСобытие,
	УникальныйИдентификатор,
	ТекстПисьма);
	
	ЭтотОбъект.Предпросмотр_ИсточникПривлечения = РезультатЗаполнения.ИсточникПривлечения;
	
	Элементы.НебезопасноеСодержимое.Видимость = РезультатЗаполнения.НежелательныеHTTPОчищены;
	Элементы.СодержаниеПисьма.ТекущаяСтраница = Элементы.ТекстHTML;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСообщениеСПочтовогоСервера()
	
	Элементы.СодержаниеПисьма.ТекущаяСтраница = Элементы.Загрузка;
	
	УстановитьОтображениеЭлементовПриЗагрузкеПисьма(Ложь);
	
	//@skip-check module-self-reference
	Задание = ЗаданиеЗагрузитьСообщениеСПочтовогоСервера(
	ЭтотОбъект.Предпросмотр_СсылкаНаСобытие,
	УникальныйИдентификатор,
	ЭтотОбъект.Предпросмотр_ИдентификаторЗаданияЗагрузки);
	
	ЭтотОбъект.Предпросмотр_ИдентификаторЗаданияЗагрузки = Задание.ИдентификаторЗадания;
	
	ДополнительныеПараметры = Новый Структура;
	//@skip-check module-self-reference
	ДополнительныеПараметры.Вставить("ЗагружаемоеСобытие", ЭтотОбъект.Предпросмотр_СсылкаНаСобытие);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработчикЗагрузкиСообщения", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Задание, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеЗагрузитьСообщениеСПочтовогоСервера(
	Знач СсылкаНаСобытие,
	Знач УникальныйИдентификатор,
	Знач ИдентификаторПредыдущегоЗадания)
	
	Возврат ЭлектроннаяПочтаУНФ.ЗагрузитьСообщениеСПочтовогоСервера(
		СсылкаНаСобытие, УникальныйИдентификатор, , , ИдентификаторПредыдущегоЗадания);
	
КонецФункции

&НаКлиенте
Процедура ОбработчикЗагрузкиСообщения(Результат, Параметры) Экспорт
	
	УстановитьОтображениеЭлементовПриЗагрузкеПисьма(Истина);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Статус = Неопределено;
	Если Не Результат.Свойство("Статус", Статус) Тогда
		Возврат;
	КонецЕсли;
	
	ЗагружаемоеСобытие = Неопределено;
	//@skip-check unknown-form-parameter-access
	Параметры.Свойство("ЗагружаемоеСобытие", ЗагружаемоеСобытие);
	Если ЗагружаемоеСобытие = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменятьТекстПисьма = (ЗагружаемоеСобытие = ЭтотОбъект.Предпросмотр_СсылкаНаСобытие);
	
	Если Статус = "Ошибка" Тогда
		
		Если ИзменятьТекстПисьма Тогда
			
			Элементы.СодержаниеПисьма.ТекущаяСтраница = Элементы.ПроизошлаОшибкаПриЗагрузкеПисьма;
			
			
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	Если Статус = "Выполнено" Тогда
		
		ОбработатьЗагруженноеСПочтовогоСервераСообщение(
			ЗагружаемоеСобытие, Результат.АдресРезультата, ИзменятьТекстПисьма);
		
		ОповеститьОбИзменении(ЗагружаемоеСобытие);
		
		Если ИзменятьТекстПисьма Тогда
			
			ДокументHTML = Элементы.ТекстПисьма.Документ;
			Если ДокументHTML <> Неопределено Тогда
				ДокументHTML.documentElement.innerHTML = ТекстПисьма;
				ГипертекстКлиент.ПрименитьНастройкиОтображения(ДокументHTML);
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗагруженноеСПочтовогоСервераСообщение(
	Знач ЗагружаемоеСобытие,
	Знач АдресРезультата,
	Знач ИзменятьТекстПисьма)
	
	ЭлектроннаяПочтаУНФ.ОбработатьЗагруженноеЧерезПредпросмотрСообщение(
	АдресРезультата,
	ЗагружаемоеСобытие,
	УникальныйИдентификатор,
	ТекстПисьма,
	ИзменятьТекстПисьма);
	
	Если ИзменятьТекстПисьма Тогда
		ЗаполнитьПредпросмотрНаОсновеПисьма();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображениеЭлементовПриЗагрузкеПисьма(ПисьмоЗагружено)
	
	Элементы.Ответить.Доступность = ПисьмоЗагружено;
	Элементы.ОтветитьВсем.Доступность = ПисьмоЗагружено;
	Элементы.Переслать.Доступность = ПисьмоЗагружено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНажатияДляЗагрузкиСообщения(Элемент)
	
	Если Элемент.nodeName = "#document" Или Элемент.nodeName = Неопределено
		Или Не Элемент.classList.contains("preview-download") Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ЗагрузитьСообщениеСПочтовогоСервера", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область АктивизацияСтрокиСписка

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчик()
	
	Если Элементы.Список.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка = Элементы.Список.ТекущиеДанные.Ссылка;
	
	Если ЭтотОбъект.Предпросмотр_НужноЗаполнитьПредпросмотрПриАктивизацииСтрокиТаблицы Тогда
		НужноЗаполнитьПредпросмотрНаОснованииПисьма = НужноЗаполнитьПредпросмотрНаОснованииПисьма();
	Иначе
		НужноЗаполнитьПредпросмотрНаОснованииПисьма = Ложь;
	КонецЕсли;
	
	//@skip-check module-self-reference
	СписокПриАктивизацииСтрокиОбработчикНаСервере(
	Ссылка,
	НужноЗаполнитьПредпросмотрНаОснованииПисьма,
	ЭтотОбъект.КИ_НужноИзменитьДанныеПриАктивизацииСтрокиТаблицы,
	Элементы.Список.ТекущиеДанные.ЭтоСпам);
	
КонецПроцедуры

&НаСервере
Процедура СписокПриАктивизацииСтрокиОбработчикНаСервере(
	Знач Ссылка, Знач НужноЗаполнитьПредпросмотрНаОснованииПисьма, Знач НужноИзменитьКИ, ЭтоСпам)
	
	Если НужноЗаполнитьПредпросмотрНаОснованииПисьма Тогда
		ЗаполнитьПредпросмотрНаОсновеПисьма();
	КонецЕсли;
	
	Если НужноИзменитьКИ Тогда
		ОбновитьПанельКонтактнойИнформацииСервер();
	КонецЕсли;
	
	ОбновитьИнтерфейсКомандПоЗаявкам(Ссылка);
	
	Элементы.БаннерСпам.Видимость = ЭтоСпам И Не ЭтоМобильныйКлиент;
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеСостояний

&НаСервере
Процедура ЗаполнитьКомандыИзмененияСостояния()
	
	СостоянияДокументов.ЗаполнитьКомандыИзмененияСостояний(
	ЭтотОбъект, Элементы.СписокКонтекстноеМенюУстановитьСостояние, Истина, Элементы.Список);
	СостоянияДокументов.ЗаполнитьКомандыИзмененияСостояний(
	ЭтотОбъект, Элементы.СписокКонтекстноеМенюУстановитьСостояние1, Истина, Элементы.Список);
	
КонецПроцедуры

#КонецОбласти 

#Область УправлениеФормой

&НаСервере
Процедура УправлениеФормойСервер(ОткрытиеФормы = Ложь)
	
	РежимОткрытияСписка = "ОбщийСписок";
	ЭтоСписокПисем = Ложь;
	
	Если ЗначениеЗаполнено(Параметры.ТипСобытия) Тогда
		РежимОткрытияСписка = "СписокСОтборомПоТипу";
		Если Параметры.ТипСобытия = Перечисления.ТипыСобытий.ЭлектронноеПисьмо Тогда
			ЭтоСписокПисем = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ЭтоСписокПисем", ЭтоСписокПисем);
	
	Если РежимОткрытияСписка = "ОбщийСписок" ИЛИ РежимОткрытияСписка = "СписокСОтборомПоТипу" Тогда
		Элементы.ГруппаПочтовыеПапки.Видимость = Ложь;
		Элементы.ГруппаКоманднаяПанель.Видимость = Истина;
		Элементы.ГруппаКоманднаяПанельФормы.Видимость = Истина;
		Элементы.ГруппаКоманднаяПанельЭлектронноеПисьмо.Видимость = Ложь;
		Элементы.ГруппаКоманднаяПанельФормыЭлектронноеПисьмо.Видимость = Ложь;
		ОпределитьОтображениеДополнительныхОтборов(Истина);
		Элементы.ФормаУчетныеЗаписи.Видимость = Ложь;
		Элементы.Список.ПутьКДаннымКартинкиСтроки = "Список.ИндексПиктограммы";
		Элементы.Непрочитанное.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюГруппаЭлектронноеПисьмо.Видимость = Ложь;
		Элементы.ЕстьФайлыСписокПисем.Видимость = Ложь;
	КонецЕсли;
	
	Если РежимОткрытияСписка = "СписокСОтборомПоТипу" Тогда
		Элементы.ГруппаПочтовыеПапки.Видимость = ЭтоСписокПисем;
		Элементы.ФормаУчетныеЗаписи.Видимость = ЭтоСписокПисем;
		Элементы.ГруппаКоманднаяПанель.Видимость = НЕ ЭтоСписокПисем;
		Элементы.ГруппаКоманднаяПанельФормы.Видимость = НЕ ЭтоСписокПисем;
		Элементы.ГруппаКоманднаяПанельЭлектронноеПисьмо.Видимость = ЭтоСписокПисем;
		Элементы.ГруппаКоманднаяПанельФормыЭлектронноеПисьмо.Видимость = ЭтоСписокПисем;
		Элементы.СписокКонтекстноеМенюГруппаЭлектронноеПисьмо.Видимость = ЭтоСписокПисем;
		ОпределитьОтображениеДополнительныхОтборов(Параметры.ТипСобытия <> Перечисления.ТипыСобытий.СообщениеSMS
		И Параметры.ТипСобытия <> Перечисления.ТипыСобытий.ЭлектронноеПисьмо);
		АвтоЗаголовок = Ложь;
		Элементы.ОтборТипСобытия.Видимость = Ложь;
		Элементы.СписокГруппаСоздатьОбертка.Видимость = Ложь;
		Элементы.ФормаГруппаСоздать.Видимость = Истина;
		УстановитьОтображениеГруппыПочтоваяСлужбаНаСервере(ЭтоСписокПисем);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "ТипСобытия", Параметры.ТипСобытия);
		Элементы.СписокОкончаниеСобытия.Видимость = НЕ ЭтоСписокПисем;
		
		Элементы.Непрочитанное.Видимость = ЭтоСписокПисем;
		
		Элементы.Проекты.Видимость = Не (Параметры.ТипСобытия = Перечисления.ТипыСобытий.СообщениеSMS
			ИЛИ Параметры.ТипСобытия = Перечисления.ТипыСобытий.ЭлектронноеПисьмо);
		
		Если Параметры.ТипСобытия = Перечисления.ТипыСобытий.ТелефонныйЗвонок Тогда
			Заголовок = НСтр("ru='События: телефонные звонки'");
		ИначеЕсли Параметры.ТипСобытия = Перечисления.ТипыСобытий.ЭлектронноеПисьмо Тогда
			Заголовок = НСтр("ru='Почта'");
		ИначеЕсли Параметры.ТипСобытия = Перечисления.ТипыСобытий.СообщениеSMS Тогда
			Заголовок = НСтр("ru='События: сообщения SMS'");
		ИначеЕсли Параметры.ТипСобытия = Перечисления.ТипыСобытий.ЛичнаяВстреча Тогда
			Заголовок = НСтр("ru='События: личные встречи'");
		ИначеЕсли Параметры.ТипСобытия = Перечисления.ТипыСобытий.Прочее Тогда
			Заголовок = НСтр("ru='События: прочие'");
		ИначеЕсли Параметры.ТипСобытия = Перечисления.ТипыСобытий.Запись Тогда
			Заголовок = НСтр("ru='События: запись'");
			Элементы.СписокТема.Видимость = Ложь;
			Элементы.ОтборВходящееИсходящее.Видимость = Ложь;
			Элементы.ОтборПроект.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.Список.ПутьКДаннымКартинкиСтроки = "Список.ИндексПиктограммы";
		
		Если ЭтоСписокПисем Тогда
			
			Элементы.Переместить(Элементы.ГруппаВажныеКоманды, Элементы.ГруппаВажныеКомандыПисем);
			Элементы.Переместить(Элементы.СписокКонтекстноеМенюГруппаСтандартные, Элементы.ГруппаУстановкиСостоянияПисем);
			
			Если Не ЭтоИнтерфейсТакси Тогда
				// Нужно, чтобы в списке писем в видимой области в КП строки отображались другие команды
				Элементы.Переместить(
				Элементы.ГруппаКоманднаяПанельЭлектронноеПисьмо, Элементы.КоманднаяПанельСписка, Элементы.ГруппаКоманднаяПанель);
			КонецЕсли;
			
		КонецЕсли;
		
		Элементы.ПроверитьПочту.Видимость = Ложь;
		Элементы.ГруппаБаннерыОшибкиЗагрузки.Видимость = ЭтоСписокПисем;
		
	КонецЕсли;
	
	Если ЭтоСписокПисем Тогда
		
		Элементы.ЕстьФайлы.Видимость = Ложь;
		Элементы.ПодключитьУчетнуюЗапись.Видимость = ПравоДоступа("Добавление", 
			Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты);
		Элементы.Список.ПутьКДаннымКартинкиСтроки = "Список.КартинкаПисем";
		Элементы.СписокНачалоСобытия.Заголовок = НСтр("ru = 'Дата'");
		УстановитьНастройкиСпискаПисем();
		
	Иначе
		
		ОбновитьПоложениеПредпросмотра();
		
	КонецЕсли;
	
	НастроитьГруппуПочтоваяСлужба(ОткрытиеФормы);
	Элементы.ПроверитьПочту.Видимость = ПочтовыеСлужбыПодключены;
	ОбновитьОтображениеКомандСоздания(РежимОткрытияСписка, ЭтоСписокПисем);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнтерфейсКомандПоЗаявкам(Событие)
	
	ЗаголовокКомандыСозданияЗаказаПокупателя = НСтр("ru = 'Заказ покупателя'");
	ЗаголовокКомандыСозданияЗаказНаряда = НСтр("ru = 'Заказ-наряд'");
	
	ПервыйКонтактПисьма = Документы.Событие.ПервыйКонтакт(Событие);
	ПервыйКонтактЭтоЛид = (ТипЗнч(ПервыйКонтактПисьма) = Тип("СправочникСсылка.Лиды"));
	
	Если ПервыйКонтактЭтоЛид Тогда
		
		ИспользованиеЗаявок = РаботаСЗаявками.ИспользованиеЗаявокПоВидуОперации();
		
		Если ИспользованиеЗаявок[Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу] Тогда
			ЗаголовокКомандыСозданияЗаказаПокупателя = НСтр("ru = 'Заказ покупателя (заявка)'");
		КонецЕсли;
		Если ИспользованиеЗаявок[Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд] Тогда
			ЗаголовокКомандыСозданияЗаказНаряда = НСтр("ru = 'Заказ-наряд (заявка)'");
		КонецЕсли;
		
	КонецЕсли;
	
	КомандаСоздания = Элементы.Найти("ФормаДокументЗаказПокупателяСоздатьНаОсновании");
	Если КомандаСоздания <> Неопределено Тогда
		КомандаСоздания.Заголовок = ЗаголовокКомандыСозданияЗаказаПокупателя;
	КонецЕсли;
	КомандаСоздания = Элементы.Найти("ФормаДокументЗаказПокупателяСоздатьНаОсновании1");
	Если КомандаСоздания <> Неопределено Тогда
		КомандаСоздания.Заголовок = ЗаголовокКомандыСозданияЗаказаПокупателя;
	КонецЕсли;
	КомандаСоздания = Элементы.Найти("ФормаДокументСобытиеКомандаЗаказНарядСоздатьНаОсновании");
	Если КомандаСоздания <> Неопределено Тогда
		КомандаСоздания.Заголовок = ЗаголовокКомандыСозданияЗаказНаряда;
	КонецЕсли;
	КомандаСоздания = Элементы.Найти("ФормаДокументСобытиеКомандаЗаказНарядСоздатьНаОсновании1");
	Если КомандаСоздания <> Неопределено Тогда
		КомандаСоздания.Заголовок = ЗаголовокКомандыСозданияЗаказНаряда;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.Контрагенты.Видимость = НЕ ЗначениеЗаполнено(КонтекстКонтакт);
	
	Элементы.ОтборПропущенные.Видимость = ОтборТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ТелефонныйЗвонок")
		И ОтборВходящееИсходящее = ПредопределенноеЗначение("Перечисление.ВходящееИсходящееСобытие.Входящее");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеКомандСоздания(РежимОткрытияСписка, ЭтоСписокПисем)
	
	ПоказыватьПодменюКомандСоздания = (РежимОткрытияСписка = "ОбщийСписок");
	ПоказыватьСтандартнуюКомандуСоздания = (РежимОткрытияСписка = "СписокСОтборомПоТипу" И Не ЭтоСписокПисем);
	ПоказыватьКомандуСозданияПисьма = ЭтоСписокПисем;
	
	Элементы.СписокСоздатьЛичнаяВстреча.Видимость = ПоказыватьПодменюКомандСоздания;
	Элементы.СписокСоздатьЭлектронноеПисьмо.Видимость = ПоказыватьПодменюКомандСоздания;
	Элементы.СписокСоздатьСообщениеSMS.Видимость = ПоказыватьПодменюКомандСоздания;
	Элементы.ФормаСоздатьЗапись.Видимость = ПоказыватьПодменюКомандСоздания И ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи;
	Элементы.СписокСоздатьПрочее.Видимость = ПоказыватьПодменюКомандСоздания;
	Элементы.СписокСоздатьТелефонныйЗвонок.Видимость = ПоказыватьПодменюКомандСоздания;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "ФормаСоздать", "Видимость", ПоказыватьСтандартнуюКомандуСоздания);
	Элементы.СоздатьЭлектронноеПисьмо.Видимость = ПоказыватьКомандуСозданияПисьма;
	Элементы.СоздатьЭлектронноеПисьмоТакси.Видимость = ПоказыватьКомандуСозданияПисьма;
	
КонецПроцедуры

#КонецОбласти

#Область ПанельКонтактнойИнформации

&НаСервере
Процедура ОбновитьПанельКонтактнойИнформацииСервер()
	
	Если НЕ ЗначениеЗаполнено(ТекущееСобытие) Тогда
		КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Документ.Событие.Участники КАК СобытиеУчастники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиАдресатКонтактCRM КАК СвязиАдресатКонтактCRM
	|		ПО (СвязиАдресатКонтактCRM.Адресат = СобытиеУчастники.Контакт)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (СобытиеУчастники.Контакт = Контрагенты.Ссылка
	|				ИЛИ СвязиАдресатКонтактCRM.КонтактCRM = Контрагенты.Ссылка)
	|ГДЕ
	|	СобытиеУчастники.Ссылка = &Событие";
	
	Запрос.УстановитьПараметр("Событие", ТекущееСобытие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекущийВладелецКИ = Выборка.Контрагент;
	Иначе
		ТекущийВладелецКИ = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, ТекущийВладелецКИ);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(Элемент)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыполнитьКоманду(Команда)
	
	КонтактнаяИнформацияПанельУНФКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ТекущийВладелецКИ);
	
КонецПроцедуры
// Конец УНФ.ПанельКонтактнойИнформации

#КонецОбласти

#Область Отборы

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ПредставлениеЗначения = "" Тогда
		ПредставлениеЗначения = Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, ИмяПоляОтбораСписка);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект,,, ОтборТипСобытия);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры)
	
	Возврат РаботаСОтборами.ПараметрыДляОткрытияФормыСНастройкамиОтборов(ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Процедура НастройкаОтборовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтборовЗавершениеНаСервере(Результат.АдресВыбранныеОтборы, Результат.АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаОтборовЗавершениеНаСервере(АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры)
	
	РаботаСОтборами.НастройкаОтборовЗавершение(ЭтотОбъект, АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборПриИзменении(Элемент)
	
	Подключаемый_ОтборПриИзмененииНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборПриИзмененииНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборПриИзменении(ЭтотОбъект, ЭлементИмя, ЭлементРодительИмя);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборОчистка(Элемент)
	
	Подключаемый_ОтборОчисткаНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборОчисткаНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборОчистка(ЭтотОбъект, ЭлементИмя);

КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере()
	
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, Список);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектроннаяПочтаУНФ

&НаКлиенте
Процедура УстановитьОтборВходящееИсходящее()
	
	Если ЗначениеЗаполнено(ОтборВходящееИсходящее) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВходящееИсходящее",
			ОтборВходящееИсходящее);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ВходящееИсходящее");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПропущенные()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, "Неотвеченный", ОтборПропущенные, , , ОтборПропущенные);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСпам()
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборСпам", ОтборСпам);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьГруппуПочтоваяСлужба(ОткрытиеФормы = Ложь)
	
	ПочтовыеСлужбыПодключены = РегистрыСведений.УчетныеЗаписиПользователя.ПочтовыеСлужбыПодключены();
	
	Если ПочтовыеСлужбыПодключены Тогда
		УстановитьОтображениеГруппыПочтоваяСлужбаНаСервере(Истина, Элементы.СтраницаЗагрузитьПочту);
		Элементы.ГруппаБаннерыОшибкиЗагрузки.ТекущаяСтраница = Элементы.БаннерУчетныеЗаписиОтключены;
		Элементы.БаннерУчетныеЗаписиОтключены.Видимость = ВидимостьГруппыУчетныеЗаписиОтключены(ОткрытиеФормы);
		Если ЗначениеЗаполнено(КонтекстКонтакт) Тогда
			Команды.ПроверитьПочту.Заголовок = НСтр("ru = 'Загрузить переписку'");
			Команды.ПроверитьПочту.Подсказка = СтрШаблон(НСтр("ru = 'Загрузить переписку с ""%1""'"), КонтекстКонтакт);
		КонецЕсли;
	ИначеЕсли Не РегистрыСведений.УчетныеЗаписиПользователя.ПочтовыеСлужбыДоступны() Тогда
		УстановитьОтображениеГруппыПочтоваяСлужбаНаСервере(
		Элементы.ПодключитьУчетнуюЗапись.Видимость, Элементы.СтраницаПодключитьПочтовуюСлужбу);
		Элементы.ГруппаБаннерыОшибкиЗагрузки.ТекущаяСтраница.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиСпискаПисем()
	
	НастройкиСпискаПапок = ХранилищеСистемныхНастроек.Загрузить("НастройкиСпискаПапок", 
	"ГруппаОтбораСписокПисем_НастройкиСпискаПапок");
	
	Если ТипЗнч(НастройкиСпискаПапок) <> Тип("Структура") Тогда
		НастройкиСпискаПапок = Новый Структура;
	КонецЕсли;
	
	ВидСписка = Неопределено;
	НастройкиСпискаПапок.Свойство("ВидСписка", ВидСписка);
	Если ВидСписка = Неопределено Тогда
		ВидСписка = "Компактный";
	КонецЕсли;
	
	ВидПапок = Неопределено;
	НастройкиСпискаПапок.Свойство("ВидПапок", ВидПапок);
	Если ВидПапок = Неопределено Тогда
		ВидПапок = "Использовать";
	КонецЕсли;
	
	ОтображатьКолонкуВложения = Неопределено;
	НастройкиСпискаПапок.Свойство("ОтображатьКолонкуВложения", ОтображатьКолонкуВложения);
	Если ОтображатьКолонкуВложения = Неопределено Тогда
		ОтображатьКолонкуВложения = Истина;
	КонецЕсли;
	
	Если ВидСписка = "Расширенный" И Не ЭтоМобильныйКлиент Тогда
		Элементы.ГруппаПериод.Группировка = ГруппировкаКолонок.Вертикальная;
		Элементы.Переместить(Элементы.СписокСписокУчастников, Элементы.ГруппаНижняяСтрокаКолонок);
		Элементы.Переместить(Элементы.СписокНачалоСобытия, Элементы.ГруппаВерхняяСтрокаКолонок, Элементы.СписокТема);
		Элементы.Список.ЧередованиеЦветовСтрок = Истина;
	Иначе
		Элементы.ГруппаПериод.Группировка = ГруппировкаКолонок.Горизонтальная;
		Элементы.Переместить(Элементы.СписокСписокУчастников, Элементы.ГруппаВерхняяСтрокаКолонок, Элементы.СписокТема);
		Элементы.Переместить(Элементы.СписокНачалоСобытия, Элементы.ГруппаПериод, Элементы.СписокОкончаниеСобытия);
		Элементы.Список.ЧередованиеЦветовСтрок = Ложь;
	КонецЕсли;
	
	Если ВидПапок = "НеИспользовать" Тогда
		Элементы.ГруппаПочтовыеПапки.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПочтовыеПапки.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ЕстьФайлыСписокПисем.Видимость = ОтображатьКолонкуВложения;
	
	ОбновитьПоложениеПредпросмотра(НастройкиСпискаПапок);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоложениеПредпросмотра(Знач НастройкиСпискаПапок = Неопределено)
	
	Если НастройкиСпискаПапок = Неопределено Тогда
		НастройкиСпискаПапок = ХранилищеСистемныхНастроек.Загрузить(
		"НастройкиСпискаПапок", "ГруппаОтбораСписокПисем_НастройкиСпискаПапок");
	КонецЕсли;
	
	Если ТипЗнч(НастройкиСпискаПапок) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ВидПредпросмотраПисьма = Неопределено;
	НастройкиСпискаПапок.Свойство("ВидПредпросмотраПисьма", ВидПредпросмотраПисьма);
	Если ВидПредпросмотраПисьма = Неопределено Тогда
		ВидПредпросмотраПисьма = "Снизу";
	КонецЕсли;
	
	Если ВидПредпросмотраПисьма = "Справа" Тогда
		
		Элементы.СодержаниеПисьма.Видимость = Истина;
		Элементы.Переместить(Элементы.СодержаниеПисьма, Элементы.СодержаниеПисьмаСправа);
		
		Элементы.НастройкаОтображенияПредпросмотра.Картинка = БиблиотекаКартинок.ПредпросмотрСобытияСправаИконка;
		Элементы.НастройкаОтображенияПредпросмотра1.Картинка = БиблиотекаКартинок.ПредпросмотрСобытияСправаИконка;
		
	ИначеЕсли ВидПредпросмотраПисьма = "Нет" Тогда
		
		Элементы.СодержаниеПисьма.Видимость = Ложь;
		Элементы.НастройкаОтображенияПредпросмотра.Картинка = БиблиотекаКартинок.КомпактныйСписокПисемИконка;
		Элементы.НастройкаОтображенияПредпросмотра1.Картинка = БиблиотекаКартинок.КомпактныйСписокПисемИконка;
		
	Иначе
		
		Элементы.СодержаниеПисьма.Видимость = Истина;
		Элементы.Переместить(Элементы.СодержаниеПисьма, Элементы.СодержаниеПисьмаСнизу);
		Элементы.НастройкаОтображенияПредпросмотра.Картинка = БиблиотекаКартинок.ПредпросмотрСобытияСнизуИконка;
		Элементы.НастройкаОтображенияПредпросмотра1.Картинка = БиблиотекаКартинок.ПредпросмотрСобытияСнизуИконка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВидимостьГруппыУчетныеЗаписиОтключены(ОткрытиеФормы = Ложь)
	
	Если ОткрытиеФормы Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ТекНастройка Из РегистрыСведений.УчетныеЗаписиПользователя.НастройкаПользователя(Пользователи.ТекущийПользователь()) Цикл
		
		КоличествоОшибокПодключения = РегистрыСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ.КоличествоОшибокПодключения(ТекНастройка.УчетнаяЗапись);
		Если КоличествоОшибокПодключения = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекНастройка.ЗагружатьПочту Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура НачатьПроверкуПочты(Режим)
	
	Элементы.Список.Обновить();
	
	ОтветОтСервера = НачатьПроверкуПочтыНаСервере(ИдентификаторЗаданияЗагрузкиПочты);
	Если ОтветОтСервера.РучноеЗаданиеВыполняется Тогда
		Возврат;
	КонецЕсли;
	
	РежимЗагрузки = Режим;
	УстановитьОтображениеГруппыПочтоваяСлужба(, Элементы.СтраницаВыполняетсяСинхронизация);
	Элементы.ГруппаБаннерыОшибкиЗагрузки.ТекущаяСтраница.Видимость = Ложь;
	Состояние(ЗаголовокПрогресса(Режим, КонтекстКонтакт),,, БиблиотекаКартинок.ПолучитьОтправитьПочту);
	
	Если ОтветОтСервера.РегзаданиеВыполняется Тогда
		ПодключитьОбработчикОжидания("ОжидатьЗавершениеЗагрузкиПочтыПоРегзаданию", 1, Истина);
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ЗагрузитьЗаголовкиСообщений", 0.1, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьПроверкуПочтыНаСервере(ИдентификаторЗаданияЗагрузкиПочты)
	
	Результат = Новый Структура;
	
	РегЗаданиеВыполняется = РегзаданиеЗагрузитьПочтуВыполняется();
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗаданияЗагрузкиПочты) Тогда
		РучноеЗаданиеВыполняется = Ложь;
	Иначе
		
		Попытка
			РучноеЗаданиеВыполняется = Не ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗаданияЗагрузкиПочты);
		Исключение
			
			РучноеЗаданиеВыполняется = Ложь;
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
			ЭлектроннаяПочтаУНФ.ИмяСобытияЖР(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.Событие, ,
			ТекстОшибки);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Результат.Вставить("РегзаданиеВыполняется", РегЗаданиеВыполняется);
	Результат.Вставить("РучноеЗаданиеВыполняется", РучноеЗаданиеВыполняется);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОжидатьЗавершениеЗагрузкиПочтыПоРегзаданию()
	
	Если РегзаданиеЗагрузитьПочтуВыполняется() Тогда
		ПодключитьОбработчикОжидания("ОжидатьЗавершениеЗагрузкиПочтыПоРегзаданию", 1, Истина);
		Возврат;
	КонецЕсли;
	
	ОбработатьЗавершениеЗагрузкиПочтыПоРегзаданию();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗавершениеЗагрузкиПочтыПоРегзаданию()
	
	НастроитьГруппуПочтоваяСлужба();
	Элементы.Список.Обновить();
	
	УстановитьЗаголовокРезультатаЗагрузки(НСтр("ru = 'Загрузка писем завершена'"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РегзаданиеЗагрузитьПочтуВыполняется()
	
	Возврат ЭлектроннаяПочтаУНФ.РегламентноеЗаданиеЗагрузитьПочтуВыполняется();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокПрогресса(Режим, Контакт)
	
	Если ЗначениеЗаполнено(Контакт) Тогда
		Возврат НСтр("ru = 'Загрузка переписки'");
	КонецЕсли;
	
	Если Режим = ЭлектроннаяПочтаУНФКлиентСервер.РежимЗагрузкиНовыеСообщения() Тогда
		Возврат НСтр("ru = 'Проверка почты'");
	КонецЕсли;
	
	Если Режим = ЭлектроннаяПочтаУНФКлиентСервер.РежимЗагрузкиНовыеСообщения() Тогда
		Возврат НСтр("ru = 'Загрузка предыдущих сообщений'");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьЗаголовкиСообщений()
	
	Задание = ЗаданиеЗагрузитьЗаголовкиСообщенийНаСервере();
	ИдентификаторЗаданияЗагрузкиПочты = Задание.ИдентификаторЗадания;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьЗавершениеЗадания", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОтобразитьПрогресс", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Задание, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПрогресс(СостояниеЗадания, Параметры) Экспорт
	
	Если ПустаяСтрока(Прогресс) Тогда
		Прогресс = ЗаголовокПрогресса(РежимЗагрузки, КонтекстКонтакт);
	КонецЕсли;
	
	Если ТипЗнч(СостояниеЗадания) = Тип("Структура") 
		И ТипЗнч(СостояниеЗадания.Прогресс) = Тип("Структура") Тогда
		ПрогрессТекст = "";
		СостояниеЗадания.Прогресс.Свойство("Текст", ПрогрессТекст);
		Если ЗначениеЗаполнено(ПрогрессТекст) Тогда
			Прогресс = ПрогрессТекст;
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.ДекорацияПрогресс.Заголовок = Прогресс Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДекорацияПрогресс.Заголовок = Прогресс;
	Состояние(Прогресс,,, БиблиотекаКартинок.ПолучитьОтправитьПочту);
	
КонецПроцедуры

&НаСервере
Функция ЗаданиеЗагрузитьЗаголовкиСообщенийНаСервере()
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("РежимЗагрузки", РежимЗагрузки);
	ПараметрыПроцедуры.Вставить("ОтборПоКонтакту", КонтекстКонтакт);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
	"ЭлектроннаяПочтаУНФ.ЗагрузитьПочтуПоКомандеПользователя",
	ПараметрыПроцедуры,
	ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьЗавершениеЗадания(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Свойство("Статус") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		Состояние(НСтр("ru = 'ПроизошлаОшибка'"),,, БиблиотекаКартинок.ОшибкаБаннерЦветной);
		Элементы.ГруппаБаннерыОшибкиЗагрузки.ТекущаяСтраница = Элементы.БаннерОшибкаЗагрузки;
		Элементы.БаннерОшибкаЗагрузки.Видимость = Истина;
		Состояние(НСтр("ru = 'При загрузке почты происходили ошибки'"),,, БиблиотекаКартинок.ОшибкаБаннерЦветной);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьРезультатВыполненияЗаданияНаСервере(Результат.АдресРезультата);
		
		Если Элементы.ГруппаБаннерыОшибкиЗагрузки.ТекущаяСтраница = Элементы.БаннерОшибкаЗагрузки Тогда
			Состояние(Элементы.РезультатЗагрузки.Заголовок,
			,
			НСтр("ru = 'При загрузке почты происходили ошибки'"), 
			БиблиотекаКартинок.ОшибкаБаннерЦветной);
		Иначе
			Состояние(Элементы.РезультатЗагрузки.Заголовок,,, БиблиотекаКартинок.УспешноБаннерЦветной);
		КонецЕсли;

		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыполненияЗаданияНаСервере(АдресРезультата)
	
	НастроитьГруппуПочтоваяСлужба();
	
	Элементы.Список.Обновить();
	РезультатыЗагрузкиЗаголовков = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(РезультатыЗагрузкиЗаголовков) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	ЗагруженоПисем = 0;
	БылиОшибки = Ложь;
	СсылкаНаПоследнееЗагруженноеСобытие = Документы.Событие.ПустаяСсылка();
	
	Для Каждого ТекРезультат Из РезультатыЗагрузкиЗаголовков Цикл
		Если ЗначениеЗаполнено(ТекРезультат.ТекстОшибки) И НЕ БылиОшибки Тогда
			БылиОшибки = Истина;
			Элементы.ГруппаБаннерыОшибкиЗагрузки.ТекущаяСтраница = Элементы.БаннерОшибкаЗагрузки;
			Элементы.БаннерОшибкаЗагрузки.Видимость = Истина;
		КонецЕсли;
		ЗагруженоПисем = ЗагруженоПисем + ТекРезультат.ЗагруженоПисем;
		СсылкаНаПоследнееЗагруженноеСобытие = ТекРезультат.СсылкаНаСобытие;
	КонецЦикла;
	
	ШаблонСообщения = НСтр("ru = ';%1 письмо;;%1 письма;%1 писем;%1 письма'");
	ЗагруженоПрописью = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
	ШаблонСообщения, ЗагруженоПисем, ВидЧисловогоЗначения.Количественное, "ЧН=0");
	
	УстановитьЗаголовокРезультатаЗагрузки(
	СтрШаблон(НСтр("ru = 'Загружено %1'"), ЗагруженоПрописью));
	
	Если ЗначениеЗаполнено(СсылкаНаПоследнееЗагруженноеСобытие) Тогда
		Элементы.Список.ТекущаяСтрока = СсылкаНаПоследнееЗагруженноеСобытие;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокРезультатаЗагрузки(Заголовок)
	
	Элементы.РезультатЗагрузки.Заголовок = Заголовок;
	Элементы.РезультатЗагрузки.Видимость = Не ПустаяСтрока(Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаписьУчетнойЗаписи(Результат, Параметры) Экспорт
	
	НачатьПроверкуПочты(ЭлектроннаяПочтаУНФКлиентСервер.РежимЗагрузкиНовыеСообщения());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗапросаТокена(Результат, Параметры) Экспорт
	
	Если ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьУчетнуюЗаписьGoogleНаСервере(Результат);
	
	НачатьПроверкуПочты(ЭлектроннаяПочтаУНФКлиентСервер.РежимЗагрузкиНовыеСообщения());
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУчетнуюЗаписьGoogleНаСервере(СеансовыеДанные)
	
	УчетнаяЗаписьGoogle = ОбменСGoogle.СоздатьУчетнуюЗаписьGoogle(СеансовыеДанные);
	
	РегистрыСведений.СеансовыеДанныеGoogle.ЗаписатьСеансовыеДанные(
	СеансовыеДанные,
	Пользователи.ТекущийПользователь(),
	Перечисления.ОбластиДоступаGoogle.Почта,
	УчетнаяЗаписьGoogle);
	
	НастроитьГруппуПочтоваяСлужба();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПометитьКакПрочтенныеНепрочтенныеНаСервере(События)
	
	Если События.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектроннаяПочтаУНФ.ПометитьКакПрочтенныеНепрочтенные(События);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВажность(ИмяВажности)
	
	ВыделенныеСобытия = ВыделенныеСобытия();
	Если ВыделенныеСобытия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВажностьНаСервере(ВыделенныеСобытия, ИмяВажности);
	ОповеститьОбИзменении(Тип("ДокументСсылка.Событие"));
	
	Если ИмяВажности = "Высокая" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Установлена высокая важность письма'");
	ИначеЕсли ИмяВажности = "Нормальная" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Установлена нормальная важность письма'");
	ИначеЕсли ИмяВажности = "Низкая" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Установлена низкая важность письма'");
	Иначе
		ЗаголовокОповещения = НСтр("ru = 'Установлена важность письма'");
	КонецЕсли;
	
	Если ВыделенныеСобытия.Количество() > 1 Тогда
		ПоказатьОповещениеПользователя(ЗаголовокОповещения,,, БиблиотекаКартинок.ИнформацияБаннерЦветной);
	Иначе
		ПоказатьОповещениеПользователя(ЗаголовокОповещения,
			ПолучитьНавигационнуюСсылку(ВыделенныеСобытия[0]), ВыделенныеСобытия[0], БиблиотекаКартинок.ИнформацияБаннерЦветной);
	КонецЕсли;
	
	ПоказатьСодержаниеПисьма(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьВажностьНаСервере(События, Важность)
	
	Если Важность = "Высокая" Тогда
		ВажностьПисьма = Перечисления.ВариантыВажности.Высокая;
	ИначеЕсли Важность = "Нормальная" Тогда
		ВажностьПисьма = Перечисления.ВариантыВажности.Обычная;
	Иначе
		ВажностьПисьма = Перечисления.ВариантыВажности.Низкая;
	КонецЕсли;
	
	Для каждого Событие Из События Цикл
		СобытиеОбъект = Событие.ПолучитьОбъект();
		СобытиеОбъект.Заблокировать();
		СобытиеОбъект.Важность = ВажностьПисьма;
		СобытиеОбъект.Записать();
		СобытиеОбъект.Разблокировать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьКакСпамНеСпамНаСервереБезКонтекста(События)
	
	Если События.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭлектроннаяПочтаУНФ.ЭтоСпам(События) Тогда
		ЭлектроннаяПочтаУНФ.ПометитьКакСпам(События);
	Иначе
		ЭлектроннаяПочтаУНФ.УбратьИзСпама(События);
		Элементы.БаннерСпам.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВсеДоступныеУчетныеЗаписи()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	НЕ УчетныеЗаписиЭлектроннойПочты.Недействителен";
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Функция ВсеЗагружаемыеПользователемУчетныеЗаписи()
	
	Результат = Новый Массив;
	НастройкиУчетныхЗаписей = РегистрыСведений.УчетныеЗаписиПользователя.НастройкаПользователя(АвторизованныйПользователь);
	Для каждого НастройкаУчетнойЗаписи Из НастройкиУчетныхЗаписей Цикл
		Если НастройкаУчетнойЗаписи.ЗагружатьПочту Тогда
			Результат.Добавить(НастройкаУчетнойЗаписи.УчетнаяЗапись);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВсеЗагружаемыеПользователемУчетныеЗаписиСПочтовымиЯщиками()
	
	Результат = Новый Массив;
	УчетныеЗаписи = ВсеЗагружаемыеПользователемУчетныеЗаписи();
	Для каждого УчетнаяЗапись Из УчетныеЗаписи Цикл
		Если ЭлектроннаяПочтаУНФ.ИспользуютсяПочтовыеЯщики(УчетнаяЗапись) Тогда
			Результат.Добавить(УчетнаяЗапись);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИндексКартинкиПоТипуПочтовогоЯщика(ТипПочтовогоЯщика)
	
	ИндексыКартинок = Новый Соответствие;
	ИндексыКартинок.Вставить(Перечисления.ТипыПочтовыхЯщиков.Входящие, 2);
	ИндексыКартинок.Вставить(Перечисления.ТипыПочтовыхЯщиков.Отправленные, 3);
	ИндексыКартинок.Вставить(Перечисления.ТипыПочтовыхЯщиков.Черновики, 4);
	ИндексыКартинок.Вставить(Перечисления.ТипыПочтовыхЯщиков.Исходящие, 5);
	ИндексыКартинок.Вставить(Перечисления.ТипыПочтовыхЯщиков.Спам, 6);
	ИндексыКартинок.Вставить(Перечисления.ТипыПочтовыхЯщиков.Удаленные, 7);
	ИндексыКартинок.Вставить(Перечисления.ТипыПочтовыхЯщиков.ПустаяСсылка(), 8);
	Возврат ИндексыКартинок.Получить(ТипПочтовогоЯщика);
	
КонецФункции

&НаСервере
Функция КартинкаВыбраннойПочтовойПапки()
	
	Если ЗначениеЗаполнено(ТекущийПочтовыйЯщик) Тогда
		
		ТипПочтовогоЯщика = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПочтовыйЯщик, "ВидПапки");
		
		Если ТипПочтовогоЯщика = Перечисления.ТипыПочтовыхЯщиков.Входящие Тогда
			Возврат БиблиотекаКартинок.ПочтоваяПапкаВходящие;
		ИначеЕсли ТипПочтовогоЯщика = Перечисления.ТипыПочтовыхЯщиков.Отправленные Тогда
			Возврат БиблиотекаКартинок.ПочтоваяПапкаОтправленные;
		ИначеЕсли ТипПочтовогоЯщика = Перечисления.ТипыПочтовыхЯщиков.Черновики Тогда
			Возврат БиблиотекаКартинок.ПочтоваяПапкаЧерновики;
		ИначеЕсли ТипПочтовогоЯщика = Перечисления.ТипыПочтовыхЯщиков.Исходящие Тогда
			Возврат БиблиотекаКартинок.ПочтоваяПапкаИсходящие;
		ИначеЕсли ТипПочтовогоЯщика = Перечисления.ТипыПочтовыхЯщиков.Спам Тогда
			Возврат БиблиотекаКартинок.ПочтоваяПапкаСпам;
		ИначеЕсли ТипПочтовогоЯщика = Перечисления.ТипыПочтовыхЯщиков.Удаленные Тогда
			Возврат БиблиотекаКартинок.ПочтоваяПапкаУдаленные;
		Иначе
			Возврат БиблиотекаКартинок.Папка;
		КонецЕсли;
		
	Иначе
		Возврат БиблиотекаКартинок.Папка;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьПочтовыеЯщикиПриОткрытии()
	
	Для каждого Строка Из ПочтовыеЯщикиДляРазворачиванияПоУмолчанию Цикл
		ИдентификаторСтроки = Строка.Значение;
		Элементы.ПочтовыеЯщики.Развернуть(ИдентификаторСтроки, Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПочтовыеЯщики()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПочтовыеЯщики.Ссылка КАК Ссылка,
	|	ПочтовыеЯщики.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА ПочтовыеЯщики.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Входящие)
	|			ТОГДА 1
	|		КОГДА ПочтовыеЯщики.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.ПустаяСсылка)
	|			ТОГДА 2
	|		КОГДА ПочтовыеЯщики.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Исходящие)
	|			ТОГДА 3
	|		КОГДА ПочтовыеЯщики.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Отправленные)
	|			ТОГДА 4
	|		КОГДА ПочтовыеЯщики.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Удаленные)
	|			ТОГДА 5
	|		КОГДА ПочтовыеЯщики.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Черновики)
	|			ТОГДА 6
	|		КОГДА ПочтовыеЯщики.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Спам)
	|			ТОГДА 7
	|		ИНАЧЕ 8
	|	КОНЕЦ КАК Порядок,
	|	ПочтовыеЯщики.ВидПапки КАК ВидПапки
	|ИЗ
	|	Справочник.ПочтовыеЯщики КАК ПочтовыеЯщики
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Строки = ПочтовыеЯщики.ПолучитьЭлементы();
	Строки.Очистить();
	
	Строки = ПочтовыеЯщики.ПолучитьЭлементы();
	СтрокаВсяПочта = Строки.Добавить();
	СтрокаВсяПочта.ПочтовыйЯщик = Справочники.ПочтовыеЯщики.ПустаяСсылка();
	СтрокаВсяПочта.Наименование = НСтр("ru='Вся почта'");
	СтрокаВсяПочта.УчетнаяЗапись = Неопределено;
	СтрокаВсяПочта.ИндексКартинки = 0;
	ПочтовыеЯщикиДляРазворачиванияПоУмолчанию.Добавить(СтрокаВсяПочта.ПолучитьИдентификатор());
	
	СтрокиВсяПочта = СтрокаВсяПочта.ПолучитьЭлементы();
	УчетныеЗаписи = ВсеДоступныеУчетныеЗаписи();
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		СтрокаПочтовыйЯщик = СтрокиВсяПочта.Добавить();
		СтрокаПочтовыйЯщик.ПочтовыйЯщик = Результат.Ссылка;
		СтрокаПочтовыйЯщик.Наименование = Результат.Наименование;
		СтрокаПочтовыйЯщик.УчетнаяЗапись = Неопределено;
		СтрокаПочтовыйЯщик.ИндексКартинки = ИндексКартинкиПоТипуПочтовогоЯщика(Результат.ВидПапки);
		СтрокаПочтовыйЯщик.ЭтоПочтовыйЯщик = Истина;
		СтрокиПочтовогоЯщика = СтрокаПочтовыйЯщик.ПолучитьЭлементы();
		Для каждого УчетнаяЗапись Из УчетныеЗаписи Цикл
			СтрокаУчетнаяЗапись = СтрокиПочтовогоЯщика.Добавить();
			СтрокаУчетнаяЗапись.ПочтовыйЯщик = СтрокаПочтовыйЯщик.ПочтовыйЯщик;
			СтрокаУчетнаяЗапись.Наименование = УчетнаяЗапись;
			СтрокаУчетнаяЗапись.УчетнаяЗапись = УчетнаяЗапись;
			СтрокаУчетнаяЗапись.ИндексКартинки = 0;
		КонецЦикла;
	КонецЦикла;
	
	УчетныеЗаписи = ВсеЗагружаемыеПользователемУчетныеЗаписиСПочтовымиЯщиками();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПочтовыеЯщикиУчетныхЗаписей.Ссылка КАК ПочтовыйЯщик,
	|	ПочтовыеЯщикиУчетныхЗаписей.Владелец КАК УчетнаяЗапись,
	|	ПочтовыеЯщикиУчетныхЗаписей.Наименование КАК Наименование,
	|	ПочтовыеЯщикиУчетныхЗаписей.НаименованиеНаСервере КАК НаименованиеНаСервере,
	|	ПочтовыеЯщикиУчетныхЗаписей.Родитель КАК Родитель,
	|	ПочтовыеЯщикиУчетныхЗаписей.ВидПапки КАК ВидПапки,
	|	ВЫБОР
	|		КОГДА ПочтовыеЯщикиУчетныхЗаписей.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Входящие)
	|			ТОГДА 1
	|		КОГДА ПочтовыеЯщикиУчетныхЗаписей.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.ПустаяСсылка)
	|			ТОГДА 2
	|		КОГДА ПочтовыеЯщикиУчетныхЗаписей.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Исходящие)
	|			ТОГДА 3
	|		КОГДА ПочтовыеЯщикиУчетныхЗаписей.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Отправленные)
	|			ТОГДА 4
	|		КОГДА ПочтовыеЯщикиУчетныхЗаписей.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Удаленные)
	|			ТОГДА 5
	|		КОГДА ПочтовыеЯщикиУчетныхЗаписей.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Черновики)
	|			ТОГДА 6
	|		КОГДА ПочтовыеЯщикиУчетныхЗаписей.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Спам)
	|			ТОГДА 7
	|		ИНАЧЕ 8
	|	КОНЕЦ КАК Порядок,
	|	ЕСТЬNULL(НастройкиЗагрузкиПисем.ВариантЗагрузки, ЗНАЧЕНИЕ(Перечисление.ВариантыЗагрузкиПисем.ПустаяСсылка)) КАК ВариантЗагрузки
	|ИЗ
	|	Справочник.ПочтовыеЯщикиУчетныхЗаписей КАК ПочтовыеЯщикиУчетныхЗаписей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЗагрузкиПисем КАК НастройкиЗагрузкиПисем
	|		ПО ПочтовыеЯщикиУчетныхЗаписей.Владелец = НастройкиЗагрузкиПисем.УчетнаяЗапись
	|			И ПочтовыеЯщикиУчетныхЗаписей.НаименованиеНаСервере = НастройкиЗагрузкиПисем.ПочтоваяПапка
	|ГДЕ
	|	ПочтовыеЯщикиУчетныхЗаписей.Владелец В(&Владельцы)
	|	И ПочтовыеЯщикиУчетныхЗаписей.ВидПапки <> ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Исходящие)
	|	И НЕ ПочтовыеЯщикиУчетныхЗаписей.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Запрос.УстановитьПараметр("Владельцы", УчетныеЗаписи);
	ПочтовыеЯщикиУчетныхЗаписей = Запрос.Выполнить().Выгрузить();
	
	Для каждого УчетнаяЗапись Из УчетныеЗаписи Цикл
		Строки = ПочтовыеЯщики.ПолучитьЭлементы();
		СтрокаУчетнаяЗапись = Строки.Добавить();
		СтрокаУчетнаяЗапись.ПочтовыйЯщик = Справочники.ПочтовыеЯщикиУчетныхЗаписей.ПустаяСсылка();
		СтрокаУчетнаяЗапись.Наименование = УчетнаяЗапись;
		СтрокаУчетнаяЗапись.УчетнаяЗапись = УчетнаяЗапись;
		
		ПараметрыОтбора = Новый Структура("УчетнаяЗапись", УчетнаяЗапись);
		ПочтовыеЯщикиУчетнойЗаписи = ПочтовыеЯщикиУчетныхЗаписей.НайтиСтроки(ПараметрыОтбора);
		СтрокиПочтовыеЯщикиУчетнойЗаписи = СтрокаУчетнаяЗапись.ПолучитьЭлементы();
		Для каждого ПочтовыйЯщик Из ПочтовыеЯщикиУчетнойЗаписи Цикл
			Если Не ЗначениеЗаполнено(ПочтовыйЯщик.ВидПапки) 
				И (ПочтовыйЯщик.ВариантЗагрузки = Перечисления.ВариантыЗагрузкиПисем.НеЗагружать
				Или Не ЗначениеЗаполнено(ПочтовыйЯщик.ВариантЗагрузки)) Тогда
				Продолжить;
			КонецЕсли;
			ПочтовыйЯщикУчетнойЗаписи = СтрокиПочтовыеЯщикиУчетнойЗаписи.Добавить();
			ПочтовыйЯщикУчетнойЗаписи.ЭтоПочтовыйЯщик = Истина;
			ПочтовыйЯщикУчетнойЗаписи.ПочтовыйЯщик = ПочтовыйЯщик.ПочтовыйЯщик;
			ПочтовыйЯщикУчетнойЗаписи.Наименование = ПочтовыйЯщик.ПочтовыйЯщик;
			ПочтовыйЯщикУчетнойЗаписи.УчетнаяЗапись = УчетнаяЗапись;
			ПочтовыйЯщикУчетнойЗаписи.ИндексКартинки = ИндексКартинкиПоТипуПочтовогоЯщика(ПочтовыйЯщик.ВидПапки);
		КонецЦикла;
	КонецЦикла;
	
	ТекущийПочтовыйЯщик = Справочники.ПочтовыеЯщики.ПустаяСсылка();
	ТекущаяУчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияУчетныеЗаписи(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПочтовыеЯщикиУчетныхЗаписей"
		Или ИмяСобытия = ЭлектроннаяПочтаУНФКлиентСервер.ИмяСобытияИзмененСоставПодключенныхУчетныхЗаписей() Тогда
		ОбработкаОповещенияУчетныеЗаписиСервер(ИмяСобытия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияУчетныеЗаписиСервер(ИмяСобытия)
	
	Если ИмяСобытия = "Запись_ПочтовыеЯщикиУчетныхЗаписей"
		Или ИмяСобытия = ЭлектроннаяПочтаУНФКлиентСервер.ИмяСобытияИзмененСоставПодключенныхУчетныхЗаписей() Тогда
		ЗаполнитьПочтовыеЯщики();
	КонецЕсли;
	
	Если ИмяСобытия = ЭлектроннаяПочтаУНФКлиентСервер.ИмяСобытияИзмененСоставПодключенныхУчетныхЗаписей() Тогда
		НастроитьГруппуПочтоваяСлужба();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияЗагруженыНовыеПисьма(ИмяСобытия, РезультатыЗагрузки, Источник)
	
	Если ИмяСобытия <> "События_ЗагрузитьПочту" Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьЗагруженныеПисьма = Ложь;
	ЗагруженоПисем = 0;
	БылиОшибки = Ложь;
	
	Для каждого РезультатЗагрузки Из РезультатыЗагрузки Цикл
		
		Если ЗначениеЗаполнено(РезультатЗагрузки.ТекстОшибки) И НЕ БылиОшибки Тогда
			БылиОшибки = Истина;
		КонецЕсли;
		
		Если РезультатЗагрузки.Пользователи.Найти(АвторизованныйПользователь) <> Неопределено Тогда
			ЕстьЗагруженныеПисьма = РезультатЗагрузки.ЗагруженоПисем <> 0;
			ЗагруженоПисем = ЗагруженоПисем + РезультатЗагрузки.ЗагруженоПисем;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьЗагруженныеПисьма Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОповещениеОНовыхПисьмах", ЭтотОбъект); 
	ШаблонСообщения = НСтр("ru = ';%1 письмо;;%1 письма;%1 писем;%1 письма'");
	ЗагруженоПрописью = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
	ШаблонСообщения, ЗагруженоПисем, ВидЧисловогоЗначения.Количественное, "ЧН=0");
	
	ЗаголовокОповещения = СтрШаблон(НСтр("ru = 'Загружено %1'"), ЗагруженоПрописью);
	Если БылиОшибки Тогда
		ПояснениеОповещения = НСтр("ru='При загрузке почты происходили ошибки'");
		ПоказатьОповещениеПользователя(ЗаголовокОповещения, ОписаниеОповещения, ПояснениеОповещения, БиблиотекаКартинок.ОшибкаБаннерЦветной);
	Иначе
		ПояснениеОповещения = НСтр("ru='Список писем'");
		ПоказатьОповещениеПользователя(ЗаголовокОповещения, ОписаниеОповещения, ПояснениеОповещения, БиблиотекаКартинок.ПолучитьОтправитьПочту);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьПисьмаВПочтовыйЯщикНаСервере(События, ПочтовыйЯщик)
	
	ТипПочтовогоЯщика = Справочники.ПочтовыеЯщикиУчетныхЗаписей.ТипПочтовогоЯщика(ПочтовыйЯщик);
	Если ТипПочтовогоЯщика = Перечисления.ТипыПочтовыхЯщиков.Удаленные Тогда
		Для каждого Событие Из События Цикл
			СобытиеОбъект = Событие.ПолучитьОбъект();
			СобытиеОбъект.УстановитьПометкуУдаления(Истина);
			СобытиеОбъект.Записать();
		КонецЦикла;
	Иначе
		ЭлектроннаяПочтаУНФ.ПереместитьВПочтовыйЯщик(События, ПочтовыйЯщик);
	КонецЕсли;
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПочтовомуЯщику()
	
	Если Элементы.ПочтовыеЯщики.ТекущиеДанные = Неопределено
		Или (ТекущийПочтовыйЯщик = Элементы.ПочтовыеЯщики.ТекущиеДанные.ПочтовыйЯщик
		И ТекущаяУчетнаяЗапись = Элементы.ПочтовыеЯщики.ТекущиеДанные.УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПочтовыйЯщик = Элементы.ПочтовыеЯщики.ТекущиеДанные.ПочтовыйЯщик;
	ТекущаяУчетнаяЗапись = Элементы.ПочтовыеЯщики.ТекущиеДанные.УчетнаяЗапись;
	УстановитьОтборПоПочтовомуЯщикуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПочтовомуЯщикуНаСервере()
	
	Если ЗначениеЗаполнено(ТекущийПочтовыйЯщик) Тогда
		Список.ТекстЗапроса = ТекстЗапросаОтборПочтовыеЯщики();
	Иначе
		Список.ТекстЗапроса = ТекстЗапросаВсеПочтовыеЯщики();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийПочтовыйЯщик) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПочтовыйЯщик", ТекущийПочтовыйЯщик, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		Если ТипЗнч(ТекущийПочтовыйЯщик) = Тип("СправочникСсылка.ПочтовыеЯщики")
			И ЗначениеЗаполнено(ТекущаяУчетнаяЗапись) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "УчетнаяЗапись", ТекущаяУчетнаяЗапись, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "УчетнаяЗапись", ТекущаяУчетнаяЗапись, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ТекущаяУчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПочтовыйЯщик");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "УчетнаяЗапись", ТекущаяУчетнаяЗапись, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПочтовыйЯщик");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "УчетнаяЗапись", ТекущаяУчетнаяЗапись, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаВсеПочтовыеЯщики()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДокументСобытие.Ссылка КАК Ссылка,
	|	ДокументСобытие.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументСобытие.Номер КАК Номер,
	|	ДокументСобытие.Дата КАК Дата,
	|	ДокументСобытие.Проведен КАК Проведен,
	|	ДокументСобытие.ВходящееИсходящееСобытие КАК ВходящееИсходящее,
	|	ДокументСобытие.ТипСобытия КАК ТипСобытия,
	|	ДокументСобытие.Состояние КАК Состояние,
	|	ДокументСобытие.Тема КАК Тема,
	|	ДокументСобытие.Содержание КАК Содержание,
	|	ДокументСобытие.ДокументОснование КАК ДокументОснование,
	|	ДокументСобытие.НачалоСобытия КАК НачалоСобытия,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеЗвонков.ДлительностьРазговора ЕСТЬ NULL
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, ДанныеЗвонков.ДлительностьРазговора)
	|		ИНАЧЕ ДокументСобытие.ОкончаниеСобытия
	|	КОНЕЦ КАК ОкончаниеСобытия,
	|	ДокументСобытие.Важность КАК Важность,
	|	ДокументСобытие.Автор КАК Автор,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеЗвонков.Сотрудник ЕСТЬ NULL
	|			ТОГДА ДанныеЗвонков.Сотрудник
	|		ИНАЧЕ ДокументСобытие.Ответственный
	|	КОНЕЦ КАК Ответственный,
	|	ДокументСобытие.МоментВремени КАК МоментВремени,
	|	ДокументСобытие.СписокУчастников КАК СписокУчастников,
	|	ДокументСобытие.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ДокументСобытие.Проект КАК Проект,
	|	ВЫБОР
	|		КОГДА НЕ ДокументСобытие.ПометкаУдаления
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ЭлектронноеПисьмо)
	|						ТОГДА ВЫБОР
	|								КОГДА ДокументСобытие.ВходящееИсходящееСобытие = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Входящее)
	|									ТОГДА 0
	|								ИНАЧЕ 1
	|							КОНЕЦ
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ТелефонныйЗвонок)
	|						ТОГДА ВЫБОР
	|								КОГДА НЕ ДанныеЗвонков.Неотвеченный ЕСТЬ NULL
	|										И ДанныеЗвонков.Неотвеченный
	|									ТОГДА 4
	|								КОГДА ДокументСобытие.ВходящееИсходящееСобытие = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Входящее)
	|									ТОГДА 2
	|								ИНАЧЕ 3
	|							КОНЕЦ
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ЛичнаяВстреча)
	|						ТОГДА 5
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.СообщениеSMS)
	|						ТОГДА 6
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.Прочее)
	|						ТОГДА 7
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.Запись)
	|						ТОГДА 8
	|					ИНАЧЕ -1
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ЭлектронноеПисьмо)
	|					ТОГДА ВЫБОР
	|							КОГДА ДокументСобытие.ВходящееИсходящееСобытие = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Входящее)
	|								ТОГДА 9
	|							ИНАЧЕ 10
	|						КОНЕЦ
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ТелефонныйЗвонок)
	|					ТОГДА ВЫБОР
	|							КОГДА НЕ ДанныеЗвонков.Неотвеченный ЕСТЬ NULL
	|									И ДанныеЗвонков.Неотвеченный
	|								ТОГДА 13
	|							КОГДА ДокументСобытие.ВходящееИсходящееСобытие = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Входящее)
	|								ТОГДА 11
	|							ИНАЧЕ 12
	|						КОНЕЦ
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ЛичнаяВстреча)
	|					ТОГДА 14
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.СообщениеSMS)
	|					ТОГДА 15
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.Прочее)
	|					ТОГДА 16
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.Запись)
	|					ТОГДА 17
	|				ИНАЧЕ -1
	|			КОНЕЦ
	|	КОНЕЦ КАК ИндексПиктограммы,
	|	ДокументСобытие.Участники.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Контакт КАК Контакт,
	|		КакСвязаться КАК КакСвязаться
	|	) КАК ТЧУчастники,
	|	ДокументСобытие.ДокументыОснования.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ДокументОснование КАК ДокументОснование
	|	) КАК ДокументыОснования,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеЗвонков.Неотвеченный ЕСТЬ NULL
	|			ТОГДА ДанныеЗвонков.Неотвеченный
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Неотвеченный,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеЗвонков.Событие ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЗвонок,
	|	0 КАК ЕстьФайлы,
	|	0 КАК ЕстьФайлыСписокПисем,
	|	ВЫБОР
	|		КОГДА ДокументСобытие.Важность = ЗНАЧЕНИЕ(Перечисление.ВариантыВажности.Обычная)
	|			ТОГДА 1
	|		КОГДА ДокументСобытие.Важность = ЗНАЧЕНИЕ(Перечисление.ВариантыВажности.Низкая)
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ВажностьЭлектронноеПисьмо,
	|	-1 КАК КартинкаПисем,
	|	ЛОЖЬ КАК Непрочитанное,
	|	NULL КАК ПочтовыйЯщик,
	|	ДокументСобытие.ЗагрузитьПриОткрытии КАК ЗагрузитьПриОткрытии,
	|	ЕСТЬNULL(СодержимоеПочтовыхЯщиков.ПочтовыйЯщик.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Спам), ЛОЖЬ) КАК ЭтоСпам
	|ИЗ
	|	Документ.Событие КАК ДокументСобытие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
	|		ПО (ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ТелефонныйЗвонок))
	|			И ДокументСобытие.Ссылка = ДанныеЗвонков.Событие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СодержимоеПочтовыхЯщиков КАК СодержимоеПочтовыхЯщиков
	|		ПО ДокументСобытие.Ссылка = СодержимоеПочтовыхЯщиков.Событие
	|ГДЕ
	|	(НЕ &ОтборСпам
	|			ИЛИ ЕСТЬNULL(СодержимоеПочтовыхЯщиков.ПочтовыйЯщик.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Спам), ЛОЖЬ))
	|	И ВЫБОР
	|			КОГДА &ОтборУчастники
	|				ТОГДА ДокументСобытие.Ссылка В
	|						(ВЫБРАТЬ
	|							ДокументСобытиеУчастники.Ссылка
	|						ИЗ
	|							Документ.Событие.Участники КАК ДокументСобытиеУчастники
	|						ГДЕ
	|							ДокументСобытиеУчастники.Контакт В (&ОтобранныеКонтакты))
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|{ГДЕ
	|	(&НетДоступаКЛидам
	|			И НЕ(ДокументСобытие.Участники.НомерСтроки = 1
	|					И ТИПЗНАЧЕНИЯ(ДокументСобытие.Участники.Контакт) = ТИП(Справочник.Лиды))) КАК Поле2,
	|	(ДокументСобытие.ДокументОснование = &ДокументОснование
	|			ИЛИ ДокументСобытие.ДокументыОснования.ДокументОснование = &ДокументОснование
	|			ИЛИ ДокументСобытие.Ссылка В (&СобытияОснования)) КАК Поле4}";
	ИзменитьТекстЗапросаПоРегиструПочтовыхЯщиков(ТекстЗапроса);
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаОтборПочтовыеЯщики()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДокументСобытие.Ссылка КАК Ссылка,
	|	ДокументСобытие.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументСобытие.Номер КАК Номер,
	|	ДокументСобытие.Дата КАК Дата,
	|	ДокументСобытие.Проведен КАК Проведен,
	|	ДокументСобытие.ВходящееИсходящееСобытие КАК ВходящееИсходящее,
	|	ДокументСобытие.ТипСобытия КАК ТипСобытия,
	|	ДокументСобытие.Состояние КАК Состояние,
	|	ДокументСобытие.Тема КАК Тема,
	|	ДокументСобытие.Содержание КАК Содержание,
	|	ДокументСобытие.ДокументОснование КАК ДокументОснование,
	|	ДокументСобытие.НачалоСобытия КАК НачалоСобытия,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеЗвонков.ДлительностьРазговора ЕСТЬ NULL
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, ДанныеЗвонков.ДлительностьРазговора)
	|		ИНАЧЕ ДокументСобытие.ОкончаниеСобытия
	|	КОНЕЦ КАК ОкончаниеСобытия,
	|	ДокументСобытие.Важность КАК Важность,
	|	ДокументСобытие.Автор КАК Автор,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеЗвонков.Сотрудник ЕСТЬ NULL
	|			ТОГДА ДанныеЗвонков.Сотрудник
	|		ИНАЧЕ ДокументСобытие.Ответственный
	|	КОНЕЦ КАК Ответственный,
	|	ДокументСобытие.МоментВремени КАК МоментВремени,
	|	ДокументСобытие.СписокУчастников КАК СписокУчастников,
	|	ДокументСобытие.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ДокументСобытие.Проект КАК Проект,
	|	ВЫБОР
	|		КОГДА НЕ ДокументСобытие.ПометкаУдаления
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ЭлектронноеПисьмо)
	|						ТОГДА ВЫБОР
	|								КОГДА ДокументСобытие.ВходящееИсходящееСобытие = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Входящее)
	|									ТОГДА 0
	|								ИНАЧЕ 1
	|							КОНЕЦ
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ТелефонныйЗвонок)
	|						ТОГДА ВЫБОР
	|								КОГДА НЕ ДанныеЗвонков.Неотвеченный ЕСТЬ NULL
	|										И ДанныеЗвонков.Неотвеченный
	|									ТОГДА 4
	|								КОГДА ДокументСобытие.ВходящееИсходящееСобытие = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Входящее)
	|									ТОГДА 2
	|								ИНАЧЕ 3
	|							КОНЕЦ
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ЛичнаяВстреча)
	|						ТОГДА 5
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.СообщениеSMS)
	|						ТОГДА 6
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.Прочее)
	|						ТОГДА 7
	|					КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.Запись)
	|						ТОГДА 8
	|					ИНАЧЕ -1
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ЭлектронноеПисьмо)
	|					ТОГДА ВЫБОР
	|							КОГДА ДокументСобытие.ВходящееИсходящееСобытие = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Входящее)
	|								ТОГДА 9
	|							ИНАЧЕ 10
	|						КОНЕЦ
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ТелефонныйЗвонок)
	|					ТОГДА ВЫБОР
	|							КОГДА НЕ ДанныеЗвонков.Неотвеченный ЕСТЬ NULL
	|									И ДанныеЗвонков.Неотвеченный
	|								ТОГДА 13
	|							КОГДА ДокументСобытие.ВходящееИсходящееСобытие = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Входящее)
	|								ТОГДА 11
	|							ИНАЧЕ 12
	|						КОНЕЦ
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ЛичнаяВстреча)
	|					ТОГДА 14
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.СообщениеSMS)
	|					ТОГДА 15
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.Прочее)
	|					ТОГДА 16
	|				КОГДА ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.Запись)
	|					ТОГДА 17
	|				ИНАЧЕ -1
	|			КОНЕЦ
	|	КОНЕЦ КАК ИндексПиктограммы,
	|	ДокументСобытие.Участники.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Контакт КАК Контакт,
	|		КакСвязаться КАК КакСвязаться
	|	) КАК ТЧУчастники,
	|	ДокументСобытие.ДокументыОснования.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ДокументОснование КАК ДокументОснование
	|	) КАК ДокументыОснования,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеЗвонков.Неотвеченный ЕСТЬ NULL
	|			ТОГДА ДанныеЗвонков.Неотвеченный
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Неотвеченный,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеЗвонков.Событие ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЗвонок,
	|	0 КАК ЕстьФайлы,
	|	0 КАК ЕстьФайлыСписокПисем,
	|	ВЫБОР
	|		КОГДА ДокументСобытие.Важность = ЗНАЧЕНИЕ(Перечисление.ВариантыВажности.Обычная)
	|			ТОГДА 1
	|		КОГДА ДокументСобытие.Важность = ЗНАЧЕНИЕ(Перечисление.ВариантыВажности.Низкая)
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ВажностьЭлектронноеПисьмо,
	|	-1 КАК КартинкаПисем,
	|	ЛОЖЬ КАК Непрочитанное,
	|	СодержимоеПочтовыхЯщиков.ПочтовыйЯщик КАК ПочтовыйЯщик,
	|	ДокументСобытие.ЗагрузитьПриОткрытии КАК ЗагрузитьПриОткрытии,
	|	ЕСТЬNULL(СодержимоеПочтовыхЯщиков.ПочтовыйЯщик.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Спам), ЛОЖЬ) КАК ЭтоСпам
	|ИЗ
	|	РегистрСведений.СодержимоеПочтовыхЯщиков КАК СодержимоеПочтовыхЯщиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Событие КАК ДокументСобытие
	|		ПО СодержимоеПочтовыхЯщиков.Событие = ДокументСобытие.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
	|		ПО (ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ТелефонныйЗвонок))
	|			И (ДокументСобытие.Ссылка = ДанныеЗвонков.Событие)
	|ГДЕ
	|	(НЕ &ОтборСпам
	|			ИЛИ ЕСТЬNULL(СодержимоеПочтовыхЯщиков.ПочтовыйЯщик.ВидПапки = ЗНАЧЕНИЕ(Перечисление.ТипыПочтовыхЯщиков.Спам), ЛОЖЬ))
	|	И ВЫБОР
	|			КОГДА &ОтборУчастники
	|				ТОГДА ДокументСобытие.Ссылка В
	|						(ВЫБРАТЬ
	|							ДокументСобытиеУчастники.Ссылка
	|						ИЗ
	|							Документ.Событие.Участники КАК ДокументСобытиеУчастники
	|						ГДЕ
	|							ДокументСобытиеУчастники.Контакт В (&ОтобранныеКонтакты))
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|{ГДЕ
	|	(&НетДоступаКЛидам
	|			И НЕ(ДокументСобытие.Участники.НомерСтроки = 1
	|					И ТИПЗНАЧЕНИЯ(ДокументСобытие.Участники.Контакт) = ТИП(Справочник.Лиды))) КАК Поле2,
	|	(ДокументСобытие.ДокументОснование = &ДокументОснование
	|			ИЛИ ДокументСобытие.ДокументыОснования.ДокументОснование = &ДокументОснование
	|			ИЛИ ДокументСобытие.Ссылка В (&СобытияОснования)) КАК Поле4}";
	ИзменитьТекстЗапросаПоРегиструПочтовыхЯщиков(ТекстЗапроса);
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ИзменитьТекстЗапросаПоРегиструПочтовыхЯщиков(ТекстЗапроса)
	
	Если ТипЗнч(ТекущийПочтовыйЯщик) = Тип("СправочникСсылка.ПочтовыеЯщикиУчетныхЗаписей") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрСведений.СодержимоеПочтовыхЯщиков", "РегистрСведений.СодержимоеПочтовыхЯщиковУчетныхЗаписей");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеОНовыхПисьмах(Результат) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.НастройкаОтображенияПредпросмотра.Видимость = Ложь;
	Элементы.НастройкаОтображенияПредпросмотра1.Видимость = Ложь;
	Элементы.СодержаниеПисьмаСнизуОтключениеВидимостиМК.Видимость = Ложь;
	Элементы.СодержаниеПисьмаСправаОтключениеВидимостиМК.Видимость = Ложь;
	
	Если Не ТипСобытия = Перечисления.ТипыСобытий.ЭлектронноеПисьмо Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПочтовыеЯщики.Видимость = Ложь;
	Элементы.ПочтовыеЯщики.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	
	Элементы.ГруппаГиперссылокСверхуМК.Видимость = Истина;
	НачальнаяПочтоваяПапка = ПочтовыеЯщики.ПолучитьЭлементы()[0];
	ТекущийПочтовыйЯщик = НачальнаяПочтоваяПапка.ПочтовыйЯщик;
	ТекущаяУчетнаяЗапись = НачальнаяПочтоваяПапка.УчетнаяЗапись;
	Элементы.ВыбратьПочтовуюПапкуМК.Заголовок = НачальнаяПочтоваяПапка.Наименование;
	Элементы.ВыбратьПочтовуюПапкуМК.Картинка = КартинкаВыбраннойПочтовойПапки();
	УстановитьОтборПоПочтовомуЯщикуНаСервере();
	
	Элементы.ГруппаПочтоваяСлужбаОтключениеВидимостиМК.Видимость = Ложь;
	
	Элементы.ГруппаБаннерыОшибкиЗагрузкиОтключениеВидимостиМК.Видимость = Ложь;
	
	Элементы.ПроверитьПочту.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели;
	Элементы.Список.ВидТаблицыНаМобильномУстройстве = ВидТаблицыФормы.Список;
	Элементы.Список.ПоложениеУправленияПоиском = ПоложениеУправленияПоиском.Нет;
	Элементы.Список.ЗапросОбновления = СпособЗапросаОбновления.ПотянутьСверху;
	Элементы.Переместить(Элементы.СписокНачалоСобытия, Элементы.СтрокаДанныхМК1);
	Элементы.Переместить(Элементы.СписокСостояние, Элементы.СтрокаДанныхМК1);
	Элементы.Переместить(Элементы.СписокСписокУчастников, Элементы.СтрокаДанныхМК2);
	Элементы.Переместить(Элементы.ВажностьЭлектронноеПисьмо, Элементы.СтрокаДанныхМК2);
	Элементы.Переместить(Элементы.СписокТема, Элементы.СтрокаДанныхМК3);
	Элементы.Переместить(Элементы.ЕстьФайлыСписокПисем, Элементы.СтрокаДанныхМК3);
	Элементы.Переместить(Элементы.ГруппаВерхняяСтрокаКолонок, Элементы.КолонкаДанныхМК);
	
	Элементы.ПраваяПанель.ОтображатьКакКарточку = Ложь;
	Элементы.ПраваяПанель.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Авто;
	Элементы.ПраваяПанельСвернутая.Видимость = Ложь;
	Элементы.ПраваяПанельСтраницы.Видимость = Истина;
	Элементы.ПраваяПанельСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ГруппаОтступ.Видимость = Ложь;
	Элементы.ФильтрыНастройкиИДопИнфо.Видимость = Ложь;
	УстановитьОтображениеОткрытияФильтровМК();
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьПочтовуюПапкуНаСервере()
	
	Элементы.ГруппаГиперссылокСверхуМК.Видимость = Ложь;
	Элементы.ПочтовыеЯщики.Видимость = Истина;
	Элементы.ЦентральнаяПанель.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПочтовыеЯщикиВыборНаСервере(ВыбраннаяСтрока)
	
	ДанныеСтроки = ПочтовыеЯщики.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ТекущийПочтовыйЯщик = ДанныеСтроки.ПочтовыйЯщик;
	ТекущаяУчетнаяЗапись = ДанныеСтроки.УчетнаяЗапись;
	Элементы.ВыбратьПочтовуюПапкуМК.Заголовок = РаботаСОтборами.ПредставлениеВыбраннойГруппыВИерархии(ДанныеСтроки);
	Элементы.ВыбратьПочтовуюПапкуМК.Картинка = КартинкаВыбраннойПочтовойПапки();
	УстановитьОтборПоПочтовомуЯщикуНаСервере();
	
	Элементы.ПочтовыеЯщики.Видимость = Ложь;
	Элементы.ГруппаГиперссылокСверхуМК.Видимость = Истина;
	Элементы.ЦентральнаяПанель.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОткрытьФильтрыНаСервере()
	
	Элементы.ГруппаГиперссылокСверхуМК.Видимость = Ложь;
	Элементы.ЦентральнаяПанель.Видимость = Ложь;
	
	Элементы.ФильтрыНастройкиИДопИнфо.Видимость = Истина;
	Элементы.ПрименитьУстановкуФильтровМК.Видимость = Истина;
	Элементы.ПрименитьУстановкуФильтровМК.Важность = ВажностьКнопки.Главная;
	Элементы.ПрименитьУстановкуФильтровМК.АктивизироватьПоУмолчанию = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьУстановкуФильтровНаСервере()
	
	Элементы.ГруппаГиперссылокСверхуМК.Видимость = Истина;
	Элементы.ЦентральнаяПанель.Видимость = Истина;
	Элементы.ФильтрыНастройкиИДопИнфо.Видимость = Ложь;
	
	Элементы.ПрименитьУстановкуФильтровМК.Видимость = Ложь;
	Элементы.ПрименитьУстановкуФильтровМК.Важность = ВажностьКнопки.Обычная;
	Элементы.ПрименитьУстановкуФильтровМК.АктивизироватьПоУмолчанию = Ложь;
	УстановитьОтображениеОткрытияФильтровМК();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеОткрытияФильтровМК()
	
	Если КоличествоФильтров Тогда
		Элементы.ОткрытьФильтрыМК.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Элементы.ОткрытьФильтрыМК.Заголовок = СтрШаблон("(%1)", КоличествоФильтров);
	Иначе
		Элементы.ОткрытьФильтрыМК.Отображение = ОтображениеКнопки.Картинка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьНастройкиУчетныхЗаписей()
	
	ОткрытьФорму("РегистрСведений.УчетныеЗаписиПользователя.Форма.НастройкаУчетныхЗаписейПользователя", , ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_БаннерСпам_ЭтоНеСпамНаСервере(Событие)
	
	Если ЭлектроннаяПочтаУНФ.ЭтоСпам(Событие) Тогда
		ЭлектроннаяПочтаУНФ.УбратьИзСпама(Событие);
		Элементы.БаннерСпам.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиБаннеры()
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Истина;
	ПараметрыВажногоСообщения.ТипСообщения = "Предупреждение";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Некоторые учетные записи отключены из-за ошибок'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Отключение УЗ из-за ошибок'");
	ПараметрыВажногоСообщения.ПараметрыДействия = Новый Массив;
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Подробнее'");
	Действие.ИмяКоманды = "БаннерУчетныеЗаписиОтключены_НастроитьУчетныеЗаписи";
	Действие.Обработчик = "Подключаемый_БаннерУчетныеЗаписиОтключены_НастроитьУчетныеЗаписи";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.ГруппаУчетныеЗаписиОтключены.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Истина;
	ПараметрыВажногоСообщения.ТипСообщения = "Ошибка";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'При загрузке почты происходили ошибки'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Ошибка загрузки почты'");
	ПараметрыВажногоСообщения.ПараметрыДействия = Новый Массив;
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Подробнее'");
	Действие.ИмяКоманды = "БаннерОшибкаЗагрузки_НастроитьУчетныеЗаписи";
	Действие.Обработчик = "Подключаемый_БаннерОшибкаЗагрузки_НастроитьУчетныеЗаписи";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Повторить загрузку'");
	Действие.ИмяКоманды = "БаннерОшибкаЗагрузки_ПовторитьЗагрузку";
	Действие.Обработчик = "Подключаемый_БаннерОшибкаЗагрузки_ПовторитьЗагрузку";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.ГруппаПроизошлаОшибка.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Истина;
	ПараметрыВажногоСообщения.ТипСообщения = "Предупреждение";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Часть картинок в письме не показана по соображениям безопасности'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Небезопасные картинки скрыты'");
	ПараметрыВажногоСообщения.ПараметрыДействия = Новый Массив;
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Показать все картинки'");
	Действие.ИмяКоманды = "БаннерНебезопасноеСодержимое_ПоказатьВсеКартинки";
	Действие.Обработчик = "Подключаемый_БаннерНебезопасноеСодержимое_ПоказатьВсеКартинки";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.НебезопасноеСодержимое.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Ошибка";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'При загрузке письма произошла ошибка'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Ошибка загрузки письма'");
	ПараметрыВажногоСообщения.ПараметрыДействия = Новый Массив;
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Подробнее'");
	Действие.ИмяКоманды = "БаннерПроизошлаОшибкаПриЗагрузкеПисьма_НастроитьУчетныеЗаписи";
	Действие.Обработчик = "Подключаемый_БаннерПроизошлаОшибкаПриЗагрузкеПисьма_НастроитьУчетныеЗаписи";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Повторить загрузку'");
	Действие.ИмяКоманды = "БаннерПроизошлаОшибкаПриЗагрузкеПисьма_ПовторитьЗагрузкуСообщения";
	Действие.Обработчик = "Подключаемый_БаннерПроизошлаОшибкаПриЗагрузкеПисьма_ПовторитьЗагрузкуСообщения";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерПроизошлаОшибкаПриЗагрузкеПисьма.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Предупреждение";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Это письмо находится в папке Спам.
	|Если письмо попало в спам по ошибке, то его можно переместить в другую папку'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Письмо в папке Спам'");
	ПараметрыВажногоСообщения.ПараметрыДействия = Новый Массив;
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Это не спам'");
	Действие.ИмяКоманды = "БаннерСпам_ЭтоНеСпам";
	Действие.Обработчик = "Подключаемый_БаннерСпам_ЭтоНеСпам";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерСпам.Имя);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСобытие(ТипСобытия)
	
	ЗаполняемоеЗначение = Новый Структура;
	ЗаполняемоеЗначение.Вставить("ТипСобытия", ТипСобытия);
	Если ЗначениеЗаполнено(ОтборОснование) Тогда
		ЗаполняемоеЗначение.Вставить("ОснованиеЗаполнения", ОтборОснование);
	ИначеЕсли ЗначениеЗаполнено(КонтекстКонтакт) Тогда
		ЗаполняемоеЗначение.Вставить("ОснованиеЗаполнения", КонтекстКонтакт);
	Иначе
		ЗаполняемоеЗначение.Вставить("ОснованиеЗаполнения", Новый Структура);
		Если ЗначениеЗаполнено(ОтборОтветственный) Тогда
			ЗаполняемоеЗначение.ОснованиеЗаполнения.Вставить("Ответственный", ОтборОтветственный);
		КонецЕсли;
		Если ЗначениеЗаполнено(ОтборСостояние) Тогда
			ЗаполняемоеЗначение.ОснованиеЗаполнения.Вставить("Состояние", ОтборСостояние);
		КонецЕсли;
		ОтборПоКонтрагенту = ПолучитьОтборПоКонтрагенту();
		Если ЗначениеЗаполнено(ОтборПоКонтрагенту) Тогда
			ЗаполняемоеЗначение.ОснованиеЗаполнения.Вставить("Контакт", ОтборПоКонтрагенту);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗаполняемоеЗначение);
	Если ЗначениеЗаполнено("КонтекстКонтакт") Тогда
		ПараметрыФормы.Вставить("КонтекстКонтакт", КонтекстКонтакт);
	КонецЕсли;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗаполняемоеЗначение);
	
	ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеВремениОбработчиковОжидания()
	
	ВремяЗадержкиОбработчиковОжиданияПриАктивизацииСписка = ДокументыУНФКлиент.ВремяЗадержкиОбработчиковОжидания();
	Если Не ЗначениеЗаполнено(ВремяЗадержкиОбработчиковОжиданияПриАктивизацииСписка) Тогда
		ВремяЗадержкиОбработчиковОжиданияПриАктивизацииСписка = 0.3;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеНастроекФормы(Результат, ДополнительныеПараметры) Экспорт
	УстановитьНастройкиСпискаПисем();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеНастроекФормыВсехСобытий(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьПоложениеПредпросмотра();
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьПереслать(ПараметрКоманды)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектроннаяПочтаУНФКлиент.ОтветитьПереслать(
		ПараметрКоманды, Элементы.Список.ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьОтборАдресатамиПисем(Отбор, Контакт)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязиАдресатКонтактCRM.Адресат КАК СсылкаКакСвязаться
	|ИЗ
	|	РегистрСведений.СвязиАдресатКонтактCRM КАК СвязиАдресатКонтактCRM
	|ГДЕ
	|	СвязиАдресатКонтактCRM.КонтактCRM В(&ОтборКонтакт)";
	
	Запрос.УстановитьПараметр("ОтборКонтакт", Отбор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Отбор.Добавить(Выборка.СсылкаКакСвязаться);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	МетаданныеСобытия = Метаданные.НайтиПоТипу(Тип("ДокументСсылка.Событие"));
	
	УсловноеОформление.Элементы.Очистить();
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Список.ЭтоЗвонок", Истина, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, Элементы.СписокОкончаниеСобытия.Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Формат", "ДФ='Ч:мм:сс'; ДП=0:00:00");
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Список.ЭтоЗвонок", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, Элементы.СписокОкончаниеСобытия.Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Формат", МетаданныеСобытия.Реквизиты.ОкончаниеСобытия.Формат);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор,
	"ПочтовыеЯщики.ЭтоПочтовыйЯщик", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ПочтовыеЯщикиИндексКартинки.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
	НовоеУсловноеОформление, "Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПоСостояниямСобытий()
	
	// Раскраска списка
	СписокУдаляемыхЭлементов = Новый СписокЗначений;
	Для каждого ЭлементУсловногоОформления Из Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы Цикл
		Если ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный" Тогда
			СписокУдаляемыхЭлементов.Добавить(ЭлементУсловногоОформления);
		КонецЕсли;
	КонецЦикла;
	Для каждого Элемент Из СписокУдаляемыхЭлементов Цикл
		Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Удалить(Элемент.Значение);
	КонецЦикла;
	
	Если ЭтоИнтерфейсТакси Тогда
		СтильОформления = "ЦветТекста";
	Иначе
		СтильОформления = "ЦветОтметки";
	КонецЕсли;
	
	ВыборкаСостоянияСобытия = Справочники.СостоянияСобытий.Выбрать();
	Пока ВыборкаСостоянияСобытия.Следующий() Цикл
		
		ЦветСостояния = ВыборкаСостоянияСобытия.Цвет.Получить();
		Если ТипЗнч(ЦветСостояния) <> Тип("Цвет") Тогда
			Если ЭтоИнтерфейсТакси Тогда
				Продолжить;
			Иначе
				ЦветСостояния = ЦветаПалитры.Серый;
			КонецЕсли;
		КонецЕсли; 
		
		ЭлементУсловногоОформления = Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
	
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ВыборкаСостоянияСобытия.Ссылка;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(СтильОформления, ЦветСостояния);
		ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный";
		ЭлементУсловногоОформления.Представление = НСтр("ru = 'Оформление в цвет состояния'");
		
		Если Не ЭтоИнтерфейсТакси Тогда
			ОформляемоеПолеКД = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПолеКД.Поле = Новый ПолеКомпоновкиДанных("Состояние");
			ОформляемоеПолеКД.Использование = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеОтмененныхСобытий()
	
	ЗачеркнутыйШрифт = Новый Шрифт(, , , , , Истина);
	ЭлементУсловногоОформления = Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ЗачеркнутыйШрифт);
	ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "СобытиеОтменено";
	ЭлементУсловногоОформления.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЭлементУсловногоОформления.Представление	= НСтр("ru='Отмененные события зачеркивать'");
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.СостоянияСобытий.Отменено");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборТекущиеДела()
	
	Если НЕ Параметры.Свойство("ТекущиеДела") Тогда
		Возврат;
	КонецЕсли;
	
	АвтоЗаголовок = Ложь;
	Заголовок = НСтр("ru='События'");
	ТекДата = ТекущаяДатаСеанса();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"ПометкаУдаления",
		Ложь);
	
	СписокСостояний = Новый Массив;
	СписокСостояний.Добавить(Справочники.СостоянияСобытий.Отменено);
	СписокСостояний.Добавить(Справочники.СостоянияСобытий.Завершено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияСобытий.Ссылка
		|ИЗ
		|	Справочник.СостоянияСобытий КАК СостоянияСобытий
		|ГДЕ
		|	СостоянияСобытий.ПометкаУдаления = ЛОЖЬ
		|	И НЕ СостоянияСобытий.Ссылка В(&СписокСостояний)";
	
	Запрос.УстановитьПараметр("СписокСостояний", СписокСостояний);
	Выборка = Запрос.Выполнить().Выбрать();
	СписокСостояний.Очистить();
	
	Пока Выборка.Следующий() Цикл
		СписокСостояний.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	СотрудникиПользователя = РегистрыСведений.СотрудникиПользователя.ПолучитьСотрудниковПользователя();
	
	РаботаСОтборами.ПрикрепитьМеткиОтбораИзМассива(ЭтотОбъект, "Состояние", "Состояния", СписокСостояний);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, "Состояние");
	
	РаботаСОтборами.ПрикрепитьМеткиОтбораИзМассива(ЭтотОбъект, "Ответственный", "Ответственные", СотрудникиПользователя);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, "Ответственный");
	
	Если Параметры.Свойство("ПросроченоВыполнение") Тогда
		
		Заголовок = Заголовок + ": " + НСтр("ru='просрочено выполнение'");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"НачалоСобытия",
			'00010101',
			ВидСравненияКомпоновкиДанных.НеРавно);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"ОкончаниеСобытия",
			НачалоДня(ТекДата),
			ВидСравненияКомпоновкиДанных.Меньше);
		Элементы.ПредставлениеПериода.Видимость = Ложь;
		
	ИначеЕсли Параметры.Свойство("НаСегодня") Тогда
		
		Заголовок = Заголовок + ": " + НСтр("ru='на сегодня'");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"НачалоСобытия",
			КонецДня(ТекДата),
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"ОкончаниеСобытия",
			НачалоДня(ТекДата),
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
		Элементы.ПредставлениеПериода.Видимость = Ложь;
		
	ИначеЕсли Параметры.Свойство("ВРаботе") Тогда
		
		Заголовок = Заголовок + ": " + НСтр("ru='в работе'");
		
	КонецЕсли;
	
	Если Элементы.ПредставлениеПериода.Видимость Тогда
		ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(ОтборПериод);
	КонецЕсли;
	
	РаботаСОтборами.ОбновитьЭлементыМеток(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоКонтактам()
	
	Если Не ЗначениеЗаполнено(КонтекстКонтакт) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ОтборУчастники", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("ОтобранныеКонтакты", Новый Массив);
		Возврат;
	КонецЕсли;
	
	ОтборКонтакты = Новый Массив;
	ОтборКонтакты.Добавить(КонтекстКонтакт);
	
	Если ТипЗнч(КонтекстКонтакт) = Тип("СправочникСсылка.Контрагенты") Тогда
		ДополнитьОтборПоКонтрагентуЛидами(ОтборКонтакты, КонтекстКонтакт);
		ДополнитьОтборПоКонтрагентуКонтактами(ОтборКонтакты, КонтекстКонтакт);
	КонецЕсли;
	
	Если ТипЗнч(КонтекстКонтакт) = Тип("СправочникСсылка.Лиды") Тогда
		ДополнитьОтборПоЛидуКонтактамиЛида(ОтборКонтакты, КонтекстКонтакт);
	КонецЕсли;
	
	ДополнитьОтборАдресатамиПисем(ОтборКонтакты, КонтекстКонтакт);
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборУчастники", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ОтобранныеКонтакты", ОтборКонтакты);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьОтборПоКонтрагентуЛидами(Отбор, Контрагент)
	
	ЛидыДоступны = РаботаСЛидами.ЛидыДоступны();
	Если Не ЛидыДоступны Тогда
		Возврат;
	КонецЕсли;
	
	ЛидОснование = Справочники.Контрагенты.ЛидОснование(Контрагент);
	
	Если НЕ ЗначениеЗаполнено(ЛидОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор.Добавить(ЛидОснование);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьОтборПоКонтрагентуКонтактами(Отбор, Контрагент)
	
	СвязанныеКонтакты = Справочники.Контрагенты.СвязанныеКонтакты(Контрагент);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Отбор, СвязанныеКонтакты);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьОтборПоЛидуКонтактамиЛида(ОтборКонтакты, КонтекстКонтакт);
	
	КонтактыЛида = Справочники.КонтактыЛидов.КонтактыЛида(КонтекстКонтакт);
	Для Каждого Контакт Из КонтактыЛида Цикл
		ОтборКонтакты.Добавить(Контакт.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоДокументОснование(ДокументОснование)
	
	ОтборОснование = ДокументОснование;
	СобытияОснования = СобытияОснованияДокумента(ОтборОснование);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДокументОснование", ОтборОснование);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СобытияОснования", СобытияОснования);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОтборПоКонтрагенту()
	
	НайденныеСтроки = ДанныеМеток.НайтиСтроки(Новый Структура("ИмяПоляОтбора", "ТЧУчастники.Контакт"));
	ОтборПоКонтрагенту = Неопределено;
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Если ТипЗнч(НайденнаяСтрока.Метка) = Тип("СписокЗначений") Тогда
			Для Каждого ЭлементСписка Из НайденнаяСтрока.Метка Цикл
				Если ТипЗнч(ЭлементСписка.Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
					ОтборПоКонтрагенту = ЭлементСписка.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтборПоКонтрагенту;
	
КонецФункции

&НаСервере
Функция СобытияОснованияДокумента(Документ)
	
	МетаданныеДокумента = Документ.Метаданные();
	СобытияОснования = Новый СписокЗначений;
	
	Для Каждого Реквизит Из МетаданныеДокумента.Реквизиты Цикл
		Если НЕ Реквизит.Тип.СодержитТип(Тип("ДокументСсылка.Событие")) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеРеквизита = Документ[Реквизит.Имя];
		Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СобытияОснования.НайтиПоЗначению(ЗначениеРеквизита) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СобытияОснования.Добавить(ЗначениеРеквизита);
	КонецЦикла;
	
	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		СтрРеквизитов = "";
		Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
			Если НЕ Реквизит.Тип.СодержитТип(Тип("ДокументСсылка.Событие")) Тогда
				Продолжить;
			КонецЕсли;
			СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
		КонецЦикла;
		
		Если СтрРеквизитов = "" Тогда
			Продолжить;
		КонецЕсли;
		
		СодержимоеТЧ = Документ[ТЧ.Имя].Выгрузить(,СтрРеквизитов);
		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Для Каждого КолонкаТЧ Из СодержимоеТЧ.Колонки Цикл
			Для Каждого СтрокаТЧ Из СодержимоеТЧ Цикл
				ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
					Продолжить;
				КонецЕсли;
				Если СобытияОснования.НайтиПоЗначению(ЗначениеРеквизита) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				СобытияОснования.Добавить(ЗначениеРеквизита);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СобытияОснования;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформлениеСтрокСписка(СтрокиСписка, Настройки)
	
	Если СтрокиСписка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	События = СтрокиСписка.ПолучитьКлючи();
	
	Если Не ОтключенаКолонкаЕстьФайлы(СтрокиСписка) Тогда
		ОбновитьСкрепку(СтрокиСписка, События);
	КонецЕсли;
	
	Если Не ОтключенаКолонкаНепрочитанное(СтрокиСписка) Тогда
		ОбновитьСвойстваПрочитанныхПисем(СтрокиСписка, События);
	КонецЕсли;
	
	ЭтоСписокПисем = Ложь;
	Для Каждого ДанныеПараметра Из Настройки.ПараметрыДанных.Элементы Цикл
		Если ДанныеПараметра.Параметр = Новый ПараметрКомпоновкиДанных("ЭтоСписокПисем")
			И ДанныеПараметра.Значение Тогда
			ЭтоСписокПисем = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтоСписокПисем И Не ОтключенаКолонкаКонтакты(СтрокиСписка) Тогда
		ОбновитьОтображениеКонтактов(СтрокиСписка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтключенаКолонкаЕстьФайлы(СтрокиСписка)
	
	Для Каждого ТекСтрока Из СтрокиСписка Цикл
		Возврат НЕ ТекСтрока.Значение.Данные.Свойство("ЕстьФайлы")
			И НЕ ТекСтрока.Значение.Данные.Свойство("ЕстьФайлыСписокПисем");
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбновитьСкрепку(СтрокиСписка, События)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НаличиеФайлов.ОбъектСФайлами КАК Событие,
	|	НаличиеФайлов.ЕстьФайлы КАК ЕстьФайлы
	|ИЗ
	|	РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	|ГДЕ
	|	НаличиеФайлов.ОбъектСФайлами В(&События)
	|	И НаличиеФайлов.ЕстьФайлы");
	Запрос.УстановитьПараметр("События", События);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СтрокиСписка[Выборка.Событие].Данные.Свойство("ЕстьФайлы") Тогда
			СтрокиСписка[Выборка.Событие].Данные.ЕстьФайлы = 1;
		КонецЕсли;
		
		Если СтрокиСписка[Выборка.Событие].Данные.Свойство("ЕстьФайлыСписокПисем") Тогда
			СтрокиСписка[Выборка.Событие].Данные.ЕстьФайлыСписокПисем = 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтключенаКолонкаНепрочитанное(СтрокиСписка)
	
	Для Каждого ТекСтрока Из СтрокиСписка Цикл
		Возврат НЕ ТекСтрока.Значение.Данные.Свойство("Непрочитанное");
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбновитьСвойстваПрочитанныхПисем(СтрокиСписка, События)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ФлагиПисем.Событие КАК Событие,
	|	ФлагиПисем.Непрочитанное КАК Непрочитанное
	|ИЗ
	|	РегистрСведений.ФлагиПисем КАК ФлагиПисем
	|ГДЕ
	|	ФлагиПисем.Событие В(&События)");
	Запрос.УстановитьПараметр("События", События);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	//@skip-check new-font
	ЖирныйШрифт = ШрифтыСтиля.ЗаголовокЧетвертогоУровня;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Непрочитанное Тогда
			СтрокаСписка = СтрокиСписка[Выборка.Событие];
			СтрокаСписка.Данные.Непрочитанное = Выборка.Непрочитанное;
			Для Каждого ТекЯчейка Из СтрокаСписка.Оформление Цикл
				ТекЯчейка.Значение.УстановитьЗначениеПараметра("Шрифт", ЖирныйШрифт);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтключенаКолонкаКонтакты(СтрокиСписка)
	
	Для Каждого ТекСтрока Из СтрокиСписка Цикл
		Возврат НЕ ТекСтрока.Значение.Данные.Свойство("СписокУчастников");
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбновитьОтображениеКонтактов(СтрокиСписка)
	
	ВсеАдресаЭП = Новый Массив;
	СтрокиСпискаСАдресами = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из СтрокиСписка Цикл
		
		АдресаЭП = ЭлектроннаяПочтаУНФ.ЭлектронныеПочтыИзСпискаУчастников(КлючИЗначение.Значение.Данные.СписокУчастников);
		СтрокиСпискаСАдресами.Вставить(КлючИЗначение, АдресаЭП);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеАдресаЭП, АдресаЭП, Истина);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязиАдресатКонтактCRM.Адресат.Адресат КАК Контакт
		|ИЗ
		|	РегистрСведений.СвязиАдресатКонтактCRM КАК СвязиАдресатКонтактCRM
		|ГДЕ
		|	СвязиАдресатКонтактCRM.Адресат.Адресат В (&АдресаЭП)";
	
	Запрос.УстановитьПараметр("АдресаЭП", ВсеАдресаЭП);
	
	// Убираем из всех полученных контактов (ВсеАдресаЭП) сохраненные в системе контакты
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НайденныйКонтакт = ВсеАдресаЭП.Найти(Выборка.Контакт);
		Если НайденныйКонтакт = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВсеАдресаЭП.Удалить(НайденныйКонтакт);
		
	КонецЦикла;
	
	УстановитьОформлениеНесуществующихКонтактов(СтрокиСпискаСАдресами, ВсеАдресаЭП);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОформлениеНесуществующихКонтактов(СтрокиСпискаСАдресами, ВсеАдресаЭП)
	
	//@skip-check new-color
	ЦветНесуществующегоКонтракта = ЦветаПалитры.Оранжевый;
	
	Для Каждого СтрокаИАдреса Из СтрокиСпискаСАдресами Цикл
		
		Для Каждого НесуществующийАдресЭП Из ВсеАдресаЭП Цикл
			
			УСтрокиЕстьНесуществующихАдресат = Ложь;
			
			Для Каждого АдресЭП Из СтрокаИАдреса.Значение Цикл
				Если АдресЭП = НесуществующийАдресЭП Тогда
					
					СтрокаИАдреса.Ключ.Значение.Оформление["СписокУчастников"].УстановитьЗначениеПараметра(
						"ЦветТекста", ЦветНесуществующегоКонтракта);
					УСтрокиЕстьНесуществующихАдресат = Истина;
					Прервать;
					
				КонецЕсли;
			КонецЦикла;
			
			Если УСтрокиЕстьНесуществующихАдресат Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ВыделенныеСобытия()
	
	ВыделенныеСобытия = Новый Массив;
	Для каждого Строка Из Элементы.Список.ПолучитьСтрокиДляОбработки() Цикл
		ТекущаяСтрока = Элементы.Список.ДанныеСтроки(Строка);
		Если ТекущаяСтрока <> Неопределено Тогда
			ВыделенныеСобытия.Добавить(ТекущаяСтрока.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Возврат ВыделенныеСобытия;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПисемДляВложения(Знач Письма)
	
	ПисьмаФайлами = ЭлектроннаяПочтаУНФ.ИнтернетПочтовыеСообщенияПисем(Письма);
	
	СтруктураВложений = Новый Структура;
	СтруктураВложений.Вставить("Вложения", ПисьмаФайлами);
	
	Адрес = ПоместитьВоВременноеХранилище(СтруктураВложений);
	
	СтруктураРезультата = Новый Структура("ТипСобытия, Адрес");
	СтруктураРезультата.ТипСобытия = Перечисления.ТипыСобытий.ЭлектронноеПисьмо;
	СтруктураРезультата.Адрес = Адрес;
	
	Возврат СтруктураРезультата;
КонецФункции

&НаСервере
Процедура УстановитьОтображениеГруппыПочтоваяСлужбаНаСервере(Видимость = Неопределено, ТекущаяСтраница = Неопределено)
	
	Если Видимость <> Неопределено Тогда
		Элементы.ГруппаПочтоваяСлужба.Видимость = Видимость;
	КонецЕсли;
	
	Если Видимость = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтраница <> Неопределено Тогда
		
		Для Каждого Страница Из Элементы.ГруппаПочтоваяСлужба.ПодчиненныеЭлементы Цикл
			
			Если Страница <> ТекущаяСтраница Тогда
				Страница.Видимость = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		ТекущаяСтраница.Видимость = Истина;
		Элементы.ГруппаПочтоваяСлужба.ТекущаяСтраница = ТекущаяСтраница;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображениеГруппыПочтоваяСлужба(Видимость = Неопределено, ТекущаяСтраница = Неопределено)
	
	Если Видимость <> Неопределено Тогда
		Элементы.ГруппаПочтоваяСлужба.Видимость = Видимость;
	КонецЕсли;
	
	Если Видимость = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтраница <> Неопределено Тогда
		
		Для Каждого Страница Из Элементы.ГруппаПочтоваяСлужба.ПодчиненныеЭлементы Цикл
			
			Если Страница <> ТекущаяСтраница Тогда
				Страница.Видимость = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		ТекущаяСтраница.Видимость = Истина;
		Элементы.ГруппаПочтоваяСлужба.ТекущаяСтраница = ТекущаяСтраница;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если Не ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.ГруппаКоманднаяПанель, Элементы.ГруппаКоманднаяПанельФормы, Элементы.ДополнительныеКомандыПоСобытиям);
	Элементы.Переместить(Элементы.ГруппаКоманднаяПанельЭлектронноеПисьмо, Элементы.ГруппаКоманднаяПанельФормыЭлектронноеПисьмо, Элементы.ДополнительныеКомандыПоВсейПочте);
	
	Элементы.КомандыСозданияПисьма.Видимость = Ложь;
	Элементы.КомандыСозданияПисьмаТакси.Видимость = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "СписокСкопироватьСобытия", "Видимость", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФильтрыПоДополнительнымФильтрам()
	
	КоличествоДопФильтров = 0;
	
	Если ОтборСпам Тогда
		КоличествоДопФильтров = КоличествоДопФильтров + 1;
	КонецЕсли;
	Если ОтборПропущенные Тогда
		КоличествоДопФильтров = КоличествоДопФильтров + 1;
	КонецЕсли;
	Если Не ОтборВходящееИсходящее.Пустая() Тогда
		КоличествоДопФильтров = КоличествоДопФильтров + 1;
	КонецЕсли;
	
	РаботаСОтборамиКлиентСервер.ОбновитьКоличествоФильтров(ЭтотОбъект);
	РаботаСОтборамиКлиентСервер.УстановитьОтображениеКомандыСброситьВсеОтборы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьОтображениеДополнительныхОтборов(Видимость)
	
	Элементы.ВходящееИсходящее.Видимость = Видимость;
	
КонецПроцедуры

&НаСервере
Процедура ПраваяПанельСтраницыПриСменеСтраницыНаСервере()
	
	ОбновитьПанельКонтактнойИнформацииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОтображениеПредпросмотра(ПоложениеПредпросмотра)
	
	Если Не ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиСпискаПапок = ХранилищеСистемныхНастроек.Загрузить(
	"НастройкиСпискаПапок", "ГруппаОтбораСписокПисем_НастройкиСпискаПапок");
	Если ТипЗнч(НастройкиСпискаПапок) <> Тип("Структура") Тогда
		НастройкиСпискаПапок = Новый Структура;
	КонецЕсли;
	
	НастройкиСпискаПапок.Вставить("ВидПредпросмотраПисьма", ПоложениеПредпросмотра);
	ХранилищеСистемныхНастроек.Сохранить(
	"НастройкиСпискаПапок", "ГруппаОтбораСписокПисем_НастройкиСпискаПапок", НастройкиСпискаПапок);
	
	ОбновитьПоложениеПредпросмотра(НастройкиСпискаПапок);
	
КонецПроцедуры

#КонецОбласти
