#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

// Инициализирует таблицы значений, содержащие данные табличных частей документа "Начисление зарплаты".
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры:
//   ДокументСсылкаНачислениеЗарплаты - ДокументСсылка.НачислениеЗарплатыУНФ
//   СтруктураДополнительныеСвойства - Структура - структура, содержащая дополнительные свойства для проведения
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц
		= СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|  КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|  ВЫБОР
	|      КОГДА КурсыВалютСрезПоследних.Курс = 0
	|          ТОГДА 1
	|      ИНАЧЕ КурсыВалютСрезПоследних.Курс
	|  КОНЕЦ КАК Курс,
	|  ВЫБОР
	|      КОГДА КурсыВалютСрезПоследних.Кратность = 0
	|          ТОГДА 1
	|      ИНАЧЕ КурсыВалютСрезПоследних.Кратность
	|  КОНЕЦ КАК Кратность
	|ПОМЕСТИТЬ ВТКурсыВалютСрезПоследних
	|ИЗ
	|  РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ТаблицаНалоги.НомерСтроки КАК НомерСтроки,
	|	Шапка.Дата КАК Дата,
	|	Шапка.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.ВалютаДокумента КАК ВалютаДокумента,
	|	Шапка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаНалоги.Сотрудник КАК Сотрудник,
	|	ТаблицаНалоги.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ТаблицаНалоги.Сумма КАК Сумма,
	|	ТаблицаНалоги.СуммаСПревышения КАК СуммаСПревышения,
	|	ТаблицаНалоги.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	ТаблицаНалоги.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	ТаблицаНалоги.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22,
	|	ТаблицаНалоги.Сумма + ТаблицаНалоги.СуммаСПревышения + ТаблицаНалоги.СуммаСПревышенияПоСтавке18
	|		+ ТаблицаНалоги.СуммаСПревышенияПоСтавке20 + ТаблицаНалоги.СуммаСПревышенияПоСтавке22 КАК СуммаВсего
	|ПОМЕСТИТЬ ТаблицаНалоги
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ.НалогиНаДоходы КАК ТаблицаНалоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплатыУНФ КАК Шапка
	|		ПО ТаблицаНалоги.Ссылка = Шапка.Ссылка
	|			И Шапка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	Шапка.Дата КАК Период,
	|	Шапка.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.ВалютаДокумента КАК Валюта,
	|	Шапка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя КАК ЗаказПокупателя,
	|	НачислениеЗарплатыНачисленияУдержания.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаНачала КАК ДатаНачала,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаОкончания КАК ДатаОкончания,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноДней КАК ОтработаноДней,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноЧасов КАК ОтработаноЧасов,
	|	НачислениеЗарплатыНачисленияУдержания.Размер КАК Размер,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисленияУдержания.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	НачислениеЗарплатыНачисленияУдержания.Сумма КАК СуммаВал,
	|	НачислениеЗарплатыНачисленияУдержания.Проект КАК Проект,
	|	ВЫРАЗИТЬ(&НачислениеЗарплатыУНФ КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ТаблицаНачисления
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ.НачисленияУдержания КАК НачислениеЗарплатыНачисленияУдержания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплатыУНФ КАК Шапка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютРасчетов
	|			ПО Шапка.ВалютаДокумента = КурсыВалютРасчетов.Валюта
	|		ПО НачислениеЗарплатыНачисленияУдержания.Ссылка = Шапка.Ссылка
	|			И НачислениеЗарплатыНачисленияУдержания.Ссылка = &Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО КурсыВалютУчета.Валюта = &ВалютаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки,
	|	НачислениеЗарплатыНачисленияУдержания.Дата,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияУдержания.ВалютаДокумента,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.ВидНалога.СчетУчета,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации,
	|	КОНЕЦПЕРИОДА(НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации, МЕСЯЦ),
	|	0,
	|	0,
	|	0,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисленияУдержания.СуммаВсего * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)),
	|	НачислениеЗарплатыНачисленияУдержания.СуммаВсего,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100))
	|ИЗ
	|	ТаблицаНалоги КАК НачислениеЗарплатыНачисленияУдержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО КурсыВалютУчета.Валюта = &ВалютаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютРасчетов
	|		ПО НачислениеЗарплатыНачисленияУдержания.ВалютаДокумента = КурсыВалютРасчетов.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыВзносы.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗарплатыВзносы.Ссылка.Дата КАК Период,
	|	НачислениеЗарплатыВзносы.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыВзносы.Ссылка.ВалютаДокумента КАК Валюта,
	|	НачислениеЗарплатыВзносы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыВзносы.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыВзносы.СчетЗатрат КАК СчетЗатрат,
	|	НачислениеЗарплатыВзносы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	НачислениеЗарплатыВзносы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НачислениеЗарплатыВзносы.Ссылка.ПериодРегистрации КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(НачислениеЗарплатыВзносы.Ссылка.ПериодРегистрации, МЕСЯЦ) КАК ДатаОкончания,
	|	0 КАК ОтработаноДней,
	|	0 КАК ОтработаноЧасов,
	|	0 КАК Размер,
	|	НачислениеЗарплатыВзносы.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыВзносы.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	НачислениеЗарплатыВзносы.Сумма КАК СуммаВал,
	|	НЕОПРЕДЕЛЕНО КАК Проект
	|ПОМЕСТИТЬ ТаблицаВзносов
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ.Взносы КАК НачислениеЗарплатыВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО КурсыВалютУчета.Валюта = &ВалютаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютРасчетов
	|		ПО НачислениеЗарплатыВзносы.Ссылка.ВалютаДокумента = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	НачислениеЗарплатыВзносы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыНачисленияУдержания.Период КАК Период,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияУдержания.Валюта КАК Валюта,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаНачала КАК ДатаНачала,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаОкончания КАК ДатаОкончания,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноДней КАК ОтработаноДней,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноЧасов КАК ОтработаноЧасов,
	|	НачислениеЗарплатыНачисленияУдержания.Размер КАК Размер,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	НачислениеЗарплатыНачисленияУдержания.Сумма КАК Сумма,
	|	НачислениеЗарплатыНачисленияУдержания.СуммаВал КАК СуммаВал
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияУдержания.Валюта КАК Валюта,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.СуммаВал
	|		ИНАЧЕ -1 * НачислениеЗарплатыНачисленияУдержания.СуммаВал
	|	КОНЕЦ КАК СуммаВал,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ -1 * НачислениеЗарплатыНачисленияУдержания.Сумма
	|	КОНЕЦ КАК Сумма,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом КАК СчетУчета,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит) КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|			ТОГДА ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100))
	|		ИНАЧЕ ВЫРАЗИТЬ(&НачислениеЗарплатыУНФ КАК СТРОКА(100))
	|	КОНЕЦ КАК СодержаниеПроводки
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.СуммаВал <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации КАК Период,
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетУчета,
	|	НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|			ТОГДА -1 * НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|			ТОГДА -1 * НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет) КАК ВидДвиженияУправленческий,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	ВЫРАЗИТЬ(&НачислениеЗарплатыУНФ КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип <> ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|	И (НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|			ИЛИ НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))
	|	И НачислениеЗарплатыНачисленияУдержания.СуммаВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыВзносы.НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	НачислениеЗарплатыВзносы.ПериодРегистрации,
	|	&Организация,
	|	НачислениеЗарплатыВзносы.СтруктурнаяЕдиница,
	|	НачислениеЗарплатыВзносы.СчетЗатрат,
	|	НачислениеЗарплатыВзносы.СчетЗатрат,
	|	НачислениеЗарплатыВзносы.ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|			ТОГДА -1 * НачислениеЗарплатыВзносы.Сумма
	|		ИНАЧЕ НачислениеЗарплатыВзносы.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|			ТОГДА -1 * НачислениеЗарплатыВзносы.Сумма
	|		ИНАЧЕ НачислениеЗарплатыВзносы.Сумма
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет),
	|	ИСТИНА,
	|	ВЫРАЗИТЬ(&НачислениеЗарплатыУНФ КАК СТРОКА(100))
	|ИЗ
	|	ТаблицаВзносов КАК НачислениеЗарплатыВзносы
	|ГДЕ
	|	(НачислениеЗарплатыВзносы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|			ИЛИ НачислениеЗарплатыВзносы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))
	|	И НачислениеЗарплатыВзносы.СуммаВал <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации КАК Период,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Проект
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Проект,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетУчета,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Аналитика,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|			ТОГДА -1 * НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет) КАК ВидДвиженияУправленческий,
	|	НачислениеЗарплатыНачисленияУдержания.СодержаниеПроводки КАК СодержаниеПроводки
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип <> ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|	И НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета В (ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|	И НачислениеЗарплатыНачисленияУдержания.СуммаВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияВзносы.НомерСтроки,
	|	НачислениеЗарплатыНачисленияВзносы.ПериодРегистрации,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияВзносы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА НачислениеЗарплатыНачисленияВзносы.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияВзносы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА НачислениеЗарплатыНачисленияВзносы.СтруктурнаяЕдиница
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияВзносы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА НачислениеЗарплатыНачисленияВзносы.Проект
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	НачислениеЗарплатыНачисленияВзносы.СчетЗатрат,
	|	НачислениеЗарплатыНачисленияВзносы.СчетЗатрат,
	|	НачислениеЗарплатыНачисленияВзносы.Сотрудник,
	|	НачислениеЗарплатыНачисленияВзносы.Сумма,
	|	0,
	|	НачислениеЗарплатыНачисленияВзносы.Сумма,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияВзносы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА НачислениеЗарплатыНачисленияВзносы.ЗаказПокупателя
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет),
	|	ВЫРАЗИТЬ(&НачислениеВзносов КАК СТРОКА(100))
	|ИЗ
	|	ТаблицаВзносов КАК НачислениеЗарплатыНачисленияВзносы
	|ГДЕ
	|	НачислениеЗарплатыНачисленияВзносы.СчетЗатрат.ТипСчета В (ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|	И НачислениеЗарплатыНачисленияВзносы.СуммаВал <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации КАК Период,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.ВидНалога КАК ВидНалога,
	|	НачислениеЗарплатыНачисленияУдержания.Сумма КАК Сумма
	|ПОМЕСТИТЬ ТаблицаНалогиПоСтавкам
	|ИЗ
	|	ТаблицаНалоги КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.Сумма <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины),
	|	НачислениеЗарплатыНачисленияУдержания.СуммаСПревышения
	|ИЗ
	|	ТаблицаНалоги КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.СуммаСПревышения <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины18),
	|	НачислениеЗарплатыНачисленияУдержания.СуммаСПревышенияПоСтавке18
	|ИЗ
	|	ТаблицаНалоги КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.СуммаСПревышенияПоСтавке18 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины20),
	|	НачислениеЗарплатыНачисленияУдержания.СуммаСПревышенияПоСтавке20
	|ИЗ
	|	ТаблицаНалоги КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.СуммаСПревышенияПоСтавке20 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины22),
	|	НачислениеЗарплатыНачисленияУдержания.СуммаСПревышенияПоСтавке22
	|ИЗ
	|	ТаблицаНалоги КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.СуммаСПревышенияПоСтавке22 <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НачислениеЗарплатыНачисленияУдержания.Период КАК Период,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНалога КАК ВидНалога,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНалога.СчетУчета КАК СчетУчета,
	|	НачислениеЗарплатыНачисленияУдержания.Сумма КАК Сумма,
	|	ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ИЗ
	|	ТаблицаНалогиПоСтавкам КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.Сумма <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ОрганизацияДляРегОтчетности,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	НачислениеЗарплатыНачисленияВзносы.ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияВзносы.ВидНачисленияУдержания.ВидНалога,
	|	НачислениеЗарплатыНачисленияВзносы.ВидНачисленияУдержания.ВидНалога.СчетУчета,
	|	НачислениеЗарплатыНачисленияВзносы.Сумма,
	|	ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100))
	|ИЗ
	|	ТаблицаВзносов КАК НачислениеЗарплатыНачисленияВзносы
	|ГДЕ
	|	НачислениеЗарплатыНачисленияВзносы.СуммаВал <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетДт,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалДт,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом КАК СчетКт,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалКт,
	|	НачислениеЗарплатыНачисленияУдержания.Сумма КАК Сумма,
	|	НачислениеЗарплатыНачисленияУдержания.СодержаниеПроводки КАК Содержание
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|	И НачислениеЗарплатыНачисленияУдержания.СуммаВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетКт,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НачислениеЗарплатыНачисленияУдержания.Сумма,
	|	НачислениеЗарплатыНачисленияУдержания.СодержаниеПроводки
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог))
	|	И НачислениеЗарплатыНачисленияУдержания.СуммаВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыВзносы.НомерСтроки,
	|	НачислениеЗарплатыВзносы.ПериодРегистрации,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	НачислениеЗарплатыВзносы.СчетЗатрат,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.СчетЗатрат.Валютный
	|			ТОГДА НачислениеЗарплатыВзносы.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.СчетЗатрат.Валютный
	|			ТОГДА НачислениеЗарплатыВзносы.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НачислениеЗарплатыВзносы.ВидНачисленияУдержания.ВидНалога.СчетУчета,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.ВидНачисленияУдержания.ВидНалога.СчетУчета.Валютный
	|			ТОГДА НачислениеЗарплатыВзносы.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.ВидНачисленияУдержания.ВидНалога.СчетУчета.Валютный
	|			ТОГДА НачислениеЗарплатыВзносы.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НачислениеЗарплатыВзносы.Сумма,
	|	ВЫРАЗИТЬ(&НачислениеВзносов КАК СТРОКА(100))
	|ИЗ
	|	ТаблицаВзносов КАК НачислениеЗарплатыВзносы
	|ГДЕ
	|	НачислениеЗарплатыВзносы.СуммаВал <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПримененныеВычетыПоНДФЛ.Ссылка.ПериодРегистрации КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ПримененныеВычетыПоНДФЛ.Сотрудник КАК Сотрудник,
	|	ПримененныеВычетыПоНДФЛ.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	ПримененныеВычетыПоНДФЛ.КодВычета КАК КодВычета,
	|	ПримененныеВычетыПоНДФЛ.СуммаВычета КАК СуммаВычета
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ.ПримененныеВычетыПоНДФЛ КАК ПримененныеВычетыПоНДФЛ
	|ГДЕ
	|	ПримененныеВычетыПоНДФЛ.Ссылка = &Ссылка
	|	И ПримененныеВычетыПоНДФЛ.СуммаВычета <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТаблицаНалоги.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ТаблицаНалоги.Сотрудник КАК Сотрудник,
	|	ТаблицаНалоги.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаНалоги.Сумма КАК Сумма,
	|	ТаблицаНалоги.СуммаСПревышения КАК СуммаСПревышения,
	|	ТаблицаНалоги.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	ТаблицаНалоги.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	ТаблицаНалоги.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22,
	|	ТаблицаНалоги.Сотрудник.Физлицо КАК ФизическоеЛицо,
	|	ТаблицаНалоги.СтруктурнаяЕдиница КАК Подразделение
	|ИЗ
	|	ТаблицаНалоги КАК ТаблицаНалоги
	|ГДЕ
	|	ТаблицаНалоги.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.НалогНаДоходы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ТаблицаНачисления.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ТаблицаНачисления.Сотрудник КАК сотрудник,
	|	ТаблицаНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаНачисления.ВидНачисленияУдержания.КодДоходаНДФЛ КАК КодДохода,
	|	СУММА(ТаблицаНачисления.Сумма) КАК СуммаДохода
	|ИЗ
	|	ТаблицаНачисления КАК ТаблицаНачисления
	|ГДЕ
	|	ТаблицаНачисления.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНачисления.Период,
	|	ТаблицаНачисления.ПериодРегистрации,
	|	ТаблицаНачисления.Сотрудник,
	|	ТаблицаНачисления.ВидНачисленияУдержания.КодДоходаНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Начисления.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	ИСТИНА КАК ЭтоСтраховыеВзносы,
	|	Начисления.ВидОбязательногоСтрахованияСотрудников КАК ВидОбязательногоСтрахованияСотрудников,
	|	СУММА(Начисления.Сумма) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник КАК Сотрудник,
	|		ВзносыЗаМесяц.ПериодРегистрации КАК ПериодРегистрации,
	|		ВзносыЗаМесяц.Сумма КАК Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРПоСуммарномуТарифу) КАК ВидОбязательногоСтрахованияСотрудников
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ПФРПоСуммарномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник,
	|		ВзносыЗаМесяц.ПериодРегистрации,
	|		ВзносыЗаМесяц.Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРНакопительная)
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ПФРНакопительная
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник,
	|		ВзносыЗаМесяц.ПериодРегистрации,
	|		ВзносыЗаМесяц.Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРСтраховая)
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ПФРСтраховая
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник,
	|		ВзносыЗаМесяц.ПериодРегистрации,
	|		ВзносыЗаМесяц.Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФФОМС)
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ФФОМС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник,
	|		ВзносыЗаМесяц.ПериодРегистрации,
	|		ВзносыЗаМесяц.Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФСС)
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ФСС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник,
	|		ВзносыЗаМесяц.ПериодРегистрации,
	|		ВзносыЗаМесяц.Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФССНесчастныеСлучаи)
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ФССНесчастныеСлучаи
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник,
	|		ВзносыЗаМесяц.ПериодРегистрации,
	|		ВзносыЗаМесяц.Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРПоСуммарномуТарифу)
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ВзносыПоЕдиномуТарифу) КАК Начисления
	|ГДЕ
	|	Начисления.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник,
	|	Начисления.ПериодРегистрации,
	|	Начисления.ВидОбязательногоСтрахованияСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// ТаблицаРасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТаблицаНалоги.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ТаблицаНалоги.Сотрудник КАК Сотрудник,
	|	ТаблицаНалоги.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаНалоги.Сумма КАК Сумма,
	|	ТаблицаНалоги.СуммаСПревышения КАК СуммаСПревышения,
	|	ТаблицаНалоги.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	ТаблицаНалоги.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	ТаблицаНалоги.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22,
	|	ТаблицаНалоги.Сотрудник.Физлицо КАК ФизическоеЛицо,
	|	ТаблицаНалоги.СтруктурнаяЕдиница КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.КодыДоходовНДФЛ.Код2000) КАК КодДохода,
	|	&СтавкаНДФЛСКодом2000 КАК СтавкаНалогообложенияРезидента,
	|	ВЫРАЗИТЬ(&ОрганизацияДляРегОтчетности КАК Справочник.Организации).РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ТаблицаНалоги КАК ТаблицаНалоги
	|ГДЕ
	|	ТаблицаНалоги.ПериодРегистрации >= &ДатаОбязательногоПримененияЕНП
	|	И ТаблицаНалоги.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.НалогНаДоходы)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеЗарплаты);
	Запрос.УстановитьПараметр("МоментВремени",
		Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ОрганизацияДляРегОтчетности",
		СтруктураДополнительныеСвойства.ДляПроведения.ОрганизацияДляРегОтчетности);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураДополнительныеСвойства.ВалютаУчета);
	Запрос.УстановитьПараметр("НачислениеЗарплатыУНФ", НСтр("ru = 'Начисление зарплаты'"));
	Запрос.УстановитьПараметр("НачисленНалог", НСтр("ru = 'Начислен налог'"));
	Запрос.УстановитьПараметр("НачислениеВзносов", НСтр("ru = 'Начислен взнос'"));
	Запрос.УстановитьПараметр("УдержаниеВСчетПогашенияЗаймаИПроцентов",
		НСтр("ru = 'Удержание в счет погашения займа и процентов'"));
	Запрос.УстановитьПараметр("ОбъединятьНакопительнуюИСтраховуюЧасть",
		СтруктураДополнительныеСвойства.ДляПроведения.Дата >= УчетСтраховыхВзносовУНФ.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР());
	Запрос.УстановитьПараметр("ПФРПоСуммарномуТарифу", Справочники.ВидыНачисленийИУдержаний.ПФРПоСуммарномуТарифу);
	Запрос.УстановитьПараметр("ПФРСтраховая", Справочники.ВидыНачисленийИУдержаний.ПФРСтраховая);
	Запрос.УстановитьПараметр("ПФРНакопительная", Справочники.ВидыНачисленийИУдержаний.ПФРНакопительная);
	Запрос.УстановитьПараметр("ФСС", Справочники.ВидыНачисленийИУдержаний.ФСС);
	Запрос.УстановитьПараметр("ФССНесчастныеСлучаи", Справочники.ВидыНачисленийИУдержаний.ФССНесчастныеСлучаи);
	Запрос.УстановитьПараметр("ФФОМС", Справочники.ВидыНачисленийИУдержаний.ФФОМС);     
	Запрос.УстановитьПараметр("ВзносыПоЕдиномуТарифу", Справочники.ВидыНачисленийИУдержаний.ВзносыПоЕдиномуТарифу); 
	Запрос.УстановитьПараметр("УправленческиеРасходы", ПланыСчетов.Управленческий.УправленческиеРасходы);
	Запрос.УстановитьПараметр("ДатаОбязательногоПримененияЕНП", РегламентированнаяОтчетностьУСН.ДатаОбязательногоПримененияЕНП());
	
	КодДохода2000 = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.КодыДоходовНДФЛ.Код2000");
	Если ЗначениеЗаполнено(КодДохода2000) Тогда
		Запрос.УстановитьПараметр("СтавкаНДФЛСКодом2000",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КодДохода2000, "СтавкаНДФЛ"));
	Иначе
		Запрос.УстановитьПараметр("СтавкаНДФЛСКодом2000", 0);
	КонецЕсли;
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНачисленияИУдержания",
		МассивРезультатов[4].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПерсоналом",
		МассивРезультатов[5].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы",
		МассивРезультатов[6].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы",
		МассивРезультатов[7].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам",
		МассивРезультатов[9].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий",
		МассивРезультатов[10].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПримененныеВычетыПоНДФЛ",
		МассивРезультатов[11].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДФЛРасчетыНалоговыхАгентовСБюджетом",
		МассивРезультатов[12].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДФЛДоходы",
		МассивРезультатов[13].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСФондамиПоСтраховымВзносам",
		МассивРезультатов[14].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ",
		МассивРезультатов[15].Выгрузить());
	
	// Прочие Расчеты
	СтруктураДополнительныеСвойства.Вставить("ЕстьПогашениеЗаймов", Ложь);
	СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);
	СформироватьТаблицыПоУчетуЗаймов(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);
	// Конец Прочие Расчеты
	
КонецПроцедуры

// Выполняет контроль возникновения отрицательных остатков.
//
// Параметры:
//   ДокументСсылкаНачислениеЗарплаты - ДокументСсылка - Ссылка на документ "Начисление зарплаты"
//   ДополнительныеСвойства - Структура - Дополнительные свойства для проведения документа
//   Отказ - Булево - Флаг отказа от проведения документа
//   УдалениеПроведения - Булево - Флаг удаления проведения документа
Процедура ВыполнитьКонтроль(ДокументСсылкаНачислениеЗарплаты, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если ПроведениеДокументовУНФ.КонтрольОстатковВыключен() Тогда
		Возврат;
	КонецЕсли;

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
КонецПроцедуры

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = Отчеты.РасчетнаяВедомость.ИдентификаторПечатнойФормы();
	КомандаПечати.Представление = Отчеты.РасчетнаяВедомость.ПредставлениеПФ();
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МенеджерПечати = "Отчет.РасчетнаяВедомость";
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = Отчеты.РасчетныеЛистки.ИдентификаторПечатнойФормы();
	КомандаПечати.Представление = Отчеты.РасчетныеЛистки.ПредставлениеПФ();
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МенеджерПечати = "Отчет.РасчетныеЛистки";
	КомандаПечати.Порядок = 2;
	
КонецПроцедуры

#КонецОбласти

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.РасчетныеЛистки) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.НачисленияИУдержания.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Начисления и удержания'");
		КомандаОтчет.КлючВарианта = "ВВалюте";
		КомандаОтчет.МножественныйВыбор = Ложь;
		КомандаОтчет.Важность = "Обычное";
		КомандаОтчет.ФункциональныеОпции = "ИспользоватьПодсистемуЗарплата";
		КомандаОтчет.ДополнительныеПараметры.Вставить("ИмяКоманды", "ОтчетНачисленияУдержания");
		КомандаОтчет.Важность = "Обычное";
		КомандаОтчет.Порядок = 1;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасчетыПоКредитамИЗаймам

Процедура СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеЗарплаты);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыПогашениеЗаймов.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗарплатыПогашениеЗаймов.Ссылка КАК Ссылка,
	|	НачислениеЗарплаты.Дата КАК Дата,
	|	НачислениеЗарплаты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплаты.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплаты.ВалютаДокумента КАК ВалютаДокумента,
	|	НачислениеЗарплатыПогашениеЗаймов.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыПогашениеЗаймов.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику,
	|	НачислениеЗарплатыПогашениеЗаймов.ПогашеноЗайма КАК ПогашеноЗайма,
	|	НачислениеЗарплатыПогашениеЗаймов.НачисленоПроцентов КАК НачисленоПроцентов,
	|	НачислениеЗарплатыПогашениеЗаймов.ПогашеноПроцентов КАК ПогашеноПроцентов
	|ПОМЕСТИТЬ ТаблицаПогашениеЗаймов
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ.ПогашениеЗаймов КАК НачислениеЗарплатыПогашениеЗаймов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплатыУНФ КАК НачислениеЗарплаты
	|		ПО НачислениеЗарплатыПогашениеЗаймов.Ссылка = НачислениеЗарплаты.Ссылка
	|		И НачислениеЗарплатыПогашениеЗаймов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПогашениеЗаймов.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК ТаблицаПогашениеЗаймов";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоКредитамИЗаймам", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ЕстьПогашениеЗаймов = Истина;
	
	Запрос.УстановитьПараметр("УчетРасчетовПоЗаймамСотрудникам", НСтр("ru='Учет расчетов по займам сотрудникам'"));
	Запрос.УстановитьПараметр("УдержаниеОсновногоДолгаПоЗайму", НСтр("ru='Удержание основного долга по займу'"));
	Запрос.УстановитьПараметр("УдержаниеПроцентовПоЗайму", НСтр("ru='Удержание процентов по займу'"));
	Запрос.УстановитьПараметр("НачислениеПроцентовПоЗайму", НСтр("ru='Начисление процентов по займу'"));
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураДополнительныеСвойства.ВалютаУчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыПогашениеЗаймов.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗарплатыПогашениеЗаймов.Ссылка КАК Ссылка,
	|	НачислениеЗарплатыПогашениеЗаймов.Дата КАК Период,
	|	НачислениеЗарплатыПогашениеЗаймов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыПогашениеЗаймов.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыПогашениеЗаймов.ВалютаДокумента КАК Валюта,
	|	НачислениеЗарплатыПогашениеЗаймов.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыПогашениеЗаймов.Сотрудник.СчетРасчетовСПерсоналом КАК СчетУчетаСотрудник,
	|	НачислениеЗарплатыПогашениеЗаймов.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику,
	|	НачислениеЗарплатыПогашениеЗаймов.ДоговорЗаймаСотруднику.СчетУчета КАК СчетУчетаДоговорЗайма,
	|	НачислениеЗарплатыПогашениеЗаймов.ДоговорЗаймаСотруднику.ВалютаРасчетов КАК ВалютаДоговораЗайма,
	|	НачислениеЗарплатыПогашениеЗаймов.ДоговорЗаймаСотруднику.СчетУчетаПроцентов КАК СчетУчетаПроцентов,
	|	НачислениеЗарплатыПогашениеЗаймов.ДоговорЗаймаСотруднику.СчетЗатрат КАК СчетЗатрат,
	|	НачислениеЗарплатыПогашениеЗаймов.Сотрудник.СчетРасчетовСПерсоналом КАК СчетРасчетовСПерсоналом,
	|	НачислениеЗарплатыПогашениеЗаймов.ДоговорЗаймаСотруднику.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НачислениеЗарплатыПогашениеЗаймов.ПогашеноЗайма + НачислениеЗарплатыПогашениеЗаймов.ПогашеноПроцентов КАК СуммаВал,
	|	ВЫРАЗИТЬ((НачислениеЗарплатыПогашениеЗаймов.ПогашеноЗайма + НачислениеЗарплатыПогашениеЗаймов.ПогашеноПроцентов) * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ((НачислениеЗарплатыПогашениеЗаймов.ПогашеноЗайма + НачислениеЗарплатыПогашениеЗаймов.ПогашеноПроцентов) * КурсыВалютРасчетов.Курс * КурсыВалютДоговораЗайма.Кратность / (КурсыВалютДоговораЗайма.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаВалДоговора,
	|	НачислениеЗарплатыПогашениеЗаймов.ПогашеноЗайма КАК ПогашеноЗаймаВал,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.ПогашеноЗайма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК ПогашеноЗайма,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.ПогашеноЗайма * КурсыВалютРасчетов.Курс * КурсыВалютДоговораЗайма.Кратность / (КурсыВалютДоговораЗайма.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК ПогашеноЗаймаВалДоговора,
	|	НачислениеЗарплатыПогашениеЗаймов.ПогашеноПроцентов КАК ПогашеноПроцентовВал,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.ПогашеноПроцентов * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК ПогашеноПроцентов,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.ПогашеноПроцентов * КурсыВалютРасчетов.Курс * КурсыВалютДоговораЗайма.Кратность / (КурсыВалютДоговораЗайма.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК ПогашеноПроцентовВалДоговора,
	|	НачислениеЗарплатыПогашениеЗаймов.НачисленоПроцентов КАК НачисленоПроцентовВал,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.НачисленоПроцентов * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК НачисленоПроцентов,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.НачисленоПроцентов * КурсыВалютРасчетов.Курс * КурсыВалютДоговораЗайма.Кратность / (КурсыВалютДоговораЗайма.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК НачисленоПроцентовВалДоговора
	|ПОМЕСТИТЬ ТаблицаЗаймы
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК НачислениеЗарплатыПогашениеЗаймов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО КурсыВалютУчета.Валюта = &ВалютаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютРасчетов
	|		ПО НачислениеЗарплатыПогашениеЗаймов.ВалютаДокумента = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютДоговораЗайма
	|		ПО НачислениеЗарплатыПогашениеЗаймов.ДоговорЗаймаСотруднику.ВалютаРасчетов = КурсыВалютДоговораЗайма.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗаймы.Период КАК Дата,
	|	ТаблицаЗаймы.Период КАК Период,
	|	&УдержаниеОсновногоДолгаПоЗайму КАК СодержаниеПроводки,
	|	ТаблицаЗаймы.Сотрудник КАК Контрагент,
	|	ТаблицаЗаймы.ПогашеноЗаймаВалДоговора КАК ОсновнойДолгВал,
	|	ТаблицаЗаймы.ПогашеноЗайма КАК ОсновнойДолг,
	|	ТаблицаЗаймы.ПогашеноЗаймаВалДоговора КАК ОсновнойДолгВалДляОстатка,
	|	ТаблицаЗаймы.ПогашеноЗайма КАК ОсновнойДолгДляОстатка,
	|	0 КАК ПроцентыВал,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыВалДляОстатка,
	|	0 КАК ПроцентыДляОстатка,
	|	0 КАК КомиссияВал,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияВалДляОстатка,
	|	0 КАК КомиссияДляОстатка,
	|	ТаблицаЗаймы.ДоговорЗаймаСотруднику КАК ДоговорКредитаЗайма,
	|	ТаблицаЗаймы.ВалютаДоговораЗайма КАК Валюта,
	|	ТаблицаЗаймы.СчетУчетаДоговорЗайма КАК СчетУчета,
	|	ИСТИНА КАК УдержаноИзЗарплаты,
	|	ТаблицаЗаймы.ДоговорЗаймаСотруднику.ВидДоговора КАК ВидДоговора,
	|	ТаблицаЗаймы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗаймы.ПогашеноЗаймаВалДоговора КАК СуммаВал,
	|	ТаблицаЗаймы.ПогашеноЗайма КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыПоКредитамИЗаймам
	|ИЗ
	|	ТаблицаЗаймы КАК ТаблицаЗаймы
	|ГДЕ
	|	ТаблицаЗаймы.ПогашеноЗаймаВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаЗаймы.Период,
	|	ТаблицаЗаймы.Период,
	|	&УдержаниеПроцентовПоЗайму,
	|	ТаблицаЗаймы.Сотрудник,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТаблицаЗаймы.ПогашеноПроцентовВалДоговора,
	|	ТаблицаЗаймы.ПогашеноПроцентов,
	|	ТаблицаЗаймы.ПогашеноПроцентовВалДоговора,
	|	ТаблицаЗаймы.ПогашеноПроцентов,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТаблицаЗаймы.ДоговорЗаймаСотруднику,
	|	ТаблицаЗаймы.ВалютаДоговораЗайма,
	|	ТаблицаЗаймы.СчетУчетаПроцентов,
	|	ИСТИНА,
	|	ТаблицаЗаймы.ДоговорЗаймаСотруднику.ВидДоговора,
	|	ТаблицаЗаймы.СтруктурнаяЕдиница,
	|	ТаблицаЗаймы.ПогашеноПроцентовВалДоговора,
	|	ТаблицаЗаймы.ПогашеноПроцентов
	|ИЗ
	|	ТаблицаЗаймы КАК ТаблицаЗаймы
	|ГДЕ
	|	ТаблицаЗаймы.ПогашеноПроцентовВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗаймы.Период,
	|	ТаблицаЗаймы.Период,
	|	&НачислениеПроцентовПоЗайму,
	|	ТаблицаЗаймы.Сотрудник,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТаблицаЗаймы.НачисленоПроцентовВалДоговора,
	|	ТаблицаЗаймы.НачисленоПроцентов,
	|	-ТаблицаЗаймы.НачисленоПроцентовВалДоговора,
	|	-ТаблицаЗаймы.НачисленоПроцентов,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТаблицаЗаймы.ДоговорЗаймаСотруднику,
	|	ТаблицаЗаймы.ВалютаДоговораЗайма,
	|	ТаблицаЗаймы.СчетУчетаПроцентов,
	|	ЛОЖЬ,
	|	ТаблицаЗаймы.ДоговорЗаймаСотруднику.ВидДоговора,
	|	ТаблицаЗаймы.СтруктурнаяЕдиница,
	|	ТаблицаЗаймы.НачисленоПроцентовВалДоговора,
	|	ТаблицаЗаймы.НачисленоПроцентов
	|ИЗ
	|	ТаблицаЗаймы КАК ТаблицаЗаймы
	|ГДЕ
	|	ТаблицаЗаймы.НачисленоПроцентовВал <> 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма
	|ИЗ
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ВременнаяТаблицаРасчетыПоКредитамИЗаймам";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыПоКредитамИЗаймам");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	
	ЕстьСтруктурнаяЕдиница = Истина;
	Запрос.Текст = КурсовыеРазницыУНФ.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоКредитамИЗаймам(Запрос.МенеджерВременныхТаблиц, НомерЗапроса, ЕстьСтруктурнаяЕдиница);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоКредитамИЗаймам", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицыПоУчетуЗаймов(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства)
	
	Если НЕ СтруктураДополнительныеСвойства.ЕстьПогашениеЗаймов Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц
		= СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеЗарплаты);
	Запрос.УстановитьПараметр("МоментВремени",
		Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("НачислениеЗарплатыУНФ", НСтр("ru = 'Начисление зарплаты'"));
	Запрос.УстановитьПараметр("НачисленНалог", НСтр("ru = 'Начислен налог'"));
	Запрос.УстановитьПараметр("УдержаниеВСчетПогашенияЗаймаИПроцентов",
		НСтр("ru = 'Удержание в счет погашения займа и процентов'"));
	Запрос.УстановитьПараметр("УдержаниеПроцентовПоЗайму", НСтр("ru = 'Удержание процентов по займу'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураДополнительныеСвойства.ВалютаУчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация,
	|	ТаблицаЗаймы.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗаймы.ПериодРегистрации,
	|	ТаблицаЗаймы.Валюта,
	|	ТаблицаЗаймы.СтруктурнаяЕдиница,
	|	ТаблицаЗаймы.Сотрудник,
	|	-ТаблицаЗаймы.СуммаВал КАК СуммаВал,
	|	-ТаблицаЗаймы.Сумма КАК Сумма,
	|	ТаблицаЗаймы.СчетУчетаДоговорЗайма,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит) КАК ВидДвиженияУправленческий,
	|	ВЫРАЗИТЬ(&УдержаниеВСчетПогашенияЗаймаИПроцентов КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ИЗ
	|	ТаблицаЗаймы КАК ТаблицаЗаймы
	|ГДЕ
	|	ТаблицаЗаймы.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаймы.НомерСтроки,
	|	ТаблицаЗаймы.ПериодРегистрации КАК Период,
	|	ТаблицаЗаймы.Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаймы.СчетУчетаПроцентов.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА ТаблицаЗаймы.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаймы.СчетУчетаПроцентов.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА ТаблицаЗаймы.СтруктурнаяЕдиница
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ТаблицаЗаймы.СчетЗатрат КАК СчетУчета,
	|	ТаблицаЗаймы.Сотрудник КАК Аналитика,
	|	0 КАК СуммаРасходов,
	|	ТаблицаЗаймы.НачисленоПроцентов КАК СуммаДоходов,
	|	ВЫРАЗИТЬ(&УдержаниеПроцентовПоЗайму КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ИЗ
	|	ТаблицаЗаймы КАК ТаблицаЗаймы
	|ГДЕ
	|	ТаблицаЗаймы.НачисленоПроцентов <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ТаблицаДокумента.Контрагент.СчетРасчетовСПерсоналом
	|			ИНАЧЕ ТаблицаДокумента.СчетУчета
	|		КОНЕЦ КАК ПланСчетов.Управленческий) КАК СчетДт,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ТаблицаДокумента.СчетУчета
	|			ИНАЧЕ ТаблицаДокумента.ДоговорКредитаЗайма.СчетЗатрат
	|		КОНЕЦ КАК ПланСчетов.Управленческий) КАК СчетКт,
	|	ТаблицаДокумента.Валюта,
	|	ТаблицаДокумента.СуммаВал,
	|	ТаблицаДокумента.Сумма,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СодержаниеПроводки КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыПоКредитамИЗаймамДляПроводок
	|ИЗ
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ТаблицаДокумента.СчетДт КАК СчетДт,
	|	ТаблицаДокумента.СчетКт КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетДт.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетКт.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетДт.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалДт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетКт.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалКт,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СодержаниеПроводки КАК СТРОКА(100)) КАК Содержание
	|ИЗ
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймамДляПроводок КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Сумма <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|				И ТаблицаДокумента.СчетУчета.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	|				И ТаблицаДокумента.СчетУчета.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация,
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗарплатыНачисленияУдержания.Дата КАК Период,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияУдержания.ВалютаДокумента КАК Валюта,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.ДоговорЗаймаСотруднику.СчетУчета КАК СчетЗатрат,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации, МЕСЯЦ) КАК ДатаОкончания,
	|	0 КАК ОтработаноДней,
	|	0 КАК ОтработаноЧасов,
	|	0 КАК Размер,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ДоговорЗаймаСотруднику.УдержаниеОсновнойДолг = НЕОПРЕДЕЛЕНО
	|				ИЛИ НачислениеЗарплатыНачисленияУдержания.ДоговорЗаймаСотруднику.УдержаниеОсновнойДолг = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПогашениеЗаймаИзЗарплаты)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.ДоговорЗаймаСотруднику.УдержаниеОсновнойДолг
	|	КОНЕЦ КАК ВидНачисленияУдержания,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисленияУдержания.ПогашеноЗайма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	НачислениеЗарплатыНачисленияУдержания.ПогашеноЗайма КАК СуммаВал
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК НачислениеЗарплатыНачисленияУдержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО КурсыВалютУчета.Валюта = &ВалютаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютРасчетов
	|		ПО НачислениеЗарплатыНачисленияУдержания.ВалютаДокумента = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.ПогашеноЗайма > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки,
	|	НачислениеЗарплатыНачисленияУдержания.Дата,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияУдержания.ВалютаДокумента,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.ДоговорЗаймаСотруднику.СчетУчета,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации,
	|	КОНЕЦПЕРИОДА(НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации, МЕСЯЦ),
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ДоговорЗаймаСотруднику.УдержаниеПроценты = НЕОПРЕДЕЛЕНО
	|				ИЛИ НачислениеЗарплатыНачисленияУдержания.ДоговорЗаймаСотруднику.УдержаниеПроценты = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПроцентыПоЗайму)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.ДоговорЗаймаСотруднику.УдержаниеПроценты
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисленияУдержания.ПогашеноПроцентов * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)),
	|	НачислениеЗарплатыНачисленияУдержания.ПогашеноПроцентов
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК НачислениеЗарплатыНачисленияУдержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО КурсыВалютУчета.Валюта = &ВалютаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурсыВалютСрезПоследних КАК КурсыВалютРасчетов
	|		ПО НачислениеЗарплатыНачисленияУдержания.ВалютаДокумента = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.ПогашеноПроцентов > 0";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТекущаяТаблица = МассивРезультатов[0].Выгрузить();
	Если ЗначениеЗаполнено(СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПерсоналом) Тогда
		Для каждого ТекущаяСтрока Из ТекущаяТаблица Цикл
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПерсоналом.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПерсоналом", ТекущаяТаблица);
	КонецЕсли;
	
	ТекущаяТаблица = МассивРезультатов[1].Выгрузить();
	Если ЗначениеЗаполнено(СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы) Тогда
		Для каждого ТекущаяСтрока Из ТекущаяТаблица Цикл
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", ТекущаяТаблица);
	КонецЕсли;
	
	ТекущаяТаблица = МассивРезультатов[3].Выгрузить();
	Если ЗначениеЗаполнено(СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий) Тогда
		Для каждого ТекущаяСтрока Из ТекущаяТаблица Цикл
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", ТекущаяТаблица);
	КонецЕсли;
	
	ТекущаяТаблица = МассивРезультатов[4].Выгрузить();
	Если ЗначениеЗаполнено(СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНачисленияИУдержания) Тогда
		Для каждого ТекущаяСтрока Из ТекущаяТаблица Цикл
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНачисленияИУдержания.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНачисленияИУдержания", ТекущаяТаблица);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли