
#Область ПрограммныйИнтерфейс

#Область ЭлектронныеВесы

// Получает вес с электронных весов.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьПолученияВесаСЭлектронныхВесов(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ПолучитьВесСЭлектронныхВесовАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;

КонецПроцедуры

// Начать установку веса тары электронных весов.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьУстановкуВесаТарыЭлектронныхВесов(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать УстановитьВесТарыЭлектронныхВесовАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Получает вес с электронных весов.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура, Неопределено - не требуется.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
Асинх Функция ПолучитьВесСЭлектронныхВесовАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "GetWeight";
	Контекст = ОборудованиеВесовоеОборудованиеКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		Устройство = Ждать ВыбратьЭлектронныеВесыАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Установить вес тары электронных весов.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция УстановитьВесТарыЭлектронныхВесовАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "Calibrate";
	Контекст = ОборудованиеВесовоеОборудованиеКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		Устройство = Ждать ВыбратьЭлектронныеВесыАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область ВесыСПечатьюЭтикеток

// Начать выгрузку данных в весы с печатью этикеток.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ВыгрузитьДанныеВВесыСПечатьюЭтикетокАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Начать очистку данных в весах с печатью этикеток.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьОчисткуТоваровВВесахСПечатьюЭтикеток(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства = Неопределено, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ОчиститьТоварыВВесахСПечатьюЭтикетокАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Начать выгрузку изображений товаров в весы с печатью этикеток.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьВыгрузкуИзображенийТоваровВВесыСПечатьюЭтикеток(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ВыгрузитьИзображенияТоваровВВесыСПечатьюЭтикетокАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Производить выгрузку данных в весы с печатью этикеток пакетом.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьВыгрузкуДанныеВВесыСПечатьюЭтикетокПакетом(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ВыгрузитьДанныеВВесыСПечатьюЭтикетокПакетомАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Выгрузить данные в весы с печатью этикеток.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ВыгрузитьДанныеВВесыСПечатьюЭтикетокАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "UploadGoods";
	Контекст = ОборудованиеВесовоеОборудованиеКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ПодготовитьДанныеСервер = Истина;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		Устройство = Ждать ВыбратьВесыСПечатьюЭтикетокАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Выгрузить данные в весы с печатью этикеток.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ВыгрузитьДанныеВВесыСПечатьюЭтикетокПакетомАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "UploadGoodsPacket";
	Контекст = ОборудованиеВесовоеОборудованиеКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		Устройство = Ждать ВыбратьВесыСПечатьюЭтикетокАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Очистить данные в весах с печатью этикеток.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ОчиститьТоварыВВесахСПечатьюЭтикетокАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "ClearBase";
	Контекст = ОборудованиеВесовоеОборудованиеКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		Устройство = Ждать ВыбратьВесыСПечатьюЭтикетокАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Выгрузить изображения в весы с печатью этикеток.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ВыгрузитьИзображенияТоваровВВесыСПечатьюЭтикетокАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "UploadProductImages";
	Контекст = ОборудованиеВесовоеОборудованиеКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ПодготовитьДанныеСервер = Истина;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		Устройство = Ждать ВыбратьВесыСПечатьюЭтикетокАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#КонецОбласти  

#Область СлужебныйПрограммныйИнтерфейс

Асинх Функция ВыбратьЭлектронныеВесыАсинх() Экспорт
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.ЭлектронныеВесы = Истина;
	РезультатВыбора = Ждать МенеджерОборудованияКлиент.ВыбратьУстройствоАсинх(
		ПоддерживаемыеТипы,
		НСтр("ru='Выберите электронные весы'"),
		НСтр("ru='Электронные весы не подключены.'"), 
		НСтр("ru='Электронные весы не выбраны.'"));
		
	Если Не РезультатВыбора.Результат Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатВыбора.ИдентификаторУстройства;
	
КонецФункции

Асинх Функция ВыбратьВесыСПечатьюЭтикетокАсинх() Экспорт
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.ВесыСПечатьюЭтикеток = Истина;
	РезультатВыбора = Ждать МенеджерОборудованияКлиент.ВыбратьУстройствоАсинх(
		ПоддерживаемыеТипы,
		НСтр("ru='Выберите весы с печатью этикеток'"),
		НСтр("ru='Весы с печатью этикеток не подключены.'"), 
		НСтр("ru='Весы с печатью этикеток не выбраны.'"));
		
	Если Не РезультатВыбора.Результат Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатВыбора.ИдентификаторУстройства;
	
КонецФункции

Асинх Функция ПриПодготовкеДанныхОперацииАсинх(ДанныеОперации, ПараметрыПодключения, Команда, ПараметрыОперации) Экспорт
	
КонецФункции

Асинх Функция ПриОбработкеРезультатовОперацииАсинх(ДанныеОперации, ПараметрыПодключения, Команда, РезультатОперации) Экспорт
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачатьОперациюНаЭлектронныхВесахЗавершение(РезультатВыбора, КонтекстОперации) Экспорт
	
	Если РезультатВыбора.Результат Тогда 
		ПараметрыВыполнениеКоманды = МенеджерОборудованияКлиентСервер.ПараметрыВыполнениеКоманды(КонтекстОперации.Команда, "ОборудованиеВесовоеОборудование",
		КонтекстОперации.ДополнительныеПараметры, КонтекстОперации.ПодготовитьДанные, КонтекстОперации.ОбработатьДанные);
		МенеджерОборудованияКлиент.НачатьВыполнениеКоманды(КонтекстОперации.ОповещениеПриЗавершении, КонтекстОперации.ИдентификаторКлиента, 
			РезультатВыбора.ИдентификаторУстройства, КонтекстОперации.ПараметрыОперации, ПараметрыВыполнениеКоманды);
	Иначе
		ВыполнитьОбработкуОповещения(КонтекстОперации.ОповещениеПриЗавершении, РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
