
#Область ПрограммныйИнтерфейс

#Область Локализация

Процедура ПриОпределенииМенеджераОбъектаПоПолномуИмени(МенеджерОбъекта, ПолноеИмя) Экспорт
	
	ИнтеграцияИСУНФ.ПриОпределенииМенеджераОбъектаПоПолномуИмени(МенеджерОбъекта, ПолноеИмя);
	
КонецПроцедуры

Процедура ПриОпределенииМенеджераОбъектаПоСсылке(МенеджерОбъекта, Ссылка) Экспорт
	
	ИнтеграцияИСУНФ.ПриОпределенииМенеджераОбъектаПоСсылке(МенеджерОбъекта, Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОрганизацииИКонтрагенты

// Требуется определить массив ссылок служебных организаций, исключаемых из списков выбора в библиотеке.
// 
// Параметры:
//  СписокОрганизаций - Массив из ОпределяемыйТип.Организация - переопределяемый параметр, массив организаций, исключаемых из списков.
Процедура ПриОпределенииСпискаОрганизацийНедоступныхДляВыбора(СписокОрганизаций) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

// Проверяет использование подразделений в информационной базе.
// 
// Параметры:
//  Использовать - Булево - Подразделения используются (исходящий).
//
Процедура ИспользованиеПодразделений(Использовать) Экспорт
	
	ИнтеграцияГИСМУНФ.ИспользоватьПодразделения(Использовать);
	
КонецПроцедуры

// В процедуре требуется определить признак использования характеристик 
//   * для номенклатуры, если передана номенклатура,
//   * в программе, если не передана.
//
// Параметры:
//  Использование - Булево - Признак использования характеристик (для номенклатуры или общий)
//  Номенклатура - ОпределяемыйТип.Номенклатура, Неопределено - Ссылка на элемент номенклатуры.
//
Процедура ИспользованиеХарактеристик(Использование, Номенклатура) Экспорт
	
	ИнтеграцияИСУНФ.ИспользованиеХарактеристик(Использование, Номенклатура);
	
КонецПроцедуры

// В процедуре требуется определить признак использования серий
//   * для номенклатуры, если передана номенклатура,
//   * в программе, если не передана.
//
// Параметры:
//  Использование - Булево - Признак использования серий (для номенклатуры или общий)
//  Номенклатура - ОпределяемыйТип.Номенклатура, Неопределено - Ссылка на элемент номенклатуры.
//
Процедура ИспользованиеСерий(Использование, Номенклатура) Экспорт
	
	ИнтеграцияИСУНФ.ИспользованиеСерий(Использование, Номенклатура);
	
КонецПроцедуры

// Определяет использование в информационной базе обособленных подразделений выделенных на отдельный баланс
// 
// Параметры:
//  Использовать - Булево - Используются подразделения, выделенных на обособленный баланс
//
Процедура ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс(Использовать) Экспорт
	
	
КонецПроцедуры

// В процедуре нужно реализовать заполнение структуры данными ИНН/КПП из информационной базы.
//
// Параметры:
//  Сведения    - Структура - структура с реквизитами организации/контрагента, которые требуется заполнить,
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентГосИС, ОпределяемыйТип.КонтрагентГосИС - ссылка на 
//                                                                                              собственную организацию или контрагента
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - ссылка на торговый объект для определения КПП.
Процедура ЗаполнитьИННКПППоОрганизацииКонтрагенту(Сведения, Организация, ТорговыйОбъект = Неопределено) Экспорт
	
	ИнтеграцияИСУНФ.ЗаполнитьИННКПППоОрганизацииКонтрагенту(Сведения, Организация, ТорговыйОбъект);
	
КонецПроцедуры

// Процедура предназначена для получения данных ИНН и КПП из прикладных объектов организаций и контрагентов.
// 
// Параметры:
//  СоответствиеДанных    - Соответствие из КлючИЗначение:
//  	* Ключ - ОпределяемыйТип.ОрганизацияКонтрагентГосИС, ОпределяемыйТип.КонтрагентГосИС - запрошенная организация/контрагент
//  	* Значение - Структура из КлючИЗначение:
//  		** ИНН - Строка
//  		** КПП - Строка
//  МассивОрганизацийКонтрагентов - Массив из ОпределяемыйТип.ОрганизацияКонтрагентГосИС, ОпределяемыйТип.КонтрагентГосИС - массив ссылок на 
//                                                                                              собственные организации или контрагенты.
Процедура ЗаполнитьИННКПППоНесколькимОрганизациямКонтрагентам(СоответствиеДанных, МассивОрганизацийКонтрагентов) Экспорт
	
	Организации = Новый Массив;
	Контрагенты = Новый Массив;
	
	Для Каждого ОрганизацияКонтрагент Из МассивОрганизацийКонтрагентов Цикл
		
		Если ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Организации") Тогда
			Организации.Добавить(ОрганизацияКонтрагент);
		ИначеЕсли ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Контрагенты.Добавить(ОрганизацияКонтрагент);
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка В (&Контрагенты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.ИНН КАК ИНН,
		|	Организации.КПП КАК КПП
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка В (&Организации)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОписаниеИННКПП = Новый Структура("ИНН, КПП", "", "");
		ЗаполнитьЗначенияСвойств(ОписаниеИННКПП, Выборка);
		
		СоответствиеДанных.Вставить(Выборка.Ссылка, ОписаниеИННКПП);
		
	КонецЦикла;
	
КонецПроцедуры

// В процедуре нужно реализовать заполнение структуры данными ИНН/КПП/GLN из информационной базы.
//
// Параметры:
//  Сведения      - Структура - структура с реквизитами организации, которые требуется заполнить,
//  Организация   - ОпределяемыйТип.Организация - ссылка на собственную организацию,
//  Подразделение - ОпределяемыйТип.Подразделение - Подразделение организации.
Процедура ПриОпределенииИННКППGLNОрганизации(Сведения, Организация, Подразделение) Экспорт
	
	ИННКППGLNОрганизации = ИнтеграцияИСУНФ.ИННКППGLNОрганизации(Организация, Подразделение);
	ЗаполнитьЗначенияСвойств(Сведения, ИННКППGLNОрганизации);
	
КонецПроцедуры

// В процедуре нужно реализовать поиск организации предприятия по ИНН и/или КПП.
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентГосИС - найденная организация (исходящий),
//              - Неопределено - организация не найдена (исходящий),
//  ИНН - Строка - ИНН искомой организации,
//  КПП - Строка - КПП искомой организации.
//
Процедура ЗаполнитьОрганизациюПоИННКПП(Организация, ИНН, КПП) Экспорт
	
	ИнтеграцияИСУНФ.ЗаполнитьОрганизациюПоИННКПП(Организация, ИНН, КПП);
	
КонецПроцедуры

// Проверка, является ли партнер индивидуальным предпринимателем.
// 
// Параметры:
//  ОрганизацияКонтрагент - ОпределяемыйТип.Организация, ОпределяемыйТип.КонтрагентГосИС - Партнер или организация
//  ЭтоИндивидуальныйПредприниматель - Булево - Истина, если это индивидуальный предприниматель
Процедура ПартнерОрганизацияЭтоИндивидуальныйПредприниматель(ОрганизацияКонтрагент, ЭтоИндивидуальныйПредприниматель) Экспорт
	
	ЭтоИндивидуальныйПредприниматель = Ложь;
	
	ТипИсточника = ТипЗнч(ОрганизацияКонтрагент);
	Если ТипИсточника = Тип("СправочникСсылка.Организации") Или ТипИсточника = Тип("СправочникСсылка.Контрагенты") Тогда
		ЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияКонтрагент, "ЮридическоеФизическоеЛицо");
		Если ЮрФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			ЭтоИндивидуальныйПредприниматель = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// В процедуре необходимо реализовать проверку возможности выбора серии для номенклатуры.
// 
// Параметры:
//  ДанныеДляРасчетаСерии  - Структура - Данные для расчета серий.
//  ПараметрыУказанияСерий - Структура - Параметры указания серий.
//  ТребуетсяВыбор         - Булево - исходящий, признак необходимости выбора серии.
//  СерияДолжнаБытьУказана - Булево - исходящий, признак обязательного заполнения серии.
//  КэшированныеЗначения   - Произвольный - кэшированные значения
//
Процедура ПриОпределенииНеобходимостиВыбораСерии(ДанныеДляРасчетаСерии, ПараметрыУказанияСерий, ТребуетсяВыбор, СерияДолжнаБытьУказана, КэшированныеЗначения = Неопределено) Экспорт
	
	ИспользоватьСерииНоменклатуры = Неопределено;
	Если ПараметрыУказанияСерий = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ПараметрыУказанияСерий) = Тип("Структура") Тогда
		ПараметрыУказанияСерий.Свойство("ИспользоватьСерииНоменклатуры", ИспользоватьСерииНоменклатуры);
	КонецЕсли;
	Если ИспользоватьСерииНоменклатуры = Неопределено Тогда
		ИспользоватьСерииНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	КонецЕсли;
	Если ИспользоватьСерииНоменклатуры = Ложь Тогда
		Возврат;
	КонецЕсли;
	Если КэшированныеЗначения = Неопределено Тогда
		КэшированныеЗначения = Новый Структура;
	КонецЕсли;
	Если Не КэшированныеЗначения.Свойство("ПризнакУказанияСерий") Тогда
		КэшированныеЗначения.Вставить("ПризнакУказанияСерий", Новый Соответствие);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляРасчетаСерии.Номенклатура) Тогда
		ТребуетсяВыбор = КэшированныеЗначения.ПризнакУказанияСерий.Получить(ДанныеДляРасчетаСерии.Номенклатура);
		Если ТребуетсяВыбор = Неопределено Тогда
			ТребуетсяВыбор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляРасчетаСерии.Номенклатура, "ИспользоватьСерииНоменклатуры");
			КэшированныеЗначения.ПризнакУказанияСерий.Вставить(ДанныеДляРасчетаСерии.Номенклатура, ТребуетсяВыбор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Для БРМК. Определяет коды маркировки на оборудовании розлива по переданной таблице товаров.
// Необходимо заполнить выходной параметр КегиНаОборудованииРозлива
// 
// Параметры:
//  ВскрытыеПотребительскиеУпаковки - ТаблицаЗначений - Коды маркировки подключенные к оборудованию розлива:
//  * Номенклатура - ОпределяемыйТип.Номенклатура - номенклатура кода маркировки кега
//  * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика кода маркировки кега
//  * Серия - ОпределяемыйТип.СерияНоменклатуры - серия кода маркировки кега
//  * ИндексИсходнойСтроки - Число - Служебный, в переопределении можно не заполнять
//  * УчитыватьСерии - Булево - учитвать серии исходной таблицы товаров
//  * ВариантЧастичногоВыбытия - ПеречислениеСсылка.ВариантыУчетаЧастичногоВыбытияИС - настройка частичного выбытия номенклатуры
//  * КодМаркировки - ОпределяемыйТип.ШтрихкодУпаковкиИС - код маркировки кега
//  * Комментарий - ОпределяемыйТип.ОборудованиеРозливаИСМП - описание оборудования, к которому подключен кег см. РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС
//  * КодМаркировкиСтрокой - Строка - представление кода маркировки см. РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС
//  * ПолныйКодМаркировки - Строка - полный код маркировки кега Base64 см. РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС
//  ТаблицаТовары - см. РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС.НоваяТаблицаПоискаВскрытыхПотребительскихУпаковок
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ТолькоПолноеСоответствие - Булево - Искать без учета подменной номенклатуры
Процедура ПриОпределенииВскрытыхПотребительскихУпаковок(ВскрытыеПотребительскиеУпаковки, ТаблицаТовары, ПараметрыСканирования, ТолькоПолноеСоответствие) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для БРМК. Определяет параметры полей описания номенклатуры по коду маркировки.
// 
// Параметры:
//  ПараметрыОписания - Структура:
//  *  ИмяПоляНоменклатураШтрихкода   - Строка - поле Номенклатура
//  *  ИмяПоляХарактеристикаШтрихкода - Строка - поле Характеристика
//  *  ИмяПоляСерияШтрихкода          - Строка - поле Серия
//  *  ПутьКИсточникуДанныхШтрихкода  - Строка - таблица источника
//  *  ИмяПоляКодМаркировки           - Строка - поле таблицы источника
Процедура ПриОпределенииПараметровИсточникаДанныхНоменклатурыПоКодуМаркировки(ПараметрыОписания) Экспорт
	
	Если Не ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС() Тогда
		ПараметрыОписания.ИмяПоляНоменклатураШтрихкода  = "Владелец";
		ПараметрыОписания.ПутьКИсточникуДанныхШтрихкода = "РегистрСведений.Штрихкоды";
		ПараметрыОписания.ИмяПоляКодМаркировки          = "Штрихкод";
	КонецЕсли;
	
КонецПроцедуры

// Заполняет представление строки номенклатуры.
//
// Параметры:
//  Представление  - Строка                                     - представление для заполнения,
//  Номенклатура   - ОпределяемыйТип.Номенклатура               - ссылка на номенклатуру,
//  Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - ссылка на характеристику номенклатуры,
//  Упаковка       - ОпределяемыйТип.Упаковка                   - ссылка на упаковку.
//  Серия          - ОпределяемыйТип.СерияНоменклатуры          - ссылка на серию номенклатуры.
Процедура ЗаполнитьПредставлениеНоменклатуры(Представление, Номенклатура, Характеристика, Упаковка, Серия) Экспорт
	
	ИнтеграцияИСУНФ.ЗаполнитьПредставлениеНоменклатуры(Представление, Номенклатура, Характеристика, Упаковка, Серия);
	
КонецПроцедуры

// Проверка, является ли партнер индивидуальным предпринимателем.
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты, СправочникСсылка.Организации - Партнер
//  ЭтоИндивидуальныйПредприниматель - Булево - Истина, если это индивидуальный предприниматель
Процедура ПартнерЭтоИндивидуальныйПредприниматель(Контрагент, ЭтоИндивидуальныйПредприниматель) Экспорт
	
	ЭтоИндивидуальныйПредприниматель = Ложь;
	
	ТипИсточника = ТипЗнч(Контрагент);
	Если ТипИсточника = Тип("СправочникСсылка.Организации") Или ТипИсточника = Тип("СправочникСсылка.Контрагенты") Тогда
		ЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ЮридическоеФизическоеЛицо");
		Если ЮрФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			ЭтоИндивидуальныйПредприниматель = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ПодключаемоеОборудование

// Настраивает подключаемое оборудование в форме,
// устанавливает флаг ИспользоватьПодключаемоеОборудование в форме.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо настроить подключаемое оборудование,
//  ПрефиксыЭлементовФормы - Строка - строка имен табличных частей, разделенных запятыми, в которых нужно настроить видимость команд.
Процедура НастроитьПодключаемоеОборудование(Форма, ПрефиксыЭлементовФормы = "Товары") Экспорт
	
	ИнтеграцияИСУНФ.НастроитьПодключаемоеОборудование(Форма, ПрефиксыЭлементовФормы);
	
КонецПроцедуры

#КонецОбласти

// При определении обработчика обновления данных.
// 
// Параметры:
//  Обработчик - СтрокаТаблицыЗначений: см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//  ОбъектМетаданных - ОбъектМетаданных
Процедура ПриОпределенииОбработчикаОбновленияДанных(Обработчик, ОбъектМетаданных) Экспорт
	
	Если ОбъектМетаданных = Метаданные.Справочники.Номенклатура Тогда
		Обработчик.Процедура                           = "Справочники.Номенклатура.ОбработатьДанныеДляПереходаНаНовуюВерсиюКонструктораНастроек";
		Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.Номенклатура.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюКонструктораНастроек";
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.КатегорииНоменклатуры Тогда
		Обработчик.Процедура                           = "Справочники.КатегорииНоменклатуры.ОбработатьДанныеДляПереходаНаНовуюВерсиюКонструктораНастроек";
		Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.КатегорииНоменклатуры.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюКонструктораНастроек";
	КонецЕсли;
	
КонецПроцедуры

// Заполняет поля номенклатуры для перехода на конструктор настроек. В методе недобходимо для каждой строки номенклатуры:
// - заполнить вид продукции (перечисление) по особенности учета
// - установить Истина в поле ЭтоМернаяЕдиницаИзмерения, если базовая единица измерения мерная (килограмм, литр, метр и т.д.)
// - установить Ложь в поле ЭтоПодакцизнаяПродукцияЕГАИС, если позиция номенклатуры с особенностью учета ЕГАИС и связана с немаркируемым видом алкогольной продукции
//   (реквизит Маркируемый в справочнике ВидыАлкогольнойПродукции)
// В таблице присутствует поле ИндексСтроки для оптимизации заполнения входящей таблицы.
// 
// Параметры:
//  ТаблицаНоменклатуры - см. ОбновлениеИнформационнойБазыГосИС.НоваяТаблицаДляОбработкиНоменклатурыПриПереходеНаКонструкторНастроек
Процедура ПриЗаполненииТаблицыНоменклатурыДляПереходаНаКонструкторНастроекВидовПродукции(ТаблицаНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Источник.ИндексСтроки КАК ИндексСтроки,
		|	Источник.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ Источник
		|ИЗ
		|	&Источник КАК Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Источник.Номенклатура КАК Номенклатура,
		|	Источник.ИндексСтроки КАК ИндексСтроки,
		|	ЕСТЬNULL(СправочникНоменклатура.ВидАлкогольнойПродукции.Маркируемый, ЛОЖЬ) КАК ЭтоПодакцизнаяПродукцияЕГАИС,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.Весовой
		|				ИЛИ СправочникНоменклатура.ЕдиницаИзмерения.Код В (&КодыМерныхЕдиницИзмерения)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоМернаяЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.УдалитьВидПродукцииИС = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)
		|				И СправочникНоменклатура.АлкогольнаяПродукция
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Алкогольная)
		|		ИНАЧЕ СправочникНоменклатура.УдалитьВидПродукцииИС
		|	КОНЕЦ КАК ВидПродукции,
		|	СправочникНоменклатура.ТоварнаяНоменклатураВЭД.Код КАК КодТНВЭД,
		|	СправочникНоменклатура.КодОКПД2 КАК ОКПД2
		|ИЗ
		|	Источник КАК Источник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО Источник.Номенклатура = СправочникНоменклатура.Ссылка";
	
	КодыМерныхЕдиницИзмерения = Новый Массив;
	КодыМерныхЕдиницИзмерения.Добавить("112");
	КодыМерныхЕдиницИзмерения.Добавить("166");
	
	Запрос.УстановитьПараметр("Источник", ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("КодыМерныхЕдиницИзмерения", КодыМерныхЕдиницИзмерения);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТаблицы = ТаблицаНоменклатуры[ВыборкаДетальныеЗаписи.ИндексСтроки];
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

// Определяет наличие в базе данных номенклатуры, относящейся к любой из подсистем БГосИС.
// Используется в обработчике обновления перехода на конструктор настроек видов продукции для определения необходимости
// загрузки классификатора настроек из макета в случае, если ФО использования подсистемы отключена, но номенклатура в базе данных существует и должна быть конвертирована на конструктор настроек.
// 
// Параметры:
//  ЕстьНоменклатура - Булево - Есть номенклатура любой из подсистем БГосИС
Процедура ПриОпределенииНаличияНоменклатурыДляПереходаНаКонструкторНастроекВидовПродукции(ЕстьНоменклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.УдалитьВидПродукцииИС <> &ВидПродукцииИС";
	
	Запрос.УстановитьПараметр("ВидПродукцииИС", Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЕстьНоменклатура = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
