#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокРесурсов, "Недействителен", Ложь, , ,
		Истина);
		
	РаботаСОтборами.ОпределитьОтображениеПравойПанели(ЭтотОбъект);

	СписокРесурсов.Параметры.УстановитьЗначениеПараметра("ТекущийВидРесурса", ПредопределенноеЗначение(
		"Справочник.ВидыРесурсовПредприятия.ВсеРесурсы"));

	Элементы.ГруппаСписокВидовРесурсовОбщий.Видимость = Истина;
	Элементы.ГруппаРазвернуть.Видимость = Ложь;


	ЗаполнитьВидыРесурсов();

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_ВидыРесурсовПредприятия" Тогда

		ОбновитьСписокРесурсов();

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияРазвернутьНажатие(Элемент)

	Элементы.ГруппаСписокВидовРесурсовОбщий.Видимость = Истина;
	Элементы.ГруппаРазвернуть.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСвернутьНажатие(Элемент)

	Элементы.ГруппаСписокВидовРесурсовОбщий.Видимость = Ложь;
	Элементы.ГруппаРазвернуть.Видимость = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	СвернутьРазвернутьПанельОтборов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРесурсов

&НаКлиенте
Процедура СписокРесурсовПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура СписокРесурсовПриНаведении(Элемент, Строка, Поле)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокВидовРесурсов

&НаКлиенте
Процедура СписокВидовРесурсовПриАктивизацииСтроки(Элемент)

	ОбновитьСписокРесурсов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВидыРесурсов

&НаКлиенте
Процедура ТаблицаВидыРесурсовПриАктивизацииСтроки(Элемент)
	ОбновитьСписокРесурсов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРесурс(Команда)

	ВидРесурса = ?(Не Элементы.ТаблицаВидыРесурсов.ТекущиеДанные = Неопределено,
		Элементы.ТаблицаВидыРесурсов.ТекущиеДанные.Ссылка, Неопределено);

	ПараметрыОткрытия = Новый Структура("ВидРесурса", ВидРесурса);
	ОткрытьФорму("Справочник.КлючевыеРесурсы.ФормаОбъекта", ПараметрыОткрытия);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьВидРесурса(Команда)

	ТекСтрока = Элементы.ТаблицаВидыРесурсов.ТекущиеДанные;

	ТекРесурс = ?(Не ТекСтрока = Неопределено, ТекСтрока.ссылка, Неопределено);

	ПараметрыОповещения = Новый Структура("ТекРесурс", ТекРесурс);
	Оповещение = Новый ОписаниеОповещения("ОбновитьДанныеФормы", ЭтотОбъект, ПараметрыОповещения);

	ПараметрыОткрытия = Новый Структура;
	ОткрытьФорму("Справочник.ВидыРесурсовПредприятия.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидРесурса(Команда)

	ТекСтрока = Элементы.ТаблицаВидыРесурсов.ТекущиеДанные;

	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли
	;

	ТекРесурс = ТекСтрока.ссылка;

	ПараметрыОповещения = Новый Структура("ТекРесурс", ТекРесурс);
	Оповещение = Новый ОписаниеОповещения("ОбновитьДанныеФормы", ЭтотОбъект, ПараметрыОповещения);

	ПараметрыОткрытия = Новый Структура("Ключ", ТекРесурс);
	ОткрытьФорму("Справочник.ВидыРесурсовПредприятия.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНедействительную(Команда)

	Элементы.ПоказыватьНедействительную.Пометка = Не Элементы.ПоказыватьНедействительную.Пометка;
	УстановитьОтборНедействительная(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)

	СвернутьРазвернутьПанельОтборов();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьВидыРесурсов()

	ТаблицаВидыРесурсов.Очистить();

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыРесурсовПредприятия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыРесурсовПредприятия КАК ВидыРесурсовПредприятия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыРесурсовПредприятия.Наименование";

	ТаблицаВидыРесурсов.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокРесурсов()

	ТекСтрока = Элементы.ТаблицаВидыРесурсов.ТекущиеДанные;

	Если ТекСтрока <> Неопределено Тогда
		СписокРесурсов.Параметры.УстановитьЗначениеПараметра("ТекущийВидРесурса", ТекСтрока.Ссылка);
		ВидРесурса = ТекСтрока.Ссылка;
	Иначе
		СписокРесурсов.Параметры.УстановитьЗначениеПараметра("ТекущийВидРесурса", ПредопределенноеЗначение(
			"Справочник.ВидыРесурсовПредприятия.ВсеРесурсы"));
		ВидРесурса = ПредопределенноеЗначение("Справочник.ВидыРесурсовПредприятия.ВсеРесурсы");
	КонецЕсли;

	Если ВидРесурса = ПредопределенноеЗначение("Справочник.ВидыРесурсовПредприятия.ВсеРесурсы") Тогда
		КоличествоФильтровИндекс = 0;
		ДанныеМеток.Очистить();
	Иначе
		КоличествоФильтровИндекс = 1;
		ДанныеМеток.Очистить();
		ДанныеМеток.Добавить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеФормы(Результат, ПараметрыОповещения) Экспорт

	ЗаполнитьВидыРесурсов();

	Если Не ПараметрыОповещения.ТекРесурс = Неопределено Тогда

		ПараметрыОтбора = Новый Структура("Ссылка", ПараметрыОповещения.ТекРесурс);
		НайденныеСтроки = ТаблицаВидыРесурсов.НайтиСтроки(ПараметрыОтбора);

		Элементы.ТаблицаВидыРесурсов.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();

	КонецЕсли;

	ОбновитьСписокРесурсов();

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	ИнтерфейсТакси = Не (ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85());
	Элементы.ИндексФильтры.Видимость = Не ИнтерфейсТакси;
	Элементы.ИндексФильтрыТакси.Видимость = ИнтерфейсТакси;
	Если ИнтерфейсТакси Тогда
		Элементы.Переместить(Элементы.ГруппаКнопокПоказатьНедействительную, Элементы.ФормаКоманднаяПанель);
	КонецЕсли;

	НовоеУсловноеОформление = СписокРесурсов.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Недействителен", Истина, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, "Наименование");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Серый50УНФ); 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборНедействительная(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокРесурсов, "Недействителен", Ложь, , , Не Форма.Элементы.ПоказыватьНедействительную.Пометка);

КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = Не Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, СписокРесурсов);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, СписокРесурсов, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, СписокРесурсов);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
