#Область ОписаниеПеременных

&НаКлиенте
Перем КопированиеСтрокиЗапасы;

&НаКлиенте
Перем КопированиеСтрокиРасходы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Если Справочники.Организации.ЭтоЮрЛицо(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru = 'Этот документ доступен только для физ. лиц'");
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.КлючДанных = Объект.Ссылка;
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(
		Метаданные.Документы.РасходыПредпринимателя.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиУНФ.ЗаполнитьДополнительныеПараметры(Объект,
		"ГруппаДополнительныеРеквизиты", , , , ПоложениеЗаголовкаЭлементаФормы.Лево);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьУсловноеОформлениеФормы();
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
	ДоступенОрдерныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныйСклад");
	
	Если КэшЗначений = Неопределено Тогда
		КэшЗначений = Новый Структура;
	КонецЕсли;
	
	НаборСвойств_Документ_РасходыПредпринимателя = УправлениеСвойствами.НаборСвойствПоИмени("Документ_РасходыПредпринимателя");
	КэшЗначений.Вставить("НаборСвойств_Документ_РасходыПредпринимателя", НаборСвойств_Документ_РасходыПредпринимателя);
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	ОснованиеСоздания = Параметры.Основание;
	ДатаПриСозданииНаСервере = Объект.Дата;
	
	Компания = Константы.УчетПоКомпании.Компания(Объект.Организация);
	НациональнаяВалюта = Константы.НациональнаяВалюта.Получить();
	НациональнаяВалютаКурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НациональнаяВалюта, ДатаДокумента);
	КурсНациональнаяВалюта = НациональнаяВалютаКурсКратность.Курс;
	КратностьНациональнаяВалюта = НациональнаяВалютаКурсКратность.Кратность;
	ВалютаРасчетов = НациональнаяВалюта;
	ИспользоватьПроекты = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПодходящееОснованиеДляЗаполненияНДС = Не ЗначениеЗаполнено(Параметры.Основание);
		Если ПодходящееОснованиеДляЗаполненияНДС
			И Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования)
			И Не ЗаполнениеОбъектовУНФ.ЭтоЗаполнениеПоШаблону(Параметры.ЗначенияЗаполнения) Тогда
			ЗаполнитьСтавкуНДСПоОрганизацииНалогообложениеНДС(Истина);
			НалогиУНФ.ЗаполнитьНДСВключенВСтоимостьВДокументе(Объект);
		КонецЕсли;
		
		ДокументыУНФ.ПолучитьНастройкиБыстрыхФорм(ЭтотОбъект);
		
	КонецЕсли;
	
	// Обновим подвал формы.
	ИтогВсего = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего");
	ИтогСуммаНДС = Объект.Запасы.Итог("СуммаНДС") + Объект.Расходы.Итог("СуммаНДС");
	
	// Сформируем надпись цены и валюты.
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	
	ЦеныИВалюта = ЦеныИВалютаКлиентСервер.ТекстНадписиЦеныИВалюта(Объект, ВалютаРасчетов, КурсНациональнаяВалюта,
		УчетВалютныхОпераций);
	
	ЭтоНовыйОбъект = ЗначениеЗаполнено(Объект.Ссылка);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		УчетОстатковПоСкладскимОрдерам = УчетОстатковВРазрезеСкладскихОрдеров();
		
	КонецЕсли;
	
	ПоказыватьКолонкуСодержаниеВПриходнойНакладнойЗапасы = ПерсональныеНастройкиРУНФ.Прочитать(
		"ПоказыватьКолонкуСодержаниеВПриходнойНакладнойЗапасы");
	ПоказыватьКолонкуСодержаниеВПриходнойНакладнойРасходы = ПерсональныеНастройкиРУНФ.Прочитать(
		"ПоказыватьКолонкуСодержаниеВПриходнойНакладнойРасходы");
			
	УстановитьВидимостьИДоступность(ЭтоНовыйОбъект);
	
	ОсновнойСклад = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойСклад", , ,
		Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	
	ОсновноеПодразделение = ПерсональныеНастройкиРУНФ.Прочитать("ОсновноеПодразделение", , ,
		Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	
	КонтрольНаСкладеОтключен = НЕ Константы.КонтролироватьОстаткиПриПроведении.Получить();
	
	КэшЗначений.Вставить("МодифицированностьФормы", Ложь);
	КэшЗначений.Вставить("ОбрабатываемыеРеквизиты", Новый Массив);
	КэшЗначений.Вставить("Заказы", Новый Соответствие);
	ОбновитьВидимостьПоляЗаказыПокупателей(ЭтотОбъект);
	
	// Ячейки
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КэшЗначений.Вставить("УчетПоЯчейкам", ПолучитьФункциональнуюОпцию("УчетПоЯчейкам"));
		ОбновитьДоступностьЯчеек();
		ЗаполнитьПризнакиДоступностиЯчеек(ЭтотОбъект);
	КонецЕсли; 
	// Конец Ячейки
	
	// Документ основание.
	ТекстЗаголовка = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование);
	УстановитьЗаголовокНадписиОснование(ЭтотОбъект, ТекстЗаголовка);
	
	ЗаполнитьСписокДокументОснование();
	// Конец Документ основание.
	
	// КопированиеСтрокТабличныхЧастей
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, ИмяТЧЗапасы());
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, ИмяТЧРасходы());
	
	АвтоподборКонтактов.ПодключитьОбработчикиСобытияАвтоподбор(ЭтотОбъект);
	// Доставка
	УстановитьВидимостьДанныхПоДоставке();

	// ГрупповоеИзменениеСтрок
	ЗаполнитьСписокДействий(ИмяТЧЗапасы());
	// Конец ГрупповоеИзменениеСтрок
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// Серии номенклатуры
	ИспользоватьСерииНоменклатурыОстатки = СерииНоменклатурыУНФ.ИспользоватьСерииНоменклатурыОстатки();
	Элементы.ЗапасыГруппаСерииНоменклатуры.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	
	// МобильноеПриложение
	НастроитьЭлементыМобильноеПриложение();
	// Конец МобильноеПриложение
	
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
	
	Если Параметры.Ключ.Пустая() Тогда
		НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект, Истина);
		
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	РазрешитьСкладыВТабличныхЧастях = ПолучитьФункциональнуюОпцию("РазрешитьСкладыВТабличныхЧастях");
	
	МобильныйКлиентУНФ.НастроитьФормуОбъектаМобильныйКлиент(Элементы, "Запасы,Расходы");
	
	Если Объект.Расходы.Количество() > 0 И Объект.Запасы.Количество() = 0 Тогда
		Элементы.страницы.ТекущаяСтраница = Элементы.ГруппаРасходы;
	КонецЕсли; 
	
	СтруктураВыбораНоменклатуры = Новый Структура("Характеристика, Партия");
	
	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);
		
	ИспользоватьМногофирменныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Если Не ИспользоватьМногофирменныйУчет И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Организация.Гиперссылка = Истина;
	КонецЕсли;
	
	АдаптацияФормыТакси();

	УстановитьСвойстваСвернутогоПодвала();
	
	УчетКассовыхЧековПодотчетныхЛиц.НастроитьФорму(
		ЭтотОбъект,
		ОписаниеДокументаДляЗагрузкиКассовыхЧековПодотчетныхЛиц());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
	"СоздатьНаОсновании.РасходыПредпринимателя",
	ВладелецФормы,
	ОснованиеСоздания);
	
	// ГрупповоеИзменениеСтрок
	ОпределитьОбъектИзменений(ИмяТЧЗапасы());
	ОпределитьОбъектИзменений(ИмяТЧРасходы());
	// Конец ГрупповоеИзменениеСтрок
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ТребуетсяИзменениеНалогообложениеНаСНДС Тогда
		РаботаСНоменклатуройКлиентУНФ.ВывестиОповещениеПользователяОбИзмененииРежимаНалогообложенияНаСДНС(
			ТребуетсяИзменениеНалогообложениеНаСНДС);
	КонецЕсли;
	
	УчетКассовыхЧековПодотчетныхЛицКлиент.ПодключитьСканерШтрихкода(ЭтотОбъект);
	УчетКассовыхЧековПодотчетныхЛицКлиент.ПодключитьОбновлениеЧековКЗагрузке(
		ЭтотОбъект,
		ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц());
		
	Если ЗначениеЗаполнено(Параметры.ДобавитьДокументПодотчетногоЛица) Тогда
		
		Модифицированность = Истина;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы["Группа" + Параметры.ДобавитьДокументПодотчетногоЛица.ИмяСписка];
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ЗаполнитьСодержимымКассовыхЧеков", 
			ЭтотОбъект, 
			Новый Структура("ИмяСписка, СуммаВключаетНДС", Параметры.ДобавитьДокументПодотчетногоЛица.ИмяСписка, Объект.СуммаВключаетНДС));
		
		УчетКассовыхЧековПодотчетныхЛицКлиент.ДобавитьЧекиВДокумент(
			ЭтотОбъект,
			ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц(),
			ОписаниеОповещения,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры.ДобавитьДокументПодотчетногоЛица.Ссылка));
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	УчетКассовыхЧековПодотчетныхЛицКлиент.ОтключитьСканерШтрихкода(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьДокументИБПослеЗаполнения" Тогда
		
		Прочитать();
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		// Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		АдресЗапасовВХранилище	= Параметр;
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаЗапасы Тогда
			ИмяТабличнойЧасти = ИмяТЧЗапасы();
		Иначе
			ИмяТабличнойЧасти = ИмяТЧРасходы();
		КонецЕсли;
		
		Если ЗапрашиватьОбъединениеСтрок Тогда
			
			МассивНомеровИдентичныхСтрок = НомераИдентичныхСтрокВТабличнойЧасти(АдресЗапасовВХранилище, ИмяТабличнойЧасти);
			
			Если МассивНомеровИдентичныхСтрок.Количество() Тогда
				ДопПараметр = Новый Структура("ЭтоПодбор, АдресЗапасовВХранилище", Истина, АдресЗапасовВХранилище);
				ИмяПроцедурыЗавершения = ИмяТабличнойЧасти + "ПодтверждениеСбросаКоличестваЗавершение";
				Оповещение = Новый ОписаниеОповещения(ИмяПроцедурыЗавершения, ЭтотОбъект, ДопПараметр);
				ОткрытьФорму("ОбщаяФорма.ПодтверждениеОбъединенияСтрокПриДобавленииВТабличнуюЧасть", , , , , , Оповещение);
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПараметрыПолученияЗапасовИзХранилища = НовыеПараметрыПолученияЗапасовИзХранилища(АдресЗапасовВХранилище,
			ИмяТабличнойЧасти);
		
		ПараметрыПолученияЗапасовИзХранилища.МассивНомеровИдентичныхСтрок = Новый Массив;
		ПараметрыПолученияЗапасовИзХранилища.МассивНомеровДобавленныхСтрок = Новый Массив;
		
		ПолучитьЗапасыИзХранилища(ПараметрыПолученияЗапасовИзХранилища);
		
		РаботаСНоменклатуройКлиентУНФ.ВывестиОповещениеПользователяОбИзмененииРежимаНалогообложенияНаСДНС(ТребуетсяИзменениеНалогообложениеНаСНДС);
		
		Если ИмяТабличнойЧасти = ИмяТЧЗапасы() Тогда
			
			Для Каждого НомерСтроки Из ПараметрыПолученияЗапасовИзХранилища.МассивНомеровИдентичныхСтрок Цикл
				
				СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти][НомерСтроки];
				
				РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧЗапасы(), СтрокаТабличнойЧасти);
				СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ИмяТабличнойЧасти = ИмяТЧРасходы() Тогда 
			Для каждого СтрокаТаблицы Из Объект.Расходы Цикл 
				РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧРасходы(), СтрокаТаблицы);
			КонецЦикла;
		Иначе
			
			Для Каждого НомерДобавленнойСтроки Из ПараметрыПолученияЗапасовИзХранилища.МассивНомеровДобавленныхСтрок Цикл
				
				СтрокаТаблицы = Объект.Запасы[НомерДобавленнойСтроки];
				
				ВыполнитьОбработкуТабличнойЧастиПослеПодбора(ИмяТЧЗапасы(), СтрокаТаблицы);
				//@skip-check query-in-loop
				СтрокаТаблицы.ЯчейкаДоступна = ЯчейкаДоступна(СтрокаТаблицы.СтруктурнаяЕдиница);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ОбновитьПодвалФормы();
		
	ИначеЕсли ИмяСобытия = "ПодборСерий"
		И ЗначениеЗаполнено(Параметр) 
		// Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		ИзменилосьКоличество = ПолучитьСерииНоменклатурыИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		Если ИзменилосьКоличество Тогда
			РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧЗапасы());
		КонецЕсли; 
		
	КонецЕсли;
	
	// КопированиеСтрокТабличныхЧастей
	Если ИмяСобытия = "БуферОбменаТабличнаяЧастьКопированиеСтрок" Тогда
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, ИмяТЧЗапасы());
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, ИмяТЧРасходы());
	КонецЕсли;
	
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "ИзменениеСуммыСтроки" Тогда
		ОбновитьПодвалФормы();
	КонецЕсли;

	Если ИмяСобытия = "ИзменитьВыделенные_Применить" И Параметр.Владелец = ЭтотОбъект Тогда
		ОбработатьИзменениеСтрок(Параметр.Действие, Параметр.Значение, Параметр.ИмяТЧ);
	КонецЕсли;
	
	Если Источник = "ПодключаемоеОборудование" Тогда
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаРасходы Тогда
			ИмяСписка = "Расходы";
		Иначе
			ИмяСписка = "Запасы";
		КонецЕсли;
		
		УчетКассовыхЧековПодотчетныхЛицКлиент.ОбработатьОтветСканера(
			ЭтотОбъект,
			ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц(),
			ИмяСобытия,
			Параметр,
			ИмяСписка,
			Объект.СуммаВключаетНДС);
			
	ИначеЕсли ИмяСобытия = "ПолучениеДанныхЧековЗагруженныхАппаратнымСканером" И Источник = ЭтотОбъект Тогда
		
		ПолучениеДанныхЧековЗагруженныхАппаратнымСканером(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ДоступенОрдерныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныйСклад");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Ячейки
	Если ТипЗнч(КэшЗначений) <> Тип("Структура") Тогда
		КэшЗначений = Новый Структура;
	КонецЕсли;
	КэшЗначений.Вставить("УчетПоЯчейкам", ПолучитьФункциональнуюОпцию("УчетПоЯчейкам"));
	ОбновитьДоступностьЯчеек();
	ЗаполнитьПризнакиДоступностиЯчеек(ЭтотОбъект);
	// Конец Ячейки
	
	УчетОстатковПоСкладскимОрдерам = УчетОстатковВРазрезеСкладскихОрдеров();
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	СтруктураВыбораНоменклатуры = Новый Структура("Характеристика, Партия");
	
	Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование);
	
	ДокументыУНФ.ПолучитьНастройкиБыстрыхФорм(ЭтотОбъект);
		
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		КлючеваяОперация = СтрШаблон("Проведение%1",
			РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
	КэшЗначений.МодифицированностьФормы = Модифицированность;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НоменклатураВДокументахКлиент.ПроверитьТабличнуюЧастьНаЗапретДробныхЗначений(Объект,, Отказ);
		НоменклатураВДокументахКлиент.ПроверитьТабличнуюЧастьНаЗапретДробныхЗначений(Объект,"Расходы", Отказ);
	Иначе
		НоменклатураВДокументахКлиент.ПроверитьТабличнуюЧастьНаЗапретДробныхЗначений(Объект);
		НоменклатураВДокументахКлиент.ПроверитьТабличнуюЧастьНаЗапретДробныхЗначений(Объект,"Расходы");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ТаблицаДокументовДляИзменения", ТаблицаДокументовДляИзменения);
	
	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Обработчик механизма "Свойства"
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("МодифицированностьВФорме",Модифицированность);
	// Конец Обсуждения
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	//Ячейки
	ОбновитьДоступностьЯчеек();
	ЗаполнитьПризнакиДоступностиЯчеек(ЭтотОбъект);
	// Конец Ячейки
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	АссистентУправления.ПослеЗаписиНаСервере(ТекущийОбъект);
	
	//Обсуждения
	ОбсужденияУНФ.ПослеЗаписиНаСервере(ТекущийОбъект);	
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УчетКассовыхЧековПодотчетныхЛиц.ПрочитатьКассовыеЧекиПодотчетныхЛиц(
		ЭтотОбъект,
		ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц());
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Оповестить("ОбновитьСписокДокументовКПоступлению");
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.ОтчетКомиссионера.Форма.ФормаПодбораПоОстаткам" Тогда
		
		ИдентификаторыНовыхСтрок = Новый Массив;
		ПолучитьЗапасыИзХранилищаКомиссия(ВыбранноеЗначение, ИдентификаторыНовыхСтрок);
		
		ПараметрыРасчета = Новый Структура("РассчитатьЦену", Истина);
		
		Для Каждого ИдентификаторСтроки Из ИдентификаторыНовыхСтрок Цикл
			
			СтрокаТабличнойЧасти = Объект.Запасы.НайтиПоИдентификатору(ИдентификаторСтроки);
			
			Если СтрокаТабличнойЧасти = Неопределено Тогда Продолжить КонецЕсли;
			
			РассчитатьСуммуВСтрокеТабличнойЧасти("Запасы", СтрокаТабличнойЧасти, ПараметрыРасчета);
			
		КонецЦикла;
		
		Модифицированность = Истина;
		ОбновитьВидимостьПоляЗаказыПокупателей(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДанныеДляИзмененияДаты = ДокументыУНФКлиент.ДанныеДляИзмененияДаты(ЭтотОбъект, Объект);
	Если ДанныеДляИзмененияДаты.ДатаНеМенялась Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты);
	
	ЦеныИВалютаКлиент.ПересчитатьКурсКратностьВалютыРасчетов(ДанныеДляИзмененияДаты.ВалютаКурсКратность, Объект,
		ЭтотОбъект);
	
	ЦеныИВалюта = ЦеныИВалютаКлиентСервер.ТекстНадписиЦеныИВалюта(Объект, ВалютаРасчетов, КурсНациональнаяВалюта,
		УчетВалютныхОпераций);
		
	ОбновитьСрокОтправкиУведомлений = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	ЗаполнитьСтавкуНДСПоОрганизацииНалогообложениеНДС();
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
	КонецЦикла;
	
	УчетОстатковПоСкладскимОрдерам = УчетОстатковВРазрезеСкладскихОрдеров();
	
	ЦеныИВалюта = ЦеныИВалютаКлиентСервер.ТекстНадписиЦеныИВалюта(Объект, ВалютаРасчетов, КурсНациональнаяВалюта,
		УчетВалютныхОпераций);
	
	ЗаполнитьПризнакиИспользованияСерийПриИзмененииКлючевыхРеквизитов();
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаПриИзменении(Элемент)
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		СтрокаТабличнойЧасти.Ячейка = Объект.Ячейка;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьРасходыВСебестоимостьПриИзменении(Элемент)
	
	Если Объект.ВключатьРасходыВСебестоимость Тогда
		Элементы.Расходы.ПодчиненныеЭлементы.РасходыСтруктурнаяЕдиница.Видимость = Ложь;
		Элементы.Расходы.ПодчиненныеЭлементы.РасходыНаправлениеДеятельности.Видимость = Ложь;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСуммаРасходов.Видимость = Истина;
	Иначе
		Элементы.Расходы.ПодчиненныеЭлементы.РасходыСтруктурнаяЕдиница.Видимость = Истина;
		Элементы.Расходы.ПодчиненныеЭлементы.РасходыНаправлениеДеятельности.Видимость = Истина;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСуммаРасходов.Видимость = Ложь;
		Для каждого СтрокаЗапасы Из Объект.Запасы Цикл
			СтрокаЗапасы.СуммаРасходов = 0;
		КонецЦикла;
		Для каждого СтрокаРасходы Из Объект.Расходы Цикл
			СтрокаРасходы.СтруктурнаяЕдиница = ОсновноеПодразделение;
			СтрокаРасходы.ЗаказПокупателя = ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка");
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьВидимостьПоляЗаказыПокупателей(ЭтотОбъект);
	
КонецПроцедуры // ВключатьРасходыВСебестоимостьПриИзменении()

&НаКлиенте
Процедура РедактироватьЦеныИВалюту(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзмененияПоКнопкеЦеныИВалюты(Объект.ВалютаДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНадписьНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ВыбратьОснование();
	Иначе
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоСсылке(Объект.ДокументОснование);
	КонецЕсли;
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтборПоДублямОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.Запасы.ОтборСтрок = Неопределено;
	Элементы.ЗапасыКонтекстноеМенюПоказатьДублиСтроки.Пометка = Ложь;
	Элементы.ДекорацияОтборПоДублям.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийСвернутоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаЗакрытьБаннерЧекиПодотчетныхЛицНажатие(Элемент)
	
	УчетКассовыхЧековПодотчетныхЛицКлиент.СкрытьБаннер(ЭтотОбъект, ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц());
	
КонецПроцедуры

&НаКлиенте
Процедура БаннерПодключенАппаратныйСканерЗакрытьНажатие(Элемент)
	
	УчетКассовыхЧековПодотчетныхЛицКлиент.СкрытьБаннерПодключенАппаратныйСканер(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БаннерЧекиПодотчетныхЛицТекстОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура ЗапасыПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекстСообщения = НСтр("ru = 'Для выбора партии необходимо заполнить номенклатуру'");
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.КлючДанных = Объект.Ссылка;
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	Владелец = Новый Структура("Владелец",ТекущиеДанные.Номенклатура);
	
	ПараметрыВыбораПартии = Новый Структура();
	ПараметрыВыбораПартии.Вставить("Отбор", Владелец);
	ПараметрыВыбораПартии.Вставить("РежимВыбора", Истина);
	ПараметрыВыбораПартии.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаСписка",ПараметрыВыбораПартии, Элемент,,,,,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТабличнойЧасти = Элемент.ТекущиеДанные;
	
	Если НоваяСтрока И Копирование Тогда
		СтрокаТабличнойЧасти.КлючСвязи = 0;
		СтрокаТабличнойЧасти.СерииНоменклатуры = "";
		СтрокаТабличнойЧасти.ИдентификаторСтроки = "";
		СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ЗаполнениеОбъектовУНФКлиент.ЗаполнитьСтрокуПоШапке(СтрокаТабличнойЧасти, Объект, "СтруктурнаяЕдиница", "ПоложениеСклада");
		ЗаполнениеОбъектовУНФКлиент.ЗаполнитьСтрокуПоШапке(СтрокаТабличнойЧасти, Объект, "Ячейка", "ПоложениеСклада");
	КонецЕсли; 
	
	Если Элемент.ТекущийЭлемент = Элементы.ЗапасыСерииНоменклатуры Тогда
		ОткрытьПодборСерииНоменклатуры();
	КонецЕсли;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		СтрокаТабличнойЧасти.Количество = НовоеКоличествоПриИзмененииНоменклатуры;
	КонецЕсли;
		
	ЭтоНоваяСтрокаЗапасы = НоваяСтрока;
	
	УчетКассовыхЧековПодотчетныхЛицКлиент.ПриНачалеРедактированияОчиститьЧек(Элемент, Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	
	Если КопированиеСтрокиЗапасы = Неопределено ИЛИ НЕ КопированиеСтрокиЗапасы Тогда
		ОбновитьПодвалФормы();
	Иначе
		КопированиеСтрокиЗапасы = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		ИтогВсего = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего")
			+ Элемент.ТекущиеДанные.Всего;
		ИтогСуммаНДС = Объект.Запасы.Итог("СуммаНДС")
			+ Объект.Расходы.Итог("СуммаНДС") + Элемент.ТекущиеДанные.СуммаНДС;
		КопированиеСтрокиЗапасы = Истина;
	КонецЕсли;
	
КонецПроцедуры // ЗапасыПередНачаломДобавления()

&НаКлиенте
Процедура ЗапасыПередУдалением(Элемент, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Серии номенклатуры
	Для каждого ВыделеннаяСтрока Из Элементы.Запасы.ПолучитьСтрокиДляОбработки() Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		
		СерииНоменклатурыУНФКлиентСервер.УдалитьСерииНоменклатурыПоКлючуСвязи(Объект.СерииНоменклатуры,
			ТекущиеДанныеСтроки,
			ИспользоватьСерииНоменклатурыОстатки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьСбросКоличества И СбрасыватьКоличество
		И СтрокаТабличнойЧасти.Количество <> НовоеКоличествоПриИзмененииНоменклатуры Тогда
		
		ДопПараметр = Новый Структура();
		ДопПараметр.Вставить("Элемент", Элемент);
		ДопПараметр.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		Оповещение = Новый ОписаниеОповещения("ЗапасыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
		ОткрытьФорму("ОбщаяФорма.ПодтверждениеСбросаКоличества", , , , , , Оповещение);
		
	Иначе
		
		Если СбрасыватьКоличество Тогда
			НовоеКоличество = НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		ЗапасыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество);
		
	КонецЕсли;
	
КонецПроцедуры // ЗапасыНоменклатураПриИзменении()

&НаКлиенте
Процедура ЗапасыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("БыстроеСоздание") Тогда
			БыстрыеФормыУНФКлиент.ОткрытьБыструюФормуНоменклатуры(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
			Возврат
		КонецЕсли;
		
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		
		ПодборНоменклатурыИзСписка = ВыбранноеЗначение.Свойство("Ячейка");
		
		Если НЕ ТипЗнч(СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
			СтруктураВыбораНоменклатуры = Новый Структура("Характеристика, Партия");
		КонецЕсли;
		
		СтруктураВыбораНоменклатуры.Характеристика = ВыбранноеЗначение.Характеристика;
		СтруктураВыбораНоменклатуры.Партия = ВыбранноеЗначение.Партия;
		
		Если ВыбранноеЗначение.Свойство("СтруктураНастроек") Тогда
			НоменклатураВДокументахКлиентСервер.ЗаполнитьТаблицуНастроекФормыВыбораНоменклатуры(ЭтотОбъект, "РасходыПредпринимателя",
				НастройкиФормыВыбораНоменклатуры, Истина, ИмяТЧЗапасы(), ВыбранноеЗначение.СтруктураНастроек);
		КонецЕсли;
		
		Если РазрешитьСкладыВТабличныхЧастях Тогда
			Если Объект.ПоложениеСклада = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти")
				Или Объект.СтруктурнаяЕдиница = ВыбранноеЗначение.Склад
				Или Не ЗначениеЗаполнено(ВыбранноеЗначение.Склад) Тогда
				
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыбранноеЗначение);
				
				Если СтрокаТабличнойЧасти.Свойство("СтруктурнаяЕдиница") Тогда
					СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ВыбранноеЗначение.Склад;
				КонецЕсли;
				
				НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтотОбъект, ИмяТЧЗапасы());
			ИначеЕсли ЗначениеЗаполнено(ВыбранноеЗначение.Склад) И Не Объект.СтруктурнаяЕдиница = ВыбранноеЗначение.Склад Тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				ПараметрыОповещения = ВыбранноеЗначение;
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСкладВТЧ", ЭтотОбъект, ПараметрыОповещения);
				ПоказатьВопрос(Оповещение, НСтр("ru = 'Выбранный склад отличен от склада в шапке. Отобразить склад в табличной части?'"), Режим, 0);
				СтандартнаяОбработка = Ложь;
				Возврат;
			Иначе
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыбранноеЗначение);
				НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтотОбъект, ИмяТЧЗапасы());
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыбранноеЗначение);
			НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтотОбъект, ИмяТЧЗапасы());
		КонецЕсли;
		
		ВыбранноеЗначение = ВыбранноеЗначение.Номенклатура;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуНоменклатурыВДокументах Тогда
		Возврат
	КонецЕсли;
	
	БыстрыеФормыУНФКлиент.НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуНоменклатурыВДокументах Тогда
		Возврат
	КонецЕсли;
	
	БыстрыеФормыУНФКлиент.НоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыХарактеристикаПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;

	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);

	СтруктураДанные = ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	СтрокаТабличнойЧасти.Содержание = "";
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧЗапасы());

КонецПроцедуры // ЗапасыХарактеристикаПриИзменении()

&НаКлиенте
Процедура ЗапасыСодержаниеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		ШаблонСодержания = ТекстСодержания(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Характеристика);
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ШаблонСодержания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧЗапасы());
	
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда Возврат КонецЕсли;
	СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ЕдиницаИзмерения = ВыбранноеЗначение
		Или СтрокаТабличнойЧасти.Цена = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКоэффициент = 0;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущийКоэффициент = 1;
	КонецЕсли;
	
	Коэффициент = 0;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	Если ТекущийКоэффициент = 0 И Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения, ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	ИначеЕсли Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(,ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 1 И Коэффициент = 1 Тогда
		СтруктураДанные = Новый Структура("ТекущийКоэффициент, Коэффициент", 1, 1);
	КонецЕсли;
	
	Если СтруктураДанные.ТекущийКоэффициент <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * СтруктураДанные.Коэффициент / СтруктураДанные.ТекущийКоэффициент;
	КонецЕсли;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧЗапасы());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧЗапасы());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	ПараметрыРасчета = Новый Структура("РассчитатьЦену", Истина);
	РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧЗапасы(), СтрокаТабличнойЧасти, ПараметрыРасчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	ТабличныеЧастиУНФКлиент.РассчитатьСуммуНДСИВсего(СтрокаТабличнойЧасти, Новый Структура("СуммаВключаетНДС",Объект.СуммаВключаетНДС));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
КонецПроцедуры // ЗапасыСуммаНДСПриИзменении()

&НаКлиенте
Процедура ЗапасыСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СодержаниеНачалоВыбора(Элемент, ИмяТЧЗапасы());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСтруктурнаяЕдиницаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЯчейкаДоступна = ЯчейкаДоступна(СтрокаТабличнойЧасти.СтруктурнаяЕдиница);
	НомерСтрокиТабличнойЧасти = Новый Структура("НомерСтроки", 0);
	ЗаполнитьЗначенияСвойств(НомерСтрокиТабличнойЧасти, СтрокаТабличнойЧасти);
	ОбновитьСтатусыСерийНоменклатурыВТабличнойЧасти(НомерСтрокиТабличнойЧасти.НомерСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриАктивизацииЯчейки(Элемент)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстанавливатьФорматРедактированияЗапретаДробногоКоличества = Истина;
	Если Не СбрасыватьКоличество Тогда
		УстанавливатьФорматРедактированияЗапретаДробногоКоличества = ТекущиеДанные.Количество = Цел(ТекущиеДанные.Количество);
	КонецЕсли;
	
	Если Не Элемент.ТекущийЭлемент = Неопределено И Элемент.ТекущийЭлемент.Имя = "ЗапасыКоличество" Тогда
		Элементы.ЗапасыКоличество.ФорматРедактирования = ?(ТекущиеДанные.ЗапретитьВводДробногоКоличества И УстанавливатьФорматРедактированияЗапретаДробногоКоличества, "ЧДЦ=0", "");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПометкаПриИзменении(Элемент)
	
	ПометкаПриИзмененииНаСервере("Запасы");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСерииНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерииНоменклатуры();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходы

&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	
	Если КопированиеСтрокиРасходы = Неопределено ИЛИ НЕ КопированиеСтрокиРасходы Тогда
		ОбновитьПодвалФормы();
	Иначе
		КопированиеСтрокиРасходы = Ложь;
	КонецЕсли;
	
КонецПроцедуры // РасходыПриИзменении()

&НаКлиенте
Процедура РасходыПриАктивизацииЯчейки(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	УстанавливатьФорматРедактированияЗапретаДробногоКоличества = Истина;
	Если Не СбрасыватьКоличество Тогда
		УстанавливатьФорматРедактированияЗапретаДробногоКоличества = СтрокаТабличнойЧасти.Количество = Цел(СтрокаТабличнойЧасти.Количество);
	КонецЕсли;
	
	Если Не Элемент.ТекущийЭлемент = Неопределено И Элемент.ТекущийЭлемент.Имя = "РасходыКоличество" Тогда
		Элементы.РасходыКоличество.ФорматРедактирования = ?(СтрокаТабличнойЧасти.ЗапретитьВводДробногоКоличества И УстанавливатьФорматРедактированияЗапретаДробногоКоличества, "ЧДЦ=0", "");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		ИтогВсего = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Элемент.ТекущиеДанные.Всего;
		ИтогСуммаНДС = Объект.Запасы.Итог("СуммаНДС") + Объект.Расходы.Итог("СуммаНДС") + Элемент.ТекущиеДанные.СуммаНДС;
		КопированиеСтрокиРасходы = Истина;
    КонецЕсли;
	
КонецПроцедуры // РасходыПередНачаломДобавления()

&НаКлиенте
Процедура РасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТабличнойЧасти = Элемент.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
		ОбновитьВидимостьПоляЗаказыПокупателей(ЭтотОбъект);
	КонецЕсли; 
	
	Если НоваяСтрока И НЕ Копирование Тогда
		СтрокаТабличнойЧасти.Количество = НовоеКоличествоПриИзмененииНоменклатуры;
	КонецЕсли;
	
	УчетКассовыхЧековПодотчетныхЛицКлиент.ПриНачалеРедактированияОчиститьЧек(Элемент, Копирование);
		
КонецПроцедуры

 // РасходыПриНачалеРедактирования()

&НаКлиенте
Процедура РасходыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьСбросКоличества И СбрасыватьКоличество
		И СтрокаТабличнойЧасти.Количество <> НовоеКоличествоПриИзмененииНоменклатуры Тогда
		
		ДопПараметр = Новый Структура();
		ДопПараметр.Вставить("Элемент", Элемент);
		ДопПараметр.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		Оповещение = Новый ОписаниеОповещения("РасходыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
		ОткрытьФорму("ОбщаяФорма.ПодтверждениеСбросаКоличества", , , , , , Оповещение);
		
	Иначе
		
		Если СбрасыватьКоличество Тогда
			НовоеКоличество = НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		РасходыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество);
		
	КонецЕсли;
		
КонецПроцедуры // РасходыНоменклатураПриИзменении()

&НаКлиенте
Процедура РасходыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("БыстроеСоздание") Тогда
			БыстрыеФормыУНФКлиент.ОткрытьБыструюФормуНоменклатуры(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
			Возврат
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуНоменклатурыВДокументах Тогда
		Возврат
	КонецЕсли;
	
	БыстрыеФормыУНФКлиент.НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуНоменклатурыВДокументах Тогда
		Возврат
	КонецЕсли;
	
	БыстрыеФормыУНФКлиент.НоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыСодержаниеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
		ШаблонСодержания = ТекстСодержания(СтрокаТабличнойЧасти.Номенклатура, Неопределено);
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ШаблонСодержания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧРасходы());
	
КонецПроцедуры // РасходыКоличествоПриИзменении()

&НаКлиенте
Процедура РасходыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ЕдиницаИзмерения = ВыбранноеЗначение
	 ИЛИ СтрокаТабличнойЧасти.Цена = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКоэффициент = 0;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущийКоэффициент = 1;
	КонецЕсли;
	
	Коэффициент = 0;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	Если ТекущийКоэффициент = 0 И Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения, ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	ИначеЕсли Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(,ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 1 И Коэффициент = 1 Тогда
		СтруктураДанные = Новый Структура("ТекущийКоэффициент, Коэффициент", 1, 1);
	КонецЕсли;
	
	Если СтруктураДанные.ТекущийКоэффициент <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * СтруктураДанные.Коэффициент / СтруктураДанные.ТекущийКоэффициент;
	КонецЕсли;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧРасходы());
	
КонецПроцедуры // РасходыЕдиницаИзмеренияОбработкаВыбора()

&НаКлиенте
Процедура РасходыЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧРасходы());
	
КонецПроцедуры // РасходыЦенаПриИзменении()

&НаКлиенте
Процедура РасходыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.Количество <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	ТабличныеЧастиУНФКлиент.РассчитатьСуммуНДСИВсего(СтрокаТабличнойЧасти, Новый Структура("СуммаВключаетНДС",Объект.СуммаВключаетНДС));
	
КонецПроцедуры // РасходыСуммаПриИзменении()

&НаКлиенте
Процедура РасходыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	ТабличныеЧастиУНФКлиент.РассчитатьСуммуНДСИВсего(СтрокаТабличнойЧасти, Новый Структура("СуммаВключаетНДС",Объект.СуммаВключаетНДС));
	
КонецПроцедуры // РасходыСтавкаНДСПриИзменении()

&НаКлиенте
Процедура РасходыСуммаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
КонецПроцедуры // РасходыСуммаНДСПриИзменении()

&НаКлиенте
Процедура РасходыНаправлениеДеятельностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеНаправлениеДеятельностиНачалоВыбора(СтрокаТабличнойЧасти.Номенклатура);
	
	Если НЕ СтруктураДанные.ВозможностьУказанияНаправленияДеятельности Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, НСтр("ru = 'Для данного расхода направление деятельности не указывается.'"));
	КонецЕсли;
	
КонецПроцедуры // РасходыНаправлениеДеятельностиНачалоВыбора()

&НаКлиенте
Процедура РасходыСтруктурнаяЕдиницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПроверитьВозможностьВыбораПодразделения(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыСтруктурнаяЕдиницаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПроверитьВозможностьВыбораПодразделения(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыЗаказПокупателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеЗаказНачалоВыбора(СтрокаТабличнойЧасти.Номенклатура);
	
	Если НЕ СтруктураДанные.ВозможностьУказанияЗаказа Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для этого расхода ЗаказПокупателя не указывается.'"));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СодержаниеНачалоВыбора(Элемент, ИмяТЧРасходы());
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыЗаказПокупателяПриИзменении(Элемент)
	Если Объект.ПоложениеПроекта = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти") Тогда
		Элементы.Расходы.ТекущиеДанные.Проект = ПроектИзЗаказа(Элементы.Расходы.ТекущиеДанные.ЗаказПокупателя);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапасыДобавитьИзДокумента(Команда)
	
	ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента");
	ОбработатьВыборДействия("Запасы");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьРасходыПоКоличеству(Команда)
	
	РаспределитьТабЧастьРасходыПоКоличеству();
	
КонецПроцедуры // РаспределитьРасходыПоКоличеству()

&НаКлиенте
Процедура РаспределитьРасходыПоСумме(Команда)
	
	РаспределитьТабЧастьРасходыПоСумме();
	
КонецПроцедуры // РаспределитьРасходыПоСумме()

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Документ будет полностью перезаполнен по ""Основанию"". Продолжить?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ШапкаТабличнаяЧасть(Команда)
	
	ОткрытьФормуНастройки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормы(Команда)
	
	ОткрытьФормуНастройки(Истина);
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаНастройкаФормы, "Нажатие");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСбросаКоличества(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтрокаПоиска", НСтр("ru = 'Сбрасывать количество при изменении номенклатуры'"));
	Оповещение = Новый ОписаниеОповещения("НастройкаСбросаКоличестваЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПерсональныеНастройки.Форма.ФормаНастройкиПользователя", СтруктураПараметров, , , , ,
		Оповещение);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, 
		Элементы.ЗапасыКонтекстноеМенюНастройкаСбросаКоличества, "Нажатие");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДополнительныйРеквизит(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", КэшЗначений.НаборСвойств_Документ_РасходыПредпринимателя);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта", ПараметрыФормы, , , , , ,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДублиСтроки(Команда)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтрокиТабличнойЧасти = Новый Структура("НомерСтроки", 0);
	ЗаполнитьЗначенияСвойств(НомерСтрокиТабличнойЧасти, СтрокаТабличнойЧасти);
	
	Если Элементы.Запасы.ОтборСтрок = Неопределено Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
		ПараметрыОтбора.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
		ПараметрыОтбора.Вставить("Партия", СтрокаТабличнойЧасти.Партия);
		
		НайденныеСтроки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() <= 1 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Дубли строки не найдены.'"), , "Объект.Запасы");
			Возврат;
		КонецЕсли;
		
		Элементы.Запасы.ОтборСтрок = Новый ФиксированнаяСтруктура(ПараметрыОтбора);
		Элементы.ЗапасыКонтекстноеМенюПоказатьДублиСтроки.Пометка = Истина;
		
		Элементы.ДекорацияОтборПоДублям.Заголовок = ИнформацияОбОтборе(
		СтрШаблон(НСтр("ru = 'Дубли строки %1'"), НомерСтрокиТабличнойЧасти.НомерСтроки));
		
		Элементы.ДекорацияОтборПоДублям.Видимость = Истина;
		
	Иначе
		Элементы.Запасы.ОтборСтрок = Неопределено;
		Элементы.ЗапасыКонтекстноеМенюПоказатьДублиСтроки.Пометка = Ложь;
		Элементы.ДекорацияОтборПоДублям.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"РазбитьСтрокуТабличнойЧастиЗавершение",
	ЭтотОбъект,
	СтрокаТабличнойЧасти);
	
	ПоказатьВводЧисла(ОписаниеОповещения,
	СтрокаТабличнойЧасти.Количество,
	НСтр("ru = 'Количество в новой строке'"),
	15, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПодбор(Команда)
	
	ИмяТабличнойЧасти	= ИмяТЧЗапасы();
	
	СтруктураПоискаПартииСНДС = Новый Структура("КомиссияСНДС", Истина);
	ЕстьПартииСНДС = Объект.Запасы.НайтиСтроки(СтруктураПоискаПартииСНДС).Количество() > 0;
	ПараметрыПодбора = Новый Структура("ЕстьПартииСНДС, ПолностьюОбновить", ЕстьПартииСНДС, Истина);
	
	ПодборНоменклатурыВДокументахКлиент.ОткрытьФормуПодбораНоменклатуры(ЭтотОбъект, ИмяТабличнойЧасти, ПараметрыПодбора);
	
КонецПроцедуры // ЗапасыПодбор()

&НаКлиенте
Процедура РасходыПодбор(Команда)
	
	ИмяТабличнойЧасти	= ИмяТЧРасходы();
	ПодборНоменклатурыВДокументахКлиент.ОткрытьФормуПодбораНоменклатуры(ЭтотОбъект, ИмяТабличнойЧасти);
	
КонецПроцедуры // ПодборВыполнить()

&НаКлиенте
Процедура СохранитьДокументКакШаблон(Параметр) Экспорт
	
	ЗаполнениеОбъектовУНФКлиент.СохранитьДокументКакШаблон(Объект, ОтображаемыеРеквизиты(), Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКопироватьСтроки(Команда)
	
	КопироватьСтроки(ИмяТЧЗапасы());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыВставитьСтроки(Команда)
	
	ВставитьСтроки(ИмяТЧЗапасы());
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКопироватьСтроки(Команда)
	
	КопироватьСтроки(ИмяТЧРасходы());
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыВставитьСтроки(Команда)
	
	ВставитьСтроки(ИмяТЧРасходы());
	
КонецПроцедуры

#Область ГрупповоеИзменениеСтрок

&НаКлиенте
Процедура ЗапасыСнятьФлажки(Команда)
	УстановитьПометку(ИмяТЧЗапасы(), Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыУстановитьФлажки(Команда)
	УстановитьПометку(ИмяТЧЗапасы(), Истина);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура РедактироватьКомментарий(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКомандыОснование(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКомандыОснования", ЭтотОбъект);
	
	КомандыОснования = Новый СписокЗначений;
	КомандыОснования.Добавить("Заполнить", НСтр("ru = 'Заполнить документ'"));
	КомандыОснования.Добавить("Выбрать", НСтр("ru = 'Выбрать основание'"));
	КомандыОснования.Добавить("Удалить", НСтр("ru = 'Удалить основание'"));
	ПоказатьВыборИзМеню(ОписаниеОповещения, КомандыОснования, Элементы.ОткрытьКомандыОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьКомандуИзменитьВыделенные(Команда)
	
	ИмяКоманды = Команда.Имя;
	ИмяТЧ = Лев(ИмяКоманды, СтрНайти(ИмяКоманды, "_") - 1);
	ИмяДействияКоманды = НРег(СтрЗаменить(ИмяКоманды, ИмяТЧ + "_ИзменитьВыделенные_", ""));
	
	СписокДействий = ЭтотОбъект["ДействияИзменить" + ИмяТЧ];
	Для каждого Действие Из СписокДействий Цикл
		ПредставлениеДействия = НРег(Действие.Представление);
		ПредставлениеДействия = СтрЗаменить(ПредставлениеДействия, " ", "");
		Если ИмяДействияКоманды = ПредставлениеДействия Тогда
			ЭтотОбъект[ИмяТЧ + "ИзменениеСтрокДействие"] = Действие.Значение;
			ОбработатьВыборДействия(ИмяТЧ);
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЧекиЗапасы(Команда)
	
	НачатьЗагрузкуКассовыхЧеков("Запасы");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЧекиРасходы(Команда)
	
	НачатьЗагрузкуКассовыхЧеков("Расходы");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УчетКассовыхЧековПодотчетныхЛиц.НастроитьОтображениеЗагруженныхЧеков(
		ЭтотОбъект,
		ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц());
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если Не ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ЗапасыУстановитьФлажки.Видимость = Истина;
	Элементы.ЗапасыИзменитьВыделенные.Видимость = Ложь;
	Элементы.ЗапасыПометка.Видимость = Истина;
	Элементы.ЗапасыПометка.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
	
	Элементы.ФормаСправка.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю;
	Элементы.Переместить(Элементы.ФормаСправка, Элементы.ФормаКоманднаяПанель);
	Элементы.ПодвалСвернут.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваСвернутогоПодвала()
	
	Если ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	ОпределяющиеЭлементы = "ПодвалПраво,СкидкиИтоги,Итоги,ЗапасыИтогСуммаНДС,ЗапасыИтогВсего";
	РаботаСФормойДокумента.УстановитьСвойстваСвернутогоПодвала(ЭтотОбъект, ОпределяющиеЭлементы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДействияИзменить(Действия, ИмяТЧ)
	
	СписокДействий = ЭтотОбъект["ДействияИзменить" + ИмяТЧ];
	СписокДействий.Очистить();
	
	ПрефиксКоманд = ИмяТЧ + "_ИзменитьВыделенные_";
	ПодменюИзменитьВыделенные = Элементы[ИмяТЧ + "ИзменитьВыделенные"];
	
	ЭлементыИзменитьВыделенные = ПодменюИзменитьВыделенные.ПодчиненныеЭлементы;
	Для Каждого ЭлементПодменю Из ЭлементыИзменитьВыделенные Цикл
		ЭлементПодменю.Видимость = Ложь;
	КонецЦикла;
	
	Для каждого Действие Из Действия Цикл
		
		Если Действие = Перечисления.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента Тогда
			Продолжить;
		КонецЕсли;
		
		ДействиеОписание = ГрупповоеИзменениеСтрокСервер.ПредставлениеДействия(Действие);
		Если ПустаяСтрока(ДействиеОписание) Тогда
			ДействиеОписание = Действие;
		КонецЕсли;
		Если ПустаяСтрока(ДействиеОписание) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокДействий.Добавить(Действие, ДействиеОписание);
		ИмяКоманды = ПрефиксКоманд + СтрЗаменить(ДействиеОписание, " ", "");
		
		Если Команды.Найти(ИмяКоманды) = Неопределено Тогда
			
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Заголовок = ДействиеОписание;
			НоваяКоманда.Действие = "Подключаемый_ОбработатьКомандуИзменитьВыделенные";
			НоваяКоманда.ИспользуемаяТаблица = Элементы[ИмяТЧ];
			НоваяКоманда.ИспользованиеВыделенныхСтрок = ИспользованиеВыделенныхСтрок.Использует;
			НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
			
			НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ПодменюИзменитьВыделенные);
			НовыйЭлемент.ИмяКоманды = ИмяКоманды;
			НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			
		Иначе
			
			СуществующийЭлемент = Элементы.Найти(ИмяКоманды);
			Если СуществующийЭлемент <> Неопределено Тогда
				СуществующийЭлемент.Видимость = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДействия(ИмяТЧ)
	
	УправлениеРезервнымиКопиямиТаблицы(1, Истина, ИмяТЧ);
	
	СписокДействий = ЭтотОбъект["ДействияИзменить" + ИмяТЧ];
	Действия = СписокДействий.ВыгрузитьЗначения();
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидДействия", ЭтотОбъект[ИмяТЧ + "ИзменениеСтрокДействие"]);
	ПараметрыФормы.Вставить("Действия", Действия);
	ПараметрыФормы.Вставить("Источник", УникальныйИдентификатор);
	ПараметрыФормы.Вставить("ИмяТЧ", ИмяТЧ);
	ПараметрыФормы.Вставить("ТипЗначения", "ЗаказПокупателя");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборДействияЗавершение", ЭтотОбъект, ПараметрыФормы);
	ОткрытьФорму("ОбщаяФорма.ИзменитьВыделенные", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДействияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТЧ = ДополнительныеПараметры.ИмяТЧ;
	
	Если Результат.ОтменаИзменений Тогда
		ОбработатьВыборДействияЗавершениеНаСервереПриОтмене(ИмяТЧ);
	Иначе
		ОбработатьИзменениеСтрок(Результат.Действие, Результат.Значение, ИмяТЧ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборДействияЗавершениеНаСервереПриОтмене(ИмяТЧ)
	
	УправлениеРезервнымиКопиямиТаблицы(0, Ложь, ИмяТЧ);

КонецПроцедуры

&НаСервере
Процедура ПометкаПриИзмененииНаСервере(ИмяТЧ)
	
	ГрупповоеИзменениеСтрокСервер.СтрокаПометкаПриИзменении(
	Объект[ИмяТЧ],
	Элементы[ИмяТЧ + "УстановитьФлажки"],
	Элементы[ИмяТЧ + "СнятьФлажки"],
	Элементы[ИмяТЧ + "ИзменитьВыделенные"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСтрок(Действие, Значение, ИмяТЧ)
	
	Модифицированность = Истина;
	
	ЭтотОбъект[ИмяТЧ + "ИзменениеСтрокДействие"] = Действие;
	ЭтотОбъект[ИмяТЧ + "ИзменениеСтрокЗначение"] = Значение;
	ОпределитьОбъектИзменений(ИмяТЧ);
	
	Если Не ЭтоИнтерфейсТакси Тогда
		
		ОтмеченныеСтроки = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("Пометка", Истина));
		Для Каждого СтрокаТЗ Из ОтмеченныеСтроки Цикл
			СтрокаТЗ.Пометка = Ложь;
		КонецЦикла;
		
		ВыделенныеСтроки = Элементы[ИмяТЧ].ПолучитьСтрокиДляОбработки();
		Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
			Объект[ИмяТЧ].НайтиПоИдентификатору(ВыделеннаяСтрока).Пометка = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	ОбработатьТаблицу(ИмяТЧ);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыСерийНоменклатурыВТабличнойЧасти(НомерСтроки)
	
	ДополнительныеСвойства = Новый Структура("НомерСтроки", НомерСтроки);
	СерииНоменклатурыУНФ.ОбновитьСтатусыСерийНоменклатурыВТабличнойЧасти(Объект,, ДополнительныеСвойства);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПодтверждениеСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтрокаТабличнойЧасти = ?(ДополнительныеПараметры.Свойство("СтрокаТабличнойЧасти"), ДополнительныеПараметры.СтрокаТабличнойЧасти, Неопределено);
	
		Если ДополнительныеПараметры.Свойство("ЭтоПодбор") И ДополнительныеПараметры.ЭтоПодбор Тогда
		
		Если Результат = Неопределено Тогда
			Возврат
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		
		ИмяТабличнойЧасти = "Запасы";

		ПараметрыПолученияЗапасовИзХранилища = НовыеПараметрыПолученияЗапасовИзХранилища(
			ДополнительныеПараметры.АдресЗапасовВХранилище, ИмяТабличнойЧасти);
		
		ПараметрыПолученияЗапасовИзХранилища.МассивНомеровИдентичныхСтрок = Новый Массив;
		ПараметрыПолученияЗапасовИзХранилища.МассивНомеровДобавленныхСтрок = Новый Массив;
		
		ПолучитьЗапасыИзХранилища(ПараметрыПолученияЗапасовИзХранилища);
		
		РаботаСНоменклатуройКлиентУНФ.ВывестиОповещениеПользователяОбИзмененииРежимаНалогообложенияНаСДНС(ТребуетсяИзменениеНалогообложениеНаСНДС);
			
		Для Каждого НомерСтроки Из ПараметрыПолученияЗапасовИзХранилища.МассивНомеровИдентичныхСтрок Цикл
			
			СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти][НомерСтроки];
			
			РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТабличнойЧасти);
			СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
			
		КонецЦикла;
		
			
		Для Каждого НомерДобавленнойСтроки Из ПараметрыПолученияЗапасовИзХранилища.МассивНомеровДобавленныхСтрок Цикл
			
			СтрокаТаблицы = Объект.Запасы[НомерДобавленнойСтроки];
			
			ВыполнитьОбработкуТабличнойЧастиПослеПодбора(ИмяТабличнойЧасти, СтрокаТаблицы);
			//@skip-check query-in-loop
			СтрокаТаблицы.ЯчейкаДоступна = ЯчейкаДоступна(СтрокаТаблицы.СтруктурнаяЕдиница);
			
		КонецЦикла;
		
		ОбновитьПодвалФормы();
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗапрашиватьСбросКоличества = Результат.ЗапрашиватьСбросКоличества;
		Если НЕ ЗапрашиватьСбросКоличества Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		КонецЕсли;
		Если Результат.СбрасыватьКоличество Тогда
			НовоеКоличество = Результат.НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = ДополнительныеПараметры.Количество;
		КонецЕсли;
	Иначе
		НовоеКоличество = ДополнительныеПараметры.Количество;
	КонецЕсли;
	
	ЗапасыНоменклатураПриИзмененииПродолжить(ДополнительныеПараметры.Элемент, НовоеКоличество, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество, СтрокаТабличнойЧасти = Неопределено)

	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("Партия", СтрокаТабличнойЧасти.Партия);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("СтруктураВыбораНоменклатуры", СтруктураВыбораНоменклатуры);
	СтруктураДанные.Вставить("ПодборНоменклатурыИзСписка", ПодборНоменклатурыИзСписка);
	
	СтруктураПоискаПартииСНДС = Новый Структура("КомиссияСНДС", Истина);
	ЕстьПартииСНДС = Объект.Запасы.НайтиСтроки(СтруктураПоискаПартииСНДС).Количество() > 0;
	СтруктураДанные.Вставить("ЕстьПартииСНДС", ЕстьПартииСНДС);
		
	СерииНоменклатурыУНФКлиентСервер.ДополнитьСтруктуруДаннымиДляПолученияСерийНоменклатуры(Объект, СтруктураДанные);
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = НовоеКоличество;
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
	СтрокаТабличнойЧасти.Содержание = "";
	
	СтрокаТабличнойЧасти.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
	СтрокаТабличнойЧасти.ЗаполнениеХарактеристикиПроверено = Истина;
	
	Если СтруктураДанные.ИспользоватьХарактеристики Тогда
		СтрокаТабличнойЧасти.Характеристика = СтруктураДанные.Характеристика;
	КонецЕсли;
	
	//Партии
	СтрокаТабличнойЧасти.ИспользоватьПартии = СтруктураДанные.ИспользоватьПартии;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеПартий = СтруктураДанные.ПроверятьЗаполнениеПартий;
	
	Если СтруктураДанные.ИспользоватьПартии Тогда
		Если ПодборНоменклатурыИзСписка И ТипЗнч(СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
			СтрокаТабличнойЧасти.Партия = СтруктураВыбораНоменклатуры.Партия;
			СтруктураВыбораНоменклатуры.Партия = Неопределено;
		Иначе
			СтрокаТабличнойЧасти.Партия = СтруктураДанные.Партия;
		КонецЕсли;
		СтрокаТабличнойЧасти.КомиссияСНДС = СтруктураДанные.КомиссияСНДС;
	КонецЕсли;
	//Конец Партии
	
	СтрокаТабличнойЧасти.ЗапретитьВводДробногоКоличества = СтруктураДанные.ЗапретитьВводДробногоКоличества;
	
	Если Не (ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтруктурнаяЕдиница) И ПодборНоменклатурыИзСписка) Тогда
		ЗаполнениеОбъектовУНФКлиент.ЗаполнитьСкладВСтрокеТЧЗапасы(СтрокаТабличнойЧасти, Объект, СтруктураДанные);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.ЯчейкаДоступна = ЯчейкаДоступна(СтрокаТабличнойЧасти.СтруктурнаяЕдиница);
	
	// Серии номенклатуры
	Для каждого ВыделеннаяСтрока Из Элементы.Запасы.ПолучитьСтрокиДляОбработки() Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		СерииНоменклатурыУНФКлиентСервер.УдалитьСерииНоменклатурыПоКлючуСвязи(Объект.СерииНоменклатуры, ТекущиеДанныеСтроки,
		ИспользоватьСерииНоменклатурыОстатки);
	КонецЦикла;
	
	СтрокаТабличнойЧасти.СтатусыСерийНоменклатуры = СтруктураДанные.СтатусыСерийНоменклатуры;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧЗапасы());
		
	ПодборНоменклатурыИзСписка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаСкладВТЧ(Результат, ПараметрыОповещения) Экспорт
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ПараметрыОповещения);
		ОбработатьИзменениеЗапасыНоменклатура(Неопределено);
		Возврат;
	КонецЕсли;
	
	Объект.ПоложениеСклада = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти");
	
	ОбновитьДанныеПослеПереключенияСкладШапка();
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ПараметрыОповещения);
	
	Если СтрокаТабличнойЧасти.Свойство("СтруктурнаяЕдиница") Тогда
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ПараметрыОповещения.Склад;
	КонецЕсли;
	
	НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтотОбъект, ИмяТЧЗапасы());
	
	ОбработатьИзменениеЗапасыНоменклатура(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеЗапасыНоменклатура(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьСбросКоличества И СбрасыватьКоличество
		И СтрокаТабличнойЧасти.Количество <> НовоеКоличествоПриИзмененииНоменклатуры Тогда
		
		ДопПараметр = Новый Структура();
		ДопПараметр.Вставить("Элемент", Элемент);
		ДопПараметр.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		ДопПараметр.Вставить("НоменклатураПоставщика", Ложь);
		Оповещение = Новый ОписаниеОповещения("ЗапасыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
		ОткрытьФорму("ОбщаяФорма.ПодтверждениеСбросаКоличества", , , , , , Оповещение);
		
	Иначе
		
		Если СбрасыватьКоличество Тогда
			НовоеКоличество = НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		ЗапасыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоДокументу(Объект.ДокументОснование);
	
	УстановитьВидимостьИДоступность();
	
	ЦеныИВалюта = ЦеныИВалютаКлиентСервер.ТекстНадписиЦеныИВалюта(Объект, ВалютаРасчетов, КурсНациональнаяВалюта,
		УчетВалютныхОпераций);
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьВыбораПодразделения(СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора(СтрокаТабличнойЧасти.Номенклатура);
	
	Если НЕ СтруктураДанные.ВозможностьУказанияПодразделения Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, НСтр("ru = 'Для этого расхода подразделение не указывается.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПодтверждениеСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
		Если ДополнительныеПараметры.Свойство("ЭтоПодбор") И ДополнительныеПараметры.ЭтоПодбор Тогда
		
		Если Результат = Неопределено Тогда
			Возврат
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		
		ПараметрыПолученияЗапасовИзХранилища = НовыеПараметрыПолученияЗапасовИзХранилища(
			ДополнительныеПараметры.АдресЗапасовВХранилище, "Расходы");
		ПараметрыПолученияЗапасовИзХранилища.МассивНомеровИдентичныхСтрок = Новый Массив;
		ПараметрыПолученияЗапасовИзХранилища.МассивНомеровДобавленныхСтрок = Новый Массив;
		
		ПолучитьЗапасыИзХранилища(ПараметрыПолученияЗапасовИзХранилища);
		
		РаботаСНоменклатуройКлиентУНФ.ВывестиОповещениеПользователяОбИзмененииРежимаНалогообложенияНаСДНС(ТребуетсяИзменениеНалогообложениеНаСНДС);
		
		Для каждого СтрокаТаблицы Из Объект.Расходы Цикл 
			РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧРасходы(), СтрокаТаблицы);
		КонецЦикла;
		
		ОбновитьПодвалФормы();
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗапрашиватьСбросКоличества = Результат.ЗапрашиватьСбросКоличества;
		Если НЕ ЗапрашиватьСбросКоличества Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		КонецЕсли;
		Если Результат.СбрасыватьКоличество Тогда
			НовоеКоличество = Результат.НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = ДополнительныеПараметры.Количество;
		КонецЕсли;
	Иначе
		НовоеКоличество = ДополнительныеПараметры.Количество;
	КонецЕсли;
	
	РасходыНоменклатураПриИзмененииПродолжить(ДополнительныеПараметры.Элемент, НовоеКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество)

	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ДатаОбработки",			Объект.Дата);
	СтруктураДанные.Вставить("Организация",				Объект.Организация);
	СтруктураДанные.Вставить("НалогообложениеНДС",		Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("Номенклатура",			СтрокаТабличнойЧасти.Номенклатура);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.Содержание = "";
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = НовоеКоличество;
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
	СтрокаТабличнойЧасти.ЗапретитьВводДробногоКоличества = СтруктураДанные.ЗапретитьВводДробногоКоличества;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти("Расходы");
	
	Если СтруктураДанные.ОчиститьЗаказИПодразделение Тогда
		
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = Неопределено;
		СтрокаТабличнойЧасти.ЗаказПокупателя = Неопределено;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтруктурнаяЕдиница) Тогда
		
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
		
	КонецЕсли;
	
	Если СтруктураДанные.ОчиститьНаправлениеДеятельности Тогда
		
		СтрокаТабличнойЧасти.НаправлениеДеятельности = Неопределено;
		
	Иначе
		
		СтрокаТабличнойЧасти.НаправлениеДеятельности = СтруктураДанные.НаправлениеДеятельности;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросОчиститьЗапасыИЗаполнитьПоОрдерам(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат 
	КонецЕсли;
	
	Объект.Запасы.Очистить();
	Объект.СерииНоменклатуры.Очистить();
	
	ИдентификаторыНовыхСтрок = Новый Массив;
	ЗагрузитьПоОстаткамНаСервере(ИдентификаторыНовыхСтрок);
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		РассчитатьСуммуВСтрокеТабличнойЧасти("Запасы", СтрокаТабличнойЧасти);
	КонецЦикла;
	
	Если Объект.Запасы.Количество() Тогда
		Модифицированность = Истина;
		ОбновитьПодвалФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПоОстаткамНаСервере(ИдентификаторыНовыхСтрок)
	
	ДополнительныеПараметры = Новый Структура("ПоложениеСклада", Объект.ПоложениеСклада);
	ЗапасыКПоступлению = СкладскойУчетСервер.ПолучитьТаблицуОстатковПоПриходнымОрдерам(Объект, ДополнительныеПараметры);
	ПараметрыПолученияЗапасовИзХранилища = НовыеПараметрыПолученияЗапасовИзХранилища(ЗапасыКПоступлению, "Запасы");
	ПараметрыПолученияЗапасовИзХранилища.ИдентификаторыНовыхСтрок = ИдентификаторыНовыхСтрок;
	ПараметрыПолученияЗапасовИзХранилища.ЗаполнениеПоОстаткам = Истина;
	ПолучитьЗапасыИзХранилища(ПараметрыПолученияЗапасовИзХранилища);
	СерииНоменклатурыУНФ.УдалитьСерииНоменклатурыВТабличнойЧастиВЗависимостиОтПолитики(Объект);
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
КонецПроцедуры

&НаСервере
Функция УчетОстатковВРазрезеСкладскихОрдеров(СтруктурнаяЕдиница = Неопределено)
	
	Если НЕ СтруктурнаяЕдиница = Неопределено Тогда
		Возврат СкладскойУчетСервер.УчетОстатковВРазрезеСкладскихОрдеров(СтруктурнаяЕдиница);
	КонецЕсли;
	
	Если Объект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
			МассивКонтроля = СкладскойУчетСервер.МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам(Объект.Запасы.Выгрузить(,"СтруктурнаяЕдиница"));
			Возврат МассивКонтроля.Количество();
	КонецЕсли;
	
	Возврат СкладскойУчетСервер.УчетОстатковВРазрезеСкладскихОрдеров(Объект.СтруктурнаяЕдиница);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПризнакиИспользованияСерийПриИзмененииКлючевыхРеквизитов()
	ДополнительныеСвойства = Новый Структура("ИзменениеКлючевыхРеквизитов", Истина);
	СерииНоменклатурыУНФ.ЗаполнитьПризнакиИспользованияСерий(Объект, ДополнительныеСвойства);
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыМобильноеПриложение()
	
	Если Не МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПодменюОрганайзер.Видимость = Ложь;
	Элементы.ГруппаГлобальныеКоманды.Видимость = Ложь;
	Элементы.ШапкаТабличнаяЧасть.Видимость = Ложь;
	Элементы.СтруктурнаяЕдиницаКонтекстноеМенюШапкаТабличнаяЧасть.Видимость = Ложь;
	Элементы.ЯчейкаКонтекстноеМенюШапкаТабличнаяЧасть.Видимость = Ложь;
	Элементы.ЗапасыКонтекстноеМенюШапкаТабличнаяЧасть.Видимость = Ложь;
	Элементы.ГруппаДополнительно.Видимость = Ложь;
	Элементы.ЗапасыИтогСуммаНДС.Видимость = Ложь;
	Элементы.ГруппаЦеныИВалюта.Видимость = Ложь;
	Элементы.ЗапасыГруппаКопированиеСтрок.Видимость = Ложь;
	Элементы.ЗапасыЗапасыПодбор.Видимость = Ложь;
	Элементы.ЗапасыЗагрузкаИзФайлаЗапасы.Видимость = Ложь;
	Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
	Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
	Элементы.ВключатьРасходыВСебестоимость.Видимость = Ложь;
	Элементы.РасходыГруппаКопированиеСтрок.Видимость = Ложь;
	Элементы.РасходыЗагрузкаИзФайлаУслуги.Видимость = Ложь;
	Элементы.РасходыРасходыПодбор.Видимость = Ложь;
	Элементы.РасходыСтавкаНДС.Видимость = Ложь;
	Элементы.РасходыСуммаНДС.Видимость = Ложь;
	Элементы.ГруппаЗаказОснование.Видимость = Ложь;
	Элементы.ЗапасыЗаполнениеКомиссия.Видимость = Ложь;
	Элементы.ФормаЗаписать.Видимость = Ложь;
	Элементы.ФормаПровести.Видимость = Ложь;
	Элементы.ФормаОтменаПроведения.Видимость = Ложь;
	Элементы.ФормаПоказатьВСписке.Видимость = Ложь;
	Элементы.ФормаПровестиИЗакрыть.Заголовок = НСтр("ru = 'Готово'");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройки(ПередаватьВидДокумента)
	
	ЗаполнениеОбъектовУНФКлиент.ЗаполнитьПустыеПоложения(Объект, "ПоложениеСклада");
	
	ПараметрыДиалога = Новый Структура;
	
	Если ИспользоватьПроекты Тогда
		ПараметрыДиалога.Вставить("ПоложениеПроекта", Объект.ПоложениеПроекта);
	КонецЕсли;
	
	ПараметрыДиалога.Вставить("ПоложениеСкладаВДокументахПоступления", Объект.ПоложениеСклада);
	
	ПараметрыДиалога.Вставить("БылиВнесеныИзменения", Ложь);
	
	Если ПередаватьВидДокумента Тогда
		ПараметрыДиалога.Вставить("ВидДокумента", НСтр("ru = 'расходы предпринимателя'"));
	КонецЕсли;
	
	ПараметрыДиалога.Вставить("ПоказыватьКолонкуСодержаниеВПриходнойНакладнойЗапасы",
		ПоказыватьКолонкуСодержаниеВПриходнойНакладнойЗапасы);

	ПараметрыДиалога.Вставить("ПоказыватьКолонкуСодержаниеВПриходнойНакладнойРасходы",
		ПоказыватьКолонкуСодержаниеВПриходнойНакладнойРасходы);
		
	ПараметрыДиалога.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ШапкаТабличнаяЧастьЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ШапкаТабличнаяЧасть", ПараметрыДиалога, , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ШапкаТабличнаяЧастьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Свойство("БылиВнесеныИзменения") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.БылиВнесеныИзменения Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиИзмененыПерсональныеНастройки Тогда
		НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);
	КонецЕсли;
	
	Если Результат.Свойство("ПоложениеПроекта") Тогда
		Если Объект.ПоложениеПроекта <> Результат.ПоложениеПроекта Тогда
			Объект.ПоложениеПроекта = Результат.ПоложениеПроекта;
			ЗаполнениеОбъектовУНФКлиент.ОбработатьИзменениеПоложения(Объект, "Расходы", "Проект", "ПоложениеПроекта");
		КонецЕсли;
	КонецЕсли;
	
	ПоказыватьКолонкуСодержаниеВПриходнойНакладнойЗапасы = 
		Результат.ПоказыватьКолонкуСодержаниеВПриходнойНакладнойЗапасы;

	ПоказыватьКолонкуСодержаниеВПриходнойНакладнойРасходы = 
		Результат.ПоказыватьКолонкуСодержаниеВПриходнойНакладнойРасходы;
		
	ШапкаТабличнаяЧастьЗавершениеНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ШапкаТабличнаяЧастьЗавершениеНаСервере(Результат)
	
	Если Объект.ПоложениеСклада <> Результат.ПоложениеСкладаВДокументахПоступления Тогда
		Объект.ПоложениеСклада = Результат.ПоложениеСкладаВДокументахПоступления;
		Если Объект.ПоложениеСклада <> Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
			СтруктураПолей = ЗаполнениеОбъектовУНФ.СтруктурнаяЕдиницаИЯчейкаДляШапки(Объект.Запасы);
			ЗаполнитьЗначенияСвойств(Объект, СтруктураПолей);
			Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
				Объект.СтруктурнаяЕдиница = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойСклад");
				Объект.Ячейка = Справочники.Ячейки.ПустаяСсылка();
			КонецЕсли; 
		КонецЕсли;
		Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
			СтрокаТабличнойЧасти.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
			СтрокаТабличнойЧасти.Ячейка = Объект.Ячейка;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьВидимостьОтПользовательскихНастроек();
	ЗаполнитьСписокДействий(ИмяТЧЗапасы());
	
	ОбновитьДоступностьЯчеек();
	ЗаполнитьПризнакиДоступностиЯчеек(ЭтотОбъект);
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПослеПереключенияСкладШапка()
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьТаблицуПоШапке(Объект, ИмяТЧЗапасы(), "СтруктурнаяЕдиница", "ПоложениеСклада");
	Если КэшЗначений.УчетПоЯчейкам Тогда
		ЗаполнениеОбъектовУНФ.ЗаполнитьТаблицуПоШапке(Объект, ИмяТЧЗапасы(), "Ячейка", "ПоложениеСклада");
	КонецЕсли; 
	УстановитьВидимостьОтПользовательскихНастроек();
	ЗаполнитьСписокДействий(ИмяТЧЗапасы());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКоманду(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик выбора типа основания
//
// Параметры:
//  ТипОснования - ЭлементСпискаЗначений - элемент списка типов оснований
//  Параметры - Неопределено - не используется
//
&НаКлиенте
Процедура ВыборТипаОснованияЗавершение(ТипОснования, Параметры) Экспорт
	
	Если ТипОснования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьОснованиеЗавершение", ЭтотОбъект);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	Если ТипОснования.Значение = "Документ.СчетНаОплату.ФормаВыбора" Тогда
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
	КонецЕсли; 
	
	ОткрытьФорму(ТипОснования.Значение, ПараметрыФормы, ЭтотОбъект,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснованиеЗавершение(ВыбранноеЗначение, Параметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДокументОснование = ВыбранноеЗначение;
	ТекстЗаголовка = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбранноеЗначение);
	УстановитьЗаголовокНадписиОснование(ЭтотОбъект, ТекстЗаголовка);
	Модифицированность = Истина;
	
	ДокументОснованиеПриИзменении();
	
	ЗаполнитьПоОснованиюНачало();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюНачало() Экспорт

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения, 
		НСтр("ru = 'Заполнить документ по выбранному основанию?'"),
		РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументу(ДокОснование)

	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Заполнить(ДокОснование);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;
	
	УстановитьВидимостьПоНалогообложению();
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	//Ячейки
	ОбновитьДоступностьЯчеек();
	ЗаполнитьПризнакиДоступностиЯчеек(ЭтотОбъект);
	// Конец Ячейки
	
	ОбновитьВидимостьПоляЗаказыПокупателей(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьПоДокументу()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокНадписиОснование(Форма, ТекстЗаголовка)
	
	ЭлементыФормы = Форма.Элементы;
	ОбъектФормы = Форма.Объект;
	ЭлементыФормы.ДокументОснованиеНадпись.Заголовок = ТекстЗаголовка;
	ЭлементыФормы.ОткрытьКомандыОснование.Видимость = ЗначениеЗаполнено(ОбъектФормы.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснование()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаОснованияЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДокументОснование, Элементы.ДокументОснованиеНадпись);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКомандыОснования(ВыбранноеДействие, Параметры) Экспорт
	
	Если ВыбранноеДействие = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ВыбранноеДействие.Значение = "Удалить" Тогда
		Объект.ДокументОснование = Неопределено;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Элементы.ОткрытьКомандыОснование.Видимость = Ложь;
		Модифицированность = Истина;
	ИначеЕсли ВыбранноеДействие.Значение = "Заполнить" Тогда
		ЗаполнитьПоОснованиюНачало();
	ИначеЕсли ВыбранноеДействие.Значение = "Выбрать" Тогда
		ВыбратьОснование();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьТабЧастьРасходыПоКоличеству()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РаспределитьТабЧастьРасходыПоКоличеству();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	//Ячейки
	ОбновитьДоступностьЯчеек();
	ЗаполнитьПризнакиДоступностиЯчеек(ЭтотОбъект);
	// Конец Ячейки
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоКоличеству()

&НаСервере
Процедура РаспределитьТабЧастьРасходыПоСумме()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РаспределитьТабЧастьРасходыПоСумме();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	//Ячейки
	ОбновитьДоступностьЯчеек();
	ЗаполнитьПризнакиДоступностиЯчеек(ЭтотОбъект);
	// Конец Ячейки
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоСумме()

&НаСервере
Процедура ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты)
	
	ДокументыУНФ.ДатаПриИзменении(ДанныеДляИзмененияДаты, ЭтотОбъект, Объект);
	
	ЗаполнитьСтавкуНДСПоОрганизацииНалогообложениеНДС();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ДокументыУНФ.ОрганизацияПриИзменении(ЭтотОбъект, Объект);
	
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
	ЗаполнитьПризнакиИспользованияСерийПриИзмененииКлючевыхРеквизитов();
	ЗаполнитьСтавкуНДСПоОрганизацииНалогообложениеНДС();
	
	ЦеныИВалюта = ЦеныИВалютаКлиентСервер.ТекстНадписиЦеныИВалюта(Объект, ВалютаРасчетов, КурсНациональнаяВалюта,
		УчетВалютныхОпераций);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанные.Номенклатура,
		"ЕдиницаИзмерения, ИспользоватьХарактеристики, ПроверятьЗаполнениеХарактеристики, НаправлениеДеятельности,
		| Склад, Ячейка, ИспользоватьПартии, ПроверятьЗаполнениеПартий, ИспользоватьСерииНоменклатуры");
		
	Если НЕ СтруктураДанные.Свойство("ЕдиницаИзмерения") Тогда
		СтруктураДанные.Вставить("ЕдиницаИзмерения", РеквизитыНоменклатуры.ЕдиницаИзмерения);
	КонецЕсли; 
	
	Если Не СтруктураДанные.Свойство("ЕстьПартииСНДС") Тогда
		СтруктураДанные.Вставить("ЕстьПартииСНДС", Ложь);
	КонецЕсли;
	
	ДанныеНДС = НоменклатураВДокументахСервер.ДанныеНДССтрокиНоменклатуры(СтруктураДанные);
	СтруктураДанные.Вставить("СтавкаНДС", ДанныеНДС.СтавкаНДС);
		
	// Характеристики
	СтруктураДанные.Вставить("ИспользоватьХарактеристики",Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",Ложь);
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) И РеквизитыНоменклатуры.ИспользоватьХарактеристики
		Тогда
		ЗначенияПоУмолчанию =
			НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура);
		
		Если Не ЗначенияПоУмолчанию = Неопределено
			Тогда
			ХарактеристикаПоУмолчанию = ЗначенияПоУмолчанию;
		КонецЕсли;
		
		Если НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика",ХарактеристикаПоУмолчанию);
		Иначе
			СтруктураДанные.Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика),
				СтруктураДанные.Характеристика, ХарактеристикаПоУмолчанию);
		КонецЕсли;
		
		СтруктураДанные.Вставить("ИспользоватьХарактеристики",Истина);
		СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",
			РеквизитыНоменклатуры.ПроверятьЗаполнениеХарактеристики);
		
		Если СтруктураДанные.Свойство("ПодборНоменклатурыИзСписка") И СтруктураДанные.ПодборНоменклатурыИзСписка Тогда
			Если СтруктураДанные.Свойство("СтруктураВыбораНоменклатуры")
				И ТипЗнч(СтруктураДанные.СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
				СтруктураДанные.Характеристика = СтруктураДанные.СтруктураВыбораНоменклатуры.Характеристика;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	// Конец Характеристики
	
	Если СтруктураДанные.Свойство("ВидЦен") Тогда
		
		Если СтруктураДанные.Свойство("Характеристика") И СтруктураДанные.Характеристика = Неопределено Тогда
			СтруктураДанные.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()
		ИначеЕсли НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		КонецЕсли;
		
		Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
		СтруктураДанные.Вставить("Цена", Цена);
		
	Иначе
		
		СтруктураДанные.Вставить("Цена", 0);
		
	КонецЕсли;
	
	СтруктураДанные.Вставить("ОчиститьЗаказИПодразделение", Ложь);
	СтруктураДанные.Вставить("ОчиститьНаправлениеДеятельности", Ложь);
	СтруктураДанные.Вставить("НаправлениеДеятельности", РеквизитыНоменклатуры.НаправлениеДеятельности);
	
	СчетУчетаЗатрат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанные.Номенклатура, "СчетУчетаЗатрат");
	Если ЗначениеЗаполнено(СчетУчетаЗатрат) Тогда
		ТипСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетУчетаЗатрат, "ТипСчета");
	Иначе	
		ТипСчета = Перечисления.ТипыСчетов.ПустаяСсылка();
	КонецЕсли;

	Если ТипСчета <> Перечисления.ТипыСчетов.Расходы
	   И ТипСчета <> Перечисления.ТипыСчетов.ПрочиеРасходы
	   И ТипСчета <> Перечисления.ТипыСчетов.Доходы
	   И ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
	   И ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
		СтруктураДанные.ОчиститьЗаказИПодразделение = Истина;
	КонецЕсли;
	
	Если ТипСчета <> Перечисления.ТипыСчетов.Расходы
	   И ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
	   И ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
		СтруктураДанные.ОчиститьНаправлениеДеятельности = Истина;
	КонецЕсли;
	
	СтруктураДанные.Вставить("Склад", РеквизитыНоменклатуры.Склад);
	СтруктураДанные.Вставить("Ячейка", РеквизитыНоменклатуры.Ячейка);
	
	//Партии
	СтруктураДанные.Вставить("ИспользоватьПартии",Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеПартий",Ложь);
	
	Если Не СтруктураДанные.Свойство("ТребуетсяИзменениеНалогообложениеНаСНДС") Тогда
		СтруктураДанные.Вставить("ТребуетсяИзменениеНалогообложениеНаСНДС", Ложь);
	КонецЕсли;
	
	Если НЕ СтруктураДанные.Свойство("Партия") Тогда
		СтруктураДанные.Вставить("Партия", Неопределено);
	КонецЕсли;
	
	Если НЕ СтруктураДанные.Свойство("КомиссияСНДС") Тогда
		СтруктураДанные.Вставить("КомиссияСНДС", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) И РеквизитыНоменклатуры.ИспользоватьПартии
		Тогда
		СтатусПартии = Перечисления.СтатусыПартий.СобственныеЗапасы;
		ЗначенияПартииПоУмолчанию =
			НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура,
			СтатусПартии);
		
		ПартияПоУмолчанию = Справочники.ПартииНоменклатуры.ПустаяСсылка();
		
		Если Не ЗначенияПартииПоУмолчанию = Неопределено
			Тогда
			ПартияПоУмолчанию = ЗначенияПартииПоУмолчанию;
		КонецЕсли;
		
		СтруктураДанные.Партия = ?(ЗначениеЗаполнено(СтруктураДанные.Партия), СтруктураДанные.Партия,
			ПартияПоУмолчанию);
		
		СтруктураДанные.ПроверятьЗаполнениеПартий = РеквизитыНоменклатуры.ПроверятьЗаполнениеПартий;
		СтруктураДанные.ИспользоватьПартии = Истина;
		
	КонецЕсли;
	// Конец Партии
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) И РеквизитыНоменклатуры.ИспользоватьСерииНоменклатуры Тогда
		СтруктураДанные.Вставить("СтатусыСерийНоменклатуры",
			СерииНоменклатурыУНФ.СтатусСерийНоменклатурыПриИзменении(СтруктураДанные));
	Иначе
		СтруктураДанные.Вставить("СтатусыСерийНоменклатуры", 0);
	КонецЕсли;
	
	СтруктураДанные.Вставить("ЗапретитьВводДробногоКоличества",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанные.Номенклатура, "ЗапретитьВводДробногоКоличества"));
		
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные)
	
	Если СтруктураДанные.Свойство("ВидЦен") Тогда
	
		Если ТипЗнч(СтруктураДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			СтруктураДанные.Вставить("Коэффициент", СтруктураДанные.ЕдиницаИзмерения.Коэффициент);
		Иначе
			СтруктураДанные.Вставить("Коэффициент", 1);
		КонецЕсли;
		
		Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
		СтруктураДанные.Вставить("Цена", Цена);
		
	Иначе
		
		СтруктураДанные.Вставить("Цена", 0);
		
	КонецЕсли;
	
	Возврат СтруктураДанные;

КонецФункции // ПолучитьДанныеХарактеристикаПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеЕдиницаИзмеренияПриИзменении(ТекущаяЕдиницаИзмерения = Неопределено, ЕдиницаИзмерения = Неопределено)
	
	СтруктураДанные = Новый Структура;
	
	Если ТекущаяЕдиницаИзмерения = Неопределено Тогда
		СтруктураДанные.Вставить("ТекущийКоэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("ТекущийКоэффициент", ТекущаяЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	Если ЕдиницаИзмерения = Неопределено Тогда
		СтруктураДанные.Вставить("Коэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("Коэффициент", ЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЕдиницаИзмеренияПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеНаправлениеДеятельностиНачалоВыбора(Номенклатура)
	
	СтруктураДанные = Новый Структура;
	
	ВозможностьУказанияНаправленияДеятельности = Истина;
	
	СчетУчетаЗатрат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "СчетУчетаЗатрат");
	ТипСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетУчетаЗатрат, "ТипСчета");

	Если ТипСчета <> Перечисления.ТипыСчетов.Расходы
	   И ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
	   И ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
		ВозможностьУказанияНаправленияДеятельности = Ложь;
	КонецЕсли;
	
	СтруктураДанные.Вставить("ВозможностьУказанияНаправленияДеятельности", ВозможностьУказанияНаправленияДеятельности);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНаправлениеДеятельностиНачалоВыбора()

&НаСервереБезКонтекста
Функция ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора(Номенклатура)
	
	СтруктураДанные = Новый Структура;
	
	ВозможностьУказанияПодразделения = Истина;
	
	СчетУчетаЗатрат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "СчетУчетаЗатрат");
	ТипСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетУчетаЗатрат, "ТипСчета");

	Если ТипСчета <> Перечисления.ТипыСчетов.Расходы
	   И ТипСчета <> Перечисления.ТипыСчетов.ПрочиеРасходы
	   И ТипСчета <> Перечисления.ТипыСчетов.Доходы
	   И ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
	   И ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
		ВозможностьУказанияПодразделения = Ложь;
	КонецЕсли;
	
	СтруктураДанные.Вставить("ВозможностьУказанияПодразделения", ВозможностьУказанияПодразделения);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора()

&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаказНачалоВыбора(Номенклатура)
	
	СтруктураДанные = Новый Структура;
	
	ВозможностьУказанияЗаказа = Истина;
	
	СчетУчетаЗатрат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "СчетУчетаЗатрат");
	ТипСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетУчетаЗатрат, "ТипСчета");

	Если ТипСчета <> Перечисления.ТипыСчетов.Расходы
	   И ТипСчета <> Перечисления.ТипыСчетов.Доходы
	   И ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
	   И ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
		ВозможностьУказанияЗаказа = Ложь;
	КонецЕсли;
	
	СтруктураДанные.Вставить("ВозможностьУказанияЗаказа", ВозможностьУказанияЗаказа);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора()

&НаКлиенте
Процедура ДокументОснованиеПриИзменении()

	Элементы.ЗапасыСебестоимость.Видимость = Ложь;
	Если Элементы.ЗапасыСебестоимость.Видимость Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаЗапасы Из Объект.Запасы Цикл
		СтрокаЗапасы.Себестоимость = 0;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизацииНалогообложениеНДС(ЭтоОткрытие = Ложь)
	
	НастройкиНДС = НалогиУНФ.НастройкиНДСПустые();
	
	Если НЕ НастройкиНДС.ТипНалогообложения = Объект.НалогообложениеНДС ИЛИ ЭтоОткрытие Тогда
		Объект.НалогообложениеНДС = НастройкиНДС.ТипНалогообложения;
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоНалогообложениеНДС()
	
	НоменклатураВДокументахСервер.ОбновитьСтавкуНДСТабличнойЧасти(Объект, "Запасы", Ложь);
	НоменклатураВДокументахСервер.ОбновитьСтавкуНДСТабличнойЧасти(Объект, "Расходы", Ложь);
	
	УстановитьВидимостьПоНалогообложению();
	
	// Обновим подвал формы.
	ИтогВсего = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего");
	ИтогСуммаНДС = Объект.Запасы.Итог("СуммаНДС") + Объект.Расходы.Итог("СуммаНДС");
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()	

&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТабличнойЧасти,
		СтрокаТабличнойЧасти = Неопределено, ПараметрыРасчета = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	КонецЕсли;
	
	Если ПараметрыРасчета=Неопределено Тогда
		ПараметрыРасчета = Новый Структура();
	КонецЕсли;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
	// Серии номенклатуры
	Если ИспользоватьСерииНоменклатурыОстатки <> Неопределено
		И ИмяТабличнойЧасти = ИмяТЧЗапасы() Тогда
			СерииНоменклатурыУНФКлиентСервер.ОбновитьСерииНоменклатурыКоличество(Объект, СтрокаТабличнойЧасти);
	КонецЕсли;
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуТабличнойЧастиПослеПодбора(ИмяТабличнойЧасти,
		СтрокаТабличнойЧасти = Неопределено, ПараметрыРасчета = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	КонецЕсли;
	
	// Серии номенклатуры
	Если ИспользоватьСерииНоменклатурыОстатки <> Неопределено
		И ИмяТабличнойЧасти = ИмяТЧЗапасы() Тогда
			СерииНоменклатурыУНФКлиентСервер.ОбновитьСерииНоменклатурыКоличество(Объект, СтрокаТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалюты(Знач ВалютаРасчетовПередИзменением,
		ПересчитатьЦены = Ложь, ПерезаполнитьЦены = Ложь, ТекстПредупреждения = "")

	ПараметрыФормыЦеныИВалюта = ЦеныИВалютаКлиентСервер.НовыеПараметрыФормыЦеныИВалюта(Объект, ТолькоПросмотр,
		Компания, ПерезаполнитьЦены, ПересчитатьЦены, ТекстПредупреждения); 
		
	ПараметрыФормыЦеныИВалюта.ВалютаПередИзменением = ВалютаРасчетовПередИзменением; 
	
	ПараметрыФормыЦеныИВалюта.ТипОбъектаВладельца = "РасходыПредпринимателя";
	
	ЦенообразованиеКлиентСервер.ИзменитьПараметрыФормыЦеныИВалютыДляВозвратов(ПараметрыФормыЦеныИВалюта, 
		НовыйСпособВидовЦенДляВозвратовИспользуется());
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияПоКнопкеЦеныИВалютыЗавершение", ЭтотОбъект,
		Новый Структура("ВалютаРасчетовПередИзменением", ВалютаРасчетовПередИзменением)); 
		
	ОткрытьФорму("ОбщаяФорма.ЦеныИВалюта", ПараметрыФормыЦеныИВалюта, ЭтотОбъект, , , , ОписаниеОповещения,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвалФормы()
	
	ИтогВсего = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего");
	ИтогСуммаНДС = Объект.Запасы.Итог("СуммаНДС") + Объект.Расходы.Итог("СуммаНДС");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыйСпособВидовЦенДляВозвратовИспользуется()
	
	Возврат ЦенообразованиеВызовСервера.НовыйСпособВидовЦенДляВозвратовИспользуется();
	
КонецФункции

&НаКлиенте
Процедура ПерезаполнитьЦеныВТабличныхЧастях()
	
	ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтотОбъект, ИмяТЧЗапасы());
	ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтотОбъект, ИмяТЧРасходы());
		
КонецПроцедуры

// Обработать изменения по кнопке цены и валюты завершение.
// 
// Параметры:
//  РезультатФормыЦеныИВалюта - см. ЦеныИВалютаКлиентСервер.РезультатФормыЦеныИВалюта
//  ДополнительныеПараметры - Структура
&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалютыЗавершение(РезультатФормыЦеныИВалюта, ДополнительныеПараметры) Экспорт

	ПерезаполнитьТЧЗапасыЕслиБылиВнесеныИзмененияВФормеЦеныИВалюта(РезультатФормыЦеныИВалюта, ДополнительныеПараметры);

	ЦеныИВалюта = ЦеныИВалютаКлиентСервер.ТекстНадписиЦеныИВалюта(Объект, ВалютаРасчетов, КурсНациональнаяВалюта,
		УчетВалютныхОпераций);

	ОбновитьПодвалФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТЧЗапасыЕслиБылиВнесеныИзмененияВФормеЦеныИВалюта(ПараметрыЗаполнения, ДополнительныеПараметры)
	
	Если ТипЗнч(ПараметрыЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыЗаполнения.БылиВнесеныИзменения Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Объект.ВалютаДокумента = ПараметрыЗаполнения.ВалютаДокумента;
	Объект.Курс = ПараметрыЗаполнения.КурсРасчетов;
	Объект.Кратность = ПараметрыЗаполнения.КратностьРасчетов;
	Объект.НалогообложениеНДС = ПараметрыЗаполнения.НалогообложениеНДС;
	Объект.СпециальныйНалоговыйРежим = ПараметрыЗаполнения.СпециальныйНалоговыйРежим;
	Объект.СуммаВключаетНДС = ПараметрыЗаполнения.СуммаВключаетНДС;
	Объект.НДСВключатьВСтоимость = ПараметрыЗаполнения.НДСВключатьВСтоимость;
	
	ПересчитатьЦеныПоВидуЦен(ПараметрыЗаполнения);
	ПересчитатьЦеныПоВалюте(ПараметрыЗаполнения, ДополнительныеПараметры);
	ПересчитатьСуммуЕслиИзменилсяПризнакНалогообложениеНДС(ПараметрыЗаполнения);
	ПересчитатьСуммуЕслиИзменилсяПризнакСуммаВключаетНДС(ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦеныПоВалюте(Знач ПараметрыЗаполнения, Знач ДополнительныеПараметры)
	
	Если НЕ ПараметрыЗаполнения.ПерезаполнитьЦены
		И ПараметрыЗаполнения.ПересчитатьЦены Тогда
		ЦенообразованиеКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтотОбъект,
			ДополнительныеПараметры.ВалютаРасчетовПередИзменением, ИмяТЧЗапасы(), ПараметрыЗаполнения.КурсПересчетаЦен);
	КонецЕсли;
	
	Если ПараметрыЗаполнения.ПересчитатьЦены Тогда
		ЦенообразованиеКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтотОбъект,
			ДополнительныеПараметры.ВалютаРасчетовПередИзменением, ИмяТЧРасходы(), ПараметрыЗаполнения.КурсПересчетаЦен);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦеныПоВидуЦен(Знач ПараметрыЗаполнения)
	
	Если Не ПараметрыЗаполнения.ПерезаполнитьЦены Тогда
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьЦеныВТабличныхЧастях();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуЕслиИзменилсяПризнакНалогообложениеНДС(Знач ПараметрыЗаполнения)
	
	Если ПараметрыЗаполнения.НалогообложениеНДС <> ПараметрыЗаполнения.ПредНалогообложениеНДС Тогда
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуЕслиИзменилсяПризнакСуммаВключаетНДС(Знач ПараметрыЗаполнения)
	
	Если НЕ ПараметрыЗаполнения.ПерезаполнитьЦены
		И ПараметрыЗаполнения.СуммаВключаетНДС <> ПараметрыЗаполнения.ПредСуммаВключаетНДС Тогда
		ЦенообразованиеКлиент.ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтотОбъект, ИмяТЧЗапасы());
	КонецЕсли;
	
	Если ПараметрыЗаполнения.СуммаВключаетНДС <> ПараметрыЗаполнения.ПредСуммаВключаетНДС Тогда
		ЦенообразованиеКлиент.ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтотОбъект, ИмяТЧРасходы());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьЦенуСертификата(Результат, ВыбраннаяСтрока) Экспорт
	
	Если Не Результат = Неопределено Тогда
		ВыбраннаяСтрока.Цена = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьПоляЗаказыПокупателей(Форма)
	
	Объект = Форма.Объект;
	// Видимость заказов покупателей в таблице запасов
	ЕстьЗаказыПокупателей = Истина;
	
	// Видимость заказов покупателей в таблице расходов
	ЕстьЗаказПокупателяРасходы = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЗапасыЗаказПокупателя", "Видимость",
		ЕстьЗаказыПокупателей);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЗапасыЗаказПокупателя", "Видимость",
		НЕ Объект.ВключатьРасходыВСебестоимость И ЕстьЗаказПокупателяРасходы);
	
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеНачалоВыбора(Элемент, ИмяТабличнойЧасти)
	
	ТекущаяСтрока = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Объект", "Объект");
	СвойстваРеквизита.Вставить("ТабЧасть", ИмяТабличнойЧасти);
	СвойстваРеквизита.Вставить("НомерСтроки", ТекущаяСтрока.НомерСтроки - 1);
	СвойстваРеквизита.Вставить("ИмяРеквизита", "Содержание");
	ЗаголовокФормыРедактирования = СтрШаблон(НСтр("ru='%1: содержание'"), Строка(ТекущаяСтрока.Номенклатура));
	
	ОбщегоНазначенияУНФКлиент.ПоказатьФормуРедактированияРеквизита(Элемент.ТекстРедактирования, ЭтотОбъект,
		СвойстваРеквизита, ЗаголовокФормыРедактирования);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнформацияОбОтборе(Знач НаименованиеМетки)
	
	Возврат НоменклатураВДокументахСервер.ИнформацияОбОтборе(НаименованиеМетки);
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстСодержания(Знач Номенклатура, Знач Характеристика)
	Возврат ТабличныеЧастиУНФ.ТекстСодержания(Номенклатура, Характеристика);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкиИзмененияКоличества()
	
	НастройкиКоличества = ДокументыУНФКлиентСервер.ПараметрыСбросаКоличества();
	ДокументыУНФ.ЗаполнитьНастройкиКоличества(НастройкиКоличества);
	Возврат НастройкиКоличества;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроектИзЗаказа(ЗаказПокупателя)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказПокупателя, "Проект");

КонецФункции

#Область Подбор

&НаСервере
Процедура ПолучитьЗапасыИзХранилища(ПараметрыПолученияЗапасовИзХранилища)
	
	ЯчейкиВТабличнойЧасти = ПолучитьФункциональнуюОпцию("УчетПоЯчейкам") 
		И Объект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(ПараметрыПолученияЗапасовИзХранилища.АдресЗапасовВХранилище);
	
	// Объединение строк
	ЕстьЦенаВТабличнойЧасти = ДокументыУНФ.ЕстьЦенаВТабличнойЧасти(Объект,
		ПараметрыПолученияЗапасовИзХранилища.ИмяТабличнойЧасти);
	
	СтруктурыПоискаИдентичныхСтрок = ДокументыУНФ.СтруктурыПоискаИдентичныхСтрок(Объект, ТаблицаДляЗагрузки,
		ПараметрыПолученияЗапасовИзХранилища.ИмяТабличнойЧасти);
	СтруктураПоискаСЦеной = СтруктурыПоискаИдентичныхСтрок.СтруктураПоискаСЦеной;
	СтруктураПоискаБезЦены = СтруктурыПоискаИдентичныхСтрок.СтруктураПоискаБезЦены;
	
	ОбъединятьСтроки = ОбъединятьСтрокиПриДобавлении
		И Не ПараметрыПолученияЗапасовИзХранилища.МассивНомеровИдентичныхСтрок = Неопределено;
	
	Если ПараметрыПолученияЗапасовИзХранилища.МассивНомеровДобавленныхСтрок = Неопределено Тогда
		ПараметрыПолученияЗапасовИзХранилища.МассивНомеровДобавленныхСтрок = Новый Массив;
	КонецЕсли;
	
	ЕстьСтруктурнаяЕдинцаВПодборе = НЕ ТаблицаДляЗагрузки.Колонки.Найти("СтруктурнаяЕдиница") = Неопределено;
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		Если Не ПараметрыПолученияЗапасовИзХранилища.ИмяТабличнойЧасти = ИмяТЧРасходы() Тогда
			Если Объект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке
					И РазрешитьСкладыВТабличныхЧастях Тогда
				Если ЕстьСтруктурнаяЕдинцаВПодборе И ЗначениеЗаполнено(СтрокаЗагрузки.СтруктурнаяЕдиница)
					И Не СтрокаЗагрузки.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница Тогда
					Объект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
					УстановитьВидимостьОтПользовательскихНастроек();
					
					СтруктурыПоискаИдентичныхСтрок = ДокументыУНФ.СтруктурыПоискаИдентичныхСтрок(Объект,
						ТаблицаДляЗагрузки, ПараметрыПолученияЗапасовИзХранилища.ИмяТабличнойЧасти);
					СтруктураПоискаСЦеной = СтруктурыПоискаИдентичныхСтрок.СтруктураПоискаСЦеной;
					СтруктураПоискаБезЦены = СтруктурыПоискаИдентичныхСтрок.СтруктураПоискаБезЦены;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ОбъединятьСтроки Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаЗагрузки.Цена) 
				Или Не ЕстьЦенаВТабличнойЧасти Тогда
				СтруктураПоиска = СтруктураПоискаБезЦены;
			Иначе
				СтруктураПоиска = СтруктураПоискаСЦеной;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаЗагрузки);
			НайденныеСтроки = Объект[ПараметрыПолученияЗапасовИзХранилища.ИмяТабличнойЧасти].НайтиСтроки(
				СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() Тогда
				НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество + СтрокаЗагрузки.Количество;
				ПараметрыПолученияЗапасовИзХранилища.МассивНомеровИдентичныхСтрок.Добавить(
					НайденныеСтроки[0].НомерСтроки - 1);
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока = Объект[ПараметрыПолученияЗапасовИзХранилища.ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		
		ПараметрыПолученияЗапасовИзХранилища.МассивНомеровДобавленныхСтрок.Добавить(НоваяСтрока.НомерСтроки - 1);
		
		Если ПараметрыПолученияЗапасовИзХранилища.ИмяТабличнойЧасти = ИмяТЧЗапасы() Тогда 
			ЗаполнениеОбъектовУНФ.ЗаполнитьСтрокуПоШапке(НоваяСтрока, Объект, "СтруктурнаяЕдиница", "ПоложениеСклада");
			ЗаполнениеОбъектовУНФ.ЗаполнитьСтрокуПоШапке(НоваяСтрока, Объект, "Ячейка", "ПоложениеСклада");
		КонецЕсли;
		
		Если НЕ СкладВШапке = Истина Тогда
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтруктурнаяЕдиница) Тогда
				
				НоваяСтрока.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыПолученияЗапасовИзХранилища.ИмяТабличнойЧасти = ИмяТЧЗапасы() Тогда
			
			Если ЗначениеЗаполнено(СтрокаЗагрузки.Номенклатура) Тогда
				
				ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаЗагрузки.Номенклатура,
					"ТипНоменклатуры, ЭтоНабор, СпособРасчетаЦеныНабора, Ячейка");
				
				СтруктураДанныеНоменклатуры = Новый Структура();
				СтруктураДанныеНоменклатуры.Вставить("Номенклатура", СтрокаЗагрузки.Номенклатура);
				СтруктураДанныеНоменклатуры.Вставить("Характеристика", СтрокаЗагрузки.Характеристика);
				СтруктураДанныеНоменклатуры.Вставить("Партия", СтрокаЗагрузки.Партия);
				СтруктураДанныеНоменклатуры.Вставить("Организация", Объект.Организация);
				СтруктураДанныеНоменклатуры.Вставить("СтруктурнаяЕдиница", НоваяСтрока.СтруктурнаяЕдиница);
				СтруктураДанныеНоменклатуры.Вставить("ТипНоменклатуры", ЗначенияРеквизитов.ТипНоменклатуры);
				СтруктураДанныеНоменклатуры.Вставить("ЕдиницаИзмерения", СтрокаЗагрузки.ЕдиницаИзмерения);
				СтруктураДанныеНоменклатуры.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
				СтруктураДанныеНоменклатуры.Вставить("ДатаОбработки", Объект.Дата);
								
				СерииНоменклатурыУНФКлиентСервер.ДополнитьСтруктуруДаннымиДляПолученияСерийНоменклатуры(Объект,
					СтруктураДанныеНоменклатуры);
				СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры);
				
				Если ЯчейкиВТабличнойЧасти Тогда
					НоваяСтрока.Ячейка = ?(ПараметрыПолученияЗапасовИзХранилища.ЗаполнениеПоОстаткам
						И УчетОстатковПоСкладскимОрдерам, СтрокаЗагрузки.Ячейка, ЗначенияРеквизитов.Ячейка);
				КонецЕсли;
				
				// Характеристики
				НоваяСтрока.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
				НоваяСтрока.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
				НоваяСтрока.ЗаполнениеХарактеристикиПроверено = Истина;
				
				Если СтруктураДанные.ИспользоватьХарактеристики
					Тогда
					НоваяСтрока.Характеристика = СтруктураДанные.Характеристика;
				КонецЕсли;
				// Конец Характеристики
				
				//Партии
				НоваяСтрока.ИспользоватьПартии = СтруктураДанные.ИспользоватьПартии;
				НоваяСтрока.ПроверятьЗаполнениеПартий = СтруктураДанные.ПроверятьЗаполнениеПартий;
				НоваяСтрока.КомиссияСНДС = СтруктураДанные.КомиссияСНДС;
				
				Если СтруктураДанные.ИспользоватьПартии
					Тогда
					НоваяСтрока.Партия = СтруктураДанные.Партия;
				КонецЕсли;
				// Конец Партии
				
				НоваяСтрока.ЗапретитьВводДробногоКоличества = СтруктураДанные.ЗапретитьВводДробногоКоличества;
				
				НоваяСтрока.СтатусыСерийНоменклатуры = СтруктураДанные.СтатусыСерийНоменклатуры;
				ТабличныеЧастиУНФКлиентСервер.ЗаполнитьКлючСвязи(
					Объект[ПараметрыПолученияЗапасовИзХранилища.ИмяТабличнойЧасти], НоваяСтрока, "КлючСвязи");
				
			КонецЕсли;
			
		ИначеЕсли ПараметрыПолученияЗапасовИзХранилища.ИмяТабличнойЧасти = ИмяТЧРасходы() Тогда
			
			Если СтрокаЗагрузки.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
				И СтрокаЗагрузки.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы
				И СтрокаЗагрузки.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
				И СтрокаЗагрузки.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
				
				// Не указывается
				
			Иначе
				
				НоваяСтрока.СтруктурнаяЕдиница = ОсновноеПодразделение;
				
			КонецЕсли;
			
			НоваяСтрокаНоменклатура = НоваяСтрока.Номенклатура; // СправочникСсылка.Номенклатура
			
			НоваяСтрока.ЗапретитьВводДробногоКоличества = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				НоваяСтрокаНоменклатура, "ЗапретитьВводДробногоКоличества", Истина);
			
			Если СтрокаЗагрузки.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
				И СтрокаЗагрузки.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
				И СтрокаЗагрузки.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
				
				// Не указывается
				
			Иначе
				
				НоваяСтрока.НаправлениеДеятельности = СтрокаЗагрузки.Номенклатура.НаправлениеДеятельности;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПараметрыПолученияЗапасовИзХранилища.ИмяТабличнойЧасти = ИмяТЧЗапасы() Тогда
		ОбновитьДоступностьЯчеек();
		ЗаполнитьПризнакиДоступностиЯчеек(ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаКлиентеНаСервереБезКонтекста
Функция НовыеПараметрыПолученияЗапасовИзХранилища(Знач АдресЗапасовВХранилище, Знач ИмяТабличнойЧасти)
	Результат = Новый Структура;
	Результат.Вставить("АдресЗапасовВХранилище", АдресЗапасовВХранилище);
	Результат.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	Результат.Вставить("ИдентификаторыНовыхСтрок", Неопределено);
	Результат.Вставить("ЗаполнениеПоОстаткам", Ложь);
	Результат.Вставить("МассивНомеровДобавленныхСтрок", Неопределено);
	Результат.Вставить("МассивНомеровИдентичныхСтрок", Неопределено);
	Возврат Результат;
КонецФункции

&НаСервере
Функция НомераИдентичныхСтрокВТабличнойЧасти(АдресЗапасовВХранилище, ИмяТабличнойЧасти = "Запасы")
	
	Возврат ДокументыУнф.НомераИдентичныхСтрокВТабличнойЧасти(Объект, АдресЗапасовВХранилище, ИмяТабличнойЧасти);
	
КонецФункции

&НаСервере
Процедура ПолучитьЗапасыИзХранилищаКомиссия(АдресЗапасовВХранилище, ИдентификаторыНовыхСтрок)
	ПараметрыПолученияЗапасовИзХранилища = НовыеПараметрыПолученияЗапасовИзХранилища(АдресЗапасовВХранилище, "Запасы");
	ПараметрыПолученияЗапасовИзХранилища.ИдентификаторыНовыхСтрок = ИдентификаторыНовыхСтрок;
	ПараметрыПолученияЗапасовИзХранилища.ЗаполнениеПоОстаткам = Истина;
	ПолучитьЗапасыИзХранилища(ПараметрыПолученияЗапасовИзХранилища);
	УстановитьВидимостьОтПользовательскихНастроек();
КонецПроцедуры

&НаСервере
Процедура ОпределитьВидимостьНастроекУчетаВНалогообложении()
	
	Если Не Справочники.Организации.ЭтоИП(Объект.Организация) Тогда
		Элементы.ГруппаУчетВНУ.Видимость = Ложь;
	Иначе
		СистемаНалогообложенияСтруктура
			= РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
			Объект.Организация, Объект.Дата);
		Элементы.ГруппаУчетВНУ.Видимость = СистемаНалогообложенияСтруктура.ПлательщикУСН;
	КонецЕсли;
	
	Элементы.ЗапасыТоварыНеДляПродажи.Видимость = Элементы.ГруппаУчетВНУ.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеВнешнимВидомФормы

&НаСервере
Процедура УстановитьВидимостьИДоступность(ЭтоНовыйОбъект = Ложь)
	
	Если НЕ МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
			
			Если УчетОстатковПоСкладскимОрдерам Тогда
				
				Элементы.ЗапасыЗапасыПодбор.Видимость = Истина;
				Элементы.ЗапасыЗаполнение.Видимость = Истина;
			
				Элементы.ГруппаЗапасыПодборОрдер.Видимость = Ложь;
				Элементы.ГруппаЗапасыПодбор.Видимость = Ложь;
				
				Элементы.ЗапасыЗаполнитьОрдер.Видимость = Истина;
				
			Иначе
				Элементы.ЗапасыЗапасыПодбор.Видимость = Истина;
			КонецЕсли;
			
	КонецЕсли;
	
	Элементы.РасходыСтруктурнаяЕдиница.Видимость = НЕ Объект.ВключатьРасходыВСебестоимость;
	Элементы.РасходыНаправлениеДеятельности.Видимость = НЕ Объект.ВключатьРасходыВСебестоимость;
	Элементы.ЗапасыСуммаРасходов.Видимость = Объект.ВключатьРасходыВСебестоимость;
	
	НоменклатураВДокументахКлиентСервер.ЗаполнитьТаблицуНастроекФормыВыбораНоменклатуры(ЭтотОбъект,
		"РасходыПредпринимателя", НастройкиФормыВыбораНоменклатуры, Истина);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	НовыйМассив.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Розница);
	НовыйМассив.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет);
	МассивСобственныеЗапасыИТоварыНаКомиссии = Новый ФиксированныйМассив(НовыйМассив);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", МассивСобственныеЗапасыИТоварыНаКомиссии);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.СтруктурнаяЕдиница.ПараметрыВыбора = НовыеПараметры;
		
	Элементы.ЗапасыСебестоимость.Видимость = Ложь;
	Если НЕ Элементы.ЗапасыСебестоимость.Видимость Тогда
		Если Объект.Запасы.Количество() > 0 Тогда
			Для каждого СтрокаЗапасы Из Объект.Запасы Цикл
				СтрокаЗапасы.Себестоимость = 0;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Партии.
	
	Элементы.ЗапасыПартия.АвтоОтметкаНезаполненного = Ложь;
	
	МассивСтатусовДляВыбораНоменклатуры = Новый Массив;
	
	НовыйМассив = Новый Массив();
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", Перечисления.СтатусыПартий.СобственныеЗапасы);
	НовыйМассив.Добавить(НовыйПараметр);
	
	МассивСтатусовДляВыбораНоменклатуры.Добавить(Перечисления.СтатусыПартий.СобственныеЗапасы);
	
	НовыйПараметр = Новый ПараметрВыбора("Дополнительно.ОграничениеСтатуса", Перечисления.СтатусыПартий.СобственныеЗапасы);
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПартия.ПараметрыВыбора = НовыеПараметры;
	
	// Ставка НДС, Сумма НДС, Всего.
	УстановитьВидимостьПоНалогообложению();
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеДоступомУНФ.РазрешеноРедактированиеЦенДокументов();
	
	Элементы.ЗапасыЦена.ТолькоПросмотр 		= НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСумма.ТолькоПросмотр 	= НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСуммаНДС.ТолькоПросмотр 	= НЕ РазрешеноРедактированиеЦенДокументов;
	
	// Обновим подвал формы.
	ИтогВсего = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего");
	ИтогСуммаНДС = Объект.Запасы.Итог("СуммаНДС") + Объект.Расходы.Итог("СуммаНДС");
	
	УстановитьВидимостьОтПользовательскихНастроек();
	
	НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтотОбъект, ИмяТЧЗапасы());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоНалогообложению()
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыВсего.Видимость = Истина;
		Элементы.РасходыСтавкаНДС.Видимость = Истина;
		Элементы.РасходыСуммаНДС.Видимость = Истина;
		Элементы.РасходыВсего.Видимость = Истина;
		
	Иначе
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыВсего.Видимость = Ложь;
		Элементы.РасходыСтавкаНДС.Видимость = Ложь;
		Элементы.РасходыСуммаНДС.Видимость = Ложь;
		Элементы.РасходыВсего.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры // УстановитьВидимостьИДоступность()

&НаСервере
Процедура УстановитьВидимостьОтПользовательскихНастроек()
	
	Если Объект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтруктурнаяЕдиница", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Ячейка", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыСтруктурнаяЕдиница", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыЯчейка", "Видимость", Истина);
		СкладВШапке = Ложь;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтруктурнаяЕдиница", "Видимость", Истина);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Ячейка", "Видимость", Истина);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыСтруктурнаяЕдиница", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыЯчейка", "Видимость", Ложь);
		СкладВШапке = Истина;
	КонецЕсли;
	
	Если Объект.ПоложениеПроекта = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
		Элементы.РасходыПроект.Видимость = Истина;
		Элементы.Проект.Видимость = Ложь;
	Иначе
		Элементы.РасходыПроект.Видимость = Ложь;
		Элементы.Проект.Видимость = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыСодержание", "Видимость",
		ПоказыватьКолонкуСодержаниеВПриходнойНакладнойЗапасы);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыСодержание", "Видимость",
		ПоказыватьКолонкуСодержаниеВПриходнойНакладнойРасходы);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	УстановитьУсловноеОформлениеКоличества();
	УстановитьУсловноеОформлениеСебестоимости();
	НоменклатураВДокументахСервер.ОбновитьУсловноеОформлениеТабличнойЧастиДляХарактеристик(ЭтотОбъект);
	УстановитьУсловноеОформлениеЯчеек();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеКоличества()

	УсловноеОформлениеКоличество = УсловноеОформление.Элементы.Добавить();

	РаботаСФормой.ДобавитьОформляемыеПоля(УсловноеОформлениеКоличество, "ЗапасыКоличество");

	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УсловноеОформлениеКоличество, "Текст",
		Новый ПолеКомпоновкиДанных("Объект.Запасы.КоличествоПредставление"));

	РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(
		УсловноеОформлениеКоличество.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);

	УсловноеОформлениеКоличествоСправочно = УсловноеОформление.Элементы.Добавить();

	РаботаСФормой.ДобавитьОформляемыеПоля(УсловноеОформлениеКоличествоСправочно, "ЗапасыКоличествоСправочно");

	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УсловноеОформлениеКоличествоСправочно, "Текст",
		Новый ПолеКомпоновкиДанных("Объект.Запасы.КоличествоСправочноПредставление"));

	РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(
		УсловноеОформлениеКоличествоСправочно.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСебестоимости()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.Себестоимость", 0);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыСебестоимость");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = '<Авто>'"));
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Серый);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеЯчеек()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"Объект.Запасы.ЯчейкаДоступна", Ложь);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыЯчейка");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);

КонецПроцедуры

&НаКлиенте
Функция ЯчейкаДоступна(СтруктурнаяЕдиница)
	
	Если НЕ КэшЗначений.УчетПоЯчейкам Тогда
		Возврат Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) ИЛИ ТипЗнч(СтруктурнаяЕдиница)<>Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
		Возврат Ложь;
	КонецЕсли; 
	Если НЕ КэшЗначений.Свойство("ДоступностьЯчеек") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Результат = КэшЗначений.ДоступностьЯчеек.Получить(СтруктурнаяЕдиница);
	Если Результат = Неопределено Тогда
		МассивСтруктурныхЕдиниц = Новый Массив;
		МассивСтруктурныхЕдиниц.Добавить(СтруктурнаяЕдиница);
		ДополнитьДоступностьЯчеек(МассивСтруктурныхЕдиниц, КэшЗначений.ДоступностьЯчеек);
		Результат = КэшЗначений.ДоступностьЯчеек.Получить(СтруктурнаяЕдиница);
		Если Результат=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьДоступностьЯчеек()
	
	Если НЕ КэшЗначений.УчетПоЯчейкам Тогда
		Возврат;
	КонецЕсли; 	
	
	Если НЕ КэшЗначений.Свойство("ДоступностьЯчеек") Тогда
		КэшЗначений.Вставить("ДоступностьЯчеек", Новый ФиксированноеСоответствие(Новый Соответствие));
	КонецЕсли; 
	
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если Объект.ПоложениеСклада=Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
		Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
			МассивСтруктурныхЕдиниц.Добавить(СтрокаТабличнойЧасти.СтруктурнаяЕдиница);
		КонецЦикла; 
	Иначе
		МассивСтруктурныхЕдиниц.Добавить(Объект.СтруктурнаяЕдиница);
	КонецЕсли;
	МассивСтруктурныхЕдиниц = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСтруктурныхЕдиниц);
	ДополнитьДоступностьЯчеек(МассивСтруктурныхЕдиниц, КэшЗначений.ДоступностьЯчеек);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьДоступностьЯчеек(СтруктурныеЕдиницы, СоответствиеСтруктурныхЕдиниц)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурныеЕдиницы", СтруктурныеЕдиницы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка,
	|	СтруктурныеЕдиницы.ОрдерныйСклад КАК ОрдерныйСклад,
	|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
	|	СтруктурныеЕдиницы.УчетОстатковПоЯчейкам КАК УчетОстатковПоЯчейкам
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка В(&СтруктурныеЕдиницы)";
	Выборка = Запрос.Выполнить().Выбрать();
	Соответствие = Новый Соответствие(СоответствиеСтруктурныхЕдиниц);
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Ссылка, Выборка.ТипСтруктурнойЕдиницы=Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	КонецЦикла; 
	СоответствиеСтруктурныхЕдиниц = Новый ФиксированноеСоответствие(Соответствие);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПризнакиДоступностиЯчеек(Форма)

	Объект = Форма.Объект;
	КэшЗначений = Форма.КэшЗначений;
	Если НЕ КэшЗначений.УчетПоЯчейкам Тогда
		Возврат;
	КонецЕсли;
	Если Объект.ПоложениеСклада<>ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти") Тогда
		Возврат;
	КонецЕсли; 
	 
	Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		Результат = КэшЗначений.ДоступностьЯчеек.Получить(СтрокаТабличнойЧасти.СтруктурнаяЕдиница);
		Если Результат=Неопределено Тогда
			Результат = Ложь;
		КонецЕсли; 
		СтрокаТабличнойЧасти.ЯчейкаДоступна = Результат И ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтруктурнаяЕдиница);
	КонецЦикла; 
	
КонецПроцедуры 

#КонецОбласти

#Область ЗаполнениеОбъектов

&НаСервере
Функция ОтображаемыеРеквизиты()
	
	Возврат ЗаполнениеОбъектовУНФ.ОтображаемыеРеквизиты(ЭтотОбъект);
	
КонецФункции

#КонецОбласти

#Область КопированиеСтрокТабличныхЧастей

&НаКлиенте
Процедура КопироватьСтроки(ИмяТЧ)
	
	Если КопированиеТабличнойЧастиКлиент.МожноКопироватьСтроки(Объект[ИмяТЧ], Элементы[ИмяТЧ].ТекущиеДанные) Тогда
		КоличествоСкопированных = 0;
		КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных);
		КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОКопированииСтрок(КоличествоСкопированных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтроки(ИмяТЧ)
	
	КоличествоСкопированных = 0;
	КоличествоВставленных = 0;
	ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтроки(ИмяТЧ, КоличествоВставленных);
	КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоСкопированных, КоличествоВставленных);
	
КонецПроцедуры

&НаСервере
Процедура КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных)
	
	КопированиеТабличнойЧастиСервер.Копировать(Объект[ИмяТЧ], Элементы[ИмяТЧ].ПолучитьСтрокиДляОбработки(), КоличествоСкопированных);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных)
	
	КопированиеТабличнойЧастиСервер.Вставить(Объект, ИмяТЧ, Элементы, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных);
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	ОбновитьДоступностьЯчеек();
	ЗаполнитьПризнакиДоступностиЯчеек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВставленныеСтроки(ИмяТЧ, КоличествоВставленных)
	
	Если ИмяТЧ = ИмяТЧЗапасы() Тогда
		Количество = Объект[ИмяТЧ].Количество();
		
		Для Итератор = 1 По КоличествоВставленных Цикл
			
			Строка = Объект[ИмяТЧ][Количество - Итератор];
			РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧЗапасы(), Строка);
			
			//@skip-check query-in-loop
			Строка.ЯчейкаДоступна = ЯчейкаДоступна(Строка.СтруктурнаяЕдиница);
			
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных)
	
	Количество = Объект[ИмяТЧ].Количество();
	
	Для Итератор = 1 По КоличествоВставленных Цикл
		Строка = Объект[ИмяТЧ][Количество - Итератор];
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Организация",        Объект.Организация);
		СтруктураДанные.Вставить("Номенклатура",       Строка.Номенклатура);
		СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
		СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);

		
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		
		Если ИмяТЧ = ИмяТЧЗапасы() Тогда
			
			Строка.СтавкаНДС = СтруктураДанные.СтавкаНДС;
			
		ИначеЕсли ИмяТЧ = ИмяТЧРасходы() Тогда
			
			Строка.СтруктурнаяЕдиница = ОсновноеПодразделение;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда
			Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ГрупповоеИзменениеСтрок

&НаСервере
Процедура УстановитьПометку(ИмяТЧ, Пометка)
	
	Для каждого Строка Из Объект[ИмяТЧ] Цикл
		Строка.Пометка = Пометка;
	КонецЦикла;
	
	ГрупповоеИзменениеСтрокСервер.СтрокаПометкаПриИзменении(
	Объект[ИмяТЧ],
	Элементы[ИмяТЧ + "УстановитьФлажки"],
	Элементы[ИмяТЧ + "СнятьФлажки"],
	Элементы[ИмяТЧ + "ИзменитьВыделенные"]);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеРезервнымиКопиямиТаблицы(СостояниеПерехода, ИзменяетДанные, ИмяТЧ)
	
	УстанавливатьПометки = Ложь;
	
	ГрупповоеИзменениеСтрокСервер.УправлениеРезервнымиКопиями(
	ЭтотОбъект,
	Объект[ИмяТЧ],
	ЭтотОбъект[ИмяТЧ + "РезервнаяКопияТаблицыАдрес"],
	СостояниеПерехода,
	ИзменяетДанные,
	УстанавливатьПометки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТаблицу(ИмяТЧ)
	
	Если ИмяТЧ = ИмяТЧЗапасы() Тогда
		ВыполненноеДействие = ЗапасыИзменениеСтрокДействие;
	ИначеЕсли ИмяТЧ = ИмяТЧРасходы() Тогда
		ВыполненноеДействие = РасходыИзменениеСтрокДействие;
	КонецЕсли;
	
	//Партии
	Если ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.СоздатьПартииНоменклатуры")
		Тогда
		
		ИзменяемыеСтроки = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("Пометка", Истина));
		
		Если Не ИзменяемыеСтроки.Количество()
			Тогда
			Возврат
		КонецЕсли;
		
		СоздатьПартииНоменклатурыНаКлиенте();
		
	КонецЕсли;
	//Конец Партии
		
	ОбработатьТаблицуНаСервере(ИмяТЧ);
	
	ИзменяемыеСтроки = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("Пометка", Истина));
	Для каждого Строка Из ИзменяемыеСтроки Цикл
		
		Если ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент")
			ИЛИ ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены")
			ИЛИ ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦеныПоВиду")
			ИЛИ ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦены") Тогда
			
			РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧ, Строка);
			
		ИначеЕсли ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента")
			И ИмяТЧ = ИмяТЧЗапасы() Тогда
			
			РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧ, Строка);
			
		ИначеЕсли ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьСуммы") Тогда
			
			Если Строка.Количество <> 0 Тогда
				Строка.Цена = Строка.Сумма / Строка.Количество;
			КонецЕсли;
			
			РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧ, Строка);
			
		ИначеЕсли ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
			
			ТабличныеЧастиУНФКлиент.РассчитатьСуммуНДСИВсего(Строка, Новый Структура("СуммаВключаетНДС",Объект.СуммаВключаетНДС));	
			ОбновитьПодвалФормы();
			
		ИначеЕсли ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству")
			ИЛИ ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			
			Если Строка.Количество <> 0 Тогда
				Строка.Цена = Строка.Сумма / Строка.Количество;
			КонецЕсли;
			
			ТабличныеЧастиУНФКлиент.РассчитатьСуммуНДСИВсего(Строка, Новый Структура("СуммаВключаетНДС",Объект.СуммаВключаетНДС));	
			ОбновитьПодвалФормы();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
		УстановитьПометку(ИмяТЧ, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуНаСервере(ИмяТЧ)
	
	Если ИмяТЧ = ИмяТЧЗапасы() Тогда
		
		ГрупповоеИзменениеСтрокСервер.ОбработатьТаблицу(
			ЭтотОбъект,
			Объект.Запасы,
			ЗапасыИзменениеСтрокДействие,
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит,
			ЗапасыИзменениеСтрокЗначение,
			"ЗапасыНоменклатура");
		
		Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			ИзменяемыеСтроки = Объект.Запасы.НайтиСтроки(Новый Структура("Пометка", Истина));
			Для каждого Строка Из ИзменяемыеСтроки Цикл
				
				СтруктураДанные = Новый Структура;
				СтруктураДанные.Вставить("Организация", Объект.Организация);
				СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
				СтруктураДанные.Вставить("Характеристика", Строка.Характеристика);
				СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
				СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
				
				СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
				
				Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
				Если НЕ ЗначениеЗаполнено(Строка.Количество) Тогда
					Строка.Количество = 1;
				КонецЕсли;
				Строка.Цена = СтруктураДанные.Цена;
				Строка.СтавкаНДС = СтруктураДанные.СтавкаНДС;
				Строка.Содержание = "";
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЗапасыИзменениеСтрокДействие =Перечисления.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента
			ИЛИ ЗапасыИзменениеСтрокДействие = Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьСклад Тогда
			
			ОбновитьДоступностьЯчеек();
			ЗаполнитьПризнакиДоступностиЯчеек(ЭтотОбъект);
			
		КонецЕсли; 
				
	ИначеЕсли ИмяТЧ = ИмяТЧРасходы() Тогда
		
		ГрупповоеИзменениеСтрокСервер.ОбработатьТаблицу(
			ЭтотОбъект,
			Объект.Расходы,
			РасходыИзменениеСтрокДействие,
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит,
			РасходыИзменениеСтрокЗначение,
			"РасходыНоменклатура");
		
		Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
		
			ИзменяемыеСтроки = Объект.Расходы.НайтиСтроки(Новый Структура("Пометка", Истина));
			Для каждого Строка Из ИзменяемыеСтроки Цикл
				
				СтруктураДанные = Новый Структура();
				СтруктураДанные.Вставить("Организация", Объект.Организация);
				СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
				СтруктураДанные.Вставить("Характеристика", "");
				СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
				СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
				
				СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
				
				Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
				Если НЕ ЗначениеЗаполнено(Строка.Количество) Тогда
					Строка.Количество = 1;
				КонецЕсли;
				Строка.Цена = 0;
				Строка.Сумма = 0;
				Строка.СтавкаНДС = СтруктураДанные.СтавкаНДС;
				Строка.СуммаНДС = 0;
				Строка.Всего = 0;
				Строка.Содержание = "";
				
				Если СтруктураДанные.ОчиститьЗаказИПодразделение Тогда
					Строка.СтруктурнаяЕдиница = Неопределено;
					Строка.ЗаказПокупателя = Неопределено;
				ИначеЕсли НЕ ЗначениеЗаполнено(Строка.СтруктурнаяЕдиница) Тогда
					Строка.СтруктурнаяЕдиница = ОсновноеПодразделение;
				КонецЕсли;
				
				Если СтруктураДанные.ОчиститьНаправлениеДеятельности Тогда
					Строка.НаправлениеДеятельности = Неопределено;
				Иначе
					Строка.НаправлениеДеятельности = СтруктураДанные.НаправлениеДеятельности;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьОбъектИзменений(ИмяТЧ)
	
	Если ИмяТЧ = ИмяТЧЗапасы() Тогда
		
		Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЦена";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЦена";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьСуммы") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСумма";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦены") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЦена";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦеныПоВиду") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЦена";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСумма";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСумма";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "СтавкаНДС";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСтавкаНДС";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПоставщикуЗаказПокупателя") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "ЗаказПокупателя";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЗаказПокупателя";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьПоКоличествуВЗаказе") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "";

		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСклад") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "СтруктурнаяЕдиница";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСтруктурнаяЕдиница";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЯчейку") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Ячейка";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЯчейка";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки")
			ИЛИ ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "";
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.СоздатьПартииНоменклатуры") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Партия";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыПартия";
			
		КонецЕсли;
	
	ИначеЕсли ИмяТЧ = ИмяТЧРасходы() Тогда
		
		Если РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыЦена";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыЦена";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыСумма";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыСумма";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "СтавкаНДС";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыСтавкаНДС";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки")
			ИЛИ РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДействий(ИмяТЧ)
	
	РазрешеноРедактированиеЦенДокументов = УправлениеДоступомУНФ.РазрешеноРедактированиеЦенДокументов();
	
	Если ИмяТЧ = ИмяТЧЗапасы() Тогда
		
		Действия = Новый Массив;
		Если РазрешеноРедактированиеЦенДокументов Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент);
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ОкруглитьСуммы);
		
		Если РазрешеноРедактированиеЦенДокументов Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьЦены);
		КонецЕсли;
		
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьЦеныПоВиду);
		
		Если РазрешеноРедактированиеЦенДокументов Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству);
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам);
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС);
		Если Не ЗаказВШапке Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПоставщикуЗаказПокупателя);
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьПоКоличествуВЗаказе);
		Если Не СкладВШапке Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьСклад);
			Если ПолучитьФункциональнуюОпцию("УчетПоЯчейкам") Тогда
				Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьЯчейку);
			КонецЕсли;
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки);
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ЗаполнитьСерииНоменклатуры);
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьДействияИзменить(Действия, ИмяТЧ);
	
КонецПроцедуры

// Создание Партий Номенклатуры
&НаКлиенте
Процедура СоздатьПартииНоменклатурыНаКлиенте() Экспорт
	
	ВладелецПартии = Неопределено;
	
	НаименованиеПартий = ЗапасыИзменениеСтрокЗначение;
	
	Если Не ЗначениеЗаполнено(СокрЛП(НаименованиеПартий))
		Тогда
		НаименованиеПартий = "Партия создана автоматически";
	КонецЕсли;
		
	СоздатьПартииНоменклатурыНаСервере(ВладелецПартии, НаименованиеПартий)
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПартииНоменклатурыНаСервере(ВладелецПартии, НаименованиеПартий)
	
	СтатусПартии = Перечисления.СтатусыПартий.СобственныеЗапасы;
	
	Если Не ЗначениеЗаполнено(СтатусПартии) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	ИзменяемыеСтроки = Объект.Запасы.НайтиСтроки(Новый Структура("Пометка", Истина));
	
	ТаблицаСозданныеПартии = Новый ТаблицаЗначений;
	
	ТаблицаСозданныеПартии.Колонки.Добавить("Номенклатура");
	ТаблицаСозданныеПартии.Колонки.Добавить("Партия");
	
	СтруктураПоискаСозданнойПартии = Новый Структура("Номенклатура", Неопределено);
	
	Для каждого Строка Из ИзменяемыеСтроки Цикл
		
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			СтруктураПоискаСозданнойПартии.Номенклатура = Строка.Номенклатура;
			
			НайденныеСтрокиСозданныхПартий = ТаблицаСозданныеПартии.НайтиСтроки(СтруктураПоискаСозданнойПартии);
			
			Если НайденныеСтрокиСозданныхПартий.Количество() Тогда
				Строка.Партия = НайденныеСтрокиСозданныхПартий[0].Партия;
			Иначе
				
				НоваяПартия = СоздатьПартиюНоменклатуры(Строка.Номенклатура, ВладелецПартии, СтатусПартии, НаименованиеПартий);
				
				Если ЗначениеЗаполнено(НоваяПартия) Тогда
					Строка.Партия = НоваяПартия;
					Строка.ИспользоватьПартии = Истина;
					
					НоваяСтрока = ТаблицаСозданныеПартии.Добавить();
					НоваяСтрока.Номенклатура = Строка.Номенклатура;
					НоваяСтрока.Партия = НоваяПартия;
					
				Иначе
					ОтменитьТранзакцию();
					Возврат
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Функция СоздатьПартиюНоменклатуры(Номенклатура, ВладелецПартии, СтатусПартии, НаименованиеПартий)
	
	НоваяПартия = Справочники.ПартииНоменклатуры.СоздатьЭлемент();
	НоваяПартия.Владелец = Номенклатура;
	НоваяПартия.ВладелецПартии = ВладелецПартии;
	НоваяПартия.Статус = СтатусПартии[0].Значение;
	НоваяПартия.Наименование = НаименованиеПартий;
	
	Если НоваяПартия.Статус = Перечисления.СтатусыПартий.ТоварыНаКомиссии Тогда
		НоваяПартия.НалогообложениеНДС = Объект.НалогообложениеНДС;
	КонецЕсли;
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Номенклатура, "ИспользоватьПартии, Наименованием");
	
	Если Не РеквизитыНоменклатуры.ИспользоватьПартии
		Тогда
		ОбъектНоменклатура = Номенклатура.ПолучитьОбъект();
		ОбъектНоменклатура.ИспользоватьПартии = Истина;
		Попытка
			ОбъектНоменклатура.Записать();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ШаблонСообщения = НСтр(
				"ru = 'При установке признака ""Использовать партии"", для номенклатуры ""%1"" произошла ошибка:
				|%2'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, РеквизитыНоменклатуры.Наименование, КраткоеПредставлениеОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;
		КонецПопытки;
		
	КонецЕсли;
	
	Попытка
		НоваяПартия.Записать();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ШаблонСообщения = НСтр(
			"ru = 'При создании партии для номенклатуры ""%1"" произошла ошибка:
			|%2'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, РеквизитыНоменклатуры.Наименование, КраткоеПредставлениеОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат НоваяПартия.Ссылка;
	
КонецФункции

// Конец Создание Партий Номенклатуры

#КонецОбласти

#Область АвтоподборКонтактов

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	АвтоподборКонтактовКлиент.Подключаемый_ОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);

КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_АвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	АвтоподборКонтактовКлиент.Подключаемый_АвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, Параметры, Ожидание,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаССериямиНоменклатуры

&НаКлиенте
Процедура ОткрытьПодборСерииНоменклатуры()
		
	ТекущиеДанныеИдентификатор = Элементы.Запасы.ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыСерийНоменклатуры = ПараметрыПодбораСерийНоменклатуры(ТекущиеДанныеИдентификатор);
	ОткрытьФорму("Обработка.ПодборСерийНоменклатуры.Форма", ПараметрыСерийНоменклатуры, ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция ПолучитьСерииНоменклатурыИзХранилища(АдресВоВременномХранилище, КлючСтроки)
	
	Модифицированность = Истина;
	Возврат СерииНоменклатурыУНФ.ПолучитьСерииНоменклатурыИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки);
	
КонецФункции

&НаСервере
Функция ПараметрыПодбораСерийНоменклатуры(ТекущиеДанныеИдентификатор)
	
	Возврат СерииНоменклатурыУНФ.ПараметрыПодбораСерийНоменклатуры(Объект, УникальныйИдентификатор, ТекущиеДанныеИдентификатор, Ложь);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область Доставка

&НаСервере
Процедура УстановитьВидимостьДанныхПоДоставке()
	ДоставкаСервер.ОбновитьДанныеПоДоставкеИзСервиса(Объект.Ссылка, "ГруппаДоставка", Объект.Организация, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область Константы

&НаКлиентеНаСервереБезКонтекста
Функция ИмяТЧЗапасы()
	
	Возврат "Запасы"; // Не локализуется
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяТЧРасходы()
	
	Возврат "Расходы"; // Не локализуется
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ЗаполнитьПризнакиИспользованияХарактеристик()
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументОснование()

	СписокДокументОснование.Добавить("Документ.ЗаказПоставщику.ФормаВыбора", НСтр("ru = 'Заказ поставщику'"));
	СписокДокументОснование.Добавить("Документ.ЗаказПокупателя.ФормаВыбора", НСтр("ru = 'Заказ покупателя'"));
	СписокДокументОснование.Добавить("Документ.СчетНаОплатуПоставщика.ФормаВыбора", НСтр("ru = 'Счет на оплату поставщика'"));
	СписокДокументОснование.Добавить("Документ.СчетНаОплату.ФормаВыбора", НСтр("ru = 'Счет на оплату'"));

КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтрокуТабличнойЧастиЗавершение(Знач КоличествоВНовойСтроке, Знач СтрокаТабличнойЧасти) Экспорт
	
	Если КоличествоВНовойСтроке = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКДанным = СтрШаблон("Объект.Запасы[%1].Количество",
	Формат(СтрокаТабличнойЧасти.НомерСтроки - 1, "ЧГ="));
	
	Если КоличествоВНовойСтроке <= 0 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Количество в новой строке должно быть больше нуля.'"), , ПутьКДанным);
		
		Возврат;
		
	КонецЕсли;
	
	Если КоличествоВНовойСтроке >= СтрокаТабличнойЧасти.Количество Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Количество в новой строке должно быть меньше чем в текущей.'"), , ПутьКДанным);
		
		Возврат;
		
	КонецЕсли;
	
	НоваяСтрока = Объект.Запасы.Вставить(СтрокаТабличнойЧасти.НомерСтроки);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
	
	СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество - КоличествоВНовойСтроке;
	НоваяСтрока.Количество = КоличествоВНовойСтроке;
	НоваяСтрока.КлючСвязи = 0;
	НоваяСтрока.СерииНоменклатуры = "";
	СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, НоваяСтрока);
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧЗапасы(), СтрокаТабличнойЧасти);
	РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТЧЗапасы(), НоваяСтрока);
	
	ОбновитьПодвалФормы();
	
	Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
КонецПроцедуры

#Область КассовыеЧекиПодотчетныхЛиц

&НаСервереБезКонтекста
Функция ОписаниеДокументаДляЗагрузкиКассовыхЧековПодотчетныхЛиц()
	
	ОписаниеДокумента = УчетКассовыхЧековПодотчетныхЛиц.НовыйОписаниеДокумента(ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц());
	ОписаниеДокумента.Номенклатура               = Истина;
	ОписаниеДокумента.ДополнительныйТекстБаннера = НСтр("ru='Загрузить чеки можно на закладке ""Запасы"" или ""Услуги"".'");
	Возврат ОписаниеДокумента;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц()
	
	ОписаниеФормы = УчетКассовыхЧековПодотчетныхЛицКлиентСервер.НовыйОписаниеФормы();
	ОписаниеФормы.КнопкиЗагрузитьЧеки.Добавить("ЗапасыПодобратьЧекиЗапасы");
	ОписаниеФормы.КнопкиЗагрузитьЧеки.Добавить("РасходыПодобратьЧекиРасходы");
	Возврат ОписаниеФормы;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОбновитьЧекиКЗагрузке()
	
	// Описан в ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц
	// Подключается в УчетКассовыхЧековПодотчетныхЛицКлиент.ПодключитьОбновлениеЧековКЗагрузке
	
	УчетКассовыхЧековПодотчетныхЛицКлиент.ОбновитьЧекиКЗагрузке(
		ЭтотОбъект,
		ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц());
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗагрузкуКассовыхЧеков(ИмяСписка)
	
	УчетКассовыхЧековПодотчетныхЛицКлиент.НачатьЗагрузкуВДокумент(
		ЭтотОбъект,
		ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"),
		ОписаниеФормыДляЗагрузкиКассовыхЧековПодотчетныхЛиц(),
		Новый ОписаниеОповещения(
			"ЗаполнитьСодержимымКассовыхЧеков", 
			ЭтотОбъект, 
			Новый Структура("ИмяСписка, СуммаВключаетНДС", ИмяСписка, Объект.СуммаВключаетНДС)));
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСодержимымКассовыхЧеков(АдресСодержимоеЧеков, ДополнительныеПараметры) Экспорт // обработчик оповещения
	
	ЗаполнитьСодержимымКассовыхЧековНаСервере(
		АдресСодержимоеЧеков,
		ДополнительныеПараметры.ИмяСписка,
		ДополнительныеПараметры.СуммаВключаетНДС);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСодержимымКассовыхЧековНаСервере(АдресСодержимоеЧеков, ИмяСписка, СуммаВключаетНДС)
	
	ДобавленныеСтроки = УчетКассовыхЧековПодотчетныхЛиц.ДействияПоЗаполнениюНаСервере(
		ЭтотОбъект,
		АдресСодержимоеЧеков,
		ИмяСписка,
		СуммаВключаетНДС,
		ОписаниеДокументаДляЗагрузкиКассовыхЧековПодотчетныхЛиц());
		
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
		
	Для Каждого СтрокаТабличнойЧасти Из ДобавленныеСтроки Цикл
		СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);		
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);	
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		
		Если ИмяСписка = "Расходы" Тогда
			СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
		Иначе
			ЗаполнениеОбъектовУНФ.ЗаполнитьСтрокуПоШапке(СтрокаТабличнойЧасти, Объект, "СтруктурнаяЕдиница", "ПоложениеСклада");
			ЗаполнениеОбъектовУНФ.ЗаполнитьСтрокуПоШапке(СтрокаТабличнойЧасти, Объект, "Ячейка", "ПоложениеСклада");
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхЧековЗагруженныхАппаратнымСканером(Результат)
	
	Если Результат.АдресХранилища <> Неопределено Тогда
		АдресСодержимоеЧеков = Результат.АдресХранилища;
		ЗаполнитьСодержимымКассовыхЧековНаСервере(АдресСодержимоеЧеков, Результат.ИмяСписка, Результат.СуммаВключаетНДС);
		Если Результат.ИмяСписка = "Запасы" Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаЗапасы;
		Иначе
			Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаРасходы;
		КонецЕсли;
		Если Элементы.ГруппаБаннерПодключенАппаратныйСканер.Видимость = Истина Тогда
			УчетКассовыхЧековПодотчетныхЛицКлиент.СкрытьБаннерПодключенАппаратныйСканер(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

//@skip-check module-structure-top-region
#Область Инициализация

ЭтоНоваяСтрокаЗапасы = Ложь;

#КонецОбласти
