#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Организация = Параметры.Организация;
	ОтчетныйПериод = Параметры.ОтчетныйПериод;

	МинимальнаяСуммаВзноса = Параметры.МинимальнаяСуммаВзноса;
	МаксимальнаяСуммаВзноса = Параметры.МаксимальнаяСуммаВзноса;
	ВыбраннаяСуммаВзноса = Параметры.ВыбраннаяСуммаВзноса;
	СуммаВзносаДляУменьшенияУСН = Параметры.ВыбраннаяСуммаВзноса;
	СуммаВзносаСкорректирована = Параметры.СуммаВзносаСкорректирована;
	
	ВзносПоЕдиномуТарифу = Параметры.ВзносПоЕдиномуТарифу;
	ВзносСДоходовПредыдущийГод = Параметры.ВзносСДоходовПредыдущийГод;
	ВзносСДоходовТекущийГод = Параметры.ВзносСДоходовТекущийГод;
	ДоляДоходовПоУСН = Параметры.ДоляДоходовПоУСН;
	ВзносыИспользованныеДляПатента = Параметры.ВзносыИспользованныеДляПатента;
	ОбъектНалогообложенияДоходы = Параметры.ОбъектНалогообложенияДоходы;
	СобытиеВзносПоЕдиномуТарифу = Параметры.СобытиеВзносПоЕдиномуТарифу;
	СобытиеВзносСДоходов = Параметры.СобытиеВзносСДоходов;
	
	ИспользоватьВсюСумму = СуммаВзносаСкорректирована;
	НалоговаяБазаУменьшилась = РегламентированнаяОтчетностьУСН.НалоговаяБазаУменьшилась(Организация, ОтчетныйПериод);
	
	ЗаполнитьТаблицуРезультатРасчета();
	
	Элементы.СуммаВзносаДляУменьшенияУСН.Доступность = ИспользоватьВсюСумму;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьВсюСуммуПриИзменении(Элемент)
	
	Если Не ИспользоватьВсюСумму Тогда
		СуммаВзносаДляУменьшенияУСН = ВыбраннаяСуммаВзноса;
		Элементы.ДекорацияОшибка.Видимость = Ложь;
	КонецЕсли;
	Модифицированность = Истина; 
	
	Элементы.СуммаВзносаДляУменьшенияУСН.Доступность = ИспользоватьВсюСумму;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПроверитьВведеннуюСумму();
	Если УказанаНеПравильнаяСумма Тогда
		ТекущийЭлемент = Элементы.СуммаВзносаДляУменьшенияУСН;
		Возврат;
	КонецЕсли;
	
	ЗаписатьИЗакрыть();
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьВведеннуюСумму()

Если СуммаВзносаДляУменьшенияУСН > ВыбраннаяСуммаВзноса Тогда
		Элементы.ДекорацияОшибка.Заголовок = НСтр("ru ='Сумма не может быть больше суммы взносов.'");
		УказанаНеПравильнаяСумма = Истина;
	ИначеЕсли СуммаВзносаДляУменьшенияУСН < МинимальнаяСуммаВзноса И Не НалоговаяБазаУменьшилась Тогда
		Элементы.ДекорацияОшибка.Заголовок = НСтр("ru ='Сумма не может быть меньше использованной в прошлом периоде.'");
		УказанаНеПравильнаяСумма = Истина;
	Иначе
		УказанаНеПравильнаяСумма = Ложь;
	КонецЕсли;
	Элементы.ДекорацияОшибка.Видимость = УказанаНеПравильнаяСумма;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть()

	Если ЗаписатьДанные() Тогда
		
		Если Модифицированность Тогда
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("Организация", Организация);
			ПараметрыОповещения.Вставить("Период", ОтчетныйПериод);
				
			Оповестить("Запись_УменьшениеУСННаФиксированныеВзносы", ПараметрыОповещения, ЭтотОбъект);
		КонецЕсли;

		Модифицированность = Ложь;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьДанные()
	
	Если Не Модифицированность Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ВыбраннаяСуммаВзноса <> СуммаВзносаДляУменьшенияУСН Тогда
		МенеджерЗаписи = РегистрыСведений.УменьшениеНалогаНаВзносыПодлежащиеУплате.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = КонецКвартала(ОтчетныйПериод);
		МенеджерЗаписи.Организация = Организация;
		МенеджерЗаписи.Сумма = СуммаВзносаДляУменьшенияУСН;
		МенеджерЗаписи.ДеятельностьНаПатенте = Ложь;
		МенеджерЗаписи.Записать(Истина);
		ОчиститьЗаписиРегистра(Ложь);
	ИначеЕсли СуммаВзносаСкорректирована Тогда
		ОчиститьЗаписиРегистра(Истина);
	Иначе
		Модифицированность = Ложь;
	КонецЕсли;
	
	Возврат Истина; 
	
КонецФункции

&НаСервере
Процедура ОчиститьЗаписиРегистра(УдалятьТекущийПериод)
	
	ПериодыКУдалению = Новый Массив;
	Если УдалятьТекущийПериод Тогда
		ТекущийПериод = ОтчетныйПериод;
	Иначе
		ТекущийПериод = ДобавитьМесяц(ОтчетныйПериод, 3);
	КонецЕсли;
	
	Пока КонецКвартала(ТекущийПериод) <= КонецГода(ОтчетныйПериод) Цикл
		ПериодыКУдалению.Добавить(НачалоКвартала(ТекущийПериод));
		ТекущийПериод = ДобавитьМесяц(ТекущийПериод, 3);
	КонецЦикла;
	
	СуммаВзносаДляУменьшенияУСН = МаксимальнаяСуммаВзноса;
	
	// Необходимо удалить все изменения до конца налогового периода
	Для Каждого ПериодУдаления Из ПериодыКУдалению Цикл
		МенеджерЗаписи = РегистрыСведений.УменьшениеНалогаНаВзносыПодлежащиеУплате.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = КонецКвартала(ПериодУдаления);
		МенеджерЗаписи.Организация = Организация;
		МенеджерЗаписи.ДеятельностьНаПатенте = Ложь;
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВзносПоЕдиномуТарифуНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(СобытиеВзносПоЕдиномуТарифу) Тогда
		Результат = РегламентированнаяОтчетностьУСНКлиент.ОбработатьСобытиеКалендаря(
		Организация, СобытиеВзносПоЕдиномуТарифу);

		ПараметрыФормы = Новый Структура("Организация,СобытиеКалендаря", Организация, СобытиеВзносПоЕдиномуТарифу);
		ОткрытьФорму(Результат.ИмяФормыРезультата, ПараметрыФормы, ЭтотОбъект, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВзносСДоходовТекущийГодНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(СобытиеВзносСДоходов) Тогда
		Результат = РегламентированнаяОтчетностьУСНКлиент.ОбработатьСобытиеКалендаря(
		Организация, СобытиеВзносСДоходов);

		ПараметрыФормы = Новый Структура("Организация,СобытиеКалендаря", Организация, СобытиеВзносСДоходов);
		ОткрытьФорму(Результат.ИмяФормыРезультата, ПараметрыФормы, ЭтотОбъект, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры 

#Область Интерфейс85

&НаСервере
Процедура ЗаполнитьТаблицуРезультатРасчета() 
	
	// Взносы        
	//ДобавитьСтрокуВТаблицуРасчеты("Доля доходов по УСН'", ДоляДоходовПоУСН , ДоляДоходовПоУСН); 
	
    ДобавитьСтрокуВТаблицуРасчеты("Остаток за прошлый год", ВзносСДоходовПредыдущийГод, ВзносСДоходовПредыдущийГод); 
	ДобавитьСтрокуВТаблицуРасчеты("Единый тариф", ВзносПоЕдиномуТарифу, ВзносПоЕдиномуТарифу); 
	ДобавитьСтрокуВТаблицуРасчеты("С доходов", ВзносСДоходовТекущийГод, ВзносСДоходовТекущийГод);   
	
	СуммаВзносаРасчетная = Цел(
		(ВзносПоЕдиномуТарифу + ВзносСДоходовТекущийГод + ВзносСДоходовПредыдущийГод) * ДоляДоходовПоУСН / 100);
	ФорматЧиселВПояснении = НСтр("ru = 'ЧДЦ=2; ЧН=0,00; ЧГ=3,0'");
	
	Если СуммаВзносаРасчетная > МаксимальнаяСуммаВзноса И ВзносыИспользованныеДляПатента <> 0 Тогда
		ОсновнойТекст = НСтр("ru = 'Всего" + Символы.ПС + "(Остаток за прошлый год+Единый тариф+С доходов-" + Символы.ПС + "Использовано для Патента)'");
		ДополнительныйТекст = СтрШаблон("(%1 + %2 +" + Символы.ПС + " %3 - %4)",
			Формат(ВзносСДоходовПредыдущийГод, ФорматЧиселВПояснении),
			Формат(ВзносПоЕдиномуТарифу, ФорматЧиселВПояснении),
			Формат(ВзносСДоходовТекущийГод, ФорматЧиселВПояснении),
			Формат(ВзносыИспользованныеДляПатента, ФорматЧиселВПояснении));
	Иначе
		Если ДоляДоходовПоУСН < 100 Тогда
			ОсновнойТекст = НСтр("ru = 'Всего (Остаток за прошлый год+" + Символы.ПС + "Единый тариф+С доходов)"+ Символы.ПС +  "*Доля доходов по УСН'");
			ДополнительныйТекст = СтрШаблон("(%1 + %2 + " + Символы.ПС + "%3) * %4%%",
				Формат(ВзносСДоходовПредыдущийГод, ФорматЧиселВПояснении),
				Формат(ВзносПоЕдиномуТарифу, ФорматЧиселВПояснении),
				Формат(ВзносСДоходовТекущийГод, ФорматЧиселВПояснении),
				Формат(ДоляДоходовПоУСН, ФорматЧиселВПояснении));
		Иначе
			ОсновнойТекст = НСтр("ru = 'Всего (Остаток за прошлый год Единый тариф+С доходов)'");
			ДополнительныйТекст = СтрШаблон("(%1 + %2 + %3)",
				Формат(ВзносСДоходовПредыдущийГод, ФорматЧиселВПояснении),
				Формат(ВзносПоЕдиномуТарифу, ФорматЧиселВПояснении),
				Формат(ВзносСДоходовТекущийГод, ФорматЧиселВПояснении));
		КонецЕсли;
	КонецЕсли;
																		
	ДобавитьСтрокуВТаблицуРасчеты(ОсновнойТекст, ДополнительныйТекст, МаксимальнаяСуммаВзноса);
	
	Если ОбъектНалогообложенияДоходы Тогда
		ОписаниеТекст = НСтр("ru = 'Уменьшено в прошлом периоде'");
	Иначе
		ОписаниеТекст = НСтр("ru = 'Включено в расходы в прошлом периоде'");
	КонецЕсли;
    ДобавитьСтрокуВТаблицуРасчеты(ОписаниеТекст, МинимальнаяСуммаВзноса, МинимальнаяСуммаВзноса);
			
	СимволRUB = Справочники.Валюты.НайтиПоКоду("643").СимвольноеПредставление;
	Элементы.ТаблицаРасчетыГруппа1.Заголовок = 
	"Расчеты, " + СимволRUB;  
	Элементы.ТаблицаРасчетыРезультат.Заголовок = 
	"Результат, " + СимволRUB; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВТаблицуРасчеты(Описание, Расчеты, Результат)
	
	СтрокаРезультата = ТаблицаРасчеты.Добавить();  
	СтрокаРезультата.Описание = СокрЛП(Строка(Описание));
	СтрокаРезультата.Расчеты = СокрЛП(Строка(Формат(Расчеты, "ЧДЦ=2; ЧН=")));  
    СтрокаРезультата.Результат = Результат;
	
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаРасчетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	Если Элемент.ТекущиеДанные.Описание = "Единый тариф" Тогда
         ВзносПоЕдиномуТарифуНажатие(Элемент, СтандартнаяОбработка);
	ИначеЕсли Элемент.ТекущиеДанные.Описание = "С доходов" Тогда
		 ВзносСДоходовТекущийГодНажатие(Элемент, СтандартнаяОбработка)
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти