

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, "Недействителен", Ложь, , , Истина);
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() <> Истина Тогда  
		Элементы.Переместить(Элементы.СписокПоказыватьНедействительную, Элементы.ГруппаКнопокПоказатьНедействительную);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьНедействительную(Команда)
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Недействителен");
	НайденныйЭлемент = Неопределено;
	Элементы.СписокПоказыватьНедействительную.Пометка = Не Элементы.СписокПоказыватьНедействительную.Пометка;
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")
			Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора
			Тогда
			НайденныйЭлемент = ЭлементОтбора;
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	Если НайденныйЭлемент = Неопределено
		Тогда
		Возврат;
	КонецЕсли;
	
	НовыйОтбор = НайденныйЭлемент;
	НовыйОтбор.Использование = Не НовыйОтбор.Использование;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

		НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Список.Недействителен", Истина,
		ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "Наименование");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
		ЦветаПалитры.Серый50УНФ);

КонецПроцедуры

#КонецОбласти
