#Область ОписаниеПеременных

&НаСервере
Перем КешДокументов;

&НаСервере
Перем КешРеквизитовДокумента;

&НаКлиенте
Перем СтрокаПозиционированияПослеОбновления;

&НаСервере
Перем ТекущийЭлементДереваДокументов;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДокументСсылка = Параметры.ДокументСсылка;
	
	ВосстановитьНастройки();
	
	ВывестиДеревоДокументов();
	
	// УНФ.ПанельКонтактнойИнформации
	КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформация",
		"ДеревоДокументовКонтекстноеМеню");
	// Конец УНФ.ПанельКонтактнойИнформации
	
	УправлениеФормой(Истина);
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВремяЗадержкиОбработчиковОжидания = ДокументыУНФКлиент.ВремяЗадержкиОбработчиковОжидания();
	Элементы.ДеревоДокументов.ТекущаяСтрока = ДеревоДокументов.ПолучитьЭлементы()[0];
	СтрокаПозиционированияПослеОбновления = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		СохранитьНастройки()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// УНФ.ПанельКонтактнойИнформации
	Если КонтактнаяИнформацияПанельУНФКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьПанельКонтактнойИнформацииСервер();
	КонецЕсли;
	// Конец УНФ.ПанельКонтактнойИнформации
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеПоискаОчистка(Элемент, СтандартнаяОбработка)  
	
	Если ДанныеМеток.Количество() Тогда
		ОтобразитьДокументыСписком();
	Иначе
		ВывестиДеревоДокументов();
	КонецЕсли;
	
	РазвернутьДеревоЗначенийСвойств(Элементы.ДеревоДокументов,ДеревоДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	УстановитьОтборСтрок(СтрокаПоиска);
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		УстановитьМеткуИОтборСписка("Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение, , Ложь);
		УстановитьОтборСтрок(СтрокаПоиска);
		ВыбранноеЗначение = Неопределено;
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокКонтактыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Контакты;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокДеталиНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Детали;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоДокументов

&НаКлиенте
Процедура ДеревоДокументовПриАктивизацииСтроки(Элемент)
	
	ОбновитьДоступностьКнопок(Элемент, Элемент.ТекущиеДанные);
	
	ПодключитьОбработчикОжидания("ДеревоДокументовПриАктивизацииСтрокиОбработчик", ВремяЗадержкиОбработчиковОжидания,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовПередНачаломИзменения(Элемент, Отказ)
	ОткрытьФормуДокумента();
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовПриНаведении(Элемент, Строка, Поле)
	ДанныеСтроки = Элемент.ДанныеСтроки(Строка);
	ОбновитьДоступностьКнопок(Элемент, ДанныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = ложь;
	ОткрытьФормуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	Если ДанныеМеток.Количество() Тогда 
		ТекстПредупреждения = НСтр("ru = 'Для продолжения, очистите значения отбора.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат
	КонецЕсли;
	
	ОбновитьДеревоДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиДляТекущего(Команда)
	
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПоиска = "";
	
	ДокументСсылка = Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка;
	Если ОсновнойДокументЕщеДоступен() Тогда
		ДеревоДокументов.ПолучитьЭлементы().Очистить();
		ВывестиДеревоДокументов();
		РазвернутьДеревоЗначенийСвойств(Элементы.ДеревоДокументов,ДеревоДокументов);
	Иначе
		ЗакрытьФормуСПредупреждением(НСтр(
		"ru = 'Документ, для которого сформирован отчет о структуре
		|подчиненности был удален, или же стал недоступен.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиВСписке(Команда)
	
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрываемаяФорма = СтрШаблон("Документ.%1.ФормаСписка", Элементы.ДеревоДокументов.ТекущиеДанные.ВидДокумента);
	ПараметрыФормы = Новый Структура("ТекущаяСтрока", Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка);
	ОткрытьФорму(ОткрываемаяФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	
	СтрокиДляОбработки = Элементы.ДеревоДокументов.ПолучитьСтрокиДляОбработки();
	
	Если Не СтрокиДляОбработки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из СтрокиДляОбработки Цикл
		СтрокаДерева = Элементы.ДеревоДокументов.ДанныеСтроки(ВыделеннаяСтрока);
		Если Не СтрокаДерева.ПроведениеРазрешено Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			СтрокаДерева.Проведен = ПровестиСервер(СтрокаДерева.Ссылка);
			СтрокаДерева.Картинка = НомерКартинки(СтрокаДерева);
		Исключение
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(НСтр("ru = 'Не удалось провести документ ""%1""'"),
				СтрокаДерева.ДокументПредставление);
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаПроведения(Команда)
	
	СтрокиДляОбработки = Элементы.ДеревоДокументов.ПолучитьСтрокиДляОбработки();
	Если Не СтрокиДляОбработки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из СтрокиДляОбработки Цикл
		
		СтрокаДерева = Элементы.ДеревоДокументов.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если Не СтрокаДерева.ПроведениеРазрешено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не СтрокаДерева.Проведен Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			СтрокаДерева.Проведен = ОтменаПроведенияСервер(СтрокаДерева.Ссылка);
			СтрокаДерева.Картинка = НомерКартинки(СтрокаДерева);
		Исключение
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(НСтр("ru = 'Не удалось отменить проведение документа ""%1""'"),
				СтрокаДерева.ДокументПредставление);
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаления(Команда)
	
	Если Не Элементы.ДеревоДокументов.ПолучитьСтрокиДляОбработки().Количество()
		Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоДокументов.ПолучитьСтрокиДляОбработки() Цикл
		Попытка
			СтрокаДерева = Элементы.ДеревоДокументов.ДанныеСтроки(ВыделеннаяСтрока);
			
			Результат = УстановитьПометкуУдаленияСервер(СтрокаДерева.Ссылка);
			СтрокаДерева.ПометкаУдаления = Результат.ПометкаУдаления;
			СтрокаДерева.Проведен = Результат.Проведен;
			СтрокаДерева.Картинка = НомерКартинки(СтрокаДерева);
		Исключение
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(НСтр("ru = 'Не удалось установить пометку удаления на документ ""%1""'"),
				СтрокаДерева.ДокументПредставление);
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВеткуДереваДокументов(Команда) 
	
	ТекущаяВетка = ДеревоДокументов.НайтиПоИдентификатору(Элементы.ДеревоДокументов.ТекущаяСтрока);
	
	Если Не ТекущаяВетка = Неопределено
		Тогда
		СвернутьВеткуДерева(ТекущаяВетка);
		Элементы.ДеревоДокументов.Свернуть(Элементы.ДеревоДокументов.ТекущаяСтрока);  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВеткуДереваДокументов(Команда) 
	
	РазвернутьВеткуДерева(ДеревоДокументов.НайтиПоИдентификатору(Элементы.ДеревоДокументов.ТекущаяСтрока));
	Элементы.ДеревоДокументов.Развернуть(Элементы.ДеревоДокументов.ТекущаяСтрока);   

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСписком(Команда) 
	ОтобразитьДокументыСписком();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Команда)
	РазвернутьДеревоЗначенийСвойств(Элементы.ДеревоДокументов,ДеревоДокументов);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Команда)
	
	ЭлементыДереваДокументов = ДеревоДокументов.ПолучитьЭлементы();
	
	Для Каждого ЭлементДерева Из ЭлементыДереваДокументов Цикл
		СвернутьВеткуДерева(ЭлементДерева);
		Элементы.ДеревоДокументов.Свернуть(ЭлементДерева.ПолучитьИдентификатор());
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоДвижениям(Команда)
	
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаДокумент = Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка;
	ОтчетОДвиженияхДокументаУНФКлиент.ПоказатьДвижения(СсылкаНаДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СсылкиВДереве(СтрокаДерева = Неопределено)
	
	Результат = Новый Массив;
	
	Если СтрокаДерева = Неопределено Тогда
		СтрокаДерева = ДеревоДокументов;
	КонецЕсли;
	
	Строки = СтрокаДерева.ПолучитьЭлементы();
	Для Каждого ПодчиненнаяСтрокаДерева Из Строки Цикл
		
		Результат.Добавить(ПодчиненнаяСтрокаДерева.Ссылка);
		
		ПодчиненныеДокументы = СсылкиВДереве(ПодчиненнаяСтрокаДерева);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ПодчиненныеДокументы);
		
	КонецЦикла;
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат);
	
КонецФункции

&НаСервере
Процедура УстановитьНаличиеЗаказовЗаявок()
	
	СсылкиВДереве = СсылкиВДереве();
	
	ЗаказыПокупателя = Новый Массив;
	Для Каждого Ссылка Из СсылкиВДереве Цикл
		
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ЗаказыПокупателя.Добавить(Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗаказыПокупателя.Количество() = 0 Тогда
		ЕстьЗаказыЗаявки = Ложь;
		Возврат;
	КонецЕсли;
	
	ЕстьЗаказыЗаявки = РаботаСЗаявками.ЕстьЗаявки(ЗаказыПокупателя);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой(ПолноеОбновление = Ложь)
	
	Если ПолноеОбновление Тогда
		ОбновитьВсеПараметрыДляУправленияФормой();
	КонецЕсли;
	
	Элементы.ДеревоДокументовКонтрагент.Видимость = Не ЕстьЗаказыЗаявки;
	Элементы.ДеревоДокументовКонтрагентИлиЛид.Видимость = ЕстьЗаказыЗаявки;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ГруппаСписокИПанель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Авто;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.ФормаИзменитьФорму, Элементы.ГруппаКоманднаяПанель);
	Элементы.Переместить(Элементы.ФормаСправка, Элементы.ГруппаКоманднаяПанель);
	
	Элементы.Переместить(Элементы.ВывестиДляТекущего, Элементы.ГруппаКоманднаяПанель, Элементы.ГруппаСвернутьРазвернуть);
	
	СтандартныеПодсистемыСервер.ПереместитьЭлементыВГруппу(Элементы.ДеревоДокументов.КоманднаяПанель,
		Элементы.ГруппаКоманднаяПанель);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсеПараметрыДляУправленияФормой()
	УстановитьНаличиеЗаказовЗаявок();
КонецПроцедуры

&НаСервере
Процедура ВывестиДеревоДокументов()
	
	Попытка
		ДеревоДокументов.ПолучитьЭлементы().Очистить();
		ТекущийЭлементДереваДокументов = ДеревоДокументов;
		КешДокументов = Новый Соответствие;
		КешРеквизитовДокумента = Новый Соответствие;
		
		ВывестиРодительскиеДокументы(ДокументСсылка);
		
		ДокументыУНФ.ВывестиПодчиненныеДокументы(ТекущийЭлементДереваДокументов, КешРеквизитовДокумента, КешДокументов);
		
		ТаблицаДокументов.Очистить();
		ТаблицаДокументовЗначение = РеквизитФормыВЗначение("ТаблицаДокументов");
		ДеревоДокументовЗначение = РеквизитФормыВЗначение("ДеревоДокументов");
		ДеревоЗначенийВТаблицуЗначений(ДеревоДокументовЗначение, ТаблицаДокументовЗначение);
		ЗначениеВРеквизитФормы(ТаблицаДокументовЗначение, "ТаблицаДокументов");
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРодительскиеДокументы(ДокументСсылка)
	
	СписокРеквизитов = ДокументыУНФ.СписокРеквизитовДокумента(ДокументСсылка, КешДокументов);
	
	Если СписокРеквизитов.Количество() = 1 Тогда
		ВывестиРодительскиеДокументы(СписокРеквизитов[0].Значение);
	ИначеЕсли СписокРеквизитов.Количество() > 1 Тогда
		ВывестиБезРодителей(СписокРеквизитов);
	КонецЕсли;
	
	ДокументыУНФ.ВывестиРодительскиеДокументыОкончание(ДокументСсылка, ТекущийЭлементДереваДокументов, КешДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиБезРодителей(СписокДокументов)
	
	КешДокументов = Новый Соответствие; 
	ДеревоДокументов.ПолучитьЭлементы().Очистить();
	ТекущийЭлементДереваДокументов = ДеревоДокументов;
	
	ДокументыСоВходящимиДанными = ДокументыУНФ.ДокументыСоВходящимиДанными();
	
	ОтборПоКонтрагентам = Новый Массив;
	
	Для Каждого ЭлементМеток Из ДанныеМеток Цикл
		ОтборПоКонтрагентам.Добавить(ЭлементМеток.Метка);
	КонецЦикла;
		
	РасширениеУсловияЗапроса = "";
	ЕстьОтборПоКонтрагентам = ОтборПоКонтрагентам.Количество();
	
	Для Каждого ЭлементСписка Из СписокДокументов Цикл
		
		МетаданныеДокумента = ЭлементСписка.Значение.Метаданные();
		
		ЭтоДокументСВходящимНомеромИДатой = ДокументыСоВходящимиДанными.Найти(МетаданныеДокумента.Имя) <>  Неопределено;
		
		ЭтоДокументСобытие = ?(ТипЗнч(ЭлементСписка.Значение) = Тип("ДокументСсылка.Событие"), Истина, Ложь);
		
		Запрос = Новый Запрос;
		
		РасширениеУсловияЗапроса = "ИСТИНА";
		
		Если ЭтоДокументСобытие Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	СобытиеУчастники.Ссылка КАК Ссылка,
			|	СобытиеУчастники.Ссылка.Проведен КАК Проведен,
			|	СобытиеУчастники.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
			|	СобытиеУчастники.Ссылка.Представление КАК Представление,
			|	СобытиеУчастники.Ссылка.Номер КАК Номер,
			|	СобытиеУчастники.Ссылка.Содержание КАК Комментарий,
			|	СобытиеУчастники.Ссылка.Автор КАК Автор,
			|	СобытиеУчастники.Ссылка.ТипСобытия КАК ВидОперации,
			|	СобытиеУчастники.Ссылка.ВходящееИсходящееСобытие КАК ВходящееИсходящееСобытие,
			|	СобытиеУчастники.Ссылка.Состояние КАК Состояние,
			|	""Событие"" КАК Метаданные
			|ИЗ
			|	Документ.Событие.Участники КАК СобытиеУчастники
			|ГДЕ
			|	СобытиеУчастники.Ссылка = &Ссылка
			|	И &РасширениеУсловияЗапроса";
			
			Если ЕстьОтборПоКонтрагентам Тогда
				РасширениеУсловияЗапроса = "СобытиеУчастники.Контакт В (&ОтборПоКонтрагентам)";
			КонецЕсли;
			
		Иначе
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Т.Ссылка КАК Ссылка,
			|	Т.Проведен КАК Проведен,
			|	Т.ПометкаУдаления КАК ПометкаУдаления,
			|	Т.Представление КАК Представление,
			|	&Валюта КАК ВалютаДокумента,
			|	&Сумма КАК СуммаДокумента,
			|	&Организация КАК Организация,
			|	&ДатаВходящего КАК ДатаВходящего,
			|	&НомерВходящий КАК НомерВходящий,
			|	&Номер КАК Номер,
			|	&Комментарий КАК Комментарий,
			|	&Ответственный КАК Ответственный,
			|	&Контрагент КАК Контрагент,
			|	&СостояниеЗаказа КАК СостояниеЗаказа,
			|	&Автор КАК Автор,
			|	&ВидОперации КАК ВидОперации,
			|	&Состояние КАК Состояние,
			|	&ВходящееИсходящееСобытие КАК ВходящееИсходящееСобытие,
			|	""&ИмяМетаданных"" КАК Метаданные
			|ИЗ
			|	&ИмяТаблицы КАК Т
			|ГДЕ
			|	Т.Ссылка = &Ссылка
			|	И &РасширениеУсловияЗапроса";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ОбщегоНазначения.ИмяТаблицыПоСсылке(ЭлементСписка.Значение));
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяМетаданных", МетаданныеДокумента.Имя);
			
			Если ЕстьОтборПоКонтрагентам Тогда
				РасширениеУсловияЗапроса = "Ссылка.Контрагент В (&ОтборПоКонтрагентам)";
			КонецЕсли;
			
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РасширениеУсловияЗапроса", РасширениеУсловияЗапроса);
		
		Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Валюта", "Т.ВалютаДокумента");
		ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("ВалютаДенежныхСредств") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Валюта", "Т.ВалютаДенежныхСредств");
		// Эквайринг
		ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("ВалютаРасчетов") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Валюта", "Т.ВалютаРасчетов");
		// Конец Эквайринг
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Валюта", "NULL");
		КонецЕсли;
		
		Если МетаданныеДокумента.Имя = "СчетФактура"
			ИЛИ МетаданныеДокумента.Имя = "СчетФактураПолученный" Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Сумма", "Т.СуммаДокумента + Т.СуммаНДСДокумента");
			
		ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Сумма", "Т.СуммаДокумента");
			
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Сумма", "0");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Организация", "Т.Организация");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Организация", "NULL");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Ответственный") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Ответственный", "Т.Ответственный");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Ответственный", "NULL");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("СостояниеЗаказа") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СостояниеЗаказа", "Т.СостояниеЗаказа");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СостояниеЗаказа", "NULL");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Состояние") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Состояние", "Т.Состояние");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Состояние", "NULL");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Автор") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Автор", "Т.Автор");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Автор", "NULL");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("ВидОперации") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВидОперации", "Т.ВидОперации");
		ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("ТипСобытия") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВидОперации", "Т.ТипСобытия");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВидОперации", "NULL");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("ВходящееИсходящееСобытие") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВходящееИсходящееСобытие", "Т.ВходящееИсходящееСобытие");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВходящееИсходящееСобытие", "NULL");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Контрагент") <> Неопределено  Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Контрагент", "Т.Контрагент");
			
			Если ЕстьОтборПоКонтрагентам Тогда
				Запрос.УстановитьПараметр("ОтборПоКонтрагентам", ОтборПоКонтрагентам);
			КонецЕсли;
			
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Контрагент", "NULL");
			
			Если ЭтоДокументСобытие Тогда
				Запрос.УстановитьПараметр("ОтборПоКонтрагентам", ОтборПоКонтрагентам);
			ИначеЕсли ЕстьОтборПоКонтрагентам Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, РасширениеУсловияЗапроса, "");
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоДокументСВходящимНомеромИДатой Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаВходящего", "Т.ДатаВходящегоДокумента");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НомерВходящий", "Т.НомерВходящегоДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаВходящего", "NULL");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НомерВходящий", "NULL");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Номер") <> Неопределено Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Номер", "Т.Номер");
			
		Иначе
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МетаданныеДокумента.СтандартныеРеквизиты,
				"Номер") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Номер", "Т.Номер");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Номер", "NULL");
			КонецЕсли;
			
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Комментарий") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Комментарий", "Т.Комментарий");
		ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("Тема") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Комментарий", 
			"ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.Тема) = ТИП(Справочник.ТемыСобытий)
			|ТОГДА ВЫРАЗИТЬ(Т.Тема КАК Справочник.ТемыСобытий).Наименование
			|ИНАЧЕ ВЫРАЗИТЬ(Т.Тема КАК СТРОКА)
			|КОНЕЦ");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Комментарий", """""");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементСписка.Значение);
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Если КешДокументов[Выборка.Ссылка] = Неопределено Тогда
				
				СтрокаДерева = ТекущийЭлементДереваДокументов.ПолучитьЭлементы().Добавить();
				СтрокаДерева.Ссылка= Выборка.Ссылка;
				СтрокаДерева.Комментарий = ПреобразоватьМногострочнуюСтроку(Выборка.Комментарий);
				СтрокаДерева.ВидДокумента = Выборка.Метаданные;
				СтрокаДерева.Проведен = Выборка.Проведен;
				СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
				СтрокаДерева.ОграничениеПоРодителям = Истина;
				СтрокаДерева.ВидОперации = Выборка.ВидОперации;
				СтрокаДерева.ВходящееИсходящееСобытие = Выборка.ВходящееИсходящееСобытие;
				СтрокаДерева.Картинка = НомерКартинки(СтрокаДерева);
				СтрокаДерева.Номер = Выборка.Номер; 
				
				Если ТипЗнч(СтрокаДерева.Ссылка) = Тип("ДокументСсылка.Событие") Тогда
					
					//@skip-check query-in-loop
					КонтрагентДокумента = КонтрагентДокументаСобытие(СтрокаДерева.Ссылка);
					Если КонтрагентДокумента = "Несколько" Тогда
						СтрокаДерева.НесколькоКонтрагентов = Истина;
					Иначе
						СтрокаДерева.Контрагент = КонтрагентДокумента;
					КонецЕсли;
					
				Иначе
					СтрокаДерева.Ответственный = Выборка.Ответственный;
					СтрокаДерева.ВалютаДокумента= Выборка.ВалютаДокумента;
					СтрокаДерева.СуммаДокумента= Выборка.СуммаДокумента;
					СтрокаДерева.Организация = Выборка.Организация;
					СтрокаДерева.Контрагент = Выборка.Контрагент;
					СтрокаДерева.СостояниеЗаказа = Выборка.СостояниеЗаказа;
				КонецЕсли;
				
				СтрокаДерева.Автор = Выборка.Автор;
				СтрокаДерева.Состояние = Выборка.Состояние;
				
				Если ЭтоДокументСВходящимНомеромИДатой Тогда
					
					НомерВходящий = ?(ЗначениеЗаполнено(Выборка.НомерВходящий), Выборка.НомерВходящий, "<..>");
					
					ДатаДокумента = Формат(Выборка.ДатаВходящего, "ДФ=dd.MM.yyyy");
					Если ПустаяСтрока(ДатаДокумента) Тогда
						
						ДатаДокумента = Формат(Выборка.Ссылка.Дата, "ДФ=dd.MM.yyyy");
						
					КонецЕсли;
					
					ПредставлениеНомера = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
					
					СтрокаДерева.ДокументПредставление = СтрШаблон(НСтр("ru ='%1 %2 (вх. %3) от %4'"),
						МетаданныеДокумента.Синоним, ПредставлениеНомера, НомерВходящий, ДатаДокумента);
					
				Иначе
					
					СтрокаДерева.ДокументПредставление = Выборка.Представление;
					
				КонецЕсли;
				
				КешДокументов.Вставить(Выборка.Ссылка, Истина);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

	ТекущийЭлементДереваДокументов = СтрокаДерева;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Функция КонтрагентДокументаСобытие(СсылкаНаДокумент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытиеУчастники.Контакт КАК Контрагент
	|ИЗ
	|	Документ.Событие.Участники КАК СобытиеУчастники
	|ГДЕ
	|	СобытиеУчастники.Ссылка = &Ссылка
	|	И ТИПЗНАЧЕНИЯ(СобытиеУчастники.Контакт) = ТИП(Справочник.Контрагенты)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 1 Тогда 
		Возврат "Несколько";
	ИначеЕсли Выборка.Количество() = 1 Тогда 
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Контрагент;
		КонецЦикла;
	Иначе
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуДокумента()
	
	ПараметрыФормы = Новый Структура("Ключ", Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка);
	ОткрываемаяФорма = СтрШаблон("Документ.%1.ФормаОбъекта", Элементы.ДеревоДокументов.ТекущиеДанные.ВидДокумента);
	ОткрытьФорму(ОткрываемаяФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуСПредупреждением(ТекстПредупреждения)
	
	ВызватьИсключение ТекстПредупреждения;
	
КонецПроцедуры

&НаСервере
Функция ОсновнойДокументЕщеДоступен()
	
	ИмяТекущегоДокумента = ДокументСсылка.Метаданные().Имя;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ Представление ИЗ Документ." + ИмяТекущегоДокумента
		+ " ГДЕ Ссылка = &ТекущийДокумент";
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НомерКартинки(СтрокаДерева)
	
	Если ТипЗнч(СтрокаДерева.Ссылка) <> Тип("ДокументСсылка.Событие") Тогда
		Если СтрокаДерева.ПометкаУдаления Тогда
			Возврат 3;
		ИначеЕсли СтрокаДерева.Проведен Тогда
			Возврат 1;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЕсли; 
	
	Если СтрокаДерева.ВидОперации = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Запись") Тогда
		Если СтрокаДерева.ПометкаУдаления Тогда
			Возврат 23;
		Иначе
			Возврат 14;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаДерева.ВидОперации = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ЛичнаяВстреча") Тогда
		Если СтрокаДерева.ПометкаУдаления Тогда
			Возврат 20;
		Иначе
			Возврат 11;
		КонецЕсли;
	КонецЕсли; 
	
	Если СтрокаДерева.ВидОперации = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ТелефонныйЗвонок") Тогда
		Если СтрокаДерева.ВходящееИсходящееСобытие = ПредопределенноеЗначение("Перечисление.ВходящееИсходящееСобытие.Входящее") Тогда
			Если СтрокаДерева.ПометкаУдаления Тогда
				Возврат 17;
			Иначе
				Возврат 8;
			КонецЕсли;
		Иначе
			Если СтрокаДерева.ПометкаУдаления Тогда
				Возврат 18;
			Иначе
				Возврат 9;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаДерева.ВидОперации = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ЭлектронноеПисьмо") Тогда
		Если СтрокаДерева.ВходящееИсходящееСобытие = ПредопределенноеЗначение("Перечисление.ВходящееИсходящееСобытие.Входящее") Тогда
			Если СтрокаДерева.ПометкаУдаления Тогда
				Возврат 15;
			Иначе
				Возврат 6;
			КонецЕсли;
		Иначе
			Если СтрокаДерева.ПометкаУдаления Тогда
				Возврат 16;
			Иначе
				Возврат 7;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаДерева.ВидОперации = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Прочее") Тогда
		Если СтрокаДерева.ПометкаУдаления Тогда
			Возврат 22;
		Иначе
			Возврат 13;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаДерева.ВидОперации = ПредопределенноеЗначение("Перечисление.ТипыСобытий.СообщениеSMS") Тогда
		Если СтрокаДерева.ПометкаУдаления Тогда
			Возврат 21;
		Иначе
			Возврат 12;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДоступностьКнопок(Элемент, ДанныеСтроки)
	
	КоличествоВыделенныхСтрок = Элемент.ВыделенныеСтроки.Количество();
	
	Если ДанныеСтроки = Неопределено И КоличествоВыделенныхСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеСвойстваПроведениеРазрешено = Ложь;
	
	Если КоличествоВыделенныхСтрок = 0 Тогда
		ЗначениеСвойстваПроведениеРазрешено = ДанныеСтроки.ПроведениеРазрешено;
	Иначе
		Для Каждого СтрокаВыделеннойСтроки Из Элемент.ПолучитьСтрокиДляОбработки() Цикл
			ДанныеВыделеннойСтроки = Элемент.ДанныеСтроки(СтрокаВыделеннойСтроки);
			Если ДанныеВыделеннойСтроки.ПроведениеРазрешено Тогда
				ЗначениеСвойстваПроведениеРазрешено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Провести", "Доступность",
		ЗначениеСвойстваПроведениеРазрешено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтменаПроведения", "Доступность",
		ЗначениеСвойстваПроведениеРазрешено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтчетПоДвижениям", "Доступность",
		ЗначениеСвойстваПроведениеРазрешено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДеревоДокументовКонтекстноеМенюПровести", "Доступность", ЗначениеСвойстваПроведениеРазрешено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДеревоДокументовКонтекстноеМенюОтменаПроведения", "Доступность", ЗначениеСвойстваПроведениеРазрешено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДеревоДокументовКонтекстноеМенюОтчетПоДвижениям", "Доступность", ЗначениеСвойстваПроведениеРазрешено);
	
КонецПроцедуры 

&НаСервере
Функция ПровестиСервер(ДокументСсылка)
	
	Объект = ДокументСсылка.ПолучитьОбъект();
	
	ЗаполнениеКорректно = Объект.ПроверитьЗаполнение();
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось провести документ ""%1""'"), Объект.Ссылка);
	
	Если Не ЗаполнениеКорректно Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		
		Возврат Объект.Проведен;
	КонецЕсли;
	
	Попытка
		Объект.Заблокировать();
		Объект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Объект.Разблокировать();
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецПопытки; 
	
	Возврат Объект.Проведен;
	
КонецФункции

&НаСервере
Функция ОтменаПроведенияСервер(ДокументСсылка)
	
	Объект = ДокументСсылка.ПолучитьОбъект();
	Попытка
		Объект.Заблокировать();
		Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Объект.Разблокировать();
	Исключение
		Сообщение = Новый СообщениеПользователю();
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось отменить проведение документа ""%1""'"), Объект.Ссылка);
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецПопытки; 

	Возврат Объект.Проведен;
	
КонецФункции

&НаСервере
Функция УстановитьПометкуУдаленияСервер(ДокументСсылка)
	
	Объект = ДокументСсылка.ПолучитьОбъект();
	Попытка
		
		Объект.Заблокировать();
		Объект.УстановитьПометкуУдаления(Не Объект.ПометкаУдаления);
		Объект.Разблокировать();
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю();
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось установить пометку удаления на документ ""%1""'"),
			Объект.Ссылка);
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		
	КонецПопытки;
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ПометкаУдаления, Проведен");

	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПреобразоватьМногострочнуюСтроку(МногострочнаяСтрока)
	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(МногострочнаяСтрока, Символы.ПС, Истина);
	Возврат СтрСоединить(МассивСтрок, " ");
	
КонецФункции

&НаСервере
Процедура ДеревоЗначенийВТаблицуЗначений(Дерево, Таблица)
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
		
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ДеревоЗначенийВТаблицуЗначений(СтрокаДерева, Таблица);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьДокументыСписком()
	
	ВременнаяТаблицаДокументов = РеквизитФормыВЗначение("ТаблицаДокументов");
	МассивДокументов = ВременнаяТаблицаДокументов.ВыгрузитьКолонку("Ссылка");

	ДеревоДокументов.ПолучитьЭлементы().Очистить();
	
	Если МассивДокументов.Количество()
		Тогда
		СписокДокументов = Новый СписокЗначений;
		СписокДокументов.ЗагрузитьЗначения(МассивДокументов);
		
		ДеревоДокументов.ПолучитьЭлементы().Очистить();
		ТекущийЭлементДереваДокументов = ДеревоДокументов;
		КешДокументов = Новый Соответствие;
		
		ВывестиБезРодителей(СписокДокументов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВеткуДерева(Дерево)
	
	Для Каждого Элемент Из Дерево.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки=Элемент.ПолучитьИдентификатор();
		Элементы.ДеревоДокументов.Свернуть(ИдентификаторСтроки);
		СвернутьВеткуДерева(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВеткуДерева(Дерево)
	
	Для Каждого Элемент Из Дерево.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки=Элемент.ПолучитьИдентификатор();
		Элементы.ДеревоДокументов.Развернуть(ИдентификаторСтроки);
		РазвернутьВеткуДерева(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиАктивнуюСтроку(Дерево, ДокументСсылка)
	
		Для Каждого Элемент Из Дерево.ПолучитьЭлементы() Цикл
			Если Элемент.Ссылка = ДокументСсылка
				Тогда
				СтрокаПозиционированияПослеОбновления = Элемент.ПолучитьИдентификатор();
				Прервать;
			Иначе
				НайтиАктивнуюСтроку(Элемент, ДокументСсылка); 
			КонецЕсли;
		КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	УОТекущийДокумент = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(УОТекущийДокумент.Отбор, "ДеревоДокументов.Ссылка",
		ДокументСсылка, ВидСравненияКомпоновкиДанных.Равно);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(УОТекущийДокумент, Элементы.ДеревоДокументовДокументПредставление.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(УОТекущийДокумент, Элементы.ДеревоДокументовСуммаДокумента.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(УОТекущийДокумент, Элементы.ДеревоДокументовВалютаДокумента.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(УОТекущийДокумент, Элементы.ДеревоДокументовКонтрагент.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(УОТекущийДокумент, Элементы.ДеревоДокументовКонтрагентИлиЛид.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(УОТекущийДокумент, Элементы.ДеревоДокументовОрганизация.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(УОТекущийДокумент, Элементы.ДеревоДокументовКомментарий.Имя);
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УОТекущийДокумент, "Шрифт", ШрифтыСтиля.ШрифтПолужирныйУНФ);
	
	УОНепроведенныйДокумент = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(УОНепроведенныйДокумент.Отбор,
		"ДеревоДокументов.ПометкаУдаления", Истина, ВидСравненияКомпоновкиДанных.Равно);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(УОНепроведенныйДокумент, "ДеревоДокументовДокументПредставление");
	РаботаСФормой.ДобавитьОформляемыеПоля(УОНепроведенныйДокумент, "ДеревоДокументовСуммаДокумента");
	РаботаСФормой.ДобавитьОформляемыеПоля(УОНепроведенныйДокумент, "ДеревоДокументовКонтрагент");
	РаботаСФормой.ДобавитьОформляемыеПоля(УОНепроведенныйДокумент, "ДеревоДокументовОрганизация");
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УОНепроведенныйДокумент, "ЦветТекста",
		ЦветаСтиля.НедоступныеДанныеЦвет);
	
	УОНесколькоКонтрагентов = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(УОНесколькоКонтрагентов.Отбор,
		"ДеревоДокументов.НесколькоКонтрагентов", Истина, ВидСравненияКомпоновкиДанных.Равно);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(УОНесколькоКонтрагентов, "ДеревоДокументовКонтрагент");
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УОНесколькоКонтрагентов, "Текст", НСтр("ru = '<Несколько>'"));
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УОНесколькоКонтрагентов, "ЦветТекста",
		ЦветаСтиля.НедоступныеДанныеЦвет);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоДокументов()

	Если Не ПустаяСтрока(СтрокаПоиска) Тогда
		УстановитьОтборСтрок(СтрокаПоиска);
		Возврат;
	КонецЕсли;
	
	Если ОсновнойДокументЕщеДоступен() Тогда
		ТекущаяСсылкаНаДокумент = ?(Не Элементы.ДеревоДокументов.ТекущаяСтрока = Неопределено,
			Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка, Неопределено); 
		
		ВывестиДеревоДокументов(); 
		
		РазвернутьДеревоЗначенийСвойств(Элементы.ДеревоДокументов, ДеревоДокументов); 
		
		Если ТекущаяСсылкаНаДокумент <> Неопределено Тогда
			НайтиАктивнуюСтроку(ДеревоДокументов, ТекущаяСсылкаНаДокумент);
			Элементы.ДеревоДокументов.ТекущаяСтрока = СтрокаПозиционированияПослеОбновления;
			СтрокаПозиционированияПослеОбновления = Неопределено;
		КонецЕсли;
		
	Иначе
		ЗакрытьФормуСПредупреждением(НСтр("ru = 'Документ, для которого сформирован отчет о структуре
		|подчиненности был удален, или же стал недоступен.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтактнуюИнформацию()
	
	КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, ТекущийКонтрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюПоРеквизитамДокумента()
	
	ТекущиеДанные = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ДеталиАвтор.Видимость = Ложь;
		Элементы.ДеталиОтветственный.Видимость = Ложь;
		Элементы.ДеталиСостояние.Видимость = Ложь;
		Элементы.ДеталиОперация.Видимость = Ложь;
		Элементы.ДеталиКомментарий.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ДеталиАвтор.Видимость = Истина;

	Если ТипЗнч(ТекущиеДанные.Ответственный) = Тип("СправочникСсылка.Сотрудники") Тогда
		Элементы.ДеталиОтветственный.Видимость = Истина;
	Иначе
		Элементы.ДеталиОтветственный.Видимость = Ложь;
	КонецЕсли;
	
	Если ТекущиеДанные.СостояниеЗаказа <> Неопределено Тогда
		ДеталиСостояние = ТекущиеДанные.СостояниеЗаказа;
		Элементы.ДеталиСостояние.Видимость = Истина;
	КонецЕсли;
	
	Если ТекущиеДанные.Состояние <> Неопределено Тогда
		ДеталиСостояние = ТекущиеДанные.Состояние;
		Элементы.ДеталиСостояние.Видимость = Истина;
	КонецЕсли;
	
	Если ТекущиеДанные.Состояние = Неопределено И ТекущиеДанные.СостояниеЗаказа = Неопределено Тогда
		Элементы.ДеталиСостояние.Видимость = Ложь;
	КонецЕсли;
	
	Если ТекущиеДанные.ВидОперации <> Неопределено Тогда
		ДеталиОперация = ТекущиеДанные.ВидОперации;
		Элементы.ДеталиОперация.Видимость = Истина;
	Иначе
		Элементы.ДеталиОперация.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ДеталиКомментарий.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	ИмяКлючаОбъекта = "СвязныеДокументы";
	
	ХранилищеСистемныхНастроек.Сохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта + "_" + "ВидимостьПанелиОтборов",
		Элементы.ФильтрыНастройкиИДопИнфо.Видимость);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()
	
	ИмяКлючаОбъекта = "СвязныеДокументы";
	
	НовоеЗначениеВидимость = ХранилищеСистемныхНастроек.Загрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта + "_"
		+ "ВидимостьПанелиОтборов");
	
	Если НовоеЗначениеВидимость = Неопределено Тогда
		НовоеЗначениеВидимость = Истина;
	КонецЕсли;
	
	Элементы.ФильтрыНастройкиИДопИнфо.Видимость = НовоеЗначениеВидимость;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоЗначенийСвойств(ЭлементФормы, Дерево) Экспорт
	
	Для каждого Элемент Из Дерево.ПолучитьЭлементы() Цикл
		Идентификатор = Элемент.ПолучитьИдентификатор();
		ЭлементФормы.Развернуть(Идентификатор, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовПриАктивизацииСтрокиОбработчик()
	
	НужноОбновитьПанельКИ = КонтактнаяИнформацияПанельУНФКлиент.НужноИзменитьКонтактнуюИнформациюПриАктивизацииСтрокиТаблицы(
	ЭтотОбъект, Элементы.ДеревоДокументов, ТекущийКонтрагент, "КонтрагентИлиЛид");
	
	Если НужноОбновитьПанельКИ Тогда
		
		ОбновитьКонтактнуюИнформацию();
		
		Если Не ЗначениеЗаполнено(ТекущийКонтрагент) Тогда
			
			Если Не Элементы.Найти("ДанныеПанелиКонтактнойИнформации") = Неопределено Тогда
				ЭтотОбъект.ДанныеПанелиКонтактнойИнформации[0].Отображение = НСтр(
					"ru='<Выберите документ с контрагентом>'");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьИнформациюПоРеквизитамДокумента();
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ИндексФильтры.Видимость = Ложь;
	Элементы.ИндексФильтрыТакси.Видимость = Истина;
	
КонецПроцедуры

#Область Отборы

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение,
	ПредставлениеЗначения = "", ВывестиДанные = Истина)
	
	Если ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение,
		ПредставлениеЗначения);
	
	Если ВывестиДанные Тогда
		ОтобразитьДокументыСписком();
	КонецЕсли;
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		УдалитьМеткуОтбора(МеткаИД, Ложь);
		УстановитьОтборСтрок(СтрокаПоиска);
		Возврат;
	КонецЕсли;
	
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД, ВывестиДанные = Истина)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Неопределено, МеткаИД, , , Ложь);
	
	Если ВывестиДанные Тогда
		Если ДанныеМеток.Количество() Тогда
			ОтобразитьДокументыСписком();
		Иначе
			ВывестиДеревоДокументов();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

#КонецОбласти

#Область ПанельКонтактнойИнформации

&НаСервере
Процедура ОбновитьПанельКонтактнойИнформацииСервер()
	
	КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, ТекущийКонтрагент);
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока,
		Поле, СтандартнаяОбработка);
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(Элемент)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыполнитьКоманду(Команда)
	
	КонтактнаяИнформацияПанельУНФКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ТекущийКонтрагент);
	
КонецПроцедуры

#КонецОбласти

#Область Поиск

&НаКлиенте
// Устанавливает отбор строк в зависимости от значения поля поиска
Процедура УстановитьОтборСтрок(ЗначениеПоиска)
	
	Если ПустаяСтрока(ЗначениеПоиска)
		Тогда 
		
		Если ДанныеМеток.Количество() Тогда
			ОтобразитьДокументыСписком();
		Иначе
			ВывестиДеревоДокументов();
		КонецЕсли;
	
		РазвернутьДеревоЗначенийСвойств(Элементы.ДеревоДокументов,ДеревоДокументов);
	КонецЕсли;
	
	СписокДокументов = Новый СписокЗначений;
	
	ИскомоеЗначение = "" + ЗначениеПоиска;
	
	Если ПустаяСтрока(ИскомоеЗначение) Тогда
		Возврат;
	Иначе
		МассивПоиска =  ПолучитьМассивПоиска(СтрЗаменить(ИскомоеЗначение, ".", ","));
		Если НЕ МассивПоиска.Количество() = 0 Тогда
			Для Каждого ДанныеСтроки Из ТаблицаДокументов Цикл
				ТекстПоиска = СтрЗаменить(ВРег(""+
				ДанныеСтроки.ДокументПредставление + " "+
				ДанныеСтроки.Организация + " "+
				ДанныеСтроки.Контрагент + " "+
				ДанныеСтроки.Номер + " " +
				ДанныеСтроки.Комментарий + " "+
				Формат(ДанныеСтроки.СуммаДокумента, "ЧДЦ=2; ЧРД=,; ЧГ=") + " " + ""), ".", ",");
				
				ДанныеСтроки.Отбор = Истина;
				Для Каждого ПараПоиска Из МассивПоиска Цикл
					Если СтрНайти(ТекстПоиска, ПараПоиска.ИсходноеЗначение) + СтрНайти(ТекстПоиска,
						ПараПоиска.ИнвертированноеЗначение) = 0 Тогда
						ДанныеСтроки.Отбор = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ДанныеСтроки.Отбор
					Тогда
					СписокДокументов.Добавить(ДанныеСтроки.Ссылка);
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ВывестиБезРодителей(СписокДокументов);
	
КонецПроцедуры

&НаКлиенте
Функция ИнвертироватьСтроку(Строка)
	
	// АПК:1036-выкл
	СтрокаКириллица = "йцукенгшщзхъфывапролджэячсмитьбю.ё";
	СтрокаЛатиница = "qwertyuiop[]asdfghjkl;'zxcvbnm,./`";
	// АПК:1036-вкл
	
	Результат = "";
	Строка = НРег(Строка);
	Для Сч = 1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка, Сч, 1);
		Позиция = СтрНайти(СтрокаЛатиница, Символ);
		Если Позиция <> 0 Тогда
			Результат = Результат + Сред(СтрокаКириллица, Позиция, 1);
		Иначе
			Позиция = СтрНайти(СтрокаКириллица, Символ);
			Если Позиция <> 0 Тогда
				Результат = Результат + Сред(СтрокаЛатиница, Позиция, 1);
			Иначе
				Результат = Результат + Символ;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьМассивПоиска(Знач ИскомоеЗначение)
	
	Результат = Новый Массив;
	
	Если ИскомоеЗначение <> Неопределено Тогда
		ИскомоеЗначение = СтрЗаменить(ИскомоеЗначение,"%"," ");
		ИскомоеЗначение = СтрЗаменить(ИскомоеЗначение,"["," ");
		ИскомоеЗначение = СтрЗаменить(ИскомоеЗначение,"]"," ");
		ИскомоеЗначение = СтрЗаменить(ИскомоеЗначение,"_"," ");
		ИскомоеЗначение = СтрЗаменить(ИскомоеЗначение,""""," ");
		ИскомоеЗначение = СтрЗаменить(ИскомоеЗначение,"¶"," ");
		ИскомоеЗначение = СокрЛП(ИскомоеЗначение);
		ИскомоеЗначение = ИскомоеЗначение;
		
		ИскомоеЗначение = ИскомоеЗначение + " ";
		Пока СтрНайти(ИскомоеЗначение,"  ") <> 0 Цикл
			ИскомоеЗначение = СтрЗаменить(ИскомоеЗначение,"  "," ");
		КонецЦикла;
		
		Позиция = СтрНайти(ИскомоеЗначение," ");
		
		Пока Позиция <> 0 Цикл
			
			ИсходноеЗначение = Лев(ИскомоеЗначение,Позиция - 1);
			ИнвертированноеЗначение = ИнвертироватьСтроку(ИсходноеЗначение);
			
			Результат.Добавить(Новый Структура("ИсходноеЗначение,ИнвертированноеЗначение", ВРег(ИсходноеЗначение), ВРег(
				ИнвертированноеЗначение)));
			
			ИскомоеЗначение = Сред(ИскомоеЗначение, Позиция + 1);
			Позиция = СтрНайти(ИскомоеЗначение," ");
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
