
// Описание механизма работы изменения значений ФО:
// В момент подключения приложения будут изменены функциональные опции, относящиеся к следующим категориям:
// - функциональные опции Булевского типа, имеющие значение по умолчанию = Истина
// - функциональные опции, для которых установлен параметр Принудительное включение
// Остальные ФО остаются в том же состоянии, что и были.
// В момент отключения приложения происходит следующее:
// - функциональные опции, для которых установлен параметр ЗначениеПриОтключении принимают это значенин
// - функциональные опции Булевского типа, имеющие значение по умолчанию = Истина становятся равны Ложь
// - остальные ФО принимают значение, указанное в поле ЗначениеПоУмолчанию
// Ниже будут приведены основные сценарии добавления новых ФО в кубик с описанием действий, которые необходимо
// предпринять для того или иного результата:
// - Если необходимо просто задеклалировать наличие ФО в кубике, достаточно использовать следующую конструкцию:
//
//	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения", Ложь);
//
// В момент подключения приложения указанная ФО просто станет доступной, в момент отключения приложения примет значение Ложь
//	
// - Если необходимо, чтобы в момент включения ФО приняла указанное значение:
//
//	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеКодовВПечатныхФормах", Перечисления.КодыНоменклатурыВДокументах.Код, , Истина);
//
// В момент подключения приложения указанная ФО примет значение Перечисления.КодыНоменклатурыВДокументах.Код,
// в момент отключения ФО так же станет Перечисления.КодыНоменклатурыВДокументах.Код
//
// - Если необходимо, чтобы в момент подключения ФО приняла одно значение, а в момент отключения - другое:
//
//	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеКодовВПечатныхФормах", 
//		Перечисления.КодыНоменклатурыВДокументах.Код, Перечисления.КодыНоменклатурыВДокументах.Артикул, Истина);
//
// Важно уточнить, что для максимально корректной работы, в особенности в вопросе сохранения значений ФО,
// рекомендуется использовать оба параметра, как на примере выше - и принудительное включение, и значение при отключении.
// В случае использования только одного параметра рекомендуется вносить такую ФО в список Игнорируемых ФО (ТарификацияБизнес.ТаблицаИгнорируемыхФО),
// так как для таких случаев не гарантируется корректное сохранение значений измененных ФО

#Область ПрограммныйИнтерфейс

Процедура ВключитьВозможностиПриложения() Экспорт
	
	ВозможностиПодключаемогоПриложения = ФункциональныеВозможностиПриложения();
	
	Отбор = Новый Структура("ЗначениеПоУмолчанию", Истина);
	ВозможностиПриложенияВключенныеПоУмолчанию = ВозможностиПодключаемогоПриложения.НайтиСтроки(Отбор);
	
	Для каждого ВозможностьПриложения Из ВозможностиПриложенияВключенныеПоУмолчанию Цикл
		
		Попытка
			ИмяКонстанты = ВозможностьПриложения.Имя;
			Константы[ИмяКонстанты].Установить(Истина);
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Отбор = Новый Структура("ПринудительноеВключение", Истина);
	ВозможностиПриложенияВключенныеПоУмолчанию = ВозможностиПодключаемогоПриложения.НайтиСтроки(Отбор);
	
	Для каждого ВозможностьПриложения Из ВозможностиПриложенияВключенныеПоУмолчанию Цикл
		
		Попытка
			ИмяКонстанты = ВозможностьПриложения.Имя;
			Константы[ИмяКонстанты].Установить(ВозможностьПриложения.ЗначениеПоУмолчанию);
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ПроизвестиНестандартнуюОбработкуПриВключении();
	
КонецПроцедуры

Процедура ОтключитьВозможностиПриложения(ИсключаяВозможностиПриложений) Экспорт
	
	ОтключаемыеВозможности = ФункциональныеВозможностиПриложения();
	
	Для Каждого ОтключаемаяВозможность Из ОтключаемыеВозможности Цикл
		
		Если ИсключаяВозможностиПриложений.Найти(ОтключаемаяВозможность.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ИмяКонстанты = ОтключаемаяВозможность.Имя; 
			
			Если ОтключаемаяВозможность.ЗначениеПриОтключении <> Неопределено Тогда
				Константы[ИмяКонстанты].Установить(ОтключаемаяВозможность.ЗначениеПриОтключении); 
			Иначе	
				Константы[ИмяКонстанты].Установить(Ложь);
			КонецЕсли;    
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
	
		КонецПопытки;
		
	КонецЦикла;
	
	// специфичная функциональность
	ПроизвестиНестандартнуюОбработкуПриОтключении();	
	
КонецПроцедуры

// Процедура настраивает форму заказа покупателя для приложения "Выставление счетов"
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - Форма документа "Заказ покупателя"
//
Процедура ПриСозданииНаСервереЗаказПокупателя(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	ИнтерфейсВыставленияСчетов = ПолучитьФункциональнуюОпцию("ИнтерфейсВыставлениеСчетов");
	
	// Специфические действия с элементами формы
	Если ИнтерфейсВыставленияСчетов Тогда
		
		// Прячем контекстные отчеты
		ПараметрыФОСвязанныхОтчетов = Новый Структура;
		ПараметрыФОСвязанныхОтчетов.Вставить("СвязанныеОтчеты", Неопределено);
		Форма.УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФОСвязанныхОтчетов);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Страницы", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаПодарки", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаДоставка", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаПлатежныйКалендарь", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПредоплата", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаБонусы", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаОтчетПоСкидкам", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаОбменССайтом", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСостояниеЭДО", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаДополнительно", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаЗавершениеЗаказа", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаПодарки", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаМатериалыЗаказчика", "Видимость", Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСодержимоеЗаказа", "ВертикальнаяПрокруткаПриСжатии", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаЗапасы", "ВертикальнаяПрокруткаПриСжатии", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаТаблицаЗапасы", "ВертикальнаяПрокруткаПриСжатии", Ложь);
		Форма.ВертикальнаяПрокрутка = ВертикальнаяПрокруткаФормы.ИспользоватьПриНеобходимости;

		Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			Форма.АвтоЗаголовок = Ложь;
			Форма.Заголовок = НСтр("ru = 'Счет (создание)'");
		КонецЕсли;
		
		ВосстановитьНастройкиФормыЗаказа(Форма);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанель", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанельСвернуто", "Видимость", Ложь);
		
		Форма.ОтображатьКоманднуюПанель = Истина;
		// Перносим заголовки влево
		Элементы.РеквизитыШапкиВыставлениеСчетов.ПоложениеЗаголовковПодчиненных = ПоложениеЗаголовковПодчиненныхЭлементовФормы.Слева;
		Элементы.ГруппаЗаголовокСчета.ПоложениеЗаголовковПодчиненных = ПоложениеЗаголовковПодчиненныхЭлементовФормы.Слева;
		Элементы.ШапкаВыставлениеСчетовЛеваяКолонка.ПоложениеЗаголовковПодчиненных = ПоложениеЗаголовковПодчиненныхЭлементовФормы.Слева;
		
		ПереносВлево											 = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.ПодписьРуководителяПодвал.ПоложениеЗаголовка	 = ПереносВлево;
		Элементы.ПодписьБухгалтераПодвал.ПоложениеЗаголовка		 = ПереносВлево;
		Элементы.РекламныйБлокПечтаныхФорм.ПоложениеЗаголовка	 = ПереносВлево;
		
		// Убираем недоступные в бизнес приложении элементы
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыИзменитьВыделенные", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СгруппироватьПозиции", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияРазделитель3", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПровести", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаОтменаПроведения", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандыВажно", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандыФормыСтандартные", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандыГлобальные", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандыОбычные", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандыСмТакже", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюСоздатьНаОснованииПереопределен", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюЗаполнить", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправка", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаКоманднаяПанельКомандыЭДО", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаНастройкаФормы", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыКомандыТорговогоОборудования", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыКомандыКопированияСтрок", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыГруппаЗаполнения", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыКонтекстноеМенюЗапасыРазбитьСтроку", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыКонтекстноеМенюЗапасыРазбитьСтроку1", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыКонтекстноеМенюПоказатьДублиСтрок", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыКонтекстноеМенюПоказатьДублиСтрок1", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПоказатьВСписке", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандыПоказатьВСписке", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПоказатьВСписке1", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюОтчеты", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаИзменитьФорму", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыВывестиСписок", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыНастройкаФормы", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыКоманднаяПанельУпрощенно", "Видимость", Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыКоманднаяПанель", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КнопкаПровестиИЗакрытьУпрощенно", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КнопкаПровестиУпрощенно", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалВыставлениеСчетов", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыставлениеСчетовКоманднаяПанельГруппа", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыставлениеСчетовНДС", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыВыставлениеСчетовПоказатьСкидки", "Видимость", Истина);
		
		//Меняем заголовок у кнопки
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПровестиИЗакрыть", "Заголовок", "Записать и закрыть");
		
		ЭтоТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
		Если ЭтоТакси Тогда
			// Такси
			// Убираем сворачиваемость группы Подвал при Такси
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИтогиВыставлениеСчетовТакси", "Видимость", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалВыставлениеСчетов", "Поведение", ПоведениеОбычнойГруппы.Авто);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалВыставлениеСчетовСвернуто", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИтогиВыставлениеСчетов", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанельСвернуто", "Ширина", 4);
			//убираем галочки в ТЧ
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыПометка", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыНомерСтрокиПредставление", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыФлажки", "Видимость", Ложь);
			// Кнопку отобразим удалить
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыУдалитьУпрощенно", "Видимость", Истина);
			// Шрифты
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияВсегоНаименований", "Шрифт", ШрифтыСтиля.ОбычныйШрифтТекста);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияСуммаПрописью", "Шрифт", ШрифтыСтиля.ГруппаВариантовОтчетовВажнаяШрифт);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПровестиИЗакрыть", "Шрифт", ШрифтыСтиля.ШрифтПолужирныйУНФ);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КнопкаПровестиИЗакрытьУпрощенно", "Шрифт", ШрифтыСтиля.ШрифтПолужирныйУНФ);
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтгруженПраваяПанель", "ГоризонтальныйИнтервал", ИнтервалМеждуЭлементамиФормы.Нет);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОплаченПраваяПанель", "ГоризонтальныйИнтервал", ИнтервалМеждуЭлементамиФормы.Нет);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗавершенПраваяПанель", "ГоризонтальныйИнтервал", ИнтервалМеждуЭлементамиФормы.Нет);
			
			Элементы.ПраваяПанель.Ширина = 25;
			Элементы.ВидЗакрывающегоДокументаБизнесПриложение.Ширина = 15;
			Элементы.НомерЗакрывающегоДокумента.Ширина = 17;
			Элементы.ДатаЗакрывающегоДокумента.Ширина = 15;
			Элементы.ДатаДоговораБизнесПриложение.Ширина = 10;
			Элементы.ДатаПлатежноРасчетногоДокументаБизнесПриложение.Ширина = 10;
			Элементы.ДатаСчетаФактурыНаАвансБизнесПриложение.Ширина = 10;
			Элементы.ВидЗакрывающегоДокументаБизнесПриложение.РастягиватьПоГоризонтали = Ложь;
			Элементы.ПраваяПанельКонтент.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Двойной;
			
		Иначе
			// 8.5
			// Заголовки слева
			Элементы.ИтогиВыставлениеСчетовКолонка1.ПоложениеЗаголовковПодчиненных = ПоложениеЗаголовковПодчиненныхЭлементовФормы.Слева;
			Элементы.ИтогиВыставлениеСчетовКолонка2.ПоложениеЗаголовковПодчиненных = ПоложениеЗаголовковПодчиненныхЭлементовФормы.Слева;
			Элементы.СкидкиВыставлениеСчетов.ПоложениеЗаголовковПодчиненных = ПоложениеЗаголовковПодчиненныхЭлементовФормы.Слева;
			// Убираем упрощенную командную панель
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаКоманднаяПанельУпрощенно", "Видимость", Ложь);
			// Включаем обычные командные панели
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаКоманднаяПанель", "Видимость", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыКоманднаяПанель", "Видимость", Истина);
			// Квадратные картинки в карточках
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПечатьВыставлениеСчетов", "Ширина", 10);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПечатьВыставлениеСчетов", "Высота", 3);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЛоготипВыставлениеСчетов", "Ширина", 10);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЛоготипВыставлениеСчетов", "Высота", 3);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияQRСБП", "Ширина", 10);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияQRСБП", "Высота", 3);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияQR", "Ширина", 10);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияQR", "Высота", 3);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Страницы", "РастягиватьПоВертикали", Истина);
			// Увеличим ширину правой панели
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанель", "Ширина", 30);
			// Переносим в командную панель действия с документом (4 кнопки вверху)
			Элементы.Переместить(Элементы.ОнлайнЗаказыВыставлениеСчетов, Элементы.ФормаКоманднаяПанель);
			Элементы.Переместить(Элементы.ОтправитьСчетПоПочте, Элементы.ФормаКоманднаяПанель);
			Элементы.Переместить(Элементы.НапечататьСчетВыставлениеСчетов, Элементы.ФормаКоманднаяПанель);
			Элементы.Переместить(Элементы.СохранитьСчетPDF, Элементы.ФормаКоманднаяПанель);
			// Скрыть кнопку удалить
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыУдалитьУпрощенно", "Видимость", Ложь);
			// Цвет правой панели Авто
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанель", "ЦветФона", Новый Цвет());
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанельСвернуто", "ЦветФона", Новый Цвет());
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияПустойОтступОтФильтров", "Видимость", Ложь);
		КонецЕсли;
	
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанель", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанельСвернуто", "Видимость", Ложь);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Шапка", "Видимость", НЕ ИнтерфейсВыставленияСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Подвал", "Видимость", НЕ ИнтерфейсВыставленияСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ШапкаВыставлениеСчетов", "Видимость", ИнтерфейсВыставленияСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалВыставлениеСчетов", "Видимость", ИнтерфейсВыставленияСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалВыставлениеСчетовОбъединение", "Видимость", ИнтерфейсВыставленияСчетов);
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() И ИнтерфейсВыставленияСчетов Тогда
		
		Элементы.ГруппаВсегоСуммаПрописью.Видимость = Ложь;
		Элементы.ГруппаИтогиВыставлениеСчетов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.СкидкиВыставлениеСчетов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		Элементы.ГруппаПодписиВыставлениеСчетов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ГруппаПодписиГоризонтально.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ОтображениеПодписиРуководитель.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.ОтображениеПодписиБухгалтер.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.ГруппаПечатьВыставлениеСчетов.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.ПечатьВыставлениеСчетов.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.СкидкаСуммаВыставлениеСчетов.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.СкидкаПроцентВыставлениеСчетов.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.СкидкиВыставлениеСчетов.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.СкидкаПроцентВыставлениеСчетов.РастягиватьПоГоризонтали = Неопределено;
		Элементы.СкидкиВыставлениеСчетов.РастягиватьПоГоризонтали = Неопределено;
		
		Элементы.ГруппаЗаказИПраваяПанель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ПраваяПанель.Ширина = 0;
		Элементы.ГруппаОтступ.Видимость = Ложь;
		
		Элементы.ГруппаПодписиРеклама.Ширина = 0;
		Элементы.ГруппаПодписиРеклама.РастягиватьПоГоризонтали = Неопределено;
		Элементы.ТекстУсловийСчетаЗаказаВыставлениеСчетов.Ширина = 0;
		Элементы.ТекстУсловийСчетаЗаказаВыставлениеСчетов.РастягиватьПоГоризонтали = Неопределено;
		Элементы.РекламныйБлокПечтаныхФорм.АвтоМаксимальнаяШирина = Истина;
		
		Элементы.ПодвалВыставлениеСчетов.Поведение = ПоведениеОбычнойГруппы.Авто;
		Элементы.ПодвалВыставлениеСчетовСвернуто.Видимость = Ложь;
		Элементы.ГруппаИтогиВыставлениеСчетов.Ширина = 0;
		Элементы.ГруппаИтогиВыставлениеСчетов.РастягиватьПоГоризонтали = Неопределено;
		
		Элементы.Переместить(Элементы.ШапкаВыставлениеСчетовПраваяКолонка, Элементы.ГруппаДляЛого);
		Элементы.ГруппаДляЛого.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ГруппаДляЛого.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы .Нет;
		Элементы.ЛоготипВыставлениеСчетов.Высота = 3;
		Элементы.ДекорацияQR.Высота = 2;
		Элементы.ДекорацияQRСБП.Высота = 2;
		
		Если ЭтоТакси Тогда
			Элементы.НомерВыставлениеСчетов.ШрифтЗаголовка = Новый Шрифт;
			Элементы.ДатаВыставлениеСчетов.ШрифтЗаголовка = Новый Шрифт;
			Элементы.ОтгрузкаДо.Заголовок = НСтр("ru = 'Отгрузка'");
			Элементы.ОтгрузкаДо.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы .Авто;
			Элементы.ОплатаДо.Заголовок = НСтр("ru = 'Оплата'");
			Элементы.ОплатаДо.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы .Авто;
			Элементы.ДекорацияQR.Ширина = 6;
			Элементы.ДекорацияQRСБП.Ширина = 6;
			Элементы.Переместить(Элементы.НомерВыставлениеСчетов, Элементы.РеквизитыШапкиВыставлениеСчетов);
			Элементы.Переместить(Элементы.ДатаВыставлениеСчетов, Элементы.РеквизитыШапкиВыставлениеСчетов);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура настраивает форму списка заказов покупателей для приложения "Выставление счетов"
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - Форма списка заказов покупателей
//
Процедура ПриСозданииНаСервереСписокЗаказПокупателя(Форма) Экспорт
	
	Форма.ИнтерфейсВыставлениеСчетов = ПолучитьФункциональнуюОпцию("ИнтерфейсВыставлениеСчетов");
	Если Не Форма.ИнтерфейсВыставлениеСчетов Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	ИнтеграцияСПлатежнымиСистемамиДоступна = ИнтеграцияСПлатежнымиСистемамиУНФ.ИнтеграцияДоступна();
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Форма.Заголовок = НСтр("ru = 'Выставление счетов'");
	Элементы.ОтборЗавершениеЗаказа.ПодсказкаВвода = НСтр("ru = 'Завершение счета'");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаОтгрузки", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборСостояние", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СостояниеЗаказа", "Видимость", Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправка", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаИзменитьФорму", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюОтчеты", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаКоманднаяПанельКомандыЭДО", "Видимость", Ложь);
	
	Элементы.КоманднаяПанель.Видимость = Ложь;
	Элементы.СписокКонтекстноеМенюУстановитьСостояние.Видимость = Ложь;
	Элементы.СписокКонтекстноеМенюСоздатьНаОснованииПереопределен.Видимость = Ложь;
	Элементы.СписокКонтекстноеМенюГруппаПроведение.Видимость = Ложь;
	Элементы.Детали.Видимость = Ложь;
	Элементы.ЗначокДетали.Видимость = Ложь;
	
	Элементы.ГруппаАналитикаВыставлениеСчетов.Видимость = Элементы.ПраваяПанельСтраницы.Видимость;
	Элементы.КоманднаяПанельУпрощенно.Видимость = Истина;
	Элементы.УстановитьСостояниеЗавершенКМВыставлениеСчетов.Видимость = Истина;
	
	Элементы.ЗагрузитьСтатусыОплатыВыставлениеСчетов.Видимость = ИнтеграцияСПлатежнымиСистемамиДоступна;
	
	Если ЭтоИнтерфейсТакси Тогда
		Элементы.Переместить(Элементы.КоманднаяПанельУпрощенно, Форма.КоманднаяПанель);
	Иначе
		Элементы.Переместить(Элементы.КоманднаяПанельУпрощенно, Элементы.Список.КоманднаяПанель, Элементы.КоманднаяПанель);
	КонецЕсли;
	
	ОбновитьАналитикуВСпискеЗаказов(Форма);
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		Элементы.Переместить(Элементы.ГруппаАналитикаВыставлениеСчетов, Элементы.ГруппаОтступ);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура дополняет движения документа "Заказ покупателя" необходимыми данными для приложения "Выставление счетов"
//
// Параметры:
//  ДокументСсылкаЗаказПокупателя	 - ДокументСсылка.ЗаказПокупателя - Заказ, который проводится
//  СтруктураДополнительныеСвойства	 - Структура - Параметры проведения
//
Процедура ПриПроведенииЗаказаПокупателя(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства) Экспорт
	
	ОплаченВВыставленииСчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылкаЗаказПокупателя, "ОплаченВВыставленииСчетов");
	ОтгруженВВыставленииСчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылкаЗаказПокупателя, "ОтгруженВВыставленииСчетов");
	
	Если ОплаченВВыставленииСчетов Тогда
		
		ИсходнаяТаблица = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОплатаСчетовИЗаказов.Скопировать();
		
		Для каждого ИсходнаяСтрока Из ИсходнаяТаблица Цикл
		
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОплатаСчетовИЗаказов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяСтрока);
			НоваяСтрока.СуммаАванса = НоваяСтрока.Сумма;
			НоваяСтрока.Сумма = 0;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОтгруженВВыставленииСчетов Тогда
		
		ИсходнаяТаблица = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПокупателей.Скопировать();
		
		Для каждого ИсходнаяСтрока Из ИсходнаяТаблица Цикл
		
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПокупателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяСтрока);
			НоваяСтрока.ВидДвижения = ?(ИсходнаяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура обновляет аналитику в списке заказов покупателей
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - Форма списка заказов покупателей
//
Процедура ОбновитьАналитикуВСпискеЗаказов(Форма) Экспорт
	
	ДанныеАналитики = Новый Структура;
	ДанныеАналитики.Вставить("ВсегоЗаказов", 0);
	ДанныеАналитики.Вставить("ОплаченоЗаказов", 0);
	ДанныеАналитики.Вставить("СуммаВсего", 0);
	ДанныеАналитики.Вставить("СуммаОплачено", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказПокупателя.Ссылка), 0) КАК ВсегоЗаказов,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ЗаказПокупателя.СуммаДокумента <= ЕСТЬNULL(ФактОплатыЗаказов.СуммаАванса, 0) + ЕСТЬNULL(ФактОплатыЗаказов.СуммаОплаты, 0)
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ОплаченоЗаказов,
		|	ЕСТЬNULL(СУММА(ЗаказПокупателя.СуммаДокумента), 0) КАК СуммаВсего,
		|	ЕСТЬNULL(СУММА(ЕСТЬNULL(ФактОплатыЗаказов.СуммаАванса, 0) + ЕСТЬNULL(ФактОплатыЗаказов.СуммаОплаты, 0)), 0) КАК СуммаОплачено
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФактОплатыЗаказов КАК ФактОплатыЗаказов
		|		ПО (ФактОплатыЗаказов.СчетНаОплату = ЗаказПокупателя.Ссылка)
		|ГДЕ
		|	ЗаказПокупателя.Проведен
		|	И ЗаказПокупателя.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаявкаНаПродажу)
		|	И ЗаказПокупателя.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаявкаЗаказНаряд)
		|	И &Отборы";
	
	СтрокаОтборов = "";
	
	Если ЗначениеЗаполнено(Форма.ОтборПериод.ДатаНачала) 
		ИЛИ ЗначениеЗаполнено(Форма.ОтборПериод.ДатаОкончания) Тогда
		
		Если НЕ ЗначениеЗаполнено(Форма.ОтборПериод.ДатаОкончания) Тогда
			СтрокаОтборов = " И ЗаказПокупателя.Дата >= &ДатаНачала";
		Иначе
			СтрокаОтборов = " И ЗаказПокупателя.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНачала", Форма.ОтборПериод.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", Форма.ОтборПериод.ДатаОкончания);
		
	КонецЕсли;
	
	ШаблонОтбора = " И ЗаказПокупателя.ИмяПоляОтбора В (&ИмяПоляОтбора)";
	
	СписокОтборы = Новый Массив;
	СписокОтборы.Добавить("Организация");
	СписокОтборы.Добавить("Контрагент");
	СписокОтборы.Добавить("СостояниеЗаказа");
	СписокОтборы.Добавить("ВариантЗавершения");
	
	Для каждого СтрокаОтбора Из Форма.ДанныеМеток Цикл
		
		Если СписокОтборы.Найти(СтрокаОтбора.ИмяПоляОтбора) <> Неопределено Тогда
			СписокОтборы.Удалить(СписокОтборы.Найти(СтрокаОтбора.ИмяПоляОтбора));
			СтрокаОтборов = СтрокаОтборов + СтрЗаменить(ШаблонОтбора, "ИмяПоляОтбора", СтрокаОтбора.ИмяПоляОтбора);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаОтбора Из Форма.ДанныеМеток Цикл
		
		Если НЕ Запрос.Параметры.Свойство(СтрокаОтбора.ИмяПоляОтбора) Тогда
			 Запрос.УстановитьПараметр(СтрокаОтбора.ИмяПоляОтбора, Новый Массив);
		КонецЕсли;
		
		Запрос.Параметры[СтрокаОтбора.ИмяПоляОтбора].Добавить(СтрокаОтбора.Метка);
		
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Отборы", СтрокаОтборов);
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаИтоги.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеАналитики, ВыборкаИтоги);
	КонецЕсли;
	
	ЭтоТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ЭтоТакси Тогда
		МаксимальнаяДлинаИндикатора = 320;
	Иначе
		МаксимальнаяДлинаИндикатора = 340;
	КонецЕсли;
	ШаблонСумма = НСтр("ru='%1 ₽'");
	ШаблонКоличество = НСтр("ru='%1 шт.'");
	
	Форма.Элементы.ДекорацияСуммаВсего.Заголовок = СтрШаблон(ШаблонСумма, ДанныеАналитики.СуммаВсего);
	Форма.Элементы.ДекорацияСуммаОплачено.Заголовок = СтрШаблон(ШаблонСумма, ДанныеАналитики.СуммаОплачено);
	Форма.Элементы.ДекорацияКоличествоВсего.Заголовок = СтрШаблон(ШаблонКоличество, ДанныеАналитики.ВсегоЗаказов);
	Форма.Элементы.ДекорацияКоличествоОплачено.Заголовок = СтрШаблон(ШаблонКоличество, ДанныеАналитики.ОплаченоЗаказов);
	
	Если ДанныеАналитики.СуммаВсего = 0 ИЛИ ДанныеАналитики.СуммаОплачено = 0 Тогда
		ДлинаИндикатораОплаты = 0;
	Иначе
		Доля = ДанныеАналитики.СуммаОплачено / ДанныеАналитики.СуммаВсего;
		ДлинаИндикатораОплаты = Цел(МаксимальнаяДлинаИндикатора * Доля);
		Если ДлинаИндикатораОплаты > МаксимальнаяДлинаИндикатора Тогда
			ДлинаИндикатораОплаты = МаксимальнаяДлинаИндикатора;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоТакси Тогда
		ШаблонСостояниеОплатыЗаказов = ШаблонСостояниеОплатыЗаказовТакси();
		Форма.Элементы.СостояниеОплатыЗаказов.Ширина = 32;
	Иначе
		ШаблонСостояниеОплатыЗаказов = ШаблонСостояниеОплатыЗаказов85();
		Форма.Элементы.СостояниеОплатыЗаказов.Ширина = 34;
	КонецЕсли;
	ИмяВременногоФайлаSVG = ПолучитьИмяВременногоФайла();
	ФайлКартинки = Новый ЗаписьТекста(ИмяВременногоФайлаSVG);
	ФайлКартинки.Записать(СтрШаблон(ШаблонСостояниеОплатыЗаказов, ДлинаИндикатораОплаты));
	ФайлКартинки.Закрыть();
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайлаSVG);
	УдалитьФайлы(ИмяВременногоФайлаSVG);
	
	Форма.СостояниеОплатыЗаказов = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Форма.УникальныйИдентификатор);
	
КонецПроцедуры

// Процедура настраивает отображения декорации QR-кода
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - Форма документа заказ покупателя
//
Процедура НастроитьДекорациюQR(Форма) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИнтерфейсВыставлениеСчетов") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	ВидКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.Контрагент, "ВидКонтрагента");
	ЭтоЮрЛицо = ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган
					ИЛИ ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо
					ИЛИ ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
					
	Если ЭтоЮрЛицо Тогда
		
		Элементы.ДекорацияQR.Видимость = Ложь;
		Элементы.ДекорацияQRСБП.Видимость = Ложь;
		
	Иначе
		
		Если ПереводыСБПc2b.ПереводыСБПДоступны() Тогда
			НастройкиСБП = РегистрыСведений.СоответствиеНастроекИнтеграцииРМК.НастройкиИнтеграции(Форма.Объект.Организация, Форма.Объект.СтруктурнаяЕдиницаПродажи);
			НастроенСБП = НастройкиСБП <> Неопределено;
		Иначе
			НастроенСБП = Ложь;
		КонецЕсли;
		
		Если НастроенСБП Тогда
			Элементы.ДекорацияQR.Видимость = Ложь;
			Элементы.ДекорацияQRСБП.Видимость = Истина;
		Иначе
			Элементы.ДекорацияQR.Видимость = Истина;
			Элементы.ДекорацияQRСБП.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Сохраняет переданные настройки формы при их имзменении
//
// Параметры:
//  СтруктураНастроек - Структура - Настройки для сохранения.
//
Процедура СохранитьНастройкиФормы(СтруктураНастроек) Экспорт
	
	ИмяКлючаОбъекта = ПолучитьКлючОбъектаЗаказ();
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта + СтруктураНастроек.Имя, СтруктураНастроек.Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриСозданииНаСервереСписокКонтрагентов(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюФормуКонтрагентов") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправка", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаИзменитьФорму", "Видимость", Ложь);
	
	Элементы.КоманднаяПанель.Видимость = Ложь;
	Элементы.КонтактноеЛицо.Видимость = Ложь;
	Элементы.ЭДО.Видимость = Ложь;
	Элементы.ФильтрыНастройкиИДопИнфо.Видимость = Ложь;
	Элементы.ЗначкиФильтры.Видимость = Ложь;
	Элементы.СписокКонтекстноеМенюГруппаКоманд.Видимость = Ложь;
	Элементы.ФормаИзменитьОбъединитьВыделенныеКМ.Видимость = Ложь;
	Элементы.ГлобальныеКомандыКМ.Видимость = Ложь;
	Элементы.Подменю1СПАРКРиски.Видимость = Ложь;
	
	Элементы.КоманднаяПанельУпрощенно.Видимость = Истина;
	
	Если ЭтоИнтерфейсТакси Тогда
		Элементы.Переместить(Элементы.КоманднаяПанельУпрощенно, Форма.КоманднаяПанель);
	Иначе
		Элементы.Переместить(Элементы.КоманднаяПанельУпрощенно, Элементы.Список.КоманднаяПанель, Элементы.КоманднаяПанель);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ШаблонСостояниеОплатыЗаказовТакси()
	
	Возврат "<svg width=""320px"" height=""30px"" viewBox=""0 -10 321 30"" version=""1.1"" xmlns=""http://www.w3.org/2000/svg"" xmlns:xlink=""http://www.w3.org/1999/xlink"">
			|<rect x=""1"" y=""1"" rx=""2"" ry=""2"" width=""320"" height=""8"" fill=""#D0D0D0""/>
			|<rect x=""1"" y=""1"" rx=""2"" ry=""2"" width=""%1"" height=""8"" fill=""#00AA00""/>
			|</svg>";
	
КонецФункции

Функция ШаблонСостояниеОплатыЗаказов85()
	
	Возврат "<svg width=""340px"" height=""130px"" viewBox=""0 -10 341 40"" version=""1.1"" xmlns=""http://www.w3.org/2000/svg"" xmlns:xlink=""http://www.w3.org/1999/xlink"">
			|<rect x=""1"" y=""1"" rx=""6"" ry=""6"" width=""340"" height=""12"" fill=""#D0D0D0""/>
			|<rect x=""1"" y=""1"" rx=""6"" ry=""6"" width=""%1"" height=""12"" fill=""#0cdc40""/>
			|</svg>";
	
КонецФункции

Функция СформироватьСтрокуСимволов(Знач Символ, Знач ДлинаСтроки) Экспорт
	
	Результат = "";
	Для Индекс = 1 По ДлинаСтроки Цикл
		Результат = Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ФункциональныеВозможностиПриложения() Экспорт
	
	ТаблицаВозможностей = ТарификацияБизнес.НоваяТаблицаВозможностей();
	
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИнтерфейсВыставлениеСчетов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьУпрощеннуюРаботуСПодписями", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "УпрощеннаяРаботаСоСтавкамиНДС", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьУпрощеннуюФормуКонтрагентов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьУпрощеннуюФормуНоменклатуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьПростуюКоманднуюПанельВЗаказеПокупателя", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьПростуюКоманднуюПанельВОрганизациях", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ОтображатьПереходКСпискуНоменклатурыВГлавном", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ОтображатьПереходКСпискуПокупателей", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ФункциональнаяОпцияУчетЦенПродажи", Истина);

	ЕБВФункциональныеВозможностиПриложения(ТаблицаВозможностей);
	
	Возврат ТаблицаВозможностей;
	
КонецФункции

Функция ЕБВФункциональныеВозможностиПриложения(ТаблицаВозможностей = Неопределено) Экспорт 
	
	Если ТаблицаВозможностей = Неопределено Тогда
		ТаблицаВозможностей = ТарификацияБизнес.НоваяТаблицаВозможностей();
	КонецЕсли;	
	
	Возврат ТаблицаВозможностей;
	
КонецФункции

Процедура УстановитьЗначенияНастроекПриложения()
	
	// Настройки необходимо выполнить только в том случае, если счета еще не выставлялись
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Дата отгрузки по умолчанию будет равна дате документа
	НаборКонстант = Константы.СоздатьНабор("ВариантЗаполненияДатыОтгрузки,
		|ВидДнейРасчетаДатыОтгрузки, ПроизводственныйКалендарьРасчетаДатыОтгрузки, КоличествоДнейРасчетаДатыОтгрузки");
	
	НастройкиПоУмолчанию = Новый Структура;
	НастройкиПоУмолчанию.Вставить("ВариантЗаполненияДатыОтгрузки", Перечисления.ВариантыЗаполненияДатыОтгрузки.Прибавлять);
	НастройкиПоУмолчанию.Вставить("ВидДнейРасчетаДатыОтгрузки", Перечисления.ВидыДнейРасчетаДатыОтгрузки.Календарные);
	
	Календари = Справочники.ПроизводственныеКалендари.СписокПроизводственныхКалендарей();
	Если Календари.Количество() = 0 Тогда
		Календарь = Справочники.ПроизводственныеКалендари.ПустаяСсылка();
	Иначе
		Календарь = Календари[0];
	КонецЕсли;
	
	НастройкиПоУмолчанию.Вставить("ПроизводственныйКалендарьРасчетаДатыОтгрузки", Календарь);
	НастройкиПоУмолчанию.Вставить("КоличествоДнейРасчетаДатыОтгрузки", 0);
	
	ЗаполнитьЗначенияСвойств(НаборКонстант, НастройкиПоУмолчанию);
	НаборКонстант.Записать();
	
	// Дата оплаты по умолчанию будет равна дате документа
	НаборКонстант = Константы.СоздатьНабор("ВариантЗаполненияДатыОплаты,
		|ВидДнейРасчетаДатыОплаты, ПроизводственныйКалендарьРасчетаДатыОплаты, КоличествоДнейРасчетаДатыОплаты");
	
	НастройкиПоУмолчанию = Новый Структура;
	НастройкиПоУмолчанию.Вставить("ВариантЗаполненияДатыОплаты", Перечисления.ВариантыЗаполненияДатыОтгрузки.Прибавлять);
	НастройкиПоУмолчанию.Вставить("ВидДнейРасчетаДатыОплаты", Перечисления.ВидыДнейРасчетаДатыОтгрузки.Календарные);
	
	Календари = Справочники.ПроизводственныеКалендари.СписокПроизводственныхКалендарей();
	Если Календари.Количество() = 0 Тогда
		Календарь = Справочники.ПроизводственныеКалендари.ПустаяСсылка();
	Иначе
		Календарь = Календари[0];
	КонецЕсли;
	
	НастройкиПоУмолчанию.Вставить("ПроизводственныйКалендарьРасчетаДатыОплаты", Календарь);
	НастройкиПоУмолчанию.Вставить("КоличествоДнейРасчетаДатыОплаты", 0);
	
	ЗаполнитьЗначенияСвойств(НаборКонстант, НастройкиПоУмолчанию);
	НаборКонстант.Записать();
	
	// Выводим сумму без скидки в ПФ
	Константы.ВыводитьСуммуБезСкидки.Установить(Перечисления.ВариантыВыводаСуммыБезСкидки.Печатать);
	Константы.ПредставлениеКодовВПечатныхФормах.Установить(Перечисления.КодыНоменклатурыВДокументах.Артикул);
	Константы.ПредставлениеНомераДокументаБезПрефиксаИнформационнойБазы.Установить(Истина);
	Константы.ПредставлениеНомераДокументаБезПрефиксаОрганизации.Установить(Истина);
	Константы.ФункциональнаяОпцияКонтрольДоговоров.Установить(Перечисления.ВидыКонтроляДоговоровПриПроведении.НеКонтролировать);
	
	РегистрыСведений.СчетчикиПодсказок.ОтключитьСчетчик(Перечисления.ВидыПодсказок.РеквизитыОрганизацииДляПечати, 
														10, , Справочники.Организации.ОсновнаяОрганизация);
	
КонецПроцедуры

Процедура ВосстановитьНастройкиФормыЗаказа(Форма)
	
	ИмяКлючаОбъекта = ПолучитьКлючОбъектаЗаказ();
	
	ЭтоНовыйОбъект = Форма.Объект.Ссылка.Пустая();
	ЭтоКопирование = ЗначениеЗаполнено(Форма.Параметры.ЗначениеКопирования);
	
	Если ЭтоНовыйОбъект И НЕ ЭтоКопирование Тогда
		
		СохраненноеЗначение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+"_НДСУпрощенно");
		Если ЗначениеЗаполнено(СохраненноеЗначение) Тогда
			Форма.НДСУпрощенно = СохраненноеЗначение;
		КонецЕсли;
		
		СохраненноеЗначение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+"_ИспользоватьСкидки");
		Если СохраненноеЗначение  <> Неопределено Тогда
			Форма.Объект.ИспользоватьСкидкиВыставлениеСчетов = СохраненноеЗначение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКлючОбъектаЗаказ()
	
	Возврат "ЗаказПокупателяВыставлениеСчетов"; // Не локализуется
	
КонецФункции

Процедура ПроизвестиНестандартнуюОбработкуПриВключении()

	Константы.ИспользоватьРаботуСПоискомКонтрагентовВСписке.Установить(Ложь);
	Константы.ВыставлениеСчетовБылоВключено.Установить(Истина);
	
	// Устанавливаем настройки ЕБВ, которые необходимы для комфортной работы с приложением
	УстановитьЗначенияНастроекПриложения();
	
КонецПроцедуры

Процедура ПроизвестиНестандартнуюОбработкуПриОтключении()

	Константы.ВыставлениеСчетовБылоВключено.Установить(Истина);
	Константы.ВыставлениеСчетовБылоОтключено.Установить(Истина);
	
КонецПроцедуры

#КонецОбласти