///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ПолноеИмяОбъекта =  Параметры.ПолноеИмяОбъекта;
	ЗагрузитьТекущиеНастройкиПользователя();
	Если СкрытьПредупреждение Тогда
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
	КонецЕсли;
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Применение новых настроек'");
	ПараметрыВажногоСообщения.Сообщение = НСтр(
		"ru = 'Новые настройки применятся только при следующем открытии формы документа или списка документов'");
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда,
	НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого СтрокаСписка Из ВыбранныеПункты Цикл
		СтрокаСписка.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого СтрокаСписка Из ВыбранныеПункты Цикл
		СтрокаСписка.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	ЗаписатьВыбранныеПунктыПользователя();
	Оповестить("ВыполненаНастройкаПунктовСозданияНаОсновании");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройкиПоУмолчанию(Команда)
	ВосстановитьНастройкиПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьВыбранныеПунктыПользователя()
	РегистрыСведений.НастройкиВводаНаОсновании.ЗаписатьНастройкиПользователя(ТекущийПользователь, ПолноеИмяОбъекта,
		ВыбранныеПункты.Выгрузить());
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиПоУмолчаниюНаСервере()
	РегистрыСведений.НастройкиВводаНаОсновании.УдалитьНастройкиПользователя(ТекущийПользователь, ПолноеИмяОбъекта);
	ОбновитьПовторноИспользуемыеЗначения();
	ЗагрузитьТекущиеНастройкиПользователя();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТекущиеНастройкиПользователя()
	НастройкиПользователя = РегистрыСведений.НастройкиВводаНаОсновании.НастройкиПользователя(ТекущийПользователь,
		ПолноеИмяОбъекта);
	ВыбранныеПункты.Загрузить(НастройкиПользователя);
КонецПроцедуры

#КонецОбласти