#Область ПрограммныйИнтерфейс

#Область ПараметрыВыбора

// Устанавливает параметры выбора номенклатуры.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой нужно установить параметры выбора
//  ВидыПродукции - СправочникСсылка.ВидыПродукцииИС, Массив Из СправочникСсылка.ВидыПродукцииИС - Вид продукции.
//  ИмяПоляВвода - Строка - имя поля ввода номенклатуры.
Процедура УстановитьПараметрыВыбораНоменклатуры(Форма, ВидыПродукции = Неопределено, ИмяПоляВвода = "ТоварыНоменклатура") Экспорт
	
	ИнтеграцияИСМПУНФКлиентСервер.УстановитьПараметрыВыбораНоменклатуры(Форма, ВидыПродукции, ИмяПоляВвода);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
