
#Область ОписаниеПеременных

&НаКлиенте
Перем ЭтоНоваяСтрока;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда
			Объект.Организация = Параметры.Организация;
		КонецЕсли;
		Если ЗначениеЗаполнено(Параметры.ДокументОснование) Тогда
			ЗаполнитьДокументПоСчетуНаОплату(Параметры.ДокументОснование);
		КонецЕсли;
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		СтруктураРеквизитовВыгрузки = Объект.Ссылка.ПолучитьОбъект().СтруктураРеквизитовВыгрузки.Получить();
	КонецЕсли;
		
	Если СтруктураРеквизитовВыгрузки = Неопределено Тогда
		СтруктураРеквизитовВыгрузки = Параметры.ЗначениеКопирования.СтруктураРеквизитовВыгрузки.Получить();
		Если СтруктураРеквизитовВыгрузки = Неопределено Тогда
			СтруктураРеквизитовВыгрузки = ОбновитьДанныеРеквизитовВыгрузки();
		КонецЕсли;
	КонецЕсли;
	
	Документы.ЗаявлениеОВвозеТоваров.ОбновитьСтруктуруРеквизитовВыгрузки(СтруктураРеквизитовВыгрузки);
	
	НайтиРеглУведомлениеДОПП();
	ЗаполнитьТекстПроДОПП();
	УстановитьПараметрыВыбораСтавкиНДС();
	УстановитьПараметрыВыбораДоговора(); 
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	ИспользоватьМногофирменныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Если Не ИспользоватьМногофирменныйУчет И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Организация.Гиперссылка = Истина;
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Объект, "НомерДОПП,ДатаДОПП");
	ЗаполнитьТекстНомерДОПП();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Оповестить("Запись_ЗаявлениеОВвозеТоваров", ПараметрыЗаписи, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	ОбновитьИтоги(ЭтотОбъект);
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
	УстановитьСостояниеДокумента();
	
	Если Не Объект.ПометкаУдаления Тогда
		ЗарегистрироватьАктуализироватьДОПП();
		ЗаполнитьТекстПроДОПП();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.ЗаявлениеОВвозеТоваров.Форма.ФормаРедактированияАкцизов" Тогда
		ОбработкаВыбораАкцизы(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СтруктураРеквизитовВыгрузки = Новый ХранилищеЗначения(СтруктураРеквизитовВыгрузки);
	
	ПроведениеСервер.УстановитьПризнакПроверкиРеквизитов(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		КонтрагентПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПризнакДОПППриИзменении(Элемент)
	
	Если Объект.Товары.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения(
			"ВопросПередИзменениемПризнакаДОППЗавершение", ЭтотОбъект, Новый Структура);
		ТекстВопроса = НСтр("ru = 'Особый признак ДОПП будет установлен для всех строк. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ОрганизацияПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ОсобыйПризнакЗаявителяПриИзменении(Элемент)
	
	Если Объект.ОсобыйПризнакЗаявителя <> 2 Тогда
		Объект.ИнойОсобыйПризнакЗаявителя = "";
	КонецЕсли;
	
	ОсобыйПризнакЗаявителяПриИзмененииНаСервере();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ДоговорКонтрагентаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйЗнакПрицепаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.РегистрационныйЗнакПрицепа) Тогда
		Объект.РегистрационныйЗнакПрицепаДополнительный = "";
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНаДОППНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Ключ", СсылкаНаДОПП);
	ФормаДОПП = ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.ФормаДокумента",
		ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииНоменклатуры(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	Если ЕстьУчетПодакцизныхТоваров Тогда
		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;	
		ТекущиеДанные.НалоговаяБазаНДС = ТекущиеДанные.НалоговаяБазаНДС - ТекущиеДанные.СуммаАкциза;
		РассчитатьСуммуАкцизаВТабЧастиПоЗаявлениюОВвозе(ТекущиеДанные, Истина);
		ТекущиеДанные.НалоговаяБазаНДС = ТекущиеДанные.НалоговаяБазаНДС + ТекущиеДанные.СуммаАкциза;
		ДанныеСтрокиТаблицы = Новый Структура(
			"НалоговаяБазаАкцизы,ЕдиницаИзмеренияАкциза,ТвердаяСтавкаАкциза,АдвалорнаяСтавкаАкциза,СуммаАкциза,АналитикаАкциза");
		ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущиеДанные);
		ЗаполнитьАналитикуАкцизов(ДанныеСтрокиТаблицы);
		ТекущиеДанные.АналитикаАкциза = ДанныеСтрокиТаблицы.АналитикаАкциза;
		ДанныеОбъекта = Новый Структура("ОсобыйПризнакЗаявителя", Объект.ОсобыйПризнакЗаявителя);
		РассчитатьНалогиПоСтроке(ДанныеОбъекта, ТекущиеДанные);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	// При изменении ставки НДС перерасчитываем сумму НДС
	
	ДанныеОбъекта = Новый Структура("ОсобыйПризнакЗаявителя", Объект.ОсобыйПризнакЗаявителя);
	РассчитатьНалогиПоСтроке(ДанныеОбъекта, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНалоговаяБазаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	// При изменении налоговой базы перерасчитываем сумму НДС
	
	ДанныеОбъекта = Новый Структура("ОсобыйПризнакЗаявителя", Объект.ОсобыйПризнакЗаявителя);
	РассчитатьНалогиПоСтроке(ДанныеОбъекта, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыФактурнаяСтоимостьПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ДанныеСтрокиТаблицы = Новый Структура(
		"ФактурнаяСтоимость,НалоговаяБазаНДС,СтавкаНДС,
		|СуммаНДС,СуммаАкциза,ОбеспечительныйПлатеж,МаркируемаяПродукция");
		
	ДанныеОбъекта = Новый Структура(
		"ВалютаРегламентированногоУчета,Дата,ВалютаДокумента,ОсобыйПризнакЗаявителя",
		ВалютаРегламентированногоУчета, Объект.Дата, Объект.ВалютаДокумента, Объект.ОсобыйПризнакЗаявителя);
		
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущиеДанные);
	
	РасчитатьСуммыВТабличнойЧастиНаСервере(ДанныеСтрокиТаблицы, ДанныеОбъекта);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСтрокиТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыАналитикаАкцизаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяСтрока = Элементы.Товары.ТекущаяСтрока;
	ОткрытьФормуРедактированияАкцизов(ВыбраннаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыОсобыйПризнакДОПППриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	АктуализироватьНалогиПоСтрокеТовары(СтрокаТаблицы);
	ОбновитьИтоги(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТоварыАналитикаАкциза" Тогда
		ОткрытьФормуРедактированияАкцизов(ВыбраннаяСтрока);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если Поле.Имя = "ТоварыПрослеживаемыйТовар" Тогда
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		Если ТекущиеДанные.ПрослеживаемыйТовар Тогда
			ПрослеживаемостьФормыКлиентУНФ.ПоказатьПредупреждениеПрослеживаемыйТовар();
		Конецесли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНоваяСтрока Тогда
		ТекущаяКолонкаТаблицы = Элементы.Товары.ТекущийЭлемент;
		Если ТекущаяКолонкаТаблицы.Имя = "ТоварыАналитикаАкциза" Тогда
			ВыбраннаяСтрока = Элементы.Товары.ТекущаяСтрока;
			ОткрытьФормуРедактированияАкцизов(ВыбраннаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ЭтоНоваяСтрока = НоваяСтрока;
	
	Если НЕ НоваяСтрока ИЛИ Копирование Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗаголовкиСтрок(Элементы.Товары.ТекущиеДанные);
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	СтрокаТаблицы.АналитикаАкциза = НСтр("ru='Без акциза'");
	СтрокаТаблицы.ОсобыйПризнакДОПП = Объект.ОсобыйПризнакДОПП;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования И НоваяСтрока Тогда
		// Закроем форму редактирования строки, т.к. пользователь отменяет ввод
		Оповестить("ФормаРедактированияАкцизов_Закрыть", Неопределено, ЭтотОбъект);
	КонецЕсли;
	
	ЭтоНоваяСтрока = Ложь;
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТоварыДобавитьИзПоступления(Команда)
	
	ОткрытьФормуВыбораПоступленияТоваровУслугДляЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДобавитьИзЗаказПоставщику(Команда)
	
	ОткрытьФормуВыбораЗаказПоставщикуДляЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзСчетаПоставщика(Команда)
	
	ОткрытьФормуВыбораСчетаПоставщика();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзДокументаОПредстоящейПоставке(Команда)
	
	ОткрытьФормуВыбораДОПП();
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьДОПП(Команда)
	
	СоздатьРеглОтчетДОПП(Истина); 
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = НСтр("ru = 'Не заполнен номер счет-фактуры.'");
	Сообщение.Поле = "ДекорацияСсылкаНаДОПП";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПараметрыВыгрузки(Команда)
	
	ОткрытьФормуВыгрузки2015();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеФормой

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	УстановитьФункциональныеОпцииФормы();
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	ЗаполнитьКоллекциюСписковВыбора();
	
	УстановитьОсобыйПризнакЗаявителя();
	УстановитьСостояниеДокумента();
	
	НаименованиеВалютыДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВалютаДокумента, "Наименование");
	ВалютаРегламентированногоУчета = УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();;
	
	ОбновитьИтоги(ЭтотОбъект);
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
	УправлениеФормой(ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	Элементы.ДоговорКонтрагента.Доступность = ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент);
	
	Элементы.ТоварыСтоимостьВал.Заголовок = СтрШаблон(
		НСтр("ru='Фактурная стоимость (%1)'"),
		Форма.НаименованиеВалютыДокумента); 
		
	Элементы.РегистрационныйЗнакПрицепаДополнительный.Доступность = ЗначениеЗаполнено(Объект.РегистрационныйЗнакПрицепа);
	Элементы.ИнойОсобыйПризнакЗаявителя.Видимость = Объект.ОсобыйПризнакЗаявителя = "2";
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗаголовокФормы(Форма)
	
	Объект = Форма.Объект;
	ТекстЗаголовка = НСтр("ru = 'Документ о предстоящей поставке товаров'");
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстЗаголовка = ТекстЗаголовка + СтрШаблон(НСтр("ru=' %1 от %2'"), Объект.Номер, Объект.Дата);
	Иначе
		ТекстЗаголовка = ТекстЗаголовка + НСтр("ru = ' (создание)'");
	КонецЕсли;
	
	Форма.Заголовок = ТекстЗаголовка;

КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы() Экспорт
	
	ПлательщикНДС = УчетнаяПолитика.ПлательщикНДС(Объект.Организация, Объект.Дата)
		ИЛИ УчетнаяПолитика.ПлательщикНДСНаУСНСВычетами(Объект.Организация, Объект.Дата);
	
	ОбщегоНазначенияУНФКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	ВедетсяУчетПрослеживаемыхТоваров =
		ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров")
		И ПрослеживаемостьБРУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
		
	ИмпортПодакцизныхТоваров = ПолучитьФункциональнуюОпцию("ИмпортПодакцизныхТоваров");
	Если ИмпортПодакцизныхТоваров Тогда
	    ВидыПроизведенныхПодакцизныхТоваров = УчетАкцизовУНФ.СписокИмпортируемыхПодакцизныхТоваров(Объект.Организация);
		ЕстьУчетПодакцизныхТоваров = ВидыПроизведенныхПодакцизныхТоваров.Количество() > 0;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Признак прослеживаемости
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыПрослеживаемыйТовар");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ВедетсяУчетПрослеживаемыхТоваров", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// ТоварыСклад
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыСклад");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, 
		"УказыватьСкладВТабличнойЧасти", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// ТоварыСтавкаНДС
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыСтавкаНДС");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Товары.ТоварыОсобыйПризнакДОПП", ВидСравненияКомпоновкиДанных.НеРавно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоги(Форма)
	
	Объект = Форма.Объект;
	Форма.ОбеспечительныйПлатеж = Окр(Объект.Товары.Итог("ОбеспечительныйПлатеж"));
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьНалогиПоСтрокеТовары(СтрокаТаблицы)
	
	Если СтрокаТаблицы.ОсобыйПризнакДОПП = "0" Тогда
		ПриИзмененииНоменклатуры(СтрокаТаблицы);
		ДанныеОбъекта = Новый Структура(
			"ВалютаРегламентированногоУчета,ВалютаДокумента,Дата,ОсобыйПризнакЗаявителя",
			ВалютаРегламентированногоУчета, Объект.ВалютаДокумента, Объект.Дата, Объект.ОсобыйПризнакЗаявителя); 
		ДанныеСтрокиТаблицы = Новый Структура(
			"ФактурнаяСтоимость,НалоговаяБазаНДС,СтавкаНДС,СуммаНДС,ОбеспечительныйПлатеж,КодВидаПодакцизногоТовара,КБК,МаркируемаяПродукция,
			|НалоговаяБазаАкцизы,ЕдиницаИзмеренияАкциза,ТвердаяСтавкаАкциза,АдвалорнаяСтавкаАкциза,СуммаАкциза,АналитикаАкциза");
		ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, СтрокаТаблицы);
		РасчитатьСуммыВТабличнойЧастиНаСервере(ДанныеСтрокиТаблицы, ДанныеОбъекта);
		ЗаполнитьАналитикуАкцизов(ДанныеСтрокиТаблицы);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеСтрокиТаблицы);

	Иначе
		СтрокаТаблицы.СтавкаНДС                 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");
		СтрокаТаблицы.СуммаНДС                  = 0;
		СтрокаТаблицы.НалоговаяБазаНДС          = 0;
		СтрокаТаблицы.НалоговаяБазаАкцизы       = 0;
		СтрокаТаблицы.ТвердаяСтавкаАкциза       = 0;
		СтрокаТаблицы.АдвалорнаяСтавкаАкциза    = 0;
		СтрокаТаблицы.СуммаАкциза               = 0;
		СтрокаТаблицы.ПодакцизныйТовар          = Ложь;
		СтрокаТаблицы.АналитикаАкциза           = НСтр("ru='Без акциза'");
		СтрокаТаблицы.ОбеспечительныйПлатеж     = 0;
		СтрокаТаблицы.КодВидаПодакцизногоТовара = ПредопределенноеЗначение("Справочник.КодыВидовПодакцизныхТоваров.ПустаяСсылка");
		СтрокаТаблицы.КБК                       = "";
		СтрокаТаблицы.МаркируемаяПродукция      = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьНалогиПоСтроке(ДанныеОбъекта, СтрокаТабличнойЧасти)
	
	Если СтрокаТабличнойЧасти.НалоговаяБазаНДС <> 0 Тогда
		СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
			СтрокаТабличнойЧасти.НалоговаяБазаНДС,
			Ложь,
			УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
	КонецЕсли;
	
	Если ДанныеОбъекта.ОсобыйПризнакЗаявителя = "0" Тогда
		Если СтрокаТабличнойЧасти.МаркируемаяПродукция Тогда
			СтрокаТабличнойЧасти.ОбеспечительныйПлатеж = СтрокаТабличнойЧасти.СуммаНДС;
		Иначе
			СтрокаТабличнойЧасти.ОбеспечительныйПлатеж = СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаАкциза;
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.ОбеспечительныйПлатеж = 0;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(СтрокаТабличнойЧасти)
	
	ДанныеСтрокиТаблицы = Новый Структура(
		"Номенклатура,ЕдиницаИзмерения,СтранаПроисхождения,КодТНВЭД,
		|СчетУчета,СуммаНДС,СтавкаНДС,
		|СтранаПроисхождения,НалоговаяБазаНДС,
		|Количество,ЕдиницыРазличаются,ПрослеживаемыйТовар,ФактурнаяСтоимость,
		|КоэффициентПересчета,ОкруглятьДоЦелого,ПодакцизныйТовар,КодВидаПодакцизногоТовара,КБК,МаркируемаяПродукция,
		|СуммаАкциза,НалоговаяБазаАкцизы,ТвердаяСтавкаАкциза,ЕдиницаИзмеренияАкциза,АналитикаАкциза,ДоговорКонтрагента,ОбеспечительныйПлатеж");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, СтрокаТабличнойЧасти);
	
	ДанныеОбъекта = Новый Структура("Дата,Организация,
		|ВалютаДокумента,ДоговорКонтрагента,Реализация,ЕстьУчетПодакцизныхТоваров,ВидыПроизведенныхПодакцизныхТоваров,ОсобыйПризнакЗаявителя");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	
	ДанныеОбъекта.Реализация = Ложь;
	ДанныеОбъекта.ЕстьУчетПодакцизныхТоваров = ЕстьУчетПодакцизныхТоваров;
	ДанныеОбъекта.ВидыПроизведенныхПодакцизныхТоваров = ВидыПроизведенныхПодакцизныхТоваров;
	
	ТоварыНоменклатураПриИзмененииНаСервере(ДанныеСтрокиТаблицы, ДанныеОбъекта);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ДанныеСтрокиТаблицы);
	Если ЕстьУчетПодакцизныхТоваров Тогда
		СтрокаТабличнойЧасти.НалоговаяБазаНДС = СтрокаТабличнойЧасти.НалоговаяБазаНДС + СтрокаТабличнойЧасти.СуммаАкциза;
		ДанныеСтрокиТаблицы = Новый Структура(
			"НалоговаяБазаАкцизы,ЕдиницаИзмеренияАкциза,ТвердаяСтавкаАкциза,АдвалорнаяСтавкаАкциза,СуммаАкциза,АналитикаАкциза");
		ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, СтрокаТабличнойЧасти);
		ЗаполнитьАналитикуАкцизов(ДанныеСтрокиТаблицы);
		СтрокаТабличнойЧасти.АналитикаАкциза = ДанныеСтрокиТаблицы.АналитикаАкциза;
	КонецЕсли;
	
	РассчитатьНалогиПоСтроке(ДанныеОбъекта, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
//	СостояниеДокумента = ПрослеживаемостьПереопределяемый.УстановитьСостояниеДокумента(Объект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныйПрограммныйИнтрефейс

&НаСервере
Процедура ЗаполнитьКоллекциюСписковВыбора()
	
	ЗаполнитьСписокВыбораОсобогоПризнакаЗаявителя(Элементы.ОсобыйПризнакЗаявителя.СписокВыбора);
	ЗаполнитьСписокВыбораОсобогоПризнакаДОПП(Элементы.ОсобыйПризнакДОПП.СписокВыбора);
	ЗаполнитьСписокВыбораОсобогоПризнакаДОПП(Элементы.ТоварыОсобыйПризнакДОПП.СписокВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОсобогоПризнакаДОПП(СписокВыбора)

	СписокВыбора.Очистить();
	СписокВыбора.Добавить("0",  "0 – Отсутствует");
	СписокВыбора.Добавить("1",  "1 – Товары, не подлежащие налогообложению");
	СписокВыбора.Добавить("4",  "4 – Передача в рамках одного юридического лица");
	СписокВыбора.Добавить("5",  "5 – Переработка давальческого сырья");
	СписокВыбора.Добавить("6",  "6 – Возврат товара");
	СписокВыбора.Добавить("7",  "7 – Аренда оборудования");
	СписокВыбора.Добавить("8",  "8 – Выставочный экземпляр");
	СписокВыбора.Добавить("9",  "9 – Лизинг");
	СписокВыбора.Добавить("10", "10 – Договор между двумя российскими организациями");
	СписокВыбора.Добавить("11", "11 – Договор с физическим лицом (не ИП)");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОсобогоПризнакаЗаявителя(СписокВыбора)

	СписокВыбора.Очистить();
	СписокВыбора.Добавить("0",  "0 – Отсутствует");
	СписокВыбора.Добавить("1",  "1 – Освобождение от внесения обеспечительного платежа");
	СписокВыбора.Добавить("2",  "2 – Иной признак");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
		ЗаполнитьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТаблицы);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТаблицы)
	
	ЗаполнитьЗаголовкиСтрок(СтрокаТаблицы);
	ЗаполнитьПризнакЕдиницыРазличаются(СтрокаТаблицы);
	ЗаполнитьАналитикуАкцизов(СтрокаТаблицы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗаголовкиСтрок(СтрокаТаблицы)
	
	СтрокаТаблицы.НадписьНомерДокумента = НСтр("ru='Номер:'");
	СтрокаТаблицы.НадписьДатаДокумента  = НСтр("ru='Дата:'");
	СтрокаТаблицы.НадписьПоДокументу    = НСтр("ru='По документу:'");
	СтрокаТаблицы.НадписьПоТНВЭД        = НСтр("ru='По ТН ВЭД:'");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьАналитикуАкцизов(СтрокаТабличнойЧасти)
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаАкциза) Тогда
		
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ТвердаяСтавкаАкциза) Тогда
			
			Если СтрокаТабличнойЧасти.ЕдиницаИзмеренияАкциза = "112" Тогда
				ЕдиницаНалоговойБазы = НСтр("ru='литров'");
				ЕдиницаСтавки = НСтр("ru='за литр'");
			ИначеЕсли СтрокаТабличнойЧасти.ЕдиницаИзмеренияАкциза = "168" Тогда
				ЕдиницаНалоговойБазы = НСтр("ru='тонн'");
				ЕдиницаСтавки = НСтр("ru='за тонну'");
			ИначеЕсли СтрокаТабличнойЧасти.ЕдиницаИзмеренияАкциза = "251" Тогда
				ЕдиницаНалоговойБазы = НСтр("ru='лошадиных сил'");
				ЕдиницаСтавки = НСтр("ru='за лошадиную силу'");
			ИначеЕсли СтрокаТабличнойЧасти.ЕдиницаИзмеренияАкциза = "831" Тогда
				ЕдиницаНалоговойБазы = НСтр("ru='литров 100% спирта'");
				ЕдиницаСтавки = НСтр("ru='за литр 100% спирта'");
			Иначе
				ЭлементЕдиницыИзмеренияАкциза = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(СтрокаТабличнойЧасти.ЕдиницаИзмеренияАкциза);
				Если ЭлементЕдиницыИзмеренияАкциза <> Неопределено Тогда
					ЕдиницаНалоговойБазы = ЭлементЕдиницыИзмеренияАкциза;
					ЕдиницаСтавки = НСтр("ru='за '" + ЭлементЕдиницыИзмеренияАкциза);
				КонецЕсли
			КонецЕсли;
			
			ТекстСообщения = НСтр("ru='%1 руб. (%2 %3 * %4 %5)'");
			
			СтрокаТабличнойЧасти.АналитикаАкциза = СтрШаблон(ТекстСообщения,
				СтрокаТабличнойЧасти.СуммаАкциза,
				СтрокаТабличнойЧасти.НалоговаяБазаАкцизы,
				ЕдиницаНалоговойБазы,
				СтрокаТабличнойЧасти.ТвердаяСтавкаАкциза,
				ЕдиницаСтавки);
			
		Иначе
			
			ТекстСообщения = НСтр("ru='%1 руб. (%2 руб. * %3%%)'");
			
			СтрокаТабличнойЧасти.АналитикаАкциза = СтрШаблон(ТекстСообщения,
				СтрокаТабличнойЧасти.СуммаАкциза,
				СтрокаТабличнойЧасти.НалоговаяБазаАкцизы,
				СтрокаТабличнойЧасти.АдвалорнаяСтавкаАкциза);
			
		КонецЕсли;
		
	Иначе
		СтрокаТабличнойЧасти.АналитикаАкциза = НСтр("ru='Без акциза'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПризнакЕдиницыРазличаются(СтрокаТаблицы)
	
	СтрокаТаблицы.ЕдиницыРазличаются = СтрокаТаблицы.ЕдиницаИзмерения <> СтрокаТаблицы.КодТНВЭД.ЕдиницаИзмерения;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьМассивВидовДоговоров()

	СписокВидовДоговоров = Новый Массив;
	СписокВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.СПоставщиком"));
//	СписокВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.СКомиссионеромНаЗакупку"));
	
	Возврат СписокВидовДоговоров;

КонецФункции

&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(СтрокаТабличнойЧасти, Знач ДанныеОбъекта)
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОНоменклатуре = ПолучитьСведенияОНоменклатуре(СтрокаТабличнойЧасти.Номенклатура);
		
	Если СведенияОНоменклатуре = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СведенияОНоменклатуре.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая
	 Или СведенияОНоменклатуре.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ОбщаяРасчетная Тогда
		СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая, ДанныеОбъекта.Дата);
	Иначе
		СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Пониженная, ДанныеОбъекта.Дата);
	КонецЕсли;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения    = СведенияОНоменклатуре.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.СтранаПроисхождения = СведенияОНоменклатуре.СтранаПроисхождения;
	СтрокаТабличнойЧасти.КодТНВЭД            = СведенияОНоменклатуре.ТоварнаяНоменклатураВЭД;
	
	Если ВедетсяУчетПрослеживаемыхТоваров Тогда
		СтрокаТабличнойЧасти.ПрослеживаемыйТовар = СведенияОНоменклатуре.ПрослеживаемыйТовар;
	Иначе
		СтрокаТабличнойЧасти.ПрослеживаемыйТовар = Ложь;
	КонецЕсли;
	
	Если ДанныеОбъекта.ЕстьУчетПодакцизныхТоваров Тогда
		
		СтрокаТабличнойЧасти.НалоговаяБазаНДС          = СтрокаТабличнойЧасти.НалоговаяБазаНДС - СтрокаТабличнойЧасти.СуммаАкциза;
		КодВидаПодакцизногоТовара                      = СведенияОНоменклатуре.КодВидаПодакцизногоТовара;
		СтрокаТабличнойЧасти.КоэффициентПересчета      = СведенияОНоменклатуре.КоэффициентПересчета;
		СтрокатабличнойЧасти.ЕдиницаИзмеренияАкциза    = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СведенияОНоменклатуре.ЕдиницаИзмеренияДляРасчетаАкциза, "Код");
		
		// СведенияОНоменклатуре.МаркируемаяПродукция
		
		Если ЗначениеЗаполнено(КодВидаПодакцизногоТовара) Тогда
			
			ВидТовара = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КодВидаПодакцизногоТовара, "ВидТовара");
			АкцизПоНоменклатуреНачисляется = ДанныеОбъекта.ВидыПроизведенныхПодакцизныхТоваров.НайтиПоЗначению(ВидТовара);
			
			Если АкцизПоНоменклатуреНачисляется = Неопределено Тогда
				ОбнулитьДанныеПоАкцизам(СтрокаТабличнойЧасти);
			Иначе
				СтрокаТабличнойЧасти.ПодакцизныйТовар          = Истина;
				СтрокаТабличнойЧасти.КодВидаПодакцизногоТовара = КодВидаПодакцизногоТовара;
				СтрокаТабличнойЧасти.КБК                       = Документы.ЗаявлениеОВвозеТоваров.КБКПоКодуВидаПодакцизногоТовара(КодВидаПодакцизногоТовара);
				СтрокаТабличнойЧасти.МаркируемаяПродукция      = СведенияОНоменклатуре.МаркируемаяПродукция;
				
				СтруктураРасчетаАкциза = Новый Структура("Ставка, ОкруглятьДоЦелого", 0, Ложь);
				УчетАкцизовУНФ.ПолучитьСтавкуАкциза(КодВидаПодакцизногоТовара, ДанныеОбъекта.Дата, СтруктураРасчетаАкциза);
				
				СтрокаТабличнойЧасти.ТвердаяСтавкаАкциза      = СтруктураРасчетаАкциза.Ставка;
				СтрокаТабличнойЧасти.ОкруглятьДоЦелого        = СтруктураРасчетаАкциза.ОкруглятьДоЦелого;
				
				РассчитатьСуммуАкцизаВТабЧастиПоЗаявлениюОВвозе(СтрокаТабличнойЧасти, Истина);
				
			КонецЕсли;
			
		Иначе
			
			ОбнулитьДанныеПоАкцизам(СтрокаТабличнойЧасти);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если СведенияОНоменклатуре.Свойство("СчетаУчета") Тогда
		// СведенияОНоменклатуре - структура сведений номенклатуры
		СчетаУчета = СведенияОНоменклатуре.СчетаУчета;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетаУчета.СчетУчета)
		И СчетаУчета.СчетУчетаЯвляетсяЗабалансовым =
		(СчетаУчета.СчетУчета = ПланыСчетов.Хозрасчетный.ТМЦпринятыеНаОтветственноеХранение) Тогда
		СтрокаТабличнойЧасти.СчетУчета = СчетаУчета.СчетУчета;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбнулитьДанныеПоАкцизам(СтрокаТабличнойЧасти)

	СтрокаТабличнойЧасти.ПодакцизныйТовар          = Ложь;
	СтрокаТабличнойЧасти.СуммаАкциза               = 0;
	СтрокаТабличнойЧасти.КоэффициентПересчета      = 0;
	СтрокаТабличнойЧасти.ТвердаяСтавкаАкциза       = 0;
	СтрокаТабличнойЧасти.НалоговаяБазаАкцизы       = 0;
	СтрокаТабличнойЧасти.ОкруглятьДоЦелого         = Ложь;
	СтрокаТабличнойЧасти.ЕдиницаИзмеренияАкциза    = "";
	СтрокаТабличнойЧасти.КодВидаПодакцизногоТовара = Справочники.КодыВидовПодакцизныхТоваров.ПустаяСсылка();
	СтрокаТабличнойЧасти.КБК                       = "";
	СтрокаТабличнойЧасти.МаркируемаяПродукция      = Ложь;

КонецПроцедуры

&НаСервере
Процедура РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТабличнойЧасти, ДанныеОбъекта)
	
	Документы.ЗаявлениеОВвозеТоваров.РасчитатьСуммыВТабличнойЧастиДОПП(СтрокаТабличнойЧасти, ДанныеОбъекта);
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораАкцизы(ВыбранноеЗначение)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	ДанныеСтрокиТаблицы = Новый Структура(
		"ФактурнаяСтоимость,НалоговаяБазаНДС,СтавкаНДС,СуммаНДС,ОбеспечительныйПлатеж,КодВидаПодакцизногоТовара,КБК,МаркируемаяПродукция,
		|НалоговаяБазаАкцизы,ЕдиницаИзмеренияАкциза,ТвердаяСтавкаАкциза,АдвалорнаяСтавкаАкциза,СуммаАкциза,АналитикаАкциза");
		
	ДанныеОбъекта = Новый Структура(
		"ВалютаРегламентированногоУчета,ВалютаДокумента,Дата,ОсобыйПризнакЗаявителя",
		ВалютаРегламентированногоУчета, Объект.ВалютаДокумента, Объект.Дата, Объект.ОсобыйПризнакЗаявителя);
		
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, СтрокаТабличнойЧасти);
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ВыбранноеЗначение);
	
	РасчитатьСуммыВТабличнойЧастиНаСервере(ДанныеСтрокиТаблицы, ДанныеОбъекта);
	ЗаполнитьАналитикуАкцизов(ДанныеСтрокиТаблицы);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ДанныеСтрокиТаблицы);
	ОбновитьИтоги(ЭтотОбъект);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере()

	ВалютаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДоговорКонтрагента, "ВалютаРасчетов");
	
	Если Объект.ВалютаДокумента <> ВалютаДоговора Тогда
		
		Объект.ВалютаДокумента = ВалютаДоговора;
		НаименованиеВалютыДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВалютаДокумента, "Наименование");
		
		ДанныеОбъекта = Новый Структура(
			"ВалютаРегламентированногоУчета,ВалютаДокумента,Дата,ОсобыйПризнакЗаявителя",
			ВалютаРегламентированногоУчета, Объект.ВалютаДокумента, Объект.Дата, Объект.ОсобыйПризнакЗаявителя);
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
			
			РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТабличнойЧасти, ДанныеОбъекта);
			
		КонецЦикла;
		
		УправлениеФормой(ЭтотОбъект);
		ОбновитьИтоги(ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОсобыйПризнакЗаявителяПриИзмененииНаСервере()
	
	ДанныеОбъекта = Новый Структура(
		"ВалютаРегламентированногоУчета,ВалютаДокумента,Дата,ОсобыйПризнакЗаявителя",
		ВалютаРегламентированногоУчета, Объект.ВалютаДокумента, Объект.Дата, Объект.ОсобыйПризнакЗаявителя);
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		
		РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТабличнойЧасти, ДанныеОбъекта);
		
	КонецЦикла;
	
	УправлениеФормой(ЭтотОбъект);
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УстановитьФункциональныеОпцииФормы();
	УстановитьОсобыйПризнакЗаявителя();
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		КонтрагентОбработатьИзменение();
	КонецЕсли;
	
	ПересчитатьСуммыАкциза();
	
	УправлениеФормой(ЭтотОбъект);
	
	СтруктураРеквизитовВыгрузки = ОбновитьДанныеРеквизитовВыгрузки();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыАкциза()
	
	Если ИмпортПодакцизныхТоваров Тогда
		Для Каждого Строка Из Объект.Товары Цикл 
			Строка.НалоговаяБазаНДС = Строка.НалоговаяБазаНДС - Строка.СуммаАкциза;
		КонецЦикла;
		ПараметрыЗаполнения = Новый Структура;
		УчетАкцизовУНФ.ПараметрыДляЗаполненияДанныхПоАкцизам(ПараметрыЗаполнения);
		ПараметрыЗаполнения.Импорт          = Истина;
		ПараметрыЗаполнения.ЗаявлениеОВвозе = Истина;
		ПараметрыЗаполнения.ДОПП            = Истина;
		УчетАкцизовУНФ.ЗаполнитьДанныеПоАкцизам(Объект.Товары, Объект.Организация, Объект.Дата, ПараметрыЗаполнения);
		ДанныеОбъекта = Новый Структура("ОсобыйПризнакЗаявителя", Объект.ОсобыйПризнакЗаявителя);
		Для Каждого Строка Из Объект.Товары Цикл
			ДанныеСтрокиТаблицы = Новый Структура(
				"НалоговаяБазаАкцизы,ЕдиницаИзмеренияАкциза,ТвердаяСтавкаАкциза,АдвалорнаяСтавкаАкциза,СуммаАкциза,АналитикаАкциза");
			ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, Строка);
			ЗаполнитьАналитикуАкцизов(ДанныеСтрокиТаблицы);
			Строка.АналитикаАкциза = ДанныеСтрокиТаблицы.АналитикаАкциза;
			РассчитатьНалогиПоСтроке(ДанныеОбъекта, Строка);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если Объект.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
		
		ДанныеОбъекта = Новый Структура(
			"ВалютаРегламентированногоУчета,ВалютаДокумента,Дата,ОсобыйПризнакЗаявителя",
			ВалютаРегламентированногоУчета, Объект.ВалютаДокумента, Объект.Дата, Объект.ОсобыйПризнакЗаявителя);
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
			РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТабличнойЧасти, ДанныеОбъекта);
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьФункциональныеОпцииФормы();
	ОбновитьПризнакПрослеживаемости(Объект.Товары, ВедетсяУчетПрослеживаемыхТоваров, Объект.Дата);
	
	ПересчитатьСуммыАкциза();
	
	УстановитьПараметрыВыбораСтавкиНДС();
	УправлениеФормой(ЭтотОбъект);
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПризнакПрослеживаемости(ТабличнаяЧасть, ДатаДокумента, ПрослеживаемаяОперация = Истина)
	
	Если НЕ ПрослеживаемостьУНФ.ВедетсяУчетПрослеживаемыхТоваров(ДатаДокумента) ИЛИ НЕ ПрослеживаемаяОперация Тогда
		Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
			СтрокаТаблицы.ПрослеживаемыйТовар = Ложь;
		КонецЦикла;
	Иначе
		
		// Получим реквизиты используемой номенклатуры в таблице.
		МассивНоменклатуры = ОбщегоНазначения.ВыгрузитьКолонку(ТабличнаяЧасть.Выгрузить(), "Номенклатура", Истина);
		
		ОбщегоНазначенияУНФКлиентСервер.УдалитьНеЗаполненныеЭлементыМассива(МассивНоменклатуры);
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		МассивНоменклатуры,
		"ПрослеживаемыйТовар");
		
		РеквизитыНоменклатурыПрослеживаемыйКомплект = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		МассивНоменклатуры,
		"ПрослеживаемыйКомплект");
		
		Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "ЕстьВДокументеРеализации") 
				И СтрокаТаблицы.ЕстьВДокументеРеализации
				ИЛИ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "ЕстьВДокументеПоступления") 
				И СтрокаТаблицы.ЕстьВДокументеПоступления Тогда
				// Не обновляем признак прослеживаемости для строк исходного документа. 
				Продолжить;
			КонецЕсли;
			
			РеквизитыТекущейНоменклатуры = РеквизитыНоменклатуры[СтрокаТаблицы.Номенклатура];
			РеквизитыТекущейНоменклатурыПрослеживаемыйКомплект = РеквизитыНоменклатурыПрослеживаемыйКомплект[СтрокаТаблицы.Номенклатура];
			Если РеквизитыТекущейНоменклатуры <> Неопределено Тогда
				СтрокаТаблицы.ПрослеживаемыйТовар = РеквизитыТекущейНоменклатуры;
				Если СтрокаТаблицы.ПрослеживаемыйТовар Тогда
					// Дополнительно очистим номер ГТД для прослеживаемого товара.
					СтрокаТаблицы.НомерТД = Неопределено;
				КонецЕсли;
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()

	КонтрагентОбработатьИзменение();
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура КонтрагентОбработатьИзменение()
		
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ДоговорКонтрагентаПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьОсобыйПризнакЗаявителя()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "КрупнейшийНалогоплательщик") = Истина Тогда
			Объект.ОсобыйПризнакЗаявителя = "1";
			ОсобыйПризнакЗаявителяПриИзмененииНаСервере();
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаявлениеОВвозеТоваров.ОсобыйПризнакЗаявителя КАК ОсобыйПризнакЗаявителя,
		|	ЗаявлениеОВвозеТоваров.ИнойОсобыйПризнакЗаявителя КАК ИнойОсобыйПризнакЗаявителя
		|ИЗ
		|	Документ.ЗаявлениеОВвозеТоваров КАК ЗаявлениеОВвозеТоваров
		|ГДЕ
		|	ЗаявлениеОВвозеТоваров.Организация = &Организация
		|	И ЗаявлениеОВвозеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВвозТоваровИзЕАЭС.ДОПП)
		|	И НЕ ЗаявлениеОВвозеТоваров.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаявлениеОВвозеТоваров.Дата УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Объект.ОсобыйПризнакЗаявителя     = Выборка.ОсобыйПризнакЗаявителя;
			Объект.ИнойОсобыйПризнакЗаявителя = Выборка.ИнойОсобыйПризнакЗаявителя;
		КонецЕсли;
		
		ОсобыйПризнакЗаявителяПриИзмененииНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСведенияОНоменклатуре(Номенклатура)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Неопределено
	КонецЕсли;
	
	СписокРеквизитов = "ЕдиницаИзмерения,ВидСтавкиНДС,СтранаПроисхождения,ТоварнаяНоменклатураВЭД,ПрослеживаемыйТовар,
	|КодВидаПодакцизногоТовара,КоэффициентПересчета,ЕдиницаИзмеренияДляРасчетаАкциза";
	
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, СписокРеквизитов);

КонецФункции

&НаКлиенте
Процедура ВопросПередЗаполнениемТабличнойЧастиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
		ОткрытьФормуВыбораПоступленияТоваровУслугДляЗаполнения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПоступленияТоваровУслугДляЗаполнения()

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобавитьИзПоступленияЗавершение", ЭтотОбъект, Новый Структура);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация", Объект.Организация);
	СтруктураОтбора.Вставить("Контрагент",  Объект.Контрагент);
	СтруктураОтбора.Вставить("Договор",     Объект.ДоговорКонтрагента);
	СтруктураОтбора.Вставить("Проведен",    Истина);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор",              СтруктураОтбора);
	СтруктураПараметров.Вставить("РежимВыбора",        Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
	СтруктураПараметров.Вставить("ИмяТаблицы",         "Товары");
	
	ОткрытьФорму(
		"Документ.ПриходнаяНакладная.Форма.ФормаВыбора",
		СтруктураПараметров,
		ЭтотОбъект, , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораЗаказПоставщикуДляЗаполнения()

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобавитьИзПоступленияЗавершение", ЭтотОбъект, Новый Структура);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация", Объект.Организация);
	СтруктураОтбора.Вставить("Контрагент",  Объект.Контрагент);
	СтруктураОтбора.Вставить("Договор",     Объект.ДоговорКонтрагента);
	СтруктураОтбора.Вставить("Проведен",    Истина);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор",              СтруктураОтбора);
	СтруктураПараметров.Вставить("РежимВыбора",        Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
	СтруктураПараметров.Вставить("ИмяТаблицы",         "Товары");
	
	ОткрытьФорму(
		"Документ.ЗаказПоставщику.ФормаВыбора",
		СтруктураПараметров,
		ЭтотОбъект, , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСчетаПоставщика()
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобавитьИзСчетаЗавершение", ЭтотОбъект, Новый Структура);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация", Объект.Организация);
	СтруктураОтбора.Вставить("Контрагент",  Объект.Контрагент);
	СтруктураОтбора.Вставить("Договор",     Объект.ДоговорКонтрагента);
	СтруктураОтбора.Вставить("Проведен",    Истина);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор",              СтруктураОтбора);
	СтруктураПараметров.Вставить("РежимВыбора",        Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
	СтруктураПараметров.Вставить("ИмяТаблицы",         "Товары");
	
	ОткрытьФорму("Документ.СчетНаОплатуПоставщика.ФормаВыбора",
		СтруктураПараметров,
		ЭтотОбъект, , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораДОПП()

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобавитьИзДОППЗавершение", ЭтотОбъект, Новый Структура);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация", Объект.Организация);
	СтруктураОтбора.Вставить("Контрагент",  Объект.Контрагент);
	СтруктураОтбора.Вставить("Договор",     Объект.ДоговорКонтрагента);
	СтруктураОтбора.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийВвозТоваровИзЕАЭС.ДОПП"));
	СтруктураОтбора.Вставить("Проведен",    Истина);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор",              СтруктураОтбора);
	СтруктураПараметров.Вставить("РежимВыбора",        Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
	СтруктураПараметров.Вставить("ИмяТаблицы",         "Товары");
	
	ОткрытьФорму("Документ.ЗаявлениеОВвозеТоваров.ФормаВыбора",
		СтруктураПараметров,
		ЭтотОбъект, , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзПоступленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ДокументОснование = РезультатЗакрытия;
	
	Если ДокументОснование <> Неопределено Тогда
		ЗаполнитьПоПоступлениямНаСервере(ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПоступлениямНаСервере(ДокументОснование) Экспорт
	
	ДанныеОбъекта = Новый Структура("Дата,Организация,ВалютаДокумента,Дата,ОсобыйПризнакЗаявителя");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	ДанныеОбъекта.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	ТоварыПоДаннымПоступления = ТоварыПоДаннымДокументаПоступления(ДанныеОбъекта, ДокументОснование);
	Для каждого ДанныеНовойСтроки Из ТоварыПоДаннымПоступления Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеНовойСтроки);
		НоваяСтрока.ОсобыйПризнакДОПП = Объект.ОсобыйПризнакДОПП;
	КонецЦикла;
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	ОбновитьИтоги(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ТоварыПоДаннымДокументаПоступления(ДанныеОбъекта, ДокументОснование)

	ЭтоПриходнаяНакладаная = Тип("ДокументСсылка.ПриходнаяНакладная") = ТипЗнч(ДокументОснование);
	ВидыОпераций = Новый Массив;
	Если ЭтоПриходнаяНакладаная Тогда
		ВидыОпераций.Добавить(Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика);
		ВидыОпераций.Добавить(Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию);

		ТекстЗапроса = "ВЫБРАТЬ
					   |	Товары.Номенклатура КАК Номенклатура,
					   |	Товары.Количество КАК Количество,
					   |	Товары.Сумма КАК ФактурнаяСтоимость,
					   |	0 КАК НалоговаяБазаНДС,
					   |	0 КАК СуммаНДС,
					   |	0 КАК СуммаАкциза,
					   |	0 КАК ОбеспечительныйПлатеж,
					   |	Товары.НомерГТД КАК НомерТД,
					   |	Товары.НомерСтроки КАК НомерСтроки,
					   |	1 КАК НомерТабличнойЧасти,
					   |	ЕСТЬNULL(СправочникНоменклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК
					   |		ЕдиницаИзмерения,
					   |	ЕСТЬNULL(СправочникНоменклатура.ТоварнаяНоменклатураВЭД, """") КАК КодТНВЭД,
					   |	ЕСТЬNULL(СправочникНоменклатура.ВидСтавкиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПустаяСсылка)) КАК ВидСтавкиНДС,
					   |	ВЫБОР
					   |		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
					   |			ТОГДА ЕСТЬNULL(СправочникНоменклатура.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
					   |		ИНАЧЕ Товары.СтранаПроисхождения
					   |	КОНЕЦ КАК СтранаПроисхождения,
					   |	Товары.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
					   |ИЗ
					   |	Документ.ПриходнаяНакладная.Запасы КАК Товары
					   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
					   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
					   |			ПО СправочникНоменклатура.ТоварнаяНоменклатураВЭД = КлассификаторТНВЭД.Ссылка
					   |		ПО Товары.Номенклатура = СправочникНоменклатура.Ссылка
					   |ГДЕ
					   |	Товары.Ссылка В (&ДокументОснование)
					   |	И Товары.Ссылка.ВидОперации В (&ВидыОпераций)
					   |
					   |УПОРЯДОЧИТЬ ПО
					   |	НомерТабличнойЧасти,
					   |	НомерСтроки";

	Иначе
		ВидыОпераций.Добавить(Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаЗакупку);

		ТекстЗапроса = "ВЫБРАТЬ
					   |	Товары.Номенклатура КАК Номенклатура,
					   |	Товары.Количество КАК Количество,
					   |	Товары.Сумма КАК ФактурнаяСтоимость,
					   |	0 КАК НалоговаяБазаНДС,
					   |	0 КАК СуммаНДС,
					   |	0 КАК СуммаАкциза,
					   |	0 КАК ОбеспечительныйПлатеж,
					   |	Товары.НомерСтроки КАК НомерСтроки,
					   |	1 КАК НомерТабличнойЧасти,
					   |	ЕСТЬNULL(СправочникНоменклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК
					   |		ЕдиницаИзмерения,
					   |	ЕСТЬNULL(СправочникНоменклатура.ТоварнаяНоменклатураВЭД, """") КАК КодТНВЭД,
					   |	ЕСТЬNULL(СправочникНоменклатура.ВидСтавкиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПустаяСсылка)) КАК ВидСтавкиНДС
					   |ИЗ
					   |	Документ.ЗаказПоставщику.Запасы КАК Товары
					   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
					   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
					   |			ПО СправочникНоменклатура.ТоварнаяНоменклатураВЭД = КлассификаторТНВЭД.Ссылка
					   |		ПО Товары.Номенклатура = СправочникНоменклатура.Ссылка
					   |ГДЕ
					   |	Товары.Ссылка В (&ДокументОснование)
					   |	И Товары.Ссылка.ВидОперации В (&ВидыОпераций)
					   |
					   |УПОРЯДОЧИТЬ ПО
					   |	НомерТабличнойЧасти,
					   |	НомерСтроки";

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций);

	Запрос.Текст = ТекстЗапроса;

	РезультатЗапрос = Запрос.Выполнить();
	Если РезультатЗапрос.Пустой() Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;

	ТаблицаЗначенийТовары = РезультатЗапрос.Выгрузить();
	ТаблицаЗначенийТовары.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТаблицаЗначенийТовары.Колонки.Добавить("КоэффициентПересчета");
	ТаблицаЗначенийТовары.Колонки.Добавить("ОкруглятьДоЦелого");
	ТаблицаЗначенийТовары.Колонки.Добавить("ТвердаяСтавкаАкциза");
	ТаблицаЗначенийТовары.Колонки.Добавить("ЕдиницаИзмеренияАкциза");
	ТаблицаЗначенийТовары.Колонки.Добавить("НалоговаяБазаАкцизы");
	ТаблицаЗначенийТовары.Колонки.Добавить("ПодакцизныйТовар");
	ТаблицаЗначенийТовары.Колонки.Добавить("КодВидаПодакцизногоТовара");
	ТаблицаЗначенийТовары.Колонки.Добавить("КБК");
	ТаблицаЗначенийТовары.Колонки.Добавить("МаркируемаяПродукция");

	Если ПолучитьФункциональнуюОпцию("ИмпортПодакцизныхТоваров") Тогда
		ПараметрыЗаполнения = Новый Структура;
		УчетАкцизовУНФ.ПараметрыДляЗаполненияДанныхПоАкцизам(ПараметрыЗаполнения);
		ПараметрыЗаполнения.Импорт          = Истина;
		ПараметрыЗаполнения.ЗаявлениеОВвозе = Истина;
		ПараметрыЗаполнения.ДОПП            = Истина;
		УчетАкцизовУНФ.ЗаполнитьДанныеПоАкцизам(ТаблицаЗначенийТовары, ДанныеОбъекта.Организация, ДанныеОбъекта.Дата,
			ПараметрыЗаполнения);
	КонецЕсли;
	Для Каждого СтрокаТоваров Из ТаблицаЗначенийТовары Цикл
		СтрокаТоваров.СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(СтрокаТоваров.ВидСтавкиНДС, ДанныеОбъекта.Дата);
		РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТоваров, ДанныеОбъекта);
	КонецЦикла;

	Возврат ТаблицаЗначенийТовары;

КонецФункции

&НаКлиенте
Процедура ДобавитьИзСчетаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ДокументОснование = РезультатЗакрытия;
	
	Если ДокументОснование <> Неопределено Тогда
		ЗаполнитьПоСчетуНаСервере(ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСчетуНаСервере(ДокументОснование) Экспорт
	
	ДанныеОбъекта = Новый Структура("Дата,Организация,ВалютаДокумента,Дата,ОсобыйПризнакЗаявителя");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	ДанныеОбъекта.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);

	ТоварыПоДаннымСчета = Документы.ЗаявлениеОВвозеТоваров.ТоварыПоСчетуПоставщика(ДанныеОбъекта, ДокументОснование);
	Для каждого ДанныеНовойСтроки Из ТоварыПоДаннымСчета Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеНовойСтроки);
		НоваяСтрока.ОсобыйПризнакДОПП = Объект.ОсобыйПризнакДОПП;
	КонецЦикла;
	
//	СчетаУчетаВДокументах.ЗаполнитьСтроки(Объект.Товары, "Товары", Объект, Документы.ЗаявлениеОВвозеТоваров, Истина);
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	ОбновитьИтоги(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзДОППЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ДокументОснование = РезультатЗакрытия;
	
	Если ДокументОснование <> Неопределено Тогда
		ЗаполнитьПоДОППНаСервере(ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДОППНаСервере(ДокументОснование) Экспорт
	
	ДанныеОбъекта = Новый Структура("Дата,Организация,ВалютаДокумента,Дата,ОсобыйПризнакЗаявителя");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	ДанныеОбъекта.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);

	ТоварыПоДаннымСчета = ТоварыПоДОПП(ДанныеОбъекта, ДокументОснование);
	Для каждого ДанныеНовойСтроки Из ТоварыПоДаннымСчета Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеНовойСтроки);
		НоваяСтрока.ОсобыйПризнакДОПП = Объект.ОсобыйПризнакДОПП;
	КонецЦикла;
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	ОбновитьИтоги(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ТоварыПоДОПП(ДанныеОбъекта, ДокументОснование)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество,
	|	Товары.ФактурнаяСтоимость КАК ФактурнаяСтоимость,
	|	Товары.СчетУчета КАК СчетУчета,
	|	0 КАК НалоговаяБазаНДС,
	|	0 КАК СуммаНДС,
	|	0 КАК СуммаАкциза,
	|	0 КАК ОбеспечительныйПлатеж,
	|	Товары.НомерТД КАК НомерТД,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	1 КАК НомерТабличнойЧасти,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.КодТНВЭД КАК КодТНВЭД,
	|	ЕСТЬNULL(СправочникНоменклатура.ВидСтавкиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПустаяСсылка)) КАК ВидСтавкиНДС,
	|	Товары.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Товары.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|			ПО СправочникНоменклатура.ТоварнаяНоменклатураВЭД = КлассификаторТНВЭД.Ссылка
	|		ПО Товары.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	Товары.Ссылка В (&ДокументОснование)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапрос = Запрос.Выполнить();
	Если РезультатЗапрос.Пустой() Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ТаблицаЗначенийТовары = РезультатЗапрос.Выгрузить();
	ТаблицаЗначенийТовары.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТаблицаЗначенийТовары.Колонки.Добавить("КоэффициентПересчета");
	ТаблицаЗначенийТовары.Колонки.Добавить("ОкруглятьДоЦелого");
	ТаблицаЗначенийТовары.Колонки.Добавить("ТвердаяСтавкаАкциза");
	ТаблицаЗначенийТовары.Колонки.Добавить("ЕдиницаИзмеренияАкциза");
	ТаблицаЗначенийТовары.Колонки.Добавить("НалоговаяБазаАкцизы");
	ТаблицаЗначенийТовары.Колонки.Добавить("ПодакцизныйТовар"); 
	ТаблицаЗначенийТовары.Колонки.Добавить("КодВидаПодакцизногоТовара");
	ТаблицаЗначенийТовары.Колонки.Добавить("КБК");
	ТаблицаЗначенийТовары.Колонки.Добавить("МаркируемаяПродукция");
	Если ПолучитьФункциональнуюОпцию("ИмпортПодакцизныхТоваров") Тогда
		ПараметрыЗаполнения = Новый Структура;
		УчетАкцизовУНФ.ПараметрыДляЗаполненияДанныхПоАкцизам(ПараметрыЗаполнения);
		ПараметрыЗаполнения.Импорт          = Истина;
		ПараметрыЗаполнения.ЗаявлениеОВвозе = Истина;
		ПараметрыЗаполнения.ДОПП            = Истина;
		УчетАкцизовУНФ.ЗаполнитьДанныеПоАкцизам(ТаблицаЗначенийТовары, ДанныеОбъекта.Организация, ДанныеОбъекта.Дата, ПараметрыЗаполнения);
	КонецЕсли;
	Для каждого СтрокаТоваров Из ТаблицаЗначенийТовары Цикл
		СтрокаТоваров.СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(СтрокаТоваров.ВидСтавкиНДС, ДанныеОбъекта.Дата);
		РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТоваров, ДанныеОбъекта);
	КонецЦикла;
	
	Возврат ТаблицаЗначенийТовары;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРедактированияАкцизов(ВыбранноеЗначение)

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ДанныеСтроки = Объект.Товары.НайтиПоИдентификатору(ВыбранноеЗначение);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТолькоПросмотр",             ТолькоПросмотр);
	ПараметрыФормы.Вставить("НалоговаяБазаАкцизы",        ДанныеСтроки.НалоговаяБазаАкцизы);
	ПараметрыФормы.Вставить("ТвердаяСтавкаАкциза",        ДанныеСтроки.ТвердаяСтавкаАкциза);
	ПараметрыФормы.Вставить("АдвалорнаяСтавкаАкциза",     ДанныеСтроки.АдвалорнаяСтавкаАкциза);
	ПараметрыФормы.Вставить("ЕдиницаИзмеренияАкциза",     ДанныеСтроки.ЕдиницаИзмеренияАкциза);
	ПараметрыФормы.Вставить("СуммаАкциза",                ДанныеСтроки.СуммаАкциза);
	ПараметрыФормы.Вставить("Номенклатура",               ДанныеСтроки.Номенклатура);
	ПараметрыФормы.Вставить("ФактурнаяСтоимость",         ДанныеСтроки.ФактурнаяСтоимость);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения",           ДанныеСтроки.ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("КодТНВЭД",                   ДанныеСтроки.КодТНВЭД);
	ПараметрыФормы.Вставить("Количество",                 ДанныеСтроки.Количество);
	ПараметрыФормы.Вставить("ДатаПринятияНаУчет",         ДанныеСтроки.ДатаПринятияНаУчет);
	ПараметрыФормы.Вставить("Организация",                Объект.Организация);
	ПараметрыФормы.Вставить("ВалютаДокумента",            Объект.ВалютаДокумента);
	ПараметрыФормы.Вставить("ВалютаРеглУчета",            ЭтотОбъект.ВалютаРегламентированногоУчета);
	ПараметрыФормы.Вставить("ЕстьУчетПодакцизныхТоваров", ДанныеСтроки.ПодакцизныйТовар);
	ПараметрыФормы.Вставить("ОкруглятьДоЦелого",          ДанныеСтроки.ОкруглятьДоЦелого);
	ПараметрыФормы.Вставить("КоэфициентПересчета",        ДанныеСтроки.КоэффициентПересчета);
	ПараметрыФормы.Вставить("КодВидаПодакцизногоТовара",  ДанныеСтроки.КодВидаПодакцизногоТовара);
	ПараметрыФормы.Вставить("КБК",                        ДанныеСтроки.КБК);
	ПараметрыФормы.Вставить("МаркируемаяПродукция",       ДанныеСтроки.МаркируемаяПродукция);
	ПараметрыФормы.Вставить("ВидОперации",                Объект.ВидОперации);
	
	ОткрытьФорму("Документ.ЗаявлениеОВвозеТоваров.Форма.ФормаРедактированияАкцизов", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаВЭлектронномВиде

&НаКлиенте
Процедура ОткрытьФормуВыгрузки2015()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураРеквизитов", СтруктураРеквизитовВыгрузки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПараметрыВыгрузкиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ЗаявлениеОВвозеТоваров.Форма.ФормаВыгрузки2015Кв1", ПараметрыФормы, ЭтотОбъект,,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВыгрузкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		СтруктураРеквизитовВыгрузки = Результат;
		
		Модифицированность = Истина;
				
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеРеквизитовВыгрузки()
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Объект.Ссылка);
				
	ЭтоПБОЮЛ = НЕ РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Объект.Организация);
	
	СтрокаСведений = "ИННЮЛ, ИННФЛ, КППЮЛ, НаимЮЛПол, ФИО, КодНО, ФИОРук, ФИОБух, ФИОУпПред, ИННРук, ИННБух, ИННУпПред";
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Объект.Организация, Объект.Дата, СтрокаСведений);
	
	ПараметрыВыгрузки = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(СведенияОбОрганизации) Тогда
		Возврат ПараметрыВыгрузки;
	КонецЕсли;
				
	ПараметрыВыгрузки.Вставить("ЭтоПБОЮЛ", ЭтоПБОЮЛ);
	ПараметрыВыгрузки.Вставить("НалогоплательщикИННЮЛ", СведенияОбОрганизации.ИННЮЛ);
	ПараметрыВыгрузки.Вставить("НалогоплательщикКПП", 	СведенияОбОрганизации.КППЮЛ);
	ПараметрыВыгрузки.Вставить("НалогоплательщикИННФЛ", СведенияОбОрганизации.ИННФЛ);
	ПараметрыВыгрузки.Вставить("НалогоплательщикНаимЮЛ",СведенияОбОрганизации.НаимЮЛПол);
	ПараметрыВыгрузки.Вставить("НалогоплательщикФИО", 	СведенияОбОрганизации.ФИО);
	
	ПараметрыВыгрузки.Вставить("КодИФНС", СведенияОбОрганизации.КодНО);
	
	ДанныеПредставителя = ПолучитьСведенияОПредставителе(СведенияОбОрганизации.КодНО);
	
	ПараметрыВыгрузки.Вставить("ПрОтпр", Число(ДанныеПредставителя.ТипПредставителя));
	
	ОтправительЯвляетсяЮЛ = Истина;
	
	Если ДанныеПредставителя.ТипПредставителя = "1" Тогда
		
		ФИОПодп1Титул = СведенияОбОрганизации.ФИОРук;
		ФИОПодп2Титул = СведенияОбОрганизации.ФИОБух;
		
	Иначе
		
		ФИОПодп1Титул = СведенияОбОрганизации.ФИОУпПред;
		
	КонецЕсли;
	
	НаимОтпр 		= "";
	ИННЮЛОтпр		= "";
	КППОтпр         = "";

	ИННФЛОтпр       = "";

	ФамилияФЛОтпр   = "";
	ИмяФЛОтпр       = "";
	ОтчествоФЛОтпр  = "";

	ПрПодп1         = 0;
	ИННФЛПодп1      = СведенияОбОрганизации.ИННРук;
	ДолжностьПодп1  = "";
	
	ФамилияПодп1    = "";
	ИмяПодп1        = "";
	ОтчествоПодп1   = "";

	НаимДовПодп1    = "";
	НомерДовПодп1   = "";
	ДатаДовПодп1    = "";
	
	ПрПодп2         = 0;
    ИННФЛПодп2      = СведенияОбОрганизации.ИННБух;;
	ДолжностьПодп2  = "";
	
	ФамилияПодп2    = "";
	ИмяПодп2        = "";
	ОтчествоПодп2   = "";
	
	НаимДовПодп2    = "";
	НомерДовПодп2   = "";
	ДатаДовПодп2    = "";

	ПрКурьер        = 0;
	ИННФЛКурьер		= ИННФЛПодп1;

	ФамилияКурьер   = "";
	ИмяКурьер       = "";
	ОтчествоКурьер  = "";
	
	НаимДовКурьер   = "";
	НомерДовКурьер  = "";
	ДатаДовКурьер   = "";

	Если ДанныеПредставителя.ТипПредставителя = "1" Тогда

		Если НЕ ЭтоПБОЮЛ Тогда
			
			ОтправительЯвляетсяЮЛ = Истина;
			
			НаимОтпр 		= СведенияОбОрганизации.НаимЮЛПол;
			ИННЮЛОтпр		= СведенияОбОрганизации.ИННЮЛ;
			КППОтпр         = СведенияОбОрганизации.КППЮЛ;
			
			ПрПодп1 = 2;
			
			ФИОПодп1        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп1Титул);
			ФамилияПодп1    = ФИОПодп1.Фамилия;
			ИмяПодп1        = ФИОПодп1.Имя;
			ОтчествоПодп1   = ФИОПодп1.Отчество;
			
			ПрПодп2 = 2;
			
			ФИОПодп2        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп2Титул);
			ФамилияПодп2    = ФИОПодп2.Фамилия;
			ИмяПодп2        = ФИОПодп2.Имя;
			ОтчествоПодп2   = ФИОПодп2.Отчество;
			
			ПрКурьер = 2;

			ФамилияКурьер   = ФИОПодп1.Фамилия;
			ИмяКурьер       = ФИОПодп1.Имя;
			ОтчествоКурьер  = ФИОПодп1.Отчество;
			
		Иначе
			
			ОтправительЯвляетсяЮЛ = Ложь;
			
			ИННФЛОтпр        = СведенияОбОрганизации.ИННФЛ;
			
			ФИОотправителя   = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп1Титул);
			ФамилияФЛОтпр    = ФИОотправителя.Фамилия;
			ИмяФЛОтпр        = ФИОотправителя.Имя;
			ОтчествоФЛОтпр   = ФИОотправителя.Отчество;

			ПрПодп1 = 1;
			ФИОПодп1        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп1Титул);
			ФамилияПодп1    = ФИОПодп1.Фамилия;
			ИмяПодп1        = ФИОПодп1.Имя;
			ОтчествоПодп1   = ФИОПодп1.Отчество;
			
			ПрКурьер = 1;
			
			ФамилияКурьер   = ФИОотправителя.Фамилия;
			ИмяКурьер       = ФИОотправителя.Имя;
			ОтчествоКурьер  = ФИОотправителя.Отчество;
			
		КонецЕсли;
		
	Иначе
		
		Если ДанныеПредставителя.флПредставительЮрЛицо Тогда

			ОтправительЯвляетсяЮЛ = Истина;
			
			ПредставительСсылка = ДанныеПредставителя.ПредставительСсылка;
			НаимОтпр 		    = СокрЛП(ПредставительСсылка);
			ИННЮЛОтпр		    = ПредставительСсылка.ИНН;
			КППОтпр             = ПредставительСсылка.КПП;	
			
			ПрПодп1 = 3;
			ФИОПодп1        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп1Титул);
			ФамилияПодп1    = ФИОПодп1.Фамилия;
			ИмяПодп1        = ФИОПодп1.Имя;
			ОтчествоПодп1   = ФИОПодп1.Отчество;

			ФИОПодп2        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп2Титул);
			ФамилияПодп2    = ФИОПодп2.Фамилия;
			ИмяПодп2        = ФИОПодп2.Имя;
			ОтчествоПодп2   = ФИОПодп2.Отчество;

			ПрКурьер 		= 3;

			ФамилияКурьер   = ФИОПодп1.Фамилия;
			ИмяКурьер       = ФИОПодп1.Имя;
			ОтчествоКурьер  = ФИОПодп1.Отчество;
			
		Иначе
			
			ОтправительЯвляетсяЮЛ = Ложь;
			
			ИННФЛОтпр        = СведенияОбОрганизации.ИННУпПред;
			
			ФИОотправителя   = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп1Титул);
			ФамилияФЛОтпр    = ФИОотправителя.Фамилия;
			ИмяФЛОтпр        = ФИОотправителя.Имя;
			ОтчествоФЛОтпр   = ФИОотправителя.Отчество;
			
			ПрПодп1 		= 3;
			ФамилияПодп1    = ФИОотправителя.Фамилия;
			ИмяПодп1        = ФИОотправителя.Имя;
			ОтчествоПодп1   = ФИОотправителя.Отчество;
			
			ФИОПодп2        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп2Титул);
			ФамилияПодп2    = ФИОПодп2.Фамилия;
			ИмяПодп2        = ФИОПодп2.Имя;
			ОтчествоПодп2   = ФИОПодп2.Отчество;
			
			ПрКурьер = 3;
			
			ФамилияКурьер   = ФИОотправителя.Фамилия;
			ИмяКурьер       = ФИОотправителя.Имя;
			ОтчествоКурьер  = ФИОотправителя.Отчество;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыВыгрузки.Вставить("ОтправительЯвляетсяЮЛ", ОтправительЯвляетсяЮЛ);
	
	ПараметрыВыгрузки.Вставить("НаимОтпр", 		НаимОтпр);
	ПараметрыВыгрузки.Вставить("ИННЮЛОтпр",		ИННЮЛОтпр);
	ПараметрыВыгрузки.Вставить("КППОтпр",       КППОтпр);

	ПараметрыВыгрузки.Вставить("ИННФЛОтпр",     ИННФЛОтпр);

	ПараметрыВыгрузки.Вставить("ФамилияФЛОтпр", ФамилияФЛОтпр);
	ПараметрыВыгрузки.Вставить("ИмяФЛОтпр",     ИмяФЛОтпр);
	ПараметрыВыгрузки.Вставить("ОтчествоФЛОтпр",ОтчествоФЛОтпр);
	
	Если ТипЗнч(СтруктураРеквизитовВыгрузки) = Тип("Структура") Тогда
		
		ПараметрыВыгрузки.Вставить("ИмпортерСовпадаетСОтправителем",
			СтруктураРеквизитовВыгрузки.ИмпортерСовпадаетСОтправителем);
		
		ПараметрыВыгрузки.Вставить("ИмпортерЯвляетсяЮЛ", СтруктураРеквизитовВыгрузки.ИмпортерЯвляетсяЮЛ);
		
		ПараметрыВыгрузки.Вставить("НаимИмпорт",  СтруктураРеквизитовВыгрузки.НаимИмпорт);
		ПараметрыВыгрузки.Вставить("ИННЮЛИмпорт", СтруктураРеквизитовВыгрузки.ИННЮЛИмпорт);
		ПараметрыВыгрузки.Вставить("КППИмпорт",   СтруктураРеквизитовВыгрузки.КППИмпорт);
		
		ПараметрыВыгрузки.Вставить("ИННФЛИмпорт",      СтруктураРеквизитовВыгрузки.ИННФЛИмпорт);
		ПараметрыВыгрузки.Вставить("ФамилияФЛИмпорт",  СтруктураРеквизитовВыгрузки.ФамилияФЛИмпорт);
		ПараметрыВыгрузки.Вставить("ИмяФЛИмпорт",      СтруктураРеквизитовВыгрузки.ИмяФЛИмпорт);
		ПараметрыВыгрузки.Вставить("ОтчествоФЛИмпорт", СтруктураРеквизитовВыгрузки.ОтчествоФЛИмпорт);
		
	Иначе
		
		ПараметрыВыгрузки.Вставить("ИмпортерСовпадаетСОтправителем", Истина);
		
		ПараметрыВыгрузки.Вставить("ИмпортерЯвляетсяЮЛ", Истина);
		
		ПараметрыВыгрузки.Вставить("НаимИмпорт",  "");
		ПараметрыВыгрузки.Вставить("ИННЮЛИмпорт", "");
		ПараметрыВыгрузки.Вставить("КППИмпорт",   "");
		
		ПараметрыВыгрузки.Вставить("ИННФЛИмпорт",      "");
		ПараметрыВыгрузки.Вставить("ФамилияФЛИмпорт",  "");
		ПараметрыВыгрузки.Вставить("ИмяФЛИмпорт",      "");
		ПараметрыВыгрузки.Вставить("ОтчествоФЛИмпорт", "");
		
	КонецЕсли;
	
	ПараметрыВыгрузки.Вставить("ПрПодп1",       ПрПодп1);
	ПараметрыВыгрузки.Вставить("ИННФЛПодп1",    ИННФЛПодп1);
	ПараметрыВыгрузки.Вставить("ДолжностьПодп1",ДолжностьПодп1);
	
	ПараметрыВыгрузки.Вставить("ФамилияПодп1",  ФамилияПодп1);
	ПараметрыВыгрузки.Вставить("ИмяПодп1",      ИмяПодп1);
	ПараметрыВыгрузки.Вставить("ОтчествоПодп1", ОтчествоПодп1);

	ПараметрыВыгрузки.Вставить("НаимДовПодп1",  НаимДовПодп1);
	ПараметрыВыгрузки.Вставить("НомерДовПодп1", НомерДовПодп1);
	ПараметрыВыгрузки.Вставить("ДатаДовПодп1",  ДатаДовПодп1);
	
	ПараметрыВыгрузки.Вставить("ПрПодп2",       ПрПодп2);
	ПараметрыВыгрузки.Вставить("ИННФЛПодп2",    ИННФЛПодп2);
	ПараметрыВыгрузки.Вставить("ДолжностьПодп2",ДолжностьПодп2);
	
	ПараметрыВыгрузки.Вставить("ФамилияПодп2",  ФамилияПодп2);
	ПараметрыВыгрузки.Вставить("ИмяПодп2",      ИмяПодп2);
	ПараметрыВыгрузки.Вставить("ОтчествоПодп2", ОтчествоПодп2);

	ПараметрыВыгрузки.Вставить("НаимДовПодп2",  НаимДовПодп2);
	ПараметрыВыгрузки.Вставить("НомерДовПодп2", НомерДовПодп2);
	ПараметрыВыгрузки.Вставить("ДатаДовПодп2",  ДатаДовПодп2);
	
	ПараметрыВыгрузки.Вставить("ОтправленПочтой", Ложь);
	ПараметрыВыгрузки.Вставить("ПрКурьер",      ПрКурьер);
	ПараметрыВыгрузки.Вставить("ИННФЛКурьер",   ИННФЛКурьер);
	                 
	ПараметрыВыгрузки.Вставить("ФамилияКурьер", ФамилияКурьер);
	ПараметрыВыгрузки.Вставить("ИмяКурьер",     ИмяКурьер);
	ПараметрыВыгрузки.Вставить("ОтчествоКурьер",ОтчествоКурьер);
	
	ПараметрыВыгрузки.Вставить("НаимДовКурьер",  НаимДовКурьер);
	ПараметрыВыгрузки.Вставить("НомерДовКурьер", НомерДовКурьер);
	ПараметрыВыгрузки.Вставить("ДатаДовКурьер",  ДатаДовКурьер);
		
	ПараметрыВыгрузки.Вставить("ФИОУпПред", СведенияОбОрганизации.ФИОУпПред);
	ПараметрыВыгрузки.Вставить("ИННУпПред", СведенияОбОрганизации.ИННУпПред);
	
	ПараметрыВыгрузки.Вставить("ФИОРук",    СведенияОбОрганизации.ФИОРук);
	    	
	Возврат ПараметрыВыгрузки;	
	
КонецФункции

&НаСервере
Функция ПолучитьСведенияОПредставителе(КодИФНС) Экспорт
	
	флПредставительЮрЛицо = Истина;
	НаименованиеОрганизацииПредставителя = "";
	ФИОПредставителя = "";
	ТипПредставителя = "1";
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РегистрацииВНалоговомОргане.Код,
	|	РегистрацииВНалоговомОргане.КПП,
	|	РегистрацииВНалоговомОргане.Представитель,
	|	РегистрацииВНалоговомОргане.УполномоченноеЛицоПредставителя
	|ИЗ
	|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|ГДЕ
	|	РегистрацииВНалоговомОргане.Код = &Код
	|	И РегистрацииВНалоговомОргане.Владелец = &Владелец");
	
	Запрос.УстановитьПараметр("Код", КодИФНС);
	Запрос.УстановитьПараметр("Владелец", Объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Представитель) Тогда
		
		ТипПредставителя = "2";
		
		Если НЕ РегламентированнаяОтчетность.ПредставительЯвляетсяФизЛицом(Выборка.Представитель) Тогда
			
			флПредставительЮрЛицо = Истина;
			ФИОПредставителя = СокрЛП(Выборка.УполномоченноеЛицоПредставителя);
			ПредставительСсылка = Выборка.Представитель;
			
		Иначе
			
			флПредставительЮрЛицо = Ложь;
			ПредставительСсылка = Выборка.Представитель;
			ФИОПредставителя = СокрЛП(ПредставительСсылка);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Структура("ТипПредставителя, флПредставительЮрЛицо, ФИОПредставителя, ПредставительСсылка", 
							 ТипПредставителя, флПредставительЮрЛицо, ФИОПредставителя, ПредставительСсылка);
	
КонецФункции

Процедура РассчитатьСуммуАкцизаВТабЧастиПоЗаявлениюОВвозе(СтрокаТаблицы, ЭтоДОПП = Ложь)
	
	Если Не ЭтоДОПП И ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда 
		СтрокаТаблицы.СуммаАкциза = 0;
	Иначе
		СтрокаТаблицы.СуммаАкциза = СтрокаТаблицы.Количество * СтрокаТаблицы.КоэффициентПересчета * СтрокаТаблицы.ТвердаяСтавкаАкциза;
		Если СтрокаТаблицы.ЕдиницаИзмеренияАкциза = "214" Тогда
			СтрокаТаблицы.СуммаАкциза = СтрокаТаблицы.СуммаАкциза / 0.75;
		КонецЕсли;
		Если СтрокаТаблицы.ОкруглятьДоЦелого Тогда
			СтрокаТаблицы.СуммаАкциза = Окр(СтрокаТаблицы.СуммаАкциза);
		КонецЕсли;
		СтрокаТаблицы.НалоговаяБазаАкцизы = СтрокаТаблицы.Количество * СтрокаТаблицы.КоэффициентПересчета;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ДОПП

&НаСервере
Процедура ЗаполнитьДокументПоСчетуНаОплату(СчетНаОплату)
	
	Объект.ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ДОПП;
	РеквизитыСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетНаОплату,
		"Организация,Контрагент,Договор,ВалютаДокумента,Дата"); 
	Объект.ДоговорКонтрагента = РеквизитыСчета.Договор;
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыСчета);
	Объект.ДатаВвоза = РеквизитыСчета.Дата;
	
	ДанныеОбъекта = Новый Структура("Дата,Организация,ВалютаДокумента,ДатаВвоза,ОсобыйПризнакЗаявителя");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	ДанныеОбъекта.Вставить("ВалютаРегламентированногоУчета", УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту());
		
	ТоварыПоСчетуПоставщика = Документы.ЗаявлениеОВвозеТоваров.ТоварыПоСчетуПоставщика(ДанныеОбъекта, СчетНаОплату);
		
	Если ТоварыПоСчетуПоставщика.Количество() > 0 Тогда
		Объект.Товары.Загрузить(ТоварыПоСчетуПоставщика);
	КонецЕсли;
	
//	СчетаУчетаВДокументах.ЗаполнитьСтроки(Объект.Товары, "Товары", Объект, Документы.ЗаявлениеОВвозеТоваров, Истина);

КонецПроцедуры

&НаСервере
Функция ПроверкиФорматаДОППВыполнены()
	
	ПроверкиВыполнены = Истина;
	
	// Проверка уникальности регистрационных номеров
	Если СокрЛП(Объект.РегистрационныйЗнак) = СокрЛП(Объект.РегистрационныйЗнакПрицепа)
	 Или СокрЛП(Объект.РегистрационныйЗнак) = СокрЛП(Объект.РегистрационныйЗнакПрицепаДополнительный) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Регистрационный номер не уникален.'"), ,
			"РегистрационныйЗнак",
			"Объект");
		ПроверкиВыполнены = Ложь;
	КонецЕсли;
	
	Если СокрЛП(Объект.РегистрационныйЗнакПрицепа) = СокрЛП(Объект.РегистрационныйЗнакПрицепаДополнительный)
	   И ЗначениеЗаполнено(Объект.РегистрационныйЗнакПрицепа) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Регистрационный номер прицепа не уникален.'"), ,
			"РегистрационныйЗнакПрицепа",
			"Объект");
		ПроверкиВыполнены = Ложь;
		
	КонецЕсли;
	
	Если КонецДня(Объект.ДатаВвоза) < Объект.Дата Тогда
	
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата ввоза не может быть ранее даты регистрации ДОПП.'"), ,
			"ДатаВвоза",
			"Объект");
		ПроверкиВыполнены = Ложь;
	
	КонецЕсли;
	
	Возврат ПроверкиВыполнены;

КонецФункции

&НаСервере
Процедура ЗарегистрироватьАктуализироватьДОПП()
	
	Если Не ПроверкиФорматаДОППВыполнены() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатусДОППТекст) Тогда
		// ДОПП был зарегистрирован в СПОТ, актуализация не выполняется.
		// При необходимости исправления ранее зарегистрированного ДОПП необходимо формировать корректировочный ДОПП.
		Возврат;
	КонецЕсли;
	
	СоздатьРеглОтчетДОПП();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеглОтчетДОПП(Корректировочный = Ложь)
	
	КонтейнерДОПП = Отчеты.РегламентированноеУведомлениеДокументОПредстоящейПоставке.КонтейнерДляЗаполнения(
		ИмяФормыДОПП(Объект.Дата));
	ПараметрыСоздания = ДанныеДляЗаполненияРеглОтчетаДОПП(КонтейнерДОПП, Объект.Ссылка, СсылкаНаДОПП, НомерРеглДОПП, Корректировочный);
	СсылкаНаДОПП = Отчеты.РегламентированноеУведомлениеДокументОПредстоящейПоставке.НовыйДОПП(ПараметрыСоздания);
	ДатаРеглДОПП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДОПП, "Дата");
	
	Если Корректировочный Тогда
		ЗаполнитьТекстПроДОПП();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяФормыДОПП(Дата)
	
	Если Дата >= '20260101' Тогда
		Возврат "Форма2026_1";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеДляЗаполненияРеглОтчетаДОПП(КонтейнерДОПП, УчетныйДокументДОПП, СсылкаНаДОПП, НомерРеглДОПП, Корректировочный)
	
	ЗаполнитьКонтейнерДОПП(КонтейнерДОПП, УчетныйДокументДОПП, СсылкаНаДОПП, НомерРеглДОПП, Корректировочный);
	
	Если Корректировочный Тогда
		// Необходимо создать новый регл. отчета с номером корректировки + 1, а не актуализировать предыдущий.
		СсылкаНаДОПП = Документы.УведомлениеОСпецрежимахНалогообложения.ПустаяСсылка();
	КонецЕсли;
	
	РеквизитыУчетногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетныйДокументДОПП, "Организация, Дата");
	
	ПараметрыСоздания = Новый Структура();
	ПараметрыСоздания.Вставить("Организация",       РеквизитыУчетногоДокумента.Организация);
	ПараметрыСоздания.Вставить("РегистрацияВИФНС",  Справочники.Организации.РегистрацияВНалоговомОрганеНаДату(РеквизитыУчетногоДокумента.Организация, РеквизитыУчетногоДокумента.Дата));
	ПараметрыСоздания.Вставить("Контейнер",         КонтейнерДОПП);
	ПараметрыСоздания.Вставить("ДокументОснование", УчетныйДокументДОПП);
	ПараметрыСоздания.Вставить("ИмяФормы",          "Форма2026_1");
	ПараметрыСоздания.Вставить("Ссылка",            СсылкаНаДОПП);
	
	Возврат ПараметрыСоздания;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьКонтейнерДОПП(КонтейнерДОПП, УчетныйДокументДОПП, СсылкаНаДОПП, НомерРеглДОПП, Корректировочный)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", УчетныйДокументДОПП);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЗаявлениеОВвозеТоваровТовары.ОбеспечительныйПлатеж) КАК ОбеспечительныйПлатеж
	|ПОМЕСТИТЬ СуммаОбеспечительногоПлатежа
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров.Товары КАК ЗаявлениеОВвозеТоваровТовары
	|ГДЕ
	|	ЗаявлениеОВвозеТоваровТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявлениеОВвозеТоваров.Дата КАК Дата,
	|	ЗаявлениеОВвозеТоваров.Организация КАК Организация,
	|	ЗаявлениеОВвозеТоваров.Контрагент КАК Контрагент,
	|	ЗаявлениеОВвозеТоваров.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗаявлениеОВвозеТоваров.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗаявлениеОВвозеТоваров.ДатаВвоза КАК ДатаВвоза,
	|	ЗаявлениеОВвозеТоваров.Перевозчик КАК Перевозчик,
	|	ЗаявлениеОВвозеТоваров.РегистрационныйЗнак КАК РегистрационныйЗнак,
	|	ЗаявлениеОВвозеТоваров.РегистрационныйЗнакПрицепа КАК РегистрационныйЗнакПрицепа,
	|	ЗаявлениеОВвозеТоваров.РегистрационныйЗнакПрицепаДополнительный КАК РегистрационныйЗнакПрицепаДополнительный,
	|	ЗаявлениеОВвозеТоваров.ОсобыйПризнакДОПП КАК ОсобыйПризнакДОПП,
	|	ЗаявлениеОВвозеТоваров.ОсобыйПризнакЗаявителя КАК ОсобыйПризнакЗаявителя,
	|	ЗаявлениеОВвозеТоваров.ИнойОсобыйПризнакЗаявителя КАК ИнойОсобыйПризнакЗаявителя,
	|	Валюты.Код КАК КодаВалюты,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДатаДоговора,
	|	ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	Организации.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	Организации.ИНН КАК ОрганизацияИНН,
	|	Организации.КПП КАК ОрганизацияКПП,
	|	КонтрагентПродавец.НаименованиеПолное КАК ПродавецНаименованиеПолное,
	|	КонтрагентПродавец.ИНН КАК ПродавецИНН,
	|	КонтрагентПродавец.КПП КАК ПродавецКПП,
	|	КонтрагентПродавец.РегистрационныйНомер КАК ПродавецРегистрационныйНомер,
	|	КонтрагентПродавец.СтранаРегистрации КАК ПродавецСтранаРегистрации,
	|	КонтрагентПеревозчик.НаименованиеПолное КАК ПеревозчикНаименованиеПолное,
	|	КонтрагентПеревозчик.ИНН КАК ПеревозчикИНН,
	|	КонтрагентПеревозчик.КПП КАК ПеревозчикКПП,
	|	КонтрагентПеревозчик.РегистрационныйНомер КАК ПеревозчикРегистрационныйНомер,
	|	КонтрагентПеревозчик.СтранаРегистрации КАК ПеревозчикСтранаРегистрации,
	|	СтранаРегистрацииПеревозчика.Код КАК КодСтраныРегистрацииПеревозчика,
	|	СтранаРегистрацииПродавца.Код КАК КодСтраныРегистрацииПродавца,
	|	СуммаОбеспечительногоПлатежа.ОбеспечительныйПлатеж КАК ОбеспечительныйПлатеж
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров КАК ЗаявлениеОВвозеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ЗаявлениеОВвозеТоваров.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ЗаявлениеОВвозеТоваров.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЗаявлениеОВвозеТоваров.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентПродавец
	|		ПО ЗаявлениеОВвозеТоваров.Контрагент = КонтрагентПродавец.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентПеревозчик
	|		ПО ЗаявлениеОВвозеТоваров.Перевозчик = КонтрагентПеревозчик.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтранаРегистрацииПеревозчика
	|		ПО КонтрагентПеревозчик.СтранаРегистрации = СтранаРегистрацииПеревозчика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтранаРегистрацииПродавца
	|		ПО КонтрагентПродавец.СтранаРегистрации = СтранаРегистрацииПродавца.Ссылка,
	|	СуммаОбеспечительногоПлатежа КАК СуммаОбеспечительногоПлатежа
	|ГДЕ
	|	ЗаявлениеОВвозеТоваров.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявлениеОВвозеТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаявлениеОВвозеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ЗаявлениеОВвозеТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаявлениеОВвозеТоваровТовары.Количество КАК Количество,
	|	ЗаявлениеОВвозеТоваровТовары.ФактурнаяСтоимость КАК ФактурнаяСтоимость,
	|	ЗаявлениеОВвозеТоваровТовары.НалоговаяБазаНДС КАК НалоговаяБазаНДС,
	|	ЗаявлениеОВвозеТоваровТовары.СуммаНДС КАК СуммаНДС,
	|	ЗаявлениеОВвозеТоваровТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЗаявлениеОВвозеТоваровТовары.НалоговаяБазаАкцизы КАК НалоговаяБазаАкцизы,
	|	ЗаявлениеОВвозеТоваровТовары.ТвердаяСтавкаАкциза КАК ТвердаяСтавкаАкциза,
	|	ЗаявлениеОВвозеТоваровТовары.АдвалорнаяСтавкаАкциза КАК АдвалорнаяСтавкаАкциза,
	|	ЗаявлениеОВвозеТоваровТовары.СуммаАкциза КАК СуммаАкциза,
	|	ЗаявлениеОВвозеТоваровТовары.ПодакцизныйТовар КАК ПодакцизныйТовар,
	|	ЗаявлениеОВвозеТоваровТовары.ОсобыйПризнакДОПП КАК ОсобыйПризнакДОПП,
	|	КлассификаторТНВЭД.Код КАК КодТНВЭД,
	|	СтраныМира.Код КАК КодСтраныПроисхождения,
	|	СтраныМира.НаименованиеПолное КАК НаименованиеПолноеСтраныПроисхождения,
	|	КлассификаторЕдиницИзмерения.Код КАК КодЕдиницыИзмерения,
	|	НомераГТД.Код КАК НомерДекларацииНаТовары,
	|	ВЫБОР
	|		КОГДА ЗаявлениеОВвозеТоваровТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|			ТОГДА ""22""
	|		КОГДА ЗаявлениеОВвозеТоваровТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА ""10""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтавкаНДС,
	|	ТоварНоменклатура.НаименованиеПолное КАК ТоварНаименованиеПолное,
	|	КодыВидовПодакцизныхТоваров.Код КАК КодВидаПодакцизногоТовара,
	|	ЗаявлениеОВвозеТоваровТовары.МаркируемаяПродукция КАК МаркируемаяПродукция
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров.Товары КАК ЗаявлениеОВвозеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|		ПО ЗаявлениеОВвозеТоваровТовары.КодТНВЭД = КлассификаторТНВЭД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО ЗаявлениеОВвозеТоваровТовары.СтранаПроисхождения = СтраныМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ЗаявлениеОВвозеТоваровТовары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|		ПО ЗаявлениеОВвозеТоваровТовары.НомерТД = НомераГТД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТоварНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыВидовПодакцизныхТоваров КАК КодыВидовПодакцизныхТоваров
	|			ПО ТоварНоменклатура.КодВидаПодакцизногоТовара = КодыВидовПодакцизныхТоваров.Ссылка
	|		ПО ЗаявлениеОВвозеТоваровТовары.Номенклатура = ТоварНоменклатура.Ссылка
	|ГДЕ
	|	ЗаявлениеОВвозеТоваровТовары.Ссылка = &Ссылка";
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаШапка = Результат[1].Выгрузить();
	ТаблицаТовары = Результат[2].Выгрузить();
	
	Если ТаблицаШапка.Количество() = 0 Или ТаблицаТовары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Шапка = ТаблицаШапка[0];
	
	// Титул - Структура
	Титул = КонтейнерДОПП.Титульная;
	
	ГоловнаяОрганизация         = РегламентированнаяОтчетность.ГоловнаяОрганизация(Шапка.Организация);
	РегистрацияВНалоговомОргане = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГоловнаяОрганизация, "РегистрацияВНалоговомОргане");
	ЭтоЮЛ                       = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ЭтоЮрЛицо(ГоловнаяОрганизация);
	Реквизиты                   = РегистрацияВНОСервер.ДанныеРегистрации(РегистрацияВНалоговомОргане);
	КодНалоговогоОргана         = Реквизиты.Код;
	
	Если ЭтоЮЛ Тогда 
		СтрокаСведений = "ФамилияРук,ИмяРук,ОтчествоРук";
		СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
			ГоловнаяОрганизация,
			Шапка.Дата,
			СтрокаСведений);
	Иначе
		СтрокаСведений = "ФамилияИП,ИмяИП,ОтчествоИП";
		СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
			ГоловнаяОрганизация,
			Шапка.Дата,
			СтрокаСведений);
	КонецЕсли;
	
	СведенияОПродавце   = ПечатьДокументовУНФ.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
	Титул.ДатаВвоз      = Шапка.ДатаВвоза;
	Титул.НаимОрг       = Шапка.ОрганизацияНаименованиеПолное;
	Титул.ИНН           = Шапка.ОрганизацияИНН;
	Титул.КПП           = Шапка.ОрганизацияКПП;
	
	Титул.ОсПрЗаяв      = Шапка.ОсобыйПризнакЗаявителя;
	Титул.ИнОсПрЗаяв    = ?(Шапка.ОсобыйПризнакЗаявителя = 2, Шапка.ИнойОсобыйПризнакЗаявителя, "");
	Титул.КодНО         = КодНалоговогоОргана;
	
	Титул.НаимПерев     = Шапка.ПеревозчикНаименованиеПолное;
	Титул.ОКСМПерев     = Шапка.КодСтраныРегистрацииПеревозчика;
	Титул.РегНомПерев = ?(Шапка.ПеревозчикСтранаРегистрации = Справочники.СтраныМира.Россия, Шапка.ПеревозчикИНН, Шапка.ПеревозчикРегистрационныйНомер);
	
	Титул.НаимПрод      = Шапка.ПродавецНаименованиеПолное;
	Титул.АдресПрод     = СведенияОПродавце.ЮридическийАдрес;
	Титул.ОКСМПрод      = Шапка.КодСтраныРегистрацииПродавца;
	Титул.РегНомПрод  = ?(Шапка.ПродавецСтранаРегистрации = Справочники.СтраныМира.Россия, Шапка.ПродавецИНН, Шапка.ПродавецРегистрационныйНомер);
	
	Титул.СумОбПлат     = Окр(Шапка.ОбеспечительныйПлатеж);
	
	Титул.ВидТС         = "1";
	Титул.РегЗнакТС     = Шапка.РегистрационныйЗнак;
	Титул.НомерПрицеп1  = Шапка.РегистрационныйЗнакПрицепа;
	Титул.НомерПрицеп2  = Шапка.РегистрационныйЗнакПрицепаДополнительный;
	
	Титул.ДАТА_ПОДПИСИ  = Шапка.Дата;
	
	ПодписантФамилия  = "";
	ПодписантИмя      = "";
	ПодписантОтчество = "";
	Если ЗначениеЗаполнено(Реквизиты.Представитель) Тогда
		СведенияОПредставителе = РегламентированнаяОтчетностьВызовСервера.ПолучитьПоКодамСведенияОПредставителе(
			Шапка.Организация,
			КодНалоговогоОргана,
			Реквизиты.КПП);
		Если ЗначениеЗаполнено(СведенияОПредставителе.НаименованиеОрганизацииПредставителя) Тогда
			ПодписантСтр = СведенияОПредставителе.ФИОПредставителя;
			ФИО = РегламентированнаяОтчетность.РазложитьФИО(ПодписантСтр);
			ПодписантФамилия = СокрЛП(ФИО.Фамилия);
			ПодписантИмя = СокрЛП(ФИО.Имя);
			ПодписантОтчество = СокрЛП(ФИО.Отчество);
		Иначе
			ДанныеПредставителя = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОФизЛице(
				Реквизиты.Представитель,
				,
				Шапка.Дата);
			ПодписантФамилия  = СокрЛП(ДанныеПредставителя.Фамилия);
			ПодписантИмя      = СокрЛП(ДанныеПредставителя.Имя);
			ПодписантОтчество = СокрЛП(ДанныеПредставителя.Отчество);
			ПодписантСтр = СокрЛП(ПодписантФамилия + " " + ПодписантИмя + " " + ПодписантОтчество);
		КонецЕсли;
		Титул.Вставить("ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ", ПодписантСтр);
		Титул.Вставить("ПРИЗНАК_НП_ПОДВАЛ",              "2");
		Титул.Вставить("НаимДок",                        Реквизиты.ДокументПредставителя);
	Иначе
		Если ЭтоЮЛ Тогда
			ПодписантФамилия  = СведенияОбОрганизации.ФамилияРук;
			ПодписантИмя      = СведенияОбОрганизации.ИмяРук;
			ПодписантОтчество = СведенияОбОрганизации.ОтчествоРук;
		Иначе
			ПодписантФамилия  = СведенияОбОрганизации.ФамилияИП;
			ПодписантИмя      = СведенияОбОрганизации.ИмяИП;
			ПодписантОтчество = СведенияОбОрганизации.ОтчествоИП;
		КонецЕсли;
		ПодписантСтр = СокрЛП(ПодписантФамилия + " " + ПодписантИмя + " " + ПодписантОтчество);
		Титул.Вставить("ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ", ПодписантСтр);
		Титул.Вставить("ПРИЗНАК_НП_ПОДВАЛ",              "1");
		Титул.Вставить("НаимДок",                        "");
	КонецЕсли;
	
	//Титул.Фамилия
	//Титул.Имя
	//Титул.Отчество
	
	Если Корректировочный Тогда
		ТекущийНомКорр  = Отчеты.РегламентированноеУведомлениеДокументОПредстоящейПоставке.НомерКорректировкиДОПП(СсылкаНаДОПП);
		Титул.НомКорр   = ?(ЗначениеЗаполнено(ТекущийНомКорр), ТекущийНомКорр + 1, 1);
		Титул.НомерДОПП = НомерРеглДОПП;
	ИначеЕсли ЗначениеЗаполнено(СсылкаНаДОПП) Тогда
		// Необходимо передать текущий номер ДОПП и корректировки при актуализации корректировочного ДОПП.
		ТекущийНомКорр  = Отчеты.РегламентированноеУведомлениеДокументОПредстоящейПоставке.НомерКорректировкиДОПП(СсылкаНаДОПП);
		Титул.НомКорр   = ТекущийНомКорр;
		Титул.НомерДОПП = НомерРеглДОПП;
	КонецЕсли;
	
	// Договор - ТаблицаЗначений
	Договоры = КонтейнерДОПП.Договор;
	Договор = Договоры.Добавить();
	
	ДатаКурсаВалют = Шапка.Дата - 86400;
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДокумента, ДатаКурсаВалют);
	УИДДоговора    = Новый УникальныйИдентификатор();
	
	Договор.БазаВалют     = СтруктураКурса.Кратность;
	Договор.КурсВалют     = СтруктураКурса.Курс;
	Договор.ДатаКурсВалют = ДатаКурсаВалют;
	Договор.КодВалют      = Шапка.КодаВалюты;
	Договор.ДатаДог       = Шапка.ДатаДоговора;
	Договор.НомерДог      = Шапка.НомерДоговора;
	Договор.УИД           = УИДДоговора;
	Договор.ПрСпецТов     = "2";
	
	// ТоварыДоговор - ТаблицаЗначений
	ТоварДоговор = КонтейнерДОПП.ТоварДоговор;
	
	Для каждого СтрокаТовара Из ТаблицаТовары Цикл
		
		ЭлементКонтейнера = ТоварДоговор.Добавить();
		
		ЭлементКонтейнера.АкцАдвСт         = СтрокаТовара.АдвалорнаяСтавкаАкциза;
		ЭлементКонтейнера.АкцизАдвБаза     = ?(СтрокаТовара.АдвалорнаяСтавкаАкциза > 0, СтрокаТовара.НалоговаяБазаАкцизы, 0);
		ЭлементКонтейнера.СумАкцизАдв      = ?(СтрокаТовара.АдвалорнаяСтавкаАкциза > 0, СтрокаТовара.СуммаАкциза, 0);
		
		ЭлементКонтейнера.АкцТвСт          = СтрокаТовара.ТвердаяСтавкаАкциза;
		ЭлементКонтейнера.АкцизТвБаза      = ?(СтрокаТовара.ТвердаяСтавкаАкциза > 0, СтрокаТовара.НалоговаяБазаАкцизы, 0);
		ЭлементКонтейнера.СумАкцизТв       = ?(СтрокаТовара.ТвердаяСтавкаАкциза > 0, СтрокаТовара.СуммаАкциза, 0);
		
		ЭлементКонтейнера.КодПТ            = СтрокаТовара.КодВидаПодакцизногоТовара;
		ЭлементКонтейнера.НаимТов          = СтрокаТовара.ТоварНаименованиеПолное;
		
		ЭлементКонтейнера.КолТов           = СтрокаТовара.Количество;
		ЭлементКонтейнера.НДСБаза          = СтрокаТовара.НалоговаяБазаНДС;
		ЭлементКонтейнера.НДССт            = СтрокаТовара.СтавкаНДС;
		ЭлементКонтейнера.НомерДекл        = СтрокаТовара.НомерДекларацииНаТовары;
		ЭлементКонтейнера.ОКЕИ             = СтрокаТовара.КодЕдиницыИзмерения;
		ЭлементКонтейнера.ОсобПризн        = СтрокаТовара.ОсобыйПризнакДОПП;
		ЭлементКонтейнера.ПрПТ             = ?(СтрокаТовара.ПодакцизныйТовар, "1", "0");
		ЭлементКонтейнера.СтоимТов         = СтрокаТовара.ФактурнаяСтоимость;
		ЭлементКонтейнера.ОКСМПроисх       = СтрокаТовара.КодСтраныПроисхождения;
		ЭлементКонтейнера.СтрПроисх        = СтрокаТовара.НаименованиеПолноеСтраныПроисхождения;
		ЭлементКонтейнера.СумНДС           = СтрокаТовара.СуммаНДС;
		ЭлементКонтейнера.ТНВЭД            = СтрокаТовара.КодТНВЭД;
		ЭлементКонтейнера.МаркируемыйТовар = СтрокаТовара.МаркируемаяПродукция;
		ЭлементКонтейнера.УИД              = Новый УникальныйИдентификатор();
		ЭлементКонтейнера.УИДРодителя      = УИДДоговора;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НайтиРеглУведомлениеДОПП()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УведомлениеОСпецрежимахНалогообложения.Ссылка КАК Ссылка,
	|	УведомлениеОСпецрежимахНалогообложения.Дата КАК Дата
	|ИЗ
	|	Документ.УведомлениеОСпецрежимахНалогообложения КАК УведомлениеОСпецрежимахНалогообложения
	|ГДЕ
	|	УведомлениеОСпецрежимахНалогообложения.Основание = &ТекущийДокумент
	|	И НЕ УведомлениеОСпецрежимахНалогообложения.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СсылкаНаДОПП  = Выборка.Ссылка;
		ДатаРеглДОПП  = Выборка.Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстПроДОПП()
	
	Если ЗначениеЗаполнено(СсылкаНаДОПП) Тогда
		
		Элементы.ДекорацияСсылкаНаДОПП.Видимость = Истина; 
		Элементы.ОткрытьКомандыОснование.Видимость = Истина;
		
		СтатусИСведенияКвитанций = Отчеты.РегламентированноеУведомлениеДокументОПредстоящейПоставке.СтатусИСведенияКвитанций(СсылкаНаДОПП);
		СтатусДОППТекст          = СтатусИСведенияКвитанций.СтатусДОППТекстом;
		НомерРеглДОПП            = СтатусИСведенияКвитанций.НомерДОПП;
		НомерКорректировкиДОПП   = Отчеты.РегламентированноеУведомлениеДокументОПредстоящейПоставке.НомерКорректировкиДОПП(СсылкаНаДОПП);
		
		Если НомерКорректировкиДОПП = 0 Тогда
			НомерКорректировкиТекст = "";
		Иначе
			НомерКорректировкиТекст = СтрШаблон(" (корр. %1)", НомерКорректировкиДОПП);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатусДОППТекст) Тогда
			Элементы.ГруппаРегистрационныеДанныеДОПП.Видимость = Ложь;
			Элементы.ДекорацияСсылкаНаДОПП.Заголовок = СтрШаблон("Документ о предстоящей поставке%1 %2 от %3 (%4)", 
				НомерКорректировкиТекст, ?(НомерРеглДОПП = "", "ДДММГГННННННН", НомерРеглДОПП), ДатаРеглДОПП, СтатусДОППТекст);
		Иначе
			Элементы.ГруппаРегистрационныеДанныеДОПП.Видимость = Истина;
			Элементы.ДекорацияСсылкаНаДОПП.Заголовок = СтрШаблон("Документ о предстоящей поставке%1 от %2", НомерКорректировкиТекст, ДатаРеглДОПП);
		КонецЕсли;
		
	Иначе
		Элементы.ДекорацияСсылкаНаДОПП.Видимость           = Ложь; 
		Элементы.ОткрытьКомандыОснование.Видимость = Ложь;
		Элементы.ГруппаРегистрационныеДанныеДОПП.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстНомерДОПП()
	                                     
	Если ЗначениеЗаполнено(НомерДОПП) Тогда 
		НомерДОПП = СокрЛП(НомерДОПП);

	    Элементы.ГруппаРегистрационныеДанныеДОПП.Заголовок = 
		СтрШаблон("ДОПП %1 от %2", СокрЛП(НомерДОПП), Формат(ДатаДОПП,"ДФ=dd.MM.yyyy"));
		ЗаполнитьЗначенияСвойств(Объект, ЭтотОбъект, "НомерДОПП,ДатаДОПП");
		
	Иначе
		Элементы.ГруппаРегистрационныеДанныеДОПП.Заголовок = НСтр("ru='Номер ДОПП не заполнен'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередИзменениемПризнакаДОППЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьОсобыйПризнакДОППВТаблице();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсобыйПризнакДОППВТаблице()
	
	Для каждого СтрокаТаблицы Из Объект.Товары Цикл
		СтрокаТаблицы.ОсобыйПризнакДОПП = Объект.ОсобыйПризнакДОПП;
		АктуализироватьНалогиПоСтрокеТовары(СтрокаТаблицы);
	КонецЦикла;
	
	УправлениеФормой(ЭтотОбъект);
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораСтавкиНДС()
	
	УчетНДС.УстановитьПараметрыВыбораСтавкиНДС(ЭтотОбъект, "ТоварыСтавкаНДС", "ДОПП");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДоговора()
	
	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.СПоставщиком);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.СПокупателем);
	МассивВидовДоговоров = Новый ФиксированныйМассив(ВидыДоговоров);
	
	НовыйМассивПараметров = Новый Массив();
	НовыйМассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", МассивВидовДоговоров));
	
	НовыеПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассивПараметров);
	Элементы.ДоговорКонтрагента.ПараметрыВыбора = НовыеПараметрыВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДОПППриИзменении(Элемент)
	
	ЗаполнитьТекстНомерДОПП();  
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДОПППриИзменении(Элемент)
	
	ЗаполнитьТекстНомерДОПП();  
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКомандыОснование(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКомандыОснования", ЭтотОбъект);
	
	КомандыОснования = Новый СписокЗначений;
	КомандыОснования.Добавить("СкорректироватьДОПП", НСтр("ru = 'Скорректировать ДОПП'"));
	ПоказатьВыборИзМеню(ОписаниеОповещения, КомандыОснования, Элементы.ОткрытьКомандыОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКомандыОснования(ВыбранноеДействие, Параметры) Экспорт
	
	Если ВыбранноеДействие = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеДействие.Значение = "СкорректироватьДОПП" Тогда
		СоздатьРеглОтчетДОПП(Истина); 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'В регламентированный документ о предстоящей поставке внесены изменения. Актуализирован порядковый номер корректировки.'");
		Сообщение.Поле = "ДекорацияСсылкаНаДОПП";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ЭтоНоваяСтрока = Ложь;

#КонецОбласти


