#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УпрощеннаяИнтеграцияБЭД = ИнтеграцияИС.УпрощеннаяИнтеграцияБЭД();
	НастроитьЭлементыФормыНаСервере();
	
	ИнтеграцияИС.УстановитьВидимостьКомандыВыполнитьОбмен(ЭтотОбъект, Метаданные.ОпределяемыеТипы.ДокументыИСМП, "ВыполнитьОбмен");
	ЕстьПравоОткрытьПомощникНастройки = ПравоДоступа("Просмотр", Метаданные.Обработки.ПомощникНастройкиИСМП);
	
	УстановитьВидимостьЭлементовДляИнтерфейса85();
	
	ВосстановитьНастройкиФормы();
	ОбновитьСпискиДокументов();
	
	ПараметрыЛогирования = ПолучитьПараметрыЛогирования();
	ПараметрыАварийногоРежима = ПолучитьПараметрыАварийногоРежима();
	
	ВерсияАПИ = ЭлектронноеВзаимодействиеИСМП.ВерсияАПИ();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПредставлениеЛогирования();
	ОбновитьПредставлениеАварийногоРежима();
	ЗапуститьРасчетПроблем();
	
	Если ТребуетсяНастройкаТоварныхГрупп
		И ЕстьПравоОткрытьПомощникНастройки Тогда
		ПодключитьОбработчикОжидания("ОткрытьФормуПомощникНастройкиИСМП", 0.5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ВыполнитьОбмен" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОбменДаннымиИСМПКлиент.ВыполнитьОбмен(
			ЭтотОбъект,
			ОбменДаннымиИСМПКлиент.ОрганизацииДляОбмена(ЭтотОбъект));
		
	Иначе
		
		СобытияФормИСМПКлиентПереопределяемый.ОбработкаНавигационнойСсылки(
			ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеАктивностиАварийногоРежимаИСМП" Тогда
		Подключаемый_ОбработкаОжиданияЗавершенияАварийногоРежима();
	ИначеЕсли ИмяСобытия = "ИСМП_СинхронизированыТоварныеГруппы" Тогда
		ОбновитьСпискиДокументов();
	ИначеЕсли ИмяСобытия = "НастройкаНоменклатурыПоТНВЭДиОКПД2" Тогда
		ОтобразитьСостояниеОбмена();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ОтборПоОрганизации

&НаКлиенте
Процедура ОтборОрганизацииПриИзменении(Элемент)
	
	ОбщегоНазначенияИСМПКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, Организации, Ложь, "Отбор");
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияИСМПКлиент.ОткрытьФормуВыбораОрганизаций(ЭтотОбъект, "Отбор", , ОповещениеВыбораОрганизаций());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияИСМПКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, Неопределено, Ложь, "Отбор");
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияИСМПКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, ВыбранноеЗначение, Ложь, "Отбор");
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОбщегоНазначенияИСМПКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, Организация, Ложь, "Отбор");
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияИСМПКлиент.ОткрытьФормуВыбораОрганизаций(ЭтотОбъект, "Отбор", , ОповещениеВыбораОрганизаций());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияИСМПКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, Неопределено, Ложь, "Отбор");
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияИСМПКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, ВыбранноеЗначение, Ложь, "Отбор");
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура НадписьАварийныйРежимОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПослеЗакрытияФормы   = Новый ОписаниеОповещения("ПослеОбработкиФормыУточненияАварийногоРежима", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.АварийныйРежимИСМП", 
		Новый Структура("АварийныйРежимВключен, АварийныйРежимДо", ПараметрыАварийногоРежима.Включено, МестноеВремя(ПараметрыАварийногоРежима.ДатаОкончания)),
		,,,,
		ПослеЗакрытияФормы,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСостояниеОбменаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьПанельСостоянияОбмена" Тогда
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Организации", Организации);
		ПараметрыОткрытияФормы.Вставить("ОрганизацииПредставление", ОрганизацииПредставление);
		ПараметрыОткрытияФормы.Вставить("Организация", Организация);
		ПараметрыОткрытияФормы.Вставить("Ответственный", Ответственный);
		
		ОткрытьФорму(
			"Обработка.ПанельОбменИСМП.Форма.СостоянияОбмена",
			ПараметрыОткрытияФормы, ЭтотОбъект,,,,,
			РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "НастройкаТоварныхГрупп" Тогда 
		
		Если ЕстьПравоОткрытьПомощникНастройки Тогда
			ОткрытьФормуПомощникНастройкиИСМП();
		Иначе
			ПоказатьПредупреждение(,
			НСтр("ru = 'Для настройки товарных групп обратитесь к администратору.'"));
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ХранитьФайлыВТомахНаДиске" Тогда
		
		Если ПравоДоступаНастройкиРаботыСФайлами() Тогда
			ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.НастройкиРаботыСФайлами");
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Вам запрещено выполнение данной операции, обратитесь к администратору'"));
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЕстьСообщенияОжидающиеОтправки" Тогда
		
		ПараметрыОткрытияФормы = Неопределено;
		Если Организации.Количество() > 0 Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("Организация", Организации.ВыгрузитьЗначения());
			
			ПараметрыОткрытияФормы = Новый Структура;
			ПараметрыОткрытияФормы.Вставить("Отбор", Отбор);
			
		КонецЕсли;
		
		ОткрытьФорму("РегистрСведений.ОчередьСообщенийИСМП.ФормаСписка", ПараметрыОткрытияФормы, ВладелецФормы);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "НастроитьАвтоматическийОбмен"
		Или НавигационнаяСсылкаФорматированнойСтроки = "НастроитьАвтоматическуюПроверкуСтатусовДокументовВГИСМТ"
		Или НавигационнаяСсылкаФорматированнойСтроки = "НастроитьУдалениеНеиспользованныхКодовМаркировки"
		Или НавигационнаяСсылкаФорматированнойСтроки = "НастроитьЗагрузкуСведенийОбОтклонениях"
		Или НавигационнаяСсылкаФорматированнойСтроки = "НастроитьУдалениеНеиспользованныхКодовМаркировки" Тогда
		
		ОткрытьФорму("Обработка.ПанельАдминистрированияИСМП.Форма.НастройкиИСМП");
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "НастройкаСертификатаНаСервере" Тогда
		
		ОткрытьФорму("ОбщаяФорма.НастройкаСертификатовДляАвтоматическогоОбменаИС");
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "НастройкаОтветственныхЗаПодписаниеСообщений" Тогда
		
		ОткрытьФорму("Справочник.ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП.ФормаСписка");
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "НастройкаНоменклатурыПоТНВЭДиОКПД2" Тогда
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("ОтборПоТНВЭДиОКПД2", Истина);
		ОткрытьФорму("ОбщаяФорма.НастройкаИнтеграцииНоменклатурыИС", ПараметрыОткрытияФормы,, "ОтборПоТНВЭДиОКПД2");
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтправленныеДокументыСОшибками"
		Или НавигационнаяСсылкаФорматированнойСтроки = "ПробитыеЧекиККТСОшибками"
		Или НавигационнаяСсылкаФорматированнойСтроки = "ОтправленныеДокументыОтсутствующиеВЛКГИСМТ"
		Или НавигационнаяСсылкаФорматированнойСтроки = "ПробитыеЧекиККТОтсутствующиеВЛКГИСМТ"
		Или НавигационнаяСсылкаФорматированнойСтроки = "НеОтправленныеДокументыСОшибкми" Тогда
		
		Если НавигационнаяСсылкаФорматированнойСтроки = "ОтправленныеДокументыСОшибками" Тогда
			
			ТипДокумента      = СоответствиеТребованиямГИСМТКлиентСервер.ТипыЭлектронныхДокументовГИСМТ();
			СтатусОтправки = ПредопределенноеЗначение("Перечисление.СтатусОтправкиГИСМТ.ДоставленВГИСМТ");
			
		ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПробитыеЧекиККТСОшибками" Тогда
			
			ТипДокумента      = ПредопределенноеЗначение("Перечисление.ТипыДокументовГИСМТ.ЧекККТ");
			СтатусОтправки = ПредопределенноеЗначение("Перечисление.СтатусОтправкиГИСМТ.ДоставленВГИСМТ");
			
		ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтправленныеДокументыОтсутствующиеВЛКГИСМТ" Тогда
			
			ТипДокумента      = СоответствиеТребованиямГИСМТКлиентСервер.ТипыЭлектронныхДокументовГИСМТ();
			СтатусОтправки = ПредопределенноеЗначение("Перечисление.СтатусОтправкиГИСМТ.ОжидаетсяПроверкаУПДвГИСМТ");
			
		ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПробитыеЧекиККТОтсутствующиеВЛКГИСМТ" Тогда
			
			ТипДокумента      = ПредопределенноеЗначение("Перечисление.ТипыДокументовГИСМТ.ЧекККТ");
			СтатусОтправки = ПредопределенноеЗначение("Перечисление.СтатусОтправкиГИСМТ.ОтправленВОФД");
			
		ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "НеОтправленныеДокументыСОшибкми" Тогда
			
			ТипДокумента      = СоответствиеТребованиямГИСМТКлиентСервер.ТипыЭлектронныхДокументовГИСМТ();
			СтатусОтправки = ПредопределенноеЗначение("Перечисление.СтатусОтправкиГИСМТ.НеОтправлен");
		
		КонецЕсли;
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Организации",    Организации.ВыгрузитьЗначения());
		ПараметрыОткрытияФормы.Вставить("ТипДокумента",   ТипДокумента);
		ПараметрыОткрытияФормы.Вставить("СтатусОтправки", СтатусОтправки);
		ПараметрыОткрытияФормы.Вставить("ФлагОшибки",     Истина);
		
		ОткрытьФорму("РегистрСведений.РезультатыОбработкиДокументовИСМП.Форма.ФормаРезультатыПроверки",
			ПараметрыОткрытияФормы, ВладелецФормы, НавигационнаяСсылкаФорматированнойСтроки);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "СведенияОбОтклоненияхОжидающиеДействия" Тогда
		
		ОткрытьФормуСпискаДокументов(
			"Документ.ОтчетИСМП.Форма.ФормаСпискаДокументов",
			"ВсеТребующиеДействия",,
			Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияСведенияОбОтклонениях()));
		
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестная ссылка: %1'"),
			НавигационнаяСсылкаФорматированнойСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеЛогированияЗапросовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработкаНавигационнойСсылкиЛогирования(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеЛогированияЗапросовРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработкаНавигационнойСсылкиЛогирования(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ДокументыИСМП

#Область ЗаказНаЭмиссиюКодовМаркировкиСУЗ

&НаКлиенте
Процедура ОткрытьЗаказНаЭмиссиюКодовМаркировкиСУЗНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ЗаказНаЭмиссиюСУЗ.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказНаЭмиссиюКодовМаркировкиСУЗОформитеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ЗаказНаЭмиссиюСУЗ.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов("Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаСпискаДокументов", Неопределено, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказНаЭмиссиюКодовМаркировкиСУЗОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ЗаказНаЭмиссиюСУЗ.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказНаЭмиссиюКодовМаркировкиСУЗОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ЗаказНаЭмиссиюСУЗ.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов("Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаСпискаДокументов", Неопределено, Истина);
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьОбменОбработкаОжидания()
	
	ОбменДаннымиИСМПКлиент.ПродолжитьВыполнениеОбмена(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область МаркировкаТоваровИСМП

&НаКлиенте
Процедура ОткрытьМаркировкаТоваровИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияВводВОборот()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМаркировкаТоваровИСМПОформитеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияВводВОборот()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМаркировкаТоваровИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияВводВОборот()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМаркировкаТоваровИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияВводВОборот()));
	
КонецПроцедуры

#КонецОбласти

#Область ПодтверждениеПоступленияКИЗ

&НаКлиенте
Процедура ОткрытьПодтверждениеПоступленияКИЗИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияПоступлениеКИЗ()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодтверждениеПоступленияКИЗИСМПОформитеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияПоступлениеКИЗ()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодтверждениеПоступленияКИЗИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияПоступлениеКИЗ()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодтверждениеПоступленияКИЗИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияПоступлениеКИЗ()));
	
КонецПроцедуры

#КонецОбласти

#Область ПеремаркировкаТоваровИСМП

&НаКлиенте
Процедура ОткрытьПеремаркировкаТоваровИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПеремаркировкаТоваровИСМПОформитеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов("Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов", Неопределено, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПеремаркировкаТоваровИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПеремаркировкаТоваровИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область СписаниеКодовМаркировкиИСМП

&НаКлиенте
Процедура ОткрытьСписаниеКодовМаркировкиИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписаниеКодовМаркировкиИСМПОформитеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов("Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаСпискаДокументов", Неопределено, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписаниеКодовМаркировкиИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписаниеКодовМаркировкиИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область УточнениеСведенийОКодахМаркировкиИСМП

&НаКлиенте
Процедура ОткрытьУточнениеСведенийОКодахМаркировкиИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.УточнениеСведенийОКодахМаркировкиИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.УточнениеСведенийОКодахМаркировкиИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействияИлиОжидания");

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУточнениеСведенийОКодахМаркировкиИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.УточнениеСведенийОКодахМаркировкиИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.УточнениеСведенийОКодахМаркировкиИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУточнениеСведенийОКодахМаркировкиИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.УточнениеСведенийОКодахМаркировкиИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.УточнениеСведенийОКодахМаркировкиИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ВыводИзОборотаИСМП

&НаКлиенте
Процедура ОткрытьВыводИзОборотаИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ВыводИзОборотаИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ВыводИзОборотаИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыводИзОборотаИСМПОформитеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ВыводИзОборотаИСМП.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов("Документ.ВыводИзОборотаИСМП.Форма.ФормаСпискаДокументов", Неопределено, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыводИзОборотаИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ВыводИзОборотаИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ВыводИзОборотаИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыводИзОборотаИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ВыводИзОборотаИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ВыводИзОборотаИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ОтгрузкаТоваровИСМП

&НаКлиенте
Процедура ОткрытьОтгрузкаТоваровИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ОтгрузкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ОтгрузкаТоваровИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтгрузкаТоваровИСМПОформитеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ОтгрузкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов("Документ.ОтгрузкаТоваровИСМП.Форма.ФормаСпискаДокументов", Неопределено, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтгрузкаТоваровИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ОтгрузкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ОтгрузкаТоваровИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтгрузкаТоваровИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ОтгрузкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ОтгрузкаТоваровИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ПеремещениеМеждуМОДИСМП

&НаКлиенте
Процедура ОткрытьПеремещениеМеждуМОДИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ПеремещениеМеждуМОДИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ПеремещениеМеждуМОДИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПеремещениеМеждуМОДИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ПеремещениеМеждуМОДИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ПеремещениеМеждуМОДИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПеремещениеМеждуМОДИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ПеремещениеМеждуМОДИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ПеремещениеМеждуМОДИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПеремещениеМеждуМОДИСМПОформитеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ПеремещениеМеждуМОДИСМП.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов("Документ.ПеремещениеМеждуМОДИСМП.Форма.ФормаСпискаДокументов", Неопределено, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ПриемкаТоваровИСМП

&НаКлиенте
Процедура ОткрытьПриемкаТоваровИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ПриемкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ПриемкаТоваровИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПриемкаТоваровИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ПриемкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ПриемкаТоваровИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПриемкаТоваровИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ПриемкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ПриемкаТоваровИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область Агрегация

&НаКлиенте
Процедура ОткрытьАгрегацияТоваровИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияАгрегация()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАгрегацияТоваровИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияАгрегация()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАгрегацияТоваровИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.МаркировкаТоваровИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияАгрегация()));
	
КонецПроцедуры

#КонецОбласти

#Область РазрешениеНаОтгрузкуИСМП

&НаКлиенте
Процедура ОткрытьРазрешениеНаОтгрузкуИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.РазрешениеНаОтгрузкуИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.РазрешениеНаОтгрузкуИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРазрешениеНаОтгрузкуИСМПОформитеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.РазрешениеНаОтгрузкуИСМП.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов("Документ.РазрешениеНаОтгрузкуИСМП.Форма.ФормаСпискаДокументов", Неопределено, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРазрешениеНаОтгрузкуИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.РазрешениеНаОтгрузкуИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.РазрешениеНаОтгрузкуИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРазрешениеНаОтгрузкуИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.РазрешениеНаОтгрузкуИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.РазрешениеНаОтгрузкуИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ВозвратВОборотИСМП

&НаКлиенте
Процедура ОткрытьВозвратВОборотИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ВозвратВОборотИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ВозвратВОборотИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратВОборотИСМПОформитеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ВозвратВОборотИСМП.Форма.ФормаСпискаДокументов.ОткрытиеСпискаРаспоряжений");
	ОткрытьФормуСпискаДокументов("Документ.ВозвратВОборотИСМП.Форма.ФормаСпискаДокументов", Неопределено, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратВОборотИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ВозвратВОборотИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ВозвратВОборотИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратВОборотИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ВозвратВОборотИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("Документ.ВозвратВОборотИСМП.Форма.ФормаСпискаДокументов", "ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ВскрытыеПотребительскиеУпаковкиИС

&НаКлиенте
Процедура ОткрытьВскрытыеПотребительскиеУпаковкиИСНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС.Форма.ФормаСписка.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВскрытыеПотребительскиеУпаковкиИСОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС.Форма.ФормаСписка.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС", "ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВскрытыеПотребительскиеУпаковкиИСОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС.Форма.ФормаСписка.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС", "ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетыИСМП

&НаКлиенте
Процедура ОткрытьОтчетИСМПСведенияОбОтклоненияхНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ОтчетИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияСведенияОбОтклонениях()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетИСМПСведенияОбОтклоненияхОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ОтчетИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияСведенияОбОтклонениях()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетИСМПСведенияОбОтклоненияхОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ОтчетИСМП.Форма.ФормаСпискаДокументов.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияСведенияОбОтклонениях()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетИСМПНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ОтчетИСМП.Форма.ФормаСписка.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияОстаткиКодов()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетИСМПОтработайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ОтчетИСМП.Форма.ФормаСписка.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияОстаткиКодов()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетИСМПОжидайтеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ОтчетИСМП.Форма.ФормаСписка.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетИСМП.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания",,
		Новый Структура("РежимОткрытияПоВидуОперации", ИнтеграцияИСМПКлиентСервер.РежимОткрытияОстаткиКодов()));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ДокументыЭДО

#Область ЭлектронныйДокументВходящий

&НаКлиенте
Процедура ОткрытьВходящиеДокументыЭДОНажатие(Элемент)
	
	Если ВерсияАПИ = 1 Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Обработка.ОбменСКонтрагентами.Форма.ТекущиеДелаПоЭДО.ОткрытиеОсновногоСписка");
		
		ПараметрыОткрытия = ПараметрыОткрытияПанелиЭДОИзИСМП(Организации);
		ПараметрыОткрытия.Раздел           = "Входящие";
		ОткрытьФорму(ИмяФормыОбработкиОбменаПоЭДО(), ПараметрыОткрытия, ЭтотОбъект);
	Иначе
		МодульЭДО = ОбщегоНазначенияКлиент.ОбщийМодуль(СокрЛП("ОбменСКонтрагентамиКлиент"));
		МодульЭДО.ОткрытьТекущиеДелаЭДО(ПараметрыОтбораВходящие());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВходящиеДокументыЭДООтработайтеНажатие(Элемент)
	
	Если ВерсияАПИ = 1 Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Обработка.ОбменСКонтрагентами.Форма.ТекущиеДелаПоЭДО.ОткрытиеОсновногоСписка");
		
		ПараметрыОткрытия = ПараметрыОткрытияПанелиЭДОИзИСМП(Организации);
		ПараметрыОткрытия.РежимОтображения = "КИсполнению";
		ПараметрыОткрытия.Раздел           = "Входящие";
		ОткрытьФорму(ИмяФормыОбработкиОбменаПоЭДО(), ПараметрыОткрытия, ЭтотОбъект);
	Иначе 
		МодульЭДО = ОбщегоНазначенияКлиент.ОбщийМодуль(СокрЛП("ОбменСКонтрагентамиКлиент"));
		МодульЭДО.ОткрытьТекущиеДелаЭДО(ПараметрыОтбораВходящиеКОтработке());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВходящиеДокументыЭДООжидайтеНажатие(Элемент)
	
	Если ВерсияАПИ = 1 Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Обработка.ОбменСКонтрагентами.Форма.ТекущиеДелаПоЭДО.ОткрытиеОсновногоСписка");
		
		ПараметрыОткрытия = ПараметрыОткрытияПанелиЭДОИзИСМП(Организации);
		ПараметрыОткрытия.Раздел           = "НаКонтроле";
		ОткрытьФорму(ИмяФормыОбработкиОбменаПоЭДО(), ПараметрыОткрытия, ЭтотОбъект);
	Иначе
		МодульЭДО = ОбщегоНазначенияКлиент.ОбщийМодуль(СокрЛП("ОбменСКонтрагентамиКлиент"));
		МодульЭДО.ОткрытьТекущиеДелаЭДО(ПараметрыОтбораВходящиеОжидание());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныйДокументИсходящий

&НаКлиенте
Процедура ОткрытьИсходящиеДокументыЭДОНажатие(Элемент)
	
	Если ВерсияАПИ = 1 Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Обработка.ОбменСКонтрагентами.Форма.ТекущиеДелаПоЭДО.ОткрытиеОсновногоСписка");
		
		ПараметрыОткрытия = ПараметрыОткрытияПанелиЭДОИзИСМП(Организации);
		ПараметрыОткрытия.Раздел           = "Исходящие";
		ОткрытьФорму(ИмяФормыОбработкиОбменаПоЭДО(), ПараметрыОткрытия, ЭтотОбъект);
	Иначе
		МодульЭДО = ОбщегоНазначенияКлиент.ОбщийМодуль(СокрЛП("ОбменСКонтрагентамиКлиент"));
		МодульЭДО.ОткрытьТекущиеДелаЭДО(ПараметрыОтбораИсходящие());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсходящиеДокументыЭДООформитеНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Обработка.ОбменСКонтрагентами.Форма.ТекущиеДелаПоЭДО.ОткрытиеОсновногоСписка");
	
	Если ВерсияАПИ = 1 Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Обработка.ОбменСКонтрагентами.Форма.ТекущиеДелаПоЭДО.ОткрытиеОсновногоСписка");
		
		ПараметрыОткрытия = ПараметрыОткрытияПанелиЭДОИзИСМП(Организации);
		ПараметрыОткрытия.Раздел           = "Сформировать";
		ОткрытьФорму(ИмяФормыОбработкиОбменаПоЭДО(), ПараметрыОткрытия, ЭтотОбъект);
	Иначе
		МодульЭДО = ОбщегоНазначенияКлиент.ОбщийМодуль(СокрЛП("ОбменСКонтрагентамиКлиент"));
		МодульЭДО.ОткрытьТекущиеДелаЭДО(ПараметрыОтбораИсходящиеКОформлению());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсходящиеДокументыЭДООтработайтеНажатие(Элемент)
	
	Если ВерсияАПИ = 1 Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Обработка.ОбменСКонтрагентами.Форма.ТекущиеДелаПоЭДО.ОткрытиеОсновногоСписка");
		
		ПараметрыОткрытия = ПараметрыОткрытияПанелиЭДОИзИСМП(Организации);
		ПараметрыОткрытия.РежимОтображения = "КИсполнению";
		ПараметрыОткрытия.Раздел           = "Исходящие";
		ОткрытьФорму(ИмяФормыОбработкиОбменаПоЭДО(), ПараметрыОткрытия, ЭтотОбъект);
	Иначе
		МодульЭДО = ОбщегоНазначенияКлиент.ОбщийМодуль(СокрЛП("ОбменСКонтрагентамиКлиент"));
		МодульЭДО.ОткрытьТекущиеДелаЭДО(ПараметрыОтбораИсходящиеКОтработке());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсходящиеДокументыЭДООжидайтеНажатие(Элемент)
	
	Если ВерсияАПИ = 1 Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Обработка.ОбменСКонтрагентами.Форма.ТекущиеДелаПоЭДО.ОткрытиеОсновногоСписка");
		
		ПараметрыОткрытия = ПараметрыОткрытияПанелиЭДОИзИСМП(Организации);
		ПараметрыОткрытия.Раздел           = "НаКонтролеИсх";
		ОткрытьФорму(ИмяФормыОбработкиОбменаПоЭДО(), ПараметрыОткрытия, ЭтотОбъект);
	Иначе
		МодульЭДО = ОбщегоНазначенияКлиент.ОбщийМодуль(СокрЛП("ОбменСКонтрагентамиКлиент"));
		МодульЭДО.ОткрытьТекущиеДелаЭДО(ПараметрыОтбораИсходящиеОжидание());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбъектыИСМП

&НаКлиенте
Процедура НастройкаИСМПНажатие(Элемент)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияИСМП.Форма.НастройкиИСМП", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроверкуКодаМаркировкиИСМПНажатие(Элемент)
	
	ШтрихкодированиеИСМПКлиент.ОткрытьФормуПроверкиКодовМаркировки();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСпискиДокументов();
	
	ПараметрыАварийногоРежима = ПолучитьПараметрыАварийногоРежима();
	ОбновитьПредставлениеАварийногоРежима();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ОбменДаннымиИСМПКлиент.ВыполнитьОбмен(
		ЭтотОбъект,
		ОбменДаннымиИСМПКлиент.ОрганизацииДляОбмена(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВЛичныйКабинет(Команда)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://markirovka.crpt.ru/");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВЛичныйКабинетТестовыйКонтур(Команда)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://markirovka.sandbox.crptech.ru/");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДействияСФормамиДокументовИСМП

&НаКлиенте
Процедура ОткрытьФормуСпискаДокументов(ИмяФормы,
                                       ДальнейшееДействиеИСМП,
                                       ОткрытьРаспоряжения = Ложь,
                                       ДополнительныеПараметры = Неопределено)
	
	СтруктураБыстрогоОтбора = Новый Структура();
	ПараметрыФормы = Новый Структура;
	
	Если ОткрытьРаспоряжения Тогда
		ПараметрыФормы.Вставить("ОткрытьРаспоряжения", Истина);
	Иначе
		СтруктураБыстрогоОтбора.Вставить("ДальнейшееДействиеИСМП", ДальнейшееДействиеИСМП);
	КонецЕсли;
	
	ИмяПоляОтветственный = "Ответственный";
	ИмяПоляОрганизации = "Организации";
	ИмяПоляОрганизация = "Организация";
	ИмяПоляПредставления = "ОрганизацииПредставление";
	
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляОтветственный, Ответственный);
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляОрганизации,   Организации);
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляОрганизация,   Организация);
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляПредставления, ОрганизацииПредставление);
	
	ПараметрыФормы.Вставить("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		Для Каждого ЭлементКоллекции Из ДополнительныеПараметры Цикл
			ПараметрыФормы.Вставить(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяФормы = "РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС" Тогда
		ПараметрыОткрытия = ОбщегоНазначенияИСКлиент.ПараметрыОткрытияФормыСпискаПотребительскихУпаковок();
		ПараметрыОткрытия.ПараметрыФормы = ПараметрыФормы;
		ОбщегоНазначенияИСМПКлиент.ОткрытьФормуСпискаВскрытыхПотребительскихУпаковок(ПараметрыОткрытия);
	Иначе
		ОткрытьФорму(ИмяФормы, ПараметрыФормы,, Новый УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область АварийныйРежим

&НаКлиенте
Процедура Подключаемый_ОбработкаОжиданияЗавершенияАварийногоРежима()
	
	ПараметрыАварийногоРежима = ПолучитьПараметрыАварийногоРежима();
	ОбновитьПредставлениеАварийногоРежима();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыАварийногоРежима()
	
	ПараметрыАварийногоРежима = ОбщегоНазначенияИСМППовтИсп.ДанныеНастройкиАварийногоРежима();
	
	Возврат ПараметрыАварийногоРежима;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПредставлениеАварийногоРежима()
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбработкаОжиданияЗавершенияАварийногоРежима");
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85();
	
	Если ПараметрыАварийногоРежима.Включено Тогда
		
		Если ЗначениеЗаполнено(ПараметрыАварийногоРежима.ДатаОкончания) Тогда
			ДатаЗавершенияАварийногоРежима = МестноеВремя(ПараметрыАварийногоРежима.ДатаОкончания);
		КонецЕсли;
		
		ДатаТекущая = МестноеВремя(ОбщегоНазначенияКлиент.ДатаУниверсальная());
		
		Если ДатаТекущая < ДатаЗавершенияАварийногоРежима Тогда
		
			Если НачалоДня(ДатаТекущая) <> НачалоДня(ДатаЗавершенияАварийногоРежима) Тогда
				ПредставлениеДаты = СтрШаблон(
					" (%1)",
					Формат(ДатаЗавершенияАварийногоРежима, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
			
			ПредставлениеВремени = СтрШаблон(
				"%1%2",
				Формат(ДатаЗавершенияАварийногоРежима, "ДФ=HH:mm;"),
				ПредставлениеДаты);
			
			ПодключитьОбработчикОжидания(
				"Подключаемый_ОбработкаОжиданияЗавершенияАварийногоРежима",
				(ДатаЗавершенияАварийногоРежима - ДатаТекущая) + 10,
				Истина);
			
			ШаблонСтроки = НСтр("ru = 'Установлен аварийный режим до %1'");
			Если ЭтоИнтерфейс85 Тогда
				Элементы.НадписьАварийныйРежим.Заголовок = Новый ФорматированнаяСтрока(
					СтрШаблон(ШаблонСтроки, ПредставлениеВремени),,,,"УстановленАварийныйРежим");
			Иначе
				Элементы.НадписьАварийныйРежимТакси.Заголовок = Новый ФорматированнаяСтрока(
					СтрШаблон(ШаблонСтроки, ПредставлениеВремени),, ЦветТекстаПроблемаГосИС,,"УстановленАварийныйРежим");
			КонецЕсли;
			
		Иначе
			
			ПараметрыАварийногоРежима.Включено = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.НадписьАварийныйРежим.Видимость = ПараметрыАварийногоРежима.Включено И ЭтоИнтерфейс85;
	Элементы.ГруппаОтображениеАварийногоРежимаТакси.Видимость = ПараметрыАварийногоРежима.Включено И Не ЭтоИнтерфейс85;;
	
	Если ПараметрыАварийногоРежима.Включено И ЭтоИнтерфейс85 Тогда
		Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаКрасный;
		Элементы.ГруппаДекорацияСостояниеОбмена.Видимость = Истина;
		УстановитьУсловноеОформлениеГруппыСостояниеОбменаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбработкиФормыУточненияАварийногоРежима(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("АктивностьРежима") Тогда
		
		Если Результат.АктивностьРежима Тогда
			// включение аварийного режима
			ОбщегоНазначенияИСМПВызовСервера.ВключитьАварийныйРежимРазрешительнойСистемы(Результат.СрокДействияВЧасах);
			
		Иначе
			// отключение аварийного режима
			ОбщегоНазначенияИСМПВызовСервера.ОтключитьАварийныйРежимРазрешительнойСистемы();
			
		КонецЕсли;
		
		ПараметрыАварийногоРежима = ПолучитьПараметрыАварийногоРежима();
		ОбновитьПредставлениеАварийногоРежима();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияСНастройкамиФормы

&НаСервере
Процедура СохранитьНастройкиФормы()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПанельОбменИСМП", "Ответственный",            Ответственный);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПанельОбменИСМП", "Организация",              Организация);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПанельОбменИСМП", "ОрганизацииПредставление", ОрганизацииПредставление);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПанельОбменИСМП", "Организации",              Организации);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()
	
	Организации              = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПанельОбменИСМП", "Организации");
	Ответственный            = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ПанельОбменИСМП", "Ответственный", Ответственный);
	Организация              = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ПанельОбменИСМП", "Организация", Организация);
	ОрганизацииПредставление = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ПанельОбменИСМП", "ОрганизацииПредставление", ОрганизацииПредставление);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеЭлементовФормы

&НаСервере
Процедура ОбновитьСпискиДокументов()
	
	ОбновитьСпискиДокументовЭДО();
	ОбновитьСпискиДокументовИСМП();
	ОтобразитьСостояниеОбмена();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыНаСервере()
	
	ПравоДоступаОбменЭДО = ОбменСКонтрагентами.ЕстьПравоОбработкиЭД();
	Элементы.ГруппаЭлектронныйДокументВходящий.Видимость =  ПравоДоступаОбменЭДО И Не УпрощеннаяИнтеграцияБЭД;
	Элементы.ГруппаЭлектронныйДокументИсходящий.Видимость = ПравоДоступаОбменЭДО И Не УпрощеннаяИнтеграцияБЭД;
	
	Элементы.Ответственный.Видимость = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.НастройкаИСМП.Видимость = Не УпрощеннаяИнтеграцияБЭД;
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		ТекстЗаголовка = НСтр("ru='Настройки и справочники'");
	Иначе
		ТекстЗаголовка = НСтр("ru='Товарные группы'");
	КонецЕсли;
	Элементы.НастройкаИСМП.Заголовок = Новый ФорматированнаяСтрока(ТекстЗаголовка);
	
	Элементы.ОткрытьПроверкуКодаМаркировкиИСМП.Заголовок =  Новый ФорматированнаяСтрока(
		НСтр("ru='Проверка кодов маркировки'"));
	
	ЭлементыПоМетаданным = Новый Соответствие();
	
	ЭлементыПоМетаданным.Вставить(Элементы.ГруппаПеремаркировкаТоваровИСМП, Метаданные.Документы.ПеремаркировкаТоваровИСМП);
	ЭлементыПоМетаданным.Вставить(Элементы.ГруппаПриемкаТоваровИСМП,        Метаданные.Документы.ПриемкаТоваровИСМП);
	ЭлементыПоМетаданным.Вставить(Элементы.ГруппаОтгрузкаТоваровИСМП,       Метаданные.Документы.ОтгрузкаТоваровИСМП);
	ЭлементыПоМетаданным.Вставить(Элементы.ГруппаПеремещениеМеждуМОДИСМП,   Метаданные.Документы.ПеремещениеМеждуМОДИСМП);
	ЭлементыПоМетаданным.Вставить(Элементы.ГруппаВозвратВОборотИСМП,        Метаданные.Документы.ВозвратВОборотИСМП);
	ЭлементыПоМетаданным.Вставить(Элементы.ГруппаВыводИзОборотаИСМП,        Метаданные.Документы.ВыводИзОборотаИСМП);
	ЭлементыПоМетаданным.Вставить(
		Элементы.ГруппаУточнениеСведенийОКодахМаркировкиИСМП,
		Метаданные.Документы.УточнениеСведенийОКодахМаркировкиИСМП);
	ЭлементыПоМетаданным.Вставить(
		Элементы.ГруппаВскрытыеПотребительскиеУпаковкиИС,
		Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС);
	ЭлементыПоМетаданным.Вставить(Элементы.ГруппаОтчетИСМП, Метаданные.Документы.ОтчетИСМП);
	
	УчитываемыеВидыМаркируемойПродукции = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
	
	ВключенУчетМеха = ШтрихкодированиеОбщегоНазначенияИС.ПрисутствуетПродукцияИзНатуральногоМеха(УчитываемыеВидыМаркируемойПродукции);
	Элементы.ГруппаПодтверждениеПоступленияКИЗИСМП.Видимость = ВключенУчетМеха;
	
	Для Каждого КлючИЗначение Из ЭлементыПоМетаданным Цикл
		КлючИЗначение.Ключ.Видимость = ИнтеграцияИСМППовтИсп.ОбъектМетаданныхДоступен(КлючИЗначение.Значение.ПолноеИмя());
	КонецЦикла;
	
	Элементы.ФормаПерейтиВЛичныйКабинетТестовыйКонтур.Видимость = Константы.РежимРаботыСТестовымКонтуромИСМП.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиДокументовЭДО()
	
	Если Не ОбменСКонтрагентами.ЕстьПравоОбработкиЭД() Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоВходящихКОтработке = 0;
	КоличествоВходящихОжидание = 0;
	КоличествоИсходящихКОформлению = 0;
	КоличествоИсходящихКОтработке = 0;
	КоличествоИсходящихОжидание = 0;
	
	Если ЭлектронноеВзаимодействиеИСМП.ВерсияАПИ() = 1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("Организации",              Организации);
		Запрос.УстановитьПараметр("БезОтбораПоОрганизации",   Организации.Количество() = 0);
		Запрос.УстановитьПараметр("Ответственный",            ?(ЗначениеЗаполнено(Ответственный), Ответственный, Неопределено));
		Запрос.УстановитьПараметр("БезОтбораПоОтветственным", НЕ ЗначениеЗаполнено(Ответственный));
		
#Область ЭлектронныйДокументВходящий
		
		ТекстыЗапроса = Новый СписокЗначений;
		
		ТекстыЗапроса.Добавить(ТекстЗапросаОтработайтеВходящиеДокументыЭДО(), "Отработайте");
		ТекстыЗапроса.Добавить(ТекстЗапросаОжидайтеВходящиеДокументыЭДО(), "Ожидайте");
		
		РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса);
		
		//@skip-check bsl-legacy-check-string-literal
		Выборка = РезультатыЗапроса["Отработайте"].Выбрать();
		Если Выборка.Следующий() Тогда
			КоличествоВходящихКОтработке = Выборка.КоличествоДокументов;
		КонецЕсли;
		//@skip-check bsl-legacy-check-string-literal
		Выборка = РезультатыЗапроса["Ожидайте"].Выбрать();
		Если Выборка.Следующий() Тогда
			КоличествоВходящихОжидание = Выборка.КоличествоДокументов;
		КонецЕсли;
		
#КонецОбласти
		
#Область ЭлектронныйДокументИсходящий
		
		ТекстыЗапроса = Новый СписокЗначений;
		
		ТекстыЗапроса.Добавить(ТекстЗапросаОформитеИсходящиеДокументыЭДО(), "Оформите");
		ТекстыЗапроса.Добавить(ТекстЗапросаОтработайтеИсходящиеДокументыЭДО(), "Отработайте");
		ТекстыЗапроса.Добавить(ТекстЗапросаОжидайтеИсходящиеДокументыЭДО(), "Ожидайте");
		
		Запрос.УстановитьПараметр("ОграничениеИсходящихДокументовЭДО", Истина);
		
		РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса);
		
		//@skip-check bsl-legacy-check-string-literal
		Выборка = РезультатыЗапроса["Оформите"].Выбрать();
		Если Выборка.Следующий() Тогда
			КоличествоИсходящихКОформлению = Выборка.КоличествоДокументов;
		КонецЕсли;
		//@skip-check bsl-legacy-check-string-literal
		Выборка = РезультатыЗапроса["Отработайте"].Выбрать();
		Если Выборка.Следующий() Тогда
			КоличествоИсходящихКОтработке = Выборка.КоличествоДокументов;
		КонецЕсли;
		//@skip-check bsl-legacy-check-string-literal
		Выборка = РезультатыЗапроса["Ожидайте"].Выбрать();
		Если Выборка.Следующий() Тогда
			КоличествоИсходящихОжидание = Выборка.КоличествоДокументов;
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
		МодульЭДО = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентами");
		КоличествоВходящихКОтработке = МодульЭДО.КоличествоДокументовРазделаТекущихДелЭДО(ПараметрыОтбораВходящиеКОтработке());
		КоличествоВходящихОжидание   = МодульЭДО.КоличествоДокументовРазделаТекущихДелЭДО(ПараметрыОтбораВходящиеОжидание());
		
		КоличествоИсходящихКОформлению = МодульЭДО.КоличествоДокументовРазделаТекущихДелЭДО(ПараметрыОтбораИсходящиеКОформлению());
		КоличествоИсходящихКОтработке   = МодульЭДО.КоличествоДокументовРазделаТекущихДелЭДО(ПараметрыОтбораИсходящиеКОтработке());
		КоличествоИсходящихОжидание      = МодульЭДО.КоличествоДокументовРазделаТекущихДелЭДО(ПараметрыОтбораИсходящиеОжидание());
		
	КонецЕсли;
	
	ОбщееКоличествоВходящих = КоличествоВходящихКОтработке + КоличествоВходящихОжидание;
	ОбщееКоличествоИсходящих = КоличествоИсходящихКОформлению + КоличествоИсходящихКОтработке + КоличествоИсходящихОжидание;
	
	// Обновим тексты надписей действий с документом.
	
	// ПОКАЗАТЕЛИ ВХОДЯЩИХ
	СобытияФормИС.ВывестиПоказатель(
		КоличествоВходящихКОтработке,
		Элементы.ОткрытьЭлектронныйДокументВходящийОтработайте,
		НСтр("ru='отработайте'"),
		Истина);
		
	СобытияФормИС.ВывестиПоказатель(
		КоличествоВходящихОжидание,
		Элементы.ОткрытьЭлектронныйДокументВходящийОжидайте,
		НСтр("ru='ожидайте'"),
		Истина);
		
	СобытияФормИС.ВывестиПоказатель(
		1,
		Элементы.ОткрытьЭлектронныйДокументВходящий,
		НСтр("ru='Входящие документы ЭДО'"),
		Истина,
		Ложь,
		Истина);

	
	// ПОКАЗАТЕЛИ ИСХОДЯЩИХ
	СобытияФормИС.ВывестиПоказатель(
		КоличествоИсходящихКОформлению,
		Элементы.ОткрытьЭлектронныйДокументИсходящийОформите,
		НСтр("ru='оформите'"),
		Истина);
		
	СобытияФормИС.ВывестиПоказатель(
		КоличествоИсходящихКОтработке,
		Элементы.ОткрытьЭлектронныйДокументИсходящийОтработайте,
		НСтр("ru='отработайте'"),
		Истина);
		
	СобытияФормИС.ВывестиПоказатель(
		КоличествоИсходящихОжидание,
		Элементы.ОткрытьЭлектронныйДокументИсходящийОжидайте,
		НСтр("ru='ожидайте'"),
		Истина);
		
	СобытияФормИС.ВывестиПоказатель(
		1,
		Элементы.ОткрытьЭлектронныйДокументИсходящий,
		НСтр("ru='Исходящие документы ЭДО'"),
		Истина,
		Ложь,
		Истина);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаОжидайтеИсходящиеДокументыЭДО()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(1) КАК КоличествоДокументов
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1000
	|		1 КАК _Счетчик
	|	ИЗ
	|		Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящий КАК ЭлектронныйДокументИсходящий
	|			ПО (ЭлектронныйДокументИсходящий.Ссылка = ЭДПрисоединенныеФайлы.ВладелецФайла)
	|			И (НЕ ЭлектронныйДокументИсходящий.ПометкаУдаления)
	|			И ЭлектронныйДокументИсходящий.СодержитДанныеОМаркируемыхТоварах
	|	ГДЕ
	|		ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД В (ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ПервичныйЭД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ЭСФ), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФДОПУПД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОПУПД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФУКД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОП))
	|		И ЭлектронныйДокументИсходящий.СостояниеЭДО В
	|		(ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяСогласиеКонтрагента),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяАннулирование),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяИзвещениеОПолучении),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяИсправление),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяОтправка),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяОтправкаИзвещения),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяОтправкаПолучателю),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяПередачаОператору),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяПодтверждение),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяПодтверждениеОператора))
	|		И (&БезОтбораПоОрганизации
	|		ИЛИ ЭлектронныйДокументИсходящий.Организация В (&Организации))
	|		И (&БезОтбораПоОтветственным
	|		ИЛИ ЭлектронныйДокументИсходящий.Ответственный = &Ответственный)) КАК ВложенныйЗапрос";
	
КонецФункции

&НаСервере
Функция ТекстЗапросаОтработайтеИсходящиеДокументыЭДО()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(1) КАК КоличествоДокументов
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1000
	|		1 КАК _Счетчик
	|	ИЗ
	|		Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящий КАК ЭлектронныйДокументИсходящий
	|			ПО (ЭлектронныйДокументИсходящий.Ссылка = ЭДПрисоединенныеФайлы.ВладелецФайла)
	|			И (НЕ ЭлектронныйДокументИсходящий.ПометкаУдаления)
	|			И ЭлектронныйДокументИсходящий.СодержитДанныеОМаркируемыхТоварах
	|	ГДЕ
	|		(ЭлектронныйДокументИсходящий.СостояниеЭДО = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.НаПодписи)
	|					И ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД В (ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ПервичныйЭД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ЭСФ), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФДОПУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОПУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОП))
	|				ИЛИ НЕ ЭлектронныйДокументИсходящий.СостояниеЭДО В (ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ЗакрытПринудительно), ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ПолученОтказОтКонтрагента))
	|					И ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД В (ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ИППДОИПУПДУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ИППДОИПЭСФ), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ИППДОЭСФ), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ИППДПЭСФ), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ИПУУЭСФ), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ИОП), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ИПЭСФ))
	|					И ЭДПрисоединенныеФайлы.СтатусЭД = ЗНАЧЕНИЕ(Перечисление.СтатусыЭД.Утвержден))
	|		И 1 В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					1
	|				ИЗ
	|					РегистрСведений.СостояниеПодписанияЭД КАК ЭДНаПодписи
	|				ГДЕ
	|					ЭДПрисоединенныеФайлы.Ссылка = ЭДНаПодписи.Объект
	|					И ЭДНаПодписи.Текущий
	|					И ЭДНаПодписи.Объект ССЫЛКА Справочник.ЭДПрисоединенныеФайлы)
	|		И (&БезОтбораПоОрганизации
	|		ИЛИ ЭлектронныйДокументИсходящий.Организация В (&Организации))
	|		И (&БезОтбораПоОтветственным
	|		ИЛИ ЭлектронныйДокументИсходящий.Ответственный = &Ответственный)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1000
	|		1
	|	ИЗ
	|		Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящий КАК ЭлектронныйДокументИсходящий
	|			ПО (ЭлектронныйДокументИсходящий.Ссылка = ЭДПрисоединенныеФайлы.ВладелецФайла)
	|			И (НЕ ЭлектронныйДокументИсходящий.ПометкаУдаления)
	|			И ЭлектронныйДокументИсходящий.СодержитДанныеОМаркируемыхТоварах
	|	ГДЕ
	|		ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД В (ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ПервичныйЭД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ЭСФ), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФДОПУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОПУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОП))
	|		И ЭлектронныйДокументИсходящий.СостояниеЭДО В (ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОшибкаПередачи), ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент))
	|		И (&БезОтбораПоОрганизации
	|		ИЛИ ЭлектронныйДокументИсходящий.Организация В (&Организации))
	|		И (&БезОтбораПоОтветственным
	|		ИЛИ ЭлектронныйДокументИсходящий.Ответственный = &Ответственный)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1000
	|		1
	|	ИЗ
	|		Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящий КАК ЭлектронныйДокументИсходящий
	|			ПО (ЭлектронныйДокументИсходящий.Ссылка = ЭДПрисоединенныеФайлы.ВладелецФайла)
	|			И (НЕ ЭлектронныйДокументИсходящий.ПометкаУдаления)
	|			И ЭлектронныйДокументИсходящий.СодержитДанныеОМаркируемыхТоварах
	|	ГДЕ
	|		ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД В (ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ПервичныйЭД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ЭСФ), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФДОПУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОПУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОП))
	|		И ЭлектронныйДокументИсходящий.СостояниеЭДО = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ТребуетсяАннулировать)
	|		И (&БезОтбораПоОрганизации
	|		ИЛИ ЭлектронныйДокументИсходящий.Организация В (&Организации))
	|		И (&БезОтбораПоОтветственным
	|		ИЛИ ЭлектронныйДокументИсходящий.Ответственный = &Ответственный)
	|) КАК ВложенныйЗапрос";
	
КонецФункции

&НаСервере
Функция ТекстЗапросаОформитеИсходящиеДокументыЭДО()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(1) КАК КоличествоДокументов
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|		СтатусыОформленияДокументовИСМП.Основание КАК _Счетчик
	|	ИЗ
	|		РегистрСведений.СостоянияЭД КАК СостоянияЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОформленияДокументовИСМП КАК СтатусыОформленияДокументовИСМП
	|			ПО СостоянияЭД.СсылкаНаОбъект = СтатусыОформленияДокументовИСМП.Основание
	|	ГДЕ
	|		СостоянияЭД.СостояниеВерсииЭД = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.НеСформирован)
	|		И &ОграничениеИсходящихДокументовЭДО
	|		И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Документ.УдалитьПроизвольныйЭД
	|		И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Документ.ПакетЭД
	|		И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Справочник.УдалитьСоглашенияОбИспользованииЭД
	|		И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Справочник.НастройкиЭДО
	|		И (&БезОтбораПоОрганизации
	|		ИЛИ СостоянияЭД.Организация В (&Организации))) КАК ВложенныйЗапрос";
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаОжидайтеВходящиеДокументыЭДО()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(1) КАК КоличествоДокументов
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1000
	|		1 КАК _Счетчик
	|	ИЗ
	|		Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящий КАК ЭлектронныйДокументВходящий
	|			ПО ЭлектронныйДокументВходящий.Ссылка = ЭДПрисоединенныеФайлы.ВладелецФайла
	|			И НЕ ЭлектронныйДокументВходящий.ПометкаУдаления
	|			И ЭлектронныйДокументВходящий.СодержитДанныеОМаркируемыхТоварах
	|	ГДЕ
	|		ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД В (ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ПервичныйЭД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ЭСФ), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФДОПУПД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОПУПД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФУКД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОП))
	|		И ЭлектронныйДокументВходящий.СостояниеЭДО В (ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяСогласиеКонтрагента),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяАннулирование),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяИзвещениеОПолучении),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяИсправление),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяОтправка),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяОтправкаИзвещения),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяОтправкаПолучателю),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяПередачаОператору),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяПодтверждение),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяПодтверждениеОператора))
	|		И (&БезОтбораПоОрганизации
	|		ИЛИ ЭлектронныйДокументВходящий.Организация В (&Организации))
	|		И (&БезОтбораПоОтветственным
	|		ИЛИ ЭлектронныйДокументВходящий.Ответственный = &Ответственный)) КАК ВложенныйЗапрос";
		
КонецФункции

&НаСервере
Функция ТекстЗапросаОтработайтеВходящиеДокументыЭДО()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(1) КАК КоличествоДокументов
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1000
	|		1 КАК _Счетчик
	|	ИЗ
	|		Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящий КАК ЭлектронныйДокументВходящий
	|			ПО (ЭлектронныйДокументВходящий.Ссылка = ЭДПрисоединенныеФайлы.ВладелецФайла)
	|			И (НЕ ЭлектронныйДокументВходящий.ПометкаУдаления)
	|			И ЭлектронныйДокументВходящий.СодержитДанныеОМаркируемыхТоварах
	|	ГДЕ
	|		НЕ ЭлектронныйДокументВходящий.СостояниеЭДО В (ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.Отклонен),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.Аннулирован),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяАннулирование),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.НеСформирован),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ЗакрытПринудительно),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ПолученОтказОтКонтрагента))
	|		И ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД В (ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ПервичныйЭД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ЭСФ), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФДОПУПД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.СЧФУПД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОПУПД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.КСЧФУКД),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДИСУКД), ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ДОП))
	|		И 1 В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				1
	|			ИЗ
	|				РегистрСведений.КонтрольОтраженияВУчетеЭДО КАК Контроль
	|			ГДЕ
	|				ЭлектронныйДокументВходящий.Ссылка = Контроль.ЭлектронныйДокумент)
	|		И (&БезОтбораПоОрганизации
	|		ИЛИ ЭлектронныйДокументВходящий.Организация В (&Организации))
	|		И (&БезОтбораПоОтветственным
	|		ИЛИ ЭлектронныйДокументВходящий.Ответственный = &Ответственный)) КАК ВложенныйЗапрос";
	
КонецФункции

&НаСервере
Процедура ОбновитьСпискиДокументовИСМП()
	
	// Заполним таблицу документов ИС МП.
	ТаблицаДокументы = Новый ТаблицаЗначений;
	ТаблицаДокументы.Колонки.Добавить("Метаданные");
	ТаблицаДокументы.Колонки.Добавить("Заголовок");
	ТаблицаДокументы.Колонки.Добавить("Оформите");
	ТаблицаДокументы.Колонки.Добавить("Отработайте");
	ТаблицаДокументы.Колонки.Добавить("Ожидайте");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоЧтение");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоДобавление");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоРедактирование");
	ТаблицаДокументы.Колонки.Добавить("ИмяЭлемента");
	ТаблицаДокументы.Колонки.Добавить("ТекстОтборДокументов");
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ,
		НСтр("ru='Заказы на эмиссию кодов маркировки'"),
		Истина,  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ПредставлениеВводВОборот = ИнтеграцияИСМПКлиентСервер.ПредставлениеСпискаВводВОборот();
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.МаркировкаТоваровИСМП,
		ПредставлениеВводВОборот,
		Метаданные.ОпределяемыеТипы.ОснованиеМаркировкаТоваровИСМП.Тип.Типы()[0] <> Тип("Строка"),  // Оформите
		Истина,  // Отработайте
		Истина,, // Ожидайте
		"И ДокументИСМП.Операция <> Значение(Перечисление.ВидыОперацийИСМП.Агрегация)");
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.МаркировкаТоваровИСМП,
		НСтр("ru='Подтверждение поступления КИЗ'"),
		Ложь,    // Оформите - для "Отчета о нанесении" создавать документ совместно с операцией ввода в оборот
		Истина,  // Отработайте
		Истина,  // Ожидайте
		"ПодтверждениеПоступленияКИЗИСМП",
		"И ДокументИСМП.Операция = Значение(Перечисление.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗ)");
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.МаркировкаТоваровИСМП,
		НСтр("ru='Агрегация'"),
		Ложь,  // Оформите
		Истина,  // Отработайте
		Истина, // Ожидайте
		"АгрегацияКодовМаркировкиИСМП",
		"И ДокументИСМП.Операция = Значение(Перечисление.ВидыОперацийИСМП.Агрегация)");
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ПеремаркировкаТоваровИСМП,
		НСтр("ru='Перемаркировка'"),
		Метаданные.ОпределяемыеТипы.ОснованиеПеремаркировкиТоваровИСМП.Тип.Типы()[0] <> Тип("Строка"),  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.СписаниеКодовМаркировкиИСМП,
		НСтр("ru='Списания кодов маркировки'"),
		Метаданные.ОпределяемыеТипы.ОснованиеСписаниеКодовМаркировкиИСМП.Тип.Типы()[0] <> Тип("Строка"),  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
		
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.УточнениеСведенийОКодахМаркировкиИСМП,
		НСтр("ru='Уточнение сведений о кодах маркировки'"),
		Метаданные.ОпределяемыеТипы.ОснованиеУточненияСведенийОКодахМаркировкиИСМП.Тип.Типы()[0] <> Тип("Строка"),  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОтчетИСМП,
		НСтр("ru='Сведения об отклонениях'"),
		Метаданные.ОпределяемыеТипы.ОснованиеОтчетИСМП.Тип.Типы()[0] <> Тип("Строка"),  // Оформите
		Истина,  // Отработайте
		Истина, // Ожидайте
		"ОтчетИСМПСведенияОбОтклонениях",
		"И ДокументИСМП.Операция = Значение(Перечисление.ВидыОперацийИСМП.ОтчетИСМПСведенияОбОтклонениях)");
		
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОтчетИСМП,
		НСтр("ru='Остатки кодов маркировки'"),
		Метаданные.ОпределяемыеТипы.ОснованиеОтчетИСМП.Тип.Типы()[0] <> Тип("Строка"),  // Оформите
		Истина,  // Отработайте
		Истина,, // Ожидайте
		"И ДокументИСМП.Операция <> Значение(Перечисление.ВидыОперацийИСМП.ОтчетИСМПСведенияОбОтклонениях)");
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ВыводИзОборотаИСМП,
		НСтр("ru='Вывод из оборота'"),
		Метаданные.ОпределяемыеТипы.ОснованиеВыводаИзОборотаИСМП.Тип.Типы()[0] <> Тип("Строка"),  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ВозвратВОборотИСМП,
		НСтр("ru='Возврат в оборот'"),
		Метаданные.ОпределяемыеТипы.ОснованиеВозвратВОборотИСМП.Тип.Типы()[0] <> Тип("Строка"),  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	УчитываемыеВидыМаркируемойПродукции = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
	ВключенУчетМеха = ШтрихкодированиеОбщегоНазначенияИС.ПрисутствуетПродукцияИзНатуральногоМеха(УчитываемыеВидыМаркируемойПродукции);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОтгрузкаТоваровИСМП,
		?(ВключенУчетМеха, НСтр("ru='Отгрузка'"), НСтр("ru='Отгрузка (ЕАЭС)'")),
		Истина,  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
		
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ПеремещениеМеждуМОДИСМП,
		НСтр("ru = 'Перемещения между МОД'"),
		Истина,  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ПриемкаТоваровИСМП,
		?(ВключенУчетМеха, НСтр("ru='Приемка'"), НСтр("ru='Приемка (ЕАЭС)'")),
		Истина,  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.РазрешениеНаОтгрузкуИСМП,
		НСтр("ru='Разрешения на отгрузку'"),
		Метаданные.ОпределяемыеТипы.ОснованиеРазрешениеНаОтгрузкуИСМП.Тип.Типы()[0] <> Тип("Строка"),  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ПодключениеКегаКОборудованиюРозливаИСМП,
		СокрЛП(СтрЗаменить(ОбщегоНазначенияИСПовтИсп.ПредставленияВскрытыхПотребительскихУпаковок("ИСМП").ЗаголовокСписка, "ИС МП", "")),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организации",              Организации);
	Запрос.УстановитьПараметр("БезОтбораПоОрганизации",   Организации.Количество() = 0);
	Запрос.УстановитьПараметр("Ответственный",            ?(ЗначениеЗаполнено(Ответственный), Ответственный, Неопределено));
	Запрос.УстановитьПараметр("БезОтбораПоОтветственным", НЕ ЗначениеЗаполнено(Ответственный));
	
	Для Каждого ТекЭлемент Из ТаблицаДокументы Цикл
		
		Если ЗначениеЗаполнено(ТекЭлемент.ИмяЭлемента) Тогда
			ИмяТекЭлемента = ТекЭлемент.ИмяЭлемента;
		Иначе
			ИмяТекЭлемента = ИмяЭлементаПоМетаданным(ТекЭлемент.Метаданные);
		КонецЕсли;
		
		Если НЕ ТекЭлемент.ЕстьПравоЧтение Тогда
			Элементы["Группа" + ИмяТекЭлемента].Видимость = Ложь;
			Продолжить;
		КонецЕсли;
		
		МетаРеквизитОснование = ИнтеграцияИС.РеквизитДокументОснованиеДокументаИС(ТекЭлемент.Метаданные);
		
		Если МетаРеквизитОснование = Неопределено Тогда
			Запрос.УстановитьПараметр("ПустойДокументОснование", Неопределено);
		Иначе
			Запрос.УстановитьПараметр("ПустойДокументОснование", 
				ИнтеграцияИС.МассивПустыхЗначенийСоставногоТипа(МетаРеквизитОснование.Тип));
		КонецЕсли;
		
		// Сформируем текст запроса выборки количества документов для каждого действия.
		ТекстыЗапроса = Новый СписокЗначений;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("Оформите",
			Новый Структура("Представление, Доступно",
				НСтр("ru='оформите'"),
				ТекЭлемент.ЕстьПравоДобавление));
		Если Не ТекЭлемент.Оформите Тогда
			СтруктураДействий.Оформите.Вставить("СкрытьЭлемент");
		КонецЕсли;
		СтруктураДействий.Вставить("Отработайте",
			Новый Структура("Представление, Доступно",
				НСтр("ru='отработайте'"),
				ТекЭлемент.ЕстьПравоРедактирование));
		СтруктураДействий.Вставить("Ожидайте",
			Новый Структура("Представление, Доступно",
				НСтр("ru='ожидайте'"),
				ТекЭлемент.ЕстьПравоЧтение));
		
		Если ТекЭлемент.Оформите Тогда
			ТекстыЗапроса.Добавить(
				ТекстЗапросаОформите(ТекЭлемент.Метаданные),
				ИмяТекЭлемента + "Оформите");
		КонецЕсли;
		
		Если ТекЭлемент.Отработайте Тогда
			ТекстыЗапроса.Добавить(
				ТекстЗапросаОтработайте(ТекЭлемент.Метаданные, ТекЭлемент.ТекстОтборДокументов),
				ИмяТекЭлемента + "Отработайте");
		КонецЕсли;
		
		Если ТекЭлемент.Ожидайте Тогда
			ТекстыЗапроса.Добавить(
				ТекстЗапросаОжидайте(ТекЭлемент.Метаданные, ТекЭлемент.ТекстОтборДокументов),
				ИмяТекЭлемента + "Ожидайте");
		КонецЕсли;
		
		// Получим запросом количество документов.
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ТекЭлемент.Метаданные.ПолноеИмя());
		Запрос.УстановитьПараметр("ВсеТребующиеОжидания", МенеджерДокумента.ВсеТребующиеОжидания());
		Запрос.УстановитьПараметр("ВсеТребующиеДействия", МенеджерДокумента.ВсеТребующиеДействия());
		
		РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса);
		
		// Обновим тексты надписей действий с документом.
		Для Каждого КлючИЗначение Из СтруктураДействий Цикл
			
			ЭлементНадписи = Элементы.Найти("Открыть" + ИмяТекЭлемента + КлючИЗначение.Ключ);
			
			Если ЭлементНадписи = Неопределено Тогда
				// Такое действие для документа не предусмотрено.
			ИначеЕсли КлючИЗначение.Значение.Свойство("СкрытьЭлемент") Тогда
				// Не определены соответствующие операции
				ЭлементНадписи.Видимость = Ложь;
				Элементы[ЭлементНадписи.Имя + "Декорация"].Заголовок = " ";
			ИначеЕсли Не ТекЭлемент[КлючИЗначение.Ключ] Тогда
				СобытияФормИС.ВывестиПоказатель(
					0,
					ЭлементНадписи,
					КлючИЗначение.Значение.Представление,
					КлючИЗначение.Значение.Доступно);
			Иначе
				СобытияФормИС.ВывестиПоказатель(
					РезультатыЗапроса[ИмяТекЭлемента + КлючИЗначение.Ключ].Выбрать(),
					ЭлементНадписи,
					КлючИЗначение.Значение.Представление,
					КлючИЗначение.Значение.Доступно);
			КонецЕсли;
			
		КонецЦикла;
		
		// Обновим текст надписи самого документа.
		СобытияФормИС.ВывестиПоказатель(
			1,
			Элементы["Открыть" + ИмяТекЭлемента],
			ТекЭлемент.Заголовок,
			Истина,
			Ложь,
			Истина);
		
	КонецЦикла;
	
	СохранитьНастройкиФормы();
	
КонецПроцедуры

&НаСервере
Функция ИмяЭлементаПоМетаданным(МетаданныеЭлемента)
	
	Если МетаданныеЭлемента.Имя = Метаданные.Документы.ПодключениеКегаКОборудованиюРозливаИСМП.Имя Тогда
		Возврат Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС.Имя;
	Иначе
		Возврат МетаданныеЭлемента.Имя;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОтобразитьСостояниеОбмена()
	
	РезультатыЗапроса = ИнтеграцияИСМП.СостояниеОбмена(Организации);
	
	ПерваяПроблема                      = Неопределено;
	ПерваяПроблемаФорматированнаяСтрока = Неопределено;
	ТекстПодсказкиФорматированнаяСтрока = Неопределено;
	
	ЕщеПроблемы    = 0;
		
	ЭтоИнтерфейс85 = ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85();
	Суффикс = "";
	Если Не ЭтоИнтерфейс85 Тогда
		Суффикс = "Такси";
	КонецЕсли;
	
	Элементы[СтрШаблон("%1%2%3", "НадписьСостояниеОбмена", Суффикс, "РасширеннаяПодсказка")].Заголовок = "";

	ТребуетсяНастройкаТоварныхГрупп = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции().Количество() = 0;
	Если ТребуетсяНастройкаТоварныхГрупп Тогда
		
		Элементы[СтрШаблон("%1%2", "ГруппаДекорацияСостояниеОбмена",Суффикс)].ТекущаяСтраница = Элементы[СтрШаблон("%1%2", "СостояниеОбменаКрасный",Суффикс)];
		
		Если ЭтоИнтерфейс85 Тогда
			Элементы[СтрШаблон("%1%2", "НадписьСостояниеОбмена",Суффикс)].Заголовок = Новый ФорматированнаяСтрока(
				НСтр("ru='Настройте товарные группы и загрузите номенклатуру'"),,,,
				"НастройкаПодключенияУТМ");
		Иначе
			Элементы[СтрШаблон("%1%2", "НадписьСостояниеОбмена",Суффикс)].Заголовок = Новый ФорматированнаяСтрока(
				НСтр("ru='Настройте товарные группы и загрузите номенклатуру'"),,
				ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС,,
				"НастройкаПодключенияУТМ");
			КонецЕсли;
		
		Элементы[СтрШаблон("%1%2", "ГруппаДекорацияСостояниеОбмена",Суффикс)].Видимость = Истина;
		Элементы[СтрШаблон("%1%2", "НадписьСостояниеОбмена",Суффикс)].Видимость         = Истина;
		
		Если ЭтоИнтерфейс85 Тогда
			УстановитьУсловноеОформлениеГруппыСостояниеОбменаНаСервере();
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	ВозможныеПроблемыПроверкаГИСМТ     = СоответствиеТребованиямГИСМТ.ВозможныеПроблемыОбмена();
	
	Приоритеты            = ВозможныеПроблемыПроверкаГИСМТ.Приоритет;
	ИдентификаторыПроблем = ВозможныеПроблемыПроверкаГИСМТ.Идентификаторы;
	Представления         = ВозможныеПроблемыПроверкаГИСМТ.Представления;
	
	Для Каждого Приоритет Из Приоритеты Цикл
		ИдентификаторПроблемы = ИдентификаторыПроблем[Приоритет];
		
		Проблемы = РезультатыЗапроса[ИдентификаторПроблемы].Выбрать();
		ОписаниеПроблемы = Представления.Получить(ИдентификаторПроблемы);
		
		Если Проблемы.Количество() > 0 Тогда
			Если ПерваяПроблема <> Неопределено Тогда
				ЕщеПроблемы = ЕщеПроблемы + 1;
			Иначе
				Проблемы.Следующий();
				
				ПерваяПроблема = СтрШаблон(
					ОписаниеПроблемы,
					Проблемы.Количество);
				ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
					ПерваяПроблема,,,,
					ИдентификаторПроблемы);
				
				Элементы[СтрШаблон("%1%2", "ГруппаДекорацияСостояниеОбмена",Суффикс)].ТекущаяСтраница = Элементы[СтрШаблон("%1%2", "СостояниеОбменаКрасный",Суффикс)];
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	
	Если Не СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации()
		И Не ОбщегоНазначения.РазделениеВключено()
		И Не ИнтеграцияИС.ХранитьФайлыВТомахНаДиске() Тогда
		Если ПерваяПроблема <> Неопределено Тогда
			ЕщеПроблемы = ЕщеПроблемы + 1;
		Иначе
			ПерваяПроблема = НСтр("ru='Рекомендуется настроить хранение файлов в томах на диске'");
			ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
				ПерваяПроблема,,,,
				"ХранитьФайлыВТомахНаДиске");
			Элементы[СтрШаблон("%1%2", "ГруппаДекорацияСостояниеОбмена",Суффикс)].ТекущаяСтраница = Элементы[СтрШаблон("%1%2", "СостояниеОбменаЖелтый",Суффикс)];
			
			ТекстПодсказки = Новый Массив;
			ТекстПодсказки = НСтр("ru='Файлы обмена могут занимать значительный объем данных в базе.
			|Для уменьшения объема базы данных, файлы необходимо хранить в томах на диске.'");
			
			Если Не ПравоДоступаНастройкиРаботыСФайлами() Тогда
				ТекстПодсказки = ТекстПодсказки + Символы.ПС
					+ НСтр("ru='У Вас недостачно прав для выполнения данной операции, обратитесь к администратору.'");
			КонецЕсли;
			ТекстПодсказкиФорматированнаяСтрока = ТекстПодсказки;
			
		КонецЕсли;
	КонецЕсли;
	
	Проблемы = РезультатыЗапроса["ЕстьСообщенияОжидающиеОтправки"].Выбрать();
	Если Проблемы.Количество() > 0 Тогда
		
		Если ПерваяПроблема <> Неопределено Тогда
			ЕщеПроблемы = ЕщеПроблемы + 1;
		Иначе
			Проблемы.Следующий();
			ПерваяПроблема = СтрШаблон(
				НСтр("ru = 'Есть сообщения (%1), ожидающие отправки в ИС МП. Выполните обмен.'"),
				Проблемы.КоличествоСообщений);
			ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
				СтрШаблон(
					НСтр("ru = 'Есть сообщения (%1), ожидающие отправки в ИС МП.'"),
					Проблемы.КоличествоСообщений),,,,
				"ЕстьСообщенияОжидающиеОтправки");
			Элементы[СтрШаблон("%1%2", "ГруппаДекорацияСостояниеОбмена",Суффикс)].ТекущаяСтраница = Элементы[СтрШаблон("%1%2", "СостояниеОбменаИнформация",Суффикс)];
			ТекстПодсказки = Новый Массив;
			ТекстПодсказки.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru = 'Не все подготовленные для отправки сообщения доставлены в ИС МП. Рекомендуется'")));
			ТекстПодсказки.Добавить(" ");
			ТекстПодсказки.Добавить(
				Новый ФорматированнаяСтрока(
					Нстр("ru='выполнить обмен'"),,,, "ВыполнитьОбмен"));
			ТекстПодсказки.Добавить(".");
			
			ТекстПодсказкиФорматированнаяСтрока = Новый ФорматированнаяСтрока(ТекстПодсказки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИдентификаторыИПредставлениеПроблемыНастроитьРегЗадание = ИдентификаторыИПредставлениеПроблемыНастроитьРегЗадание();
	Для Каждого ЭлементКоллекции Из ИдентификаторыИПредставлениеПроблемыНастроитьРегЗадание Цикл
		
		Проблемы = РезультатыЗапроса[ЭлементКоллекции.Ключ].Выбрать();
		
		Если Проблемы.Количество() = 0 Тогда
			
			Если ПерваяПроблема <> Неопределено Тогда
				ЕщеПроблемы = ЕщеПроблемы + 1;
			Иначе
				
				ПерваяПроблема = ЭлементКоллекции.Значение;
				ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
					ПерваяПроблема,,,,
					ЭлементКоллекции.Ключ);
				
				Элементы[СтрШаблон("%1%2", "ГруппаДекорацияСостояниеОбмена",Суффикс)].ТекущаяСтраница
					= Элементы[СтрШаблон("%1%2", "СостояниеОбменаЖелтый",Суффикс)];
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИдентификаторыИПредставлениеПроблемыПрочиеНастройки = ИдентификаторыИПредставлениеПроблемыПрочиеНастройки();
	Для Каждого ЭлементКоллекции Из ИдентификаторыИПредставлениеПроблемыПрочиеНастройки Цикл
		
		Проблемы = РезультатыЗапроса[ЭлементКоллекции.Ключ].Выбрать();
		
		Если Проблемы.Количество() > 0 Тогда
			
			Если ПерваяПроблема <> Неопределено Тогда
				ЕщеПроблемы = ЕщеПроблемы + 1;
			Иначе
				
				ПерваяПроблема = ЭлементКоллекции.Значение;
				ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
					ПерваяПроблема,,,,
					ЭлементКоллекции.Ключ);
				Элементы[СтрШаблон("%1%2", "ГруппаДекорацияСостояниеОбмена",Суффикс)].ТекущаяСтраница
					= Элементы[СтрШаблон("%1%2", "СостояниеОбменаЖелтый",Суффикс)];
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Проблемы = РезультатыЗапроса["СведенияОбОтклоненияхОжидающиеДействия"].Выбрать();
	Если Проблемы.Количество() > 0 Тогда
		Если ПерваяПроблема <> Неопределено Тогда
			ЕщеПроблемы = ЕщеПроблемы + 1;
		Иначе
			Проблемы.Следующий();
			ПерваяПроблема = СтрШаблон(
				НСтр("ru='Есть отчеты ИС МП (%1), ожидающие обработки сведений об отклонениях.'"),
				Проблемы.КоличествоДокументов);
			
			ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
				ПерваяПроблема,,,,
				"СведенияОбОтклоненияхОжидающиеДействия");
			
			Элементы[СтрШаблон("%1%2", "ГруппаДекорацияСостояниеОбмена",Суффикс)].ТекущаяСтраница = Элементы[СтрШаблон("%1%2", "СостояниеОбменаЖелтый",Суффикс)];
		КонецЕсли;
	КонецЕсли;
	
	Если ПерваяПроблема <> Неопределено Тогда
		
		Если ЕщеПроблемы > 0 Тогда
			ТекстЗаголовка = СтрШаблон(НСтр("ru='%1 ( + еще %2 )'"), ПерваяПроблема, ЕщеПроблемы);
			Элементы[СтрШаблон("%1%2", "НадписьСостояниеОбмена",Суффикс)].Заголовок = Новый ФорматированнаяСтрока(
				ТекстЗаголовка,,,,
				"ОткрытьПанельСостоянияОбмена");
		Иначе
			Элементы[СтрШаблон("%1%2", "НадписьСостояниеОбмена",Суффикс)].Заголовок = ПерваяПроблемаФорматированнаяСтрока;
			Если ТекстПодсказкиФорматированнаяСтрока <> Неопределено Тогда
				Элементы[СтрШаблон("%1%2", "НадписьСостояниеОбмена",Суффикс)].ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
				Элементы[СтрШаблон("%1%2%3", "НадписьСостояниеОбмена", Суффикс, "РасширеннаяПодсказка")].Заголовок =
					ТекстПодсказкиФорматированнаяСтрока;
			КонецЕсли;
		КонецЕсли;
		
		Элементы[СтрШаблон("%1%2", "ГруппаДекорацияСостояниеОбмена",Суффикс)].Видимость = Истина;
		Элементы[СтрШаблон("%1%2", "НадписьСостояниеОбмена",Суффикс)].Видимость         = Истина;
		
		УстановитьУсловноеОформлениеГруппыСостояниеОбменаНаСервере();
		
	Иначе
		Элементы[СтрШаблон("%1%2", "ГруппаДекорацияСостояниеОбмена",Суффикс)].Видимость = Ложь;
		Элементы[СтрШаблон("%1%2", "НадписьСостояниеОбмена",Суффикс)].Видимость         = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДокумент(Таблица, ОбъектМетаданных, Заголовок, Оформите, Отработайте, Ожидайте,
	ИмяЭлементаФормы = "", ТекстОтборДокументов = "")
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Метаданные  = ОбъектМетаданных;
	НоваяСтрока.Заголовок   = Заголовок;
	
	ОпцияВключена = ИнтеграцияИСМППовтИсп.ОбъектМетаданныхДоступен(ОбъектМетаданных.ПолноеИмя());
	
	НоваяСтрока.ЕстьПравоЧтение         = ОпцияВключена И ПравоДоступа("Чтение",         ОбъектМетаданных);
	НоваяСтрока.ЕстьПравоДобавление     = ОпцияВключена И ПравоДоступа("Добавление",     ОбъектМетаданных);
	НоваяСтрока.ЕстьПравоРедактирование = ОпцияВключена И ПравоДоступа("Редактирование", ОбъектМетаданных);
	
	НоваяСтрока.Оформите      = Оформите;
	НоваяСтрока.Отработайте   = Отработайте;
	НоваяСтрока.Ожидайте      = Ожидайте;
	НоваяСтрока.ИмяЭлемента   = ИмяЭлементаФормы;
	НоваяСтрока.ТекстОтборДокументов = ТекстОтборДокументов;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаОтработайте(МетаданныеДокументаИСМП, ДополнительныйОтбор = "")
	
	ТекстЗапроса = ТекстЗапросаКоличестваДокументовПоДальнейшемуДействию(
		МетаданныеДокументаИСМП,
		"&ВсеТребующиеДействия",
		ДополнительныйОтбор);
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаОжидайте(МетаданныеДокументаИСМП, ДополнительныйОтбор = "")
	
	ТекстЗапроса = ТекстЗапросаКоличестваДокументовПоДальнейшемуДействию(
		МетаданныеДокументаИСМП,
		"&ВсеТребующиеОжидания",
		ДополнительныйОтбор);
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаОформите(МетаданныеДокументаИСМП)
	
	ТипыДокументаОснования     = ИнтеграцияИС.РеквизитДокументОснованиеДокументаИС(МетаданныеДокументаИСМП).Тип.Типы();
	СтрокиСоединенияДокументов = Новый Массив;
	СтрокиОтбораДокументов     = Новый Массив;
	
	Для Каждого ТипОснования Из ТипыДокументаОснования Цикл
		
		МетаданныеОснования = Метаданные.НайтиПоТипу(ТипОснования);
		
		Если МетаданныеОснования = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПравоДоступа("Чтение", МетаданныеОснования) Тогда
			Продолжить;
		КонецЕсли;
		
		// Добавим соединение с документом-основанием для RLS.
		СтрокиСоединенияДокументов.Добавить("	ЛЕВОЕ СОЕДИНЕНИЕ Документ." + МетаданныеОснования.Имя + " КАК Документ" + МетаданныеОснования.Имя + "
			|		ПО Статусы.Основание = Документ" + МетаданныеОснования.Имя + ".Ссылка");
		
		СтрокиОтбораДокументов.Добавить("Документ" + МетаданныеОснования.Имя + ".Ссылка ЕСТЬ НЕ NULL");
		
	КонецЦикла;
	
	Если СтрокиОтбораДокументов.Количество() = 0 Тогда
		
		// Нет ни одного доступного документа-основания.
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	0 КАК КоличествоДокументов";
		
	Иначе
		
		ТекстСоединения = СтрСоединить(СтрокиСоединенияДокументов, Символы.ПС);
		ТекстОтбора 	= " И (" + СтрСоединить(СтрокиОтбораДокументов, Символы.ПС + "		ИЛИ ") + ")";
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Статусы.Основание) КАК КоличествоДокументов
		|ИЗ
		|	РегистрСведений.СтатусыОформленияДокументовИСМП КАК Статусы
		|%2
		|ГДЕ
		|	Статусы.Документ = ЗНАЧЕНИЕ(Документ.%1.ПустаяСсылка)
		|	И Статусы.СтатусОформления В
		|		(ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовГосИС.НеОформлено),
		|		 ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовГосИС.ОформленоЧастично),
		|		 ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовГосИС.ЕстьОшибкиОформления),
		|		 ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовГосИС.ТребуетсяСопоставлениеНоменклатуры))
		|	И НЕ Статусы.Архивный
		|	И (&БезОтбораПоОрганизации  ИЛИ Статусы.Контрагент В(&Организации))
		|	%3";
		
		ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстЗапроса,
			МетаданныеДокументаИСМП.Имя,
			ТекстСоединения,
			ТекстОтбора);
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаКоличестваДокументовПоДальнейшемуДействию(МетаданныеДокументаИСМП, ОтборДействия, ДополнительныйОтбор)
	
	МетаРеквизитОснование = ИнтеграцияИС.РеквизитДокументОснованиеДокументаИС(МетаданныеДокументаИСМП);
	
	ТекстСоединения = "";
	ТекстОтбора     = "";
	
	Если МетаРеквизитОснование <> Неопределено Тогда
		
		ТипыДокументаОснования     = МетаРеквизитОснование.Тип.Типы();
		СтрокиСоединенияДокументов = Новый Массив;
		СтрокиОтбораДокументов     = Новый Массив;
		ДокументИмеетОснования     = Ложь;
		
		Для Каждого ТипОснования Из ТипыДокументаОснования Цикл
			
			МетаданныеОснования = Метаданные.НайтиПоТипу(ТипОснования);
			
			Если МетаданныеОснования = Неопределено Тогда
				Продолжить
			ИначеЕсли Не Метаданные.Документы.Содержит(МетаданныеОснования) Тогда
				Продолжить;
			Иначе
				ДокументИмеетОснования = Истина;
			КонецЕсли;
			Если НЕ ПравоДоступа("Чтение", МетаданныеОснования) Тогда
				Продолжить;
			КонецЕсли;
			
			// Добавим соединение с документом-основанием для RLS.
			СтрокиСоединенияДокументов.Добавить(
				"	ЛЕВОЕ СОЕДИНЕНИЕ Документ." + МетаданныеОснования.Имя + " КАК Документ" + МетаданныеОснования.Имя + "
				|		ПО ДокументИСМП.ДокументОснование = Документ" + МетаданныеОснования.Имя + ".Ссылка");
			
			СтрокиОтбораДокументов.Добавить("Документ" + МетаданныеОснования.Имя + ".Ссылка ЕСТЬ НЕ NULL");
			
		КонецЦикла;
		
		Если ДокументИмеетОснования Тогда
			
			Если СтрокиОтбораДокументов.Количество() = 0 Тогда
				ТекстСоединения = "";
			Иначе
				ТекстСоединения = СтрСоединить(СтрокиСоединенияДокументов, Символы.ПС);
			КонецЕсли;
			
			СтрокиОтбораДокументов.Добавить("ДокументИСМП.ДокументОснование В (&ПустойДокументОснование)");
			ТекстОтбора = " И (" + СтрСоединить(СтрокиОтбораДокументов, Символы.ПС + "		ИЛИ ") + ")";
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО (РАЗЛИЧНЫЕ СтатусыДокументовИСМП.Документ) КАК КоличествоДокументов
	|ИЗ
	|	РегистрСведений.СтатусыДокументовИСМП КАК СтатусыДокументовИСМП
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.%1 КАК ДокументИСМП
	|		ПО СтатусыДокументовИСМП.Документ = ДокументИСМП.Ссылка
	|%2
	|ГДЕ
	|	СтатусыДокументовИСМП.ДальнейшееДействие1 В (%3)
	|	И НЕ ДокументИСМП.ПометкаУдаления
	|	И (&БезОтбораПоОрганизации ИЛИ ДокументИСМП.Организация В(&Организации))
	|	И (&БезОтбораПоОтветственным ИЛИ ДокументИСМП.Ответственный = &Ответственный)
	|	%4
	|	%5";
	
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ТекстЗапроса,
		МетаданныеДокументаИСМП.Имя,
		ТекстСоединения,
		ОтборДействия,
		ТекстОтбора,
		ДополнительныйОтбор);
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьРасчетПроблем()
	
	ОбработатьРезультатЗапускаРасчетаПроблем(
		ИнтеграцияИСМПВызовСервера.ЗапуститьРасчетПроблем(УникальныйИдентификатор));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗапускаРасчетаПроблем(Результат) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
		ПараметрыОжидания.ТекстСообщения             = НСтр("ru='Выполняется расчет проблем'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
		ПараметрыОжидания.ВыводитьОкноОжидания       = Ложь;
		ПараметрыОжидания.ВыводитьСообщения          = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			Результат,
			Новый ОписаниеОповещения("ПослеЗавершенияРасчетаПроблем", ЭтотОбъект),
			ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияРасчетаПроблем(Результат, ДополнительныеПараметрыДлительнойОперации) Экспорт
	
	Если Результат = Неопределено Тогда // отменено пользователем
		Если ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для Каждого СообщениеПользователю Из Результат.Сообщения Цикл
			СообщениеПользователю.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если ЗначениеЗаполнено(РезультатВыполнения.ТекстОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатВыполнения.ТекстОшибки);
		ИначеЕсли РезультатВыполнения.ЕстьИзменения Тогда
			ОтобразитьСостояниеОбмена();
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДокументыЭДО

&НаСервере
Функция ПараметрыОтбораВходящиеКОтработке()
	
	МодульЭДО = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиКлиентСервер");
	ПараметрыОтбора = МодульЭДО.ПараметрыОтбораТекущихДелЭДО();
	ПараметрыОтбора.РежимОтображения = МодульЭДО.РежимыОтображенияТекущихДелЭДО().КИсполнению;
	ПараметрыОтбора.Раздел           = МодульЭДО.РазделыТекущихДелЭДО().Входящие;
	
	Если ЗначениеЗаполнено(Организации) Тогда
		НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("Организация", ВидСравненияКомпоновкиДанных.ВСписке, Организации);
		ПараметрыОтбора.ОтборВходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	КонецЕсли;
	
	НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("СодержитМаркируемыеТовары", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ПараметрыОтбора.ОтборВходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	
	Возврат ПараметрыОтбора;

КонецФункции

&НаСервере
Функция ПараметрыОтбораВходящиеОжидание()
	
	МодульЭДО = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиКлиентСервер");
	ПараметрыОтбора = МодульЭДО.ПараметрыОтбораТекущихДелЭДО();
	ПараметрыОтбора.РежимОтображения = МодульЭДО.РежимыОтображенияТекущихДелЭДО().МоиДокументы;
	ПараметрыОтбора.Раздел           = МодульЭДО.РазделыТекущихДелЭДО().НаКонтролеВходящие;
	
	Если ЗначениеЗаполнено(Организации) Тогда
		НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("Организация", ВидСравненияКомпоновкиДанных.ВСписке, Организации);
		ПараметрыОтбора.ОтборВходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	КонецЕсли;
	
	НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("СодержитМаркируемыеТовары", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ПараметрыОтбора.ОтборВходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	
	Возврат ПараметрыОтбора;

КонецФункции

&НаСервере
Функция ПараметрыОтбораВходящие()
	
	МодульЭДО = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиКлиентСервер");
	ПараметрыОтбора = МодульЭДО.ПараметрыОтбораТекущихДелЭДО();
	ПараметрыОтбора.РежимОтображения = МодульЭДО.РежимыОтображенияТекущихДелЭДО().ВсеДокументы;
	ПараметрыОтбора.Раздел           = МодульЭДО.РазделыТекущихДелЭДО().Входящие;
	
	Если ЗначениеЗаполнено(Организации) Тогда
		НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("Организация", ВидСравненияКомпоновкиДанных.ВСписке, Организации);
		ПараметрыОтбора.ОтборВходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	КонецЕсли;
	
	НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("СодержитМаркируемыеТовары", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ПараметрыОтбора.ОтборВходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	
	Возврат ПараметрыОтбора;

КонецФункции

&НаСервере
Функция ПараметрыОтбораИсходящиеКОформлению()
	
	МодульЭДО = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиКлиентСервер");
	ПараметрыОтбора = МодульЭДО.ПараметрыОтбораТекущихДелЭДО();
	ПараметрыОтбора.РежимОтображения = МодульЭДО.РежимыОтображенияТекущихДелЭДО().ВсеДокументы;
	ПараметрыОтбора.Раздел           = МодульЭДО.РазделыТекущихДелЭДО().Создать;
	
	НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("Ссылка", ВидСравненияКомпоновкиДанных.ВСписке, УчетныеДокументыТребующиеОформления(Организации));
	ПараметрыОтбора.ОтборВРазделеСоздать.Добавить(НовыйЭлементОтбора);

	Возврат ПараметрыОтбора;

КонецФункции

&НаСервере
Функция ПараметрыОтбораИсходящиеКОтработке()
	
	МодульЭДО = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиКлиентСервер");
	ПараметрыОтбора = МодульЭДО.ПараметрыОтбораТекущихДелЭДО();
	ПараметрыОтбора.РежимОтображения = МодульЭДО.РежимыОтображенияТекущихДелЭДО().КИсполнению;
	ПараметрыОтбора.Раздел           = МодульЭДО.РазделыТекущихДелЭДО().Исходящие;

	Если ЗначениеЗаполнено(Организации) Тогда
		НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("Организация", ВидСравненияКомпоновкиДанных.ВСписке, Организации);
		ПараметрыОтбора.ОтборИсходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	КонецЕсли;
	
	НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("СодержитМаркируемыеТовары", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ПараметрыОтбора.ОтборИсходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	
	Возврат ПараметрыОтбора;

КонецФункции

&НаСервере
Функция ПараметрыОтбораИсходящиеОжидание()
	
	МодульЭДО = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиКлиентСервер");
	ПараметрыОтбора = МодульЭДО.ПараметрыОтбораТекущихДелЭДО();
	ПараметрыОтбора.РежимОтображения = МодульЭДО.РежимыОтображенияТекущихДелЭДО().МоиДокументы;
	ПараметрыОтбора.Раздел           = МодульЭДО.РазделыТекущихДелЭДО().НаКонтролеИсходящие;

	Если ЗначениеЗаполнено(Организации) Тогда
		НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("Организация", ВидСравненияКомпоновкиДанных.ВСписке, Организации);
		ПараметрыОтбора.ОтборИсходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	КонецЕсли;
	
	НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("СодержитМаркируемыеТовары", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ПараметрыОтбора.ОтборИсходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	
	Возврат ПараметрыОтбора;

КонецФункции

&НаСервере
Функция ПараметрыОтбораИсходящие()
	
	МодульЭДО = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиКлиентСервер");
	ПараметрыОтбора = МодульЭДО.ПараметрыОтбораТекущихДелЭДО();
	ПараметрыОтбора.РежимОтображения = МодульЭДО.РежимыОтображенияТекущихДелЭДО().ВсеДокументы;
	ПараметрыОтбора.Раздел           = МодульЭДО.РазделыТекущихДелЭДО().Исходящие;

	Если ЗначениеЗаполнено(Организации) Тогда
		НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("Организация", ВидСравненияКомпоновкиДанных.ВСписке, Организации);
		ПараметрыОтбора.ОтборИсходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	КонецЕсли;
	
	НовыйЭлементОтбора = МодульЭДО.НовыйЭлементОтбораТекущихДелЭДО("СодержитМаркируемыеТовары", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ПараметрыОтбора.ОтборИсходящихЭлектронныхДокументов.Добавить(НовыйЭлементОтбора);
	
	Возврат ПараметрыОтбора;

КонецФункции

// Заполняет параметры открытия формы обмена ЭДО с действующими фильтрами по организациям и маркируемой продукции.
//   См Обработка.ОбменСКонтрагентами.Форма.ТекущиеДелаПоЭДО.
//
// Параметры:
//   Организации - Массив Из ОпределяемыйТип.Организация - фильтр по организациям
// Возвращаемое значение:
//   Структура - общие параметры открытия формы:
// * ОтборИсходящихДокументов - Массив               - отбор исходящих документов ЭДО
// * ОтборВходящихДокументов  - Массив               - отбор входящих документов ЭДО
// * ОтборУчетныхДокументов   - Массив               - отбор учетных документов (к оформлению в ЭДО)
// * Раздел                   - Строка, Неопределено - начальная страница отображения
// * РежимОтображения         - Строка               - начальный режим отображения
//
&НаСервереБезКонтекста
Функция ПараметрыОткрытияПанелиЭДОИзИСМП(Знач Организации)
	
	Результат = Новый Структура;
	Результат.Вставить("РежимОтображения", "ВсеДокументы");
	Результат.Вставить("Раздел", Неопределено);
	Результат.Вставить("ОтборУчетныхДокументов", ОтборУчетныхДокументов(Организации)); 
	Результат.Вставить("ОтборВходящихДокументов", Новый Массив);
	Результат.Вставить("ОтборИсходящихДокументов", Новый Массив);
	Результат.ОтборВходящихДокументов.Добавить(Новый Структура("Поле,ВидСравнения,Значение",
		"ЭлектронныйДокумент.СодержитДанныеОМаркируемыхТоварах", ВидСравненияКомпоновкиДанных.Равно, Истина));
	Результат.ОтборИсходящихДокументов.Добавить(Новый Структура("Поле,ВидСравнения,Значение",
		"ЭлектронныйДокумент.СодержитДанныеОМаркируемыхТоварах", ВидСравненияКомпоновкиДанных.Равно, Истина));
	Если Организации.Количество() Тогда
		Результат.ОтборВходящихДокументов.Добавить(Новый Структура("Поле,ВидСравнения,Значение",
			"Организация", ВидСравненияКомпоновкиДанных.ВСписке, Организации));
		Результат.ОтборИсходящихДокументов.Добавить(Новый Структура("Поле,ВидСравнения,Значение",
			"Организация", ВидСравненияКомпоновкиДанных.ВСписке, Организации));
	КонецЕсли;
	ЭлектронноеВзаимодействиеИСМППереопределяемый.ДополнитьПараметрыОткрытияПанелиЭДОИзИСМП(Результат);
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция УчетныеДокументыТребующиеОформления(Организации)
	
	УчетныеДокументыТребующиеФормированияЭД = Новый СписокЗначений;
	
	ЗапросСсылок = Новый Запрос;
	Если ЭлектронноеВзаимодействиеИСМП.ВерсияАПИ() = 1 Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СостоянияЭД.СсылкаНаОбъект КАК Ссылка
		|ИЗ
		|	РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
		|ГДЕ
		|	СостоянияЭД.СостояниеЭДО = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.НеСформирован)
		|	И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Документ.УдалитьПроизвольныйЭД
		|	И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Документ.ТранспортныйКонтейнерЭДО
		|	И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Справочник.УдалитьСоглашенияОбИспользованииЭД
		|	И НЕ СостоянияЭД.СсылкаНаОбъект ССЫЛКА Справочник.НастройкиЭДО
		|	И (&БезОтбораПоОрганизации
		|	ИЛИ СостоянияЭД.Организация В (&Организации))";
	Иначе
		МодульЭДО = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентами");
		
		Отбор = Новый Структура;
		Если ЗначениеЗаполнено(Организации) Тогда
			Отбор.Вставить("Организация", "Организации");
		КонецЕсли;
		ТекстЗапроса = МодульЭДО.ТекстЗапросаОбъектовУчетаПодлежащихФормированиюЭлектронныхДокументов(Отбор, "ДокументыТребующиеОформления");
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ДокументыТребующиеОформления.Ссылка
		|ИЗ
		|	ДокументыТребующиеОформления КАК ДокументыТребующиеОформления";
	КонецЕсли;
	ЭлектронноеВзаимодействиеИСМППереопределяемый.ПриПолученииТекстаЗапросаНеоформленныхДокументовЭДО(ТекстЗапроса);
	
	ЗапросСсылок.Текст = ТекстЗапроса;
	ЗапросСсылок.УстановитьПараметр("Организации", Организации);
	ЗапросСсылок.УстановитьПараметр("БезОтбораПоОрганизации", Организации.Количество()=0);
	УстановитьПривилегированныйРежим(Истина);
	УчетныеДокументыТребующиеФормированияЭД.ЗагрузитьЗначения(ЗапросСсылок.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат УчетныеДокументыТребующиеФормированияЭД;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтборУчетныхДокументов(Организации)
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Поле,ВидСравнения,Значение",
		"Ссылка", ВидСравненияКомпоновкиДанных.ВСписке, УчетныеДокументыТребующиеОформления(Организации)));
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОтборПоОрганизации

&НаКлиенте
Функция ОповещениеВыбораОрганизаций()
	
	Возврат Новый ОписаниеОповещения("ПослеВыбораОрганизации", ЭтотОбъект);
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораОрганизации(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область ДокументыЭДО

&НаКлиенте
Функция ИмяФормыОбработкиОбменаПоЭДО()
	
	ИмяОбработки = "ОбменСКонтрагентами";
	Форма = "ТекущиеДелаПоЭДО";
	ЭлектронноеВзаимодействиеИСМПКлиентСерверПереопределяемый.ПриОпределенииИмениОбработкиОбменаПоЭДО(ИмяОбработки);
	ЭлектронноеВзаимодействиеИСМПКлиентСерверПереопределяемый.ПриОпределенииИмениФормыОбработкиОбменаПоЭДО(Форма);
	Возврат СтрШаблон("Обработка.%1.Форма.%2", ИмяОбработки, Форма);

КонецФункции

#КонецОбласти

#Область ЛогированиеЗапросов

&НаКлиенте
Процедура ВключитьЛогированиеЗапросов(ПродолжительностьВМинутах)
	
	ВключитьЛогированиеЗапросовНаСервере(ПродолжительностьВМинутах);
	ЛогированиеЗапросовИСМПКлиент.УстановитьПараметрыЛогированияНаКлиенте(ПараметрыЛогирования);
	ОбновитьПредставлениеЛогирования();
	
КонецПроцедуры

&НаСервере
Процедура ВключитьЛогированиеЗапросовНаСервере(ПродолжительностьВМинутах)
	
	ПараметрыЛогирования = ЛогированиеЗапросовИСМП.ПараметрыЛогированияЗапросов();
	ЛогированиеЗапросовИС.ВключитьЛогированиеЗапросов(ПараметрыЛогирования, ПродолжительностьВМинутах * 60);
	ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(ПараметрыЛогирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьЛогированиеЗапросов()
	
	ОтключитьЛогированиеЗапросовНаСервере();
	ЛогированиеЗапросовИСМПКлиент.УстановитьПараметрыЛогированияНаКлиенте(ПараметрыЛогирования);
	ОбновитьПредставлениеЛогирования();
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьЛогированиеЗапросовНаСервере()
	
	ЛогированиеЗапросовИСМП.ОтключитьЛогированиеЗапросов();
	
	ПараметрыЛогирования = ПолучитьПараметрыЛогирования();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЛогЗапросов()
	
	ЛогированиеЗапросовИС.ОчиститьЛогЗапросов(ПолучитьПараметрыЛогирования());
	ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(ПараметрыЛогирования);
	ПараметрыЛогирования = ПолучитьПараметрыЛогирования();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыЛогирования()
	
	ПараметрыЛогирования = ЛогированиеЗапросовИСМП.ПараметрыЛогированияЗапросов();
	ЛогированиеЗапросовИС.ЗаполнитьПараметрыЛогирования(ПараметрыЛогирования);
	
	Возврат ПараметрыЛогирования;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОбработкаОжиданияЗавершенияЛогирования()
	
	ПараметрыЛогирования = ПолучитьПараметрыЛогирования();
	ОбновитьПредставлениеЛогирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиЛогирования(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ВключитьЛогЗапросов" Тогда
		
		СписокПродолжительностьЛога = Новый СписокЗначений();
		СписокПродолжительностьЛога.Добавить(5,  НСтр("ru='5 мин.'"));
		СписокПродолжительностьЛога.Добавить(10, НСтр("ru='10 мин.'"));
		СписокПродолжительностьЛога.Добавить(15, НСтр("ru='15 мин.'"));
		
		ПараметрыВыбораПродолжительности = Новый Структура;
		ПараметрыВыбораПродолжительности.Вставить("РежимПродления", Ложь);
		
		ОповещениеОВыбора = Новый ОписаниеОповещения("ВыборПродолжительностьЛогаЗавершение", ЭтотОбъект, ПараметрыВыбораПродолжительности);
		ПоказатьВыборИзСписка(ОповещениеОВыбора, СписокПродолжительностьЛога, Элемент);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьЛогЗапросов" Тогда
		
		ЛогированиеЗапросовИСКлиент.ОткрытьПросмотрЛогаЗапросов(УникальныйИдентификатор, "ИСМП");
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ИзменитьВремяОкончанияЗаписиЛогов" Тогда
		
		СписокПродолжительностьЛога = Новый СписокЗначений();
		СписокПродолжительностьЛога.Добавить(5,  НСтр("ru='продлить на 5 мин.'"));
		СписокПродолжительностьЛога.Добавить(10, НСтр("ru='продлить на 10 мин.'"));
		СписокПродолжительностьЛога.Добавить(15, НСтр("ru='продлить на 15 мин.'"));
		
		ПараметрыВыбораПродолжительности = Новый Структура;
		ПараметрыВыбораПродолжительности.Вставить("РежимПродления", Истина);
		
		ОповещениеОВыбора = Новый ОписаниеОповещения("ВыборПродолжительностьЛогаЗавершение", ЭтотОбъект, ПараметрыВыбораПродолжительности);
		ПоказатьВыборИзСписка(ОповещениеОВыбора, СписокПродолжительностьЛога, Элемент);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтключитьЗаписьЛогов" Тогда
		
		ОтключитьЛогированиеЗапросов();
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОчиститьЛогЗапросов" Тогда
		
		ОписаниеОповещенияВопросОчиститьЛогЗапросовЗавершение = Новый ОписаниеОповещения("ОписаниеОповещенияВопросОчиститьЛогЗапросовЗавершение", ЭтотОбъект);
		
		ПоказатьВопрос(
			ОписаниеОповещенияВопросОчиститьЛогЗапросовЗавершение,
			НСтр("ru='Очистить лог запросов?'"),
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеЛогирования()
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбработкаОжиданияЗавершенияЛогирования");
	
	ДанныеОсновнойЧасти = Новый Массив();
	ДанныеПодсказки     = Новый Массив();
	ДанныеПодсказки.Добавить(НСтр("ru='Логирование запросов позволяет получить подробную'"));
	ДанныеПодсказки.Добавить(" ");
	ДанныеПодсказки.Добавить(НСтр("ru='техническую информацию по взаимодействию с ГИС МТ'"));
	ДанныеПодсказки.Добавить(" ");
	ДанныеПодсказки.Добавить(НСтр("ru='для расследования проблем и ошибок службами поддержки.'"));
	
	Если ПараметрыЛогирования.Включено Тогда
		
		Если ЗначениеЗаполнено(ПараметрыЛогирования.ОкончаниеЗаписи) Тогда
			ДатаЗавершенияЛогирования = ИнтеграцияИСКлиентСервер.ДатаИзУниверсальнойДаты(ПараметрыЛогирования.ОкончаниеЗаписи);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаЗавершенияЛогирования) Тогда
			
			ДанныеОсновнойЧасти.Добавить(НСтр("ru='Логирование запросов производится до'"));
			ДанныеОсновнойЧасти.Добавить(" ");
			
			Если НачалоДня(ТекущаяДата()) <> НачалоДня(ДатаЗавершенияЛогирования) Тогда
				ПредставлениеДаты = СтрШаблон(
					" (%1)",
					Формат(ДатаЗавершенияЛогирования, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
			
			ПредставлениеВремени = СтрШаблон(
				"%1%2",
				Формат(ДатаЗавершенияЛогирования, "ДФ=HH:mm;"),
				ПредставлениеДаты);
			
			ДанныеОсновнойЧасти.Добавить(
				Новый ФорматированнаяСтрока(
					ПредставлениеВремени,,,,
					"ИзменитьВремяОкончанияЗаписиЛогов"));
			
			Интервал = (ДатаЗавершенияЛогирования - ТекущаяДата()) + 10;
			Если Интервал <= 0 Тогда
				Интервал = 0.1;
			КонецЕсли;
			
			ПодключитьОбработчикОжидания(
				"Подключаемый_ОбработкаОжиданияЗавершенияЛогирования",
				Интервал,
				Истина);
			
		Иначе
			
			ДанныеОсновнойЧасти.Добавить(НСтр("ru='Запись логов запросов продолжается'"));
			
		КонецЕсли;
		
		ДанныеОсновнойЧасти.Добавить(" ");
		ДанныеОсновнойЧасти.Добавить(
			Новый ФорматированнаяСтрока(
				НСтр("ru='Отключить'"),,,,
				"ОтключитьЗаписьЛогов"));
		
	Иначе
		
		ДанныеОсновнойЧасти.Добавить(НСтр("ru='Запись логов запросов не производится.'"));
		
		ДанныеОсновнойЧасти.Добавить(" ");
		ДанныеОсновнойЧасти.Добавить(
			Новый ФорматированнаяСтрока(
				НСтр("ru='Включить'"),,,,
				"ВключитьЛогЗапросов"));
		
	КонецЕсли;
	
	Если ПараметрыЛогирования.Включено
		Или ЗначениеЗаполнено(ПараметрыЛогирования.ОкончаниеЗаписи) Тогда
		
		ДанныеПодсказки.Добавить(Символы.ПС);
		
		ДанныеПодсказки.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru='Открыть'"),,,,
					"ОткрытьЛогЗапросов"));
		
		ДанныеПодсказки.Добавить(" ");
		
		ДанныеПодсказки.Добавить(
			Новый ФорматированнаяСтрока(
				НСтр("ru='Очистить'"),,,,
				"ОчиститьЛогЗапросов"));
		
	КонецЕсли;
	
	ПредставлениеЛогированияЗапросов = Новый ФорматированнаяСтрока(ДанныеОсновнойЧасти);
	Элементы.ПредставлениеЛогированияЗапросов.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(ДанныеПодсказки);
	
КонецПроцедуры

#КонецОбласти

#Область ОписанияОповещений

&НаКлиенте
Процедура ВыборПродолжительностьЛогаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Продолжительность = ВыбранныйЭлемент.Значение;
	Если ДополнительныеПараметры.РежимПродления
		И ЗначениеЗаполнено(ПараметрыЛогирования.ОкончаниеЗаписи) Тогда
		ДатаОкончания = ИнтеграцияИСКлиентСервер.ДатаИзУниверсальнойДаты(ПараметрыЛогирования.ОкончаниеЗаписи);
		Если ДатаОкончания > ТекущаяДата() Тогда
			Продолжительность = Цел((КонецМинуты(ДатаОкончания) - КонецМинуты(ТекущаяДата())) / 60 + Продолжительность);
		КонецЕсли;
	КонецЕсли;
	
	ВключитьЛогированиеЗапросов(Продолжительность);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОповещенияВопросОчиститьЛогЗапросовЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьЛогЗапросов();
	ОбновитьПредставлениеЛогирования();
	
	ПоказатьОповещениеПользователя(НСтр("ru='Лог запросов очищен.'"));
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьФормуПомощникНастройкиИСМП()
	
	ОткрытьФорму("Обработка.ПомощникНастройкиИСМП.Форма.ПомощникНастройкиИСМП");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторыИПредставлениеПроблемыПрочиеНастройки()
	
	Результат = Новый Соответствие;
	Результат.Вставить(
		"НастройкаСертификатаНаСервере",
		НСтр("ru='Рекомендуется настроить сертификаты на сервере для автоматического подписания сообщений'"));
	Результат.Вставить(
		"НастройкаОтветственныхЗаПодписаниеСообщений",
		НСтр("ru='Рекомендуется настроить ответственных за подписание сообщений'"));
	Результат.Вставить(
		"НастройкаНоменклатурыПоТНВЭДиОКПД2",
		НСтр("ru='Рекомендуется настроить номенклатуру по ТН ВЭД и ОКПД2'"));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИдентификаторыИПредставлениеПроблемыНастроитьРегЗадание()
	
	Результат = Новый Соответствие;
	Результат.Вставить(
		"НастроитьАвтоматическийОбмен",
		НСтр("ru='Рекомендуется настроить автоматический обмен с ИС МП'"));
	Результат.Вставить(
		"НастроитьАвтоматическуюПроверкуСтатусовДокументовВГИСМТ",
		НСтр("ru='Рекомендуется настроить автоматическую проверку статусов документов в ГИС МТ'"));
	Результат.Вставить(
		"НастроитьЗагрузкуСведенийОбОтклонениях",
		НСтр("ru='Рекомендуется настроить автоматическую загрузку сведений об отклонениях'"));
	Результат.Вставить(
		"НастроитьУдалениеНеиспользованныхКодовМаркировки",
		НСтр("ru='Рекомендуется настроить удаление кодов маркировки с истекшим сроком использования'"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеГруппыСостояниеОбменаНаСервере()
	
	ОформляемыеГруппыФормы = ОбщегоНазначенияИС.НоваяСтруктураОформляемыхГруппФормы();
	Если ПараметрыАварийногоРежима <> Неопределено
		И ПараметрыАварийногоРежима.Включено Тогда
		ОформляемыеГруппыФормы.Ошибка = "ГруппаНадписи";
	ИначеЕсли Элементы.ГруппаДекорацияСостояниеОбмена.Видимость Тогда
		Если Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаЖелтый Тогда
			ОформляемыеГруппыФормы.Предупреждение = "ГруппаНадписи";
		ИначеЕсли Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаКрасный Тогда
			ОформляемыеГруппыФормы.Ошибка = "ГруппаНадписи";
		Иначе //СостояниеОбменаИнформация
			ОформляемыеГруппыФормы.Информация = "ГруппаНадписи";
		КонецЕсли;
	Иначе
		ОформляемыеГруппыФормы.ОчиститьОформление = "ГруппаНадписи";
	КонецЕсли;
	ОбщегоНазначенияИС.УстановитьОформлениеГруппФормы(ЭтотОбъект, ОформляемыеГруппыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПравоДоступаНастройкиРаботыСФайлами()
	
	Возврат ИнтеграцияИС.ПравоДоступаПанельАдминистрированиеБСП();
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовДляИнтерфейса85()
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85();
	Элементы.ГруппаНадписи.Видимость = ЭтоИнтерфейс85;
	Элементы.ГруппаИнформация.Видимость = Не ЭтоИнтерфейс85;
	ОтображатьКоманднуюПанель = ЭтоИнтерфейс85;
	
	Если Не ЭтоИнтерфейс85 Тогда
		ЦветТекстаПроблемаГосИС = ЦветаСтиля.ЦветТекстаПроблемаГосИС;
		ИнтеграцияИС.УстановитьОдиночныйВертикальныйИнтервалГруппыФормы(Элементы.ГруппаОсновное);
		Элементы.ГруппаПроизводство.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		Элементы.ГруппаЗакупки.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		Элементы.ГруппаЗакупки.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		Элементы.ГруппаПродажи.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		Элементы.ГруппаОтчеты.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		Элементы.ГруппаПроизводство.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
