///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Документ = Параметры.Документ;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Данные чеков: %1'"),
			Документ);
	
	РезультатОперации = ОФДСервис.ДанныеЧеков(Документ);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(РезультатОперации.СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеЧека Из РезультатОперации.ДанныеЧеков Цикл
		СтрокаЧека = ЧекиПоДокументу.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЧека, ДанныеЧека);
		СтрокаЧека.ПредставлениеЧека = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Номер чека в смене %1 от %2 (%3)'"),
			ДанныеЧека.НомерЧекаВСмене,
			ДанныеЧека.ДатаЧека,
			ДанныеЧека.ПризнакРасчета);
		СтрокаЧека.Просмотр = НСтр("ru = 'Просмотреть'");
		СтрокаЧека.Сохранение = НСтр("ru = 'Сохранить'");
	КонецЦикла;
	
	// ИнтерфейсТакси
	Если Не ИнтернетПоддержкаПользователейКлиентСервер.ЭтоИнтерфейс85() Тогда
		
		Элементы.ДанныеЧековСохранитьЧек.Видимость = Ложь;
		Элементы.ДанныеЧековПросмотретьЧек.Видимость = Ложь;
		
		ГруппаОперации = Элементы.Добавить(
			"ДанныеЧековОперации",
			Тип("ГруппаФормы"),
			Элементы.ДанныеЧеков);
		ГруппаОперации.Вид = ВидГруппыФормы.ГруппаКолонок;
		ГруппаОперации.Заголовок = НСтр("ru = 'Операции'");
		ГруппаОперации.ОтображатьЗаголовок = Истина;
		ГруппаОперации.ОтображатьВШапке = Истина;
		ГруппаОперации.ТолькоПросмотр = Истина;
		
		НовыйЭлемент = Элементы.Добавить(
			"ДанныеЧековПросмотр",
			Тип("ПолеФормы"),
			ГруппаОперации);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ЧекиПоДокументу.Просмотр";
		НовыйЭлемент.ГиперссылкаЯчейки = Истина;
		НовыйЭлемент.ОтображатьВШапке = Ложь;
		НовыйЭлемент.ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
		
		НовыйЭлемент = Элементы.Добавить(
			"ДанныеЧековСохранение",
			Тип("ПолеФормы"),
			ГруппаОперации);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ЧекиПоДокументу.Сохранение";
		НовыйЭлемент.ГиперссылкаЯчейки = Истина;
		НовыйЭлемент.ОтображатьВШапке = Ложь;
		НовыйЭлемент.ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
		
	КонецЕсли;
	// Конец ИнтерфейсТакси
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеЧеков

&НаКлиенте
Процедура ДанныеЧековПриАктивизацииЯчейки(Элемент)
	
	// ИнтерфейсТакси
	Если ИнтернетПоддержкаПользователейКлиентСервер.ЭтоИнтерфейс85() Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ДанныеЧековПросмотр"
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.UrlPdfЧека) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
			Элемент.ТекущиеДанные.UrlПросмотраЧека);
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ДанныеЧековСохранение"
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.UrlPdfЧека) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
			Элемент.ТекущиеДанные.UrlPdfЧека);
		КонецЕсли;
	// Конец ИнтерфейсТакси
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Просмотреть(Команда)
	
	Если Элементы.ДанныеЧеков.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
		Элементы.ДанныеЧеков.ТекущиеДанные.UrlПросмотраЧека);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЧек(Команда)
	
	Если Элементы.ДанныеЧеков.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
		Элементы.ДанныеЧеков.ТекущиеДанные.UrlPdfЧека);
	
КонецПроцедуры

#КонецОбласти
