
#Область ПрограммныйИнтерфейс

// Процедура - Устанавливает отбор по периоду в форме списка документов
//
// Параметры:
//  СписокОтбор		 - ОтборКомпоновкиДанных - Отбор элемента формы - списка
//  ДатаНачала		 - Дата					 - Дата начала периода отображения
//  ДатаОкончания	 - Дата					 - Дата окончания периода отображения
//  ИмяПоляОтбора	 - Строка				 - Имя поля отбора периода в панели отборов 
//
Процедура УстановитьОтборПоПериоду(СписокОтбор, ДатаНачала, ДатаОкончания, ИмяПоляОтбора = "Дата") Экспорт
	
	// Отбор на список по периоду
	ГруппаОтборПоПериоду = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		СписокОтбор.Элементы,
		"Период",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаОтборПоПериоду,
		ИмяПоляОтбора,
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
		ДатаНачала,
		"ДатаНачала",
		ЗначениеЗаполнено(ДатаНачала));
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаОтборПоПериоду,
		ИмяПоляОтбора,
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
		ДатаОкончания,
		"ДатаОкончания",
		ЗначениеЗаполнено(ДатаОкончания));
		
КонецПроцедуры

// Функция - Формирует представление периода для панели отборов
//
// Параметры:
//  Период	 - СтандартныйПериод - Период, для которого требуется сформировать представление
// 
// Возвращаемое значение:
//  Строка - Представление периода
//
Функция ОбновитьПредставлениеПериода(Период) Экспорт

	Если Не ЗначениеЗаполнено(Период) Или (Не ЗначениеЗаполнено(Период.ДатаНачала) И Не ЗначениеЗаполнено(
		Период.ДатаОкончания)) Тогда
		ПредставлениеПериода = НСтр("ru = 'Период: за все время'");
	Иначе
		ДатаОкончанияПериода = ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания),
			Период.ДатаОкончания);
		Если ДатаОкончанияПериода < Период.ДатаНачала Тогда
#Если Клиент Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр(
				"ru = 'Выбрана дата окончания периода, которая меньше даты начала'"));
#КонецЕсли
			ПредставлениеПериода = СтрШаблон(НСтр("ru = 'с %1'"), Формат(Период.ДатаНачала, "ДЛФ=D;"));
		Иначе
			ПредставлениеПериода = СтрШаблон(НСтр("ru = 'за %1'"), НРег(ПредставлениеПериода(Период.ДатаНачала,
				ДатаОкончанияПериода)));
		КонецЕсли;
	КонецЕсли;

	Возврат ПредставлениеПериода;

КонецФункции

Функция УбратьЗапрещенныеСимволы(Текст, Разрешенные) Экспорт
	
	Результат = Текст;
	Для Сч = 1 По СтрДлина(Текст) Цикл
		ТекСимвол = Сред(Текст, Сч, 1);
		Если СтрНайти(Разрешенные, НРег(ТекСимвол))=0 Тогда
			Результат = СтрЗаменить(Результат, ТекСимвол,"");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИмяОтбора(ЭлементИмя, ДанныеОтборов) Экспорт

	ИмяЭлемента = Прав(ЭлементИмя, СтрДлина(ЭлементИмя)-СтрНайти(ЭлементИмя,"_", НаправлениеПоиска.СНачала));
	НайденнаяСтрокаМассив = ДанныеОтборов.НайтиСтроки(Новый Структура("ИмяЭлемента", ИмяЭлемента));
	Если НайденнаяСтрокаМассив.Количество() > 0 Тогда
		Возврат НайденнаяСтрокаМассив[0].ИмяОтбора;
	Иначе
		Возврат ИмяЭлемента;
	КонецЕсли;
	
КонецФункции // ()

Процедура УстановитьОтображениеКомандыСброситьВсеОтборы(Форма, ИмяТЧДанныеМеток="ДанныеМеток", МассивНетиповыхОтборов = Неопределено) Экспорт
	
	Элементы = Форма.Элементы;
	ИмяМетки = СтрЗаменить(ИмяТЧДанныеМеток, "ДанныеМеток", "");
	ЭлементСброситьВсеОтборы = Элементы.Найти("СброситьВсеОтборы" + ИмяМетки);
	
	Если ЭлементСброситьВсеОтборы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеМеток = Форма[ИмяТЧДанныеМеток];
	Для каждого Метка Из ДанныеМеток Цикл
		
		ОтборИМеткиДоступны = Истина;
		
		Если Элементы.Найти(Метка.ИмяГруппыРодителя) <> Неопределено Тогда
			
			Для каждого ОтборИМетка Из Элементы[Метка.ИмяГруппыРодителя].ПодчиненныеЭлементы Цикл
				Если Не ОтборИМетка.Доступность Тогда
					ОтборИМеткиДоступны = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ОтборИМеткиДоступны = Ложь;
		КонецЕсли;
		
		Если ОтборИМеткиДоступны Тогда
			ЭлементСброситьВсеОтборы.Видимость = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеПоУмолчанию = Неопределено;
	СтруктураСвойств = Новый Структура("ОтборПериод" + ИмяМетки, ЗначениеПоУмолчанию);
	ЗаполнитьЗначенияСвойств(СтруктураСвойств, Форма);
	ЕстьРеквизитПериод = Не (СтруктураСвойств["ОтборПериод" + ИмяМетки] = ЗначениеПоУмолчанию);
	
	Если ЕстьРеквизитПериод И ЗначениеЗаполнено(Форма["ОтборПериод" + ИмяМетки]) Тогда
		ЭлементСброситьВсеОтборы.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	МассивНетиповыхОтборов = Новый Массив;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ИменаНетиповыхОтборов") Тогда
		
		МассивИмен = СтрРазделить(Форма.ИменаНетиповыхОтборов, ",");
		
		Для Каждого ИмяОтбора Из МассивИмен Цикл
			Если Не ПустаяСтрока(ИмяОтбора) Тогда
				МассивНетиповыхОтборов.Добавить(СокрЛП(ИмяОтбора));
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ПлатежнаяВедомость.Форма.ФормаСписка" Тогда
		МассивНетиповыхОтборов.Добавить("ОтборПериодРегистрации");
	КонецЕсли;
	
	Для каждого НетиповойОтбор Из МассивНетиповыхОтборов Цикл
		
		ЭтоБулевыйОтбор = (ТипЗнч(Форма[НетиповойОтбор]) = Тип("Булево"));
		
		Если ЭтоБулевыйОтбор И Форма[НетиповойОтбор] Или Не ЭтоБулевыйОтбор И ЗначениеЗаполнено(Форма[НетиповойОтбор]) Тогда
			ЭлементСброситьВсеОтборы.Видимость = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	ЭлементСброситьВсеОтборы.Видимость = Ложь;
	
КонецПроцедуры

// Конструктор структуры имен элементов правой панели
// Возвращаемое значение:
//  Структура:
//   * ПраваяПанельСтраницы - Строка
//   * ПраваяПанельСвернутая - Строка
//   * ПраваяПанель - Строка
//   * ИндексыФильтры - Строка
//
Функция ИменаЭлементовПравойПанели(Постфикс = "") Экспорт
	
	СтруктураИменЭлементов = Новый Структура;
	СтруктураИменЭлементов.Вставить("ПраваяПанель", "ПраваяПанель" + Постфикс);
	СтруктураИменЭлементов.Вставить("ПраваяПанельСтраницы", "ПраваяПанельСтраницы" + Постфикс);
	СтруктураИменЭлементов.Вставить("ПраваяПанельСвернутая", "ПраваяПанельСвернутая" + Постфикс);
	СтруктураИменЭлементов.Вставить("ФильтрыНастройкиИДопИнфо", "ФильтрыНастройкиИДопИнфо" + Постфикс);
	СтруктураИменЭлементов.Вставить("Контакты", "Контакты" + Постфикс);
	
	СтруктураИменЭлементов.Вставить("ЗначкиФильтры", "ЗначкиФильтры" + Постфикс);
	СтруктураИменЭлементов.Вставить("ЗначокФильтры", "ЗначокФильтры" + Постфикс);
	СтруктураИменЭлементов.Вставить("ИндексыФильтры", "ИндексыФильтры" + Постфикс);
	СтруктураИменЭлементов.Вставить("ИндексФильтры", "ИндексФильтры" + Постфикс);
	СтруктураИменЭлементов.Вставить("ИндексФильтрыТакси", "ИндексФильтрыТакси" + Постфикс);
	
	СтруктураИменЭлементов.Вставить("ЗначкиИерархия", "ЗначкиИерархия" + Постфикс);
	СтруктураИменЭлементов.Вставить("ЗначокИерархия", "ЗначокИерархия" + Постфикс);
	СтруктураИменЭлементов.Вставить("ИндексыИерархия", "ИндексыИерархия" + Постфикс);
	СтруктураИменЭлементов.Вставить("ИндексИерархия", "ИндексИерархия" + Постфикс);
	СтруктураИменЭлементов.Вставить("ИндексИерархияТакси", "ИндексИерархияТакси" + Постфикс);
	
	СтруктураИменЭлементов.Вставить("ОтборПериод", "ОтборПериод" + Постфикс);
	СтруктураИменЭлементов.Вставить("ПредставлениеПериода", "ПредставлениеПериода" + Постфикс);
	СтруктураИменЭлементов.Вставить("ПредставлениеПериодаТакси", "ПредставлениеПериодаТакси" + Постфикс);
	
	СтруктураИменЭлементов.Вставить("СброситьВсеОтборы", "СброситьВсеОтборы" + Постфикс);
	СтруктураИменЭлементов.Вставить("ГруппаОтступ", "ГруппаОтступ" + Постфикс);
	СтруктураИменЭлементов.Вставить("СвернутьПравуюПанель", "СвернутьПравуюПанель" + Постфикс);
	
	СтруктураИменЭлементов.Вставить("ИмяТЧДанныеМеток", "ДанныеМеток" + Постфикс);
	СтруктураИменЭлементов.Вставить("ИмяРеквизитаКоличествоФильтров", "КоличествоФильтров" + Постфикс);
	СтруктураИменЭлементов.Вставить("ИмяРеквизитаКоличествоФильтровИндекс", "КоличествоФильтровИндекс" + Постфикс);
	СтруктураИменЭлементов.Вставить("ИмяРеквизитаИерархияИндекс", "ИерархияИндекс" + Постфикс);
	
	Возврат СтруктураИменЭлементов;
	
КонецФункции

// Обновляет значения реквизитов формы КоличествоФильтров и КоличествоФильтровИндекс
//
// Параметры:
//  Форма			 -   ФормаКлиентскогоПриложения 
//  ИмяТЧДанныеМеток -   Строка - имя табличной части, в которой хранятся метки, значение по умолчанию - "ДанныеМеток"
//
Процедура ОбновитьКоличествоФильтров(Форма, ИмяТЧДанныеМеток = "ДанныеМеток") Экспорт //BG
	
	Постфикс = СтрЗаменить(ИмяТЧДанныеМеток, "ДанныеМеток", "");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "КоличествоФильтров" + Постфикс) Тогда
		ИмяРеквизитаКоличествоФильтров = "КоличествоФильтров" + Постфикс;
		ИмяРеквизитаКоличествоФильтровИндекс = "КоличествоФильтровИндекс" + Постфикс;
	Иначе
		ИмяРеквизитаКоличествоФильтров = "КоличествоФильтров";
		ИмяРеквизитаКоличествоФильтровИндекс = "КоличествоФильтровИндекс";
	КонецЕсли;
	
	ДанныеМеток = Форма[ИмяТЧДанныеМеток];
	КоличествоФильтров = ДанныеМеток.Количество();
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "КоличествоДопФильтров" + Постфикс) Тогда
		ИмяРеквизитаКоличествоДопФильтров = "КоличествоДопФильтров" + Постфикс;
	Иначе	
		ИмяРеквизитаКоличествоДопФильтров = "КоличествоДопФильтров";
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаКоличествоДопФильтров) Тогда
		КоличествоФильтров = КоличествоФильтров + Форма[ИмяРеквизитаКоличествоДопФильтров];
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОтборПериод" + Постфикс)
		И ЗначениеЗаполнено(Форма["ОтборПериод" + Постфикс]) Тогда
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаКоличествоФильтров) Тогда
		Форма[ИмяРеквизитаКоличествоФильтров] = КоличествоФильтров;
		Форма[ИмяРеквизитаКоличествоФильтровИндекс] = Мин(КоличествоФильтров, 10);
	КонецЕсли;
	
КонецПроцедуры

// Конструктор параметров для перехода к владельцу элемента списка в отборе.
// Для передачи параметром в РаботаСОтборамиКлиент.ПерейтиКРодителюВИерархии()
//
// Возвращаемое значение:
//   Структура:
//     * ИмяКолонкиИерархии - Строка - Имя колонки в списке иерархии
//     * ЗначениеЭлементаСпискаБезРодителя - Неопределено - Значение элемента списка без родителя
//     * ИмяРеквизитаИерархии - Строка - Имя реквизита формы списка иерархии
//     * ИмяЭлементаИерархии - Строка - Имя элемента формы списка иерархии
//     * ЗначениеИерархииБезРодителя - Строка - Значение элемента иерархии без родителя
//     * ИмяСтраницыИерархии - Строка - Имя страницы списка иерархии в панели отборов 
//     * ИмяГрупппыСтраницОтборов - Строка - Имя группы страниц отборов в панели отборов
//
Функция ПараметрыПереходаВИерархии() Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("ИмяРеквизитаИерархии",              "ОтборИерархия");
	Параметры.Вставить("ИмяЭлементаИерархии",               "ОтборИерархия");
	Параметры.Вставить("ЗначениеИерархииБезРодителя",       "БезГруппы");
	Параметры.Вставить("ИмяГрупппыСтраницОтборов",          "ПраваяПанельСтраницы");
	Параметры.Вставить("ИмяКолонкиИерархии",                "");
	Параметры.Вставить("ИмяСтраницыИерархии",               "");
	Параметры.Вставить("ЗначениеЭлементаСпискаБезРодителя", Неопределено);

	Возврат Параметры;
	
КонецФункции

#КонецОбласти


