
#Область СлужебныеПроцедурыИФункции

// Проверка статуса чека документа основания в сервисе облачная касса.
//
// Параметры:
//  ДокументОснование - ОпределяемыйТип.ДокументОперацииОблачнойКассы - ссылка на документ инициирующий пробитие чека.
//  УникальныйИдентификатор - УникальныйИдентификатор - уникальный идентификатор формы, во временное хранилище которой 
//                                                  необходимо поместить результат выполнения процедуры.
//
Функция ПолучитьСтатусЧекаВОблаке(ДокументОснование, УникальныйИдентификатор) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеОблачныеККТУНФ.ПолучитьСтатусЧекаВОблаке(
		ДокументОснование,
		УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти