#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Если Не НачальноеЗаполнениеЭлементовВыполнено() Тогда
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеНеОбработан();
		Элемент.Цвет = Новый ХранилищеЗначения(ЦветаПалитры.Синий);
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеВРаботе();
		Элемент.Цвет = Новый ХранилищеЗначения(ЦветаПалитры.Оранжевый);
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеВыставленСчет();
		Элемент.Цвет = Новый ХранилищеЗначения(ЦветаПалитры.Желтый);
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеНаВыполнении();
		Элемент.Цвет = Новый ХранилищеЗначения(ЦветаПалитры.Сиреневый);
		
	КонецЕсли;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Завершен";
	Элемент.Наименование = СостоянияЗаказов.СостояниеЗавершен();
	Элемент.Цвет = Новый ХранилищеЗначения(ЦветаПалитры.Серый);
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.УстановитьНовыйКод();
	
КонецПроцедуры

// Осветлить цвета и перенести в новый реквизит
// Версия 3.0.13
//
Процедура ОсветлитьЦветаПриОбновлении() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	СостоянияЗаказовПокупателей.Ссылка КАК Ссылка,
		|	СостоянияЗаказовПокупателей.Представление КАК Представление,
		|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
		|ИЗ
		|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей";
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			СостояниеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если СостояниеОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ЦветСостояния = СостояниеОбъект.Цвет.Получить();
			Если ТипЗнч(ЦветСостояния) <> Тип("Цвет") Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			НовыйЦвет = РаботаСЦветомСервер.ОсветленныйЦвет(ЦветСостояния.ПолучитьАбсолютный());
			НовыйЦвет = РаботаСЦветомСервер.ЯркийЦвет(НовыйЦвет);
			
			СостояниеОбъект.Заблокировать();
			СостояниеОбъект.Цвет = Новый ХранилищеЗначения(НовыйЦвет);
			СостояниеОбъект.УдалитьЦветСтарый = Новый ХранилищеЗначения(ЦветСостояния);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СостояниеОбъект);
			
			ЗафиксироватьТранзакцию();
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения = НСтр("ru='Не удалось обработать объект ""%1"" по причине:
			|%2'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Представление, ТекстОшибки);
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.СостоянияЗаказовПокупателей,
			Выборка.Ссылка,
			ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	ТекстСообщения = НСтр(
	"ru='Процедура ОсветлитьЦветаПриОбновлении успешно обработала объектов - %1, проблемных объектов - %2'",
	ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектовОбработано, ПроблемныхОбъектов);
	
	ЗаписьЖурналаРегистрации(
	ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.Справочники.СостоянияЗаказовПокупателей, ,
	ТекстСообщения);
	
КонецПроцедуры

// Вернуть старые оттенки цветов
// Версия 3.0.13
//
Процедура ВернутьСтарыеЦветаТекста() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	СостоянияЗаказовПокупателей.Ссылка КАК Ссылка,
		|	СостоянияЗаказовПокупателей.Представление КАК Представление
		|ИЗ
		|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей";
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			СостояниеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если СостояниеОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ЦветСостояния = СостояниеОбъект.Цвет.Получить();
			ЦветСтарый = СостояниеОбъект.УдалитьЦветСтарый.Получить();
			Если ТипЗнч(ЦветСостояния) <> Тип("Цвет") Или ТипЗнч(ЦветСтарый) <> Тип("Цвет") Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			СостояниеОбъект.Заблокировать();
			СостояниеОбъект.Цвет = Новый ХранилищеЗначения(ЦветСтарый);
			СостояниеОбъект.УдалитьЦветСтарый = Новый ХранилищеЗначения(ЦветСостояния);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СостояниеОбъект);
			
			ЗафиксироватьТранзакцию();
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения = НСтр("ru='Не удалось обработать объект ""%1"" по причине:
			|%2'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Представление, ТекстОшибки);
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.СостоянияЗаказовПокупателей,
			Выборка.Ссылка,
			ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	ТекстСообщения = НСтр(
	"ru='Процедура ВернутьСтарыеЦветаТекста успешно обработала объектов - %1, проблемных объектов - %2'",
	ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектовОбработано, ПроблемныхОбъектов);
	
	ЗаписьЖурналаРегистрации(
	ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.Справочники.СостоянияЗаказовПокупателей, ,
	ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей") Тогда
		Параметры.Вставить("ВидЗаказа", Справочники.ВидыЗаказовПокупателей.Основной);
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	КоличествоЭлементов = 15;
	ДобавлятьПорядок = Истина;
	ИсключатьСостоянияЗаявок = Истина;
	
	Запрос.Текст = ТекстЗапросаПолученияДанныхВыбора(
	Параметры, Запрос, ДобавлятьПорядок, КоличествоЭлементов, ИсключатьСостоянияЗаявок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерПоПорядку = 0;
	ЖирныйШрифт = Новый Шрифт(, , Истина);
	ОбычныйШрифт = Новый Шрифт();
	
	Пока Выборка.Следующий() Цикл
		
		НомерПоПорядку = НомерПоПорядку + 1;
		
		КомпонентыФС = Новый Массив;
		Если ДобавлятьПорядок Тогда
			
			Если ИсключатьСостоянияЗаявок Тогда
				НомерСостояния = Выборка.НомерСтроки;
			Иначе
				НомерСостояния = НомерПоПорядку;
			КонецЕсли;
			
			КомпонентыФС.Добавить(Строка(НомерСостояния) + ". ");
			
		КонецЕсли;
		
		Если Выборка.Состояние = Завершен Тогда
			Шрифт = ЖирныйШрифт;
		Иначе
			Шрифт = ОбычныйШрифт;
		КонецЕсли;
		
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(Выборка.Наименование, Шрифт));
		
		ПредставлениеСостояния = Новый ФорматированнаяСтрока(КомпонентыФС);
		ДанныеВыбора.Добавить(Выборка.Состояние, ПредставлениеСостояния);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора
			И Параметры.Свойство("ВидЗаказа") И ЗначениеЗаполнено(Параметры.ВидЗаказа) Тогда
				ВыбраннаяФорма = "Справочник.ВидыЗаказовПокупателей.Форма.ФормаСпискаЭтапов";
	Иначе
		ВыбраннаяФорма = "Справочник.СостоянияЗаказовПокупателей.Форма.ФормаСписка";
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПолученияДанныхВыбора(
	Параметры, Запрос, ДобавлятьПорядок, КоличествоЭлементов, ИсключатьСостоянияЗаявок)
	
	ОтображатьСостоянияЗаявок = Параметры.Свойство("ОтображатьСостоянияЗаявок");
	
	Если Параметры.Свойство("АвтоПодбор") И Параметры.АвтоПодбор = Истина Тогда 
		
		ИсключатьСостоянияЗаявок = Не ОтображатьСостоянияЗаявок
		И РаботаСЗаявками.ЗаявкиИспользуются(, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
		
		Если ИсключатьСостоянияЗаявок Тогда
			
			Результат = 
				"ВЫБРАТЬ
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние,
				|	МАКСИМУМ(ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки <= ВидыЗаказовПокупателей.НомерСостоянияЗаявки) КАК ЭтоСостояниеЗаявки
				|ПОМЕСТИТЬ втДоступныеСостоянияЗаказов
				|ИЗ
				|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
				|		ПО ВидыЗаказовПокупателейПорядокСостояний.Ссылка = ВидыЗаказовПокупателей.Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние
				|
				|ИМЕЮЩИЕ
				|	МАКСИМУМ(ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки <= ВидыЗаказовПокупателей.НомерСостоянияЗаявки) = ЛОЖЬ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
				|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
				|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
				|ГДЕ
				|	СостоянияЗаказовПокупателей.Наименование ПОДОБНО &Наименование
				|	И НЕ СостоянияЗаказовПокупателей.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
				|	И СостоянияЗаказовПокупателей.Ссылка В
				|			(ВЫБРАТЬ
				|				втДоступныеСостоянияЗаказов.Состояние КАК Состояние
				|			ИЗ
				|				втДоступныеСостоянияЗаказов КАК втДоступныеСостоянияЗаказов)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		Иначе
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
				|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
				|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
				|ГДЕ
				|	СостоянияЗаказовПокупателей.Наименование ПОДОБНО &Наименование
				|	И НЕ СостоянияЗаказовПокупателей.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Наименование", "%" + Параметры.СтрокаПоиска + "%");
		ДобавлятьПорядок = Ложь;
		
	ИначеЕсли Параметры.Свойство("ВидЗаказа") И ЗначениеЗаполнено(Параметры.ВидЗаказа) Тогда
		
		ИсключатьСостоянияЗаявок = Не ОтображатьСостоянияЗаявок
		И РаботаСЗаявками.ЗаявкиИспользуются(Параметры.ВидЗаказа);
		
		Если ИсключатьСостоянияЗаявок Тогда
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние,
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние.Наименование КАК Наименование,
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние.Цвет КАК Цвет,
				|	ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки КАК НомерСтроки
				|ИЗ
				|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
				|ГДЕ
				|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &ВидЗаказа
				|	И ВидыЗаказовПокупателейПорядокСостояний.Состояние.ПометкаУдаления = ЛОЖЬ
				|	И ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки > ВидыЗаказовПокупателейПорядокСостояний.Ссылка.НомерСостоянияЗаявки
				|
				|УПОРЯДОЧИТЬ ПО
				|	ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки";
			
		Иначе
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние,
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние.Наименование КАК Наименование,
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние.Цвет КАК Цвет
				|ИЗ
				|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
				|ГДЕ
				|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &ВидЗаказа
				|	И ВидыЗаказовПокупателейПорядокСостояний.Состояние.ПометкаУдаления = ЛОЖЬ
				|
				|УПОРЯДОЧИТЬ ПО
				|	ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки";
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВидЗаказа", Параметры.ВидЗаказа);
		
	Иначе
		
		ИсключатьСостоянияЗаявок = Не ОтображатьСостоянияЗаявок
		И РаботаСЗаявками.ЗаявкиИспользуются(, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
		
		Если ИсключатьСостоянияЗаявок Тогда
			
			Результат = 
				"ВЫБРАТЬ
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние,
				|	МАКСИМУМ(ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки <= ВидыЗаказовПокупателей.НомерСостоянияЗаявки) КАК ЭтоСостояниеЗаявки
				|ПОМЕСТИТЬ втДоступныеСостоянияЗаказов
				|ИЗ
				|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
				|		ПО ВидыЗаказовПокупателейПорядокСостояний.Ссылка = ВидыЗаказовПокупателей.Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние
				|
				|ИМЕЮЩИЕ
				|	МАКСИМУМ(ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки <= ВидыЗаказовПокупателей.НомерСостоянияЗаявки) = ЛОЖЬ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
				|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
				|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
				|ГДЕ
				|	СостоянияЗаказовПокупателей.Ссылка В
				|			(ВЫБРАТЬ
				|				втДоступныеСостоянияЗаказов.Состояние КАК Состояние
				|			ИЗ
				|				втДоступныеСостоянияЗаказов КАК втДоступныеСостоянияЗаказов)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		Иначе
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
				|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
				|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		КонецЕсли;
		
		ДобавлятьПорядок = Ложь;
		
	КонецЕсли;
	
	Возврат СтрЗаменить(Результат, "15", КоличествоЭлементов);
	
КонецФункции

Функция НачальноеЗаполнениеЭлементовВыполнено()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияЗаказовПокупателей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
	|ГДЕ
	|	СостоянияЗаказовПокупателей.Предопределенный = ЛОЖЬ";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли