#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство( "УчетнаяЗапись", ОтборУчетнаяЗапись ); 
	
	ИменаНетиповыхОтборов = "ОтборУчетнаяЗапись";
	УчетнаяЗаписьОтборПриИзмененииСервер();
	
	// УНФ.ОтборыСписка
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список);
	// Конец УНФ.ОтборыСписка
	
	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Элементы.ФормаИзменитьФормуТакси.Видимость = Не ЭтоВариантИнтерфейса85;
	Элементы.ФормаИзменитьФорму.Видимость = ЭтоВариантИнтерфейса85;	
	Элементы.ФормаСправкаТакси.Видимость = Не ЭтоВариантИнтерфейса85;
	Элементы.ФормаСправка.Видимость = ЭтоВариантИнтерфейса85;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РаботаСОтборамиКлиентСервер.ОбновитьКоличествоФильтров(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы Тогда
		// УНФ.ОтборыСписка
		СохранитьНастройки();
		// Конец УНФ.ОтборыСписка
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборУчетнаяЗаписьПриИзменении(Элемент)
	УчетнаяЗаписьОтборПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаТаксиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокДеталиНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Детали;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ДанныеСсылка" Тогда
		ДанныеСсылка = Элементы.Список.ТекущиеДанные.ДанныеСсылка;
		Если ЗначениеЗаполнено( ДанныеСсылка ) Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение( , ДанныеСсылка );
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КнопкаНастройкиЛогирования(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить( "УчетнаяЗапись", ОтборУчетнаяЗапись );
	Если НастройкиЛогированияПоУчетнойЗаписиСуществуют( ОтборУчетнаяЗапись ) Тогда
		Измерения = Новый Структура;
		Измерения.Вставить("УчетнаяЗапись", ОтборУчетнаяЗапись);
		
		ПараметрыЗаписи = Новый Массив;
		ПараметрыЗаписи.Добавить(Измерения);
		
		КлючЗаписи = Новый(Тип("РегистрСведенийКлючЗаписи.ОбменСВнешнимиСистемамиЛогированиеНастройки"), ПараметрыЗаписи);
		
		ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
	КонецЕсли;
	
	ОткрытьФорму( "РегистрСведений.ОбменСВнешнимиСистемамиЛогированиеНастройки.ФормаЗаписи", ПараметрыФормы, 
	ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца );
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЛогНастройкиОткрыть(Команда)
	ОткрытьФорму( "РегистрСведений.ОбменСВнешнимиСистемамиЛогированиеНастройки.ФормаСписка" );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЛогОчистить(Команда)
	ВопросОповещение = Новый ОписаниеОповещения( "КнопкаЛогОчиститьПослеВопроса", ЭтотОбъект );
	Если Не ЗначениеЗаполнено( ОтборУчетнаяЗапись ) Тогда
		ВопросТекст = НСтр( "ru = 'Удалить все записи лога для ВСЕХ учетных записей ?'");
	Иначе
		ВопросШаблон = НСтр( "ru = 'Удалить все записи лога для учетной записи ""%1""?'" );
		ВопросТекст = СтрШаблон( ВопросШаблон, ОтборУчетнаяЗапись ); 
	КонецЕсли;
	ПоказатьВопрос( ВопросОповещение, ВопросТекст, РежимДиалогаВопрос.ДаНетОтмена, , , НСтр( "ru = 'Очистка лога'" ) );
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеОтборы(Команда)
	ОтборУчетнаяЗапись = Неопределено;
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "Список", "Дата");
	СброситьВсеМеткиОтбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	
	ИмяРеквизитаСписка = "Список";
	ИмяТЧДанныеМеток = "ДанныеМеток";
	ИмяТЧДанныеОтборов = "ДанныеОтборов";
	ИмяГруппыОтборов = "ГруппаОтборы";
	ИмяПредопределенныеОтборыПоУмолчанию = "ПредопределенныеОтборыПоУмолчанию";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизитаСписка", ИмяРеквизитаСписка);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеОтборов", ИмяТЧДанныеОтборов);
	ДополнительныеПараметры.Вставить("ИмяГруппыОтборов", ИмяГруппыОтборов);
	ДополнительныеПараметры.Вставить("ИмяПредопределенныеОтборыПоУмолчанию", ИмяПредопределенныеОтборыПоУмолчанию);
	
	РаботаСОтборамиКлиент.НастроитьОтборыНажатие(ЭтотОбъект, 
	ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры), ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЛогОчиститьНаСервере( УчетнаяЗапись )
	Результат = ОбменСВнешнимиСистемамиЛогирование.ЛогОчистить( УчетнаяЗапись );
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура КнопкаЛогОчиститьПослеВопроса( ОтветПользователя, ПараметрыОтвета ) Экспорт

	Если ОтветПользователя <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ЛогОчиститьНаСервере( ОтборУчетнаяЗапись );
	
	Если Результат = Истина Тогда
		Состояние( НСтр("ru = 'Записи лога удалены.'"), , НСтр("ru = 'Очистка лога'") );
	Иначе
		Состояние( НСтр("ru = 'Ошибка при удалении.'"), , НСтр("ru = 'Очистка лога'") );
	КонецЕсли;
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура УчетнаяЗаписьОтборУстановить()
	Список.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено( ОтборУчетнаяЗапись ) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "УчетнаяЗапись",
				ОтборУчетнаяЗапись, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
КонецПроцедуры

#Область Отборы

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);	
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры)
	
	Возврат РаботаСОтборами.ПараметрыДляОткрытияФормыСНастройкамиОтборов(ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Процедура НастройкаОтборовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтборовЗавершениеНаСервере(Результат.АдресВыбранныеОтборы, Результат.АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаОтборовЗавершениеНаСервере(АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры = Неопределено Тогда
		//@skip-check module-unused-local-variable
		ИмяРеквизитаСписка = "Список";
		//@skip-check module-unused-local-variable
		ИмяТЧДанныеМеток = "ДанныеМеток";
		//@skip-check module-unused-local-variable
		ИмяТЧДанныеОтборов = "ДанныеОтборов";
	Иначе
		ИмяРеквизитаСписка = ДополнительныеПараметры.ИмяРеквизитаСписка;
		ИмяТЧДанныеМеток = ДополнительныеПараметры.ИмяТЧДанныеМеток;
		ИмяТЧДанныеОтборов = ДополнительныеПараметры.ИмяТЧДанныеОтборов;
	КонецЕсли;
	
	РаботаСОтборами.НастройкаОтборовЗавершение(ЭтотОбъект, АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборПриИзменении(Элемент)
	
	Подключаемый_ОтборПриИзмененииНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборПриИзмененииНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборПриИзменении(ЭтотОбъект, ЭлементИмя, ЭлементРодительИмя);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборОчистка(Элемент)
	
	Подключаемый_ОтборОчисткаНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборОчисткаНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборОчистка(ЭтотОбъект, ЭлементИмя);

КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере()
	
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, Список);
	
	УчетнаяЗаписьОтборПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура УчетнаяЗаписьОтборПриИзмененииСервер()
	
	УчетнаяЗаписьОтборУстановить();
	Элементы.Список.Обновить();
	
	ОбновитьКоличествоДополнительныхФильтров();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиЛогированияПоУчетнойЗаписиСуществуют( УчетнаяЗапись )
	МенеджерЗаписи = РегистрыСведений.ОбменСВнешнимиСистемамиЛогированиеНастройки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УчетнаяЗапись = УчетнаяЗапись;
	МенеджерЗаписи.Прочитать();
	Результат = МенеджерЗаписи.Выбран();
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ОбновитьКоличествоДополнительныхФильтров()
	
	КоличествоДопФильтров = 0;
	
	Если ЗначениеЗаполнено( ОтборУчетнаяЗапись ) Тогда
		КоличествоДопФильтров = КоличествоДопФильтров + 1;
	КонецЕсли;
	
	РаботаСОтборамиКлиентСервер.ОбновитьКоличествоФильтров(ЭтотОбъект);
	РаботаСОтборамиКлиентСервер.УстановитьОтображениеКомандыСброситьВсеОтборы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти