
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдаптацияФормыТакси();
	АдаптацияФормыМК();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СерияЛицензионнойКартыПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерЛицензионнойКартыПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиЛицензионнойКартыПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецЛицензииПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	ШаблонНаименования = НСтр("ru = 'Серия %1 № %2 от %3%4'");
	Если ЗначениеЗаполнено(Объект.ВладелецЛицензии) Тогда
		ШаблонВладелецЛицензии = СтрШаблон(НСтр("ru = '. Владелец: %1'"), Объект.ВладелецЛицензии);
	Иначе
		ШаблонВладелецЛицензии = "";
	КонецЕсли;
	Объект.Наименование = СтрШаблон(ШаблонНаименования,
		Объект.СерияЛицензионнойКарты, Объект.НомерЛицензионнойКарты,
		Формат(Объект.ДатаВыдачиЛицензионнойКарты, "ДФ=dd.MM.yyyy"), ШаблонВладелецЛицензии);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Если ЭтоИнтерфейсТакси Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЛицензируемыйВидДеятельности",
			"ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Лево);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыМК()
	
	Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяКолонкаШапки",
		"Объединенная", Истина);
	
КонецПроцедуры

#КонецОбласти