
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ЦветаСтиляВыделенногоЦвета", ЦветаСтиля.ВидДняПроизводственногоКалендаряСубботаЦвет);
	
	АдаптацияФормыТакси();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	СформироватьПредставлениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	СформироватьПредставлениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДелегированияПриИзменении(Элемент)
	
	СформироватьПредставлениеНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьПредставлениеНаКлиенте()
	
	ШаблонНаименования = НСтр("ru ='%1 №%2 от %3'");
	ДатаНачалаДелегирования = Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy");
	Объект.Наименование = СтрШаблон(ШаблонНаименования, Объект.ВидДелегирования, Объект.Код, ДатаНачалаДелегирования);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Если ЭтоИнтерфейсТакси Тогда
		Элементы.ДатаНачала.Заголовок = НСтр("ru = 'от'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
