
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "БиблиотекаРабочегоМестаКассира";
	Описание.Версия = ОбщегоНазначенияРМК.ВерсияБиблиотеки();
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре.
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Монопольно".
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "1.0.7.128";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ЗаполнитьСпособПечатиТоварногоЧека";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "1.0.8.42";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьПризнакиВидовОплатВНастройкахРМК";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "1.0.9.17";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ПеренестиБыстрыеТоварыИзНастроекВПалитруТоваров";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.10.21";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ЗаменитьКомандуОткрытияДенежногоЯщикаВГорячихКлавишах";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "1.0.12.7";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьПризнакиВидовОплатВНастройкахРМК_ПС";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.13.7";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьПризнакОплатыПлатежнымиКартами";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.15.80";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьВложенныеПалитрыНастроек";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.16.12";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ЗаполнитьЦветаПалитрыПоУмолчанию";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.1.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.УстановитьНастройкиРабочегоМестаКассира";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.1.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.АктуализироватьОбластиНастроекПорядкаОбластей";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.1.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьРежимНачальнойСтраницы";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.1.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.УстановитьНастройкуОтображенияОстатков";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.1.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьНастройкиПорядкаОбластейДляПлатформы85";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.1.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьНастройкиПорядкаОбластей_1_1_1_1";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.1.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьГруппуОсновнойКоманднойПанелиВПорядкеОбластей";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.1.11";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьНастройкиПорядкаОбластейСтаканаВертикальнаяОриентация";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.2.4";
	Обработчик.Процедура
		= "ОбновлениеИнформационнойБазыРМК.ОбновитьНастройкиПорядкаОбластейДляГруппыБыстрыхОплат_1_1_2_4";
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример:
//  // Пример обхода выполненных обработчиков обновления:
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
 
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  // Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику".
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
 
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
 
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриОпределенииНастроек
Процедура ПриОпределенииНастроекОбновленияИнформационнойБазы(Параметры) Экспорт
	
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыКонтроля);
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОбновитьНастройкиПорядкаОбластейДляПлатформы85", Истина);
	Методы.Вставить("ОбновитьПризнакОплатыПлатежнымиКартами", Истина);
	Методы.Вставить("ОбновитьГруппуОсновнойКоманднойПанелиВПорядкеОбластей", Истина);
	Методы.Вставить("ОбновитьНастройкиПорядкаОбластейДляГруппыБыстрыхОплат_1_1_2_4", Истина);
	Методы.Вставить("ОбновитьНастройкиПорядкаОбластейСтаканаВертикальнаяОриентация", Истина);
	Методы.Вставить("ЗаполнитьЦветаПалитрыПоУмолчанию", Истина);
	Методы.Вставить("ЗаполнитьСпособПечатиТоварногоЧека", Истина);
	Методы.Вставить("ПеренестиБыстрыеТоварыИзНастроекВПалитруТоваров", Истина);
	Методы.Вставить("ОбновитьПризнакиВидовОплатВНастройкахРМК", Истина);
	Методы.Вставить("ОбновитьНастройкиПорядкаОбластей_1_1_1_1", Истина);
	Методы.Вставить("УстановитьНастройкуОтображенияОстатков", Истина);
	Методы.Вставить("ОбновитьРежимНачальнойСтраницы", Истина);
	Методы.Вставить("АктуализироватьОбластиНастроекПорядкаОбластей", Истина);
	Методы.Вставить("ОбновитьВложенныеПалитрыНастроек", Истина);
	Методы.Вставить("ОбновитьПризнакиВидовОплатВНастройкахРМК_ПС", Истина);
	Методы.Вставить("ЗаменитьКомандуОткрытияДенежногоЯщикаВГорячихКлавишах", Истина);
	Методы.Вставить("УстановитьНастройкиРабочегоМестаКассира", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСпособПечатиТоварногоЧека() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК Настройки
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|		ПО НастройкиРабочегоМестаКассира.РабочееМесто = ПодключаемоеОборудование.РабочееМесто
	|ГДЕ
	|	НастройкиРабочегоМестаКассира.ПометкаУдаления
	|	И ЕСТЬNULL(ПодключаемоеОборудование.ТипОборудования, ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ПринтерЧеков)
	|	И ЕСТЬNULL(ПодключаемоеОборудование.УстройствоИспользуется, ЛОЖЬ)
	|	И НЕ ЕСТЬNULL(ПодключаемоеОборудование.ПометкаУдаления, ЛОЖЬ)");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Настройки);
			Блокировка.Заблокировать();
			
			СправочникОбъект = Выборка.Настройки.ПолучитьОбъект();
			СправочникОбъект.СпособФормированияТоварногоЧека = 2;
			СправочникОбъект.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при изменении данных справочника.'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.Настройки,
				,
				ТекстСообщения);
				
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПризнакиВидовОплатВНастройкахРМК_ПС() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			ОбъектНастройкаРМК.ИспользоватьОплатуПлатежнымиСистемами = Истина;
			
			ОбъектНастройкаРМК.Записать();
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настройки РМК ""Использовать оплату платежными системами""'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПризнакиВидовОплатВНастройкахРМК() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			ОбъектНастройкаРМК.ИспользоватьОплатуНаличными = Истина;
			
			ОбщегоНазначенияРМКПереопределяемый.ОбновитьНастройкиПризнаковВидовОплат(ОбъектНастройкаРМК);
			
			ОбъектНастройкаРМК.Записать();
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеренестиБыстрыеТоварыИзНастроекВПалитруТоваров() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираБыстрыеТовары.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.БыстрыеТовары КАК НастройкиРабочегоМестаКассираБыстрыеТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиРабочегоМестаКассираБыстрыеТовары.Ссылка");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НастройкаРМК.БыстрыеТовары.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			БыстрыеТовары = ОбъектНастройкаРМК.БыстрыеТовары;
			
			НоваяПалитра = Справочники.ПалитраТоваровРМК.СоздатьЭлемент();
			НоваяПалитра.Наименование = НСтр("ru = 'Палитра быстрых товаров'");
			НоваяПалитра.ШрифтЭлементовПодбора = ОбщегоНазначения.ЗначениеВСтрокуXML(ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
			НоваяПалитра.КоличествоЭлементовВРяду = 4;
			НоваяПалитра.КоличествоРядов = 3;
			НоваяПалитра.ВысотаЭлемента = 5;
			
			СоставПалитры = НоваяПалитра.Состав;
			
			Для Каждого СтрокаТовара Из БыстрыеТовары Цикл
				
				СтрокаПалитры = СоставПалитры.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПалитры, СтрокаТовара);
				СтрокаПалитры.ИндексПозиции = СтрокаТовара.НомерСтроки;
				
				СтрокаПалитры.ХарактеристикиИспользуются =
					ОбщегоНазначенияРМК.ТребуетсяВводХарактеристикиДляНоменклатуры(СтрокаПалитры.Номенклатура);
				
				Если ЗначениеЗаполнено(СтрокаПалитры.Характеристика) Тогда
					СтрокаПалитры.ИмяЭлемента = СтрШаблон(НСтр("ru = '%1 %2'"), СтрокаПалитры.Номенклатура, СтрокаПалитры.Характеристика);
				Иначе
					СтрокаПалитры.ИмяЭлемента = СтрШаблон(НСтр("ru = '%1'"), СтрокаПалитры.Номенклатура);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТовара.ЦветФона) Тогда
					СтрокаПалитры.ЦветФона = ОбщегоНазначения.ЗначениеВСтрокуXML(ЦветаСтиля.ЦветАктивнойКнопкиРМК);
				КонецЕсли;
				
				СтрокаПалитры.ЦветШрифта = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Цвет(0, 0, 0));
				СтрокаПалитры.Шрифт = НоваяПалитра.ШрифтЭлементовПодбора;
				
			КонецЦикла;
			
			НоваяПалитра.Записать();
			
			ОбъектНастройкаРМК.СтруктураБыстрыхТоваров = НоваяПалитра.Ссылка;
			ОбъектНастройкаРМК.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьКомандуОткрытияДенежногоЯщикаВГорячихКлавишах() Экспорт
	
	ИмяСтаройКнопки = "ОткрытьДенежныйЯщикПриВыдачеНаличных";
	ИмяНовойКнопки = "ОткрытьДенежныйЯщик";
	
	ЗапросНастроекРМК = Новый Запрос;
	ЗапросНастроекРМК.Текст = 
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.ГорячиеКлавиши КАК НастройкиРабочегоМестаКассираГорячиеКлавиши
	|ГДЕ
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.ИмяКнопки = &ИмяСтаройКнопки";
	ЗапросНастроекРМК.УстановитьПараметр("ИмяСтаройКнопки", ИмяСтаройКнопки);
	
	ВыборкаНастроекРМК = ЗапросНастроекРМК.Выполнить().Выбрать();
	Пока ВыборкаНастроекРМК.Следующий() Цикл
		НастройкаРМКОбъект = ВыборкаНастроекРМК.НастройкаРМК.ПолучитьОбъект();
		СтрокаНовойКнопки = НастройкаРМКОбъект.ГорячиеКлавиши.Найти(ИмяНовойКнопки, "ИмяКнопки");
		СтрокаСтаройКнопки = НастройкаРМКОбъект.ГорячиеКлавиши.Найти(ИмяСтаройКнопки, "ИмяКнопки");
		Если СтрокаНовойКнопки = Неопределено Тогда
			СтрокаСтаройКнопки.ИмяКнопки = ИмяНовойКнопки;
		Иначе
			НастройкаРМКОбъект.ГорячиеКлавиши.Удалить(СтрокаСтаройКнопки);
		КонецЕсли;
		НастройкаРМКОбъект.ОбменДанными.Загрузка = Истина;
		НастройкаРМКОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПризнакОплатыПлатежнымиКартами() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			
			ОбщегоНазначенияРМКПереопределяемый.ОбновитьПризнакОплатыПлатежнымиКартами(ОбъектНастройкаРМК);
			
			ОбъектНастройкаРМК.Записать();
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПорядокГоризонтальныхОбластей(НастройкаОбъект, ЭлементМодифицирован)
	
	ИменаОбластей = Новый Структура;
	ИменаОбластей.Вставить("КонтейнерРаботыСТоварами", "ГруппаЛевоОболочкаПорядка_Горизонтальная");
	ИменаОбластей.Вставить("ПанельИзбранныхТоваров", "ПанельИзбранныхТоваров_Горизонтальная");
	ИменаОбластей.Вставить("ГруппаИнфо", "ГруппаИнфо_Горизонтальная");
	ИменаОбластей.Вставить("ПанельТаблицыТоваров", "ПанельТаблицыТоваров_Горизонтальная");
	ИменаОбластей.Вставить("ДанныеЧека", "СтраницыОбластиСоставаЧека_Горизонтальная");
	
	ОбновитьПорядокОбластей(НастройкаОбъект, ИменаОбластей, ЭлементМодифицирован, Ложь);
	
КонецПроцедуры

Процедура ОбновитьПорядокВертикальныхОбластей(НастройкаОбъект, ЭлементМодифицирован)
	
	ИменаОбластей = Новый Структура;
	ИменаОбластей.Вставить("КонтейнерРаботыСТоварами", "ГруппаПанельИнформацииВер_Вертикальная");
	ИменаОбластей.Вставить("ПанельИзбранныхТоваров", "ПанельИзбранныхТоваров_Вертикальная");
	ИменаОбластей.Вставить("ГруппаИнфо", "ГруппаИнфо_Вертикальная");
	ИменаОбластей.Вставить("ПанельТаблицыТоваров", "ПанельТаблицыТоваров_Вертикальная");
	ИменаОбластей.Вставить("ДанныеЧека", "СтраницыОбластиСоставаЧека_Вертикальная");
	
	ОбновитьПорядокОбластей(НастройкаОбъект, ИменаОбластей, ЭлементМодифицирован, Истина);
	
КонецПроцедуры

Процедура ОбновитьПорядокОбластей(НастройкаОбъект, ИменаОбластей, ЭлементМодифицирован, ВертикальнаяОриентация)
	
	ПорядкиОбластей = Новый Структура();
	ПорядкиОбластей.Вставить("ПорядокПанелиИзбранных", 2);
	ПорядкиОбластей.Вставить("ПорядокГруппыИнфо", 0);
	ПорядкиОбластей.Вставить("ПорядокТаблицыТоваров", 0);
	МинимальныйИндекс = -1;
	МаксимальныйИндекс = -1;
	ОтборКонтейнера = Новый Структура("ОбластьРодитель", ИменаОбластей.КонтейнерРаботыСТоварами);
	СтрокиКонтейнера = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборКонтейнера);
	
	ОтборДанныеЧека = Новый Структура("Область", ИменаОбластей.ДанныеЧека);
	СтрокиДанныеЧека = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборДанныеЧека);
	
	Если СтрокиКонтейнера.Количество() > 0 И СтрокиДанныеЧека.Количество() = 0 Тогда
		
		ЭлементМодифицирован = Истина;
		Для каждого СтрокаКонтейнера Из СтрокиКонтейнера Цикл
			Если СтрокаКонтейнера.Область = ИменаОбластей.ПанельИзбранныхТоваров Тогда
				ПорядкиОбластей.ПорядокПанелиИзбранных = ?(СтрокаКонтейнера.Порядок = 1, 1, 2);
			ИначеЕсли СтрокаКонтейнера.Область = ИменаОбластей.ГруппаИнфо Тогда
				ПорядкиОбластей.ПорядокГруппыИнфо = СтрокаКонтейнера.Порядок;
			ИначеЕсли СтрокаКонтейнера.Область = ИменаОбластей.ПанельТаблицыТоваров Тогда
				ПорядкиОбластей.ПорядокТаблицыТоваров = СтрокаКонтейнера.Порядок;
			КонецЕсли;
			
			ИндексСтроки = НастройкаОбъект.ПорядокОбластей.Индекс(СтрокаКонтейнера);
			Если МинимальныйИндекс = -1 Или МинимальныйИндекс > ИндексСтроки Тогда
				МинимальныйИндекс = ИндексСтроки;
			КонецЕсли;
			Если МаксимальныйИндекс < ИндексСтроки Тогда
				МаксимальныйИндекс = ИндексСтроки;
			КонецЕсли;
		КонецЦикла;
		
		Счт = МаксимальныйИндекс;
		Пока Счт >= МинимальныйИндекс Цикл
			СтрокаПорядка = НастройкаОбъект.ПорядокОбластей.Получить(Счт);
			Если СтрокаПорядка.Область = ИменаОбластей.ГруппаИнфо
					Или СтрокаПорядка.Область = ИменаОбластей.ПанельТаблицыТоваров Тогда
				НастройкаОбъект.ПорядокОбластей.Удалить(Счт);
			КонецЕсли;
			Счт = Счт - 1;
		КонецЦикла;
		
		ОтборИзбранное = Новый Структура("Область", ИменаОбластей.ПанельИзбранныхТоваров);
		СтрокиИзбранного = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборИзбранное);
		Если СтрокиИзбранного.Количество() > 0 Тогда
			СтрокиИзбранного[0].Порядок = ПорядкиОбластей.ПорядокПанелиИзбранных;
			ИндексИзбранного = НастройкаОбъект.ПорядокОбластей.Индекс(СтрокиИзбранного[0]);
			ДобавитьИзмененныеОбласти(НастройкаОбъект, ИменаОбластей,
				ИндексИзбранного, ПорядкиОбластей, ВертикальнаяОриентация);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьИзмененныеОбласти(НастройкаОбъект, ИменаОбластей,
		ИндексИзбранного, ПорядкиОбластей, ВертикальнаяОриентация)
		
	СтрокаДанныеЧека = НастройкаОбъект.ПорядокОбластей.Вставить(ИндексИзбранного);
	СтрокаДанныеЧека.ОбластьРодитель = ИменаОбластей.КонтейнерРаботыСТоварами;
	СтрокаДанныеЧека.Область = ИменаОбластей.ДанныеЧека;
	СтрокаДанныеЧека.Порядок = ?(ПорядкиОбластей.ПорядокПанелиИзбранных = 2, 1, 2);
	СтрокаДанныеЧека.ВертикальнаяОриентация = ВертикальнаяОриентация;
	
	СтрокаГруппаИнфо = НастройкаОбъект.ПорядокОбластей.Вставить(ИндексИзбранного + 1);
	СтрокаГруппаИнфо.ОбластьРодитель = ИменаОбластей.ДанныеЧека;
	СтрокаГруппаИнфо.Область = ИменаОбластей.ГруппаИнфо;
	СтрокаГруппаИнфо.Порядок = ?(ПорядкиОбластей.ПорядокГруппыИнфо > ПорядкиОбластей.ПорядокТаблицыТоваров, 2, 1);
	СтрокаГруппаИнфо.ВертикальнаяОриентация = ВертикальнаяОриентация;
	
	СтрокаПанельТаблицыТоваров = НастройкаОбъект.ПорядокОбластей.Вставить(ИндексИзбранного + 2);
	СтрокаПанельТаблицыТоваров.ОбластьРодитель = ИменаОбластей.ДанныеЧека;
	СтрокаПанельТаблицыТоваров.Область = ИменаОбластей.ПанельТаблицыТоваров;
	СтрокаПанельТаблицыТоваров.Порядок
		= ?(ПорядкиОбластей.ПорядокГруппыИнфо > ПорядкиОбластей.ПорядокТаблицыТоваров, 1, 2);
	СтрокаПанельТаблицыТоваров.ВертикальнаяОриентация = ВертикальнаяОриентация;
	
КонецПроцедуры

Процедура ОбновитьРежимНачальнойСтраницы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ЭлементМодифицирован = Ложь;
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			Если ОбъектНастройкаРМК.УдалитьРежимНачальнойСтраницы = 2 Тогда
				ОбъектНастройкаРМК.ОсновнойПодборПлиточный = Истина;
				ЭлементМодифицирован = Истина;
			ИначеЕсли ОбъектНастройкаРМК.УдалитьРежимНачальнойСтраницы = 1 Тогда
				ОбъектНастройкаРМК.ОсновнойПодборПлиточный = Ложь;
				ЭлементМодифицирован = Истина;
			КонецЕсли;
			ОбновитьПорядокГоризонтальныхОбластей(ОбъектНастройкаРМК, ЭлементМодифицирован);
			ОбновитьПорядокВертикальныхОбластей(ОбъектНастройкаРМК, ЭлементМодифицирован);
			
			Если ЭлементМодифицирован Тогда
				ОбъектНастройкаРМК.ОбменДанными.Загрузка = Истина;
				ОбъектНастройкаРМК.Записать();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьНастройкуОтображенияОстатков() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			
			ОбщегоНазначенияРМКПереопределяемый.УстановитьНастройкуОтображенияОстатков(ОбъектНастройкаРМК);
			
			ОбъектНастройкаРМК.Записать();
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьВложенныеПалитрыНастроек() Экспорт
	
	ЗапросНастроекСПалитрами = Новый Запрос;
	ЗапросНастроекСПалитрами.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира
	|ГДЕ
	|	НЕ(НастройкиРабочегоМестаКассира.СтруктураПлиточногоИнтерфейсаПодбора = ЗНАЧЕНИЕ(Справочник.ПалитраТоваровРМК.ПустаяСсылка)
	|				И НастройкиРабочегоМестаКассира.СтруктураБыстрыхТоваров = ЗНАЧЕНИЕ(Справочник.ПалитраТоваровРМК.ПустаяСсылка))
	|	И НЕ НастройкиРабочегоМестаКассира.ПометкаУдаления";
	
	РезультатЗапроса = ЗапросНастроекСПалитрами.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НастройкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			АктуализироватьСписокПалитр(НастройкаОбъект, "СтруктураПлиточногоИнтерфейсаПодбора", "ПалитрыПлиточныйИнтерфейс");
			АктуализироватьСписокПалитр(НастройкаОбъект, "СтруктураБыстрыхТоваров", "ПалитрыИзбранное");
			НастройкаОбъект.ОбменДанными.Загрузка = Истина;
			НастройкаОбъект.Записать();
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура АктуализироватьСписокПалитр(НастройкаОбъект, ИмяРеквизита, ИмяТабличнойЧасти)
	
	НастройкаОбъект[ИмяТабличнойЧасти].Очистить();
	Если ЗначениеЗаполнено(НастройкаОбъект[ИмяРеквизита]) Тогда
		ИсходныйМассив = Новый Массив;
		ИсходныйМассив.Добавить(НастройкаОбъект[ИмяРеквизита]);
		ПодчиненныеПалитры = ИнтерфейсРМКСлужебный.ПолучитьВложенныеПалитры(ИсходныйМассив);
		ПалитрыПризнакСлужебная = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ПодчиненныеПалитры, "Служебная");
		НоваяСтрока = НастройкаОбъект[ИмяТабличнойЧасти].Добавить();
		НоваяСтрока.Палитра = НастройкаОбъект[ИмяРеквизита];
		Для Каждого ПалитраСПризнаком Из ПалитрыПризнакСлужебная Цикл
			Если Не ПалитраСПризнаком.Значение Тогда
				НоваяСтрока = НастройкаОбъект[ИмяТабличнойЧасти].Добавить();
				НоваяСтрока.Палитра = ПалитраСПризнаком.Ключ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция НеобходимоОбновитьПалитру(ПалитраСсылка, ПараметрЦветаПалитры)
	
	РезультатФункции = Ложь;
	
	Если СокрЛП(ПалитраСсылка.ЦветФонаКнопки) = "" Или СокрЛП(ПалитраСсылка.ЦветФонаПапки) = "" Тогда
		РезультатФункции = Истина;
	Иначе
		КоличествоСтрок = ПалитраСсылка.Состав.Количество();
		ИндексСтроки = 0;
		Пока ИндексСтроки < КоличествоСтрок И Не РезультатФункции Цикл
			СтрокаСостава = ПалитраСсылка.Состав.Получить(ИндексСтроки);
			Если ЗначениеЗаполнено(СтрокаСостава.Номенклатура)
				И СтрокаСостава.ЦветФона = ПараметрЦветаПалитры.ЦветФонаКнопкиУстаревшийСтрокой Тогда
				
				РезультатФункции = Истина;
				
			КонецЕсли;
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ОбновитьЦветаПалитрыЗначениямиПоУмолчанию(ПалитраСсылка, ПараметрЦветаПалитры)
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ПалитраТоваровРМК");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ПалитраСсылка);
		Блокировка.Заблокировать();
		
		ПалитраОбъект = ПалитраСсылка.ПолучитьОбъект();
		
		Если СокрЛП(ПалитраОбъект.ЦветФонаКнопки) = "" Тогда
			ПалитраОбъект.ЦветФонаКнопки = ПараметрЦветаПалитры.ЦветФонаКнопкиСтрокой;
		КонецЕсли;
		Если СокрЛП(ПалитраОбъект.ЦветФонаПапки) = "" Тогда
			ПалитраОбъект.ЦветФонаПапки = ПараметрЦветаПалитры.ЦветФонаПапкиСтрокой;
		КонецЕсли;
		Для Каждого СтрокаСостава Из ПалитраОбъект.Состав Цикл
			
			Если ЗначениеЗаполнено(СтрокаСостава.Номенклатура)
				И СтрокаСостава.ЦветФона = ПараметрЦветаПалитры.ЦветФонаКнопкиУстаревшийСтрокой Тогда
				
				СтрокаСостава.ЦветФона = ПараметрЦветаПалитры.ЦветФонаКнопкиСтрокой;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПалитраОбъект.ОбменДанными.Загрузка = Истина;
		ПалитраОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Ошибка при обновлении палитры РМК'", КодОсновногоЯзыка);
		ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,
			ПалитраСсылка,
			,
			ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьЦветаПалитрыПоУмолчанию() Экспорт
	
	ПараметрЦветаПалитры = Новый Структура();
	
	ЦветФонаКнопкиСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ЦветаСтиля.ЦветФонаСтаканаРМК);
	ЦветФонаПапкиСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ЦветаСтиля.ЦветПапкиКнопкиРМК);
	ЦветФонаКнопкиУстаревшийСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ЦветаСтиля.ЦветАктивнойКнопкиРМК);
	
	ПараметрЦветаПалитры.Вставить("ЦветФонаКнопкиСтрокой", ЦветФонаКнопкиСтрокой);
	ПараметрЦветаПалитры.Вставить("ЦветФонаПапкиСтрокой", ЦветФонаПапкиСтрокой);
	ПараметрЦветаПалитры.Вставить("ЦветФонаКнопкиУстаревшийСтрокой", ЦветФонаКнопкиУстаревшийСтрокой);
	
	ЗапросПалитр = Новый Запрос;
	ЗапросПалитр.Текст =
	"ВЫБРАТЬ
	|	ПалитраТоваровРМК.Ссылка КАК Палитра
	|ИЗ
	|	Справочник.ПалитраТоваровРМК КАК ПалитраТоваровРМК";
	
	РезультатЗапроса = ЗапросПалитр.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаПалитр = РезультатЗапроса.Выбрать();
		Пока ВыборкаПалитр.Следующий() Цикл
			
			ПалитраСсылка = ВыборкаПалитр.Палитра;
			Если НеобходимоОбновитьПалитру(ПалитраСсылка, ПараметрЦветаПалитры) Тогда
				
				ОбновитьЦветаПалитрыЗначениямиПоУмолчанию(ПалитраСсылка, ПараметрЦветаПалитры);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНастройкиРабочегоМестаКассира() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира
	|ГДЕ
	|	НЕ НастройкиРабочегоМестаКассира.ПометкаУдаления";
	
	ИспользоватьЗаменуТоваров = ОбщегоНазначенияРМК.ИспользоватьЗаменуТоваров();
	ПечататьКороткийСлипЧек = ОбщегоНазначенияРМК.ФормироватьИнтегрированныйСлипЧек();
	ИспользоватьКонтрольПродаж = ОбщегоНазначенияРМК.ИспользоватьКонтрольПродаж();
	ИспользоватьОплатуСертификатамиНСПК = ОбщегоНазначенияРМК.ИспользоватьОплатуСертификатамиНСПК();
	ИспользоватьСерверЛояльностиПолучательДанных = ОбщегоНазначенияРМК.ИспользоватьСерверЛояльностиПолучательДанных();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НачатьТранзакцию();
			
			Попытка
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
				Блокировка.Заблокировать();
				
				ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
				Если ИспользоватьЗаменуТоваров Тогда
					ОбъектНастройкаРМК.ИспользоватьЗаменуТоваров = Истина;
				КонецЕсли;
				
				Если ПечататьКороткийСлипЧек Тогда
					ОбъектНастройкаРМК.ПечататьКороткийСлипЧек = Истина;
				КонецЕсли;
				
				Если ИспользоватьОплатуСертификатамиНСПК Тогда
					ОбъектНастройкаРМК.ИспользоватьОплатуСертификатамиНСПК = Истина;
				КонецЕсли;
				
				Если ИспользоватьСерверЛояльностиПолучательДанных Тогда
					ОбъектНастройкаРМК.ИспользоватьСерверЛояльностиПолучательДанных = Истина;
				КонецЕсли;
				
				Если ИспользоватьКонтрольПродаж Тогда
					ОбъектНастройкаРМК.ИспользоватьКонтрольПродаж = Истина;
				КонецЕсли;
				
				ОбъектНастройкаРМК.Записать();
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
				ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК'", КодОсновногоЯзыка);
					ЗаписьЖурналаРегистрации(ИмяСобытия,
					УровеньЖурналаРегистрации.Ошибка,
					Выборка.НастройкаРМК,
					,
					ТекстСообщения);
				
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаменитьУстаревшиеОбластиНастройкиРМК(НастройкаРМК, ИмяГоризонтальнойПанели, ИмяВертикальнойПанели)
	
	ИмяНовойГоризонтальнойПанели = "ПанельИзбранныхТоваров_Горизонтальная";
	ИмяНовойВертикальнойПанели = "ПанельИзбранныхТоваров_Вертикальная";
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", НастройкаРМК);
		Блокировка.Заблокировать();
		
		ОбъектНастройкаРМК = НастройкаРМК.ПолучитьОбъект();
		
		ОтборГоризонтальныхОбластей = Новый Структура("Область", ИмяГоризонтальнойПанели);
		СтрокиГоризонтальныхОбластей = ОбъектНастройкаРМК.ПорядокОбластей.НайтиСтроки(ОтборГоризонтальныхОбластей);
		Для Каждого СтрокаОбласти Из СтрокиГоризонтальныхОбластей Цикл
			СтрокаОбласти.Область = ИмяНовойГоризонтальнойПанели;
		КонецЦикла;
		
		ОтборВертикальныхОбластей = Новый Структура("Область", ИмяВертикальнойПанели);
		СтрокиВертикальныхОбластей = ОбъектНастройкаРМК.ПорядокОбластей.НайтиСтроки(ОтборВертикальныхОбластей);
		Для Каждого СтрокаОбласти Из СтрокиВертикальныхОбластей Цикл
			СтрокаОбласти.Область = ИмяНовойВертикальнойПанели;
		КонецЦикла;
		
		ОбъектНастройкаРМК.ОбменДанными.Загрузка = Истина;
		ОбъектНастройкаРМК.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК'", КодОсновногоЯзыка);
		ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,
			НастройкаРМК,
			,
			ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Процедура АктуализироватьОбластиНастроекПорядкаОбластей() Экспорт
	
	ИмяГоризонтальнойПанели = "СтраницыПанелиИзбранноеПодбор_Горизонтальная";
	ИмяВертикальнойПанели = "СтраницыПанелиИзбранноеПодбор_Вертикальная";
	
	УстаревшиеОбласти = Новый Массив;
	УстаревшиеОбласти.Добавить(ИмяГоризонтальнойПанели);
	УстаревшиеОбласти.Добавить(ИмяВертикальнойПанели);
	
	ЗапросНастроек = Новый Запрос;
	ЗапросНастроек.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираПорядокОбластей.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.ПорядокОбластей КАК НастройкиРабочегоМестаКассираПорядокОбластей
	|ГДЕ
	|	НастройкиРабочегоМестаКассираПорядокОбластей.Область В(&УстаревшиеОбласти)";
	ЗапросНастроек.УстановитьПараметр("УстаревшиеОбласти", УстаревшиеОбласти);
	РезультатЗапроса = ЗапросНастроек.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаменитьУстаревшиеОбластиНастройкиРМК(Выборка.НастройкаРМК, ИмяГоризонтальнойПанели, ИмяВертикальнойПанели);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПорядокОбластейВНастройкеДляПлатформы85(НастройкаОбъект, ЭлементМодифицирован)
	
	КомандаОплатитьСверхуГоризонтальная = Ложь;
	
	ОтборОбласти = Новый Структура("Область", "КоманднаяПанельУправленияЧекомГор_Горизонтальная");
	СтрокиКоманднойПанели = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборОбласти);
	Если СтрокиКоманднойПанели.Количество() > 0 И СтрокиКоманднойПанели[0].Порядок = 1 Тогда
		КомандаОплатитьСверхуГоризонтальная = Истина;
	КонецЕсли;
	
	МассивИндексовУдаляемыхСтрок = Новый Массив;
	ОтборСтрок = Новый Структура("ОбластьРодитель", "ГруппаПанельИнформацииГор_Горизонтальная");
	ДобавитьИндексыСтрокВМассивУдаления(НастройкаОбъект.ПорядокОбластей, МассивИндексовУдаляемыхСтрок, ОтборСтрок);
	
	ОтборСтрок = Новый Структура("ОбластьРодитель", "КоманднаяПанельУправленияЧекомГор_Горизонтальная");
	ДобавитьИндексыСтрокВМассивУдаления(НастройкаОбъект.ПорядокОбластей, МассивИндексовУдаляемыхСтрок, ОтборСтрок);
	
	ОтборСтрок = Новый Структура("ОбластьРодитель", "ГруппаУправленияЧекомГор_Горизонтальная");
	СтрокиПорядка = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборСтрок);
	УдаленаГоризонтальнаяГруппаУправленияЧеком = (СтрокиПорядка.Количество() > 0);
	Для Каждого СтрокаПорядка Из СтрокиПорядка Цикл
		ИндексСтроки = НастройкаОбъект.ПорядокОбластей.Индекс(СтрокаПорядка);
		ДобавитьИндексВПорядкеУбывания(МассивИндексовУдаляемыхСтрок, ИндексСтроки);
	КонецЦикла;
	
	ОтборСтрок = Новый Структура("ОбластьРодитель", "ВводИнформацииИОплатГор_Горизонтальная");
	СтрокиПорядка = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборСтрок);
	УдаленВводИнформацииИОплат = (СтрокиПорядка.Количество() > 0);
	Для Каждого СтрокаПорядка Из СтрокиПорядка Цикл
		ИндексСтроки = НастройкаОбъект.ПорядокОбластей.Индекс(СтрокаПорядка);
		ДобавитьИндексВПорядкеУбывания(МассивИндексовУдаляемыхСтрок, ИндексСтроки);
	КонецЦикла;
	
	ОтборСтрок = Новый Структура("ОбластьРодитель", "ЛеваяСредняяКолонкиУправленияЧеком_Вертикальная");
	ДобавитьИндексыСтрокВМассивУдаления(НастройкаОбъект.ПорядокОбластей, МассивИндексовУдаляемыхСтрок, ОтборСтрок);
	
	Если УдаленаГоризонтальнаяГруппаУправленияЧеком И УдаленВводИнформацииИОплат Тогда
		ЭлементМодифицирован = Истина;
		Для Каждого ИндексУдаления Из МассивИндексовУдаляемыхСтрок Цикл
			НастройкаОбъект.ПорядокОбластей.Удалить(ИндексУдаления);
		КонецЦикла;
		
		ОтборСтрок = Новый Структура("ОбластьРодитель", "ГруппаЛевоОболочкаПорядка_Горизонтальная");
		СтрокиПорядка = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборСтрок);
		Для Каждого СтрокаПорядка Из СтрокиПорядка Цикл
			СтрокаПорядка.ОбластьРодитель = "ГруппаПанельИнформацииГор_Горизонтальная";
		КонецЦикла;
		
		Если УдаленаГоризонтальнаяГруппаУправленияЧеком Тогда
			ДобавитьНастройкиПорядкаОбластейДляПлатформы85(НастройкаОбъект.ПорядокОбластей, КомандаОплатитьСверхуГоризонтальная);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьНастройкиПорядкаОбластейДляПлатформы85(ТаблицаПорядкаОбластей, КомандаОплатитьСверхуГоризонтальная)
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаУправленияЧекомГор_Горизонтальная";
	НоваяСтрока.Область = "СводнаяПанельИтоговЧекаГор_Горизонтальная";
	НоваяСтрока.Порядок = ?(КомандаОплатитьСверхуГоризонтальная, 2, 1);
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаУправленияЧекомГор_Горизонтальная";
	НоваяСтрока.Область = "ГруппаУправленияОплатамиГор_Горизонтальная";
	НоваяСтрока.Порядок = ?(КомандаОплатитьСверхуГоризонтальная, 1, 2);
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаУправленияОплатамиГор_Горизонтальная";
	НоваяСтрока.Область = "ВводИнформацииИтоговЧекаГор_Горизонтальная";
	НоваяСтрока.Порядок = ?(КомандаОплатитьСверхуГоризонтальная, 2, 1);
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаУправленияОплатамиГор_Горизонтальная";
	НоваяСтрока.Область = "КоманднаяПанельУправленияЧекомГор_Горизонтальная";
	НоваяСтрока.Порядок = ?(КомандаОплатитьСверхуГоризонтальная, 1, 2);
	
КонецПроцедуры

Процедура ДобавитьИндексыСтрокВМассивУдаления(ТаблицаПорядкаОбластей, МассивУдаления, ОтборСтрок)
	
	СтрокиПорядка = ТаблицаПорядкаОбластей.НайтиСтроки(ОтборСтрок);
	Для Каждого СтрокаПорядка Из СтрокиПорядка Цикл
		ИндексСтроки = ТаблицаПорядкаОбластей.Индекс(СтрокаПорядка);
		ДобавитьИндексВПорядкеУбывания(МассивУдаления, ИндексСтроки);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИндексВПорядкеУбывания(МассивИндексов, НовоеЗначение)
	
	ЭлементВставлен = Ложь;
	КоличествоСтрок = МассивИндексов.Количество();
	ИндексМассива = 0;
	Пока ИндексМассива < КоличествоСтрок И Не ЭлементВставлен Цикл
		ТекущийЭлементМассива = МассивИндексов.Получить(ИндексМассива);
		Если НовоеЗначение > ТекущийЭлементМассива Тогда
			МассивИндексов.Вставить(ИндексМассива, НовоеЗначение);
			ЭлементВставлен = Истина;
		КонецЕсли;
		ИндексМассива = ИндексМассива + 1;
	КонецЦикла;
	Если Не ЭлементВставлен Тогда
		МассивИндексов.Добавить(НовоеЗначение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьНастройкиПорядкаОбластейДляПлатформы85() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ЭлементМодифицирован = Ложь;
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			ОбновитьПорядокОбластейВНастройкеДляПлатформы85(ОбъектНастройкаРМК, ЭлементМодифицирован);
			Если ЭлементМодифицирован Тогда
				ОбъектНастройкаРМК.ОбменДанными.Загрузка = Истина;
				ОбъектНастройкаРМК.Записать();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК при переходе на платформу 8.5'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИндексыСтрокПорядкаВМассивУдаления(ТаблицаПорядкаОбластей, МассивУдаления, СтрокиПорядка)
	
	Для Каждого СтрокаПорядка Из СтрокиПорядка Цикл
		ИндексСтроки = ТаблицаПорядкаОбластей.Индекс(СтрокаПорядка);
		ДобавитьИндексВПорядкеУбывания(МассивУдаления, ИндексСтроки);
	КонецЦикла;
	
КонецПроцедуры

Функция ПрисутствуютУстаревшиеДанныеВОбластиПравойКолнки(СтрокиПорядка)
	
	РезультатФункции = Ложь;
	
	ПорядковыйИндекс = 0;
	ИмяГруппыДанныеИтогов = "ДанныеИтоговЧекаВер_Вертикальная";
	ИмяГруппыСлоевКоманднойПанели = "ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком_Вертикальная";
	
	Пока ПорядковыйИндекс < СтрокиПорядка.Количество() И Не РезультатФункции Цикл
		ПроверяемаяСтрока = СтрокиПорядка[ПорядковыйИндекс];
		Если ПроверяемаяСтрока.Область = ИмяГруппыСлоевКоманднойПанели
				Или ПроверяемаяСтрока.Область = ИмяГруппыДанныеИтогов Тогда
			РезультатФункции = Истина;
		КонецЕсли;
		ПорядковыйИндекс = ПорядковыйИндекс + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УдалитьУстаревшиеСтрокиПорядка(ТаблицаПорядкаОбластей, МассивУдаления)
	
	Для Каждого ИндексУдаления Из МассивУдаления Цикл
		ТаблицаПорядкаОбластей.Удалить(ИндексУдаления);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНастройкиПорядкаГоризонтальныхОбластей(ТаблицаПорядкаОбластей)
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаУправленияЧекомГор_Горизонтальная";
	НоваяСтрока.Область = "СводнаяПанельИтоговЧекаГор_Горизонтальная";
	НоваяСтрока.Порядок = 1;
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаУправленияЧекомГор_Горизонтальная";
	НоваяСтрока.Область = "ПраваяКолонкаУправленияЧеком_Горизонтальная";
	НоваяСтрока.Порядок = 2;
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ПраваяКолонкаУправленияЧеком_Горизонтальная";
	НоваяСтрока.Область = "ГруппаСуммыТоваров_Горизонтальная";
	НоваяСтрока.Порядок = 1;
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ПраваяКолонкаУправленияЧеком_Горизонтальная";
	НоваяСтрока.Область = "ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком_Горизонтальная";
	НоваяСтрока.Порядок = 2;
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком_Горизонтальная";
	НоваяСтрока.Область = "ГруппаQRCode_Горизонтальная";
	НоваяСтрока.Порядок = 1;
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком_Горизонтальная";
	НоваяСтрока.Область = "ГруппаКомандКОплате_Горизонтальная";
	НоваяСтрока.Порядок = 2;
	
КонецПроцедуры

Процедура ДобавитьНастройкиПорядкаВертикальныхОбластей(ТаблицаПорядкаОбластей)
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ПраваяКолонкаУправленияЧеком_Вертикальная";
	НоваяСтрока.Область = "ПанельИтоговПоЧекам_Вертикальная";
	НоваяСтрока.Порядок = 1;
	НоваяСтрока.ВертикальнаяОриентация = Истина;
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ПраваяКолонкаУправленияЧеком_Вертикальная";
	НоваяСтрока.Область = "ГруппаСуммИУправленияЧеком_Вертикальная";
	НоваяСтрока.Порядок = 2;
	НоваяСтрока.ВертикальнаяОриентация = Истина;
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаСуммИУправленияЧеком_Вертикальная";
	НоваяСтрока.Область = "ГруппаСуммыТоваров_Вертикальная";
	НоваяСтрока.Порядок = 1;
	НоваяСтрока.ВертикальнаяОриентация = Истина;
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаСуммИУправленияЧеком_Вертикальная";
	НоваяСтрока.Область = "ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком_Вертикальная";
	НоваяСтрока.Порядок = 2;
	НоваяСтрока.ВертикальнаяОриентация = Истина;
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком_Вертикальная";
	НоваяСтрока.Область = "ГруппаQRCode_Вертикальная";
	НоваяСтрока.Порядок = 1;
	НоваяСтрока.ВертикальнаяОриентация = Истина;
	
	НоваяСтрока = ТаблицаПорядкаОбластей.Добавить();
	НоваяСтрока.ОбластьРодитель = "ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком_Вертикальная";
	НоваяСтрока.Область = "ГруппаКомандКОплате_Вертикальная";
	НоваяСтрока.Порядок = 2;
	НоваяСтрока.ВертикальнаяОриентация = Истина;
	
КонецПроцедуры

Процедура ОбновитьПорядокОбластейВНастройке_1_1_1_1(НастройкаОбъект, ЭлементМодифицирован)
	
	МассивИндексовУдаляемыхСтрок = Новый Массив;
	ОбновитьПорядокГоризонтальныхОбластей = Ложь;
	ОбновитьПорядокВертикальныхОбластей = Ложь;
	
	ОтборСтрок = Новый Структура("ОбластьРодитель", "ГруппаУправленияЧекомГор_Горизонтальная");
	СтрокиПорядка = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборСтрок);
	ДобавитьИндексыСтрокПорядкаВМассивУдаления(НастройкаОбъект.ПорядокОбластей,
		МассивИндексовУдаляемыхСтрок, СтрокиПорядка);
	
	ОтборСтрок = Новый Структура("ОбластьРодитель", "ГруппаУправленияОплатамиГор_Горизонтальная");
	СтрокиПорядка = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборСтрок);
	ДобавитьИндексыСтрокПорядкаВМассивУдаления(НастройкаОбъект.ПорядокОбластей,
		МассивИндексовУдаляемыхСтрок, СтрокиПорядка);
	Если СтрокиПорядка.Количество() > 0 Тогда
		ОбновитьПорядокГоризонтальныхОбластей = Истина;
	КонецЕсли;
	
	Если ОбновитьПорядокГоризонтальныхОбластей Тогда
		ЭлементМодифицирован = Истина;
		УдалитьУстаревшиеСтрокиПорядка(НастройкаОбъект.ПорядокОбластей, МассивИндексовУдаляемыхСтрок);
		ДобавитьНастройкиПорядкаГоризонтальныхОбластей(НастройкаОбъект.ПорядокОбластей);
	КонецЕсли;
	
	МассивИндексовУдаляемыхСтрок.Очистить();
	ОтборСтрок = Новый Структура("ОбластьРодитель", "ПраваяКолонкаУправленияЧеком_Вертикальная");
	СтрокиПорядка = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборСтрок);
	ДобавитьИндексыСтрокПорядкаВМассивУдаления(НастройкаОбъект.ПорядокОбластей,
		МассивИндексовУдаляемыхСтрок, СтрокиПорядка);
	ОбновитьПорядокВертикальныхОбластей = ПрисутствуютУстаревшиеДанныеВОбластиПравойКолнки(СтрокиПорядка);
	
	Если ОбновитьПорядокВертикальныхОбластей Тогда
		ЭлементМодифицирован = Истина;
		УдалитьУстаревшиеСтрокиПорядка(НастройкаОбъект.ПорядокОбластей, МассивИндексовУдаляемыхСтрок);
		ДобавитьНастройкиПорядкаВертикальныхОбластей(НастройкаОбъект.ПорядокОбластей);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьНастройкиПорядкаОбластей_1_1_1_1() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ЭлементМодифицирован = Ложь;
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			ОбновитьПорядокОбластейВНастройке_1_1_1_1(ОбъектНастройкаРМК, ЭлементМодифицирован);
			Если ЭлементМодифицирован Тогда
				ОбъектНастройкаРМК.ОбменДанными.Загрузка = Истина;
				ОбъектНастройкаРМК.Записать();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК при переходе на 1.0.19.48'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьОсновнуюКоманднуюПанельВПорядкеОбластейНастройки(НастройкаОбъект, ЭлементМодифицирован)
	
	ИмяГруппыДо = "ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком";
	ИмяГруппыПосле = "ОсновнаяКоманднаяПанельУправленияЧеком";
	Для Каждого СтрокаПорядка Из НастройкаОбъект.ПорядокОбластей Цикл
		
		Если СтрНайти(СтрокаПорядка.ОбластьРодитель, ИмяГруппыДо) = 1 Тогда
			СтрокаПорядка.ОбластьРодитель = СтрЗаменить(СтрокаПорядка.ОбластьРодитель, ИмяГруппыДо, ИмяГруппыПосле);
			ЭлементМодифицирован = Истина;
		КонецЕсли;
		Если СтрНайти(СтрокаПорядка.Область, ИмяГруппыДо) = 1 Тогда
			СтрокаПорядка.Область = СтрЗаменить(СтрокаПорядка.Область, ИмяГруппыДо, ИмяГруппыПосле);
			ЭлементМодифицирован = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьГруппуОсновнойКоманднойПанелиВПорядкеОбластей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ЭлементМодифицирован = Ложь;
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			ЗаменитьОсновнуюКоманднуюПанельВПорядкеОбластейНастройки(ОбъектНастройкаРМК, ЭлементМодифицирован);
			Если ЭлементМодифицирован Тогда
				ОбъектНастройкаРМК.ОбменДанными.Загрузка = Истина;
				ОбъектНастройкаРМК.Записать();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении группы основной командной панели в порядке областей настроек РМК'",
				КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПорядокОбластейСтаканаВертикальнаяОриентация(НастройкаОбъект, ЭлементМодифицирован)
	
	МассивИндексовУдаляемыхСтрок = Новый Массив;
	
	ОтборСтрок = Новый Структура("ОбластьРодитель", "ОсновнаяКоманднаяПанельУправленияЧеком_Вертикальная");
	СтрокиПорядка = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборСтрок);
	Если СтрокиПорядка.Количество() > 0 Тогда
		ЭлементМодифицирован = Истина;
		
		ДобавитьИндексыСтрокПорядкаВМассивУдаления(НастройкаОбъект.ПорядокОбластей,
			МассивИндексовУдаляемыхСтрок, СтрокиПорядка);
		ОтборСтрок = Новый Структура("ОбластьРодитель", "ПраваяКолонкаУправленияЧеком_Вертикальная");
		СтрокиПорядка = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборСтрок);
		ДобавитьИндексыСтрокПорядкаВМассивУдаления(НастройкаОбъект.ПорядокОбластей,
			МассивИндексовУдаляемыхСтрок, СтрокиПорядка);
			
		УдалитьУстаревшиеСтрокиПорядка(НастройкаОбъект.ПорядокОбластей, МассивИндексовУдаляемыхСтрок);
		
		ОтборСтрок = Новый Структура("ОбластьРодитель", "ГруппаСуммИУправленияЧеком_Вертикальная");
		СтрокиПорядка = НастройкаОбъект.ПорядокОбластей.НайтиСтроки(ОтборСтрок);
		Для Каждого СтрокаПорядка Из СтрокиПорядка Цикл
			СтрокаПорядка.ОбластьРодитель = "ПраваяКолонкаУправленияЧеком_Вертикальная";
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьНастройкиПорядкаОбластейСтаканаВертикальнаяОриентация() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ЭлементМодифицирован = Ложь;
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			ОбновитьПорядокОбластейСтаканаВертикальнаяОриентация(ОбъектНастройкаРМК, ЭлементМодифицирован);
			Если ЭлементМодифицирован Тогда
				ОбъектНастройкаРМК.ОбменДанными.Загрузка = Истина;
				ОбъектНастройкаРМК.Записать();
			КонецЕсли;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек порядка областей стакана при переходе на 1.1.1.7'",
				КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьОбластьВПорядкеОбластейНастройки(НастройкаОбъект, ИмяГруппыДо, ИмяГруппыПосле, ЭлементМодифицирован)
	
	Для Каждого СтрокаПорядка Из НастройкаОбъект.ПорядокОбластей Цикл
		
		Если СтрокаПорядка.ОбластьРодитель = ИмяГруппыДо Тогда
			СтрокаПорядка.ОбластьРодитель = ИмяГруппыПосле;
			ЭлементМодифицирован = Истина;
		КонецЕсли;
		Если СтрокаПорядка.Область = ИмяГруппыДо Тогда
			СтрокаПорядка.Область = ИмяГруппыПосле;
			ЭлементМодифицирован = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьНастройкиПорядкаОбластейДляГруппыБыстрыхОплат_1_1_2_4() Экспорт
	
	ИмяГруппыДо = "ГруппаQRCode_Горизонтальная";
	ИмяГруппыПосле = "ГруппаДополнительногоУправленияОплат_Горизонтальная";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ЭлементМодифицирован = Ложь;
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			ЗаменитьОбластьВПорядкеОбластейНастройки(ОбъектНастройкаРМК, ИмяГруппыДо, ИмяГруппыПосле, ЭлементМодифицирован);
			Если ЭлементМодифицирован Тогда
				ОбъектНастройкаРМК.ОбменДанными.Загрузка = Истина;
				ОбъектНастройкаРМК.Записать();
			КонецЕсли;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия
				= НСтр("ru = 'Ошибка при обновлении настроек порядка областей группы быстрых оплат при переходе на 1.1.1.7'",
					КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
