
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Параметры.Свойство("ИдентификаторПредложения", ИдентификаторЦелевогоПредложения);
	Параметры.Свойство("ИдентификаторЗаказа", ИдентификаторЗаказаФормыВладельца);
	
	УстановитьУсловноеОформление();
	НастроитьФормуПриСоздании();
	
	АдресКорзины = ТорговыеПредложенияСлужебный.АдресКорзиныИзЛокальногоХранилища();
	ЗапуститьЧтениеКорзины();
	
	НастроитьОтображениеПредупрежденияОРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОжидатьЗавершенияЧтенияКорзины(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьКонтактныеДанныеОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТорговыеПредложения_ПеречитатьДанныеКорзины"
		И Источник <> ЭтотОбъект Тогда
		
		ОтобразитьСтраницуДлительнойОперации();
		
		АдресДанныхКорзины = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "АдресДанныхКорзины", "");
		ПеречитатьКорзинуНаСервере(АдресДанныхКорзины);
		
		ТорговыеПредложенияСлужебныйКлиент.СформироватьАдресаВременныхХранилищДляРеквизита(
			Товары, "АдресИзображения", УникальныйИдентификатор);
		
		ЗагрузитьПредварительныеИзображенияКорзины(Товары);
		
	ИначеЕсли ИмяСобытия = "БизнесСеть_РегистрацияОрганизаций" Тогда
		
		НастроитьОтображениеПредупрежденияОРегистрации();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресДоставкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуКонтактнойИнформации();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьИсходящиеДокументыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуИсходящихДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	СпособДоставкиПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	
	СпособДоставкиПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(АдресДоставки) Тогда
		Если СпособДоставки = "Доставка" Тогда
			ПроверитьАдресПоказатьПодсказку();
		КонецЕсли;
	Иначе
		УстановитьЗаголовокПодсказкуАдреса(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаказы

&НаКлиенте
Процедура ЗаказыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ИдентификаторСвязи = ИдентификаторТекущегоЗаказа Тогда
		Возврат;
	КонецЕсли;
	
	ПриАктивацииЗаказаНаСервере();
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ИдентификаторПредложения = ТекущиеДанные.ИдентификаторПредложения;
	
	ДобавитьТоварИзменитьКоличество(
		ИдентификаторПредложения, 
		ТекущиеДанные.Количество, 
		ТекущиеДанные.АдресКомандыИзменитьКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКоличествоОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ОчиститьСообщения();
	
	КоличествоВведеноКорректно = ТорговыеПредложенияКлиент.КоличествоВведеноКорректно(
		СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Текст),
		ТекущиеДанные.МинимальноеКоличество,
		ТекущиеДанные.КратностьУпаковки);
	
	Если Не КоличествоВведеноКорректно Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьПредупрежденияПоТовару(
		ТекущиеДанные.ЕстьНарушенияОграничений, ТекущиеДанные.НарушенияОграничений); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "НоменклатураКоличество" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = ТорговыеПредложенияКлиент.НовыеПараметрыОткрытияФормыТорговогоПредложения();
	ПараметрыОткрытия.Идентификатор = ТекущиеДанные.ИдентификаторПредложения;
	ПараметрыОткрытия.Валюта = Валюта;
	ПараметрыОткрытия.ИдентификаторЗаказа = ИдентификаторЗаказаФормыВладельца;
	ПараметрыОткрытия.Организация = Организация;
	
	ТорговыеПредложенияКлиент.ОткрытьТорговоеПредложение(
		ПараметрыОткрытия, ЭтотОбъект, ТекущиеДанные.ИдентификаторПредложения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьТовар(Команда)
	
	ТорговыеПредложенияКлиент.ОткрытьФормуПоискаПоОтборам();

КонецПроцедуры

&НаКлиенте
Процедура УдалитьТовар(Команда)
	
	ТекущиеДанныеЗаказа = Элементы.Заказы.ТекущиеДанные;
	
	Если ТекущиеДанныеЗаказа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторЗаказаВСервисе = ТекущиеДанныеЗаказа.ИдентификаторЗаказаВСервисе;
	
	ТекущиеДанныеТовара = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанныеТовара = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	НастроитьЭлементыДлительнойОперации(Истина, Истина);
	
	УдалитьТоварИзКорзины(ТекущиеДанныеТовара.ИдентификаторПредложения, 
		ИдентификаторЗаказаВСервисе, ТекущиеДанныеТовара.АдресКомандыУдалить);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаказ(Команда)
	
	ОтправитьЗаказНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКорзину(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УдалитьКорзинуЗавершение", ЭтотОбъект);
	ТорговыеПредложенияКлиент.УдалитьКорзинуДиалог(ЭтотОбъект, Организация, АдресКорзины, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсходящиеДокументы(Команда)
	ОткрытьФормуИсходящихДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналРегистрации(Команда)
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Данные", НаименованиеФоновогоЗаданияЧтенияКорзины);
	
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьКорзину(Команда)
	ЗапуститьЧтениеКорзины();
	ОжидатьЗавершенияЧтенияКорзины();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодключитьОрганизацию(Команда)
	
	Если Организация.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПодключениеОрганизацииПродолжение", ЭтотОбъект);
	ТорговыеПредложенияКлиент.ОткрытьФормуПодключенияОрганизации(Организация, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьАдресДоставки(Команда)
	ОткрытьФормуКонтактнойИнформации();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьАдресДоставки(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриУдаленияАдресаЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения, 
		НСтр("ru = 'Адрес будет удален из списка. Продолжить?'"), 
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступноеКоличество(Команда)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Количество = ТекущиеДанные.ДоступноеКоличество;

	ИдентификаторПредложения = ТекущиеДанные.ИдентификаторПредложения;
	
	ДобавитьТоварИзменитьКоличество(
		ИдентификаторПредложения, 
		ТекущиеДанные.Количество, 
		ТекущиеДанные.АдресКомандыИзменитьКоличество);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонтактнаяИнформация

&НаКлиенте
Процедура ОткрытьФормуКонтактнойИнформации()
	
	ПараметрыВида = ПараметрыВидаКонтактнойИнформации();
	
	ПараметрыВида.Наименование = НСтр("ru = 'Укажите адрес доставки'");
	ПараметрыВида.РедактированиеТолькоВДиалоге      = Истина;
	
	ПараметрыОткрытия = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
		ПараметрыВида, АдресДоставки);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуКонтактнойИнформацииЗавершение", ЭтотОбъект);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтактнойИнформацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеАдреса = Результат.Значение;
	ОбработатьАдресПослеВыбора(ЗначениеАдреса);
	
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьАдресаЗаказа(ЭтотОбъект, ТекущиеДанные);
	
	АдресДоставки = ЗначениеАдреса;
	
	ПроверитьАдресПоказатьПодсказку();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыВидаКонтактнойИнформации()
	
	Возврат УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(
		ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	
КонецФункции

&НаСервере
Процедура ОбработатьАдресПослеВыбора(ЗначениеАдреса)
	
	СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(ЗначениеАдреса, Новый Структура("КодыАдреса", Истина));
	
	СтрокаАдреса = СтрокаАдресаПоЗначениюАдреса(АдресаОрганизации, Организация, ЗначениеАдреса);
	Если СтрокаАдреса = Неопределено Тогда
		СтрокаАдреса = АдресаОрганизации.Добавить();
	Иначе
		ЗначениеАдреса = СтрокаАдреса.ЗначенияПолей;
		Возврат;
	КонецЕсли;
	
	СтрокаАдреса.КодСтраны            = СведенияОбАдресе.КодСтраны;
	СтрокаАдреса.ИдентификаторФИАС    = Строка(СведенияОбАдресе.ИдентификаторАдресногоОбъекта);
	СтрокаАдреса.ПредставлениеАдреса  = СведенияОбАдресе.Представление;
	СтрокаАдреса.Организация          = Организация;
	СтрокаАдреса.ЭтоПроизвольныйАдрес = Истина;
	СтрокаАдреса.ЗначенияПолей        = ЗначениеАдреса;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАдресПоказатьПодсказку()
	
	Если СпособДоставки = "Самовывоз" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресДоставки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.Заказы.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаАдреса = АдресаОрганизации.НайтиСтроки(
		Новый Структура("ЗначенияПолей, Организация", АдресДоставки, Организация))[0];
	
	ДанныеАдреса = РаботаСАдресами.АдресПоИдентификатору(СтрокаАдреса.ИдентификаторФИАС);
	
	СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(ДанныеАдреса, Новый Структура("КодыАдреса", Истина));
	
	ИдентификаторыДляПроверки = Новый Массив;
	
	ДобавитьИдентификаторВМассив(ИдентификаторыДляПроверки, СведенияОбАдресе.Идентификаторы.Регион);
	ДобавитьИдентификаторВМассив(ИдентификаторыДляПроверки, СведенияОбАдресе.Идентификаторы.Район);
	ДобавитьИдентификаторВМассив(ИдентификаторыДляПроверки, СведенияОбАдресе.Идентификаторы.МуниципальныйРайон);
	ДобавитьИдентификаторВМассив(ИдентификаторыДляПроверки, СведенияОбАдресе.Идентификаторы.Город);
	
	ВозможнаДоставкаПоАдресу = Ложь;
	
	ТекущиеДанные = Заказы.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Для каждого ЭлементКоллекции Из ТекущиеДанные.РегионыДоставки Цикл
		
		Если Не ЗначениеЗаполнено(ЭлементКоллекции.ИдентификаторФИАС)
			И СведенияОбАдресе.КодСтраны = ЭлементКоллекции.КодСтраны Тогда
			
			ВозможнаДоставкаПоАдресу = Истина;
			Прервать;
		КонецЕсли;
		
		Если ИдентификаторыДляПроверки.Найти(ЭлементКоллекции.ИдентификаторФИАС) <> Неопределено Тогда
			ВозможнаДоставкаПоАдресу = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВозможнаДоставкаПоАдресу Тогда
		УстановитьЗаголовокВидимостьПодсказкиАдреса(ЭтотОбъект, "ПодсказкаНеТребуется");
	Иначе
		УстановитьЗаголовокВидимостьПодсказкиАдреса(ЭтотОбъект, "НеПоддерживаетсяАдрес");	
	КонецЕсли;
	
	СтрокаАдреса = СтрокаАдресаПоЗначениюАдреса(АдресаОрганизации, Организация, АдресДоставки);
	
	Если СтрокаАдреса <> Неопределено И СтрокаАдреса.ЭтоПроизвольныйАдрес Тогда
		Элементы.УдалитьАдресДоставки.Видимость = Истина;
	Иначе
		Элементы.УдалитьАдресДоставки.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаАдресаПоЗначениюАдреса(Знач АдресаОрганизации, Знач ТекущаяОрганизация, Знач ЗначенияПолей)
	
	Результат = Неопределено;
	
	СтрокиАдресов = АдресаОрганизации.
		НайтиСтроки(Новый Структура("Организация, ЗначенияПолей", ТекущаяОрганизация, ЗначенияПолей));
	
	Если ЗначениеЗаполнено(СтрокиАдресов) Тогда
		Результат = СтрокиАдресов[0];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ДобавитьИдентификаторВМассив(МассивИдентификаторов, Идентификатор)
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	МассивИдентификаторов.Добавить(Строка(Идентификатор));
	
КонецПроцедуры

#КонецОбласти

#Область РаботаФормы

&НаСервере
Процедура УстановитьУсловноеОформление()
	
 	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Таблица товаров
                
	// Зачеркнутая цена до скидки и видимость колонки
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыЦенаДоСкидки.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.ЦенаДоСкидки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(
		"Шрифт", 
		ШрифтыСтиля.ЗачеркнутыйШрифтБЭД);
		
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
		
	// Отметка заказа с ошибками 
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НоменклатураПредставлениеНоменклатуры.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.ЕстьНарушенияОграничений");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(
		"ТипОтметки", 
		ТипОтметкиЯчейкиТаблицы.ЗначокКруг);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(
		"ЦветОтметки", 
		ЦветаПалитры.Красный); 
		
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Таблица заказов
		
	// Отметка заказа с ошибками 
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыПредставлениеЗаказа.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Заказы.ЕстьОшибки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(
		"ТипОтметки", 
		ТипОтметкиЯчейкиТаблицы.ЗначокКруг);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(
		"ЦветОтметки", 
		ЦветаПалитры.Красный);
		
	// Отметка заказа с предупреждениями
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыПредставлениеЗаказа.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Заказы.ЕстьПредупреждения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(
		"ТипОтметки", 
		ТипОтметкиЯчейкиТаблицы.ЗначокКруг);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(
		"ЦветОтметки", 
		ЦветаПалитры.ПервыйБрендовый);

	// Отметка заказа без предупреждений и ошибок
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыПредставлениеЗаказа.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Заказы.ЕстьПредупреждения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Заказы.ЕстьОшибки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(
		"ТипОтметки", 
		ТипОтметкиЯчейкиТаблицы.ЗначокКруг);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(
		"ЦветОтметки", 
		ЦветаПалитры.Зеленый); 
				
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеПредупрежденияОРегистрации()
	ТорговыеПредложенияСлужебный.НастроитьОтображениеПредупрежденияОРегистрацииОрганизации(
		ЭтотОбъект, Организация, "ГруппаОшибкаРегистрации");
КонецПроцедуры 

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗаполнитьСписокАдресовОрганизации();
	
	ДанныеОрганизации = ДанныеОрганизацииИзНастроек(Организация);
	Если ДанныеОрганизации <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеОрганизации);
		ЗаполнитьАдресаОрганизацииИзНастроек(Организация, ДанныеОрганизации);
	КонецЕсли;

	НастроитьОтображениеПредупрежденияОРегистрации();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеФормыВСтрокуЗаказа()
	
	Если Не ЗначениеЗаполнено(ИдентификаторТекущегоЗаказа) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиЗаказов = Заказы.НайтиСтроки(Новый Структура("ИдентификаторСвязи", ИдентификаторТекущегоЗаказа));
	
	Если Не ЗначениеЗаполнено(СтрокиЗаказов) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаЗаказа = СтрокиЗаказов[0];
	
	ПоляЗаполнения = РедактируемыеПоляЗаказа();
	
	ЗаполнитьЗначенияСвойств(СтрокаЗаказа, ЭтотОбъект, ПоляЗаполнения);
	
	СтрокаЗаказа.Телефон = ТелефонЦифрами(СтрокаЗаказа.Телефон);
	
	УстановитьКонтактныеДанныеОрганизацииВсемЗаказам();
	
	СохранитьКонтактныеДанныеОрганизации();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РедактируемыеПоляЗаказа()
	
	// Поля реквизита форма Заказы.
	Результат = "Организация, НаименованиеПокупателя, ЭлектроннаяПочта, 
		|Телефон, КомментарийКЗаказу, СпособДоставки, АдресДоставки,
		|СуммаСНДС, СуммаНДС, Валюта";
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьКонтактныеДанныеОрганизацииВсемЗаказам()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ПоляЗаполненияЗаказа = РедактируемыеПоляЗаказа();
	ПоляЗаполнения = СтрРазделить(ПоляЗаполненияЗаказа, ",", Ложь);
	
	Для Каждого ЭлементКоллекции Из Заказы Цикл
		
		Если ЗначениеЗаполнено(ЭлементКоллекции.Организация)
			И Организация <> ЭлементКоллекции.Организация Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ПолеЗаказа Из ПоляЗаполнения Цикл
			ТекущееПоле = СтрЗаменить(СокрЛП(ПолеЗаказа), Символы.ПС, "");
			Если ЗначениеЗаполнено(ЭлементКоллекции[ТекущееПоле]) Тогда
				Продолжить;
			КонецЕсли;
			ЭлементКоллекции[ТекущееПоле] = ЭтотОбъект[ТекущееПоле];
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиПриИзмененииНаКлиенте()
	
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	АдресДоставки = "";
	
	ЗаполнитьАдресаЗаказа(ЭтотОбъект, ТекущиеДанные);
	
	УстановитьЗаголовокПодсказкуАдреса(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокПодсказкуАдреса(Форма)
	
	Элементы       = Форма.Элементы;
	СпособДоставки = Форма.СпособДоставки;
	
	Если СпособДоставки = "Самовывоз" Тогда
		Элементы.АдресДоставки.Заголовок = НСтр("ru = 'Адрес самовывоза'");
	Иначе
		Элементы.АдресДоставки.Заголовок = НСтр("ru = 'Адрес доставки'");
	КонецЕсли;
	
	Если Элементы.Заказы.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Форма.Заказы.НайтиПоИдентификатору(Элементы.Заказы.ТекущаяСтрока);
	
	УстановитьСвойстваАдресДоставки(Элементы, Ложь, Ложь, Ложь);
	
	Если СпособДоставки = "Самовывоз"
		И Не ЗначениеЗаполнено(ТекущиеДанные.АдресаСамовывоза) Тогда
		
		УстановитьЗаголовокВидимостьПодсказкиАдреса(Форма, "НевозможенСамовывоз");
		
	ИначеЕсли СпособДоставки = "Доставка"
		И Не ЗначениеЗаполнено(ТекущиеДанные.РегионыДоставки) Тогда
		
		УстановитьЗаголовокВидимостьПодсказкиАдреса(Форма, "НевозможнаДоставка");

	Иначе
		
		АдресДоставкиЗаполнен = Не ПустаяСтрока(Форма.АдресДоставки);
		ЭтоДоставка = СпособДоставки = "Доставка";
		КнопкаУдалитьАдрес = Не ЭтоДоставка И АдресДоставкиЗаполнен;
		УстановитьСвойстваАдресДоставки(Элементы, Истина, КнопкаУдалитьАдрес, ЭтоДоставка);
		УстановитьЗаголовокВидимостьПодсказкиАдреса(Форма, "ПодсказкаНеТребуется");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваАдресДоставки(Элементы, ЗначениеАдреса, ЗначениеДекорации, ЗначениеКнопкиОткрытие)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "АдресДоставки", "Доступность", ЗначениеАдреса);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "УдалитьАдресДоставки", "Видимость", ЗначениеДекорации);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "АдресДоставки", "КнопкаОткрытия", ЗначениеКнопкиОткрытие);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокВидимостьПодсказкиАдреса(Форма, ВидПодсказки)
	
	Элементы = Форма.Элементы;
	
	Если ВидПодсказки = "НевозможенСамовывоз" Тогда
		
		Элементы.ПояснениеКАдресу.Заголовок 
			= НСтр("ru = 'Поставщик не указал адреса самовывоза. Возможно, осуществить самовывоз нельзя.'");
			
	ИначеЕсли ВидПодсказки = "НевозможнаДоставка" Тогда	
		
		Элементы.ПояснениеКАдресу.Заголовок 
			= НСтр("ru = 'Поставщик не указал регионы доставки. Возможно, поставщик не осуществляет доставку.'");

	ИначеЕсли ВидПодсказки = "НеПоддерживаетсяАдрес" Тогда	
		
		Элементы.ПояснениеКАдресу.Заголовок 
			= НСтр("ru = 'Выбранный адрес не входит в состав регионов доставки, указанных поставщиком. Возможно, поставщик не осуществляет доставку по этому адресу.'");
			
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ПояснениеКАдресу", "Видимость", ВидПодсказки <> "ПодсказкаНеТребуется");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуИсходящихДокументов()
	
	ОчиститьСообщения();
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("РежимИсходящихДокументов", Истина);
	
	ОткрытьФорму("Обработка.БизнесСеть.Форма.ДокументыОбмена", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуУспешнойОтправки()
		
	Элементы.СтраницыЗаказыТовары.ТекущаяСтраница = Элементы.СтраницаЗавершение;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокАдресовОрганизации()
	
	Адреса = БизнесСеть.АдресаОрганизации(Организация);
	
	Для Каждого ТекущийАдрес Из Адреса Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ПредставлениеАдреса", ТекущийАдрес.Представление);
		ПараметрыОтбора.Вставить("Организация", Организация);
		НайденныеСтроки = АдресаОрганизации.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(
			ТекущийАдрес.ЗначенияПолей, Новый Структура("КодыАдреса", Истина));
		
		ИдентификаторАдреса = ?(
			ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторДома),
			Строка(СведенияОбАдресе.ИдентификаторДома),
			Строка(СведенияОбАдресе.ИдентификаторАдресногоОбъекта));
		
		Если Не ЗначениеЗаполнено(ИдентификаторАдреса) Тогда
			Продолжить;
		КонецЕсли;
		
		КодСтраны = Строка(СведенияОбАдресе.КодСтраны);
		
		НоваяСтрока = АдресаОрганизации.Добавить();
		
		НоваяСтрока.ПредставлениеАдреса = ТекущийАдрес.Представление;
		НоваяСтрока.КодСтраны           = КодСтраны;
		НоваяСтрока.ИдентификаторФИАС   = ИдентификаторАдреса;
		НоваяСтрока.Организация         = Организация;
		НоваяСтрока.ЗначенияПолей       = ТекущийАдрес.ЗначенияПолей;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПриСоздании()
	
	УстановитьНастройкиПустойКорзины();
	
	НастроитьЭлементыДлительнойОперации(Истина);
	
	ЗаполнитьСписокАдресовОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиПустойКорзины()
	
	Элементы.ПредупреждениеПоЗаказу.Видимость       = Ложь;
	Элементы.ПояснениеКАдресу.Видимость             = Ложь;
	Элементы.УдалитьАдресДоставки.Видимость        = Ложь;
	Элементы.ОчиститьКорзину.Доступность = Заказы.Количество();
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОповещениеОтправкиДокумента(ПредставлениеДокумента)
	
	ТекстОповещения = СтрШаблон(
		НСтр("ru = '%1 отправлен.'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()),
		ПредставлениеДокумента);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеНажатияНаОповещениеОтправкиДокумента", ЭтотОбъект);
	
	ТекстПояснения = НСтр(
		"ru = 'Все отправленные заказы можно увидеть в Исходящих документах.'", 
		ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	
	ПоказатьОповещениеПользователя(
		ТекстОповещения,
		ОписаниеОповещения,
		ТекстПояснения,
		БиблиотекаКартинок.БизнесСеть);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеНажатияНаОповещениеОтправкиДокумента(ДополнительныеПараметры) Экспорт
	ОткрытьФормуИсходящихДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСообщитьОНарушенииОграничений(Отказ)
	
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТоварыЗаказа = Товары.НайтиСтроки(
		Новый Структура("ИдентификаторСвязи", ТекущиеДанные.ИдентификаторСвязи));
	
	Для Каждого ТекущийТовар Из ТоварыЗаказа Цикл
		
		// В ТекущийТовар.НарушенияОграничений попадают: 
		// - NoOfferAvailable - предложение товара больше недоступно
		// - TemporarilyOutOfSales - предложение товара временно снято с продажи
		Если ЗначениеЗаполнено(ТекущийТовар.НарушенияОграничений) Тогда
			
			Отказ = Истина;
			
			Для Каждого ТекущееНарушение Из ТекущийТовар.НарушенияОграничений Цикл
				
				ТекстСообщения = СтрШаблон("%1: %2", 
					ТекущийТовар.ПредставлениеНоменклатуры,
					ТекущееНарушение.Значение);
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				
			КонецЦикла;
			
		КонецЕсли
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеДанных(Отказ)
	
	Если Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(ЭлектроннаяПочта) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Некорректно заполнен адрес электронной почты'"),,
			"ЭлектроннаяПочта");
			
		Отказ = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция ТелефонЦифрами(Знач Телефон)
	
	СтрокаТелефона = "";
	Числа = "0123456789";
	
	ДлинаПредставленияТелефона = СтрДлина(Телефон);
	Для Индекс = 1 По ДлинаПредставленияТелефона Цикл
		
		Символ = Сред(Телефон, Индекс, 1);
		Если СтрНайти(Числа, Символ) > 0 Тогда
			СтрокаТелефона = СтрокаТелефона + Символ;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокаТелефона;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокЗаказа()
	
	КоличествоЗаказов = Заказы.Количество();
	Если КоличествоЗаказов = 0 Тогда
		УстановитьЗаголовокГруппыЗаказыПоУмолчанию();
		Возврат;
	КонецЕсли;
	
	ШаблонЗаголовка = НСтр("ru = 'Заказы к отправке: %1'");
	ЗаголовокГруппыЗаказы = СтрШаблон(ШаблонЗаголовка, КоличествоЗаказов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаЗаказы", "Заголовок", ЗаголовокГруппыЗаказы);
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьЗаголовокГруппыЗаказыПоУмолчанию()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаЗаказы", "Заголовок", НСтр("ru = 'Заказы к отправке'", ОбщегоНазначения.КодОсновногоЯзыка()));
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПозиционированиеНаЦелевомПредложении()
	
	ОтборПредложений = Новый Структура("ИдентификаторПредложения", ИдентификаторЦелевогоПредложения);
	НайденныеСтрокиПредложений = Товары.НайтиСтроки(ОтборПредложений);
	Если НайденныеСтрокиПредложений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСвязи = НайденныеСтрокиПредложений[0].ИдентификаторСвязи;
	ОтборЗаказа = Новый Структура("ИдентификаторСвязи", ИдентификаторСвязи);
	НайденныеСтрокиЗаказа = Заказы.НайтиСтроки(ОтборЗаказа); 
	Если НайденныеСтрокиЗаказа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Заказы.ТекущаяСтрока = НайденныеСтрокиЗаказа[0].ПолучитьИдентификатор();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСтраницуДлительнойОперации()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницыЗаказыТовары", "ТекущаяСтраница", Элементы.СтраницаДлительнаяОперация);
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСтраницуОшибки()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницыЗаказыТовары", "ТекущаяСтраница", Элементы.СтраницаОшибка);
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСтраницуСодержимогоКорзины()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницыЗаказыТовары", "ТекущаяСтраница", Элементы.СтраницаЗаказыТовары);
КонецПроцедуры

#КонецОбласти

#Область ФоновыеЗадания

#Область ЧтениеКорзины

&НаСервере
Процедура ЗапуститьЧтениеКорзины()
	
	ОтобразитьСтраницуДлительнойОперации();
	НаименованиеФоновогоЗаданияЧтенияКорзины = ТорговыеПредложенияСлужебный.НаименованиеЗаданияЧтенияКорзины();
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Организация", Организация);
	ПараметрыМетода.Вставить("АдресКорзины", АдресКорзины);
	
	ФоновоеЗаданиеЧтениеКорзины = ТорговыеПредложенияСлужебный.СоздатьПрочитатьКорзинуВФоне(
		ПараметрыМетода, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершенияЧтенияКорзины()
	
	Если Не ЗначениеЗаполнено(ФоновоеЗаданиеЧтениеКорзины) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения    = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ЧтениеКорзиныЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗаданиеЧтениеКорзины, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеКорзиныЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеКорзиныЗавершениеНаСервере(Результат.АдресРезультата); 
		
	ТорговыеПредложенияСлужебныйКлиент.СформироватьАдресаВременныхХранилищДляРеквизита(
		Товары, "АдресИзображения", УникальныйИдентификатор);
	
	ЗагрузитьПредварительныеИзображенияКорзины(Товары);
	
	Если Не ПустаяСтрока(ИдентификаторЦелевогоПредложения) Тогда
		ВыполнитьПозиционированиеНаЦелевомПредложении();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЧтениеКорзиныЗавершениеНаСервере(АдресРезультата)
	
	ПеречитатьКорзинуНаСервере(АдресРезультата);
	
	ЗаполнитьКонтактныеДанныеОрганизацийПриСозданииФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьПредварительныеИзображенияКорзины(Знач Товары)
	
	Для каждого СтрокаТовара Из Товары Цикл
		
		АдресИзображенияВСервисе = СтрокаТовара.АдресИзображенияВСервисе;
		АдресПредварительногоИзображенияВСервисе = ТорговыеПредложенияСлужебныйКлиентСервер.
			АдресПредварительногоИзображенияПоАдресуОсновногоИзображенияИзСервиса(АдресИзображенияВСервисе);
		АдресИзображения = СтрокаТовара.АдресИзображения;
		
		Если ПустаяСтрока(АдресПредварительногоИзображенияВСервисе) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ТорговыеПредложенияСлужебный.ПоместитьСкачанноеИзображениеПоАдресуХранилища(
				АдресПредварительногоИзображенияВСервисе, АдресИзображения);
		Исключение
			СтрокаТовара.АдресИзображения = "";
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область РаботаСТоваром

&НаКлиенте
Процедура ДобавитьТоварИзменитьКоличество(ИдентификаторПредложения, Количество, АдресКоманды);
	
	ПараметрыОповещения = Новый Структура("ИдентификаторПредложения", ИдентификаторПредложения);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействияНадТоваром", ЭтотОбъект, ПараметрыОповещения);
	
	ПараметрыРаботыСТоваром = ТорговыеПредложенияКлиент.ОписаниеПараметровРаботыСТоваромКорзины();
	
	ПараметрыРаботыСТоваром.Организация                    = Организация;
	ПараметрыРаботыСТоваром.АдресКомандыИзменитьКоличество = АдресКоманды;
	ПараметрыРаботыСТоваром.Количество                     = Количество;
	ПараметрыРаботыСТоваром.ПрочитатьКорзину               = Истина;
	ПараметрыРаботыСТоваром.АдресКорзины                   = АдресКорзины;
	
	ТорговыеПредложенияКлиент.ВыполнитьДействиеСТоваромКорзины(ПараметрыРаботыСТоваром, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТоварИзКорзины(ИдентификаторПредложения, ИдентификаторЗаказа, АдресКоманды)
	
	ПараметрыОповещения = Новый Структура("ИдентификаторПредложения, ИдентификаторЗаказа", 
		ИдентификаторПредложения, ИдентификаторЗаказа);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействияНадТоваром", ЭтотОбъект, ПараметрыОповещения);
	
	ПараметрыРаботыСТоваром = ТорговыеПредложенияКлиент.ОписаниеПараметровРаботыСТоваромКорзины();
	
	ПараметрыРаботыСТоваром.Организация         = Организация;
	ПараметрыРаботыСТоваром.АдресКомандыУдалить = АдресКоманды;
	ПараметрыРаботыСТоваром.ПрочитатьКорзину    = Истина;
	ПараметрыРаботыСТоваром.АдресКорзины        = АдресКорзины;
	ПараметрыРаботыСТоваром.ВидОперации         = "Удаление";
		
	ТорговыеПредложенияКлиент.ВыполнитьДействиеСТоваромКорзины(ПараметрыРаботыСТоваром, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияДействияНадТоваром(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ПослеВыполненияДействияНадТоваромНаСервере(Результат.АдресРезультата, ДополнительныеПараметры);
	
	ТорговыеПредложенияСлужебныйКлиент.СформироватьАдресаВременныхХранилищДляРеквизита(
		Товары, "АдресИзображения", УникальныйИдентификатор);
	
	ЗагрузитьПредварительныеИзображенияКорзины(Товары);

	ТорговыеПредложенияКлиент.ОповеститьОбИзмененииКорзины(Результат.АдресРезультата, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыполненияДействияНадТоваромНаСервере(АдресРезультата, ДополнительныеПараметры)
	
	ПеречитатьКорзинуНаСервере(АдресРезультата);
	
	Если ДополнительныеПараметры.Свойство("ИдентификаторЗаказа") Тогда
		НастроитьЭлементыДлительнойОперации(Ложь, Истина);
		ПроверитьУстановитьТекущийЗаказ(ДополнительныеПараметры.ИдентификаторЗаказа);
	Иначе
		УстановитьТекущийТовар(ДополнительныеПараметры.ИдентификаторПредложения);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Корзина

&НаСервере
Процедура ЗаполнитьКонтактныеДанныеОрганизацийПриСозданииФормы()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОрганизации = ДанныеОрганизацииИзНастроек(Организация);
	
	Если ДанныеОрганизации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьАдресаОрганизацииИзНастроек(Организация, ДанныеОрганизации);
	
	Для каждого ЭлементКоллекции Из Заказы Цикл
		ЗаполнитьЗначенияСвойств(ЭлементКоллекции, ДанныеОрганизации);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресаОрганизацииИзНастроек(Организация, ДанныеОрганизации)
	
	Для Каждого ТекущийАдрес Из ДанныеОрганизации.Адреса Цикл
		
		Если Не ЗначениеЗаполнено(ТекущийАдрес.ПредставлениеАдреса) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиАдресов = АдресаОрганизации.НайтиСтроки(
			Новый Структура("ЗначенияПолей, Организация", ТекущийАдрес.ЗначенияПолей, Организация));
		
		Если ЗначениеЗаполнено(СтрокиАдресов) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = АдресаОрганизации.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийАдрес);
		
		НоваяСтрока.ЭтоПроизвольныйАдрес = Истина;
		НоваяСтрока.Организация = Организация;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РедактируемыеКолонкиЗаказа()
	
	Результат = "Организация, НаименованиеПокупателя, ЭлектроннаяПочта, 
		|Телефон, КомментарийКЗаказу, СпособДоставки, АдресДоставки,
		|ИдентификаторЗаказаВСервисе";
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПеречитатьКорзинуНаСервере(АдресДанныхКорзины = Неопределено, Отказ = Ложь)
	
	НастроитьЭлементыДлительнойОперации(Ложь);
		
	ДанныеСервиса = ПолучитьИзВременногоХранилища(АдресДанныхКорзины);
	
	Если Не ЗначениеЗаполнено(ДанныеСервиса) Тогда
		ОтобразитьСтраницуОшибки();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаказыДоПерезаполнения = Новый ТаблицаЗначений;
	Если ЗначениеЗаполнено(Заказы) Тогда
		ЗаказыДоПерезаполнения = Заказы.Выгрузить(, РедактируемыеКолонкиЗаказа());
	КонецЕсли;
	
	ОчиститьДанныеКорзины();
	УстановитьНастройкиПустойКорзины();
	
	ДанныеКорзины = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСервиса, "ДанныеКорзины", Неопределено);
	Если ДанныеКорзины = Неопределено
		Или Не ЗначениеЗаполнено(ДанныеКорзины.Заказы) Тогда
		ОтобразитьСтраницуПустойКорзины();
		Возврат;
	КонецЕсли;
	
	// Корзина пустая, форма открыта. При добавлении товаров из других форм, присваиваем адрес корзины.
	Если ПустаяСтрока(АдресКорзины) Тогда
		АдресКорзины = ДанныеКорзины.АдресКорзины;
	КонецЕсли;
	
	ЗаполнитьЗаказы(ДанныеКорзины.Заказы, ЗаказыДоПерезаполнения);
	
	АдресКомандыДобавить = ДанныеСервиса.ДанныеКорзины.АдресаКоманд.ДобавитьТовар;
	
	УстановитьЗаголовокЗаказа();
	
	ОбновитьИтоги(ДанныеСервиса.ДанныеКорзины.ОбщиеИтоги);
	
	Элементы.ОчиститьКорзину.Доступность = Заказы.Количество();
	
	ОтобразитьСтраницуСодержимогоКорзины();
			
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтоги(ИтогиКорзины = Неопределено)
	
	Если ИтогиКорзины = Неопределено Тогда
		ТекстИтогов = НСтр("ru = 'Корзина пуста'", ОбщегоНазначения.КодОсновногоЯзыка());
	Иначе

		ШаблонТекстаИтогов = НСтр("ru = '<b>%1</b> %2 на сумму <b>%3</b> %4'", ОбщегоНазначения.КодОсновногоЯзыка());
		ШаблонТекстаИтоговПоЗапросуЦен = НСтр("ru = '<b>%1</b> %2 для запроса цены'", ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстИтогов = "";
		
		Для Каждого ДанныеВВалюте Из ИтогиКорзины Цикл
		
			СклоненияПозиций = ПолучитьСклоненияСтрокиПоЧислу("позиция", ДанныеВВалюте.КоличествоПозиций, "", 
				"ЧС=Количественное", "ПД=Именительный; ПЧ=Число"); 
			ТекстСклонения = СокрЛП(СтрЗаменить(СклоненияПозиций[0], ДанныеВВалюте.КоличествоПозиций, ""));

			Если ЗначениеЗаполнено(ДанныеВВалюте.Валюта) Тогда
				
				ТекстИтогов = ТекстИтогов 
					+ Символы.ПС 
					+ СтрШаблон(ШаблонТекстаИтогов,
						ДанныеВВалюте.КоличествоПозиций,
						ТекстСклонения,
						ДанныеВВалюте.Сумма, 
						ДанныеВВалюте.Валюта);
			Иначе
				
				ТекстИтогов = ТекстИтогов 
					+ Символы.ПС 
					+ СтрШаблон(ШаблонТекстаИтоговПоЗапросуЦен,
						ДанныеВВалюте.КоличествоПозиций,
						ТекстСклонения);
			КонецЕсли ;
					
		КонецЦикла;
		
		ТекстИтогов = СокрЛ(ТекстИтогов);

	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(
		Элементы, "ДекорацияОбщиеИтогиКорзины", "Заголовок") <> ТекстИтогов Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ДекорацияОбщиеИтогиКорзины", "Заголовок", 
			СтроковыеФункции.ФорматированнаяСтрока(ТекстИтогов));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКорзинуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьКорзинуЗавершениеНаСервере(Результат.АдресРезультата);
	
	ТорговыеПредложенияСлужебныйКлиент.СформироватьАдресаВременныхХранилищДляРеквизита(
		Товары, "АдресИзображения", УникальныйИдентификатор);
	
	ЗагрузитьПредварительныеИзображенияКорзины(Товары);

	ТорговыеПредложенияКлиент.ОповеститьОбИзмененииКорзины(АдресКорзины, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКорзинуЗавершениеНаСервере(АдресРезультата)
	
	ОчиститьДанныеКорзины();
	
	УстановитьНастройкиПустойКорзины();
	
	УдалитьАдресКорзиныИзЛокальногоХранилища();
	ПеречитатьКорзинуНаСервере(АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьАдресКорзиныИзЛокальногоХранилища()
	
	ТорговыеПредложенияСлужебный.УдалитьАдресКорзиныИзЛокальногоХранилища();
	АдресКорзины = "";
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеКорзины()
	
	Заказы.Очистить();
	Товары.Очистить();
	ИдентификаторТекущегоЗаказа = Неопределено;
	ПредупреждениеПоЗаказу = "";
	УстановитьЗаголовокГруппыЗаказыПоУмолчанию();
	
	СуммаНДС = 0;
	СуммаСНДС = 0;
	Валюта = Неопределено;
	
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПредупрежденияПоТовару(ЕстьНарушенияОграничений, СписокНарушений) 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПредупреждениеПоТовару", "Видимость", ЕстьНарушенияОграничений);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "УстановитьДоступноеКоличество", "Видимость", ЕстьПревышениеДоступногоКоличества(СписокНарушений));

КонецПроцедуры

&НаКлиенте
Функция ЕстьПревышениеДоступногоКоличества(СписокНарушений)
	
	Результат = Ложь;
	
	КлючевоеСловоКоличество = НСтр("ru = 'количество'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	КлючевоеСловоБольше = НСтр("ru = 'больше'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	
	Для Каждого ЭлементСписка Из СписокНарушений Цикл
		ТекстОграничения = НРег(ЭлементСписка.Значение);
		Если СтрНайти(ТекстОграничения, КлючевоеСловоКоличество) > 0
			И СтрНайти(ТекстОграничения, КлючевоеСловоБольше) > 0 Тогда
			Результат =  Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область НастройкиФормы

&НаСервере
Процедура СохранитьКонтактныеДанныеОрганизации()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НаименованиеПокупателя)
		И Не ЗначениеЗаполнено(ЭлектроннаяПочта)
		И Не ЗначениеЗаполнено(Телефон) Тогда
		
		Возврат;
	КонецЕсли;
	
	Настройки = ОписаниеКонтактныхДанныхОрганизации();
	
	Настройки.НаименованиеПокупателя = НаименованиеПокупателя;
	Настройки.ЭлектроннаяПочта       = ЭлектроннаяПочта;
	Настройки.Телефон                = Телефон;
	
	СтрокиАдресов = АдресаОрганизации.НайтиСтроки(
		Новый Структура("ЭтоПроизвольныйАдрес, Организация", Истина, Организация));
	
	Адреса = Новый Массив;
	
	Для каждого ЭлементКоллекции Из СтрокиАдресов Цикл
		
		Если Не ЗначениеЗаполнено(ЭлементКоллекции.ПредставлениеАдреса) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеАдреса = Новый Структура;
		ДанныеАдреса.Вставить("КодСтраны", );
		ДанныеАдреса.Вставить("ИдентификаторФИАС", );
		ДанныеАдреса.Вставить("ЗначенияПолей", );
		ДанныеАдреса.Вставить("ПредставлениеАдреса", );
		
		ЗаполнитьЗначенияСвойств(ДанныеАдреса, ЭлементКоллекции);
		
		Адреса.Добавить(ДанныеАдреса);
		
	КонецЦикла;
	
	Настройки.Адреса = Адреса;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючНастроек(), Организация.УникальныйИдентификатор(), Настройки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеОрганизацииИзНастроек(Организация)
	
	Результат = ОписаниеКонтактныхДанныхОрганизации();
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеХранилища = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		КлючНастроек(), 
		Организация.УникальныйИдентификатор());
		
	Если Не ЗначениеЗаполнено(ДанныеХранилища) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, ДанныеХранилища);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция КлючНастроек()
	
	Результат = "КонтактныеДанныхОрганизацийБизнесСеть";
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОписаниеКонтактныхДанныхОрганизации()
	
	Результат = Новый Структура;
	
	Результат.Вставить("НаименованиеПокупателя", "");
	Результат.Вставить("ЭлектроннаяПочта",       "");
	Результат.Вставить("Телефон",                "");
	Результат.Вставить("Адреса",                 Новый Массив);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Заказы

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьАдресаЗаказа(Форма, ТекущиеДанные)
	
	АдресаОрганизации = Форма.АдресаОрганизации;
	СпособДоставки    = Форма.СпособДоставки;
	Организация       = Форма.Организация;
	АдресДоставки     = Форма.Элементы.АдресДоставки;
	
	АдресДоставки.СписокВыбора.Очистить();
	
	ВыбранСамовывоз = СпособДоставки = "Самовывоз";
	Если ВыбранСамовывоз Тогда
		
		Для каждого ТекущийАдрес Из ТекущиеДанные.АдресаСамовывоза Цикл
			АдресДоставки.СписокВыбора.Добавить(ТекущийАдрес.ИдентификаторФИАС, ТекущийАдрес.ПредставлениеАдреса);
		КонецЦикла;
		
	Иначе
		
		ПараметрыОтбора = Новый Структура("Организация", Организация);
		СтрокиАдресов = АдресаОрганизации.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого ТекущийАдрес Из СтрокиАдресов Цикл
			АдресДоставки.СписокВыбора.Добавить(ТекущийАдрес.ЗначенияПолей, ТекущийАдрес.ПредставлениеАдреса);
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ДобавитьАдресДоставки", "Видимость", Не ВыбранСамовывоз);
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьПредставлениеДокумента(АдресКомандыСоздатьЗапросЦен, ПредставлениеПоставщика) 

	ШаблонЗаголовка = НСтр("ru = 'Детали %1 для %2'");
	
	ПредставлениеДокумента = НСтр("ru = 'заказа'");
		
	Если ЭтоЗапросЦен(АдресКомандыСоздатьЗапросЦен) Тогда
		ПредставлениеДокумента = НСтр("ru = 'запроса цен'");
	КонецЕсли;
	
	Элементы.НадписьПредставлениеЗаказа.Заголовок = СтрШаблон(
		ШаблонЗаголовка, ПредставлениеДокумента, ПредставлениеПоставщика);
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьВидимостьПредупрежденийПоЗаказу(ТекущиеДанные)
	
	Если ТекущиеДанные.ЕстьПредупреждения Тогда
		ПредупреждениеПоЗаказу = ТекущиеДанные.НарушенияОграничений[0].Значение;		
	Иначе
		ПредупреждениеПоЗаказу = "";
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПредупреждениеПоЗаказу", "Видимость", ТекущиеДанные.ЕстьПредупреждения); 
	
КонецПроцедуры  
	
&НаСервере
Процедура УстановитьВидимостьЭлементовЗаголовкаЗаказа(ЕстьОшибкиВЗаказе, ЭтоНачалоДлительнойОперации = Ложь)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаДлительнаяОперация", "Видимость", ЭтоНачалоДлительнойОперации);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОтправитьЗаказВЗаголовке", "Видимость", Не ЭтоНачалоДлительнойОперации И Не ЕстьОшибкиВЗаказе);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "КартинкаПредупреждениеВЗаголовке", "Видимость", Не ЭтоНачалоДлительнойОперации И ЕстьОшибкиВЗаказе); 
		
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущийТовар(ИдентификаторПредложения)
	
	СтрокиТовара = Товары.НайтиСтроки(Новый Структура("ИдентификаторПредложения", ИдентификаторПредложения));
	
	Если Не ЗначениеЗаполнено(СтрокиТовара) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиЗаказа = Заказы.НайтиСтроки(Новый Структура("ИдентификаторСвязи", СтрокиТовара[0].ИдентификаторСвязи));
	
	Если Не ЗначениеЗаполнено(СтрокиЗаказа) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Заказы.ТекущаяСтрока = СтрокиЗаказа[0].ПолучитьИдентификатор();
	
	Элементы.Товары.ТекущаяСтрока = СтрокиТовара[0].ПолучитьИдентификатор();
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуруПоЗаказу(ИдентификаторСвязи, ТоварыЗаказа, НарушенияОграничений)
	
	Для каждого ТекущийТовар Из ТоварыЗаказа Цикл
		
		НоваяСтрока = Товары.Добавить();
		
		НоваяСтрока.ПредставлениеНоменклатуры     = ТекущийТовар.НаименованиеТовара;
		НоваяСтрока.Артикул                       = ТекущийТовар.Артикул;
		НоваяСтрока.ПредставлениеЕдиницыИзмерения = ТекущийТовар.ЕдиницаИзмерения.КраткоеНаименование;
		НоваяСтрока.Количество                    = ТекущийТовар.Количество;
		НоваяСтрока.Цена                          = ТекущийТовар.Цена;
		НоваяСтрока.ЦенаДоСкидки                  = ТекущийТовар.ЦенаДоСкидки;
		НоваяСтрока.ПредставлениеЦены             = ТорговыеПредложенияСлужебный.ПредставлениеЦены(ТекущийТовар.Цена);
		НоваяСтрока.СуммаСНДС                     = ТекущийТовар.Итоги.СуммаСНДС;
		НоваяСтрока.СуммаНДС                      = ТекущийТовар.Итоги.СуммаНДС;
		НоваяСтрока.СтавкаНДС                     = ТекущийТовар.СтавкаНДС;
		НоваяСтрока.Состояние                     = ТекущийТовар.СтатусДоступностиТовара;
		НоваяСтрока.ИдентификаторСвязи            = ИдентификаторСвязи;
		НоваяСтрока.АдресКомандыУдалить           = ТекущийТовар.АдресаКоманд.УдалитьТовар;
		НоваяСтрока.АдресКомандыИзменитьКоличество = ТекущийТовар.АдресаКоманд.УстановитьКоличество;
		НоваяСтрока.ИдентификаторПредложения      = ТекущийТовар.Идентификатор;
		НоваяСтрока.ДоступноеКоличество           = ТекущийТовар.КоличествоНаСкладе;
		НоваяСтрока.НарушенияОграничений          = НарушениеПоЗаказу(НарушенияОграничений, ТекущийТовар.Идентификатор);
		НоваяСтрока.ЕстьНарушенияОграничений      = ЗначениеЗаполнено(НоваяСтрока.НарушенияОграничений);
		НоваяСтрока.ВалютаПредложения             = ТекущийТовар.Итоги.Валюта;
		
		НоваяСтрока.МинимальноеКоличество = 
			?(ТекущийТовар.МинимальноеКоличество = 0, 
				1, 
				ТекущийТовар.МинимальноеКоличество);
		
		НоваяСтрока.КратностьУпаковки = 
			?(ТекущийТовар.КратностьУпаковки = 0, 
				1, 
				ТекущийТовар.КратностьУпаковки);
				
		Если ЗначениеЗаполнено(ТекущийТовар.АдресаИзображений) Тогда
			НоваяСтрока.АдресИзображенияВСервисе = ТекущийТовар.АдресаИзображений[0];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ПриАктивацииЗаказаНаСервере()
	
	Если Элементы.Заказы.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанныеФормыВСтрокуЗаказа();
	
	ТекущиеДанные = Заказы.НайтиПоИдентификатору(Элементы.Заказы.ТекущаяСтрока);
	ИдентификаторТекущегоЗаказа = ТекущиеДанные.ИдентификаторСвязи;
	
	ОтборСтрок = Новый ФиксированнаяСтруктура(
		Новый Структура("ИдентификаторСвязи", ТекущиеДанные.ИдентификаторСвязи));
	
	Элементы.Товары.ОтборСтрок = ОтборСтрок;
	
	ПоляЗаполненияЗаказа = РедактируемыеПоляЗаказа();
	ПоляЗаполнения = СтрРазделить(ПоляЗаполненияЗаказа, ",", Ложь);
	Для Каждого Поле Из ПоляЗаполнения Цикл
		НаименованиеПоля = СтрЗаменить(СокрЛ(Поле), Символы.ПС, "");
		Если ЗначениеЗаполнено(ТекущиеДанные[НаименованиеПоля]) Тогда
			ЭтотОбъект[НаименованиеПоля] = ТекущиеДанные[НаименованиеПоля];
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьАдресаЗаказа(ЭтотОбъект, ТекущиеДанные); 
	
	УстановитьПредставлениеДокумента(ТекущиеДанные.АдресКомандыСоздатьЗапросЦен, ТекущиеДанные.ПредставлениеПоставщика);
	
	УстановитьВидимостьПредупрежденийПоЗаказу(ТекущиеДанные);
	
	УстановитьВидимостьЭлементовЗаголовкаЗаказа(ТекущиеДанные.ЕстьОшибки);
		
	УстановитьЗаголовокПодсказкуАдреса(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьУстановитьТекущийЗаказ(АдресЗаказа)
	
	СтрокиЗаказа = Заказы.НайтиСтроки(Новый Структура("ИдентификаторЗаказаВСервисе", АдресЗаказа));
	
	Если Не ЗначениеЗаполнено(СтрокиЗаказа) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Заказы.ТекущаяСтрока = СтрокиЗаказа[0].ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеЗаказа()
	
	// Поля заполнения формы.
	ПоляЗаполнения = "НаименованиеПокупателя, ЭлектроннаяПочта, 
		|Телефон, КомментарийКЗаказу, АдресДоставки,
		|СуммаСНДС, СуммаНДС, Валюта";
	
	ПоляДляОчистки = СтрРазделить(ПоляЗаполнения, ",", Ложь);
	
	Для Каждого ЭлементКоллекции Из ПоляДляОчистки Цикл
		ЭтотОбъект[СокрЛП(ЭлементКоллекции)] = "";
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказы(ЗаказыКорзины, ЗаказыДоПерезаполнения = Неопределено)
		
	Для каждого ТекущийЗаказ Из ЗаказыКорзины Цикл
		
		НоваяСтрока = Заказы.Добавить();
				
		Если ЭтоЗапросЦен(ТекущийЗаказ.АдресаКоманд.СоздатьЗапросЦен) Тогда
			НоваяСтрока.ПредставлениеЗаказа = СтрШаблон(НСтр("ru = 'Запрос цен для %1'"), ТекущийЗаказ.Поставщик.Наименование);
		Иначе
			НоваяСтрока.ПредставлениеЗаказа = СтрШаблон(НСтр("ru = 'Заказ для %1'"), ТекущийЗаказ.Поставщик.Наименование);
		КонецЕсли;
		
		НоваяСтрока.ПредставлениеПоставщика  = ТекущийЗаказ.Поставщик.Наименование;
		НоваяСтрока.КоличествоПозиций        = ТекущийЗаказ.Товары.Количество();
		НоваяСтрока.СуммаСНДС                = ТекущийЗаказ.Итоги.СуммаСНДС;
		НоваяСтрока.СуммаНДС                 = ТекущийЗаказ.Итоги.СуммаНДС;
		НоваяСтрока.Валюта                   = ТекущийЗаказ.Итоги.Валюта;
		НоваяСтрока.ИдентификаторСвязи       = Новый УникальныйИдентификатор;
		НоваяСтрока.Организация              = Организация;
		НоваяСтрока.АдресКомандыСоздатьЗаказ = ТекущийЗаказ.АдресаКоманд.СоздатьЗаказ;
		НоваяСтрока.АдресКомандыСоздатьЗапросЦен = ТекущийЗаказ.АдресаКоманд.СоздатьЗапросЦен;
		НоваяСтрока.ИдентификаторЗаказаВСервисе  = ТекущийЗаказ.АдресаКоманд.АдресЗаказа;
		НоваяСтрока.РегионыДоставки.Загрузить(ТекущийЗаказ.ДанныеДоставки.РегионыДоставки);
		НоваяСтрока.АдресаСамовывоза.Загрузить(ТекущийЗаказ.ДанныеДоставки.АдресаСамовывоза);
		
		Если ЗначениеЗаполнено(НоваяСтрока.РегионыДоставки) 
			И ЗначениеЗаполнено(НоваяСтрока.АдресаСамовывоза) Тогда
			
			НоваяСтрока.СпособДоставки = "Доставка";
			
		ИначеЕсли Не ЗначениеЗаполнено(НоваяСтрока.РегионыДоставки) Тогда
			НоваяСтрока.СпособДоставки = "Самовывоз";
		Иначе
			НоваяСтрока.СпособДоставки = "Доставка";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаказыДоПерезаполнения) Тогда
			ЗаполнитьРедактируемыеДанныеЗаказа(НоваяСтрока, ЗаказыДоПерезаполнения);
		КонецЕсли;
		
		ЗаполнитьПредставлениеПоказателейЗаказа(НоваяСтрока);
		
		ЗаполнитьНоменклатуруПоЗаказу(
			НоваяСтрока.ИдентификаторСвязи, 
			ТекущийЗаказ.Товары, 
			ТекущийЗаказ.НарушенияОграничений);
			
		Если ЗначениеЗаполнено(ТекущийЗаказ.НарушенияОграничений) Тогда
			НоваяСтрока.НарушенияОграничений = НарушениеПоЗаказу(ТекущийЗаказ.НарушенияОграничений);
			НоваяСтрока.ЕстьОшибки = ЕстьБлокирующиеНарушения(НоваяСтрока.ИдентификаторСвязи);
		КонецЕсли;		
		НоваяСтрока.ЕстьПредупреждения = ЗначениеЗаполнено(НоваяСтрока.НарушенияОграничений);
		
	КонецЦикла;
		
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПредставлениеПоказателейЗаказа(СтрокаЗаказа)
	
	СтрокаЗаказа.ПредставлениеПоказателей = СтрШаблон(
		ШаблонПредставленияПоказателейЗаказа(),
		СтрокаЗаказа.КоличествоПозиций,
		СтрокаЗаказа.СуммаСНДС,
		СтрокаЗаказа.Валюта);
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонПредставленияПоказателейЗаказа()
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	#Иначе
		КодОсновногоЯзыка = ОбщегоНазначенияКлиент.КодОсновногоЯзыка();
	#КонецЕсли
	
	ШаблонПредставления = НСтр("ru = 'Позиций: %1 | Сумма: %2 %3'", КодОсновногоЯзыка);
	
	Возврат ШаблонПредставления;
	
КонецФункции

&НаСервере
Функция НарушениеПоЗаказу(СписокНарушений, ИдентификаторПредложения = "")
	
	СтрокиНарушений = СписокНарушений.НайтиСтроки(
		Новый Структура("ИдентификаторПредложения", ИдентификаторПредложения));
	
	Результат = Новый СписокЗначений;
	
	Для Каждого ТекущееНарушение Из СтрокиНарушений Цикл
		Результат.Добавить(ТекущееНарушение.ТекстСообщения);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЕстьБлокирующиеНарушения(ИдентификаторСвязи)
	
	Результат = Ложь;

	ОтборПозицийЗаказа = Новый Структура("ИдентификаторСвязи, ЕстьНарушенияОграничений", ИдентификаторСвязи, Истина);
	НайденныеСтрокиПозицийЗаказа = Товары.НайтиСтроки(ОтборПозицийЗаказа);
	
	Если НайденныеСтрокиПозицийЗаказа.Количество() > 0 Тогда
		Результат = Истина;		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРедактируемыеДанныеЗаказа(СтрокаДанных, ЗаказыДоПерезаполнения)
	
	Если Не ЗначениеЗаполнено(ЗаказыДоПерезаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиДанныхЗаказа = ЗаказыДоПерезаполнения.НайтиСтроки(
		Новый Структура("ИдентификаторЗаказаВСервисе", СтрокаДанных.ИдентификаторЗаказаВСервисе));
	
	Если Не ЗначениеЗаполнено(СтрокиДанныхЗаказа) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокиДанныхЗаказа[0]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключениеОрганизацииПродолжение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СтатусПодключения = "Подключена" Тогда
		
		СохранитьДанныеФормыИЗапуститьЧтениеКорзины();
		ОжидатьЗавершенияЧтенияКорзины();
		
	КонецЕсли;
	
	НастроитьОтображениеПредупрежденияОРегистрации();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеФормыИЗапуститьЧтениеКорзины();
	
	СохранитьДанныеФормыВСтрокуЗаказа();
	ЗапуститьЧтениеКорзины();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаказНаКлиенте()
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	
	ПроверитьСообщитьОНарушенииОграничений(Отказ);
	
	ПроверитьЗаполнениеДанных(Отказ);
	
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПодключениеОрганизацииПродолжение", ЭтотОбъект);
	ИнтеграцияТорговыеПредложенияКлиент.ОткрытьФормуПодключенияОрганизацииСПроверкойПодключения(
		Организация, ЭтотОбъект, Оповещение, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОтправитьЗаказПеречитатьКорзинуВФоне();
	
КонецПроцедуры

&НаСервере
Функция ПараметрыСозданияЗаказа()
	
	ТекущиеДанные = Заказы.НайтиПоИдентификатору(Элементы.Заказы.ТекущаяСтрока);
	
	ПараметрыФормы = ТорговыеПредложенияСлужебный.ОписаниеПараметровСозданияЗаказаКорзины();
	
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущиеДанные);
	
	Если ЗначениеЗаполнено(ТекущиеДанные.АдресКомандыСоздатьЗаказ) Тогда
		ПараметрыФормы.АдресКоманды = ТекущиеДанные.АдресКомандыСоздатьЗаказ;
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.АдресКомандыСоздатьЗапросЦен) Тогда
		ПараметрыФормы.АдресКоманды = ТекущиеДанные.АдресКомандыСоздатьЗапросЦен;
	КонецЕсли;
	
	СтрокиДанных = Неопределено;
	
	Если ТекущиеДанные.СпособДоставки = "Самовывоз" Тогда
		СтрокиДанных = ТекущиеДанные.АдресаСамовывоза.НайтиСтроки(
			Новый Структура("ИдентификаторФИАС", ТекущиеДанные.АдресДоставки));
	Иначе
		СтрокиДанных = АдресаОрганизации.НайтиСтроки(
			Новый Структура("ЗначенияПолей, Организация", ТекущиеДанные.АдресДоставки, ТекущиеДанные.Организация));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокиДанных) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормы, СтрокиДанных[0]);
	КонецЕсли;
	
	ПараметрыФормы.АдресКорзины = АдресКорзины;
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьЗаказПеречитатьКорзинуВФоне()
	
	ПредставлениеЗаказа = Элементы.Заказы.ТекущиеДанные.ПредставлениеЗаказа;
	
	ПараметрыОповещения = Новый Структура("ПредставлениеЗаказа", ПредставлениеЗаказа);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ОтправитьЗаказПеречитатьКорзинуЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	ДлительнаяОперация = СоздатьЗаказПеречитатьКорзинуВФоне(УникальныйИдентификатор);

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция СоздатьЗаказПеречитатьКорзинуВФоне(УникальныйИдентификатор)
	
	СохранитьДанныеФормыВСтрокуЗаказа();
	
	НастроитьЭлементыДлительнойОперации(Истина);
	
	ПараметрыСозданияЗаказа = ПараметрыСозданияЗаказа();
	
	Результат = ТорговыеПредложенияСлужебный.СоздатьЗаказПеречитатьКорзинуВФоне(
		ПараметрыСозданияЗаказа, УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыДлительнойОперации(ЭтоНачалоДлительнойОперации, ЭтоОперацияСТоваром = Ложь)
	
	Если ЭтоОперацияСТоваром Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ТоварыУдалитьТовар", "Доступность", Не ЭтоНачалоДлительнойОперации);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "УдалитьТоварВИнформационномСообщении", "Доступность", Не ЭтоНачалоДлительнойОперации);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "УстановитьДоступноеКоличество", "Доступность", Не ЭтоНачалоДлительнойОперации);
	Иначе
		УстановитьВидимостьЭлементовЗаголовкаЗаказа(Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСтраницуПустойКорзины()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницыЗаказыТовары", "ТекущаяСтраница", Элементы.СтраницаКорзинаПуста);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаказПеречитатьКорзинуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	БизнесСетьСлужебныйКлиент.ВывестиСообщенияФоновогоЗадания(Результат, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПеречитатьКорзинуНаСервере(Результат.АдресРезультата, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
		
	ТорговыеПредложенияСлужебныйКлиент.СформироватьАдресаВременныхХранилищДляРеквизита(
		Товары, "АдресИзображения", УникальныйИдентификатор);
	
	ЗагрузитьПредварительныеИзображенияКорзины(Товары);

	ПоказатьОповещениеОтправкиДокумента(ДополнительныеПараметры.ПредставлениеЗаказа);
		
	ТорговыеПредложенияКлиент.ОповеститьОбИзмененииКорзины(Результат.АдресРезультата, ЭтотОбъект);
	
	Если Заказы.Количество() = 0 Тогда
		ОчиститьДанныеЗаказа();
		ПоказатьСтраницуУспешнойОтправки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоЗапросЦен(АдресКомандыСоздатьЗапросЦен)
		
	Возврат Не ПустаяСтрока(АдресКомандыСоздатьЗапросЦен);
	
КонецФункции

&НаКлиенте
Процедура ВопросПриУдаленияАдресаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьАдресИзСписка();
	
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьАдресаЗаказа(ЭтотОбъект, ТекущиеДанные);
	
	УстановитьЗаголовокПодсказкуАдреса(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьАдресИзСписка()
	
	СтрокаАдреса = СтрокаАдресаПоЗначениюАдреса(АдресаОрганизации, Организация, АдресДоставки);
	
	Если СтрокаАдреса <> Неопределено Тогда
		АдресаОрганизации.Удалить(СтрокаАдреса);
	КонецЕсли;
	
	АдресДоставки = "";
	
	Элементы.УдалитьАдресДоставки.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти