
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	БаннерДобавить();
	
	ОбновитьПросмотрИзображений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
  ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(АдресКартинки) Тогда
		ПросмотретьПрисоединенныйФайл();
	ИначеЕсли Не ЭтаФорма.ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
		ДобавитьИзображениеНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьПрисоединенныйФайл()
	
	ОчиститьСообщения();
	
	ДанныеФайла = ПолучитьДанныеФайла(Объект.Логотип, УникальныйИдентификатор);
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеПрисоединенныйФайл(ПрисоединенныйФайл)
	
	Если НЕ ЗначениеЗаполнено(ПрисоединенныйФайл) Тогда
		Возврат;
	КонецЕсли;
	
	ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
	ПрисоединенныйФайлОбъект.УстановитьПометкуУдаления(Истина);
	ПрисоединенныйФайлОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиенте()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = НСтр("ru='Для выбора изображения необходимо записать объект. Записать?'");
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьИзображениеНаКлиентеЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ДобавитьИзображениеНаКлиентеФрагмент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиентеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
	Иначе
		Возврат;
	КонецЕсли;
	
	ДобавитьИзображениеНаКлиентеФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиентеФрагмент()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ИдентификаторФайла = Новый УникальныйИдентификатор;
		
		Фильтр = РаботаСФайламиУНФКлиентСервер.ФильтрФайловИзображений();
		
		РаботаСФайламиКлиент.ДобавитьФайлы(Объект.Ссылка, ИдентификаторФайла, Фильтр); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор)
	
	ДополнительныеПараметры = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ДополнительныеПараметры.ИдентификаторФормы = УникальныйИдентификатор;
	
	Возврат РаботаСФайлами.ДанныеФайла(ФайлКартинки, ДополнительныеПараметры);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	ДобавитьИзображениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзображение(Команда)
	
	ПрисоединенныйФайл = Объект.Логотип;
	Если НЕ ЗначениеЗаполнено(ПрисоединенныйФайл) Тогда
		Возврат;
	КонецЕсли;
	
	ПометитьНаУдалениеПрисоединенныйФайл(ПрисоединенныйФайл);
	ОповеститьОбИзменении(ПрисоединенныйФайл);
	
	Оповестить("Запись_Файл", Новый Структура,
	ПредопределенноеЗначение("Справочник.ВиртуальныеКаталогиТоваровМагазиновСоцСетейПрисоединенныеФайлы.ПустаяСсылка"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьИзображение(Команда)
	
	ПросмотретьПрисоединенныйФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
 	Если ИмяСобытия = "Запись_Файл" Тогда
		
		Если Параметр.Свойство("ВладелецФайла") И Параметр.ВладелецФайла = Объект.Ссылка
			ИЛИ НЕ Параметр.Свойство("ВладелецФайла") Тогда
			
			Если ТипЗнч(Источник) = Тип("Массив") Тогда
				ИзображениеДляПроверки = Источник[0];
			Иначе
				ИзображениеДляПроверки = Источник;
			КонецЕсли;
			
			Если ПроверкаФайлаУспешноПройдена(ИзображениеДляПроверки) Тогда
				Объект.Логотип = ИзображениеДляПроверки;
			Иначе
				
				Объект.Логотип = Неопределено;
				
				ПометитьНаУдалениеПрисоединенныйФайл(ИзображениеДляПроверки);
				ОповеститьОбИзменении(ИзображениеДляПроверки);
				
			КонецЕсли;
			
			Модифицированность = Истина;
			
			ОбновитьПросмотрИзображений();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаФайлаУспешноПройдена(ИзображениеДляПроверки)
	
	Если Не ЗначениеЗаполнено(ИзображениеДляПроверки) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	// Минимальный размер фотографии - 1280x720 пикселей.
	ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(ИзображениеДляПроверки);
	Картинка = Новый Картинка(ДвоичныеДанныеФайла);
	
	Если Картинка.Ширина() < 1280 Или Картинка.Высота() < 720 Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура КомандыИзображения(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандыИзображенияПродолжение", ЭтотОбъект);
	
	ЕстьИзображение = ЗначениеЗаполнено( Объект.Логотип );
	
	СписокДоступныхКоманд = Новый СписокЗначений;
	Если ЕстьИзображение Тогда

		СписокДоступныхКоманд.Добавить("ДобавитьИзображение", НСтр("ru='Заменить'"),, 
		БиблиотекаКартинок.СоздатьЭлементСписка);
		
		СписокДоступныхКоманд.Добавить("УдалитьИзображение", НСтр("ru='Удалить'"),, 
		БиблиотекаКартинок.ПометитьНаУдаление);
		
		СписокДоступныхКоманд.Добавить("ПросмотретьИзображение", НСтр("ru='Просмотреть'"),, 
		БиблиотекаКартинок.ПолеВводаОткрыть);

	Иначе

		СписокДоступныхКоманд.Добавить("ДобавитьИзображение", НСтр("ru='Добавить'"),, 
		БиблиотекаКартинок.СоздатьЭлементСписка);

	КонецЕсли;
	
	ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДоступныхКоманд, ТекущийЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандыИзображенияПродолжение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "ДобавитьИзображение" Тогда
	
		Если Не ЭтаФорма.ТолькоПросмотр Тогда
			ЗаблокироватьДанныеФормыДляРедактирования();
			ДобавитьИзображениеНаКлиенте();
		КонецЕсли;
		
	ИначеЕсли ВыбранныйЭлемент.Значение = "УдалитьИзображение" Тогда
		
		УдалитьИзображение( Неопределено );
		
	ИначеЕсли ВыбранныйЭлемент.Значение = "ПросмотретьИзображение" Тогда
	
		ПросмотретьПрисоединенныйФайл();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПросмотрИзображений()
	
	АдресКартинки = "";
	
	Если НЕ Объект.Логотип.Пустая() Тогда
		АдресКартинки = РаботаСФайламиУНФ.СсылкаНаДвоичныеДанныеФайла(Объект.Логотип, УникальныйИдентификатор);
	КонецЕсли;

	Элементы.ГруппаБаннер.Видимость = ПустаяСтрока( АдресКартинки );
	
КонецПроцедуры

&НаСервере
Процедура БаннерДобавить()

	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Предупреждение";
	ПараметрыВажногоСообщения.Сообщение = НСтр( "ru = 'Обязательно добавьте изображение, иначе подборка не будет выгружена. Минимальный размер фотографии 1280x720 пикселей.'" );
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр( "ru = 'Обязательно добавьте изображение.'" );
	ПараметрыВажногоСообщения.Родитель = "ГруппаБаннер";
	
	ОбщегоНазначения.ДобавитьВажноеСообщение( ЭтотОбъект, ПараметрыВажногоСообщения );
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму( ЭтотОбъект );

КонецПроцедуры

#КонецОбласти
