#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	Если ЗначениеЗаполнено(Параметры.ОрганизацияДляОтбора) И НЕ Константы.УчетПоКомпании.Получить() Тогда
		Параметры.Отбор.Вставить("Организация", Параметры.ОрганизацияДляОтбора);
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Элементы.Переместить(Элементы.КоманднаяПанель, КоманднаяПанель);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
