
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСчетаУчетаВХранилище = Параметры.АдресСчетаУчетаВХранилище;
	СчетаУчета.Загрузить(ПолучитьИзВременногоХранилища(АдресСчетаУчетаВХранилище));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьСчетаУчетаВХранилище();
	Закрыть(КодВозвратаДиалога.OK);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьСчетаУчетаВХранилище() 
	
	ПоместитьВоВременноеХранилище(СчетаУчета.Выгрузить(), АдресСчетаУчетаВХранилище);
	
КонецПроцедуры

#КонецОбласти
