
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПараметрыФормы();
	НастроитьЦветКнопок();
	НастроитьЭлементыФормы();
	НастроитьОтображениеКарты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьСложнуюОплату(Команда)
	
	Ответ = ПолучитьШаблонОтвета();
	Ответ.ВидОплаты = "СложнаяОплата";
	Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьНаличными(Команда)
	
	Ответ = ПолучитьШаблонОтвета();
	Ответ.ВидОплаты = "Наличные";
	Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьКартой(Команда)
	
	ОплатитьКартойНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьСБП(Команда)
	
	ОплатитьСБПНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанныеПокупателя(Команда)
	ОткрытьДанныеПокупателяКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеПокупателя(Команда)
	ОчиститьДанныеПокупателяКлиент();
КонецПроцедуры

&НаКлиенте
Процедура Вернуться(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_КнопкаВвестиДанныеПокупателяКСОНажатие(Элемент)
	
	ОткрытьДанныеПокупателяКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КнопкаОплатитьКартойКСОНажатие(Элемент)
	
	ОплатитьКартойНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КнопкаОплатитьСБПКСОНажатие(Элемент)
	
	ОплатитьСБПНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КнопкаСкидкаПенсионераКСОНажатие(Элемент)
	РассчитатьСкидкуПенсионерам();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьШаблонОтвета()
	
	Возврат Новый Структура("ВидОплаты", "");
	
КонецФункции

&НаСервере
Процедура НастроитьОтображениеКарты()
	
	УправлениеВидимостьюРеквизитовКарты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюРеквизитовКарты(Форма)
	
	Элементы = Форма.Элементы;
	ПокупательУказан = ИнтерфейсРМКСлужебныйКлиентСервер.ДанныеЛояльностиЗаполнены(Форма.ДанныеЛояльности);
	ИзменитьКартинкуВводПокупателяБезКонтекста(Форма);
	УстановитьВидимостьЭлементаФормы(Элементы.ИнформацияОБаллах,
		Форма.ИспользоватьОплатуБонусами И Форма.ВведенаБонуснаяКарта);
	УстановитьВидимостьЭлементаФормы(Элементы.КоличествоБонусовВКарточке,
		Форма.ИспользоватьОплатуБонусами И Форма.ВведенаБонуснаяКарта);
	УстановитьВидимостьЭлементаФормы(Элементы.ОтменитьВводКартыКрестик, ПокупательУказан);
	УстановитьВидимостьЭлементаФормы(Элементы.ДанныеКартыКлиента, ПокупательУказан);
	Если ПокупательУказан Тогда
		Элементы.ВвестиДанныеПокупателя.Отображение = ОтображениеКнопки.Картинка;
	Иначе
		Элементы.ВвестиДанныеПокупателя.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьКартинкуВводПокупателяБезКонтекста(Форма)

	ДанныеЛояльности = Форма.ДанныеЛояльности;
	Элементы = Форма.Элементы;
	ЗаголовокКнопки = ?(Форма.РежимКассыСамообслуживания, НСтр("ru = 'Карта лояльности'"), НСтр("ru = 'Данные покупателя'"));
	КартинкаКнопки = БиблиотекаКартинок.ВвестиДанныеПокупателя;
	Важность = ВажностьКнопки.Обычная;
	ПредставлениеКарты = "";
	
	Если ИнтерфейсРМКСлужебныйКлиентСервер.ДанныеЛояльностиЗаполнены(ДанныеЛояльности) Тогда
		КартинкаКнопки = БиблиотекаКартинок.ДанныеПокупателяВведены;
		КартаФИО = Форма.НайденнаяКартаФИО;
		ЧастиФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(КартаФИО),
			СтрШаблон(НСтр("ru = '%1'"), " "));
		ПредставлениеФИО = КартаФИО;
		Если ЧастиФИО.Количество() > 2 Тогда
			ПредставлениеФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Форма.НайденнаяКартаФИО);
		КонецЕсли;
		
		ЗаголовокКнопки = НСтр("ru = 'Карта введена'");
		Если ЗначениеЗаполнено(ДанныеЛояльности.Объект.Контрагент)
				И Не ИнтерфейсРМКСлужебныйКлиентСервер.ДанныеДисконтнойКартыЗаполнены(ДанныеЛояльности) Тогда
			ПредставлениеКарты = ПредставлениеФИО;
		Иначе
			Если ЗначениеЗаполнено(Форма.НайденнаяКартаНомер) Тогда
				ПредставлениеКарты = СтрШаблон(НСтр("ru = '№ %1'"), Форма.НайденнаяКартаНомер);
			ИначеЕсли ЗначениеЗаполнено(Форма.НайденнаяКартаТелефон) Тогда
				ПредставлениеКарты = СтрШаблон(НСтр("ru = 'тел. %1'"), Форма.НайденнаяКартаТелефон);
			ИначеЕсли ЗначениеЗаполнено(Форма.НайденнаяКартаФИО) Тогда
				ПредставлениеКарты = ПредставлениеФИО;
			КонецЕсли;
		КонецЕсли;
		Важность = ВажностьКнопки.Дополнительная;
	ИначеЕсли Форма.РежимКассыСамообслуживания Тогда
		ПредставлениеКарты = ЗаголовокКнопки;
	КонецЕсли;
	Если Форма.РежимКассыСамообслуживания Тогда
		ИмяЭлементаЗаголовок = "ЗаголовокКнопкиВвестиДанныеПокупателяКСО";
		Если Не Элементы.Найти(ИмяЭлементаЗаголовок) = Неопределено Тогда
			Элементы.ЗаголовокКнопкиВвестиДанныеПокупателяКСО.Заголовок = ПредставлениеКарты;
			Элементы.ИконкаКнопкиВвестиДанныеПокупателяКСО.Картинка = КартинкаКнопки;
		КонецЕсли;
	Иначе
		Элементы.ВвестиДанныеПокупателя.Картинка = КартинкаКнопки;
		Элементы.ВвестиДанныеПокупателя.Важность = Важность;
		Элементы.ВвестиДанныеПокупателя.Заголовок = ЗаголовокКнопки;
		Форма.ПредставлениеКарты = ПредставлениеКарты;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыФормы()
	
	ДанныеЛояльности = Параметры.ДанныеЛояльности;
	ВертикальнаяОриентация = Параметры.ВертикальнаяОриентация;
	ЗапоминатьНомерКартыЛояльности = Параметры.ЗапоминатьНомерКартыЛояльности;
	РазрешитьЗаменуДисконтнойКарты = Параметры.РазрешитьЗаменуДисконтнойКарты;
	ИспользоватьДисконтныеКарты = Параметры.ИспользоватьДисконтныеКарты;
	ИспользоватьОплатуНаличными = Параметры.ИспользоватьОплатуНаличными;
	ИспользоватьОплатуПлатежнымиКартами = Параметры.ИспользоватьОплатуПлатежнымиКартами;
	ИспользоватьБыструюОплатуСБП = Параметры.ИспользоватьБыструюОплатуСБП;
	КодВалютыЦены = Параметры.КодВалютыЦены;
	КоличествоБонусов = Параметры.КоличествоБонусов;
	НайденнаяКартаНомер = Параметры.НайденнаяКартаНомер;
	НайденнаяКартаТелефон = Параметры.НайденнаяКартаТелефон;
	НайденнаяКартаФИО = Параметры.НайденнаяКартаФИО;
	СуммаБезСкидки = Параметры.СуммаБезСкидки;
	СуммаБонусовКНачислению = Параметры.СуммаБонусовКНачислению;
	СуммаИтого = Параметры.СуммаИтого;
	СуммаКОплате = Параметры.СуммаКОплате;
	СуммаОплаченоБонусами = Параметры.СуммаОплаченоБонусами;
	ЭлектронныйЧек = Параметры.ЭлектронныйЧек;
	ПодключенаОблачнаяККТ = Параметры.ПодключенаОблачнаяККТ;
	ЭтоРаботаСАвансом = Параметры.ЭтоРаботаСАвансом;
	ТекущаяНастройкаРМК = Параметры.НастройкаРМК;
	ВведенаБонуснаяКарта = Параметры.ВведенаБонуснаяКарта;
	ИспользоватьОплатуБонусами = Параметры.ИспользоватьОплатуБонусами;
	ИспользоватьАвтоматическиеСкидки = Параметры.ИспользоватьАвтоматическиеСкидки;
	ВводДисконтныхКарт = Параметры.ВводДисконтныхКарт;
	РежимКассыСамообслуживания = Параметры.РежимКассыСамообслуживания;
	ИзПлиточногоИнтерфейса = Параметры.ИзПлиточногоИнтерфейса;
	ИспользоватьСкидкуПенсионерам = Параметры.ИспользоватьСкидкуПенсионерам;
	ПокупательПенсионер = Параметры.ПокупательПенсионер;
	ИнтерфейсРМКСлужебный.ПрименитьНаФормеМасштабИзПараметров(ЭтотОбъект, Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыЛояльности(ВходныеПараметры)
	
	ДанныеЛояльности = ВходныеПараметры.ДанныеЛояльности;
	КоличествоБонусов = ВходныеПараметры.КоличествоБонусов;
	НайденнаяКартаНомер = ВходныеПараметры.НайденнаяКартаНомер;
	НайденнаяКартаТелефон = ВходныеПараметры.НайденнаяКартаТелефон;
	НайденнаяКартаФИО = ВходныеПараметры.НайденнаяКартаФИО;
	СуммаБезСкидки = ВходныеПараметры.СуммаБезСкидки;
	СуммаБонусовКНачислению = ВходныеПараметры.СуммаБонусовКНачислению;
	СуммаИтого = ВходныеПараметры.СуммаИтого;
	СуммаКОплате = ВходныеПараметры.СуммаКОплате;
	СуммаОплаченоБонусами = ВходныеПараметры.СуммаОплаченоБонусами;
	ВведенаБонуснаяКарта = ВходныеПараметры.ВведенаБонуснаяКарта;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ВысотаКнопокОплат = 7;
	Если Параметры.Свойство("ВысотаКнопокОплат") И ЗначениеЗаполнено(Параметры.ВысотаКнопокОплат) Тогда
		ВысотаКнопокОплат = Параметры.ВысотаКнопокОплат + 2;
	КонецЕсли;
	
	Элементы.ГруппаОплатаКартой.Видимость = ИспользоватьОплатуПлатежнымиКартами;
	Элементы.ГруппаОплатаНаличными.Видимость = ИспользоватьОплатуНаличными;
	Элементы.ГруппаОплатаСБП.Видимость = ИспользоватьБыструюОплатуСБП;
	Если РежимКассыСамообслуживания Тогда
		
		Элементы.ГруппаКомандыНазад.РастягиватьПоВертикали = Ложь;
		Элементы.ГруппаКомандыНазад.Высота = 5;
		Элементы.ФормаВернуться.Важность = ВажностьКнопки.Обычная;
		Элементы.ФормаВернуться.РастягиватьПоГоризонтали = Истина;
		Элементы.ФормаВернуться.РастягиватьПоВертикали = Истина;
		//Элементы.ФормаВернуться.ЦветФона = ЦветаПалитры.;
		
		Элементы.ГруппаБыстрыхОплат.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Двойной;
		Элементы.ФормаВыбратьСложнуюОплату.Видимость = Ложь;
		Элементы.ГруппаСуммаБезСкидок.Видимость = (ИспользоватьАвтоматическиеСкидки Или ИспользоватьОплатуБонусами);
		
		Элементы.ГруппаУправленияКонтрагентами.Видимость = Ложь;
		Элементы.ГруппаЛояльностиКСО.Видимость = Истина;
		ИнтерфейсРМКСлужебный.СформироватьКнопкуЛояльностиКСОВОкнеОплаты(ЭтотОбъект, Параметры.НастройкиВводаПокупателей);
		
		Если ИспользоватьСкидкуПенсионерам Тогда
			ИнтерфейсРМКСлужебный.СформироватьКнопкуСкидкаПенсионераКСОВОкнеОплаты(ЭтотОбъект);
			Если Параметры.Свойство("ЗаголовокКомандыСкидкаПенсионера") Тогда
				Элементы.ЗаголовокКнопкиСкидкаПенсионераКСО.Заголовок = Параметры.ЗаголовокКомандыСкидкаПенсионера;
				Элементы.КнопкаСкидкаПенсионераКСО.Заголовок = Параметры.ЗаголовокКомандыСкидкаПенсионера;
			КонецЕсли;
		КонецЕсли;
		
		Элементы.ОплатитьКартой.Видимость = Ложь;
		ДанныеКнопки = ИнтерфейсРМКСлужебный.ШаблонДанныхКнопкиОплатыКСО();
		ДанныеКнопки.Имя = "ОплатитьКартой";
		ДанныеКнопки.Высота = ВысотаКнопокОплат;
		ДанныеКнопки.Картинка = БиблиотекаКартинок.РМКВидОплатыКарта;
		ДанныеКнопки.Заголовок = НСтр("ru='Карта'");
		ДанныеКнопки.ЦветФона = Элементы.ОплатитьКартой.ЦветФона;
		ИнтерфейсРМКСлужебный.ДобавитьКнопкуОплатыКСО(ЭтотОбъект, Элементы.ГруппаОплатаКартой, ДанныеКнопки);
		
		Элементы.ОплатитьСБП.Видимость = Ложь;
		ДанныеКнопки.Имя = "ОплатитьСБП";
		ДанныеКнопки.Высота = ВысотаКнопокОплат;
		ДанныеКнопки.Картинка = БиблиотекаКартинок.РМКВидОплатыСБП;
		ДанныеКнопки.Заголовок = НСтр("ru='СБП'");
		ДанныеКнопки.ЦветФона = Элементы.ОплатитьСБП.ЦветФона;
		ИнтерфейсРМКСлужебный.ДобавитьКнопкуОплатыКСО(ЭтотОбъект, Элементы.ГруппаОплатаСБП, ДанныеКнопки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЦветКнопок()
	
	Элементы.ОплатитьКартой.ЦветФона = ИнтерфейсРМКСлужебный.ЦветУправляющейКнопки(Истина);
	Элементы.ОплатитьНаличными.ЦветФона = ИнтерфейсРМКСлужебный.ЦветГиперссылки(Истина);
	Элементы.ОплатитьСБП.ЦветФона = ИнтерфейсРМКСлужебный.ЦветВспомогательнойКнопки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанныеПокупателяКлиент()
	
	ПараметрыОткрытия = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыФормыВводаПокупателя();
	
	ЗаполнитьЗначенияСвойств(ПараметрыОткрытия, ЭтотОбъект, 
		"ЗапоминатьНомерКартыЛояльности,ТекущаяНастройкаРМК,КодВалютыЦены,РазрешитьЗаменуДисконтнойКарты,
		|ЭтоРаботаСАвансом,ЭлектронныйЧек,ПодключенаОблачнаяККТ");
	ПараметрыОткрытия.СуммаДокумента = СуммаКОплате;
	ПараметрыОткрытия.ОстатокБалловНаКарте = КоличествоБонусов;
	ПараметрыОткрытия.Контрагент = ДанныеЛояльности.Объект.Контрагент;
	ПараметрыОткрытия.ДисконтнаяКарта = ДанныеЛояльности.Объект.ДисконтнаяКарта;
	ПараметрыОткрытия.ПараметрыКартыЛояльности = ДанныеЛояльности.ПараметрыКартыЛояльности;
	ПараметрыОткрытия.ПродолжатьБезКарты = Ложь;
	Если РежимКассыСамообслуживания И (ЗначениеЗаполнено(ПараметрыОткрытия.ДисконтнаяКарта)
			Или Не ПараметрыОткрытия.ПараметрыКартыЛояльности = Неопределено) Тогда
			
		ПараметрыОткрытия.ЗаголовокФормы = НСтр("ru = 'Данные карты лояльности'");
			
	КонецЕсли;

	ОбработкаОповещения = Новый ОписаниеОповещения("ВыборКартыИлиПокупателя",
		ЭтотОбъект);

	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаВыбораПокупателя85",
		ПараметрыОткрытия, ЭтотОбъект,,,, ОбработкаОповещения, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца,
		РежимОтображенияОкнаФормы.ВДиалоговомОкне);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКартыИлиПокупателя(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = Неопределено Тогда
		Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("ОтменитьВводыКарты")
			И Результат.ОтменитьВводыКарты Тогда
			ОчиститьДанныеПокупателяКлиент();
		Иначе
			ОбратноеОповещение = Новый ОписаниеОповещения("ОбработатьОбновлениеДанныхЛояльности", ЭтотОбъект);
			ДополнительныеДанные = Новый Структура("ДополнительныеПараметры", ДополнительныеПараметры);
			ДополнительныеДанные.Вставить("ПлиточныйИнтерфейс", ИзПлиточногоИнтерфейса);
			ДополнительныеДанные.Вставить("ОбратноеОповещение", ОбратноеОповещение);
			ОповещениеОбОбновленииКарты = Новый ОписаниеОповещения("ОбработатьВнешнийВыборКартыЛояльности",
				ЭтотОбъект.ВладелецФормы, ДополнительныеДанные);
			ВыполнитьОбработкуОповещения(ОповещениеОбОбновленииКарты, Результат);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеПокупателяКлиент()
	
	ОбратноеОповещение = Новый ОписаниеОповещения("ОбработатьОбновлениеДанныхЛояльности", ЭтотОбъект);
	ОповещениеОбОтменеКарты = Новый ОписаниеОповещения("ОбработатьОповещениеОтменыВводаКарты", ЭтотОбъект.ВладелецФормы);
	ДанныеОповещения = Новый Структура("ОбратноеОповещение", ОбратноеОповещение);
	ДанныеОповещения.Вставить("ПлиточныйИнтерфейс", ИзПлиточногоИнтерфейса);
	ВыполнитьОбработкуОповещения(ОповещениеОбОтменеКарты, ДанныеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОбновлениеДанныхЛояльности(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьПараметрыЛояльности(Результат);
	Если РежимКассыСамообслуживания Тогда
		ИзменитьКартинкуВводПокупателяБезКонтекста(ЭтотОбъект);
	Иначе
		УправлениеВидимостьюРеквизитовКарты(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементаФормы(Элемент, Видимость)
	Элемент.Видимость = Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьКартойНаКлиенте()
	
	Ответ = ПолучитьШаблонОтвета();
	Ответ.ВидОплаты = "Карта";
	Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьСБПНаКлиенте()
	
	Ответ = ПолучитьШаблонОтвета();
	Ответ.ВидОплаты = "СБП";
	Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСкидкуПенсионерам()
	
	Если ПокупательПенсионер Тогда
		ОбратноеОповещение = Новый ОписаниеОповещения("ОбработатьОбновлениеСкидкиПенсионерам", ЭтотОбъект);
		ДополнительныеДанные = Новый Структура("ОбратноеОповещение", ОбратноеОповещение);
		Оповещение = Новый ОписаниеОповещения("ОбработатьВнешнийРасчетСкидкиПенсионера",
			ЭтотОбъект.ВладелецФормы, ДополнительныеДанные);
		ВыполнитьОбработкуОповещения(Оповещение, Истина);
	Иначе
		Ответ = ПолучитьШаблонОтвета();
		Ответ.Вставить("РассчитатьСкидкуПенсионерам", Истина);
		Закрыть(Ответ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОбновлениеСкидкиПенсионерам(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоБонусов = Результат.КоличествоБонусов;
	СуммаБезСкидки = Результат.СуммаБезСкидки;
	СуммаБонусовКНачислению = Результат.СуммаБонусовКНачислению;
	СуммаИтого = Результат.СуммаИтого;
	СуммаКОплате = Результат.СуммаКОплате;
	СуммаОплаченоБонусами = Результат.СуммаОплаченоБонусами;
	
	Элементы.ЗаголовокКнопкиСкидкаПенсионераКСО.Заголовок = Результат.ЗаголовокКомандыСкидкаПенсионера;
	Элементы.КнопкаСкидкаПенсионераКСО.Заголовок = Результат.ЗаголовокКомандыСкидкаПенсионера;
	
КонецПроцедуры

#КонецОбласти
