#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч( Параметры.НастройкиВыгрузкиРеквизитов ) = Тип( "Строка" ) Тогда
		
		ЗаполнитьСписокРеквизитов(Параметры.НастройкиВыгрузкиРеквизитов);
		// Для обратной совместимости по номенклатуре по умолчанию выгружаются все дополнительные свойства.
		
		ЗаполнитьСписокДопРеквизитов(Параметры.НастройкиВыгрузкиДопРеквизитов, 
		"Справочник_Номенклатура", Не Параметры.НастройкиВыгрузкиДопРеквизитовНоменклатурыИспользовать);
		
		ЗаполнитьСписокДопРеквизитов(Параметры.НастройкиВыгрузкиДопРеквизитов, 
		"Справочник_ХарактеристикиНоменклатуры", Не Параметры.НастройкиВыгрузкиДопРеквизитовНоменклатурыИспользовать);
		
		ЗаполнитьСписокДопРеквизитов(Параметры.НастройкиВыгрузкиДопРеквизитов, 
		"Справочник_КомплектацииНоменклатуры", Не Параметры.НастройкиВыгрузкиДопРеквизитовНоменклатурыИспользовать);
		
		ЗаполнитьСписокДопРеквизитов(Параметры.НастройкиВыгрузкиДопРеквизитов, 
		"Справочник_Номенклатура_Общие", Не Параметры.НастройкиВыгрузкиДопРеквизитовНоменклатурыИспользовать);
		
		ЗаполнитьСписокДопРеквизитов(Параметры.НастройкиВыгрузкиДопРеквизитов, 
		"Справочник_КомплектацииНоменклатуры_Общие", Не Параметры.НастройкиВыгрузкиДопРеквизитовНоменклатурыИспользовать);
		
	ИначеЕсли ТипЗнч( Параметры.НастройкиВыгрузкиДопРеквизитовЗаказов ) = Тип( "Строка" ) Тогда
		
		Элементы.СтраницаОсновныеРеквизиты.Видимость = Ложь;
		Элементы.СтраницыТело.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		ЗаполнитьСписокДопРеквизитов(Параметры.НастройкиВыгрузкиДопРеквизитовЗаказов, "Документ_ЗаказПокупателя");
		
	КонецЕсли;
	
	НастройкаИнтеграции = Параметры.НастройкаИнтеграции;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОсновныеРеквизитыКоличествоПомеченныхОбновить();
	ДополнительныеРеквизитыКоличествоПомеченныхОбновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРеквизитов

&НаКлиенте
Процедура СписокРеквизитовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокРеквизитовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокРеквизитовПриИзменении(Элемент)
	ДополнительныеРеквизитыКоличествоПомеченныхОбновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРеквизитовОсновныеРеквизиты

&НаКлиенте
Процедура СписокРеквизитовОсновныеРеквизитыПриИзменении(Элемент)
	ОсновныеРеквизитыКоличествоПомеченныхОбновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокРеквизитовОсновныеРеквизитыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокРеквизитовОсновныеРеквизитыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ВыбранныеРеквизиты = Новый Структура;
	НастройкиВыгрузкиРеквизитов = Новый Структура;
	НастройкиВыгрузкиДопРеквизитов = Новый Структура;
	
	Для Каждого Реквизит Из СписокРеквизитовОсновныеРеквизиты Цикл
		Если Реквизит.Пометка Тогда
			НастройкиВыгрузкиРеквизитов.Вставить( Реквизит.Значение, Реквизит.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Реквизит Из СписокРеквизитов Цикл
		Если Не Реквизит.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			НастройкиВыгрузкиДопРеквизитов.Вставить( Реквизит.Значение, Реквизит.Представление );
		Исключение
			ТекстОшибки = "Ошибка при заполнении дополнительного реквизита. Идентификатор некорректный: """ + Реквизит.Значение + """. Исключен из списка реквизитов.";
			ОбщегоНазначенияКлиент.СообщитьПользователю( ТекстОшибки );
			
			ОбменСВнешнимиСистемамиЛогированиеВызовСервера.ЗаписатьВЛог( ТекстОшибки, НастройкаИнтеграции, Истина );
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	ВыбранныеРеквизиты.Вставить("НастройкиВыгрузкиРеквизитов" , НастройкиВыгрузкиРеквизитов);
	ВыбранныеРеквизиты.Вставить("НастройкиВыгрузкиДопРеквизитов" , НастройкиВыгрузкиДопРеквизитов);
	
	Закрыть(ВыбранныеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьАктивность(Команда)
	УстановитьПометкуНаКлиенте( Ложь );
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАктивность(Команда)
	УстановитьПометкуНаКлиенте(Истина);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокДопРеквизитов(ТекущиеНастройки, ИмяТаблицы, ПометкаПоУмолчанию = Ложь)
	
	Если ЗначениеЗаполнено(ТекущиеНастройки) Тогда
		СоответствиеВыбранныхРеквизитов = ИнтеграцияСИнтернетМагазиномСервер.ЧтениеJSONВСтруктуру(ТекущиеНастройки, Истина);
	Иначе
		СоответствиеВыбранныхРеквизитов = Новый Соответствие;
	КонецЕсли;
	
	Отбор = Новый Структура( "Значение" );
	ТаблицаСвойств = УправлениеСвойствамиУНФ.СписокСвойствДляВидаОбъектов(ИмяТаблицы, "ДополнительныеРеквизиты");
	Для Каждого ДопРеквизит Из ТаблицаСвойств Цикл
		
		ИмяРеквизита = ДопРеквизит.Свойство.ИдентификаторДляФормул;
		НаименованиеДляВыгрузки = СоответствиеВыбранныхРеквизитов.Получить(ИмяРеквизита);
		
		Отбор.Значение = ИмяРеквизита;
		Если СписокРеквизитов.НайтиСтроки( Отбор ).Количество() > 0 Тогда
			// реквизит был добавлен ранее
			Продолжить;
		КонецЕсли;
		
		НовСтр = СписокРеквизитов.Добавить();
		НовСтр.Значение = ИмяРеквизита;
		
		Если НаименованиеДляВыгрузки = Неопределено Тогда
			НовСтр.Представление = ДопРеквизит.Наименование;
			НовСтр.Пометка = ПометкаПоУмолчанию;
		Иначе
			НовСтр.Представление = НаименованиеДляВыгрузки;
			НовСтр.Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	СписокРеквизитов.Сортировать( "Значение" );
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРеквизитов(ТекущиеНастройки)
	
	Если ЗначениеЗаполнено(ТекущиеНастройки) Тогда
		СписокВыбранныхРеквизитов = ИнтеграцияСИнтернетМагазиномСервер.ЧтениеJSONВСтруктуру(ТекущиеНастройки, Ложь);
	Иначе
		СписокВыбранныхРеквизитов = Новый Структура;
	КонецЕсли;
	
	Для каждого реквизит Из Метаданные.Справочники.Номенклатура.Реквизиты Цикл
		
		СвойстваРеквизитаСписка = Неопределено;
		ЕстьРеквизит = СписокВыбранныхРеквизитов.Свойство(реквизит.Имя, СвойстваРеквизитаСписка);
		
		НовСтр = СписокРеквизитовОсновныеРеквизиты.Добавить();
		НовСтр.Значение = реквизит.Имя;
		Если ЕстьРеквизит Тогда
			НовСтр.Представление = ?(ЗначениеЗаполнено(СвойстваРеквизитаСписка), СвойстваРеквизитаСписка, реквизит.Имя);
			НовСтр.Пометка = Истина;
		Иначе
			НовСтр.Представление = реквизит.Имя;
			НовСтр.Пометка = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	СписокРеквизитовОсновныеРеквизиты.Сортировать( "Значение" );
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуНаКлиенте( Значение )

	ТекущаяСтраница = Элементы.СтраницыТело.ТекущаяСтраница;
	ТекущиеРеквизиты = ?( ТекущаяСтраница = Элементы.СтраницаДополнительныеРеквизиты, СписокРеквизитов, СписокРеквизитовОсновныеРеквизиты );
	Для Каждого Элемент Из ТекущиеРеквизиты Цикл
		Элемент.Пометка = Значение;
	КонецЦикла;
	
	Если ТекущаяСтраница = Элементы.СтраницаДополнительныеРеквизиты Тогда
		ДополнительныеРеквизитыКоличествоПомеченныхОбновить();
	Иначе
		ОсновныеРеквизитыКоличествоПомеченныхОбновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеРеквизитыКоличествоПомеченныхОбновить()
	
	КоличествоПомеченных = 0;
	Для Каждого Элемент Из СписокРеквизитовОсновныеРеквизиты Цикл
		КоличествоПомеченных = КоличествоПомеченных + Элемент.Пометка;
	КонецЦикла;
	
	КоличествоВыбраноСписокРеквизитовОсновныеРеквизиты = КоличествоПомеченных;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыКоличествоПомеченныхОбновить()
	
	КоличествоПомеченных = 0;
	Для Каждого Элемент Из СписокРеквизитов Цикл
		КоличествоПомеченных = КоличествоПомеченных + Элемент.Пометка;
	КонецЦикла;
	
	КоличествоВыбраноСписокРеквизитов = КоличествоПомеченных;
КонецПроцедуры

#КонецОбласти

