
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстСообщенияБаннера = "";
	Если Параметры.ВызваноПриОткрытии Тогда
		Элементы.ГруппаОтключитьПредупреждение.Видимость = Истина;
		ТекстСообщенияБаннера = "Расходы на товары рассчитываются устаревшим способом, поэтому формирование записей ""Книги учета доходов и расходов"" может занимать длительное время." + Символы.ПС 
			+ "Рекомендуется выбрать другой вариант расчета." + Символы.ПС + Символы.ПС;
	КонецЕсли;
	
	СпособУчетаПартийТоваров = УчетПартийУСН.ТекущийРегистрУчетаПартийТоваров(); 
	ПараметрыБаннера = ОбщегоНазначения.ПараметрыВажногоСообщения();      
	ПараметрыБаннера.Сообщение = ТекстСообщенияБаннера + "После выбора нового способа расчета расходы на товары будут пересчитаны, это может занять длительное время." + Символы.ПС 
		+ "В результате пересчета могут измениться записи расходов КУДиР, но можно вернуться к старому варианту.";
	ПараметрыБаннера.ТипСообщения = "Информация";
    ПараметрыБаннера.Скрываемый = Ложь;
	ПараметрыБаннера.КраткоеПредставление = "После выбора нового способа расчета расходы на товары будут пересчитаны";
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект,ПараметрыБаннера);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	Если БольшеНеПоказывать Тогда
		Результат = Новый Структура;
		Результат.Вставить("ОтключитьПредупреждение", БольшеНеПоказывать);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("ОтключитьПредупреждение", БольшеНеПоказывать);
	Результат.Вставить("ИзмененРегистрПартий", ИзменитьРегистрУчетаПартий(СпособУчетаПартийТоваров));
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ИзменитьРегистрУчетаПартий(НовыйРегистр)
	
	ТекущийРегистр = УчетПартийУСН.ТекущийРегистрУчетаПартийТоваров();
	Если ТекущийРегистр = НовыйРегистр Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УчетПартийУСН.УстановитьРегистрУчетаПартийТоваров(НовыйРегистр);
	Возврат Истина;
	
КонецФункции

#КонецОбласти