
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрешеноРедактированиеЦенДокументов = УправлениеДоступомУНФ.РазрешеноРедактированиеЦенДокументов();
	ЭтаФорма.ТолькоПросмотр = НЕ РазрешеноРедактированиеЦенДокументов;
	ИспользуютсяСегментыНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьСегментыНоменклатуры");
	ВариантПоСегменту = Перечисления.ВариантПредоставленияСкидкиПоНоменклатуре.ПоСегментуНоменклатуры;
	ВариантПоНоменклатуре = Перечисления.ВариантПредоставленияСкидкиПоНоменклатуре.ПоНоменклатуре;
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	ПолучитьОграниченияКонфигурации();
	
	СкидкиНаценкиСерверПереопределяемый.ПолучитьСписокЗначенийУсловийПредоставленияСкидки(Элементы.УсловиеПредоставления.СписокВыбора);
	
	ВариантОграниченияПоНоменклатуреДоИзменения = Объект.ВариантПредоставленияСкидкиПоНоменклатуре;
	
	УсловиеПредоставленияПриИзмененииНаСервере();
	ВариантПредоставленияСкидкиПриИзменении();
	КритерийПримененияЗаОбъемПродажПриИзмененииНаСервере();
	ВидПериодаПриИзмененииНаСервере();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Наименование = СформироватьАвтоНаименованиеНаСервере();
	Иначе
		СформироватьАвтоНаименованиеНаСервере();
	КонецЕсли;
	
	ЗаполнитьПризнакиВТЧ();
	
	Для каждого ВариантНаименования Из Элементы.Наименование.СписокВыбора Цикл
		Если Объект.Наименование = ВариантНаименования.Значение Тогда
			ИспользуетсяАвтоНаименование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Ложь;
	
	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	СтруктураДоступныхСхем = Справочники.УсловияПредоставленияСкидокНаценок.СписокСхемСКД();
	Если ЗначениеЗаполнено(Объект.Ссылка) 
		И (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ПроизвольныйЗапрос
			ИЛИ Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.Расширение) Тогда
		СхемаКомпоновкиДанныхУсловия = Объект.Ссылка.ХранилищеСхемыКомпоновкиДанных.Получить();
		НастройкиСКД = Объект.Ссылка.ХранилищеНастроекКомпоновкиДанных.Получить();		
		Если СхемаКомпоновкиДанныхУсловия = Неопределено Тогда
			// Схема не выбрана. Обнулим схему. 
			Объект.ИмяСхемыКомпоновкиДанных = "";			
		КонецЕсли;
		ОбработатьИзменениеСхемыСКД(СхемаКомпоновкиДанныхУсловия, НастройкиСКД);
	Конецесли;
	Для Каждого ОписаниеСхемы Из СтруктураДоступныхСхем.ТиповыеСхемы Цикл
		Элементы.ПроизвольныйЗапросИмяСхемыКомпоновкиДанных.СписокВыбора.Добавить(ОписаниеСхемы.Ключ, ОписаниеСхемы.Значение);
	КонецЦикла;
	Элементы.ПроизвольныйЗапросИмяСхемыКомпоновкиДанных.СписокВыбора.Добавить("Произвольная", НСтр("ru = 'Произвольная'"));
	Для Каждого ОписаниеСхемы Из СтруктураДоступныхСхем.СхемыРасширений Цикл
		Элементы.РасширениеИмяСхемыКомпоновкиДанных.СписокВыбора.Добавить(ОписаниеСхемы.Ключ, ОписаниеСхемы.Значение);
	КонецЦикла;
	Элементы.РасширениеИмяСхемыКомпоновкиДанных.СписокВыбора.Добавить("Произвольная", НСтр("ru = 'Произвольная'"));
	Если Элементы.РасширениеИмяСхемыКомпоновкиДанных.СписокВыбора.Количество() > 1 Тогда
		Элементы.ГруппаПодсказкаСозданиеСкидок.Видимость = Ложь;
	Иначе
		Элементы.РасширениеГруппаСхемаСКД.Видимость = Ложь;			
		Элементы.РасширениеНастройкаКомпоновкиДанныхНастройкиОтбор.Видимость = Ложь;		
	КонецЕсли;
	ИмяСхемыСКДНаФорме = Объект.ИмяСхемыКомпоновкиДанных;
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	Настройки = Новый Структура;
	Настройки.Вставить("ОтборПродажПоНоменклатуре");
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Справочники.УсловияПредоставленияСкидокНаценок.ТабличныеЧасти.ОтборПродажПоНоменклатуре, 
		Настройки.ОтборПродажПоНоменклатуре, ЭтотОбъект, Ложь);
	НастройкиЗагрузкиДанных = Новый ФиксированнаяСтруктура(Настройки);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	
	// Характеристики
	НоменклатураВДокументахСервер.ОбновитьУсловноеОформлениеТабличнойЧастиДляХарактеристик(ЭтотОбъект,);
	
	ВариантПредоставленияСкидкиПриИзменении();
	УстановитьОтборСпискаШтрихкодов();
	ДобавитьПодсказки();
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьПризнакиВТЧ();
	
	ТипПолучателяСкидкиПредыдущий = ТипПолучателяСкидки;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// Процедура заполняет значения реквизитов ИспользоватьХарактеристики и ЭтоГруппа (добавлены в форме)
//
&НаСервере
Процедура ЗаполнитьПризнакиВТЧ()

	Для Каждого ТекущаяСтрока Из Объект.КомплектПокупки Цикл
		ТекущаяСтрока.ИспользоватьХарактеристики = ТекущаяСтрока.Номенклатура.ИспользоватьХарактеристики;
	КонецЦикла;
	Для Каждого ТекущаяСтрока Из Объект.ОтборПродажПоНоменклатуре Цикл
		ТекущаяСтрока.ИспользоватьХарактеристики = ТекущаяСтрока.Номенклатура.ИспользоватьХарактеристики;
		ТекущаяСтрока.ЭтоГруппа = ТекущаяСтрока.Номенклатура.ЭтоГруппа;
	КонецЦикла;

КонецПроцедуры

// Процедура - обработчик события ПередЗаписью.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	ОбновитьАвтонаименование(Модифицированность);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписиНаСервере.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПризнакиВТЧ();
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("УсловиеПредоставления_Запись");
	УстановитьОтборСпискаШтрихкодов();
	ОтключитьОтображениеБаннераКлиент("ШтрихкодыЗаглушкаЭтоНовый");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.Расширение 
		И Не ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда 
		ТекстСообщения = НСтр(
		"ru = 'Подключите расширение для проверки произвольного условия, согласно инструкции, после чего, укажите схему компоновки данных из расширения.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "РасширениеИмяСхемыКомпоновкиДанных",
			"Объект.ИмяСхемыКомпоновкиДанных", Отказ);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении элемента ВалютаОграничения.
//
&НаКлиенте
Процедура ВалютаОграниченияПриИзменении(Элемент)
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ЗначениеУсловияПредоставления.
//
&НаКлиенте
Процедура ЗначениеУсловияПредоставленияПриИзменении(Элемент)
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

// Процедура - обработчик события АвтоПодбор элемента Наименование.
//
&НаКлиенте
Процедура НаименованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		СформироватьАвтоНаименованиеНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента Наименование.
//
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	НаименованиеИзмененоПользователем = Истина;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ОбластьОграничения.
//
&НаКлиенте
Процедура ОбластьОграниченияПриИзменении(Элемент)
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ТипСравнения.
//
&НаКлиенте
Процедура ТипСравненияПриИзменении(Элемент)
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента УсловиеПредоставления формы.
//
&НаКлиенте
Процедура УсловиеПредоставленияПриИзменении(Элемент)
	
	УсловиеПредоставленияПриИзмененииНаСервере();
	Объект.Наименование = "";
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Серверная часть процедура УсловиеПредоставленияПриИзменении - обработчика события ПриИзменении элемента
// УсловиеПредоставления формы.
//
&НаСервере
Процедура УсловиеПредоставленияПриИзмененииНаСервере()
	
	ЭтоУсловиеЗаРазовыйОбъемПродаж     = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаРазовыйОбъемПродаж);
	ЭтоУсловиеЗаНакопленныйОбъемПродаж = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж);
	ЭтоУсловиеЗаОбъемПродаж            = (ЭтоУсловиеЗаРазовыйОбъемПродаж ИЛИ ЭтоУсловиеЗаНакопленныйОбъемПродаж);
	ЭтоУсловиеЗаКомплектПокупки        = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаКомплектПокупки);
	ЭтоУсловиеЗаОстатокСрокаГодности   = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаОстатокСрокаГодности);
	ЭтоУсловиеЗаДисконтнуюКарту        = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаДисконтнуюКарту);
	ЭтоУсловиеЗаДеньРождения           = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаДеньРождения);
	ЭтоУсловиеЗаШтрихкод               = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаШтрихкод);
	ЭтоУсловиеЗаПромокод               = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаПромокод);
	ЭтоУсловиеЗаАктивациюВручную       = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаАктивациюВручную);
	ЭтоУсловиеЗаВидОплаты              = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаВидОплаты);
	ЭтоУсловиеНаКатегорию			   = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаСоциальнуюКатегорию);
	ЭтоПроизвольныйЗапрос              = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ПроизвольныйЗапрос);
	ЭтоРасширение                      = (Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.Расширение);
	
	Если ЭтоУсловиеЗаОбъемПродаж Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.ЗаОбъемПродаж;
	ИначеЕсли ЭтоУсловиеЗаКомплектПокупки Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.ЗаКомплектПокупки;
	ИначеЕсли ЭтоУсловиеЗаОстатокСрокаГодности Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.ЗаОстатокСрокаГодности;
	ИначеЕсли ЭтоУсловиеЗаДисконтнуюКарту Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.ЗаДисконтнуюКарту;
	ИначеЕсли ЭтоУсловиеЗаДеньРождения Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.ЗаДеньРождения;
	ИначеЕсли ЭтоУсловиеЗаШтрихкод Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.ЗаШтрихкод;
	ИначеЕсли ЭтоУсловиеЗаПромокод Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.ЗаПромокод;
	ИначеЕсли ЭтоУсловиеЗаАктивациюВручную Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.ЗаРучнуюАктивацию;
	ИначеЕсли ЭтоУсловиеЗаВидОплаты Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.ЗаВидОплаты;
	ИначеЕсли ЭтоПроизвольныйЗапрос Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.ПроизвольныйЗапрос;
	ИначеЕсли ЭтоРасширение Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.Расширение;
	ИначеЕсли ЭтоУсловиеНаКатегорию Тогда
		Элементы.ГруппаРеквизитыТиповУсловий.ТекущаяСтраница = Элементы.ЗаПодтверждениеКатегорииГражданина;
	КонецЕсли;
	
	УсловияСРазличнымиПрименениями = Новый Массив;
	УсловияСРазличнымиПрименениями.Добавить(Перечисления.УсловияПредоставленияСкидокНаценок.ЗаРазовыйОбъемПродаж);
	УсловияСРазличнымиПрименениями.Добавить(Перечисления.УсловияПредоставленияСкидокНаценок.ЗаАктивациюВручную);
	УсловияСРазличнымиПрименениями.Добавить(Перечисления.УсловияПредоставленияСкидокНаценок.ПроизвольныйЗапрос);
	УсловияСРазличнымиПрименениями.Добавить(Перечисления.УсловияПредоставленияСкидокНаценок.Расширение);
	
	Если УсловияСРазличнымиПрименениями.Найти(Объект.УсловиеПредоставления) = Неопределено Тогда
		Объект.ОбластьОграничения = Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе;
	КонецЕсли;
	
	УсловияПоСтроке = Новый Массив;
	УсловияПоСтроке.Добавить(Перечисления.УсловияПредоставленияСкидокНаценок.ЗаОстатокСрокаГодности);
	УсловияПоСтроке.Добавить(Перечисления.УсловияПредоставленияСкидокНаценок.ЗаШтрихкод);
	
	Если УсловияПоСтроке.Найти(Объект.УсловиеПредоставления) <> Неопределено Тогда
		Объект.ОбластьОграничения = Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке;
	КонецЕсли;
	
	Элементы.ОбластьОграничения.Видимость = ЭтоУсловиеЗаРазовыйОбъемПродаж;
	ВариантПредоставленияСкидкиПриИзменении();
	Элементы.ВидПериода.Видимость = ЭтоУсловиеЗаНакопленныйОбъемПродаж;
	Элементы.Периодичность.Видимость = ЭтоУсловиеЗаНакопленныйОбъемПродаж;
	Элементы.ВключатьТекущуюПродажуВНакопленныйОбъемПродаж.Видимость = ЭтоУсловиеЗаНакопленныйОбъемПродаж;
	Элементы.ВариантПредоставленияСкидкиПоНоменклатуре.Видимость = ИспользуютсяСегментыНоменклатуры;
	
	// Произвольные условия и расширения
	ВидимостьИзменитьСхему = Ложь;
	Если ЭтоПроизвольныйЗапрос ИЛИ ЭтоРасширение Тогда
		Макеты = Справочники.УсловияПредоставленияСкидокНаценок.СписокСхемСКД();
		СтруктураМакетов = Новый Структура;
		Если ЭтоПроизвольныйЗапрос Тогда
			СтруктураМакетов = Макеты.ТиповыеСхемы;
		ИначеЕсли ЭтоРасширение Тогда
			СтруктураМакетов = Макеты.СхемыРасширений;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ИмяСхемыКомпоновкиДанных)
			И Не СтруктураМакетов.Свойство(Объект.ИмяСхемыКомпоновкиДанных) Тогда
			Объект.ИмяСхемыКомпоновкиДанных = "";
		КонецЕсли;
		Если Объект.ИмяСхемыКомпоновкиДанных = "" Тогда		
			// Установим первый по счету макет из доступных
			Объект.ИмяСхемыКомпоновкиДанных = ПолучитьПервыйКлючСтруктуры(СтруктураМакетов);
			ИмяСхемыСКДНаФорме = Объект.ИмяСхемыКомпоновкиДанных;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ИмяСхемыКомпоновкиДанных) Тогда
			СхемаКомпоновкиДанныхПриИзмененииНаСервере(Ложь);
		КонецЕсли; 
		ПодсказкаОбластьОграничения = "";
		Если Объект.ОбластьОграничения = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе") Тогда
			ПодсказкаОбластьОграничения = НСтр("ru = 'Скидка будет применена к документу целиком. Если в отборах используются поля с окончанием ""... (строка)"", то скидка будет применена ко всему документу, если в будет хотя бы одна строка, удовлетворяющая условию.'");
		Иначе
			ПодсказкаОбластьОграничения = НСтр("ru = 'Скидка будет применена к каждой отдельной строке. Используется для проверки значений строки таблицы товаров, представленных полями с окончанием ""... (строка)"". Допустимо использование дополнительных отборов на реквизиты шапки документа, или итогов по таблице товаров.'");
		КонецЕсли;
		Элементы.ПроизвольныйЗапросОбластьОграничения.Подсказка = ПодсказкаОбластьОграничения;
		Элементы.РасширениеОбластьОграничения.Подсказка = ПодсказкаОбластьОграничения;
		ВидимостьИзменитьСхему = Истина;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаИзменитьСхемуСКД", "Видимость", ВидимостьИзменитьСхему);

	ТекстПодсказки = Символы.ПС;
	Если ЭтоУсловиеЗаРазовыйОбъемПродаж Тогда
		ТекстПодсказки = "ru = 'Скидка предоставляется при достижении определенного объема продажи в документе'";
	ИначеЕсли ЭтоУсловиеЗаНакопленныйОбъемПродаж Тогда
		ТекстПодсказки = "ru = 'Скидка предоставляется при достижении определенного объема продажи по дисконтной карте'";
	ИначеЕсли ЭтоУсловиеЗаКомплектПокупки Тогда
		ТекстПодсказки = "ru = 'Скидка (наценка) будет предоставлена, если в документе есть все позиции из табличной части условия. 
		|В колонке ""Количество"" указывается минимальное значение'";
	ИначеЕсли ЭтоУсловиеЗаОстатокСрокаГодности Тогда
		ТекстПодсказки = "ru = 'Предоставляется на сроки годности маркированного товара и серий номенклатуры. 
		|Проверка условия выполняется по строке. Если для строки указано более одной серии или более одного кода маркировки - условие не применяется.'";
	ИначеЕсли ЭтоУсловиеЗаДисконтнуюКарту Тогда
		ТекстПодсказки = "ru = 'Скидка предоставляется при предъявлении дисконтной карты определенного вида'";
	ИначеЕсли ЭтоУсловиеЗаДеньРождения Тогда
		ТекстПодсказки = "ru = 'Скидка сработает при покупке в определенный период до и после дня рождения покупателя. 
		|Дата рождения указывается в карточке контрагента в разделе ""Юридические данные"".'";
	ИначеЕсли ЭтоУсловиеЗаШтрихкод Тогда
		ТекстПодсказки = "ru = 'Необходимо связать штрихкод с автоматической скидкой. Тогда скидка будет активирована сканированием служебного штрихкода.
		|Одно и то же условие типа ""По штрихкоду"" можно использовать только в одной автоматической скидке.'";
	ИначеЕсли ЭтоУсловиеЗаПромокод Тогда
		ТекстПодсказки = "ru = 'Промокод должен быть предъявлен при оформлении документа продажи, или заказа покупателя'";
	ИначеЕсли ЭтоУсловиеЗаАктивациюВручную Тогда
		ТекстПодсказки = "ru = 'Скидка активируется вручную при продаже.'";
	ИначеЕсли ЭтоУсловиеЗаВидОплаты Тогда
		ТекстПодсказки = "ru = 'Скидка активируется в момент выбора способа оплаты, только если документ полностью оплачен выбранным способом.'";
	ИначеЕсли ЭтоУсловиеНаКатегорию Тогда
		ТекстПодсказки = "ru = 'Скидка активируется когда покупатель подтвердит принадлежность к определенной социальной категории.'";
	КонецЕсли;
	Элементы.ГруппаШапкаЛево.РасширеннаяПодсказка.Заголовок = НСтр(ТекстПодсказки);
	
	ВариантПредоставленияПоСегменту  = Объект.ВариантПредоставленияСкидкиПоНоменклатуре = Перечисления.ВариантПредоставленияСкидкиПоНоменклатуре.ПоСегментуНоменклатуры;
	Если ЭтоУсловиеЗаРазовыйОбъемПродаж 
		ИЛИ ЭтоУсловиеЗаНакопленныйОбъемПродаж 
		ИЛИ ЭтоУсловиеЗаОстатокСрокаГодности Тогда
		Если Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ПроизвольныйЗапрос
			ИЛИ Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.Расширение Тогда
			КоличествоСтрокФильтров = НастройкаКомпоновкиДанных.Настройки.Отбор.Элементы.Количество();
		ИначеЕсли ВариантПредоставленияПоСегменту Тогда
			КоличествоСтрокФильтров = Объект.ОтборПродажПоСегменту.Количество();
		Иначе
			КоличествоСтрокФильтров = Объект.ОтборПродажПоНоменклатуре.Количество();
		КонецЕсли;
	КонецЕсли;
	
	ВидимостьКомплекта = ЭтоУсловиеЗаКомплектПокупки;
	ВидимостьФильтров = ЭтоУсловиеЗаРазовыйОбъемПродаж
		ИЛИ ЭтоУсловиеЗаНакопленныйОбъемПродаж
		ИЛИ ЭтоУсловиеЗаОстатокСрокаГодности
		ИЛИ ЭтоПроизвольныйЗапрос
		ИЛИ ЭтоРасширение;
	ВидимостьШтрихкодов = ЭтоУсловиеЗаШтрихкод;
	Элементы.СтраницаФильтров.Видимость = ВидимостьФильтров;	
	Элементы.ГруппаОтбораПоНоменклатуре.Видимость = ВидимостьФильтров И НЕ ЭтоПроизвольныйЗапрос И НЕ ЭтоРасширение;
	Элементы.ПроизвольныйЗапросНастройкаКомпоновкиДанныхНастройкиОтбор.Видимость = ЭтоПроизвольныйЗапрос;
	Элементы.РасширениеНастройкаКомпоновкиДанныхНастройкиОтбор.Видимость = ЭтоРасширение;
	Элементы.СтраницаКомплекта.Видимость = ВидимостьКомплекта;
	Элементы.СтраницаШтрихкоды.Видимость = ВидимостьШтрихкодов;
	Если ВидимостьФильтров ИЛИ ВидимостьКомплекта ИЛИ ВидимостьШтрихкодов Тогда
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента КритерийОграниченияПримененияЗаОбъемПродаж формы.
//
&НаКлиенте
Процедура КритерийПримененияЗаОбъемПродажПриИзменении(Элемент)
	
	КритерийПримененияЗаОбъемПродажПриИзмененииНаСервере();
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Серверная часть процедура КритерийПримененияЗаОбъемПродажПриИзменении - обработчика события ПриИзменении элемента
// КритерийОграниченияПримененияЗаОбъемПродаж формы.
//
&НаСервере
Процедура КритерийПримененияЗаОбъемПродажПриИзмененииНаСервере()
	
	Если Объект.КритерийОграниченияПримененияЗаОбъемПродаж = Перечисления.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество Тогда
		
		Элементы.ВалютаОграничения.Видимость = Ложь;
		Элементы.ЗначениеУсловияПредоставления.ФорматРедактирования = Формат("ЧДЦ=3");
		
	Иначе
		
		Элементы.ВалютаОграничения.Видимость = ИспользуютсяВалюты;
		Элементы.ЗначениеУсловияПредоставления.ФорматРедактирования = Формат("ЧДЦ=2");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидПериодаПриИзмененииНаСервере()
	
	Элементы.Периодичность.Доступность = (Объект.ВидПериода <> ПредопределенноеЗначение("Перечисление.ВидыПериодовДляНакопительныхСкидок.ВесьПериод"));
	Если Не ЗначениеЗаполнено(Объект.Периодичность) И Элементы.Периодичность.Доступность Тогда
		Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	ВидПериодаПриИзмененииНаСервере();
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДисконтнойКартыПриИзменении(Элемент)
	
	Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПредоставленияСкидкиПоНоменклатуреПриИзменении(Элемент)
	
	Если (Объект.ОтборПродажПоНоменклатуре.Количество() > 0 
		И Объект.ВариантПредоставленияСкидкиПоНоменклатуре = ВариантПоСегменту)
		ИЛИ (Объект.ОтборПродажПоСегменту.Количество()> 0 
		И Объект.ВариантПредоставленияСкидкиПоНоменклатуре = ВариантПоНоменклатуре) Тогда
		
		Описание = Новый ОписаниеОповещения("ВариантПредоставленияСкидкиПоНоменклатуреПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Описание, НСтр("ru = 'Таблица отборов будет очищена. Продолжить?'"), 
			РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет, НСтр("ru = 'Изменение варианта отборов'"));
	Иначе
		ВариантОграниченияПоНоменклатуреДоИзменения = Объект.ВариантПредоставленияСкидкиПоНоменклатуре;
		ВариантПредоставленияСкидкиПриИзменении();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПромокодаПриИзменении(Элемент)
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаРучнуюАктивациюОбластьОграниченияПриИзменении(Элемент)
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СхемаКомпоновкиДанныхПриИзменении(Элемент)	
	СхемаКомпоновкиДанныхПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РасширениеОбластьОграниченияПриИзменении(Элемент)
	УсловиеПредоставленияПриИзмененииНаСервере();// Обновить подсказки	
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйЗапросОбластьОграниченияПриИзменении(Элемент)
	УсловиеПредоставленияПриИзмененииНаСервере();// Обновить подсказки	
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьСрокаГодностиПриИзменении(Элемент)
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
	"Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомплектПокупки

// Процедура - обработчик события ПриИзменении в колонке Номенклатура ТЧ КомплектПокупки формы.
//
&НаКлиенте
Процедура КомплектПокупкиНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.КомплектПокупки.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьСбросКоличества И СбрасыватьКоличество
		И СтрокаТабличнойЧасти.Количество <> НовоеКоличествоПриИзмененииНоменклатуры Тогда
		
		ДопПараметр = Новый Структура();
		ДопПараметр.Вставить("Элемент", Элемент);
		ДопПараметр.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		Оповещение = Новый ОписаниеОповещения("КомплектПокупкиПодтверждениеСбросаКоличестваЗавершение",
			ЭтотОбъект, ДопПараметр);
		ОткрытьФорму("ОбщаяФорма.ПодтверждениеСбросаКоличества", , , , , , Оповещение);
		
	Иначе
		
		Если СбрасыватьКоличество Тогда
			НовоеКоличество = НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		КомплектПокупкиНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектПокупкиПодтверждениеСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗапрашиватьСбросКоличества = Результат.ЗапрашиватьСбросКоличества;
		Если НЕ ЗапрашиватьСбросКоличества Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		КонецЕсли;
		Если Результат.СбрасыватьКоличество Тогда
			НовоеКоличество = Результат.НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = ДополнительныеПараметры.Количество;
		КонецЕсли;
	Иначе
		НовоеКоличество = ДополнительныеПараметры.Количество;
	КонецЕсли;
	
	КомплектПокупкиНоменклатураПриИзмененииПродолжить(ДополнительныеПараметры.Элемент, НовоеКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектПокупкиНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество)

	СтрокаТабличнойЧасти = Элементы.КомплектПокупки.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = НовоеКоличество;
	СтрокаТабличнойЧасти.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
	
КонецПроцедуры

// Процедура - обработчик события ПослеУдаления ТЧ КомплектПокупки формы.
//
&НаКлиенте
Процедура КомплектПокупкиПослеУдаления(Элемент)
	
	Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектПокупкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	СтрокаТабличнойЧасти = Элемент.ТекущиеДанные;
	Если НоваяСтрока И НЕ Копирование Тогда
		СтрокаТабличнойЧасти.Количество = НовоеКоличествоПриИзмененииНоменклатуры;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриОкончанииРедактирования ТЧ КомплектПокупки формы.
//
&НаКлиенте
Процедура КомплектПокупкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыОтборПродажПоНоменклатуре

// Процедура - обработчик события ПриОкончанииРедактирования ТЧ ОтборПродажПоНоменклатуре формы.
//
&НаКлиенте
Процедура ОтборПродажПоНоменклатуреПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
	
КонецПроцедуры

// Процедура - обработчик события ПослеУдаления ТЧ ОтборПродажПоНоменклатуре формы.
//
&НаКлиенте
Процедура ОтборПродажПоНоменклатуреПослеУдаления(Элемент)
	
	Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении в колонке Номенклатура ТЧ ОтборПродажПоНоменклатуре формы.
//
&НаКлиенте
Процедура ОтборПродажПоНоменклатуреНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ОтборПродажПоНоменклатуре.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
	СтрокаТабличнойЧасти.ЭтоГруппа = СтруктураДанные.ЭтоГруппа;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобавитьГруппуНоменклатурыЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",, ЭтотОбъект,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСбросаКоличества(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтрокаПоиска", НСтр("ru = 'Сбрасывать количество при изменении номенклатуры'"));
	Оповещение = Новый ОписаниеОповещения("НастройкаСбросаКоличестваЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПерсональныеНастройки.Форма.ФормаНастройкиПользователя", СтруктураПараметров, , , , ,
		Оповещение);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, 
		Элементы.КомплектПокупкиКонтекстноеМенюНастройкаСбросаКоличества, "Нажатие");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОтборНоменклатуры(Команда)
	ИмяТабличнойЧасти = "ОтборПродажПоНоменклатуре";
	ПараметрыПодбора = Новый Структура("ТолькоНоменклатураИКоличество", Истина);
	ДополнительныеПараметры = Новый Структура("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ОбработчикПодбора = Новый ОписаниеОповещения("ОбработкаПодбораНоменклатуры", ЭтотОбъект, ДополнительныеПараметры);
	ПодборНоменклатурыВДокументахКлиент.ОткрытьФормуПодбораНоменклатуры(ЭтотОбъект, 
																		ИмяТабличнойЧасти, 
																		ПараметрыПодбора, 
																		ОбработчикПодбора);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзВнешнегоИсточникаОтборПродаж(Команда)

	ТекущаяНастройкаЗагрузкиДанных = НастройкиЗагрузкиДанных.ОтборПродажПоНоменклатуре;
	ТекущаяНастройкаЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Справочник.УсловияПредоставленияСкидокНаценок.ТабличнаяЧасть.ОтборПродажПоНоменклатуре";
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект,
		ТекущаяНастройкаЗагрузкиДанных);

	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(ТекущаяНастройкаЗагрузкиДанных,
		ОписаниеОповещения, ЭтотОбъект);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВариантПредоставленияСкидкиПоНоменклатуреПриИзмененииЗавершение(РезультатОтвета, ДополнительныеПараметры) Экспорт

	Если РезультатОтвета <> КодВозвратаДиалога.Да Тогда
		Объект.ВариантПредоставленияСкидкиПоНоменклатуре = ВариантОграниченияПоНоменклатуреДоИзменения;
		Возврат;
	КонецЕсли;
	
	ВариантОграниченияПоНоменклатуреДоИзменения = Объект.ВариантПредоставленияСкидкиПоНоменклатуре;
	
	ВариантПредоставленияСкидкиПриИзменении();
	
	Если ВариантОграниченияПоНоменклатуреДоИзменения = ВариантПоСегменту Тогда
		Объект.ОтборПродажПоНоменклатуре.Очистить();
	Иначе
		Объект.ОтборПродажПоСегменту.Очистить();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ВариантПредоставленияСкидкиПриИзменении()
	
	ВариантПредоставленияПоСегменту  = Объект.ВариантПредоставленияСкидкиПоНоменклатуре = Перечисления.ВариантПредоставленияСкидкиПоНоменклатуре.ПоСегментуНоменклатуры;
	ЭтоУсловиеЗаОстатокСрокаГодности = Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаОстатокСрокаГодности;
	
	Если ВариантПредоставленияПоСегменту Тогда
		Если ЭтоУсловиеЗаОстатокСрокаГодности Тогда
			ТекстПодсказки = НСтр("ru = 'Заполните список сегментов, если требуется учитывать срок годности только определенного сегмента номенклатуры.
			|Если список не заполнен, то условие рассчитывается без ограничения по сегменту.'");
		Иначе
			ТекстПодсказки = НСтр("ru = 'Заполните список сегментов, если требуется учитывать объем продаж только определенного сегмента номенклатуры.
			|Если список не заполнен, то объем продаж рассчитывается без ограничения по сегменту.'");
		КонецЕсли;
		Элементы.ПодсказкаОтборПоНоменклатуре.Заголовок = ТекстПодсказки;
		Элементы.ГруппаОтбораПоНоменклатуре.ТекущаяСтраница = Элементы.СтраницаОтборПоСегментуНоменклатуры;
		Элементы.ОтборПродажПоНоменклатуреПодобратьОтборНоменклатуры.Видимость = Ложь;
	Иначе
		Если ЭтоУсловиеЗаОстатокСрокаГодности Тогда
			ТекстПодсказки = НСтр("ru = 'Заполните список номенклатуры, если требуется учитывать срок годности только определенного списка номенклатуры
			|или групп номенклатуры. Если список не заполнен, то условие рассчитывается без ограничения по номенклатуре.'");
		Иначе
			ТекстПодсказки = НСтр("ru = 'Заполните список номенклатуры, если требуется учитывать объем продаж только определенного списка номенклатуры
			|или групп номенклатуры. Если список не заполнен, то объём продаж рассчитывается без ограничения по номенклатуре.'");
		КонецЕсли;
		Элементы.ПодсказкаОтборПоНоменклатуре.Заголовок = ТекстПодсказки;
		Элементы.ГруппаОтбораПоНоменклатуре.ТекущаяСтраница = Элементы.СтраницаОтборПоНоменклатуре;
		Элементы.ОтборПродажПоНоменклатуреПодобратьОтборНоменклатуры.Видимость = Истина;
	КонецЕсли;

	Если Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ПроизвольныйЗапрос
		ИЛИ Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.Расширение Тогда
		КоличествоСтрокФильтров = НастройкаКомпоновкиДанных.Настройки.Отбор.Элементы.Количество();
	ИначеЕсли ВариантПредоставленияПоСегменту Тогда
		КоличествоСтрокФильтров = Объект.ОтборПродажПоСегменту.Количество();
	Иначе
		КоличествоСтрокФильтров = Объект.ОтборПродажПоНоменклатуре.Количество();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуНоменклатурыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		НоваяСтрока = Объект.ОтборПродажПоНоменклатуре.Добавить();
		НоваяСтрока.Номенклатура = РезультатЗакрытия;
		Элементы.ОтборПродажПоНоменклатуре.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

// Процедура определят использование валют.
//
&НаСервере
Процедура ПолучитьОграниченияКонфигурации()

	ИспользуютсяВалюты = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");

КонецПроцедуры

// Функция возвращает краткий состав табличной части в виде строки.
//
&НаКлиенте
Функция ОписаниеТабличнойЧастиКлиент(ИмяТаблицы, ИмяРеквизита, КоличествоЭлементов = 0)

	ОписаниеТаблицы = "";
	
	НомерЭлемента = 0;
	Для каждого ЭлементТаблицы Из Объект[ИмяТаблицы] Цикл
		
		НомерЭлемента = НомерЭлемента + 1;
		Если Не КоличествоЭлементов = 0 И (КоличествоЭлементов + 1) = НомерЭлемента Тогда
			ОписаниеТаблицы = ОписаниеТаблицы + "... ,";
		ИначеЕсли Не КоличествоЭлементов = 0 И (КоличествоЭлементов + 1) < НомерЭлемента Тогда
			Прервать;
		Иначе
			ОписаниеТаблицы = ОписаниеТаблицы + Строка(ЭлементТаблицы[ИмяРеквизита]) + ", ";
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ОписаниеТаблицы = "" Тогда
	
		ОписаниеТаблицы = Лев(ОписаниеТаблицы, СтрДлина(ОписаниеТаблицы) - 2);
	
	КонецЕсли;
	
	Возврат ОписаниеТаблицы;

КонецФункции

// Функция возвращает краткий состав табличной части в виде строки.
//
&НаСервере
Функция ОписаниеТабличнойЧастиСервер(ИмяТаблицы, ИмяРеквизита, КоличествоЭлементов = 0)

	ОписаниеТаблицы = "";
	
	НомерЭлемента = 0;
	Для каждого ЭлементТаблицы Из Объект[ИмяТаблицы] Цикл
		
		НомерЭлемента = НомерЭлемента + 1;
		Если Не КоличествоЭлементов = 0 И (КоличествоЭлементов + 1) = НомерЭлемента Тогда
			ОписаниеТаблицы = ОписаниеТаблицы + "... ,";
		ИначеЕсли Не КоличествоЭлементов = 0 И (КоличествоЭлементов + 1) < НомерЭлемента Тогда
			Прервать;
		Иначе
			ОписаниеТаблицы = ОписаниеТаблицы + Строка(ЭлементТаблицы[ИмяРеквизита]) + " ,";
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ОписаниеТаблицы = "" Тогда
	
		ОписаниеТаблицы = Лев(ОписаниеТаблицы, СтрДлина(ОписаниеТаблицы) - 2);
	
	КонецЕсли;
	
	Возврат ОписаниеТаблицы;

КонецФункции

// Процедура обновляет наименование, если пользователь не менял его вручную.
//
&НаКлиенте
Процедура ОбновитьАвтонаименование(Обновить = Истина)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) ИЛИ (Обновить И ИспользуетсяАвтоНаименование И Не НаименованиеИзмененоПользователем) Тогда
		Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
		ИспользуетсяАвтоНаименование = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает сформированное автонаименование.
//
&НаКлиенте
Функция СформироватьАвтоНаименованиеНаКлиенте()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	КраткийСоставОтбораНоменклатуры = ОписаниеТабличнойЧастиКлиент("ОтборПродажПоНоменклатуре", "Номенклатура");
	Если Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаРазовыйОбъемПродаж") Тогда
		СтрокаНаименования = ""+?(Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество"), "Кол-во", Объект.КритерийОграниченияПримененияЗаОбъемПродаж) + " " + 
		?(Объект.ОбластьОграничения = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе"),НСтр("ru = 'в документе'"),НСтр("ru = 'в строке'")) + " "+Объект.ТипСравнения + " "+Объект.ЗначениеУсловияОграничения + 
		?(Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество"), НСтр("ru = ' ед.'"), " "+Объект.ВалютаОграничения);
		Если Объект.ОтборПродажПоНоменклатуре.Количество() > 0 Тогда
			СтрокаНаименования = СтрокаНаименования + ": " + КраткийСоставОтбораНоменклатуры;
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж") Тогда
		СтрокаНаименования = ""+?(Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество"), "Кол-во", Объект.КритерийОграниченияПримененияЗаОбъемПродаж) + " " + 
		Объект.ВидПериода + " " + ?(Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыПериодовДляНакопительныхСкидок.ВесьПериод"), "", НРег(Объект.Периодичность)) + " " + Объект.ТипСравнения + " "+Объект.ЗначениеУсловияОграничения + 
		?(Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество"), НСтр("ru = ' ед.'"), " "+Объект.ВалютаОграничения);
		Если Объект.ОтборПродажПоНоменклатуре.Количество() > 0 Тогда
			СтрокаНаименования = СтрокаНаименования + ": " + КраткийСоставОтбораНоменклатуры;
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаКомплектПокупки") Тогда
		СтрокаНаименования = НСтр("ru = 'Комплект:'");
		СтрокаНаименования = СтрокаНаименования + " " + ОписаниеТабличнойЧастиКлиент("КомплектПокупки", "Номенклатура");
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаДисконтнуюКарту") Тогда
		СтрокаНаименования = НСтр("ru = 'Предъявлена дисконтная карта'");
		Если ЗначениеЗаполнено(Объект.ВидДисконтнойКарты) Тогда
			СтрокаНаименования = СтрокаНаименования + ": " + Объект.ВидДисконтнойКарты;
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаДеньРождения") Тогда
		СтрокаНаименования = НСтр("ru = 'За покупку в день рождения'");
		Если ЗначениеЗаполнено(Объект.ДнейПередДнемРождения) Тогда
			СтрокаНаименования = СтрокаНаименования + " (" + Объект.ДнейПередДнемРождения + НСтр("ru = 'д. перед'");
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ДнейПослеДняРождения) Тогда
			СтрокаНаименования = СтрокаНаименования + ?(ЗначениеЗаполнено(Объект.ДнейПередДнемРождения), ", ", " (");
			СтрокаНаименования = СтрокаНаименования + Объект.ДнейПослеДняРождения + НСтр("ru = 'д. после)'");
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаПромокод") Тогда
		СтрокаНаименования = НСтр("ru = 'Предъявлен промокод'");
		Если ЗначениеЗаполнено(Объект.ШаблонПромокода) Тогда
			СтрокаНаименования = СтрокаНаименования + " (" + НСтр("ru = 'Шаблон: '") + Объект.ШаблонПромокода + ")";
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаАктивациюВручную") Тогда
		СтрокаНаименования = НСтр("ru = 'Активирована вручную'");
		Если Объект.ОбластьОграничения = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке") Тогда
			СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = 'для строки'");
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ПроизвольныйЗапрос") Тогда
		СтрокаНаименования = НСтр("ru = 'Произвольное условие'");
		Если Объект.ОбластьОграничения = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке") Тогда
			СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = 'для строки'");
		КонецЕсли;
		Если Объект.СхемаСКДМодифицированаВручную Тогда
			СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = '(запрос модифицирован)'");
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.Расширение") Тогда
		СтрокаНаименования = НСтр("ru = 'Расширение'");
		Если Объект.ОбластьОграничения = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке") Тогда
			СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = 'для строки'");
		КонецЕсли;
		Если Объект.СхемаСКДМодифицированаВручную Тогда
			СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = '(запрос модифицирован)'");
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаВидОплаты") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'За полную оплату %1'"), НРег(Объект.ВидОплаты));
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаОстатокСрокаГодности") Тогда
		Если Объект.ПериодСрокаГодности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Час") Тогда
			ПериодичностьКратко = "ч.";
		ИначеЕсли Объект.ПериодСрокаГодности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.День") Тогда
			ПериодичностьКратко = "д.";
		ИначеЕсли Объект.ПериодСрокаГодности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Месяц") Тогда
			ПериодичностьКратко = "мес.";
		ИначеЕсли Объект.ПериодСрокаГодности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Год") Тогда
			ПериодичностьКратко = "г.";
		Иначе
			ПериодичностьКратко = "";
		КонецЕсли;
		СтрокаНаименования = СтрШаблон(НСтр("ru='Остаток срока годности %1 %2 %3'"),
									Объект.ТипСравнения, Объект.ЗначениеУсловияОграничения, ПериодичностьКратко);
		Если Объект.ОтборПродажПоНоменклатуре.Количество() > 0 Тогда
			СтрокаНаименования = СтрокаНаименования + ": " + КраткийСоставОтбораНоменклатуры;
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаШтрихкод") Тогда
		СтрокаНаименования = НСтр("ru = 'Скидка по штрихкоду'");
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаСоциальнуюКатегорию") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'Социальная категория - %1'"), Объект.КатегорияПокупателя);
	КонецЕсли;
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	Возврат СтрокаНаименования;

КонецФункции

// Функция возвращает сформированное автонаименование.
//
&НаСервере
Функция СформироватьАвтоНаименованиеНаСервере()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	Если Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаРазовыйОбъемПродаж Тогда
		СтрокаНаименования = ""+?(Объект.КритерийОграниченияПримененияЗаОбъемПродаж = Перечисления.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество, "Кол-во", Объект.КритерийОграниченияПримененияЗаОбъемПродаж) + " " + 
		?(Объект.ОбластьОграничения = Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе,НСтр("ru = 'в документе'"),НСтр("ru = 'в строке'")) + " "+Объект.ТипСравнения + " "+Объект.ЗначениеУсловияОграничения + 
		?(Объект.КритерийОграниченияПримененияЗаОбъемПродаж = Перечисления.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество, НСтр("ru = ' ед.'"), " "+Объект.ВалютаОграничения);
		Если Объект.ОтборПродажПоНоменклатуре.Количество() > 0 Тогда
			СтрокаНаименования = СтрокаНаименования + ": " + ОписаниеТабличнойЧастиСервер("ОтборПродажПоНоменклатуре", "Номенклатура");
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж") Тогда
		СтрокаНаименования = ""+?(Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество"), "Кол-во", Объект.КритерийОграниченияПримененияЗаОбъемПродаж) + " за " + 
		Объект.ВидПериода + " " + ?(Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыПериодовДляНакопительныхСкидок.ВесьПериод"), "", Объект.Периодичность) + " " + Объект.ТипСравнения + " "+Объект.ЗначениеУсловияОграничения + 
		?(Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество"), НСтр("ru = ' ед.'"), " "+Объект.ВалютаОграничения);
		Если Объект.ОтборПродажПоНоменклатуре.Количество() > 0 Тогда
			СтрокаНаименования = СтрокаНаименования + ": " + ОписаниеТабличнойЧастиСервер("ОтборПродажПоНоменклатуре", "Номенклатура");
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаКомплектПокупки Тогда
		СтрокаНаименования = НСтр("ru = 'Комплект:'");
		СтрокаНаименования = СтрокаНаименования + " " + ОписаниеТабличнойЧастиСервер("КомплектПокупки", "Номенклатура");
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаДисконтнуюКарту") Тогда
		СтрокаНаименования = НСтр("ru = 'Предъявлена дисконтная карта'");
		Если ЗначениеЗаполнено(Объект.ВидДисконтнойКарты) Тогда
			СтрокаНаименования = СтрокаНаименования + ": " + Объект.ВидДисконтнойКарты;
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаДеньРождения") Тогда
		СтрокаНаименования = НСтр("ru = 'За покупку в день рождения'");
		Если ЗначениеЗаполнено(Объект.ДнейПередДнемРождения) Тогда
			СтрокаНаименования = СтрокаНаименования + " (" + Объект.ДнейПередДнемРождения + НСтр("ru = 'д. перед'");
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ДнейПослеДняРождения) Тогда
			СтрокаНаименования = СтрокаНаименования + ?(ЗначениеЗаполнено(Объект.ДнейПередДнемРождения), ", ", " (");
			СтрокаНаименования = СтрокаНаименования + Объект.ДнейПослеДняРождения + НСтр("ru = 'д. после)'");
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаПромокод") Тогда
		СтрокаНаименования = НСтр("ru = 'Предъявлен промокод'");
		Если ЗначениеЗаполнено(Объект.ШаблонПромокода) Тогда
			СтрокаНаименования = СтрокаНаименования + " (" + НСтр("ru = 'Шаблон: '") + Объект.ШаблонПромокода + ")";
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаАктивациюВручную") Тогда
		СтрокаНаименования = НСтр("ru = 'Активирована вручную'");
		Если Объект.ОбластьОграничения = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке") Тогда
			СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = 'для строки'");
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ПроизвольныйЗапрос") Тогда
		СтрокаНаименования = НСтр("ru = 'Произвольное условие'");
		Если Объект.ОбластьОграничения = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке") Тогда
			СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = 'для строки'");
		КонецЕсли;
		Если Объект.СхемаСКДМодифицированаВручную Тогда
			СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = '(запрос модифицирован)'");
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.Расширение") Тогда
		СтрокаНаименования = НСтр("ru = 'Расширение'");
		Если Объект.ОбластьОграничения = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке") Тогда
			СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = 'для строки'");
		КонецЕсли;
		Если Объект.СхемаСКДМодифицированаВручную Тогда
			СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = '(запрос модифицирован)'");
		КонецЕсли;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаВидОплаты") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'За полную оплату %1'"), НРег(Объект.ВидОплаты));
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаСоциальнуюКатегорию") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'Социальная категория - %1'"), Объект.КатегорияПокупателя);
	КонецЕсли;
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	Возврат СтрокаНаименования;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкиИзмененияКоличества()
	
	НастройкиКоличества = ДокументыУНФКлиентСервер.ПараметрыСбросаКоличества();
	ДокументыУНФ.ЗаполнитьНастройкиКоличества(НастройкиКоличества);
	Возврат НастройкиКоличества;
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбработкаПодбораНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура")
		И Результат.Свойство("АдресКорзиныВХранилище")
		И ЗначениеЗаполнено(Результат.АдресКорзиныВХранилище) Тогда
		ИмяТабличнойЧасти = "НоменклатураГруппыЦеновыеГруппы";
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
			И ДополнительныеПараметры.Свойство("ИмяТабличнойЧасти") Тогда
			ИмяТабличнойЧасти = ДополнительныеПараметры.ИмяТабличнойЧасти;
		КонецЕсли;
		ПолучитьНоменклатуруИзХранилища(Результат.АдресКорзиныВХранилище, ИмяТабличнойЧасти);
	КонецЕсли; 
	
КонецПроцедуры

// Функция получает список товаров из временного хранилища
//
// Параметры:
//  АдресПодарковВХранилище - Строка - строка, содержащая электронные адреса
//  ИмяТабличнойЧасти - Строка - Имя табличной части, в которую необходимо поместить подарки
&НаСервере
Процедура ПолучитьНоменклатуруИзХранилища(АдресПодарковВХранилище, ИмяТабличнойЧасти)	
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресПодарковВХранилище);
	
	НоваяСтрока = Неопределено;
	
	Если ИмяТабличнойЧасти = "НоменклатураГруппыЦеновыеГруппы" Тогда
		ТаблицаДляЗагрузки.Колонки.Номенклатура.Имя = "ЗначениеУточнения";
	КонецЕсли;
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		
		Если ИмяТабличнойЧасти = "НаборПодарков"
			И ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда

			ОбработатьДобавлениеСтрокиЗапасов(НоваяСтрока, ИмяТабличнойЧасти);
			
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры // ПолучитьЗапасыИзХранилища()	

&НаСервере
Процедура ОбработатьДобавлениеСтрокиЗапасов(НоваяСтрока, ИмяТабличнойЧасти = "Подарки")
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.Номенклатура, 
		"ТипНоменклатуры, Вес, Объем, ЭтоНабор, СпособРасчетаЦеныНабора");
	
	СтруктураДанныеНоменклатуры = Новый Структура();
	СтруктураДанныеНоменклатуры.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
	СтруктураДанныеНоменклатуры.Вставить("Характеристика", НоваяСтрока.Характеристика);

	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры);
		
	// Характеристики
	НоваяСтрока.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
	НоваяСтрока.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
	
	Если СтруктураДанные.ИспользоватьХарактеристики
		Тогда
		НоваяСтрока.Характеристика = СтруктураДанные.Характеристика;
	КонецЕсли;
	// Конец Характеристики
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если ДополнительныеПараметры.Свойство("ПолноеИмяОбъектаЗаполнения") Тогда 
			ПолноеИмяОбъектаЗаполнения = ДополнительныеПараметры.ПолноеИмяОбъектаЗаполнения;
		Иначе    
			ПолноеИмяОбъектаЗаполнения = РезультатЗагрузки.НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
		КонецЕсли;
				
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(
				НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата",
				ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(
				НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			Если ПолноеИмяОбъектаЗаполнения = "Справочник.УсловияПредоставленияСкидокНаценок.ТабличнаяЧасть.ОтборПродажПоНоменклатуре" Тогда
				
				ДлительнаяОперация = ОбработатьПодготовленныеДанныеНоменклатуры(РезультатЗагрузки);
				
				СтруктураПараметров = Новый Структура;
				Если РезультатЗагрузки.НастройкиЗагрузкиДанных.Свойство("ТекстОшибки") Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗагрузки.НастройкиЗагрузкиДанных.ТекстОшибки);
				КонецЕсли;
				
				ПроверитьНеобходимостьПодключенияОбработчикаОжиданияОбработкиНоменклатуры(ДлительнаяОперация, СтруктураПараметров);
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНеобходимостьПодключенияОбработчикаОжиданияОбработкиНоменклатуры(ДлительнаяОперация, СтруктураПараметров = Неопределено)
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПослеВыполненияФоновогоЗаданияОбработкиНоменклатуры(ДлительнаяОперация, СтруктураПараметров);
		
	Иначе
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеВыполненияФоновогоЗаданияОбработкиНоменклатуры", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Идет загрузка данных.'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияФоновогоЗаданияОбработкиНоменклатуры(Прогресс, ДополнительныеПараметры) Экспорт
	
	Если НЕ Прогресс = Неопределено Тогда
		ОбработатьПодготовленныеДанныеОтборПродажПоНоменклатуре(Прогресс.АдресРезультата);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанныеОтборПродажПоНоменклатуре(АдресРезультатаЗагрузки)
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресРезультатаЗагрузки);		
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.ОтборПродажПоНоменклатуре.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ЗаписатьОшибкуВЖурналРегистрации(ИнформацияОбОшибке, НСтр("ru = 'Отбор продаж по номенклатуре'"));
		
	КонецПопытки;
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьПодготовленныеДанныеНоменклатуры(РезультатЗагрузки)
	
	ПараметрыВызоваСервера = Новый Структура;
	ПараметрыВызоваСервера.Вставить("НастройкиЗагрузкиДанных", РезультатЗагрузки.НастройкиЗагрузкиДанных);
	ПараметрыВызоваСервера.Вставить("ТаблицаСопоставленияДанных", ДанныеФормыВЗначение(РезультатЗагрузки.ТаблицаСопоставленияДанных, Тип("ТаблицаЗначений")));
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Подсистема ЗагрузкаДанныхИзВнешнегоИсточника: Выполнение серверного метода загрузки результата'");
	ПараметрыВыполнения.ЗапуститьНеВФоне    = Ложь;
	ПараметрыВыполнения.ЗапуститьВФоне      = Истина;	
	
	ИмяМетода = "Справочники.Номенклатура.ОбработатьПодготовленныеДанные";
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыВызоваСервера, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Процедура ЗаписатьОшибкуВЖурналРегистрации(ИнформацияОбОшибке, КонтекстОшибки)

	ИмяСобытия = НСтр("ru='Загрузка данных'", ОбщегоНазначения.КодОсновногоЯзыка());

	ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	Комментарий = СтрШаблон("%1%2%3", КонтекстОшибки, Символы.ПС, ПодробноеПредставлениеОшибки);

	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ВводНачальныхОстатков,
		, Комментарий);

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанные.Номенклатура, "ЕдиницаИзмерения, ИспользоватьХарактеристики, ПроверятьЗаполнениеХарактеристики, ЭтоГруппа");
 	СтруктураДанные.Вставить("ЕдиницаИзмерения", РеквизитыНоменклатуры.ЕдиницаИзмерения);
 	СтруктураДанные.Вставить("ИспользоватьХарактеристики", РеквизитыНоменклатуры.ИспользоватьХарактеристики);
 	СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики", РеквизитыНоменклатуры.ПроверятьЗаполнениеХарактеристики);
 	СтруктураДанные.Вставить("ЭтоГруппа", РеквизитыНоменклатуры.ЭтоГруппа);			
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ПроизвольныйЗапрос
		ИЛИ ТекущийОбъект.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.Расширение Тогда
		
		СсылкаУсловие = ТекущийОбъект.Ссылка;
		ПараметрУсловие = НастройкаКомпоновкиДанных.Настройки.ПараметрыДанных.Элементы.Найти("Условие");
		Если Не ПараметрУсловие = Неопределено Тогда
			Если Не ЗначениеЗаполнено(СсылкаУсловие) Тогда
				СсылкаУсловие = Справочники.УсловияПредоставленияСкидокНаценок.ПолучитьСсылку(Новый УникальныйИдентификатор());
				ТекущийОбъект.УстановитьСсылкуНового(СсылкаУсловие);
			КонецЕсли;		
			ПараметрУсловие.Значение = СсылкаУсловие;
		КонецЕсли;
		
		// Данные объекты используются только для возможности редактировать настройки в интерфейсе
		Настройки = НастройкаКомпоновкиДанных.ПолучитьНастройки();
		СхемаКомпоновкиДанныхУсловия = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		ПараметрУсловие = СхемаКомпоновкиДанныхУсловия.Параметры.Найти("Условие");
		Если Не ПараметрУсловие = Неопределено Тогда
			Если Не ЗначениеЗаполнено(СсылкаУсловие) Тогда
				СсылкаУсловие = Справочники.УсловияПредоставленияСкидокНаценок.ПолучитьСсылку(Новый УникальныйИдентификатор());
				ТекущийОбъект.УстановитьСсылкуНового(СсылкаУсловие);
			КонецЕсли;		
			ПараметрУсловие.Значение = СсылкаУсловие;
		КонецЕсли;
		
		ТекущийОбъект.ХранилищеСхемыКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанныхУсловия);
		ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(Настройки);
		
		// Фактически, для выполнения будет использоваться уже заранее скомпонованный макет.
		// Для каждого отдельного документа будут обновляться значения параметров, и данные в менеджере временных таблиц
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанныхУсловия, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ТекущийОбъект.ХранилищеСкомпонованногоМакета = Новый ХранилищеЗначения(МакетКомпоновки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СхемаКомпоновкиДанныхПриИзмененииНаСервере(СохранитьНастройки = Истина)
	НастройкиДоИзменения = Неопределено;
	Если СохранитьНастройки Тогда
		НастройкиДоИзменения = НастройкаКомпоновкиДанных.ПолучитьНастройки();
	КонецЕсли;
	СхемаКомпоновкиДанныхУсловия = Неопределено;
	Попытка
		СхемаКомпоновкиДанныхУсловия = Справочники.УсловияПредоставленияСкидокНаценок.ПолучитьМакет(Объект.ИмяСхемыКомпоновкиДанных);		
		Объект.СхемаСКДМодифицированаВручную = Ложь;
	Исключение
		СхемаКомпоновкиДанныхУсловия = Неопределено;
	КонецПопытки;
	Если Не СхемаКомпоновкиДанныхУсловия = Неопределено Тогда
		ОбработатьИзменениеСхемыСКД(СхемаКомпоновкиДанныхУсловия, НастройкиДоИзменения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСхемыСКД(СхемаКомпоновкиДанныхУсловия, НастройкиДоИзменения = Неопределено)
	Если ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхУсловия, АдресСхемыКомпоновкиДанных);
	Иначе
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхУсловия, УникальныйИдентификатор);
	КонецЕсли;
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	НастройкаКомпоновкиДанных.Инициализировать(ИсточникНастроек);
	Если ЗначениеЗаполнено(НастройкиДоИзменения) Тогда
		НастройкаКомпоновкиДанных.ЗагрузитьНастройки(НастройкиДоИзменения);
		НастройкаКомпоновкиДанных.Восстановить();
	Иначе
		НастройкаКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанныхУсловия.НастройкиПоУмолчанию);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрУсловие = НастройкаКомпоновкиДанных.Настройки.ПараметрыДанных.Элементы.Найти("Условие");
		Если Не ПараметрУсловие = Неопределено Тогда
			ПараметрУсловие.Значение = Объект.Ссылка;
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСхемуСКД(Команда)
	ОткрытьФормуИзмененияСхемыСКД();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуИзмененияСхемыСКД()
	АдресСхемыДляРедактирования = ПоместитьКопиюСхемыВоВременноеХранилище(АдресСхемыКомпоновкиДанных, УникальныйИдентификатор);
	
	ПараметрыФормы = Новый Структура;
	ЗаголовокФормыНастройкиСхемыКомпоновкиДанных = НСтр(
		"ru = 'Настройте схему компоновки данных для условия скидки '");

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПомещатьНастройкиВСхемуКомпоновкиДанных", Ложь);
	ПараметрыФормы.Вставить("РедактироватьСхемуКомпоновкиДанных", Истина);
	ПараметрыФормы.Вставить("ЗагрузитьСхемуИзФайла", Истина);
	ПараметрыФормы.Вставить("НастраиватьОтбор", Истина);
	ПараметрыФормы.Вставить("НастраиватьПараметры", Истина);
	ПараметрыФормы.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыФормы.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("АдресСхемыКомпоновкиДанных", АдресСхемыДляРедактирования);
	ПараметрыФормы.Вставить("АдресНастроекКомпоновкиДанных", ПоместитьНастройкиСКДВоВременноеХранилище());
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормыНастройкиСхемыКомпоновкиДанных);
	
	ДополнительныеПараметры = Новый Структура("АдресСхемыДляРедактирования", АдресСхемыДляРедактирования);
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактироватьСхемуКомпоновкиДанныхЗавершение", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("ОбщаяФорма.УпрощеннаяНастройкаСхемыКомпоновкиДанных", ПараметрыФормы, , , , , ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоместитьКопиюСхемыВоВременноеХранилище(АдресСхемы, УникальныйИдентификатор)
	Схема = ПолучитьИзВременногоХранилища(АдресСхемы);
	Возврат ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор)
КонецФункции

&НаКлиенте
Процедура ОткрытьМастерПроизвольногоУсловия(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка", Объект.Ссылка);
	ОткрытьФорму("Справочник.УсловияПредоставленияСкидокНаценок.Форма.ФормаПодсказкиРасширение", ПараметрыФормы, , , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры 

&НаСервере
Функция ПоместитьНастройкиСКДВоВременноеХранилище()
	Возврат ПоместитьВоВременноеХранилище(НастройкаКомпоновкиДанных.ПолучитьНастройки(), УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура РедактироватьСхемуКомпоновкиДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт

	РедактироватьСхемуКомпоновкиДанныхЗавершениеНаСервере(Результат, ДополнительныеПараметры);
	Если Модифицированность Тогда
		ОбновитьАвтонаименование(Истина);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РедактироватьСхемуКомпоновкиДанныхЗавершениеНаСервере(Результат, ДополнительныеПараметры) Экспорт

 	АдресХранилищаНастройкиКомпоновщика = Результат;

	Если ЗначениеЗаполнено(АдресХранилищаНастройкиКомпоновщика) Тогда
		// Схема могла быть модифицирована
		АдресИзмененнойСхемы = Неопределено;
		Если ДополнительныеПараметры.Свойство("АдресСхемыДляРедактирования", АдресИзмененнойСхемы) Тогда
			ТиповаяСхема = Справочники.УсловияПредоставленияСкидокНаценок.ПолучитьМакет(Объект.ИмяСхемыКомпоновкиДанных);
			НоваяСхема = ПолучитьИзВременногоХранилища(АдресИзмененнойСхемы);
			Если ЦенообразованиеСервер.ПолучитьXML(НоваяСхема) = ЦенообразованиеСервер.ПолучитьXML(ТиповаяСхема) Тогда
				Объект.СхемаСКДМодифицированаВручную = Ложь;
			Иначе
				Объект.СхемаСКДМодифицированаВручную = Истина;
				ИмяСхемыСКДНаФорме = "Произвольная";
				ПоместитьВоВременноеХранилище(НоваяСхема, АдресСхемыКомпоновкиДанных);
				ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
				НастройкаКомпоновкиДанных.Инициализировать(ИсточникНастроек);
			КонецЕсли;
		КонецЕсли;

		НовыеНастройки = ПолучитьИзВременногоХранилища(АдресХранилищаНастройкиКомпоновщика);		
		НастройкаКомпоновкиДанных.ЗагрузитьНастройки(НовыеНастройки);
		НастройкаКомпоновкиДанных.Восстановить();
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПервыйКлючСтруктуры(АнализируемаяСтруктура)
	Результат = Неопределено;
	Если Не ТипЗнч(АнализируемаяСтруктура) = Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Для Каждого ЭлементСтруктуры Из АнализируемаяСтруктура Цикл
		Результат = ЭлементСтруктуры.Ключ;
		Прервать;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьМастерПроизвольногоУсловия(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ИмяСхемыКомпоновкиДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Стандартная обработка изменит имя в реквизите формы, а имя в реквизите объекта обновим следующим образом.
	Если ВыбранноеЗначение = "Произвольная" Тогда
		// Имя схемы в реквизите объекта останется прежним, чтобы корректно сработала процедура подготовки параметров
		// А имя на форме изменится на "Произвольная" - так пользователю будет очевидно, что схема редактировалась вручную
		Объект.СхемаСКДМодифицированаВручную = Истина;
	ИначеЕсли Объект.СхемаСКДМодифицированаВручную Тогда		
		СтандартнаяОбработка = Ложь;
		ТекстВопроса = НСтр("ru = 'Схема компоновки была ранее модифицирована вручную. Отменить изменения?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИзмененияВыбраннойСхемы", ЭтаФорма, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	Иначе
		ПослеИзмененияВыбраннойСхемы(КодВозвратаДиалога.Да, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение));
	КонецЕсли;
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияВыбраннойСхемы(Значение, ДополнительныеПараметры) Экспорт
	НовоеИмяСхемы = Неопределено;
	Если Значение = КодВозвратаДиалога.Да 
		И Не ДополнительныеПараметры = Неопределено 
		И ДополнительныеПараметры.Свойство("ВыбранноеЗначение", НовоеИмяСхемы)
		И Не НовоеИмяСхемы = "Произвольная" Тогда
		ИмяСхемыСКДНаФорме = НовоеИмяСхемы;
		Объект.ИмяСхемыКомпоновкиДанных = НовоеИмяСхемы ;
		СхемаКомпоновкиДанныхПриИзменении(Неопределено);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйВидОплатыПриИзменении(Элемент)
	СформироватьАвтоНаименованиеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКомментарий(Команда)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура РасширениеИмяСхемыКомпоновкиДанныхОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуИзмененияСхемыСКД();
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйЗапросИмяСхемыКомпоновкиДанныхОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуИзмененияСхемыСКД();
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйЗапросИмяСхемыКомпоновкиДанныхНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуИзмененияСхемыСКД();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаШтрихкодов()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ДСШтрихкодыДляСкидки.Видимость = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСШтрихкодыДляСкидки, "УсловиеПредоставленияСкидки", Объект.Ссылка,);
	Иначе
		Элементы.ДСШтрихкодыДляСкидки.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПодсказки()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		ПараметрыВажногоСообщения.ТипСообщения = "Информация";
		ПараметрыВажногоСообщения.КраткоеПредставление = "Подсказка требуется запись для отображения штрихкодов";
		ПараметрыВажногоСообщения.Родитель = "ГруппаШтрихкодыЗаглушкаЭтоНовый";
		ПараметрыВажногоСообщения.Скрываемый = Ложь;
		ПараметрыВажногоСообщения.Идентификатор = "ШтрихкодыЗаглушкаЭтоНовый";
		ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Для просмотра штрихкодов необходимо записать условие'");

		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения);
		ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ШтрихкодыЗаглушкаЭтоНовыйОбработкаЗакрытия(Команда)
	
	ОтключитьОтображениеБаннераКлиент("ШтрихкодыЗаглушкаЭтоНовый");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтображениеБаннераКлиент(ИдентификаторБаннера)
	
	ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(
		ЭтотОбъект,
		ИдентификаторБаннера);
	
КонецПроцедуры
#КонецОбласти

