#Область СлужебныеПроцедурыИФункции

Функция МенюСтраницПереключениеСТекущейСтраницыРазрешено( Форма )
	
	Результат = Истина;
	
	МенюСтраницРеквизит = КаналыПродажКлиентСервер.МенюСтраницРеквизитПолучить( Форма );
	
	// проверка заполнения текущей страницы
	Если Форма.МенюСтраницТекущаяСтрокаДоПереключения < 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	МенюСтраницДоПереключенияДанные = МенюСтраницРеквизит.Получить( Форма.МенюСтраницТекущаяСтрокаДоПереключения );
	Если МенюСтраницДоПереключенияДанные = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИмяСтраницы = МенюСтраницДоПереключенияДанные.ИмяСтраницы;
	Результат = МенюСтраницПоляСтраницыЗаполненыКорректно( Форма, ИмяСтраницы );
	
	Если МенюСтраницДоПереключенияДанные.ПоляСтраницыЗаполненыКорректно <> Результат Тогда
		МенюСтраницДоПереключенияДанные.ПоляСтраницыЗаполненыКорректно = Результат;
	КонецЕсли;
	
	Если Результат = Истина Тогда
		
		Если КаналыПродажКлиентСервер.МенюСтраницПараметрЗначениеПолучить( Форма, "СтрокиОтмечатьКорректноЗаполненные" ) = Истина Тогда
			КартинкаНомер = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерСтраницаЗаполненаКорректно();
		Иначе
			КартинкаНомер = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();
		КонецЕсли;
		
		Если МенюСтраницДоПереключенияДанные.ВтораяКартинкаСтроки <> КартинкаНомер Тогда
			МенюСтраницДоПереключенияДанные.ВтораяКартинкаСтроки = КартинкаНомер;
		КонецЕсли;
		
	Иначе
		
		КартинкаНомер = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерСтраницаЗаполненаНеКорректно();
		Если МенюСтраницДоПереключенияДанные.ВтораяКартинкаСтроки <> КартинкаНомер Тогда
			МенюСтраницДоПереключенияДанные.ВтораяКартинкаСтроки = КартинкаНомер;
		КонецЕсли;
		
		МенюСтраницПерейтиНаСтрокуДоПереключения( Форма );
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция МенюСтраницПереключениеНаСтрокуРазрешено( Форма, ИндексСтроки )

	МенюСтраницРеквизит = КаналыПродажКлиентСервер.МенюСтраницРеквизитПолучить( Форма );
	
	// проверка доступности строки
	МенюСтраницДанные = МенюСтраницРеквизит.Получить( ИндексСтроки );
	Результат = МенюСтраницДанные.ДоступностьСтраницыДляПереключения;
	
	Если Результат = Ложь Тогда
		МенюСтраницПерейтиНаСтрокуДоПереключения( Форма );
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура МенюСтраницПерейтиНаСтрокуДоПереключения( Форма )

	МенюСтраницРеквизит = КаналыПродажКлиентСервер.МенюСтраницРеквизитПолучить( Форма );
	МенюСтраницЭлемент = КаналыПродажКлиентСервер.МенюСтраницЭлементПолучить( Форма );
	
	МенюСтраницДоПереключенияДанные = МенюСтраницРеквизит.Получить( Форма.МенюСтраницТекущаяСтрокаДоПереключения );
	Если МенюСтраницДоПереключенияДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если МенюСтраницЭлемент.ТекущаяСтрока <> Форма.МенюСтраницТекущаяСтрокаДоПереключения Тогда
		МенюСтраницЭлемент.ТекущаяСтрока = Форма.МенюСтраницТекущаяСтрокаДоПереключения;
		МенюСтраницНастройкиФормыОбновить( Форма );
	КонецЕсли;
	
	ЭлементСтраница = Форма.Элементы[ МенюСтраницДоПереключенияДанные.ИмяСтраницы ];
	Если ЭлементСтраница.Родитель.ТекущаяСтраница <> ЭлементСтраница Тогда
		ЭлементСтраница.Родитель.ТекущаяСтраница = ЭлементСтраница;
	КонецЕсли;
	
КонецПроцедуры

Процедура МенюСтраницПерейти( Форма, Знач Значение = Неопределено ) Экспорт
	
	// Значение - сдвиг, имя страницы, Неопределено - текущая строка

	МенюСтраницРеквизит = КаналыПродажКлиентСервер.МенюСтраницРеквизитПолучить( Форма );
	МенюСтраницЭлемент = КаналыПродажКлиентСервер.МенюСтраницЭлементПолучить( Форма );
	
	ПроверятьЗаполнениеПолейСтраницы = Истина;
	
	Если Значение = Неопределено Тогда
		// имя страницы из текущей строки
		
		Если МенюСтраницЭлемент.ТекущаяСтрока = Форма.МенюСтраницТекущаяСтрокаДоПереключения Тогда
			ПроверятьЗаполнениеПолейСтраницы = Ложь;
		КонецЕсли;
		
		Если МенюСтраницЭлемент.ТекущаяСтрока = Неопределено Тогда
			МенюСтраницЭлемент.ТекущаяСтрока = 0;
		КонецЕсли;
		
		МенюСтраницТекущиеДанные = МенюСтраницРеквизит.Получить( МенюСтраницЭлемент.ТекущаяСтрока );
		ИмяСтраницы = МенюСтраницТекущиеДанные.ИмяСтраницы;
		Значение = ИмяСтраницы;
		
	КонецЕсли;
	
	ТипЗначения = ТипЗнч( Значение );
	
	Если ТипЗначения = Тип( "Число" ) И Значение < 0 Тогда
		// назад можно переключить без проверки заполнения
		ПроверятьЗаполнениеПолейСтраницы = Ложь;
	КонецЕсли;
	
	Если ТипЗначения = Тип( "Строка" ) Тогда
		
		ИмяСтраницы = Значение;
		МенюСтраницСтроки = МенюСтраницРеквизит.НайтиСтроки( Новый Структура( "ИмяСтраницы", ИмяСтраницы ) );
		Если МенюСтраницСтроки.Количество() > 0 Тогда
			
			ТекущаяСтрокаНовая = МенюСтраницРеквизит.Индекс( МенюСтраницСтроки[ 0 ] );
			Если Форма.МенюСтраницТекущаяСтрокаДоПереключения = ТекущаяСтрокаНовая Тогда
				// не было действия перехода на другую строку
				Возврат;
			КонецЕсли;
			
			Если Не МенюСтраницПереключениеНаСтрокуРазрешено( Форма, ТекущаяСтрокаНовая ) Тогда
				Возврат;
			КонецЕсли;
			
			Если МенюСтраницЭлемент.ТекущаяСтрока <> ТекущаяСтрокаНовая 
				Или Форма.МенюСтраницТекущаяСтрокаДоПереключения <> ТекущаяСтрокаНовая
				Тогда
				
				Если ПроверятьЗаполнениеПолейСтраницы = Истина 
					И МенюСтраницПереключениеСТекущейСтраницыРазрешено( Форма ) = Ложь Тогда
					Возврат;
				КонецЕсли;
				
				МенюСтраницЭлемент.ТекущаяСтрока = ТекущаяСтрокаНовая;
				МенюСтраницНастройкиФормыОбновить( Форма );
			КонецЕсли;
			
			ЭлементСтраница = Форма.Элементы[ ИмяСтраницы ];
			Если ЭлементСтраница.Родитель.ТекущаяСтраница <> ЭлементСтраница Тогда
				ЭлементСтраница.Родитель.ТекущаяСтраница = ЭлементСтраница;
			КонецЕсли;
			
			Форма.МенюСтраницТекущаяСтрокаДоПереключения = ТекущаяСтрокаНовая;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗначения = Тип( "Число" ) Тогда
		
		МенюСтраницТекущаяСтрока = МенюСтраницЭлемент.ТекущаяСтрока;
		Если МенюСтраницТекущаяСтрока = Неопределено Тогда
			
			МенюСтраницЭлемент.ТекущаяСтрока = 0;
			МенюСтраницНастройкиФормыОбновить( Форма );
			
			Возврат;
		КонецЕсли;
		
		Сдвиг = Значение;
		Если Сдвиг = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ТекущаяСтрокаНовая = МенюСтраницЭлемент.ТекущаяСтрока + Сдвиг;
		Если ТекущаяСтрокаНовая < 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущаяСтрокаНовая >= МенюСтраницРеквизит.Количество() Тогда
			Возврат;
		КонецЕсли;
		
		Если Сдвиг > 0 Тогда
			Шаг = 1;
		Иначе
			Шаг = -1;
		КонецЕсли;
		
		Пока Истина Цикл
			
			МенюСтраницДанные = МенюСтраницРеквизит.Получить( ТекущаяСтрокаНовая );
			Если МенюСтраницДанные.ДоступностьСтраницы = Истина Тогда
				
				// если нажали далее или назад, то страница доступна для переключения
				МенюСтраницДанные.ДоступностьСтраницыДляПереключения = Истина;
				
				Если МенюСтраницЭлемент.ТекущаяСтрока <> ТекущаяСтрокаНовая
					Или Форма.МенюСтраницТекущаяСтрокаДоПереключения <> ТекущаяСтрокаНовая
					Тогда
					
					Если ПроверятьЗаполнениеПолейСтраницы = Истина 
						И МенюСтраницПереключениеСТекущейСтраницыРазрешено( Форма ) = Ложь Тогда
						Возврат;
					КонецЕсли;
					
					МенюСтраницЭлемент.ТекущаяСтрока = ТекущаяСтрокаНовая;
					МенюСтраницНастройкиФормыОбновить( Форма );
				КонецЕсли;
				
				ЭлементСтраница = Форма.Элементы[ МенюСтраницДанные.ИмяСтраницы ];
				Если ЭлементСтраница.Родитель.ТекущаяСтраница <> ЭлементСтраница Тогда
					ЭлементСтраница.Родитель.ТекущаяСтраница = ЭлементСтраница;
				КонецЕсли;
				
				Форма.МенюСтраницТекущаяСтрокаДоПереключения = ТекущаяСтрокаНовая;
				
				Возврат;
			КонецЕсли;
			
			ТекущаяСтрокаНовая = ТекущаяСтрокаНовая + Шаг;
			Если ТекущаяСтрокаНовая < 0 Тогда
				Возврат;
			КонецЕсли;
			
			Если ТекущаяСтрокаНовая >= МенюСтраницРеквизит.Количество() Тогда
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция МенюСтраницТекущаяСтраницаИмяПолучить( Форма ) Экспорт
	МенюСтраницРеквизит = КаналыПродажКлиентСервер.МенюСтраницРеквизитПолучить( Форма );
	МенюСтраницЭлемент = КаналыПродажКлиентСервер.МенюСтраницЭлементПолучить( Форма );

	МенюСтраницТекущиеДанные = МенюСтраницРеквизит.Получить( МенюСтраницЭлемент.ТекущаяСтрока );
	Если МенюСтраницТекущиеДанные = Неопределено Тогда
		ИмяСтраницы = "";
	Иначе
		ИмяСтраницы = МенюСтраницТекущиеДанные.ИмяСтраницы;
	КонецЕсли;
	
	Возврат ИмяСтраницы;
КонецФункции

Процедура МенюСтраницНастройкиФормыОбновить( Форма ) Экспорт
	
	ИмяСтраницы = МенюСтраницТекущаяСтраницаИмяПолучить( Форма );
	
	Форма.МенюСтраницНастройкиФормыОбновить( ИмяСтраницы );
	
	Если КаналыПродажКлиентСервер.МенюСтраницПараметрЗначениеПолучить( Форма, "КнопкаВпередИспользование" ) = Истина Тогда
		Если Форма.Элементы.МенюСтраницВперед.Видимость = Истина Тогда
			Форма.Элементы.МенюСтраницВперед.Важность = ВажностьКнопки.Главная;
			Форма.Элементы.МенюСтраницВперед.КнопкаПоУмолчанию = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция МенюСтраницПоляСтраницыЗаполненыКорректно( Форма, ИмяСтраницы ) Экспорт
	Результат = Форма.МенюСтраницПоляСтраницыЗаполненыКорректно( ИмяСтраницы );
	Возврат Результат;
КонецФункции

#КонецОбласти