
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьПараметрыФормы();
	ДобавитьВажныеСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	КлючСохраненияПоложенияОкна = "";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодключитьСтартовыйПакет(Команда)
	
	ОбработчикЗавершения = Новый ОписаниеОповещения(
		"ПодключитьСтартовыйПакетЗавершение",
		ЭтотОбъект);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОбработчикЗавершения", ОбработчикЗавершения);
	
	РаботаСНоменклатуройКлиент.ПодключитьТестовыйПериод(ЭтотОбъект, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодключитьСтартовыйПакетЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УдалитьВывестиВажноеСообщениеСтартовыйПакет(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыФормы()
	
	Если Параметры.Ошибка = Неопределено Тогда 
		Возврат; // Открытие вне контекста ошибки
	КонецЕсли;
	
	ОписаниеОшибки = РаботаСНоменклатуройСлужебныйКлиентСервер.ОписаниеОшибкиПокупкиНоменклатуры();
	
	Если Не ТипЗнч(Параметры.Ошибка) = ТипЗнч(ОписаниеОшибки) Тогда 
		Возврат;
	КонецЕсли;
	
	Ошибка = Параметры.Ошибка;
	ДоступноКарточек  = Ошибка.ДоступныйОстаток;
	
	Если Ошибка.Свойство("ЗагружаемоеКоличество") Тогда
		КлючСКоличествомКарточек = "ЗагружаемоеКоличество";
	ИначеЕсли Ошибка.Свойство("ПокупаемоеКоличество") Тогда	
		КлючСКоличествомКарточек = "ПокупаемоеКоличество";
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗапрошеноКарточек = Ошибка[КлючСКоличествомКарточек];
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВажныеСообщения()
	
	ПараметрыСообщения = Неопределено;
	
	Если ДоступноКарточек = 0 Тогда
		ПараметрыСообщения = РаботаСНоменклатуройСлужебный.ПараметрыСообщенияПодключитьПлатныйПакет();
	ИначеЕсли ЗапрошеноКарточек > ДоступноКарточек Тогда
		ПараметрыСообщения = ПараметрыСообщенияЛимитКарточекПревышен();
	Иначе
		// Важных сообщений не требуется
	КонецЕсли;
	
	Если ПараметрыСообщения <> Неопределено Тогда
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
	КонецЕсли;
	
	Если РаботаСНоменклатурой.ДоступноПодключениеТестовогоПериода() Тогда
		ПараметрыСообщения = РаботаСНоменклатуройСлужебный.ПараметрыСообщенияПодключитьСтартовыйПакет();
		ИдентификаторВажногоСообщения = ПараметрыСообщения.Идентификатор;
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
	КонецЕсли;
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыСообщенияЛимитКарточекПревышен()
	
	Шаблон = 
		НСтр("ru = 'Выполнена попытка получить %1 карточек, но доступно %2.
		|Выберите меньшее количество карточек и повторите попытку.
		|
		|Так же можно приобрести дополнительный платный пакет карточек у обслуживающего партнера фирмы ""1С""
		|
		|Выбрать обслуживающего партнера можно из <a href=""%3"">списка партнеров</a>.'");
	
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.ТипСообщения = "Предупреждение";
	ПараметрыСообщения.Идентификатор = "ЛимитКарточекПревышен";
	ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Лимит карточек превышен'");
	ПараметрыСообщения.Заголовок = НСтр("ru = 'Превышен лимит доступных карточек'");
	ПараметрыСообщения.Сообщение = СтроковыеФункции.ФорматированнаяСтрока(Шаблон,
		Формат(ЗапрошеноКарточек, "ЧН=0; ЧГ="),
		Формат(ДоступноКарточек, "ЧН=0; ЧГ="),
		РаботаСНоменклатуройСлужебныйКлиентСервер.АдресРесурсаСписокПартнеров());
	ПараметрыСообщения.Скрываемый = Ложь;
	
	Возврат ПараметрыСообщения;
	
КонецФункции

&НаСервере
Процедура УдалитьВывестиВажноеСообщениеСтартовыйПакет(Знач РезультатПодключения)
	
	Если РезультатПодключения = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИдентификаторВажногоСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(ЭтотОбъект, ИдентификаторВажногоСообщения);
		ИдентификаторВажногоСообщения = "";
	КонецЕсли;
	
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.ТипСообщения = "Успех";
	ПараметрыСообщения.Идентификатор = "СтартовыйПакетПодключен";
	ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Стартовый пакет подключен'");
	ПараметрыСообщения.Сообщение = ПараметрыСообщения.КраткоеПредставление;
	ПараметрыСообщения.Скрываемый = Ложь;
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
