#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьХарактеристики = ?(Параметры.ХарактеристикиВидны = Истина, 1, 0);
	Если Параметры.Свойство("ПоказыватьНедействительныеХарактеристики") Тогда
		ПоказыватьНедействительныеХарактеристики = Параметры.ПоказыватьНедействительныеХарактеристики;
	КонецЕсли;
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("МассивВидовЦен", Параметры.МассивВидовЦен);
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		// Обход ошибки платформы 30163126
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияКартинка", "Ширина", 2);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияКартинка", "Высота", 0);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ТаблицаНакладных.Количество() > 0 Тогда
		
		АдресВременногоХранилища = "";
		ЗаписатьВХранилищеДанныеТабличнойЧасти(АдресВременногоХранилища);
		
		Закрыть(Новый Структура("ВыборПроизведен, АдресВременногоХранилища, ЗаполнятьНаОснованиеПрихода", 
			Истина, АдресВременногоХранилища, Истина));
		
	Иначе
		
		ВывестиСообщениеОНеправильномВыборе();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	
	Если ТаблицаНакладных.Количество() > 0 Тогда
		
		ПоказатьОтчетСПредварительнымРезультатом();
		
	Иначе
		
		ВывестиСообщениеОНеправильномВыборе();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Новый Структура; 
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	
	ОповещениеОЗакрытие = Новый ОписаниеОповещения("ПослеВыбораНакладныхЗакрытие", ЭтотОбъект);
	ОткрытьФорму("Документ.ПриходнаяНакладная.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытие);
		
КонецПроцедуры


#КонецОбласти   


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораНакладныхЗакрытие(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		
		ОбработатьРезультатВыбораНаСервере(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыбораНаСервере(Результат)
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда 
		
		Для Каждого ЭлементМассива Из Результат Цикл 
			
			НоваяСтрокаТЗ = ТаблицаНакладных.Добавить();
			НоваяСтрокаТЗ.Накладная = ЭлементМассива;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 
		
		НоваяСтрокаТЗ = ТаблицаНакладных.Добавить();
		НоваяСтрокаТЗ.Накладная = Результат;  
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуру(АдресВременногоХранилища)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МассивПриходныхНакладных"	, СформироватьМассивНакладныхИзТаблицы());
	СтруктураПараметров.Вставить("ИспользоватьХарактеристики"	, ИспользоватьХарактеристики);
	СтруктураПараметров.Вставить("МассивВидовЦен"			, КэшЗначений.МассивВидовЦен);
	
	Документы.УстановкаЦенНоменклатуры.ПолучитьНоменклатуруПоПриходнымНакладным(СтруктураПараметров, АдресВременногоХранилища)
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчетСПредварительнымРезультатом()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИмяСКД"						, "ПоПриходнымНакладным");
	ПараметрыОткрытия.Вставить("МассивПриходныхНакладных"		, СформироватьМассивНакладныхИзТаблицы());
	ПараметрыОткрытия.Вставить("ИспользоватьХарактеристики"	, ИспользоватьХарактеристики);
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаПредварительногоПросмотра", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция СформироватьМассивНакладныхИзТаблицы()
	
	Возврат ТаблицаНакладных.Выгрузить().ВыгрузитьКолонку("Накладная");
	
КонецФункции

&НаСервере
Процедура ЗаписатьВХранилищеДанныеТабличнойЧасти(АдресВременногоХранилища)
	
	ПолучитьНоменклатуру(АдресВременногоХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСообщениеОНеправильномВыборе()
	
	ТекстСообщения = НСтр("ru ='Необходимо заполнить список приходных накладных'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ПриходныеНакладные");
	
КонецПроцедуры

#КонецОбласти

