
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПродукцииИзДокумента = Неопределено;
	
	Параметры.Свойство("СписокПродукции", СписокПродукцииИзДокумента);
	
	Если СписокПродукцииИзДокумента <> Неопределено Тогда
		Для каждого КлючИЗначение Из СписокПродукцииИзДокумента Цикл
			НоваяСтрока = СписокПродукции.Добавить();
			НоваяСтрока.ПродукцияПредставление        = КлючИЗначение.Ключ;
			НоваяСтрока.ПродукцияИдентификаторТоваров = КлючИЗначение.Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущаяСтрока = Элементы.СписокПродукции.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ТекущаяСтрока.ПродукцияИдентификаторТоваров);
	
КонецПроцедуры


#КонецОбласти