#Область СлужебныйПрограммныйИнтерфейс

// Получает сформированный ранее Акт о расхождениях для переданного документа.
// 
// Параметры:
//  Документ         - ДокументСсылка - ссылка на документ, для которого необходимо получить Акт о расхождениях:
//  АктОРасхождениях - ДокументСсылка - ссылка на Акт о расхождениях:
Процедура ПолучитьСформированныйАктОРасхождениях(Документ, АктОРасхождениях) Экспорт
	
	АктОРасхождениях = ИнтеграцияИСМПУНФ.СформированныйАктОРасхождениях(Документ);
	
КонецПроцедуры

// Заполняет через третий параметр таблицу товаров документа (для определенного сценария),
//   либо дополняет ее значениями GTIN.
//
// Параметры:
//  Контекст  - ФормаКлиентскогоПриложения, ДокументСсылка - документ, маркируемую продукцию которого необходимо получить.
//  Сценарий  - Число - номер сценария заполнения.
//  ТаблицаПродукции - См. ПроверкаИПодборПродукцииИС.ТаблицаПродукцииДокумента
Процедура ПриОпределенииПродукцииДокумента(Контекст, Сценарий, ТаблицаПродукции) Экспорт
	
	ИнтеграцияИСУНФ.ПриОпределенииПродукцииДокумента(Контекст, Сценарий, ТаблицаПродукции);
	
КонецПроцедуры

// Обработать изменения в табличной части Подобранная продукция формы проверки.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма проверки и подбора
//  СтрокиПодобраннойПродукции - Соответствие из ДанныеФормыЭлементКоллекции - Строки подобранной продукции
//  Действия - Соответствие из Строка - Требуемые действия (для обработки прикладным решением,
// может содержать элементы ОбработатьИзменениеНоменклатуры, ОбработатьИзменениеКоличества)
//  КэшированныеЗначения - Произвольный - Кэшированные значения
//  ПараметрыУказанияСерий - Произвольный - Параметры указания серий
Процедура ОбработатьПодобраннуюПродукцию(
	Форма, СтрокиПодобраннойПродукции, Действия, КэшированныеЗначения, ПараметрыУказанияСерий) Экспорт
	
	ПараметрыСканирования = Форма.ПараметрыСканирования;
	Для Каждого КлючИЗначение Из СтрокиПодобраннойПродукции Цикл
		Если КлючИЗначение.Ключ <> Неопределено Тогда
			Если Действия["ОбработатьИзменениеНоменклатуры"] = Истина Тогда
				СобытияФормИСПереопределяемый.ПриИзмененииНоменклатуры(
					Форма, КлючИЗначение.Ключ, КэшированныеЗначения, ПараметрыУказанияСерий, ПараметрыСканирования);
			ИначеЕсли Действия["ОбработатьИзменениеКоличества"] = Истина Тогда
				СобытияФормИСПереопределяемый.ПриИзмененииКоличества(
					Форма, КлючИЗначение.Ключ, КэшированныеЗначения, ПараметрыУказанияСерий);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ЗавершениеПроверкиИПодбора

// Вызывается при заверешении проверки и подбора для отражения данных в документе.
// Предназначена для сохранения связей номенклатуры с GTIN, с учетом коээффициентов групповых упаковок. 
// 
// Параметры:
//  ТаблицаОписанияGTIN - см. ПроверкаИПодборПродукцииИС.ПустаяТаблицаОписанияGTIN.
Процедура СохранитьШтрихкодыНоменклатуры(ТаблицаОписанияGTIN) Экспорт
	
	ИнтеграцияИСМПУНФ.ЗафиксироватьОписаниеGTIN(ТаблицаОписанияGTIN);
	
КонецПроцедуры

// Отражает результаты проверки и подбора в документе, из которого была вызвана соответствующая форма.
// 
// Параметры:
// 	ПараметрыОкончанияПроверки - Структура
Процедура ЗафиксироватьРезультатПроверкиИПодбора(ПараметрыОкончанияПроверки) Экспорт
	
	ИнтеграцияМОТПУНФ.ОтразитьРезультатыСканированияВДокументе(ПараметрыОкончанияПроверки);
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыИнтеграцииФормыПроверкиИПодбора

// Заполняет специфику интеграции формы проверки и подбора в конкретную форму.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для которой настраиваются параметры интеграции:
//  *Объект - ДокументОбъект
//  ПараметрыИнтеграции - (См. ПроверкаИПодборПродукцииИС.ПараметрыИнтеграцииФормПроверкиИПодбора).
//
Процедура ПриОпределенииПараметровИнтеграцииФормыПроверкиИПодбора(Форма, ПараметрыИнтеграции) Экспорт
	
	ЭлементНастроек = ПроверкаИПодборПродукцииИС.ПараметрыИнтеграцииФормПроверкиИПодбора();
	ИнтеграцияИСМПУНФ.ПриОпределенииПараметровИнтеграцииФормыПроверкиИПодбора(Форма, ЭлементНастроек, Неопределено);
	ПараметрыИнтеграции.Добавить(ЭлементНастроек);
	
КонецПроцедуры

// Переопределение параметров интеграции ЕГАИС (расположения команды проверки и подбора)
//
// Параметры:
//   Форма                - ФормаКлиентскогоПриложения - прикладная форма для встраивания форматированной строки
//   СтандартнаяОбработка - Булево - стандартная работа с элементами проверки подбора
//   ПараметрыИнтеграции  - Соответствие - автоматически заданные параметры интеграции
//
Процедура ПриОпределенииПараметровИнтеграции(Форма, СтандартнаяОбработка, ПараметрыИнтеграции) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет специфику применения интеграции формы проверки и подбора в конкретную форму.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для которой применяются параметры интеграции.
//
Процедура ПриПримененииПараметровИнтеграцииФормыПроверкиИПодбора(Форма) Экспорт
	
	
КонецПроцедуры

// Получение организации для складских документов "через точку". 
// Параметры:
// ПроверяемыйДокумент - ДокументСсылка
// Организация - ОпределяемыйТип.Организация - возвращаемое значение.
Процедура ПриОпределенииОрганизации(ПроверяемыйДокумент, Организация) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Возвращает через третий параметр признак наличия маркируемой продукции.
//
// Параметры:
//  Объект                   - ДанныеФормыСтруктура - объект в котором проходит проверка
//  Коллекция                - Строка - ТЧ с товарами.
//  ЕстьМаркируемаяПродукция - Булево - Исходящий, признак наличия маркируемой продукции.
//
Процедура ЕстьМаркируемаяПродукция(Объект, Коллекция, ЕстьМаркируемаяПродукция) Экспорт
	
	ИнтеграцияИСУНФ.ЕстьМаркируемаяПродукция(Объект, Коллекция, ЕстьМаркируемаяПродукция);
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыФормыПроверкиИПодбора

// Вызывается при открытии формы проверки и подбора для явного задания ее параметров, которые не были переданы заранее.
// 
// Параметры:
//  Форма - См. Обработка.ПроверкаИПодборПродукцииИС.Форма.ПроверкаИПодбор
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
Процедура ПриЗаполненииПараметровФормыПроверкиИПодбора(Форма, ПараметрыСканирования) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  ИмяДокумента    - Строка - Контекст для определения типа документа
//  ЭтоПриобретение - Булево - исходящий признак входящего (загруженного) документа.
Процедура ЭтоДокументПриобретения(ИмяДокумента, ЭтоПриобретение) Экспорт
	
	Если ИмяДокумента = "ПриходнаяНакладная" Тогда
		ЭтоПриобретение = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  ИмяДокумента - Строка - Контекст для определения типа документа
//  ЭтоАкт       - Булево - исходящий признак акта о расхождениях.
Процедура ЭтоАктОРасхождениях(ИмяДокумента, ЭтоАкт) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
