#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	Если ЭтоИнтерфейсТакси Тогда
		ПараметрыРазмещения.КоманднаяПанель = КоманднаяПанель;
	КонецЕсли;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);

	УстановитьУсловноеОформление();

	Список.Параметры.УстановитьЗначениеПараметра("ОсновнойОтветственный",
		ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойОтветственный"));

	УстановитьОтборНедействительные(ЭтотОбъект);

	ДоступныКадровыеДанныеСотрудников = ПравоДоступа("Просмотр",
		Метаданные.РегистрыСведений.ТекущиеКадровыеДанныеСотрудниковУНФ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправка2НДФЛДляСотрудников",
		"Видимость", ДоступныКадровыеДанныеСотрудников);
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлятьКомандыПриНаведении = НЕ ЭтоИнтерфейсТакси;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка")
		И Элементы.Список.ТекущиеДанные <> Неопределено Тогда

		Элементы.ФормаИспользоватьКакОсновного.Доступность = Не Элементы.Список.ТекущиеДанные.ЭтоОсновнойОтветственный
			И Не Элементы.Список.ТекущиеДанные.ЭтоГруппа;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормы"
		+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));

КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект, Элемент, Строка);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ОбновлятьКомандыПриНаведении Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка <> Неопределено И ТипЗнч(Строка) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		ДанныеСтроки = Элемент.ДанныеСтроки(Строка);
		Если ДанныеСтроки <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаИспользоватьКакОсновного", "Доступность",
				Не ДанныеСтроки.ЭтоОсновнойОтветственный И Не ДанныеСтроки.ЭтоГруппа);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьНедействительных(Команда)

	Элементы.ПоказыватьНедействительных.Пометка = Не Элементы.ПоказыватьНедействительных.Пометка;

	УстановитьОтборНедействительные(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКакОсновного(Команда)

	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		Или Элементы.Список.ТекущиеДанные = Неопределено Или Элементы.Список.ТекущиеДанные.ЭтоОсновнойОтветственный
		Или Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда

		Возврат;
	КонецЕсли;

	УстановитьОсновногоОтветственного(Элементы.Список.ТекущиеДанные.Ссылка);
	Элементы.ФормаИспользоватьКакОсновного.Доступность = Не Элементы.Список.ТекущиеДанные.ЭтоОсновнойОтветственный;

КонецПроцедуры

&НаКлиенте
Процедура Справка2НДФЛДляСотрудников(Команда)

	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		Или Элементы.Список.ТекущиеДанные = Неопределено Тогда

		Возврат;
	КонецЕсли;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	ТекущаяОрганизация = ТекущиеДанные.Организация;
	Если НЕ ЗначениеЗаполнено(ТекущаяОрганизация) Тогда
		ТекущаяОрганизация = ТекущиеДанные.ГоловнаяОрганизация;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущаяОрганизация) Тогда
		ТекущаяОрганизация = РегламентированнаяОтчетностьУСН.ПолучитьТекущуюОрганизациюДляЦелейЗадачОтчетности();
	КонецЕсли;

	ДатаПроверки = ОбщегоНазначенияКлиент.ДатаСеанса();
	Если ПроверкаДанныхКлиент.ВыполнитьПроверкуДанныхДляСправки2НФДЛ(ДатаПроверки, ТекущаяОрганизация,
		ТекущиеДанные.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("Сотрудник, Организация", ТекущиеДанные.Ссылка, ТекущаяОрганизация);
		ОткрытьФорму("Документ.СправкаНДФЛУНФ.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	Если НЕ ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.КоманднаяПанель, КоманднаяПанель);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОсновногоОтветственного(Знач НовыйОсновнойОтветственный)

	ПерсональныеНастройкиРУНФ.Установить(НовыйОсновнойОтветственный, "ОсновнойОтветственный");
	Список.Параметры.УстановитьЗначениеПараметра("ОсновнойОтветственный", НовыйОсновнойОтветственный);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// 1. Недействительный сотрудник отображается серым
	РаботаСФормой.УстановитьУсловноеОформлениеНедействительных(Список, "Недействителен");
	
	// 2. Непринятые сотрудники выделяются красным (колонка Должность)
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();

	ОтборНепринятые = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(НовоеУсловноеОформление.Отбор, "",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ОтборНепринятые,
		"ЭтоГруппа", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ОтборНепринятые,
		"ДатаПриема", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	НовоеУсловноеОформление.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.Красный);
	НовоеУсловноеОформление.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не трудоустроен'"));
	
	Поле = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("ТекущаяДолжность");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборНедействительные(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список, "Недействителен", Ложь, , , Не Форма.Элементы.ПоказыватьНедействительных.Пометка);

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти