
#Область СлужебныеОбработчики

&НаКлиенте
Процедура УправлениеДоступностьИВидимостью()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаМинимальноеКоличество", "Доступность", СпособОчисткиЦен = 1);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДействующиеЦены", "Доступность", СпособОчисткиЦен = 2);
	
КонецПроцедуры

#Область ДлительныеОперации

&НаКлиенте
Процедура УдалитьЦеныВДлительнойОперации()
	
	ДлительнаяОперация = НачатьУдалениеЦен();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ТекстСообщения = НСтр("ru ='Удаляются устаревшие записи о ценах номенклатуры.'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеУдаленияЦенВДлительнойОперации", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияЦенВДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт
	
	ПоказатьПредупреждение(, НСтр("ru ='Удаление завершено'"));
	
КонецПроцедуры

&НаСервере
Функция НачатьУдалениеЦен()
	
	Если ДлительнаяОперация <> Неопределено Тогда
		
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ДлительнаяОперация.ИдентификаторЗадания);
		
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Удаление устаревших цен номенклатуры'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ПараметрыУдаления = Новый Структура;
	ПараметрыУдаления.Вставить("СпособОчисткиЦен", СпособОчисткиЦен);
	ПараметрыУдаления.Вставить("МинимальноеКоличествоЦенНоменклатуры", МинимальноеКоличествоЦенНоменклатуры);
	ПараметрыУдаления.Вставить("ПериодДействующихЦен", ПериодДействующихЦен);
	
	Если ВидыЦен.Количество() > 0 Тогда
		
		ПараметрыУдаления.Вставить("ВидыЦен", ВидыЦен);
		
	КонецЕсли;
	
	ПараметрыОтложенногоОбработчика = Новый Структура("ПараметрыУдаления", ПараметрыУдаления);
	
	ИмяМетода = "Обработки.УдалениеУстаревшихЦен.УдалитьНеактуальныеЦены";
	Результат = ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыУдаления, ПараметрыВыполнения);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МинимальноеКоличествоЦенНоменклатуры = 3;
	ПериодДействующихЦен = ДобавитьМесяц(НачалоКвартала(ТекущаяДатаСеанса()), -3);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура СпособОчисткиЦенПриИзменении(Элемент)
	
	УправлениеДоступностьИВидимостью();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура УдалитьЦены(Команда)
	
	УдалитьЦеныВДлительнойОперации();
	
КонецПроцедуры

#КонецОбласти

