

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьНастройкиИзПараметров(Параметры);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ШаблонПромокода) Тогда
		ОбновитьНастройкиПоШаблону();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура МаскаПромокодаПриИзменении(Элемент)
	Если стрНайти(МаскаПромокода, "[Промокод]") = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "МаскаПромокода";
		Сообщение.Текст = Нстр("ru = 'Шаблон промокода должен содержать секцию [Промокод], куда будет подставляться сгенерированное значение.'");
		Сообщение.Сообщить();
		МаскаПромокода = "[Промокод]";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПромокодаПриИзменении(Элемент)
	ОбновитьНастройкиПоШаблону();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Результат = ОписаниеНастроек();
	Закрыть(Результат);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗагрузитьНастройкиИзПараметров(ПараметрыОбработки)
	ШаблонПромокода = ПараметрыОбработки.ШаблонПромокода;
	Если НЕ ЗначениеЗаполнено(ШаблонПромокода) Тогда
		СловарьСимволов.Очистить();
		Для Каждого Символ Из ПараметрыОбработки.СловарьСимволов Цикл
			ОписаниеСимвола = СловарьСимволов.Добавить();
			ЗаполнитьЗначенияСвойств(ОписаниеСимвола, Символ);
		КонецЦикла;
		КоличествоПромокодов = ПараметрыОбработки.КоличествоПромокодов;
		МаскаПромокода = ПараметрыОбработки.МаскаПромокода;
		АктивироватьЧерезДней = ПараметрыОбработки.АктивироватьЧерезДней;
		КоличествоДнейДействия = ПараметрыОбработки.КоличествоДнейДействия;
		КоличествоРазПрименения = ПараметрыОбработки.КоличествоРазПрименения;
		КоличествоСимволов = ПараметрыОбработки.КоличествоСимволов;
		
		Если СтрНайти(МаскаПромокода, "[Промокод]") = 0 Тогда
			МаскаПромокода = "[Промокод]";
		КонецЕсли;
		Если КоличествоСимволов = 0 Тогда
			КоличествоСимволов = 6;
		КонецЕсли;
		Если КоличествоПромокодов = 0 Тогда
			КоличествоПромокодов = 10;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиПоШаблону()
	
	Если ЗначениеЗаполнено(ШаблонПромокода) Тогда
		УстановитьПараметрыИзШаблонаНаСервере();
	Иначе
		ЗагрузитьСписокСимволов();
	КонецЕсли;
	ДоступностьПараметров = Не ЗначениеЗаполнено(ШаблонПромокода);
	Для Каждого ЭлементНастройки Из Элементы.ГруппаНастройкаГенерации.ПодчиненныеЭлементы Цикл
		Если Не ЭлементНастройки = Элементы.КоличествоПромокодов Тогда
			ЭлементНастройки.Доступность = ДоступностьПараметров;
		КонецЕсли;
	КонецЦикла;
	Элементы.ГруппаСловарьСимволов.ТолькоПросмотр = НЕ ДоступностьПараметров;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьПараметрыИзШаблонаНаСервере()
	Если Не ЗначениеЗаполнено(ШаблонПромокода) Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ШаблонПромокода, "МаскаПромокода, АктивироватьЧерезДней, КоличествоДнейДействия, КоличествоРазПрименения, КоличествоСимволов");
	СловарьСимволовИзШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонПромокода,"СловарьСимволов");
	СловарьСимволов.Загрузить(СловарьСимволовИзШаблона.Выгрузить());
КонецПроцедуры

&НаКлиенте
Функция ОписаниеНастроек()
	ОписаниеНастроек = Новый Структура;
	ОписаниеНастроек.Вставить("КоличествоПромокодов", КоличествоПромокодов);
	ОписаниеНастроек.Вставить("МаскаПромокода", МаскаПромокода);
	ОписаниеНастроек.Вставить("АктивироватьЧерезДней", АктивироватьЧерезДней);
	ОписаниеНастроек.Вставить("КоличествоДнейДействия", КоличествоДнейДействия);
	ОписаниеНастроек.Вставить("КоличествоРазПрименения", КоличествоРазПрименения);
	ОписаниеНастроек.Вставить("КоличествоСимволов", КоличествоСимволов);
	ОписаниеНастроек.Вставить("ШаблонПромокода", ШаблонПромокода);
	ОписаниеНастроек.Вставить("СловарьСимволов", СловарьСимволов);
	Возврат ОписаниеНастроек;
КонецФункции

&НаСервере
Процедура ЗагрузитьСписокСимволов()
	СловарьСимволов.Очистить();
	МассивСимволов = ПромокодыУНФ.БазовыйСловарьСимволов();
	Для Каждого Символ Из МассивСимволов Цикл
		СтрокаСловаря = СловарьСимволов.Добавить();
		СтрокаСловаря.Символ = Символ;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

