
#Область ПрограммныйИнтерфейс

// См. ИнтеграцияShareПереопределяемый.КонтактныеЛицаСНомеромТелефона
Процедура КонтактныеЛицаСНомеромТелефона(Знач Контрагент, КонтактнаяИнформация) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СвязиКонтрагентКонтактСрезПоследних.Контакт КАК Контакт
	|ПОМЕСТИТЬ ВТКонтакты
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(
	|			,
	|			Контрагент = &Контрагент
	|				И СвязьНедействительна = ЛОЖЬ) КАК СвязиКонтрагентКонтактСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтактныеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	ВТКонтакты КАК ВТКонтакты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	|		ПО ВТКонтакты.Контакт = КонтактныеЛицаКонтактнаяИнформация.Ссылка
	|			И (НЕ КонтактныеЛицаКонтактнаяИнформация.Ссылка.ПометкаУдаления)
	|			И (КонтактныеЛицаКонтактнаяИнформация.Тип = &Тип)
	|			И (КонтактныеЛицаКонтактнаяИнформация.Вид = &ВидКонтактаКонтактногоЛица)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка,
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.Тип = &Тип
	|	И КонтрагентыКонтактнаяИнформация.Вид = &ВидКонтактаКонтрагента
	|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления"; 	
	
	ТипКонтакта					= Перечисления.ТипыКонтактнойИнформации.Телефон;
	ВидКонтактаКонтактногоЛица	= Справочники.ВидыКонтактнойИнформации["ТелефонКонтактногоЛица"];
    ВидКонтактаКонтрагента 		= Справочники.ВидыКонтактнойИнформации["ТелефонКонтрагента"];
	
	Запрос.УстановитьПараметр("Контрагент"					, Контрагент);
	Запрос.УстановитьПараметр("Тип"							, ТипКонтакта);
	Запрос.УстановитьПараметр("ВидКонтактаКонтактногоЛица"	, ВидКонтактаКонтактногоЛица);
	Запрос.УстановитьПараметр("ВидКонтактаКонтрагента"		, ВидКонтактаКонтрагента);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Контакт = ИнтеграцияShareКлиентСервер.НовыйКонтактнаяИнформация();
		Контакт.ВладелецКонтакта      = Выборка.Ссылка;
		Контакт.НомерТелефонаБезКодов = БезКодаСтраныРФ(Выборка.НомерТелефона);;
		КонтактнаяИнформация.Добавить(Контакт);
	КонецЦикла;
	
КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииСоставаКомандShare
Процедура ПриОпределенииСоставаКомандShare(СоставКоманд) Экспорт
	
	СоставКоманд.Входящие.Добавить(Метаданные.Документы.ЗаказПокупателя.ПолноеИмя()); 
	СоставКоманд.Входящие.Добавить(Метаданные.Документы.ЗаказПоставщику.ПолноеИмя());
	СоставКоманд.Входящие.Добавить(Метаданные.Документы.СчетНаОплатуПоставщика.ПолноеИмя());

	СоставКоманд.Исходящие.Добавить(Метаданные.Документы.ЗаказПоставщику.ПолноеИмя());
	
КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ЗаполнитьНастройкиФормированияДокумента
Процедура ЗаполнитьНастройкиФормированияДокумента(СсылкаНаДокумент, НастройкиФормирования) Экспорт
			
	РазрешенныеТипыДокументов = Новый Массив;
	РазрешенныеТипыДокументов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	РазрешенныеТипыДокументов.Добавить(Тип("ДокументСсылка.СчетНаОплату"));
	РазрешенныеТипыДокументов.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	
	ТипИсточника = ТипЗнч(СсылкаНаДокумент);
	Если РазрешенныеТипыДокументов.Найти(ТипИсточника) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоддерживаемыеФорматыЭДО = ФорматыЭДО.ПоддерживаемыеФорматы();
	ТипыДокументов           = ОбменСКонтрагентами.ТипыДокументов();
	НаправленияДокументов    = ОбменСКонтрагентами.НаправленияДокументов();
	
	Реквизиты = "Организация, Контрагент, Договор";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, Реквизиты);
	
	НастройкиФормирования.Формат             = ПоддерживаемыеФорматыЭДО.CML208;
	НастройкиФормирования.Направление        = НаправленияДокументов.Исходящий;
	НастройкиФормирования.Организация        = ЗначенияРеквизитов.Организация;
	НастройкиФормирования.Контрагент         = ЗначенияРеквизитов.Контрагент;
	НастройкиФормирования.ДоговорКонтрагента = ЗначенияРеквизитов.Договор;		
		
	ТипИсточника = ТипЗнч(СсылкаНаДокумент);

	Если ТипИсточника = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		НастройкиФормирования.ТипДокумента = ТипыДокументов.ОтветНаЗаказ;
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетНаОплату") Тогда
		НастройкиФормирования.ТипДокумента = ТипыДокументов.СчетНаОплату;
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		НастройкиФормирования.ТипДокумента = ТипыДокументов.ЗаказТовара;
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииВизуализацииПубликуемогоДокумента
Процедура ПриОпределенииВизуализацииПубликуемогоДокумента(ОписаниеПредставленияДокумента,
	Знач ПараметрыПубликуемогоДокументаДляВизуализации, СтандартнаяОбработка) Экспорт 
	
	СтандартнаяОбработка = Ложь; 
	ОписаниеПредставленияДокумента = Новый Структура;
	ОписаниеПредставленияДокумента.Вставить("ИмяФайла", "");
	ОписаниеПредставленияДокумента.Вставить("ДвоичныеДанные", Неопределено);
		
	ОбъектУчета = ПараметрыПубликуемогоДокументаДляВизуализации.ОбъектУчета;
	ИмяМакета = "";
	
	Если ТипЗнч(ОбъектУчета) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		КомандыПечати = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.ЗаказПокупателя);
		КомандаПечати = КомандыПечати.Найти("СчетНаОплату");
		ИмяМакета     = "СчетНаОплату";
	ИначеЕсли ТипЗнч(ОбъектУчета) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		КомандыПечати = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.СчетНаОплату);
		КомандаПечати = КомандыПечати.Найти("СчетНаОплату");
		ИмяМакета     = "СчетНаОплату";
	ИначеЕсли ТипЗнч(ОбъектУчета) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		КомандыПечати = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.ЗаказПоставщику);
		КомандаПечати = КомандыПечати.Найти("ЗаказПоставщику");
	Иначе
		Возврат;
	КонецЕсли;
	
	КомандыПечати    = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КомандаПечати);
	ОбъектыДляПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектУчета); 
	
	НастройкиСохранения = УправлениеПечатью.НастройкиСохранения();
	Если Не ПустаяСтрока(ИмяМакета) Тогда
		НастройкиСохранения.ПодписьИПечать = ПечатьДокументовУНФ.НастройкаПользователяЗаполнятьФаксимиле(ИмяМакета);
	КонецЕсли;
	
	ДанныеПФ = УправлениеПечатью.НапечататьВФайл(КомандыПечати, ОбъектыДляПечати, НастройкиСохранения);
	Если ДанныеПФ.Количество() Тогда
		ОписаниеПредставленияДокумента.ДвоичныеДанные = ДанныеПФ[0].ДвоичныеДанные; 
		ОписаниеПредставленияДокумента.ИмяФайла = ДанныеПФ[0].ИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииДанныхПубликуемогоДокумента
Процедура ПриОпределенииДанныхПубликуемогоДокумента(ДанныеТранспортногоКонтейнера, Знач СсылкаНаДокумент) Экспорт
	
	//Передача параметра валюты документа в макет
	ИмяРеквизитаВалюты = "ВалютаДокумента";
	ВалютаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, ИмяРеквизитаВалюты);
	ДанныеВалюты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВалютаДокумента, "Код, Наименование");
	
	ПолныйПуть = "КарточкаПередаваемыхДанных.Описание.Валюта.Код";
	Результат = ДанныеТранспортногоКонтейнера.Строки.Найти(ПолныйПуть, "ПолныйПуть", Истина);
	Если Результат <> Неопределено Тогда
		Результат.Значение = ДанныеВалюты.Код;
	КонецЕсли;
	
	ПолныйПуть = "КарточкаПередаваемыхДанных.Описание.Валюта.Наименование";
	Результат = ДанныеТранспортногоКонтейнера.Строки.Найти(ПолныйПуть, "ПолныйПуть", Истина);
	Если Результат <> Неопределено Тогда
		Результат.Значение = ДанныеВалюты.Наименование;
	КонецЕсли;
	
КонецПроцедуры

// Типы исходящих документв Share
// 
// Возвращаемое значение:
//  ОписаниеТипов
Функция ПолучитьТипыОбъектовShare() Экспорт

	ТипыОбъектов = Новый ОписаниеТипов(
		"ДокументСсылка.ЗаказПокупателя, ДокументСсылка.СчетНаОплату, ДокументСсылка.ЗаказПоставщику");

	Возврат ТипыОбъектов

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция БезКодаСтраныРФ(Знач НомерТелефона)
	
	Если СтрДлина(НомерТелефона) > 0 И СтрНачинаетсяС(НомерТелефона, "7") Тогда
		НомерТелефона = Сред(НомерТелефона, 2);
	КонецЕсли;
	
	Возврат НомерТелефона;
	
КонецФункции

#КонецОбласти

