#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Реквизиты, которые разрешается изменять сразу для нескольких объектов
// 
// Возвращаемое значение: 
//  Массив из Строка - имена реквизитов, которые можно изменять сразу для нескольких объектов
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("Описание");
	Результат.Добавить("ТолькоДляАвтора");

	Возврат Результат;

КонецФункции

#КонецОбласти
#КонецЕсли