
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьЭлементыФормы();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Подтвердить(Команда)
	ЗакрытьФормуСПараметрами(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЗакрытьФормуСПараметрами(Ложь);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Если Параметры.Режим = 0 Тогда
		ЭтоВетТребование = Параметры.ЭтоВетТребование;
		ДатаВетРецепта = Параметры.ДатаВетРецепта;
		НомерВетРецепта = Параметры.НомерВетРецепта;
		Заголовок = НСтр("ru = 'Ветеринарный рецепт'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПустаяСтруктураВозврата()
	
	ДанныеРезультата = Новый Структура;
	ДанныеРезультата.Вставить("ОперацияПодтверждена", Ложь);
	ДанныеРезультата.Вставить("ЭтоВетТребование", Ложь);
	ДанныеРезультата.Вставить("ДатаВетРецепта", Дата(1,1,1,0,0,0));
	ДанныеРезультата.Вставить("НомерВетРецепта", НСтр("ru = ''"));
	
	Возврат ДанныеРезультата;
КонецФункции

&НаКлиенте
Процедура ЗакрытьФормуСПараметрами(ОперацияПодтверждена = Ложь)
	
	Результат = ПустаяСтруктураВозврата();
	Результат.ОперацияПодтверждена = ОперацияПодтверждена;
	Результат.ЭтоВетТребование = ЭтоВетТребование;
	Результат.ДатаВетРецепта = ДатаВетРецепта;
	Результат.НомерВетРецепта = НомерВетРецепта;
	
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти