
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьОчередьСканера = Истина;
	
	Если Параметры.ИспользоватьЦифровуюКлавиатуру Тогда
		
		ВидыКлавиатуры = ИнтерфейсРМКСлужебный.ВидыЦифровойКлавиатуры();
		ПараметрыПостроения = Новый Структура();
		ПараметрыПостроения.Вставить("ВидКлавиатуры", ВидыКлавиатуры.Авторизация);
		ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиГоризонтальный", ИнтервалМеждуЭлементамиФормы.Одинарный);
		ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиВертикальный", ИнтервалМеждуЭлементамиФормы.Половинный);
		ПараметрыПостроения.Вставить("РастягиватьПоШирине", Истина);
		ПараметрыПостроения.Вставить("ЦветКнопок", ИнтерфейсРМКСлужебный.ЦветУправляющейКнопки(Истина));
		
		ИнтерфейсРМКСлужебный.ПостроитьПанельЦифровойКлавиатуры(ЭтотОбъект, Элементы.ГруппаЦифроваяПанель,
			ПараметрыПостроения);
			
	КонецЕсли;
	ИнтерфейсРМКСлужебный.ПрименитьНаФормеМасштабИзПараметров(ЭтотОбъект, Параметры);
	
	НастроитьКомандыВРежимеКассыСамообслуживания();
	НастроитьТиповыеГорячиеКлавиши();
	
	РежимИскатьВЧеке = Параметры.НайтиВЧеке;
	Если РежимИскатьВЧеке Или Параметры.СкрытьКомандуНайтиВЧеке Тогда
		Элементы.ГруппаРежим.Видимость = Ложь;
	КонецЕсли;
	
	РежимПоискаСерии = Параметры.ПоискСерии;
	РежимВыбораСерии = Параметры.ВыборСерии;
	РежимВыбораПартии = Параметры.ВыборПартии;
	МожноВводитьПустоеЗначение = Параметры.МожноВводитьПустоеЗначение;
	СерииНеВыгружаются = Параметры.СерииНеВыгружаются;
	Номенклатура = Параметры.Номенклатура;
	СкрытьКомандуСоздатьСерии = Параметры.СкрытьКомандуСоздатьСерии;
	
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если РежимВыбораСерии Тогда
		Если Параметры.МассивЗначений.Количество() = 0 Тогда
			Элементы.СтраницаСозданияСерий.Видимость = Истина;
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаСозданияСерий;
			Элементы.ЗаписатьСерию.Важность = ВажностьКнопки.Главная;
		Иначе
			ЗаполнитьРежимВыбораСерий();
		КонецЕсли;
	КонецЕсли;
	
	Если РежимВыбораПартии Тогда
		ЗаполнитьРежимВыбораПартий();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ИспользоватьДекодирование.Пометка = ДекодироватьBase64;
	НастроитьЭлементыПоРежиму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И (АктивноеОкно() = Окно Или ВводДоступен()) Тогда
		
		Штрихкод = "";
		Если ИмяСобытия = "ScanData" Тогда
			
			Штрихкод = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			
		ИначеЕсли ИмяСобытия = "ScanDataBase64" Тогда
			
			Штрихкод = "";
			ШтрихкодBase64 = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			МенеджерОборудованияРМККлиентСервер.Base64ВШтрихкод(ШтрихкодBase64, Штрихкод);
			ВернутьРезультатНаФормуРМК(Штрихкод);
			
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			
			Штрихкод = Параметр[0];
			
		КонецЕсли;
		
		Если РежимВыбораСерии Тогда
			ОбработатьПоискСерииПоШтрихкоду(Штрихкод);
		Иначе
			ВернутьРезультатНаФормуРМК(Штрихкод);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ОбщегоНазначенияРМККлиент.ИспользоватьВнешнееСобытие() И ВводДоступен() Тогда
		
		ОбрабатываемыеСобытия = Новый Массив;
		ОбрабатываемыеСобытия.Добавить("Штрихкод");
		ОбрабатываемыеСобытия.Добавить("ПолученШтрихкод");
		ОбрабатываемыеСобытия.Добавить("ScanData");
		ОбрабатываемыеСобытия.Добавить("TracksData");
		ОбрабатываемыеСобытия.Добавить("ДанныеКарты");
		
		Если Не ОбрабатываемыеСобытия.Найти(Событие) = Неопределено Тогда
			ВернутьРезультатНаФормуРМК(Данные);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ЦифраУниверсальнаяКлавиатура(Команда)
	ОбработатьЦифруЦифровойКлавиатуры(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыОчистить();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьПоследнееУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее();
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если РежимВыбораСерии Тогда
		ОбработатьВыборСерии();
	ИначеЕсли РежимВыбораПартии Тогда
		ОбработатьВыборПартии();
	Иначе
		ОбработатьНайти();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДекодирование(Команда)
	ДекодироватьBase64 = Не ДекодироватьBase64;
	Элементы.ИспользоватьДекодирование.Пометка = ДекодироватьBase64;
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзБуфераОбмена(Команда)
	СодержимоеБуфераОбменаАсинх();
КонецПроцедуры

&НаКлиенте
Процедура ИскатьВЧеке(Команда)
	РежимИскатьВЧеке = Истина;
	НастроитьЭлементыПоРежиму();
КонецПроцедуры

&НаКлиенте
Процедура ДобавлятьПоШтрихкоду(Команда)
	РежимИскатьВЧеке = Ложь;
	НастроитьЭлементыПоРежиму();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСерию(Команда)
	Элементы.СтраницаСозданияСерий.Видимость = Истина;
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаСозданияСерий;
	Элементы.СтраницыКоманд.ТекущаяСтраница = Элементы.СтраницаКомандыЗаписатьСерию;
	Элементы.ЗаписатьСерию.Важность = ВажностьКнопки.Главная;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСерию(Команда)
	СоздатьСериюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтменаЗаписи(Команда)
	ОтменитьСозданиеСерии();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьСобытиеСканера(Результат, ДополнительныеПараметры) Экспорт
	
	ОбработкаОповещения(Результат.Событие, Результат.Данные, "ПодключаемоеОборудование");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКомандыВРежимеКассыСамообслуживания()
	
	Если Параметры.Свойство("РежимКассыСамообслуживания") И Параметры.РежимКассыСамообслуживания = Истина Тогда
		ЭтотОбъект.ОтображатьКоманднуюПанель = Ложь;
		ЭтотОбъект.ОтображатьКнопкуЗакрытия = Ложь;
		Если ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
			ЭтотОбъект.ОтображатьЗаголовок = Ложь;
			Элементы.ЗаголовокФормы.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЦифруЦифровойКлавиатуры(ИмяКомандыКлавиатуры)
	
	СимволКлавиатуры = ИнтерфейсРМКСлужебныйКлиент.ПолучитьСимволКоманды(ИмяКомандыКлавиатуры);
	ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, Элементы[ИмяПоляВвода],
		СимволКлавиатуры);

КонецПроцедуры

&НаСервере
Процедура НастроитьТиповыеГорячиеКлавиши()
	
	СочетаниеКлавишESC = ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,{0,27,0}}");
	Если НЕ СочетаниеКлавишESC = Неопределено Тогда
		Команды.Отмена.СочетаниеКлавиш = СочетаниеКлавишESC;
	КонецЕсли;
	
	СочетаниеКлавишиEnter = ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,{0,13,0}}");
	Если Не СочетаниеКлавишиEnter = Неопределено Тогда
		Элементы.Подтвердить.СочетаниеКлавиш = СочетаниеКлавишиEnter;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНайти()
	
	Если Не ЗначениеЗаполнено(ПолеВводаШтрихкода) Тогда
		Возврат;
	КонецЕсли;
	
	Штрихкод = СокрЛП(ПолеВводаШтрихкода);
	
	Если ДекодироватьBase64 Тогда
		Значение = МенеджерОборудованияКлиентСервер.Base64ВШтрихкод(ПолеВводаШтрихкода);
		Если ЗначениеЗаполнено(Значение) И Не Значение = Штрихкод Тогда
			РазмерТекста = СтрДлина(Значение);
			НачалоСлова = 1;
			ДопустимыеСимволыВШтрихкоде = Истина;
			Для Позиция = 1 По РазмерТекста Цикл
				КодСимвола = КодСимвола(Значение, Позиция);
				Если КодСимвола > 255 Тогда
					ДопустимыеСимволыВШтрихкоде = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ДопустимыеСимволыВШтрихкоде Тогда
				Штрихкод = Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ВернутьРезультатНаФормуРМК(Штрихкод);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСерии()
	
	Если СерииНеВыгружаются Тогда
		ВыбраннаяСерия = ВыборСерииИдентификатор;
	Иначе
		ВыбраннаяСерия = ВыборСерии;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыбраннаяСерия) 
		И НЕ МожноВводитьПустоеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	ВернутьРезультатНаФормуРМК(ВыбраннаяСерия);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПартии()
	
	Если Не ЗначениеЗаполнено(ВыборПартии) 
		И НЕ МожноВводитьПустоеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	ВернутьРезультатНаФормуРМК(ВыборПартии);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыОчистить()
	ИнтерфейсРМКСлужебныйКлиент.ОчиститьТекстРедактированияВПолеФормы(ЭтотОбъект, Элементы[ИмяПоляВвода]);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее()
	ИнтерфейсРМКСлужебныйКлиент.УдалитьСимволыВРедактируемомПоле(ЭтотОбъект, Элементы[ИмяПоляВвода], Символы.НПП);
КонецПроцедуры

&НаКлиенте
Асинх Процедура СодержимоеБуфераОбменаАсинх()
	
	ТекстИзБуфераОбмена = Ждать СодержимоеБуфераОбмена();
	
	Если ЗначениеЗаполнено(ТекстИзБуфераОбмена) Тогда
		
		ОптимизироватьТекстБуфераОбмена(ТекстИзБуфераОбмена);
		
		СимволКлавиатуры = ТекстИзБуфераОбмена;
		ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, Элементы[ИмяПоляВвода],
			СимволКлавиатуры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОптимизироватьТекстБуфераОбмена(ТекстБуфера)
	
	ТекстБуфера = СокрЛП(ТекстБуфера);
	
	РазделителиСлов = "" + Символы.ВК + Символы.ВТаб + Символы.ПС + Символы.Таб;
	Слова = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ТекстБуфера, РазделителиСлов);
	
	Для Каждого Слово Из Слова Цикл
		Если ЗначениеЗаполнено(Слово) Тогда
			ТекстБуфера = Слово;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПоискСерииПоШтрихкоду(Штрихкод)
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОсновная Тогда
		ВыбраннаяСерия = НСтр("ru = ''");
		Если СерииНеВыгружаются Тогда
			Для Каждого СтрокаЗначения Из Элементы.ВыборСерииИдентификатор.СписокВыбора Цикл
				Если СтрокаЗначения.Представление = Штрихкод Тогда
					ВыбраннаяСерия = СтрокаЗначения.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ВыбраннаяСерия = Штрихкод;
		КонецЕсли;
		
		ВернутьРезультатНаФормуРМК(ВыбраннаяСерия);
	Иначе
		НомерСерии = Штрихкод;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Функция СодержимоеБуфераОбмена()
	
	ФорматДанных = СтандартныйФорматДанныхБуфераОбмена.Текст;
	Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		Если Ждать СредстваБуфераОбмена.СодержитДанныеАсинх(ФорматДанных) Тогда
			Возврат Ждать СредстваБуфераОбмена.ПолучитьДанныеАсинх(ФорматДанных);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ВернутьРезультатНаФормуРМК(Штрихкод)
	
	Результат = Новый Структура();
	Результат.Вставить("Штрихкод", Штрихкод);
	Результат.Вставить("ИскатьВЧеке", РежимИскатьВЧеке);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыПоРежиму()
	
	ИмяПоляВвода = Элементы.ПолеВводаШтрихкода.Имя;
	
	Если РежимИскатьВЧеке Тогда
		Заголовок = НСтр("ru = 'Найти в чеке'");
		Элементы.Подтвердить.Заголовок = НСтр("ru = 'Найти в чеке'");
		Элементы.ИскатьВЧеке.Видимость = Ложь;
	КонецЕсли;
	
	Если РежимПоискаСерии Тогда
		Заголовок = НСтр("ru = 'Найти серию'");
		Элементы.Подтвердить.Заголовок = НСтр("ru = 'Найти серию'");
		Элементы.ИскатьВЧеке.Видимость = Ложь;
	КонецЕсли;
	
	Если РежимВыбораСерии Тогда
		Если СерииНеВыгружаются Тогда
			ИмяПоляВвода = Элементы.ВыборСерииИдентификатор.Имя;
			Элементы.СтраницыПолеВвода.ТекущаяСтраница = Элементы.СтраницаИдентификаторСерии;
		Иначе
			ИмяПоляВвода = Элементы.ВыборСерии.Имя;
			Элементы.СтраницыПолеВвода.ТекущаяСтраница = Элементы.СтраницаСерии;
		КонецЕсли;
		Элементы.ИскатьВЧеке.Видимость = Ложь;
		Элементы.Подтвердить.Заголовок = НСтр("ru = 'Подтвердить'");
	КонецЕсли;
	
	Если РежимВыбораПартии Тогда
		ИмяПоляВвода = Элементы.ВыборПартии.Имя;
		Элементы.СтраницыПолеВвода.ТекущаяСтраница = Элементы.СтраницаПартия;
		Элементы.ИскатьВЧеке.Видимость = Ложь;
		Элементы.Подтвердить.Заголовок = НСтр("ru = 'Подтвердить'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРежимВыбораСерий()
	Элементы.СоздатьСерию.Видимость = НЕ СкрытьКомандуСоздатьСерии;
	МассивСерий = Параметры.МассивЗначений;
	Если СерииНеВыгружаются Тогда
		Для Каждого СтрокаМассива Из МассивСерий Цикл
			Элементы.ВыборСерииИдентификатор.СписокВыбора.Добавить(СтрокаМассива.ИдентификаторСерий, СтрокаМассива.СерияПредставление);
		КонецЦикла;
		ИмяЭлементаСерии = Элементы.ВыборСерииИдентификатор.ПутьКДанным;
	Иначе
		Элементы.ВыборСерии.СписокВыбора.ЗагрузитьЗначения(Параметры.МассивЗначений);
		ИмяЭлементаСерии = Элементы.ВыборСерии.ПутьКДанным;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.ВыбранноеЗначение)
		И Элементы[ИмяЭлементаСерии].СписокВыбора.Количество() > 0 Тогда
		ЭтотОбъект[ИмяЭлементаСерии] = Элементы[ИмяЭлементаСерии].СписокВыбора[0].Значение;
	Иначе
		ЭтотОбъект[ИмяЭлементаСерии] = Параметры.ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРежимВыбораПартий()
	МассивПартий = Параметры.МассивЗначений;
	Элементы.ВыборПартии.СписокВыбора.ЗагрузитьЗначения(Параметры.МассивЗначений);
	
	Если Не ЗначениеЗаполнено(Параметры.ВыбранноеЗначение)
		И Элементы.ВыборПартии.СписокВыбора.Количество() > 0 Тогда
		ВыборПартии = Элементы.ВыборПартии.СписокВыбора[0].Значение;
	Иначе
		ВыборПартии = Параметры.ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

#Область СозданиеСерии
&НаСервере
Процедура СоздатьСериюНаСервере()
	МассивНезаполненныхРеквизитов = МассивНезаполненныхРеквизитов();
	КоличествоЭлементов = МассивНезаполненныхРеквизитов.Количество();
	Если КоличествоЭлементов > 0 Тогда
		ТекстОшибки = НСтр("ru = 'Не заполнены значения реквизитов:'");
		Для н = 0 По КоличествоЭлементов - 1 Цикл
			ТекстОшибки = ТекстОшибки + Символы.ПС + МассивНезаполненныхРеквизитов[н];
		КонецЦикла;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Номер", НомерСерии);
	СтруктураРеквизитов.Вставить("ВладелецСерии", Номенклатура);
	СтруктураРеквизитов.Вставить("ГоденДо", ГоденДоСерии);
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Серия", Неопределено);
	СтруктураОтвета.Вставить("ТекстОшибки", НСтр("ru = ''"));
	ОбщегоНазначенияРМКПереопределяемый.СоздатьСериюЛокально(СтруктураРеквизитов, СтруктураОтвета);
	
	Если НЕ ПустаяСтрока(СтруктураОтвета.ТекстОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтруктураОтвета.ТекстОшибки);
	Иначе
		Если Элементы.ВыборСерии.СписокВыбора.НайтиПоЗначению(СтруктураОтвета.Серия) = Неопределено Тогда
			Элементы.ВыборСерии.СписокВыбора.Добавить(СтруктураОтвета.Серия, СтруктураОтвета.Серия);
		КонецЕсли;
		ВыборСерии = СтруктураОтвета.Серия;
		Элементы.СтраницаСозданияСерий.Видимость = Ложь;
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОсновная;
		Элементы.СтраницыКоманд.ТекущаяСтраница = Элементы.СтраницаОсновнаяКоманды;
		Элементы.Подтвердить.Важность = ВажностьКнопки.Главная;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МассивНезаполненныхРеквизитов()
	МассивРеквизитов = Новый Массив;
	Если НЕ ЗначениеЗаполнено(НомерСерии) Тогда
		МассивРеквизитов.Добавить("Номер");
	КонецЕсли;
	Возврат МассивРеквизитов;
КонецФункции

&НаКлиенте
Процедура ОтменитьСозданиеСерии()
	Элементы.СтраницаСозданияСерий.Видимость = Ложь;
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОсновная;
	Элементы.СтраницыКоманд.ТекущаяСтраница = Элементы.СтраницаОсновнаяКоманды;
	Элементы.Подтвердить.Важность = ВажностьКнопки.Главная;
КонецПроцедуры
#КонецОбласти

#КонецОбласти
