

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Организация = Параметры.Организация;
	
	Если ЗначениеЗаполнено(Параметры.Подразделение) Тогда
		Подразделение = Параметры.Подразделение;
	Иначе
		ПодразделениеКассаККМ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.КассаККМ, "Подразделение");
		Элементы.Подразделение.ПодсказкаВвода = СтрШаблон("%1 (по умолчанию)", ПодразделениеКассаККМ);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыбратьПодразделение(Команда)
	Закрыть(Подразделение);
КонецПроцедуры
#КонецОбласти