
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ПараметрыКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ПараметрыКонтактнойИнформации.ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ПараметрыКонтактнойИнформации);
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ПараметрыКонтактнойИнформации.ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформацияПокупателя.Имя;
	ПараметрыКонтактнойИнформации.РазрешитьДобавлениеПолей = Ложь;
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Контрагент, ПараметрыКонтактнойИнформации);
	УстановитьПривилегированныйРежим(Ложь);
	Если Не ЗначениеЗаполнено(Контрагент) Или Не ЧтениеРазрешено(Контрагент) Тогда
		УдалитьКИПокупателя();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиУНФ.ЗаполнитьДополнительныеПараметры(Объект,
		"ДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	НаборСвойств_Справочник_Лиды = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Лиды");
	// Конец СтандартныеПодсистемы.Свойства
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаЗавершенияРаботы) Тогда
		ТекущийЭлемент = Элементы.НаименованиеКомпании;
	КонецЕсли;
	
	Параметры.Свойство("СопоставитьКонтактИАдресЭПВСобытияхПослеЗаписиОбъекта", СопоставитьКонтактИАдресЭПВСобытияхПослеЗаписиОбъекта);
	ТребуетсяОбновитьДанныеВыбораСостояния = Истина;
	
	УстановитьНастройкиКонтроляДублей();
	СозданКопированием = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Контрагент") Тогда
		
		Контрагент = Параметры.ЗначенияЗаполнения.Контрагент;
		ПредыдущийКонтрагент = Контрагент;
		Объект.Вид = Перечисления.ВидыЛидов.ПовторноеОбращение;
		
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			
			Если ЭтоПовторныйЛидНаСервере() Тогда
				Контрагент = СвязанныйКонтрагент(Параметры.ЗначениеКопирования);
				ПредыдущийКонтрагент = Контрагент;
			КонецЕсли;
			
		КонецЕсли;
		
		ПриСозданииПриЧтенииНаСервере();
		
	КонецЕсли;
	
	ОбязательноЗаполнятьИсточникВЛидах = 
	РегистрыСведений.ОбязательностьЗаполненияРеквизитов.ОбязательностьЗаполненияРеквизита("Лид", "ИсточникПривлечения");
	
	Параметры.Свойство("ЗаписьПовторногоЛидаИзОбычногоСобытия", ЗаписьПовторногоЛидаИзОбычногоСобытия);
	Параметры.Свойство("СобытиеОснование", СобытиеОснование);
	
	СоздатьОбновитьКарточкиКИ();
	
	ОпределитьИнтерфейсПриСоздании();
	
	АдаптацияТакси();
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
			
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЛидЗамененНаДубль Тогда
		РаботаСЛидамиКлиент.ОповеститьОбИзмененном(Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
	Если ТипЗнч(Параметр) = Тип("Массив") Тогда
		ЛидИзменен = (Параметр.Найти(Объект.Ссылка) <> Неопределено);
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Лиды") Тогда
		ЛидИзменен = (Параметр = Объект.Ссылка);
	Иначе
		ЛидИзменен = Ложь;
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_КонтактЛидовКИ" И Параметр.Лид = Объект.Ссылка И ЗначениеЗаполнено(Параметр.Контакт) Тогда
		ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц();
		Если НЕ Модифицированность Тогда
			Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия="Запись_СостоянияЛидов" Тогда
		ТребуетсяОбновитьДанныеВыбораСостояния = Истина;
	КонецЕсли;
	
	Если (ИмяСобытия = "Запись_Контрагент" Или ИмяСобытия = "Запись_КонтактноеЛицо") И ЭтоПовторныйЛид() Тогда
		Прочитать();
		СоздатьОбновитьКарточкиКИ();		
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_ЗаказПокупателя" Или ИмяСобытия = "Запись_ЗаказНаряды" Тогда
		ОбработкаОповещенияНаСервере(ИмяСобытия, Параметр);
	КонецЕсли;
	
	Если ИмяСобытия = РаботаСЛидамиКлиентСервер.КлючОповещения() И ЛидИзменен И Не ЛидИзмененНаФорме Тогда
		Прочитать();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, ИмяЭлементаДляРазмещения);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	Контрагент = СвязанныйКонтрагент(ТекущийОбъект.Ссылка);
	ПредыдущийКонтрагент = Контрагент;
	СвязанныйКонтрагентПриОткрытии = Контрагент;
	
	СостояниеПередЗавершением = СостоянияЛидов.ПолучитьСостояниеЛидаПередЗавершением(
	ТекущийОбъект.Ссылка, Справочники.СостоянияЛидов.Завершен);
	Если СостояниеПередЗавершением = Неопределено Тогда
		ПредыдущееСостояние = ЗаполнениеОбъектовУНФ.ПолучитьСостояниеЛида();
	Иначе
		ПредыдущееСостояние = СостояниеПередЗавершением;
	КонецЕсли;
	Элементы.СостояниеЛидаРасширеннаяПодсказка.Заголовок = СтрШаблон(
	НСтр("ru='Предыдущее состояние: %1'"), ПредыдущееСостояние);
	
	ПриСозданииПриЧтенииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если СозданКопированием И Элементы.ФормаПроверитьЛидаНаДубли.Видимость Тогда
		
		Состояние(НСтр("ru='Проверка лида на дубли'"), 49);
		ПроверитьКонтрагентаНаДублиСервер();
		Состояние(НСтр("ru='Проверка лида на дубли'"), 100);
		
		ПоказатьСообщениеОДублях();
		
	КонецЕсли;
	
	Если Элементы.НаименованиеКомпании.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу
		Или Элементы.ПредставлениеВПрограмме.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу
		Или ДублиКИ.Количество() > 0 Тогда
		
		Если ЭтоПовторныйЛид() Тогда
			УдалитьЭлементыДублейКИ();
			Элементы.ПредставлениеВПрограмме.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
			Элементы.НаименованиеКомпании.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Иначе
			ПоказатьПредупреждениеОДублях();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоПовторныйЛид() И Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = ЗначенияРеквизитовОбъектов(Контрагент, "Наименование");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		ПараметрыЗаписи.Вставить("ЗаписьНового", Истина);
	КонецЕсли;
	
	ТегированиеОбъектов.ПередЗаписьюНаСервере(ЭтотОбъект,ТекущийОбъект);
	
	ОбработатьКонтактыЛидаПередЗаписьюНаСервере(ТекущийОбъект);
	
	Если ПроигнорированоСообщениеОДублях Тогда 
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоЗаписьДубля");
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СообщениеОДублированииИнформации", СообщениеОДублированииИнформации);
	КонецЕсли;
	
	ПроигнорированоСообщениеОДублях = Ложь;
	СообщениеОДублированииИнформации = "";

	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность", Модифицированность);
	// Конец Обсуждения
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Контрагент", Контрагент);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьДанныеКонтактныхЛиц(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	ЗаписатьСобытиеОснование(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ЗаписьНового") Тогда
		ОповеститьОЗаписиНового(Объект.Ссылка);
	КонецЕсли;
	
	РаботаСЛидамиКлиент.ОповеститьОбИзмененном(Объект.Ссылка);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	ЛидИзмененНаФорме = Истина;
	
	Если ЭтоПервичныйЛидНаСервере() Тогда
		ЗаполнитьИОбновитьКонтактныеЛица();
	КонецЕсли;
	СоздатьОбновитьКарточкиКИ();
	
	Элементы.СостояниеЛидаРасширеннаяПодсказка.Заголовок = СтрШаблон(
	НСтр("ru='Предыдущее состояние: %1'"),
	СостоянияЛидов.ПолучитьСостояниеЛидаПередЗавершением(
	ТекущийОбъект.Ссылка,
	Справочники.СостоянияЛидов.Завершен));
	
	Элементы.СостояниеЛидаРасширеннаяПодсказка.Заголовок = СтрШаблон(НСтр("ru='Предыдущее состояние: %1'"),
		СостоянияЛидов.ПолучитьСостояниеЛидаПередЗавершением(
			ТекущийОбъект.Ссылка,
			Справочники.СостоянияЛидов.Завершен));
	
	НужноОбновитьИнформациюПоКонтрагенту = ЭтоПовторныйЛидНаСервере()
	И Не ЗначениеЗаполнено(СвязанныйКонтрагентПриОткрытии);
	УправлениеФормой(НужноОбновитьИнформациюПоКонтрагенту);
	
	СвязанныйКонтрагентПриОткрытии = Контрагент;
	
	//Обсуждения
	ОбсужденияУНФ.ПослеЗаписиНаСервере(ТекущийОбъект);
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	РегистрыСведений.ОбязательностьЗаполненияРеквизитов.ПроверитьОбязательноеЗаполнениеИсточникаПривлеченияНаФорме(
	"Лид", Объект, Отказ);
	
	Если Не ЭтоПовторныйЛидНаСервере() Тогда        
		
		КИДопРеквизитов = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Выгрузить();
		МассивСтрокКИПокупателя =  ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(
				Новый Структура("ИмяЭлементаДляРазмещения", "КонтактнаяИнформацияПокупателя"));
		Для Каждого Строка Из МассивСтрокКИПокупателя Цикл
			ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Удалить(Строка);	
		КонецЦикла;		
			
		// СтандартныеПодсистемы.КонтактнаяИнформация
		УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
		// Конец СтандартныеПодсистемы.КонтактнаяИнформация
 		ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Загрузить(КИДопРеквизитов);		
		
		ПроверитьЗаполнениеКонтактныхЛиц(Отказ);
		
		ПроверяемыйРеквизит = ПроверяемыеРеквизиты.Найти("Контрагент");
		Если ПроверяемыйРеквизит <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыйРеквизит);
		КонецЕсли;
		
	Иначе
		// СтандартныеПодсистемы.КонтактнаяИнформация
		УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
		// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Теги

&НаКлиенте
Процедура СписокТеговАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	БыстрыеФормыУНФКлиент.ТегиАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокТеговОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	БыстрыеФормыУНФКлиент.СписокТеговОбработкаВыбора(ВыбранноеЗначение, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТеговОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	БыстрыеФормыУНФКлиент.СписокТеговОкончаниеВводаТекста(Текст, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура НаименованиеКомпанииПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект);
	ОбновитьНаименованиеЛида();
	
	Если НЕ ПроверятьЮрНазваниеНаДубли И ПроверятьПредставлениеНаДубли Тогда
		ПроверитьНаДубли("Наименование");
	КонецЕсли;
	
	Если НЕ ПроверятьЮрНазваниеНаДубли Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.НаименованиеКомпании)) Тогда
		Элементы.НаименованиеКомпании.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Возврат;
	КонецЕсли;
	
	ПроверитьНаДубли("НаименованиеКомпании");

КонецПроцедуры

&НаКлиенте
Процедура СтатусЛидаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТребуетсяОбновитьДанныеВыбораСостояния Тогда
		ДанныеВыбораСостояния = ПолучитьДанныеВыбора(Тип("СправочникСсылка.СостоянияЛидов"), ПараметрыПолученияДанных);
		ДанныеВыбора = ДанныеВыбораСостояния;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдаленныеКонтактыНажатие(Элемент)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецКонтакта", Объект.Ссылка);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыКонтактов",ЭтотОбъект);
	ОткрытьФорму("Справочник.КонтактыЛидов.Форма.ФормаСпискаУдаленныхКонтактов",ПараметрыФормы,,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ДублиПоПолномуНаименованиюНажатие(Элемент)
	
	ПараметрыДублей = Новый Структура;
	
	ПараметрыДублей.Вставить("НаименованиеПолное", НаименованиеКомпанииДляПоискаДублей);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ЭтоПолноеНаименование", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Справочник.Лиды.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДублиПоПредставлению0Нажатие(Элемент)
	
	ДублиПоПредставлениюНажатие();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеВПрограмме0ПриИзменении(Элемент)
	
	ПредставлениеВПрограммеПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛидыПокупателяКачественныйЛидОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	ОткрытьФорму("Справочник.Лиды.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛидыПокупателяНекачественныйЛидОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	ОткрытьФорму("Справочник.Лиды.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВидПриИзменении(Элемент)
	
	КонтрагентОчищен = Ложь;
	Если ЭтоПервичныйЛид() И ЗначениеЗаполнено(Контрагент) Тогда
		
		Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыЛидов.ПовторноеОбращение");
		
		ОтветПользователя = Ждать ВопросАсинх(
		НСтр("ru = 'При переводе обращения в первичное покупатель будет отвязан. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);
		
		Если ОтветПользователя <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыЛидов.ПервичноеОбращение");
		
		Контрагент = Неопределено;
		ПредыдущийКонтрагент = Неопределено;
		КонтрагентОчищен = Истина;
		
	КонецЕсли;
	
	ВидПриИзмененииНаСервере(КонтрагентОчищен);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если Контрагент = ПредыдущийКонтрагент Тогда
		Возврат;
	КонецЕсли;
	
	КонтрагентПриИзмененииНаСервере();
	ПредыдущийКонтрагент = Контрагент;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НаименованиеКонтактаПокупателя_Открытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ИндексВыбранногоКонтактногоЛица = Число(Сред(Элемент.Имя, СтрДлина("НаименованиеКонтактаПокупателя_")+1));
	
	Если Не ЗначениеЗаполнено(ДанныеКонтактныхЛицПокупателя[ИндексВыбранногоКонтактногоЛица].КонтактноеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Ключ",ДанныеКонтактныхЛицПокупателя[ИндексВыбранногоКонтактногоЛица].КонтактноеЛицо);
	ПараметрыФормы.Вставить("ТекущийКонтрагент", Контрагент);
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта",ПараметрыФормы);
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛидыПокупателяНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	ОткрытьФорму("Справочник.Лиды.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиЗаказыПокупателейНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу");
	ЗаявкиНажатие(ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиЗаказНарядыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд");
	ЗаявкиНажатие(ВидОперации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область События

&НаКлиенте
Процедура СобытиеSMS(Команда)
	
	СоздатьСобытиеПоЛиду("СообщениеSMS");
	
КонецПроцедуры

&НаКлиенте
Процедура СобытиеЗапись(Команда)
	
	СоздатьСобытиеПоЛиду("Запись");
	
КонецПроцедуры

&НаКлиенте
Процедура СобытиеЛичнаяВстреча(Команда)
	
	СоздатьСобытиеПоЛиду("ЛичнаяВстреча");
	
КонецПроцедуры

&НаКлиенте
Процедура СобытиеПрочее(Команда)
	
	СоздатьСобытиеПоЛиду("Прочее");
	
КонецПроцедуры

&НаКлиенте
Процедура СобытиеТелефонныйЗвонок(Команда)
	
	СоздатьСобытиеПоЛиду("ТелефонныйЗвонок");
	
КонецПроцедуры

&НаКлиенте
Процедура СобытиеЭлектронноеПисьмо(Команда)
	
	СоздатьСобытиеПоЛиду("ЭлектронноеПисьмо");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура НастроитьКонтактнуюИнформацию(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ВладелецКонтактнойИнформации", ПредопределенноеЗначение("Справочник.КонтактыЛидов.ПустаяСсылка"));
	
	ОткрытьФорму("Справочник.ВидыКонтактнойИнформации.Форма.ФормаСписка",ПараметрыОткрытияФормы,
			ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДобавитьКонтактПервичный(Команда)
	
	Если Модифицированность Или Объект.Ссылка.Пустая() Тогда
		ОтветОтПользователя = Ждать ВопросАсинх(
		НСтр("ru = 'Данные еще не записаны.
		|Продолжение добавления контактных лиц возможно только после записи данных.
		|Данные будут записаны'"),
		РежимДиалогаВопрос.ОКОтмена);
		
		Если ОтветОтПользователя <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;  
		
		Записать();
	КонецЕсли;  
	
	Если Модифицированность Или Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;  
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Владелец", Объект.Ссылка);
	СтруктураПараметров.Вставить("БлокироватьВидимостьКодаВладельца", Истина); 
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыКонтактаЛида", ЭтотОбъект);
	ОткрытьФорму("Справочник.КонтактыЛидов.Форма.ФормаЭлемента", СтруктураПараметров, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПеревестиВНекачественныйЛид(Команда)
	
	Если ЭтоПовторныйЛид() И Не ЗначениеЗаполнено(Контрагент) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Поле ""Покупатель"" не заполнено.'"), ,
		"Контрагент");
		Возврат;
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ОтветОтПользователя = Ждать ВопросАсинх(
		НСтр("ru = 'Данные еще не записаны.
		|Перевод лида в некачественного возможен только после записи данных.
		|Данные будут записаны'"),
		РежимДиалогаВопрос.ОКОтмена);
		
		Если ОтветОтПользователя <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПеревестиВНекачественныйЛидСервер();
	РаботаСЛидамиКлиент.ОповеститьОбИзмененном(Объект.Ссылка);
	
	ТекущийЭлемент = Элементы.ПричинаНеуспешногоЗавершенияРаботы;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиЛидаКоманда(Команда)
	ПеревестиЛида();
КонецПроцедуры

&НаКлиенте
Процедура ВернутьВРаботу(Команда)
	ВернутьВРаботуСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДополнительныйРеквизит(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", НаборСвойств_Справочник_Лиды);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта", ПараметрыФормы, , , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПеревода(Команда)
	ОткрытьФорму("Справочник.Лиды.Форма.ФормаНастройкиПереноса");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЛидаНаДубли(Команда)
	
	Состояние(НСтр("ru='Проверка лида на дубли'"), 49);
	ПроверитьКонтрагентаНаДублиСервер();
	Состояние(НСтр("ru='Проверка лида на дубли'"), 100);
	
	ПоказатьСообщениеОДублях();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеКонтактыПокупателя(Команда)
	
	ПоказыватьВсеКонтакты = Истина;
	ОбновитьКонтактыПокупателяНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсеЗаявкиВРаботе(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьВсеЗаявкиВРаботеЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаОтменыЗаказа", , , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаЗаказПокупателя(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу");
	Заявка(ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаЗаказНаряд(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд");
	Заявка(ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВПокупателя(Команда)
	ПеревестиЛида("Покупатель");
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВЗаказПокупателя(Команда)
	ПеревестиЛида("ЗаказПокупателя");
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВЗаказНаряд(Команда)
	ПеревестиЛида("ЗаказНаряд");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПомеченныеНаУдалениеКонтакты(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецКонтакта", Объект.Ссылка);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыКонтактов",ЭтотОбъект);
	ОткрытьФорму("Справочник.КонтактыЛидов.Форма.ФормаСпискаУдаленныхКонтактов",ПараметрыФормы,,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.НачатьИзменение(ЭтотОбъект, Элемент);
	КонтактнаяИнформацияКонтактногоЛицаПриИзменении(Элемент);
	КонтактнаяИнформацияПриИзменении(Элемент.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьОчистку(ЭтотОбъект, Элемент.Имя);
	КонтактнаяИнформацияКонтактногоЛицаПриИзменении(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьОбработкуНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры
//@skip-warning
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(Элемент)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьОбновлениеКонтактнойИнформации(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьКонтактнуюИнформацию(Результат);
	Если Результат.Свойство("ИмяРеквизита") Тогда
		КонтактнаяИнформацияКонтактногоЛицаПриИзменении(Элементы[Результат.ИмяРеквизита]);
		КонтактнаяИнформацияПриИзменении(Результат.ИмяРеквизита);		
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ОбновитьКонтактнуюИнформацию(Результат)
	Если Результат.Свойство("ИмяЭлементаДляРазмещения") Тогда
		ИмяЭлементаДляРазмещения = Результат.ИмяЭлементаДляРазмещения;
	Иначе
		ОписаниеКИ = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Результат.ИмяРеквизита);
		ИмяЭлементаДляРазмещения = ОписаниеКИ.ИмяЭлементаДляРазмещения;
	КонецЕсли;
	Результат.Вставить("ПостфиксИмяРеквизита", ИмяЭлементаДляРазмещения);
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область ИзменениеИнтерфейсаПоДанным

&НаСервере
Процедура УправлениеФормой(ОбновлятьИнформациюПоКонтрагенту = Истина)
	
	ОбновитьВидимостьИДоступностьЭлементов();
	ОбновитьЗаголовок();
	ОбновитьИнтерфейсГруппыРезультат();
	ОбновитьИнтерфейсГруппыЗаявок();
	ОбновитьИнтерфейсПоВидуЛида();
	
	Если ОбновлятьИнформациюПоКонтрагенту Тогда
		ОбновитьИнтерфейсПоКонтрагенту();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьИнтерфейсПриСоздании()
	
	ОбновитьОтображениеКнопокЗаявок();
	
	Элементы.Запись.Видимость = ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИДоступностьЭлементов()
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники.Лиды);
	ЭтоНекачественныйЛид = ЭтоНекачественныйЛид();
	ЛидПереведенВПокупателя = ЛидПереведенВПокупателя();
	ЛидЗавершен = ЭтоНекачественныйЛид Или ЛидПереведенВПокупателя;
	
	Если ЛидЗавершен Тогда
		Элементы.СостояниеЛида.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Иначе
		Элементы.СостояниеЛида.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	ТолькоПросмотр = ЛидПереведенВПокупателя ИЛИ НЕ МожноРедактировать;
	
	Элементы.ОЛиде.ТолькоПросмотр = ЭтоНекачественныйЛид;
	Элементы.КонтактнаяИнформация.ТолькоПросмотр = ЭтоНекачественныйЛид;
	Элементы.КонтактнаяИнформацияПокупателяОбертка.ТолькоПросмотр = ЭтоНекачественныйЛид;
	Элементы.КолонкаСправа.ТолькоПросмотр = ЭтоНекачественныйЛид;
	Элементы.СтраницаДополнительно.ТолькоПросмотр = ЭтоНекачественныйЛид;
	Элементы.Комментарий.ТолькоПросмотр = ЭтоНекачественныйЛид;
	
	Элементы.ПодменюЗаявки.Доступность = Не ЛидЗавершен;
	
	Элементы.ПоказатьПомеченныеНаУдалениеКонтакты.Видимость = ЕстьУдаленныеКонтакты();
	Элементы.ФормаПроверитьЛидаНаДубли.Видимость = ПроверятьПредставлениеНаДубли ИЛИ ПроверятьАдресЭПНаДубли
	ИЛИ ПроверятьНомерТелефонаНаДубли ИЛИ ПроверятьЮрНазваниеНаДубли;
	
	Если ОбязательноЗаполнятьИсточникВЛидах Тогда
		Элементы.ИсточникПривлечения.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ЛидЗавершен Тогда
		Элементы.Контрагент.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	Иначе
		Элементы.Контрагент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовок()
	
	Если Объект.Ссылка.Пустая() Тогда
		Заголовок = НСтр("ru = 'Лид (создание)'");
	ИначеЕсли ЭтоПовторныйЛидНаСервере() Тогда
		Заголовок = СтрШаблон(НСтр("ru = '%1 (Лид: Повторное обращение)'"), Объект.Ссылка);
	Иначе
		Заголовок = СтрШаблон(НСтр("ru = '%1 (Лид: Первичное обращение)'"), Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнтерфейсПоВидуЛида()
	
	ЭтоПовторныйЛид = ЭтоПовторныйЛидНаСервере();
	
	Элементы.СтраницаПовторноеОбращение.Видимость = ЭтоПовторныйЛид;
	Элементы.СтраницаПервичноеОбращение.Видимость = Не ЭтоПовторныйЛид;
	
	Элементы.ФормаПроверитьЛидаНаДубли.Видимость = Не ЭтоПовторныйЛид;
	Элементы.ГруппаКонтактыКонтрагентаОбертка.Видимость = ЭтоПовторныйЛид;
	Элементы.КонтактнаяИнформацияПокупателяОбертка.Видимость = ЭтоПовторныйЛид;
	Элементы.КонтактнаяИнформация.Видимость = Не ЭтоПовторныйЛид;
	Элементы.ГруппаКонтактыКомандыПервичный.Видимость = Не ЭтоПовторныйЛид;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнтерфейсПоКонтрагенту()
	
	ОбновитьКИПокупателя();
	ОбновитьСсылкуНаЛидовПокупателяВРаботе();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнтерфейсГруппыРезультат()
	
	ЭтоНекачественныйЛид = ЭтоНекачественныйЛид();
	ЛидПереведенВПокупателя = ЛидПереведенВПокупателя();
	ЛидЗавершен = ЭтоНекачественныйЛид ИЛИ ЛидПереведенВПокупателя;
	
	Если ЛидЗавершен Тогда
		
		Элементы.ГруппаЗавершенияРаботы.Заголовок = СтрШаблон(НСтр("ru='Работа с лидом завершена %1'"),
		Формат(Объект.ДатаЗавершенияРаботы,"ДЛФ=Д"));
		
	Иначе
		
		Элементы.ГруппаЗавершенияРаботы.Заголовок = НСтр("ru='Завершение работы с лидом'");
		
	КонецЕсли;
	
	Если ЛидПереведенВПокупателя Тогда
		
		УстановитьТекущуюСтраницуНаСервере(Элементы.СтраницыЗавершенияРаботы, Элементы.СтраницаКачественныйЛид);
		ОбновитьОтображениеРезультатаКачественногоЛида();
		
	ИначеЕсли ЭтоНекачественныйЛид Тогда
		
		УстановитьТекущуюСтраницуНаСервере(Элементы.СтраницыЗавершенияРаботы, Элементы.СтраницаНекачественныйЛид);
		ОбновитьОтображениеРезультатаНекачественногоЛида();
		
	Иначе
		
		Элементы.ГруппаЗавершенияРаботы.Видимость = Ложь;
		
	КонецЕсли;
	
	ОбновитьКнопкиПереводаКачественногоЛида();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнтерфейсГруппыЗаявок()
	
	ИспользуютсяЗаявкиДляЗаказовНаПродажу = ИспользованиеЗаявок.ЗаказНаПродажу;
	ИспользуютсяЗаявкиДляЗаказНарядов = ИспользованиеЗаявок.ЗаказНаряд;
	
	Если Не ИспользуютсяЗаявкиДляЗаказовНаПродажу И Не ИспользуютсяЗаявкиДляЗаказНарядов Тогда
		Элементы.ГруппаЗаявки.Видимость = Ложь;
		Возврат;
	Иначе
		Элементы.ГруппаЗаявки.Видимость = Истина;
	КонецЕсли;
	
	КоличестваЗаявок = РаботаСЗаявками.ДанныеКоличестваЗаявокЛида();
	
	Если ИспользуютсяЗаявкиДляЗаказовНаПродажу И ИспользуютсяЗаявкиДляЗаказНарядов Тогда
		
		КоличествоЗаявок = РаботаСЗаявками.КоличествоЗаявокЛида(Объект.Ссылка);
		КоличествоЗаявокЗаказовПокупателей = КоличествоЗаявок[Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу];
		КоличествоЗаявокЗаказНарядов = КоличествоЗаявок[Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд];
		
	ИначеЕсли ИспользуютсяЗаявкиДляЗаказовНаПродажу Тогда
		
		КоличествоЗаявокЗаказовПокупателей = РаботаСЗаявками.КоличествоЗаявокЛида(
		Объект.Ссылка, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
		КоличествоЗаявокЗаказНарядов = КоличестваЗаявок;
		
	Иначе
		
		КоличествоЗаявокЗаказовПокупателей = КоличестваЗаявок;
		КоличествоЗаявокЗаказНарядов = РаботаСЗаявками.КоличествоЗаявокЛида(
		Объект.Ссылка, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
		
	КонецЕсли;
	
	Элементы.ЗаявкиЗаказыПокупателей.Видимость = ИспользуютсяЗаявкиДляЗаказовНаПродажу;
	Элементы.ЗаявкиЗаказНаряды.Видимость = ИспользуютсяЗаявкиДляЗаказНарядов;
	
	Если ИспользуютсяЗаявкиДляЗаказовНаПродажу Тогда
		ЗаявкиЗаказыПокупателей = ЗаголовокПредставленияКоличестваЗаявок(КоличествоЗаявокЗаказовПокупателей);
	КонецЕсли;
	Если ИспользуютсяЗаявкиДляЗаказНарядов Тогда
		ЗаявкиЗаказНаряды = ЗаголовокПредставленияКоличестваЗаявок(КоличествоЗаявокЗаказНарядов);
	КонецЕсли;
	
	ПоказатьОтменуЗаявок =
	ЗначениеЗаполнено(Объект.ВариантЗавершения)
	И (КоличествоЗаявокЗаказовПокупателей.КоличествоЗаявокВРаботе
	Или КоличествоЗаявокЗаказНарядов.КоличествоЗаявокВРаботе);
	
	Элементы.ОтменитьВсеЗаявкиВРаботе.Видимость = ПоказатьОтменуЗаявок;
	
КонецПроцедуры

&НаСервере
Функция ЗаголовокПредставленияКоличестваЗаявок(КоличестваЗаявок)
	
	Если КоличестваЗаявок.КоличествоОтмененныхЗаявок Тогда
		
		ПредставлениеОтмененныхЗаявок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru=';%1 отмененная;;%1 отмененных;%1 отмененных;%1 отмененных'"),
		КоличестваЗаявок.КоличествоОтмененныхЗаявок);
		
	КонецЕсли;
	
	Если КоличестваЗаявок.КоличествоЗаявокВРаботе И КоличестваЗаявок.КоличествоОтмененныхЗаявок Тогда
		Возврат СтрШаблон("%1 в работе, %2", КоличестваЗаявок.КоличествоЗаявокВРаботе, ПредставлениеОтмененныхЗаявок);
	ИначеЕсли КоличестваЗаявок.КоличествоЗаявокВРаботе Тогда
		Возврат СтрШаблон("%1 в работе", КоличестваЗаявок.КоличествоЗаявокВРаботе);
	ИначеЕсли КоличестваЗаявок.КоличествоОтмененныхЗаявок Тогда
		Возврат ПредставлениеОтмененныхЗаявок;
	Иначе
		Возврат НСтр("ru = 'Нет заявок в работе'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РаботаСПовторнымОбращением

&НаСервере
Процедура ОбновитьСсылкуНаЛидовПокупателяВРаботе()
	
	Если ЗначениеЗаполнено(Контрагент) И ЧтениеРазрешено(Контрагент) Тогда
		Элементы.Контрагент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Иначе
		Элементы.Контрагент.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Возврат;
	КонецЕсли;
	
	Элементы.Контрагент.РасширеннаяПодсказка.Заголовок = Справочники.Контрагенты.ПредставлениеЛидовКонтрагента(Контрагент);
	Если ПустаяСтрока(Элементы.Контрагент.РасширеннаяПодсказка.Заголовок) Тогда
		Элементы.Контрагент.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Нет лидов'")
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКИПокупателя()

	Для Каждого Элемент Из Элементы.КонтактнаяИнформацияПокупателя.ПодчиненныеЭлементы Цикл
		Элемент.Видимость = Истина;
	КонецЦикла;
	
	ВидимостьКИПокупателя = Ложь;
	ВидимостьОтсутствияПокупателя = Ложь;
	ВидимостьНедоступностиПокупателя = Ложь;
	
	Если Не ЧтениеРазрешено(Контрагент) Тогда
		ВидимостьНедоступностиПокупателя = Истина;
		УдалитьКИПокупателя();
	ИначеЕсли Не ЗначениеЗаполнено(Контрагент) Тогда
		ВидимостьОтсутствияПокупателя = Истина;
		УдалитьКИПокупателя();
	Иначе
		
		ВидимостьКИПокупателя = Истина;
		
		УстановитьПривилегированныйРежим(Истина);
		// СтандартныеПодсистемы.КонтактнаяИнформация
		ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформацияПокупателя.Имя;
		УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, Контрагент, ИмяЭлементаДляРазмещения);
		// Конец СтандартныеПодсистемы.КонтактнаяИнформация
		УстановитьПривилегированныйРежим(Ложь);
		
		ОбновитьКонтактыПокупателя();
		
	КонецЕсли;
	
	Элементы.КонтактнаяИнформацияПокупателя.Видимость = ВидимостьКИПокупателя;
	Элементы.ПокупательНеВыбран.Видимость = ВидимостьОтсутствияПокупателя;
	Элементы.ПокупательНеНайден.Видимость = ВидимостьНедоступностиПокупателя;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКИПокупателя()
	
	Для Каждого Элемент Из Элементы.КонтактнаяИнформацияПокупателя.ПодчиненныеЭлементы Цикл
		Элемент.Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтактыПокупателя()
	
	ЗаполнитьТаблицуКонтактовПокупателя();
	ОбновитьКонтактыПокупателяНаФорме();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКонтактовПокупателя()
	
	ДанныеКонтактныхЛицПокупателя.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязиКонтрагентКонтактСрезПервых.Контакт КАК Контакт,
		|	СвязиКонтрагентКонтактСрезПервых.Порядок КАК Порядок
		|ПОМЕСТИТЬ втПорядокКонтактовКонтрагента
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПервых(, Контрагент = &Контрагент) КАК СвязиКонтрагентКонтактСрезПервых
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.Ссылка КАК КонтактноеЛицо,
		|	СвязиКонтрагентКонтакт.Контрагент КАК Владелец,
		|	СвязиКонтрагентКонтакт.Должность КАК Должность,
		|	КонтактныеЛица.Наименование КАК Наименование,
		|	втПорядокКонтактовКонтрагента.Порядок КАК РеквизитДопУпорядочивания
		|ПОМЕСТИТЬ втКонтакты
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(, Контрагент = &Контрагент) КАК СвязиКонтрагентКонтакт
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокКонтактовКонтрагента КАК втПорядокКонтактовКонтрагента
		|		ПО (втПорядокКонтактовКонтрагента.Контакт = СвязиКонтрагентКонтакт.Контакт)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛица
		|		ПО СвязиКонтрагентКонтакт.Контакт = КонтактныеЛица.Ссылка
		|ГДЕ
		|	КонтактныеЛица.Недействителен = ЛОЖЬ
		|	И СвязиКонтрагентКонтакт.СвязьНедействительна = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.КонтактноеЛицо КАК КонтактноеЛицо,
		|	Контрагенты.КонтактноеЛицоПодписант КАК КонтактноеЛицоПодписант
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКонтакты.КонтактноеЛицо КАК КонтактноеЛицо,
		|	втКонтакты.Наименование КАК Наименование,
		|	втКонтакты.Должность КАК Должность
		|ИЗ
		|	втКонтакты КАК втКонтакты
		|
		|УПОРЯДОЧИТЬ ПО
		|	втКонтакты.РеквизитДопУпорядочивания,
		|	Наименование";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДанныхКонтрагента = РезультатыЗапроса[2].Выбрать();
	ВыборкаДанныхКонтрагента.Следующий();
	
	ВыборкаКонтактов = РезультатыЗапроса[3].Выбрать();
	Пока ВыборкаКонтактов.Следующий() Цикл
		
		СтрокаТЗ = ДанныеКонтактныхЛицПокупателя.Добавить();
		СтрокаТЗ.Ссылка = ВыборкаКонтактов.КонтактноеЛицо;
		СтрокаТЗ.КонтактноеЛицо = ВыборкаКонтактов.КонтактноеЛицо;
		СтрокаТЗ.Наименование = ВыборкаКонтактов.Наименование;
		СтрокаТЗ.Должность = ВыборкаКонтактов.Должность;
		СтрокаТЗ.Основной = (ВыборкаДанныхКонтрагента.КонтактноеЛицо = ВыборкаКонтактов.КонтактноеЛицо);
		СтрокаТЗ.Подписант = (ВыборкаДанныхКонтрагента.КонтактноеЛицоПодписант = ВыборкаКонтактов.КонтактноеЛицо);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтактыПокупателяНаФорме(Знач ИндексОбновляемогоКонтакта = Неопределено)
	
	КоличествоКонтактовПокупателя = ДанныеКонтактныхЛицПокупателя.Количество();
	
	Если КоличествоКонтактовПокупателя = 0 Тогда
		
		УстановитьТекущуюСтраницуНаСервере(Элементы.СтраницыКонтактыПокупателя, Элементы.СтраницаНетКонтактовПокупателя);
		Возврат;
		
	КонецЕсли;
	
	УстановитьТекущуюСтраницуНаСервере(Элементы.СтраницыКонтактыПокупателя, Элементы.СтраницаКонтактыПокупателя);
	
	Возврат;
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	ОбновитьИнтерфейсПоКонтрагенту();
	
	Если Не Элементы.ПеревестиЛида.Доступность Тогда
		ОбновитьКнопкиПереводаКачественногоЛида();
	КонецЕсли;
	
	СоздатьОбновитьКарточкиКИ();
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоПовторныйЛид()
	
	Возврат Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыЛидов.ПовторноеОбращение");
	
КонецФункции

&НаСервере
Функция ЭтоПовторныйЛидНаСервере()
	
	Возврат Объект.Вид = Перечисления.ВидыЛидов.ПовторноеОбращение;
	
КонецФункции

#КонецОбласти

#Область ПереводЛида

&НаСервере
Процедура ОбновитьОтображениеРезультатаКачественногоЛида()
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаЗавершенияРаботы.Видимость = Истина;
	Элементы.ГруппаЗавершенияРаботы.ЦветФона = ЦветаПалитры.Зеленый20УНФ;
	
	КонтрагентНС = ПолучитьНавигационнуюСсылку(Контрагент);
	Заказ = РегистрыСведений.СвязиКонтрагентЛид.ЗаказПоЛиду(Объект.Ссылка);
	ЕстьЗаказ = ЗначениеЗаполнено(Заказ);
	ПредставлениеКонтрагента = Строка(Контрагент);
	
	Если ЕстьЗаказ Тогда
		
		ЗаказНС = ПолучитьНавигационнуюСсылку(Заказ);
		ПредставлениеЗаказа = Строка(Заказ);
		ПредставлениеЗаказа = НРег(Сред(ПредставлениеЗаказа, 1, 1)) + Сред(ПредставлениеЗаказа, 2);
		
	КонецЕсли;
	
	Если ЭтоПервичныйЛидНаСервере() Тогда
		
		Если ЕстьЗаказ Тогда
			
			ЗаголовокРезультата = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Качественный лид: переведен в покупателя <a href=""%1"">%2</a> и <a href=""%3"">%4</a>'"),
			КонтрагентНС, ПредставлениеКонтрагента,
			ЗаказНС, ПредставлениеЗаказа);
			
		Иначе
			
			ЗаголовокРезультата = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Качественный лид: переведен в покупателя <a href=""%1"">%2</a>'"),
			КонтрагентНС, ПредставлениеКонтрагента);
			
		КонецЕсли;
		
		Элементы.ОтображениеПереводаКачественногоЛида.Заголовок = ЗаголовокРезультата;
		Элементы.ОтображениеПереводаКачественногоЛида1.Видимость = Ложь;
		
	Иначе
		
		Если ЕстьЗаказ Тогда
			
			ЗаголовокРезультата = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Переведен в <a href=""%1"">%2</a>'"),
			ЗаказНС, ПредставлениеЗаказа);
			
			Элементы.ОтображениеПереводаКачественногоЛида1.Заголовок = ЗаголовокРезультата;
			
		Иначе
			
			Элементы.ОтображениеПереводаКачественногоЛида1.Видимость = Ложь;
			
		КонецЕсли;
		
		Элементы.ОтображениеПереводаКачественногоЛида.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Качественный лид от покупателя <a href=""%1"">%2</a>'"),
		КонтрагентНС, ПредставлениеКонтрагента);
		
	КонецЕсли;
	
	ПредставлениеЛидовКонтрагента = Справочники.Контрагенты.ПредставлениеЛидовКонтрагента(Контрагент);
	Если ПустаяСтрока(ПредставлениеЛидовКонтрагента) Тогда
		Элементы.ГруппаЛидыПокупателяКачественныйЛид.Видимость = Ложь;
	Иначе
		Элементы.ГруппаЛидыПокупателяКачественныйЛид.Видимость = Истина;
		ЛидыПокупателяКачественныйЛид = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = '<a href=""https://1c.ru"">%1</a>'"), ПредставлениеЛидовКонтрагента);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеРезультатаНекачественногоЛида()
	
	Элементы.ГруппаЗавершенияРаботы.Видимость = Истина;
	Элементы.ГруппаЗавершенияРаботы.ЦветФона = ЦветаПалитры.Красный20УНФ;
	
	Если ЭтоПервичныйЛидНаСервере() Тогда
		
		Элементы.ОтображениеПереводаНекачественногоЛида.Заголовок = НСтр("ru = 'Некачественный лид'");
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Контрагент) Тогда
			Возврат;
		КонецЕсли;
		
		Элементы.ОтображениеПереводаНекачественногоЛида.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Некачественный лид от <a href=""%1"">%2</a>'"),
		ПолучитьНавигационнуюСсылку(Контрагент), Строка(Контрагент));
		
	КонецЕсли;
	
	ПредставлениеЛидовКонтрагента = Справочники.Контрагенты.ПредставлениеЛидовКонтрагента(Контрагент);
	Если ПустаяСтрока(ПредставлениеЛидовКонтрагента) Тогда
		Элементы.ГруппаЛидыПокупателяНекачественныйЛид.Видимость = Ложь;
	Иначе
		Элементы.ГруппаЛидыПокупателяНекачественныйЛид.Видимость = Истина;
		ЛидыПокупателяНекачественныйЛид = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = '<a href=""https://1c.ru"">%1</a>'"), ПредставлениеЛидовКонтрагента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПеревестиЛида(РезультатПеревода = Неопределено)
	
	Если ЭтоПовторныйЛид() И Не ЗначениеЗаполнено(Контрагент) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Поле ""Покупатель"" не заполнено.'"), ,
		"Контрагент");
		Возврат;
		
	КонецЕсли;
	
	Если РезультатПеревода = Неопределено Тогда
		Если ЭтоПовторныйЛид() Тогда
			РезультатПеревода = АктивныеКнопкиПереводаЛида.КнопкаПереводаПовторногоЛида;
		Иначе
			РезультатПеревода = АктивныеКнопкиПереводаЛида.КнопкаПереводаПервичногоЛида;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеЛида = Новый Структура("Ссылка,Вид", Объект.Ссылка, Объект.Вид);
	ОтветОтСервера = ПараметрыВопросаПередПереводомЛидаНаСервере(Объект.Ссылка);
	ПоложительныйОтвет = Ждать РаботаСЛидамиКлиент.ВопросПередПереводомЛидаАсинх(
	ДанныеЛида, РезультатПеревода, ОтветОтСервера.НаличиеЗаявок);
	Если Не ПоложительныйОтвет Тогда
		Возврат;
	КонецЕсли;
	
	ОтветОтСервера = ПеревестиЛидаНаСервере(РезультатПеревода);
	Если Не ЗначениеЗаполнено(ОтветОтСервера) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСЛидамиКлиент.ОповеститьОбИзмененном(ОтветОтСервера.Лид);
	РаботаСЛидамиКлиент.ОткрытьРезультатПослеПереводаЛида(
	ОтветОтСервера.Лид, РезультатПеревода, ОтветОтСервера.Контрагент);
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПеревестиЛидаНаСервере(Знач РезультатПеревода)
	
	Если ЭтоПовторныйЛидНаСервере() Тогда
		Объект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование");
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЛидОбъект = РеквизитФормыВЗначение("Объект");
	
	ТегированиеОбъектов.ПередЗаписьюНаСервере(ЭтотОбъект, ЛидОбъект);

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ЛидОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ЭтоПовторныйЛидНаСервере() Тогда
		АктивныеКнопкиПереводаЛида.КнопкаПереводаПовторногоЛида = РезультатПеревода;
	Иначе
		АктивныеКнопкиПереводаЛида.КнопкаПереводаПервичногоЛида = РезультатПеревода;
	КонецЕсли;
	
	РаботаСЛидами.СохранитьАктивныеКнопкиПереводаЛидаВХранилище(АктивныеКнопкиПереводаЛида);
	
	Возврат РаботаСЛидами.ПеревестиЛида(ЛидОбъект, Контрагент);
	
КонецФункции

&НаСервере
Процедура ПеревестиВНекачественныйЛидСервер()
	
	Если ЭтоПовторныйЛидНаСервере() Тогда
		Объект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование");
	КонецЕсли;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	Объект.ДатаЗавершенияРаботы = ТекущаяДатаСеанса();
	Объект.ВариантЗавершения = Перечисления.ВариантЗавершенияРаботыСЛидом.НекачественныйЛид;
	Объект.СостояниеЛида = Справочники.СостоянияЛидов.Завершен;
	
	Элементы.СостояниеЛидаРасширеннаяПодсказка.Заголовок = СтрШаблон(НСтр("ru='Предыдущее состояние: %1'"),
	СостоянияЛидов.ПолучитьСостояниеЛидаПередЗавершением(Объект.Ссылка,
	Справочники.СостоянияЛидов.Завершен));
	
	Модифицированность = Истина;
	ОбновитьВидимостьИДоступностьЭлементов();
	ОбновитьИнтерфейсГруппыРезультат();
	ОбновитьИнтерфейсГруппыЗаявок();
	
КонецПроцедуры

&НаСервере
Процедура ВернутьВРаботуСервер()
	
	Объект.СостояниеЛида =  СостоянияЛидов.ПолучитьСостояниеЛидаПередЗавершением(
	Объект.Ссылка, Справочники.СостоянияЛидов.Завершен);
	
	Объект.ПричинаНеуспешногоЗавершенияРаботы = Неопределено;
	Объект.ВариантЗавершения = Неопределено;
	Объект.ДатаЗавершенияРаботы = Дата('00010101');
	Объект.ЗаметкиЗавершенияРаботы = Неопределено;
	
	ОбновитьВидимостьИДоступностьЭлементов();
	ОбновитьИнтерфейсГруппыРезультат();
	ОбновитьИнтерфейсГруппыЗаявок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросПереводВНекачественного(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПеревестиВНекачественныйЛидСервер();
	
КонецПроцедуры

&НаСервере
Функция ЛидПереведенВПокупателя()
	
	Возврат ЗначениеЗаполнено(Объект.ДатаЗавершенияРаботы) 
	И Объект.ВариантЗавершения = Перечисления.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя;
	
КонецФункции

&НаСервере
Функция ЭтоНекачественныйЛид()
	
	Возврат ЗначениеЗаполнено(Объект.ПричинаНеуспешногоЗавершенияРаботы)
	ИЛИ Объект.ВариантЗавершения = Перечисления.ВариантЗавершенияРаботыСЛидом.НекачественныйЛид;
	
КонецФункции

&НаСервере
Процедура ОбновитьКнопкиПереводаКачественногоЛида()
	
	ЭтоНекачественныйЛид = ЭтоНекачественныйЛид();
	ЛидПереведенВПокупателя = ЛидПереведенВПокупателя();
	ЛидЗавершен = ЭтоНекачественныйЛид ИЛИ ЛидПереведенВПокупателя;
	
	Если АктивныеКнопкиПереводаЛида = Неопределено Тогда
		АктивныеКнопкиПереводаЛида = РаботаСЛидами.АктивныеКнопкиПереводаЛидаИзХранилища();
	КонецЕсли;
	
	Элементы.ПеревестиЛида.Видимость = Не ЛидЗавершен;
	Элементы.ПодменюПереводаЛида.Видимость = Не ЛидЗавершен;
	Элементы.ФормаПеревестиВПокупателя.Видимость = Ложь;
	Элементы.ФормаПеревестиВЗаказПокупателя.Видимость = Ложь;
	Элементы.ФормаПеревестиВЗаказНаряд.Видимость = Ложь;
	
	Если ЭтоИнтерфейсТакси Тогда
		Элементы.ФормаПеревестиВПокупателя.Заголовок = НСтр("ru = 'Покупателя'");
		Элементы.ФормаПеревестиВЗаказПокупателя.Заголовок = НСтр("ru = 'Заказ покупателя'");
		Элементы.ФормаПеревестиВЗаказНаряд.Заголовок = НСтр("ru = 'Заказ-наряд'");
	КонецЕсли;
	
	Если ЭтоПовторныйЛидНаСервере() Тогда
		
		Если ИспользоватьПодсистемуРаботы Тогда
			
			Элементы.ПодменюПереводаЛида.Видимость = Не ЛидЗавершен;
			
			Элементы.ФормаПеревестиВЗаказПокупателя.Видимость = Истина;
			Элементы.ФормаПеревестиВЗаказНаряд.Видимость = Истина;
			
			Если ЭтоИнтерфейсТакси Тогда
				Элементы.ФормаПеревестиВЗаказПокупателя.Заголовок = НСтр("ru = 'Заказ покупателя'");
				Элементы.ФормаПеревестиВЗаказНаряд.Заголовок = НСтр("ru = 'Заказ-наряд'");
			Иначе
				Элементы.ФормаПеревестиВЗаказПокупателя.Заголовок = НСтр("ru = 'Перевести в заказ покупателя'");
				Элементы.ФормаПеревестиВЗаказНаряд.Заголовок = НСтр("ru = 'Перевести в заказ-наряд'");
			КонецЕсли;
			
			КнопкаПереводаПовторногоЛида = АктивныеКнопкиПереводаЛида.КнопкаПереводаПовторногоЛида;
			Если КнопкаПереводаПовторногоЛида = "ЗаказНаряд" Тогда
				ЗаголовокКнопкиПеревода = НСтр("ru = 'Перевести в заказ-наряд'");
				Элементы.ФормаПеревестиВЗаказНаряд.Видимость = Ложь;
			Иначе
				ЗаголовокКнопкиПеревода = НСтр("ru = 'Перевести в заказ покупателя'");
				Элементы.ФормаПеревестиВЗаказПокупателя.Видимость = Ложь;
			КонецЕсли;
			
		Иначе
			
			Элементы.ПодменюПереводаЛида.Видимость = Ложь;
			СписокВыбораПереводаЛида.Очистить();
			
			ЗаголовокКнопкиПеревода = НСтр("ru = 'Перевести в заказ покупателя'");
			
		КонецЕсли;
		
		КонтрагентДоступен = Не ЗначениеЗаполнено(Контрагент) Или ЧтениеРазрешено(Контрагент);
		
		Элементы.ПеревестиЛида.Доступность = КонтрагентДоступен И Не ТолькоПросмотр;
		Элементы.ПодменюПереводаЛида.Доступность = КонтрагентДоступен И Не ТолькоПросмотр;
		
	Иначе
		
		Элементы.ПодменюПереводаЛида.Видимость = Не ЛидЗавершен;
		
		Элементы.ФормаПеревестиВПокупателя.Видимость = Истина;
		Элементы.ФормаПеревестиВЗаказПокупателя.Видимость = Истина;
		Если ИспользоватьПодсистемуРаботы Тогда
			Элементы.ФормаПеревестиВЗаказНаряд.Видимость = Истина;
		КонецЕсли;
		
		Если ЭтоИнтерфейсТакси Тогда
			Элементы.ФормаПеревестиВПокупателя.Заголовок = НСтр("ru = 'Покупателя'");
			Элементы.ФормаПеревестиВЗаказПокупателя.Заголовок = НСтр("ru = 'Покупателя + заказ'");
			Элементы.ФормаПеревестиВЗаказНаряд.Заголовок = НСтр("ru = 'Покупателя + заказ-наряд'");
		Иначе
			Элементы.ФормаПеревестиВПокупателя.Заголовок = НСтр("ru = 'Перевести в покупателя'");
			Элементы.ФормаПеревестиВЗаказПокупателя.Заголовок = НСтр("ru = 'Перевести в покупателя + заказ'");
			Элементы.ФормаПеревестиВЗаказНаряд.Заголовок = НСтр("ru = 'Перевести в покупателя + заказ-наряд'");
		КонецЕсли;
		
		КнопкаПереводаПервичногоЛида = АктивныеКнопкиПереводаЛида.КнопкаПереводаПервичногоЛида;
		Если КнопкаПереводаПервичногоЛида = "ЗаказПокупателя" Тогда
			ЗаголовокКнопкиПеревода = НСтр("ru = 'Перевести в покупателя + заказ'");
			Элементы.ФормаПеревестиВЗаказПокупателя.Видимость = Ложь;
		ИначеЕсли КнопкаПереводаПервичногоЛида = "ЗаказНаряд" И ИспользоватьПодсистемуРаботы Тогда
			ЗаголовокКнопкиПеревода = НСтр("ru = 'Перевести в покупателя + заказ-наряд'");
			Элементы.ФормаПеревестиВЗаказНаряд.Видимость = Ложь;
		Иначе
			ЗаголовокКнопкиПеревода = НСтр("ru = 'Перевести в покупателя'");
			Элементы.ФормаПеревестиВПокупателя.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ПеревестиЛида.Заголовок = ЗаголовокКнопкиПеревода;
	
	Элементы.НекачественныйЛид.Видимость = Не ЛидЗавершен;
	Элементы.ВернутьВРаботу.Видимость = ЭтоНекачественныйЛид;
	
КонецПроцедуры

#КонецОбласти

#Область ОбщегоНазначения

&НаСервере
Процедура УстановитьТекущуюСтраницуНаСервере(ГруппаСтраницы, ГруппаСтраница)
	
	ГруппаСтраницы.ТекущаяСтраница = ГруппаСтраница;
	
	Для Каждого Страница Из ГруппаСтраницы.ПодчиненныеЭлементы Цикл
		Страница.Видимость = Ложь;
	КонецЦикла;
	
	ГруппаСтраница.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСобытиеОснование(ТекущийОбъект)
	
	Если Не ЗначениеЗаполнено(СобытиеОснование) Или Не ЗаписьПовторногоЛидаИзОбычногоСобытия Тогда
		Возврат;
	КонецЕсли;
	
	СобытиеОбъект = СобытиеОснование.ПолучитьОбъект();
	Если СобытиеОбъект.Участники.Количество() Тогда
		СобытиеОбъект.Участники[0].Контакт = ТекущийОбъект.Ссылка;
	КонецЕсли;
	
	СобытиеОбъект.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияРеквизитовОбъектов(Знач Ссылка, Знач Реквизиты)
	
	Если СтрНайти(Реквизиты, ",") Тогда
		Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизиты);
	
КонецФункции

#КонецОбласти

#Область Заявки

&НаКлиенте
Процедура Заявка(ВидОперации)
	
	ОтветОтСервера = ЗаявкаНаСервере(ВидОперации);
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Лид", Объект.Ссылка);
	ПараметрыМетода.Вставить("ВидОперации", ВидОперации);
	ПараметрыМетода.Вставить("ПроверитьЗаписьЛида");
	ПараметрыМетода.Вставить("Форма", ЭтотОбъект);
	ПараметрыМетода.Вставить("ЗаявкиИспользуются", ОтветОтСервера.ЗаявкиИспользуются);
	ПараметрыМетода.Вставить("ИспользоватьВидыЗаказов", ОтветОтСервера.ИспользоватьВидыЗаказов);
	ПараметрыМетода.Вставить("Модифицированность", Модифицированность);
	РаботаСЗаявкамиКлиент.СозданиеЗаявкиНаЛидаАсинх(ПараметрыМетода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеВПрограммеПриИзменении()
	
	Если НЕ ПроверятьПредставлениеНаДубли Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.Наименование)) Тогда
		Элементы.ПредставлениеВПрограмме.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Возврат;
	КонецЕсли;
	
	НаименованиеДляПоискаДублей = НаименованиеДляПоискаДублей(Объект.Наименование);
	ПроверитьНаДубли("Наименование");
	
КонецПроцедуры

&НаКлиенте
Процедура ДублиПоПредставлениюНажатие()
	
	ПараметрыДублей = Новый Структура;
	
	ПараметрыДублей.Вставить("Наименование", НаименованиеДляПоискаДублей);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
	ОткрытьФорму("Справочник.Лиды.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаявкиНажатие(ВидОперации)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ОтветОтПользователя = Ждать ВопросАсинх(
		НСтр("ru = 'Данные еще не записаны.
		|Переход к заявкам возможен только после записи данных.
		|Данные будут записаны.'"),
		РежимДиалогаВопрос.ОКОтмена);
		
		Если ОтветОтПользователя <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Записать() Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	РаботаСЛидамиКлиент.ОткрытьЗаявкиПоЛиду(Объект.Ссылка, ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсеЗаявкиВРаботеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Заявки = ОтменитьВсеЗаявкиВРаботеНаСервере(Результат);
	Если Заявки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("Запись_ЗаказПокупателя", Заявки);
	Для Каждого Заявка Из Заявки Цикл
		ОповеститьОбИзменении(Заявка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОтменитьВсеЗаявкиВРаботеНаСервере(Знач ДанныеОтмены)
	
	Заявки = РаботаСЛидами.ОтменитьВсеЗаявкиЛидаВРаботе(Объект.Ссылка, ДанныеОтмены);
	ОбновитьИнтерфейсГруппыЗаявок();
	Возврат Заявки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПараметрыВопросаПередПереводомЛидаНаСервере(Знач Лид)
	
	Результат = Новый Структура;
	Результат.Вставить("НаличиеЗаявок", РаботаСЗаявками.НаличиеЗаявокВРаботеПоЛидуПоВидуОперации(Лид));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаявкаНаСервере(Знач ВидОперации)
	
	Результат = Новый Структура;
	
	ЗаявкиИспользуются = РаботаСЗаявками.ЗаявкиИспользуются(, ВидОперации);
	Результат.Вставить("ЗаявкиИспользуются", ЗаявкиИспользуются);
	
	Если ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу Тогда
		ИспользоватьВидыЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей");
	Иначе
		ИспользоватьВидыЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов");
	КонецЕсли;
	
	Результат.Вставить("ИспользоватьВидыЗаказов", ИспользоватьВидыЗаказов);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьОтображениеКнопокЗаявок()
	
	Элементы.ПодменюЗаявки.Видимость = ИспользоватьПодсистемуРаботы;
	Элементы.ФормаЗаявкаЗаказПокупателяОтдельная.Видимость = Не ИспользоватьПодсистемуРаботы;
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеПредставления

&НаКлиенте
Процедура ОбработкаОповещенияВыбораНаименования(ЗначениеВыбора, ДопПараметры) Экспорт
	Объект.Наименование = ЗначениеВыбора.Значение;
КонецПроцедуры

#КонецОбласти

#Область Теги

&НаКлиенте
Процедура Подключаемый_ДобавитьВведенныйТегТекст()
	
	ДобавитьВведенныйТегСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДобавитьВведенныйТег()
	
	Если ДобавлениеТега = Ложь Тогда
		Возврат;
	КонецЕсли; 
	
	ДобавлениеТега = Ложь;
	ДобавитьВведенныйТегСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВведенныйТегСервер()
	
	ТегированиеОбъектов.ДобавитьВведенныйТег(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область КонтактнаяИнформацияУНФ

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыКонтактаЛида(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц();
	СоздатьОбновитьКарточкиКИ();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыЛидов.ПервичноеОбращение") Тогда
		СтрокаКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если СтрокаКИ.ТипОтображаемыхДанных = "КонтактноеЛицо" Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Ключ", СтрокаКИ.ВладелецКИ); 
			СтруктураПараметров.Вставить("БлокироватьВидимостьКодаВладельца", Истина); 
			Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыКонтактаЛида", ЭтотОбъект);
			ОткрытьФорму("Справочник.КонтактыЛидов.Форма.ФормаЭлемента", СтруктураПараметров, ЭтотОбъект,,,, Оповещение);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтактКакСвязаться()
	
	Если КонтактКакСвязаться.ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		ВидКИ = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EmailКомпанииЛида");
	ИначеЕсли КонтактКакСвязаться.ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ВидКИ = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонКомпанииЛида");
	КонецЕсли;
	Если ВидКИ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = КонтактКакСвязаться.Контакт;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.НаименованиеКомпании) Тогда
		Объект.НаименованиеКомпании = КонтактКакСвязаться.Контакт;
		ЗаполнитьСписокВыбораНаименования(ЭтотОбъект);
	КонецЕсли;
	
	ДанныеКИ = Новый Структура;
	ДанныеКИ.Вставить("Представление", КонтактКакСвязаться.КакСвязаться);
	ДанныеКИ.Вставить("Вид", ВидКИ);
	ДанныеКИ.Вставить("ИмяЭлементаДляРазмещения", Элементы.КонтактнаяИнформация.Имя);
	УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформациюНаФорму(ЭтотОбъект, Объект, ДанныеКИ);
	
	ПроверитьКонтрагентаНаДублиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияКонтактногоЛицаПриИзменении(Элемент)
	
	ОписаниеРеквизита = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Элемент.Имя);
	Если ОписаниеРеквизита = Неопределено И СтрНачинаетсяС(НРег(Элемент.Имя), НРег("Комментарий")) Тогда
		ИмяЭлемента = Прав(Элемент.Имя, СтрДлина(Элемент.Имя) - СтрДлина("Комментарий"));
		ОписаниеРеквизита = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, ИмяЭлемента);
	КонецЕсли;
	
	Если ОписаниеРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлементаДляРазмещения = ОписаниеРеквизита.ИмяЭлементаДляРазмещения;
	Если ИмяЭлементаДляРазмещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ИмяЭлементаДляРазмещения, "КонтактнаяИнформацияКонтакт_") = 0 Тогда
		// Поле контактной информации контрагента.
		Возврат;
	КонецЕсли;
	
	Индекс = СтрЗаменить(ИмяЭлементаДляРазмещения, "КонтактнаяИнформацияКонтакт_", "");
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Индекс) Тогда
		ДанныеКонтактныхЛиц[Число(Индекс)].Изменен = Истина;
	КонецЕсли;
	
	КонтактнаяИнформацияКонтактногоЛицаПриИзмененииСервер(Элемент.Имя, Индекс);
	
КонецПроцедуры

&НаСервере
Процедура КонтактнаяИнформацияКонтактногоЛицаПриИзмененииСервер(ИмяЭлемента, ИндексКЛ)
	
	ЭтоРедактированиеПоляКИ = Не СтрНачинаетсяС(НРег(ИмяЭлемента), НРег("Комментарий"));
	Если ЭтоРедактированиеПоляКИ Тогда
		
		ОписаниеКИ = УправлениеКонтактнойИнформациейУНФ.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, ИмяЭлемента);
		
		ДанныеКИ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеКИ);
		ИндексыКИ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИндексКЛ);
		ПроверитьКИНаДубли(ДанныеКИ, ИндексыКИ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КонтактнаяИнформацияПриИзменении(ИмяЭлемента)
	
	ЭтоРедактированиеПоляКИ = Не СтрНачинаетсяС(НРег(ИмяЭлемента), НРег("Комментарий"));
	Если ЭтоРедактированиеПоляКИ Тогда
		
		ОписаниеКИ = УправлениеКонтактнойИнформациейУНФ.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, ИмяЭлемента);
		
		ДанныеКИ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеКИ);
		ИндексыКИ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Неопределено);
		ПроверитьКИНаДубли(ДанныеКИ, ИндексыКИ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросДобавлениеКонтактов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Ок Тогда
		
		Записать();
		
		Возврат;
		
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КонтактыЛида

&НаСервере
Процедура СоздатьОбновитьКарточкиКИ() 

	ОсновнаяТаблицаСоздана = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "ДанныеПанелиКонтактнойИнформации");
	Если ОсновнаяТаблицаСоздана = Ложь Тогда
		КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "ГруппаКонтактыЛида",, Истина);
		
		НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
		ГруппаИли = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ГруппаИЛИ");
	
		РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
			ГруппаИли, "ДанныеПанелиКонтактнойИнформации.ТипОтображаемыхДанных", "КонтактноеЛицо", ВидСравненияКомпоновкиДанных.Равно); 
		
		РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
			ГруппаИли, "ДанныеПанелиКонтактнойИнформации.ТипОтображаемыхДанных", "НетДанных", ВидСравненияКомпоновкиДанных.Равно); 
		
		ОформляемыеПоля = Новый Массив; 
		ОформляемыеПоля.Добавить("ДанныеПанелиКонтактнойИнформацииОтображениеТипаКИ");
		РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
		РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);
		
	КонецЕсли;
	
	Элементы.ДанныеПанелиКонтактнойИнформации.ЧередованиеЦветовСтрок = Ложь;
	Элементы.ДанныеПанелиКонтактнойИнформации.ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.ИспользоватьВсегда;
	
	КоличествоКонтактовГруппа = 0;

	Если Объект.Вид = Перечисления.ВидыЛидов.ПервичноеОбращение Тогда
		Элементы.Переместить(Элементы.ДанныеПанелиКонтактнойИнформации, Элементы.ГруппаКонтактыЛида);
		ДанныеПанелиКИ = КонтактнаяИнформацияПанельУНФ.ДанныеПанелиКонтактнойИнформации(Объект.Ссылка); 
		
		ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Очистить();
		Для Каждого Строка Из ДанныеПанелиКИ Цикл     
			Если Строка.ВладелецКИ = Объект.Ссылка Тогда
				Продолжить;
			КонецЕсли; 
				
			Если ТипЗнч(Строка.ВладелецКИ) = Тип("СправочникСсылка.КонтактыЛидов") И ЗначениеЗаполнено(Строка.ВладелецКИ) Тогда			
				Пометка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.ВладелецКИ,"ПометкаУдаления");
				Если Пометка = Истина Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);  
			Если Строка.ТипОтображаемыхДанных = "КонтактноеЛицо" Тогда
				НоваяСтрока.ИндексПиктограммы = 3;
				КоличествоКонтактовГруппа = КоличествоКонтактовГруппа + 1;
			КонецЕсли;
		КонецЦикла;
		Элементы.ГруппаКонтактыЛида.Родитель.Заголовок = НСтр("ru = 'Контакты ('") + КоличествоКонтактовГруппа + ")";
		
	Иначе
		//Элементы.Переместить(Элементы.ДанныеПанелиКонтактнойИнформации, Элементы.ГруппаКонтактыКонтрагента); 
		Элементы.Переместить(Элементы.ДанныеПанелиКонтактнойИнформации, Элементы.ГруппаКонтактыЗаголовок); 
		ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Очистить();
		ДанныеПанелиКИ = КонтактнаяИнформацияПанельУНФ.ДанныеПанелиКонтактнойИнформации(Контрагент); 
		
		ОсновнойПодписант = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "КонтактноеЛицо, КонтактноеЛицоПодписант");
		МассивУникальныхВладельцев = Новый Массив;
		
		Для Каждого Строка Из ДанныеПанелиКИ Цикл     
			Если Строка.ВладелецКИ = Контрагент Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(Строка.ВладелецКИ) И МассивУникальныхВладельцев.Найти(Строка.ВладелецКИ) = Неопределено И Строка.ВладелецКИ <> Объект.Ссылка Тогда
				МассивУникальныхВладельцев.Добавить(Строка.ВладелецКИ);	
			КонецЕсли;
			
			НоваяСтрока = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);  
			Если Строка.ТипОтображаемыхДанных = "КонтактноеЛицо" Тогда
				Если НоваяСтрока.ВладелецКИ = ОсновнойПодписант.КонтактноеЛицо И НоваяСтрока.ВладелецКИ = ОсновнойПодписант.КонтактноеЛицоПодписант Тогда            
					НоваяСтрока.Отображение = НоваяСтрока.Отображение + " (основной, подписант)";	
				ИначеЕсли НоваяСтрока.ВладелецКИ = ОсновнойПодписант.КонтактноеЛицо Тогда    
					НоваяСтрока.Отображение = НоваяСтрока.Отображение + " (основной)";						
				ИначеЕсли НоваяСтрока.ВладелецКИ = ОсновнойПодписант.КонтактноеЛицоПодписант Тогда	
					НоваяСтрока.Отображение = НоваяСтрока.Отображение + " (подписант)";						
				КонецЕсли;
			КонецЕсли;
			Если Строка.ТипОтображаемыхДанных = "КонтактноеЛицо" Тогда
				НоваяСтрока.ИндексПиктограммы = 3;	
				КоличествоКонтактовГруппа = КоличествоКонтактовГруппа + 1;				
			КонецЕсли;			
		КонецЦикла; 
		Элементы.ГруппаКонтактыКонтрагента.Заголовок = НСтр("ru = 'Контакты покупателя ('") + КоличествоКонтактовГруппа + ")";
		Элементы.ГруппаКонтактыЗаголовок.Заголовок = НСтр("ru = 'Контакты покупателя ('") + КоличествоКонтактовГруппа + ")";
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СвязиКонтрагентКонтактСрезПоследних.Должность КАК Должность,
		|	СвязиКонтрагентКонтактСрезПоследних.Контакт КАК Контакт
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(
		|			,
		|			Контрагент = &Контрагент
		|				И Контакт В (&МассивКонтактов)) КАК СвязиКонтрагентКонтактСрезПоследних";
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("МассивКонтактов", МассивУникальныхВладельцев);
		
		ВыборкаДолжность = Запрос.Выполнить().Выбрать();
		ЕстьДолжности = Ложь;
		Пока ВыборкаДолжность.Следующий() Цикл   
			Если ВыборкаДолжность.Должность = "" Тогда
				Продолжить;
			КонецЕсли;     
			СтрокиПорядокКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.НайтиСтроки(
				Новый Структура("ТипОтображаемыхДанных, ВладелецКИ", "КонтактноеЛицо", ВыборкаДолжность.Контакт));
			Если СтрокиПорядокКИ.Количество() = 0 Тогда	   
				Продолжить;
			КонецЕсли;  

			СтрокаКИ = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Вставить(ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Индекс(СтрокиПорядокКИ[0]) + 1);  
			СтрокаКИ.ВладелецКИ = ВыборкаДолжность.Контакт;
			СтрокаКИ.ТипОтображаемыхДанных = "ЗначениеКИ";
			СтрокаКИ.Отображение = "Должность: " + ВыборкаДолжность.Должность;
			СтрокаКИ.ИндексПиктограммы = -1;
			
		КонецЦикла;
	КонецЕсли;

	Для Каждого Строка Из ЭтотОбъект.ДанныеПанелиКонтактнойИнформации Цикл
		Если Строка.ТипОтображаемыхДанных <> "КонтактноеЛицо" Тогда
			Если СтрНайти(Строка.Отображение, ": ") > 0 И Строка.ОтображениеТипаКИ = "" Тогда
				Строка.ОтображениеТипаКИ = Лев(Строка.Отображение, СтрНайти(Строка.Отображение, ":"));	
				Строка.Отображение = Сред(Строка.Отображение, СтрНайти(Строка.Отображение, ":") + 2);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		
	
	Если КоличествоКонтактовГруппа = 0 И ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Количество() = 0 Тогда
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Отображение", НСтр("ru='<Нет контактных данных>'"));
		НоваяСтрока.Вставить("ИндексПиктограммы", -1);
		НоваяСтрока.Вставить("ТипОтображаемыхДанных", "НетДанных");
		НоваяСтрока.Вставить("ВладелецКИ", Неопределено);
		СтрокаНетКД = ЭтотОбъект.ДанныеПанелиКонтактнойИнформации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНетКД, НоваяСтрока);
	КонецЕсли;
	
	Элементы.ПоказатьПомеченныеНаУдалениеКонтакты.Видимость = ЕстьУдаленныеКонтакты();
	
КонецПроцедуры

&НаСервере
Функция ЕстьУдаленныеКонтакты()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактыЛидов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтактыЛидов КАК КонтактыЛидов
	|ГДЕ
	|	КонтактыЛидов.ПометкаУдаления
	|	И Владелец = &ТекущийЛид";
	
	Запрос.УстановитьПараметр("ТекущийЛид", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

&НаСервере
Процедура ЗаписатьДанныеКонтактныхЛиц(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПредыдущееЗначениеВида = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Вид");
	
	Если ТекущийОбъект.Вид = Перечисления.ВидыЛидов.ПовторноеОбращение Тогда
		
		Если ПредыдущееЗначениеВида = Перечисления.ВидыЛидов.ПовторноеОбращение Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ДанныеКЛ Из ДанныеКонтактныхЛиц Цикл
			
			Если Не ЗначениеЗаполнено(ДанныеКЛ.КонтактноеЛицо) Тогда
				Продолжить;
			КонецЕсли;
			
			РегистрыСведений.СвязиАдресатКонтактCRM.ОчиститьСвязи(ДанныеКЛ.КонтактноеЛицо);
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Если ПредыдущееЗначениеВида = Перечисления.ВидыЛидов.ПовторноеОбращение Тогда
		
		Для Каждого ДанныеКЛ Из ДанныеКонтактныхЛиц Цикл
			
			Если Не ЗначениеЗаполнено(ДанныеКЛ.КонтактноеЛицо) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлектроннаяПочтаУНФ.СвязатьКонтактCRMСАдресатами(ДанныеКЛ.КонтактноеЛицо.ПолучитьОбъект());
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ДанныеКЛ Из ДанныеКонтактныхЛиц Цикл
		
		Если ПустаяСтрока(ДанныеКЛ.Наименование) Тогда
			УдалитьНезаполненныйКонтакт(ДанныеКЛ);
			Продолжить;
		КонецЕсли;
		
		Если НЕ ДанныеКЛ.Изменен Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если ЗначениеЗаполнено(ДанныеКЛ.КонтактноеЛицо) Тогда
			КонтактноеЛицоОбъект = ДанныеКЛ.КонтактноеЛицо.ПолучитьОбъект();
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеКЛ.КонтактноеЛицо) ИЛИ КонтактноеЛицоОбъект = Неопределено Тогда
			// Создание
			КонтактноеЛицоОбъект = Справочники.КонтактыЛидов.СоздатьЭлемент();
		КонецЕсли;
		
		КонтактноеЛицоОбъект.Владелец = ТекущийОбъект.Ссылка;
		// Внесение изменений
		ЗаполнитьЗначенияСвойств(КонтактноеЛицоОбъект, ДанныеКЛ, "Наименование");
		
		// Запись объекта
		КонтактноеЛицоОбъект.Записать();
		
		// Сохранение ссылки на созданный объект
		ДанныеКЛ.КонтактноеЛицо = КонтактноеЛицоОбъект.Ссылка;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИОбновитьКонтактныеЛица()
	
	ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц()
	
	ДанныеКонтактныхЛиц.Очистить();
	
	Отбор = Новый Структура("ПометкаУдаления");
	Упорядочивание = Новый Структура("Код,Наименование");
	КонтактныеЛица = Справочники.КонтактыЛидов.КонтактыЛида(Объект.Ссылка, Отбор, Упорядочивание);
	
	Для Каждого КонтактноеЛицо Из КонтактныеЛица Цикл
		
		ДанныеКЛ = ДанныеКонтактныхЛиц.Добавить();
		ДанныеКЛ.КонтактноеЛицо = КонтактноеЛицо.Ссылка;
		ЗаполнитьЗначенияСвойств(ДанныеКЛ, КонтактноеЛицо, "Ссылка,Наименование");
		
		Для Каждого КИ Из КонтактноеЛицо.КонтактнаяИнформация Цикл
			ДанныеКИ = ДанныеКЛ.КонтактнаяИнформация.Добавить();
			ЗаполнитьЗначенияСвойств(ДанныеКИ, КИ, "Вид,Тип,Представление,Значение");
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеКонтактныхЛиц(Отказ)
	
	// Проверка на заполненность ФИО контактного лица, если введена контактная информация
	Для Каждого ДанныеКонтактногоЛица Из ДанныеКонтактныхЛиц Цикл
		
		Если Не ПустаяСтрока(ДанныеКонтактногоЛица.Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = "ДанныеКонтактныхЛиц[" + ДанныеКонтактныхЛиц.Индекс(ДанныеКонтактногоЛица) + "].Наименование";
		Для Каждого СтрокаТаблицы Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(
				Новый Структура("ИмяЭлементаДляРазмещения",ДанныеКонтактногоЛица.ИмяЭлементаДляРазмещения)) Цикл   
			Если СтрНайти(СтрокаТаблицы.ИмяРеквизита, "КонтактнаяИнформацияКонтакт_") = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если Не ПустаяСтрока(СтрокаТаблицы.Значение) Или Не ПустаяСтрока(СтрокаТаблицы.Представление) Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'ФИО контакта не заполнено.'"),,,ИмяРеквизита, Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНезаполненныйКонтакт(ДанныеКЛ)
	
	Если НЕ ЗначениеЗаполнено(ДанныеКЛ.КонтактноеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	КИНезаполнено = 0;
	Для Каждого ДанныеКИ Из ДанныеКЛ.КонтактнаяИнформация Цикл
		Если ЗначениеЗаполнено(ДанныеКИ.Значение) Тогда
			Продолжить;
		КонецЕсли;
		КИНезаполнено = КИНезаполнено + 1;
	КонецЦикла;
	
	Если КИНезаполнено <> ДанныеКЛ.КонтактнаяИнформация.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	КонтактноеЛицоОбъект = ДанныеКЛ.КонтактноеЛицо.ПолучитьОбъект();
	КонтактноеЛицоОбъект.ПометкаУдаления = Истина;	
	КонтактноеЛицоОбъект.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыКонтактов(Результат, ДополнительныеПараметры) Экспорт
	Прочитать();
	СоздатьОбновитьКарточкиКИ();
КонецПроцедуры

&НаСервере
Процедура ОбработатьКонтактыЛидаПередЗаписьюНаСервере(ТекущийОбъект)
	
	Если Не ЭтоПервичныйЛидНаСервере() Тогда
		Возврат;
	КонецЕсли;
	
	НомераТелефонов = Новый Массив;
	АдресаЭП = Новый Массив;
	
	Для Каждого СтрокаКЛ Из ДанныеКонтактныхЛиц Цикл
		Для Каждого СтрокаКИ Из СтрокаКЛ.КонтактнаяИнформация Цикл
			Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И Не ПустаяСтрока(СтрокаКИ.Представление) Тогда
				НомераТелефонов.Добавить(СтрЗаменить(КонтактнаяИнформацияУНФ.ПреобразоватьТелефонДляПоиска(СтрокаКИ.Представление), "+", ""));
			КонецЕсли;
			Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты И Не ПустаяСтрока(СтрокаКИ.Представление) Тогда
				АдресаЭП.Добавить(СтрокаКИ.Представление);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НомераТелефоновКонтактаЛида", НомераТелефонов);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("АдресаЭПКонтактовЛида", АдресаЭП);
	
	// Заполним информацию о записываемых контактных лицах для реквизита "ОсновныеСведения"
	ТаблицаКонтактнойИнформацииКонтактныхЛиц = КонтактнаяИнформацияУНФ.ПолучитьТаблицуКонтактнойИнформацииКонтактныхЛиц(ЭтотОбъект, Объект.Ссылка);
	ИндексКонтактногоЛица = 0;	   
	
	МассивСтрок = Новый Массив;
	Для Каждого ДанныеКЛ Из ДанныеКонтактныхЛиц Цикл
		
		Если ПустаяСтрока(ДанныеКЛ.Наименование) Тогда
			ИндексКонтактногоЛица = ИндексКонтактногоЛица + 1;			
			Продолжить;
		КонецЕсли;
		
		Если МассивСтрок.Количество() > 0 Тогда
			МассивСтрок.Добавить(Символы.ПС);
		КонецЕсли;
		
		МассивСтрок.Добавить(ДанныеКЛ.Наименование);
		
		Если ЗначениеЗаполнено(ДанныеКЛ.КонтактноеЛицо) Тогда
			СтрокиКонтактнойИнформации = ТаблицаКонтактнойИнформацииКонтактныхЛиц.НайтиСтроки(Новый Структура("КонтактноеЛицо", ДанныеКЛ.КонтактноеЛицо)); 
		Иначе
			СтрокиКонтактнойИнформации = ТаблицаКонтактнойИнформацииКонтактныхЛиц.НайтиСтроки(Новый Структура("ИндексКонтактногоЛица", 
					?(ИндексКонтактногоЛица = 0, "0", Формат(ИндексКонтактногоЛица, "ЧГ="))));
		КонецЕсли;      
		
		Для Каждого ДанныеКИ Из СтрокиКонтактнойИнформации Цикл
			Если ПустаяСтрока(ДанныеКИ.Представление) Тогда
				Продолжить;
			КонецЕсли;
			МассивСтрок.Добавить(ДанныеКИ.Представление);
		КонецЦикла;
		
		ИндексКонтактногоЛица = ИндексКонтактногоЛица + 1;

	КонецЦикла; 
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ОсновныеСведенияКонтактныхЛиц", МассивСтрок);
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольДублей

&НаСервере
Процедура УстановитьНастройкиКонтроляДублей()
	
	Элементы.ПредставлениеВПрограмме.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	Элементы.НаименованиеКомпании.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	
	НастройкиКонтроляДублейЛиды = Константы.НастройкиКонтроляДублейЛиды.Получить().Получить();
	
	Если НастройкиКонтроляДублейЛиды <> Неопределено Тогда
		ПроверятьПредставлениеНаДубли = НастройкиКонтроляДублейЛиды.Получить("ПроверятьНаименование");
		ПроверятьЮрНазваниеНаДубли = НастройкиКонтроляДублейЛиды.Получить("ПроверятьЮрНазвание");
		ПроверятьНомерТелефонаНаДубли = НастройкиКонтроляДублейЛиды.Получить("ПроверятьТелефон");
		ПроверятьАдресЭПНаДубли = НастройкиКонтроляДублейЛиды.Получить("ПроверятьАдресЭП");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаДубли(Реквизит)
	
	Если Реквизит = "НаименованиеКомпании" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.НаименованиеКомпании) Тогда
			Возврат;
		КонецЕсли;
		
		НаименованиеКомпанииДляПоискаДублей = НаименованиеДляПоискаДублей(
		ОрганизационноПравоваяФорма.НаименованиеБезОПФ);
		
	КонецЕсли;

	Если Реквизит = "Наименование" Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
			Возврат;
		КонецЕсли;
		НаименованиеДляПоискаДублей = НаименованиеДляПоискаДублей(Объект.Наименование);
	КонецЕсли;
	
	ЗапросКонтрагенты = Новый Запрос;
	ЗапросКонтрагенты.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	(Контрагенты.НаименованиеПолное ПОДОБНО &Наименование
	|			ИЛИ Контрагенты.Наименование ПОДОБНО &Наименование)
	|	И НЕ Контрагенты.ЭтоГруппа";
	
	ЗапросКонтрагенты.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
	ЗапросКонтрагенты.УстановитьПараметр("Ссылка", Объект.Ссылка);
	УстановитьПривилегированныйРежим(Истина);
	Результат = ЗапросКонтрагенты.Выполнить();
			
	Если Результат.Пустой() Тогда
		
		ЗапросКонтакты = Новый Запрос;
		ЗапросКонтакты.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК Контакты
		|ГДЕ
		|	Контакты.Наименование ПОДОБНО &Наименование
		|	И НЕ Контакты.ЭтоГруппа";
		
		ЗапросКонтакты.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
		Результат = ЗапросКонтакты.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			ЗапросЛиды = Новый Запрос;
			ЗапросЛиды.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Лиды.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Лиды КАК Лиды
			|ГДЕ
			|	НЕ Лиды.Ссылка = &Ссылка
			|	И НЕ Лиды.ЭтоГруппа
			|	И Лиды.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя)
			|	И Лиды.Вид <> ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
			|	И (Лиды.Наименование ПОДОБНО &Наименование
			|			ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование)";
			
			Если Реквизит = "Наименование" Тогда
				
				ЗапросЛиды.Текст = СтрЗаменить(ЗапросЛиды.Текст,
				"	И Лиды.Вид <> ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
				|	И (Лиды.Наименование ПОДОБНО &Наименование
				|			ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование)",
				"	И ВЫБОР
				|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
				|				ТОГДА Лиды.Наименование ПОДОБНО &Наименование
				|			ИНАЧЕ Лиды.Наименование ПОДОБНО &Наименование
				|					ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование
				|		КОНЕЦ");
				
			КонецЕсли;
			
			ЗапросЛиды.УстановитьПараметр("Ссылка", Объект.Ссылка);
			ЗапросЛиды.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
			Результат = ЗапросЛиды.Выполнить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДублиНайдены = Не Результат.Пустой();
	Если ДублиНайдены Тогда
		ОтображениеПодсказкиЭлемента = ОтображениеПодсказки.ОтображатьСнизу;
	Иначе
		ОтображениеПодсказкиЭлемента = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	Если Реквизит = "НаименованиеКомпании" Тогда
		Элементы.НаименованиеКомпании.ОтображениеПодсказки = ОтображениеПодсказкиЭлемента;
	ИначеЕсли Реквизит = "Наименование" Тогда
		Элементы.ПредставлениеВПрограмме.ОтображениеПодсказки = ОтображениеПодсказкиЭлемента;
	Иначе
		Элементы["Дубли"+Реквизит].Видимость = ДублиНайдены;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаименованиеКонтактаНаДубли(ИндексыКЛ)
	
	Индекс = 0;
	КоличествоЭлементов = ИндексыКЛ.Количество();
	Пока Индекс < КоличествоЭлементов Цикл
		
		ИндексКЛ = ИндексыКЛ[Индекс];
		ПредставлениеКонтакта = ДанныеКонтактныхЛиц[ИндексКЛ].Наименование;
		
		Если НЕ ЗначениеЗаполнено(ПредставлениеКонтакта) Тогда
			ИндексыКЛ.Удалить(Индекс);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Продолжить;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Если КоличествоЭлементов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	РазделительПакетаЗапросов = ОбщегоНазначения.РазделительПакетаЗапросов();
	Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
		
		ИндексКЛ = ИндексыКЛ[Индекс];
		НаименованиеДляПоиска = НаименованиеДляПоискаДублей(ДанныеКонтактныхЛиц[ИндексКЛ].Наименование);
		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование ПОДОБНО &Наименование";
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, "&Наименование", СтрШаблон("&Наименование%1", Индекс));
		
		Запрос.Текст = СтрШаблон(
		"%1%2%3",
		Запрос.Текст,
		ТекстЗапроса,
		РазделительПакетаЗапросов);
		
		Запрос.УстановитьПараметр(СтрШаблон("Наименование%1", Индекс), НаименованиеДляПоиска);
		
	КонецЦикла;
	
	ОбработатьЗапросДублейНаименованийКонтактов(Запрос, ИндексыКЛ);
	КоличествоЭлементов = ИндексыКЛ.Количество();
	Если КоличествоЭлементов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	РазделительПакетаЗапросов = ОбщегоНазначения.РазделительПакетаЗапросов();
	Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
		
		ИндексКЛ = ИндексыКЛ[Индекс];
		НаименованиеДляПоиска = НаименованиеДляПоискаДублей(ДанныеКонтактныхЛиц[ИндексКЛ].Наименование);
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	Контакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК Контакты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(, ) КАК СвязиКонтрагентКонтакт
		|		ПО (СвязиКонтрагентКонтакт.Контакт = Контакты.Ссылка)
		|ГДЕ
		|	НЕ СвязиКонтрагентКонтакт.Контрагент = &Ссылка
		|	И НЕ Контакты.Ссылка = &Контакт
		|	И СвязиКонтрагентКонтакт.СвязьНедействительна = ЛОЖЬ
		|	И Контакты.Наименование ПОДОБНО &Наименование";
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, "&Наименование", СтрШаблон("&Наименование%1", Индекс));
		
		Запрос.Текст = СтрШаблон(
		"%1%2%3",
		Запрос.Текст,
		ТекстЗапроса,
		РазделительПакетаЗапросов);
		
		Запрос.УстановитьПараметр(СтрШаблон("Наименование%1", Индекс), НаименованиеДляПоиска);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("Контакт", ДанныеКонтактныхЛиц[ИндексКЛ].КонтактноеЛицо);
		
	КонецЦикла;
	
	ОбработатьЗапросДублейНаименованийКонтактов(Запрос, ИндексыКЛ);
	КоличествоЭлементов = ИндексыКЛ.Количество();
	Если КоличествоЭлементов = 0  Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	РазделительПакетаЗапросов = ОбщегоНазначения.РазделительПакетаЗапросов();
	Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
		
		ИндексКЛ = ИндексыКЛ[Индекс];
		НаименованиеДляПоиска = НаименованиеДляПоискаДублей(ДанныеКонтактныхЛиц[ИндексКЛ].Наименование);
		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лиды.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|ГДЕ
		|	НЕ Лиды.Ссылка = &Ссылка
		|	И Лиды.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя)
		|	И ВЫБОР
		|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
		|				ТОГДА Лиды.Наименование ПОДОБНО &Наименование
		|			ИНАЧЕ Лиды.Наименование ПОДОБНО &Наименование
		|					ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование
		|		КОНЕЦ";
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, "&Наименование", СтрШаблон("&Наименование%1", Индекс));
		
		Запрос.Текст = СтрШаблон(
		"%1%2%3",
		Запрос.Текст,
		ТекстЗапроса,
		РазделительПакетаЗапросов);
		
		Запрос.УстановитьПараметр(СтрШаблон("Наименование%1", Индекс), НаименованиеДляПоиска);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	КонецЦикла;
	
	ОбработатьЗапросДублейНаименованийКонтактов(Запрос, ИндексыКЛ);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗапросДублейНаименованийКонтактов(Запрос, ИндексыКЛ)
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	Индекс = 0;
	КоличествоЭлементов = ИндексыКЛ.Количество();
	Пока Индекс < КоличествоЭлементов Цикл
		
		РезультатЗапроса = РезультатыЗапросов[Индекс];
		ИндексКЛ = ИндексыКЛ[Индекс];
		
		ЕстьДубли = Не РезультатЗапроса.Пустой();
		ПоказатьСкрытьНадписьОДубляхНаименованияКЛ(ИндексКЛ, ЕстьДубли);
		
		Если Не ЕстьДубли Тогда
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;
		
		ИндексыКЛ.Удалить(Индекс);
		КоличествоЭлементов = КоличествоЭлементов - 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьНадписьОДубляхНаименованияКЛ(ИндексКЛ, ЕстьДубли)
	
	Если НЕ ЕстьДубли Тогда
		
		ЭлементКЛ = Элементы.Найти("СообщениеОДубляхКЛ_"+ Строка(ИндексКЛ));
		Если ЭлементКЛ <> Неопределено Тогда
			Элементы.Удалить(ЭлементКЛ);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	СообщениеОДублях = Элементы.Найти("СообщениеОДубляхКЛ_"+ Строка(ИндексКЛ));
	Если СообщениеОДублях = Неопределено Тогда
		СообщениеОДублях = Элементы.Добавить("СообщениеОДубляхКЛ_" + Строка(ИндексКЛ), Тип("ДекорацияФормы"), Элементы["Контакт_" + ИндексКЛ]);
	КонецЕсли;
	
	СообщениеОДублях.Заголовок = НСтр("ru = 'Найдены дубли по представлению'");
	СообщениеОДублях.Гиперссылка = Истина;
	СообщениеОДублях.УстановитьДействие("Нажатие", "Подключаемый_СообщениеОДубляхКЛНажатие");
	Элементы.Переместить(СообщениеОДублях, Элементы["Контакт_" + ИндексКЛ], Элементы["КонтактнаяИнформацияКонтакт_" + ИндексКЛ]);
	СообщениеОДублях.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКИНаДубли(ДанныеВсехКИ, ИндексыКЛ)
	
	Индекс = 0;
	КоличествоЭлементов = ДанныеВсехКИ.Количество();
	Пока Индекс < КоличествоЭлементов Цикл
		
		ДанныеКИ = ДанныеВсехКИ[Индекс];
		ИндексКЛ = ИндексыКЛ[Индекс];
		
		Если НЕ ЗначениеЗаполнено(ДанныеКИ.Представление) И ДублиКИ.Количество() <> 0 Тогда
			УдалитьНеактивныеДублиИЭлементы(ИндексКЛ);
			ДанныеВсехКИ.Удалить(Индекс);
			ИндексыКЛ.Удалить(Индекс);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеКИ.Представление) Тогда
			ДанныеВсехКИ.Удалить(Индекс);
			ИндексыКЛ.Удалить(Индекс);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Продолжить;
		КонецЕсли;
		
		ТипКИАдресЭП = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		ТипКИНомер = Перечисления.ТипыКонтактнойИнформации.Телефон;
		
		Если ДанныеКИ.Тип <> ТипКИАдресЭП И ДанныеКИ.Тип <> ТипКИНомер Тогда
			ДанныеВсехКИ.Удалить(Индекс);
			ИндексыКЛ.Удалить(Индекс);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Продолжить;
		КонецЕсли;
		
		Если ДанныеКИ.Тип = ТипКИАдресЭП И НЕ ПроверятьАдресЭПНаДубли Тогда
			ДанныеВсехКИ.Удалить(Индекс);
			ИндексыКЛ.Удалить(Индекс);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Продолжить;
		КонецЕсли;
		
		Если ДанныеКИ.Тип = ТипКИНомер И НЕ ПроверятьНомерТелефонаНаДубли Тогда
			ДанныеВсехКИ.Удалить(Индекс);
			ИндексыКЛ.Удалить(Индекс);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Продолжить;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Если КоличествоЭлементов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	РазделительПакетаЗапросов = ОбщегоНазначения.РазделительПакетаЗапросов();
	Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
		
		ДанныеКИ = ДанныеВсехКИ[Индекс];
		ПоисковоеВыражение = ДанныеКИ.Представление;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.АдресЭПДляПоиска ПОДОБНО &ПредставлениеКИ
		|	И НЕ Контрагенты.ЭтоГруппа";
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, "&ПредставлениеКИ", СтрШаблон("&ПредставлениеКИ%1", Индекс));
		
		Если ДанныеКИ.Тип = ТипКИНомер Тогда
			
			ПоисковоеВыражение = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(ДанныеКИ.Представление);
			ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "+", "");
			Если СтрНачинаетсяС(ПоисковоеВыражение, "7") Тогда
				ПоисковоеВыражение = Сред(ПоисковоеВыражение, 2, СтрДлина(ПоисковоеВыражение) - 1);
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АдресЭП", "НомерТелефона");
			
		КонецЕсли;
		
		Запрос.Текст = СтрШаблон(
		"%1%2%3",
		Запрос.Текст,
		ТекстЗапроса,
		РазделительПакетаЗапросов);
		
		Запрос.УстановитьПараметр(СтрШаблон("ПредставлениеКИ%1", Индекс), "%" + ПоисковоеВыражение + "%");
		
	КонецЦикла;
	
	ОбработатьЗапросДублейКИ(Запрос, ДанныеВсехКИ, ИндексыКЛ);
	КоличествоЭлементов = ДанныеВсехКИ.Количество();
	Если КоличествоЭлементов = 0  Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
		
		ДанныеКИ = ДанныеВсехКИ[Индекс];
		ПоисковоеВыражение = ДанныеКИ.Представление;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК Контакты
		|ГДЕ
		|	Контакты.АдресЭПДляПоиска ПОДОБНО &ПредставлениеКИ
		|	И НЕ Контакты.ЭтоГруппа";
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, "&ПредставлениеКИ", СтрШаблон("&ПредставлениеКИ%1", Индекс));
		
		Если ДанныеКИ.Тип = ТипКИНомер Тогда
			
			ПоисковоеВыражение = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(ДанныеКИ.Представление);
			ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "+", "");
			Если СтрНачинаетсяС(ПоисковоеВыражение, "7") Тогда
				ПоисковоеВыражение = Сред(ПоисковоеВыражение, 2, СтрДлина(ПоисковоеВыражение) - 1);
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АдресЭП", "НомерТелефона");
			
		КонецЕсли;
		
		Запрос.Текст = СтрШаблон(
		"%1%2%3",
		Запрос.Текст,
		ТекстЗапроса,
		РазделительПакетаЗапросов);
		
		Запрос.УстановитьПараметр(СтрШаблон("ПредставлениеКИ%1", Индекс), "%" + ПоисковоеВыражение + "%");
		
	КонецЦикла;
	
	ОбработатьЗапросДублейКИ(Запрос, ДанныеВсехКИ, ИндексыКЛ);
	КоличествоЭлементов = ДанныеВсехКИ.Количество();
	Если КоличествоЭлементов = 0  Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
		
		ДанныеКИ = ДанныеВсехКИ[Индекс];
		ПоисковоеВыражение = ДанныеКИ.Представление;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лиды.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
		|ГДЕ
		|	НЕ Лиды.Ссылка = &Ссылка
		|	И НЕ Лиды.ЭтоГруппа
		|	И Лиды.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя)
		|	И ВЫБОР
		|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
		|				ТОГДА ЕСТЬNULL(СвязиКонтрагентЛид.Контрагент.АдресЭПДляПоиска, Лиды.АдресЭПДляПоиска)
		|			ИНАЧЕ Лиды.АдресЭПДляПоиска
		|		КОНЕЦ ПОДОБНО &ПредставлениеКИ";
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, "&ПредставлениеКИ", СтрШаблон("&ПредставлениеКИ%1", Индекс));
		
		Если ДанныеКИ.Тип = ТипКИНомер Тогда
			
			ПоисковоеВыражение = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(ДанныеКИ.Представление);
			ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "+", "");
			Если СтрНачинаетсяС(ПоисковоеВыражение, "7") Тогда
				ПоисковоеВыражение = Сред(ПоисковоеВыражение, 2, СтрДлина(ПоисковоеВыражение) - 1);
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АдресЭП", "НомерТелефона");
			
		КонецЕсли;
		
		Запрос.Текст = СтрШаблон(
		"%1%2%3",
		Запрос.Текст,
		ТекстЗапроса,
		РазделительПакетаЗапросов);
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр(СтрШаблон("ПредставлениеКИ%1", Индекс), "%" + ПоисковоеВыражение + "%");
		
	КонецЦикла;
	
	ОбработатьЗапросДублейКИ(Запрос, ДанныеВсехКИ, ИндексыКЛ);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗапросДублейКИ(Запрос, ДанныеВсехКИ, ИндексыКЛ)
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	Индекс = 0;
	КоличествоЭлементов = ДанныеВсехКИ.Количество();
	Пока Индекс < КоличествоЭлементов Цикл
		
		РезультатЗапроса = РезультатыЗапросов[Индекс];
		ДанныеКИ = ДанныеВсехКИ[Индекс];
		ИндексКЛ = ИндексыКЛ[Индекс];
		
		ЕстьДубли = Не РезультатЗапроса.Пустой();
		ПоказатьСкрытьНадписьОДубляхКИ(ДанныеКИ, ЕстьДубли, ИндексКЛ);
		
		Если Не ЕстьДубли Тогда
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;
		
		ДанныеВсехКИ.Удалить(Индекс);
		ИндексыКЛ.Удалить(Индекс);
		КоличествоЭлементов = КоличествоЭлементов - 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьНадписьОДубляхКИ(ДанныеКИ, ЕстьДубли, ИндексКЛ = Неопределено)
	
	УдалитьНеактивныеДублиИЭлементы(ИндексКЛ);
	
	Дубли = ДублиКИ.НайтиСтроки(Новый Структура("Представление", ДанныеКИ.Представление));
	
	Если Дубли.Количество() <> 0 Тогда
		СообщениеОДублях = Элементы.Найти("СообщениеОДублях_" + Строка(Дубли[0].ИндексДекорации));
		СообщениеОДублях.Видимость = ЕстьДубли;
		Возврат;
	КонецЕсли;

	Если НЕ ЕстьДубли Тогда
		Возврат;
	КонецЕсли;
	
	ДублиКИ.Сортировать("ИндексДекорации УБЫВ");
	
	НовыйДубль = ДублиКИ.Добавить();
	НовыйДубль.ИмяЭлемента     = ДанныеКИ.ИмяРеквизита;
	НовыйДубль.ТипКИ           = ДанныеКИ.Тип;
	НовыйДубль.Представление   = ДанныеКИ.Представление;
	НовыйДубль.ИндексДекорации = ДублиКИ[0].ИндексДекорации + 1;
	НовыйДубль.ЭтоДубльКЛ      = ?(ИндексКЛ = Неопределено, Ложь, Истина);
	НовыйДубль.ИндексКЛ        = ?(ИндексКЛ = Неопределено, 0, ИндексКЛ);
	
	ГруппаЗначенияКИ = Элементы[ДанныеКИ.ИмяРеквизита].Родитель.Родитель;
	ГруппаТекущегоЗначенияКИ = Элементы[ДанныеКИ.ИмяРеквизита].Родитель;
	ГруппаСоседнегоЗначенияКИ = УправлениеКонтактнойИнформациейУНФ.СледующийЭлементВКоллекцииПочиненных(ГруппаЗначенияКИ.ПодчиненныеЭлементы, ГруппаТекущегоЗначенияКИ);
	
	СообщениеОДублях = Элементы.Добавить("СообщениеОДублях_" + Строка(НовыйДубль.ИндексДекорации), Тип("ДекорацияФормы"), ГруппаЗначенияКИ);
	СообщениеОДублях.Заголовок = СообщенияОДубляхКИПоТипу(ДанныеКИ.Тип);
	СообщениеОДублях.Гиперссылка = Истина;
	СообщениеОДублях.УстановитьДействие("Нажатие", "Подключаемый_СообщениеОДубляхНажатие");
	СообщениеОДублях.Шрифт = ШрифтыСтиля.ПодзаголовокПервогоУровня;
	
	Если ГруппаСоседнегоЗначенияКИ <> Неопределено Тогда
		Элементы.Переместить(СообщениеОДублях, ГруппаЗначенияКИ, ГруппаСоседнегоЗначенияКИ);
	КонецЕсли;
	
	СообщениеОДублях.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Функция СообщенияОДубляхКИПоТипу(Тип)
	
	Если Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		Возврат НСтр("ru = 'Найдены дубли по e-mail'");
	КонецЕсли;
	
	Если Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		Возврат НСтр("ru = 'Найдены дубли по номеру телефона'");
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УдалитьНеактивныеДублиИЭлементы(ИндексКЛ = Неопределено)
	
	Если ДублиКИ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийИндекс = ДублиКИ.Количество() - 1;
	
	Пока ТекущийИндекс >= 0 Цикл
		
		Дубль = ДублиКИ[ТекущийИндекс];
		ТекущийИндекс = ТекущийИндекс - 1;
		Если ИндексКЛ = Неопределено И Дубль.ЭтоДубльКЛ Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИндексКЛ = Неопределено И Дубль.ЭтоДубльКЛ Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИндексКЛ <> Неопределено И НЕ Дубль.ЭтоДубльКЛ Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеКИ = УправлениеКонтактнойИнформациейУНФ.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Дубль.ИмяЭлемента);
		Если ОписаниеКИ.Представление = Дубль.Представление Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы.Удалить(Элементы["СообщениеОДублях_"+ Строка(Дубль.ИндексДекорации)]);
		ДублиКИ.Удалить(ДублиКИ.Индекс(Дубль));
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПроверитьКонтрагентаНаДублиКИ()
	
	ДанныеВсехКИ = Новый Массив;
	ИндексыКЛ = Новый Массив;
	
	Для каждого ДанныеКИ Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
		
		Если СтрНачинаетсяС(ДанныеКИ.ИмяЭлементаДляРазмещения, "КонтактнаяИнформацияКонтакт_") Тогда
			// Это контактная информация контактого лица.
			Продолжить;
		КонецЕсли;
		
		ДанныеВсехКИ.Добавить(ДанныеКИ);
		ИндексыКЛ.Добавить(Неопределено);
		
	КонецЦикла;
	
	ПроверитьКИНаДубли(ДанныеВсехКИ, ИндексыКЛ);
	
КонецПроцедуры

&НаСервере
Функция НаименованиеДляПоискаДублей(Наименование)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Наименование))Тогда
		Возврат "";
	КонецЕсли;
	
	ПоисковоеВыражение = ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(Наименование);
	
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "-", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, " ", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "(", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, ")", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, ".", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, """", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, """", "%");
	
	Возврат СокрЛП("%"+ПоисковоеВыражение+"%");
	
КонецФункции

&НаСервере
Процедура ОбработатьВыборДублей(ВыбранныйКонтрагент)
	
	ЗакрыватьПриВыборе = Ложь;
	ЗначениеВРеквизитФормы(ВыбранныйКонтрагент.ПолучитьОбъект(), "Объект");
	УдалитьЭлементыДублейКИ();
	ДублиКИ.Очистить();	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеОДублях()
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыПредупреждениеДублей",ЭтотОбъект);
	ТекстПредупреждения = ТекстПредупрежденияПоДублям();

	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Проигнорировать и записать'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстПредупреждения, СписокКнопок,,КодВозвратаДиалога.Отмена, НСтр("ru = 'Контроль дублей'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыПредупреждениеДублей(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	СозданКопированием = Ложь;
	ПроигнорированоСообщениеОДублях = Истина;
	СообщениеОДублированииИнформации = ТекстПредупрежденияПоДублям(Истина);
	
	УдалитьЭлементыДублейКИ();
	Элементы.ПредставлениеВПрограмме.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	Элементы.НаименованиеКомпании.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыДублейКИ()
	
	Для Каждого Дубль Из ДублиКИ Цикл
		Элементы.Удалить(Элементы["СообщениеОДублях_"+ Строка(Дубль.ИндексДекорации)]);
	КонецЦикла;
	
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		
		ИндексКЛ = ДанныеКонтактныхЛиц.Индекс(Контакт);
		
		Если Элементы.Найти("СообщениеОДубляхКЛ_"+ Строка(ИндексКЛ)) <> Неопределено Тогда
			Элементы.Удалить(Элементы["СообщениеОДубляхКЛ_"+ Строка(ИндексКЛ)]);
		КонецЕсли;
		
	КонецЦикла;
	
	ДублиКИ.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКонтрагентаНаДублиСервер()
	
	Если ПроверятьПредставлениеНаДубли  Тогда
		ПроверитьНаДубли("Наименование");
	КонецЕсли;
	
	Если ПроверятьЮрНазваниеНаДубли Тогда
		ПроверитьНаДубли("НаименованиеКомпании");
	КонецЕсли;
		
	УдалитьЭлементыДублейКИ();
	ПроверитьКонтрагентаНаДублиКИ();
	
	ДанныеВсехКИ = Новый Массив;
	ИндексыКЛ = Новый Массив;
	ИндексыКЛДляПроверкиНаименований = Новый Массив;
	
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		
		ИндексКЛ = ДанныеКонтактныхЛиц.Индекс(Контакт);
		ИндексыКЛДляПроверкиНаименований.Добавить(ИндексКЛ);
		
		Для каждого ДанныеКИ Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
			Если СтрНачинаетсяС(ДанныеКИ.ИмяЭлементаДляРазмещения, "КонтактнаяИнформацияКонтакт_") Тогда
				ДанныеВсехКИ.Добавить(ДанныеКИ);
				ИндексыКЛ.Добавить(ИндексКЛ);
			КонецЕсли;
		КонецЦикла
		
	КонецЦикла;
	
	ПроверитьКИНаДубли(ДанныеВсехКИ, ИндексыКЛ);
	ПроверитьНаименованиеКонтактаНаДубли(ИндексыКЛДляПроверкиНаименований);
	
КонецПроцедуры

&НаКлиенте
Функция ТекстПредупрежденияПоДублям(СообщениеПриЗаписи = Ложь)
	
	МассивСтрок = Новый Массив;
	
	Если Элементы.ПредставлениеВПрограмме.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу Тогда
		МассивСтрок.Добавить(НСтр("ru = 'представлению'"));
	КонецЕсли;
	
	Если Элементы.НаименованиеКомпании.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу Тогда
		МассивСтрок.Добавить(НСтр("ru = 'юр. названию'"));
	КонецЕсли;
	
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		
		ИндексКЛ = ДанныеКонтактныхЛиц.Индекс(Контакт);
		
		Если Элементы.Найти("СообщениеОДубляхКЛ_"+Строка(ИндексКЛ)) <> Неопределено Тогда
			МассивСтрок.Добавить(НСтр("ru = 'имени контакта'"));
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Отбор = Новый Структура("ТипКИ", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	ДублиПоНомеру = ДублиКИ.НайтиСтроки(Отбор);
	Если ДублиПоНомеру.Количество() > 0 Тогда
		МассивСтрок.Добавить(НСтр("ru = 'номеру телефона'"));
	КонецЕсли;
	
	Отбор = Новый Структура("ТипКИ", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	ДублиПоАдресуЭП = ДублиКИ.НайтиСтроки(Отбор);
	Если ДублиПоАдресуЭП.Количество() > 0 Тогда
		МассивСтрок.Добавить(НСтр("ru = 'e-mail'"));
	КонецЕсли;
	
	Если СообщениеПриЗаписи Тогда
		Возврат СтрШаблон(НСтр("ru = 'Проигнорировано сообщение о дублировании информации по%1%2'"),
		Символы.НПП,
		СтрСоединить(МассивСтрок, ", "));
	Иначе
		Возврат СтрШаблон(НСтр("ru = 'Найдены дубли по%1%2'"),
		Символы.НПП,
		СтрСоединить(МассивСтрок, ", "));
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСообщениеОДублях()
	
	Если Элементы.ПредставлениеВПрограмме.ОтображениеПодсказки = ОтображениеПодсказки.Нет
		И Элементы.НаименованиеКомпании.ОтображениеПодсказки = ОтображениеПодсказки.Нет
		И ДублиКИ.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Дублей не найдено'"));
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПредупрежденияПоДублям());
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СообщениеОДубляхКЛНажатие(Элемент)
	
	ПоложениеИндекса = СтрНайти(Элемент.Имя, "_", НаправлениеПоиска.СКонца);
	ИндексДекорации  = Число(Сред(Элемент.Имя, ПоложениеИндекса+1));
	
	НаименованиеКЛ = ДанныеКонтактныхЛиц[ИндексДекорации].Наименование;
	
	ПараметрыДублей = Новый Структура;
	МассивКонтактов = Новый Массив;
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		МассивКонтактов.Добавить(Контакт.КонтактноеЛицо);
	КонецЦикла;
	
	ПараметрыДублей.Вставить("Наименование", НаименованиеДляПоискаДублей(НаименованиеКЛ));
	ПараметрыДублей.Вставить("ИсключаяКонтакты", МассивКонтактов);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИндексКЛ", ИндексДекорации);
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Справочник.Лиды.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СообщениеОДубляхНажатие(Элемент)
	
	ПоложениеИндекса = СтрНайти(Элемент.Имя, "_", НаправлениеПоиска.СКонца);
	ИндексДекорации  = Число(Сред(Элемент.Имя, ПоложениеИндекса+1));
	
	СтрокиДублиКИ = ДублиКИ.НайтиСтроки(Новый Структура("ИндексДекорации", ИндексДекорации));
	Если СтрокиДублиКИ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Дубль = СтрокиДублиКИ[0];
	
	ДанныеКИ = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Дубль.ИмяЭлемента);
	Если ДанныеКИ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДублей = Новый Структура;
	МассивКонтактов = Новый Массив;
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		МассивКонтактов.Добавить(Контакт.КонтактноеЛицо);
	КонецЦикла;
	ПараметрыДублей.Вставить("ПредставлениеКИ", ДанныеКИ.Представление);
	ПараметрыДублей.Вставить("ТипКИ",           ДанныеКИ.Тип);
	ПараметрыДублей.Вставить("ИсключаяКонтакты", МассивКонтактов);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ДанныеКИ", ДанныеКИ);
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Справочник.Лиды.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСпискаДублей(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатЗакрытия.Свойство("ВыбранДубльЛида") Тогда
		
		ОбработатьВыборДублей(РезультатЗакрытия.ВыбранныйЛид);
		Элементы.ПредставлениеВПрограмме.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Элементы.НаименованиеКомпании.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		ЛидЗамененНаДубль = Истина;
		
	КонецЕсли;
	
	Если РезультатЗакрытия.Свойство("КонтрагентДляСвязиСЛидом") Тогда
		
		Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыЛидов.ПовторноеОбращение");
		Контрагент = РезультатЗакрытия.КонтрагентДляСвязиСЛидом;
		ПредыдущийКонтрагент = Контрагент;
		
		ОбработатьЗакрытиеФормыСпискаДублейНаСервере();
		
		Если ДополнительныеПараметры = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ЭтоПолноеНаименование") Тогда
			Объект.НаименованиеКомпании = "";
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ДанныеКИ") Тогда
			
			ДанныеКИ = ДополнительныеПараметры.ДанныеКИ;
			
			ЭтотОбъект[ДанныеКИ.ИмяРеквизита] = "";
			
			Отбор = Новый Структура;
			Отбор.Вставить("ИмяРеквизита", ДанныеКИ.ИмяРеквизита);
			Строки = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
			Если Строки.Количество() Тогда
				Строка = Строки[0];
				Строка.Значение = "";
				Строка.Представление = "";
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ИндексКЛ") Тогда
			ДанныеКонтактныхЛиц.Удалить(ДополнительныеПараметры.ИндексКЛ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗакрытиеФормыСпискаДублейНаСервере()
	
	ОбновитьИнтерфейсПоВидуЛида();
	ОбновитьКнопкиПереводаКачественногоЛида();
	ОбновитьИнтерфейсПоКонтрагенту();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Асинх Процедура СоздатьСобытиеПоЛиду(ИмяТипаСобытия)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Создание события возможно только после записи данных.
		|Данные будут записаны.'");
		ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Если ОтветПользователя <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Записать() Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ТипСобытия = ПредопределенноеЗначение(СтрШаблон("Перечисление.ТипыСобытий.%1", ИмяТипаСобытия));
	ЗначенияЗаполнения.Вставить("ТипСобытия", ТипСобытия);
	ЗначенияЗаполнения.Вставить("Лид", Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	
	СохранитьГлобальныеНастройки();
	
	Если НЕ Объект.КонтактыПеренесены И Объект.УдалитьКонтакты.Количество() > 0 Тогда
		ЛидОбъект = РеквизитФормыВЗначение("Объект");
		Справочники.Лиды.ПеренестиКонтактыЛидаВСправочникКонтактыЛидов(ЛидОбъект);
		ЗначениеВДанныеФормы(ЛидОбъект, Объект);
	КонецЕсли;
	
	КлассификаторОПФ.Загрузить(РегламентированныеДанныеПовтИсп.КлассификаторОрганизационноПравовыхФорм());
	
	ТегированиеОбъектов.ПриСозданииПриЧтенииНаСервере(ЭтотОбъект,Объект);
	
	//@skip-check optional-form-parameter-access
	Если Параметры.Свойство("ДанныеИзКонтактнойФормы") И Параметры.ДанныеИзКонтактнойФормы <> Неопределено Тогда
		ЗаполнитьПоДаннымКонтактнойФормы(Параметры);
	КонецЕсли;
	
	Если Параметры.Свойство("КонтактКакСвязаться", КонтактКакСвязаться) Тогда
		ЗаполнитьКонтактКакСвязаться();
	КонецЕсли;
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект);
	
	ФормироватьНаименованиеАвтоматически = ПустаяСтрока(Объект.Наименование)
	ИЛИ Элементы.ПредставлениеВПрограмме.СписокВыбора.НайтиПоЗначению(Объект.Наименование) <> Неопределено
	ИЛИ (ДанныеКонтактныхЛиц.Количество() > 0 И Элементы.ПредставлениеВПрограмме.СписокВыбора.НайтиПоЗначению(ДанныеКонтактныхЛиц[0].Наименование) <> Неопределено);
	
	УправлениеФормой();
	ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере(Знач ИмяСобытия, Знач Параметр)
	
	Если ИмяСобытия = "Запись_ЗаказПокупателя" Или ИмяСобытия = "Запись_ЗаказНаряды" Тогда
		
		Если РаботаСЛидами.ЕстьЗаказПоЛиду(Объект.Ссылка, Параметр) Тогда
			Прочитать();
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьГлобальныеНастройки()
	
	ИспользоватьПодсистемуРаботы = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуРаботы");
	ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи = ПолучитьФункциональнуюОпцию("ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи");
	
	ИспользованиеЗаявокПоВидуОперации = РаботаСЗаявками.ИспользованиеЗаявокПоВидуОперации();
	
	ИспользованиеЗаявок = Новый Структура;
	
	ИспользованиеЗаявок.Вставить(
	"ЗаказНаПродажу", ИспользованиеЗаявокПоВидуОперации[Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу]);
	
	ИспользованиеЗаявок.Вставить(
	"ЗаказНаряд", ИспользоватьПодсистемуРаботы
	И ИспользованиеЗаявокПоВидуОперации[Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд]);
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоПервичныйЛид()
	
	Возврат Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыЛидов.ПервичноеОбращение");
	
КонецФункции

&НаСервере
Функция ЭтоПервичныйЛидНаСервере()
	
	Возврат Объект.Вид = Перечисления.ВидыЛидов.ПервичноеОбращение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораНаименования(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	СписокВыбора = Элементы.ПредставлениеВПрограмме.СписокВыбора;
	СписокВыбора.Очистить();
	
	Если Не ПустаяСтрока(Объект.НаименованиеКомпании) Тогда
		
		Форма.ОрганизационноПравоваяФорма = УправлениеНебольшойФирмойКлиентСервер.ВыделитьИзНаименованияОПФ(Форма.КлассификаторОПФ, Объект.НаименованиеКомпании);
		
		СписокВыбора.Добавить(Форма.ОрганизационноПравоваяФорма.НаименованиеБезОПФ);
		
		Если НЕ ПустаяСтрока(Форма.ОрганизационноПравоваяФорма.КраткаяФорма) Тогда
			СписокВыбора.Вставить(0, Форма.ОрганизационноПравоваяФорма.НаименованиеБезОПФ + " " + Форма.ОрганизационноПравоваяФорма.КраткаяФорма);
			СписокВыбора.Добавить(Форма.ОрганизационноПравоваяФорма.КраткаяФорма + " " + Форма.ОрганизационноПравоваяФорма.НаименованиеБезОПФ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Форма.ДанныеКонтактныхЛиц.Количество() > 0 И Не ПустаяСтрока(Форма.ДанныеКонтактныхЛиц[0].Наименование) Тогда
		СписокВыбора.Добавить(Строка(Форма.ДанныеКонтактныхЛиц[0].Наименование));
	КонецЕсли;
	
	Форма.Элементы.ПредставлениеВПрограмме.КнопкаВыпадающегоСписка = СписокВыбора.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименованиеЛида()
	
	Если НЕ ФормироватьНаименованиеАвтоматически Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ПредставлениеВПрограмме.СписокВыбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Наименование = Элементы.ПредставлениеВПрограмме.СписокВыбора[0].Значение;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымКонтактнойФормы(Параметры)
	
	ДанныеКФ = Параметры.ДанныеИзКонтактнойФормы;
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Параметры.Контакт;
	КонецЕсли;
	
	Если ДанныеКонтактныхЛиц.Количество() = 0 Тогда
		//ДанныеКЛ = ДанныеКонтактныхЛиц.Добавить();
		ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;     
		
		ВидКИТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонКомпанииЛида;
		ВидКИАдресЭП = Справочники.ВидыКонтактнойИнформации.EmailКомпанииЛида;
		ВидКИСкайп   = Справочники.ВидыКонтактнойИнформации.SkypeКомпанииЛида;
		ВидКИДругое  = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКомпанииЛида;		
	Иначе
		ДанныеКЛ = ДанныеКонтактныхЛиц[0];       
		ДанныеКЛ.Изменен = Истина;
		ИндексКЛ = ДанныеКонтактныхЛиц.Индекс(ДанныеКЛ);
		ИмяЭлементаДляРазмещения = ДанныеКонтактныхЛиц[ИндексКЛ].ИмяЭлементаДляРазмещения;   
		ДанныеКЛ.Наименование = Параметры.Контакт;

		ВидКИТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактаЛида;
		ВидКИАдресЭП = Справочники.ВидыКонтактнойИнформации.EmailКонтактаЛида;
		ВидКИСкайп   = Справочники.ВидыКонтактнойИнформации.SkypeКонтактаЛида;
		ВидКИДругое  = Справочники.ВидыКонтактнойИнформации.МессенджерКонтактаЛида;
	КонецЕсли;
	
	Если ДанныеКФ["НомераТелефонов"].Количество()>0 Тогда
		КИТелефон = ДанныеКФ["НомераТелефонов"][0];
		ВидКИ = ВидКИТелефон;
		ДанныеКИ = Новый Структура;
		ДанныеКИ.Вставить("Представление", КИТелефон);
		ДанныеКИ.Вставить("Вид", ВидКИ);
		ДанныеКИ.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформациюНаФорму(ЭтотОбъект, Объект, ДанныеКИ);
	КонецЕсли;
	
	Для Каждого КИ Из ДанныеКФ["АдресаЭП"] Цикл
		ВидКИ = ВидКИАдресЭП;
		ДанныеКИ = Новый Структура;
		ДанныеКИ.Вставить("Представление", КИ);
		ДанныеКИ.Вставить("Вид", ВидКИ);
		ДанныеКИ.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформациюНаФорму(ЭтотОбъект, Объект, ДанныеКИ);
	КонецЦикла;
	
	Для Каждого КИ Из ДанныеКФ["Скайп"] Цикл
		ВидКИ = ВидКИСкайп;
		ДанныеКИ = Новый Структура;
		ДанныеКИ.Вставить("Представление", КИ);
		ДанныеКИ.Вставить("Вид", ВидКИ);
		ДанныеКИ.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформациюНаФорму(ЭтотОбъект, Объект, ДанныеКИ);
	КонецЦикла;
	
	Для Каждого КИ Из ДанныеКФ["Другое"] Цикл
		ВидКИ = ВидКИДругое;
		ДанныеКИ = Новый Структура;
		ДанныеКИ.Вставить("Представление", КИ);
		ДанныеКИ.Вставить("Вид", ВидКИ);
		ДанныеКИ.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформациюНаФорму(ЭтотОбъект, Объект, ДанныеКИ);
	КонецЦикла;
	
	ПроверитьКонтрагентаНаДублиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ВидПриИзмененииНаСервере(Знач КонтрагентОчищен)
	
	ОбновитьИнтерфейсПоВидуЛида();
	ОбновитьКнопкиПереводаКачественногоЛида();
	
	Если КонтрагентОчищен Тогда
		ОбновитьИнтерфейсПоКонтрагенту();
	КонецЕсли;
	
	СоздатьОбновитьКарточкиКИ();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвязанныйКонтрагент(Лид)
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Справочники.Лиды.СвязанныйКонтрагент(Лид);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЧтениеРазрешено(Ссылка)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат УправлениеДоступом.ЧтениеРазрешено(Ссылка);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура АдаптацияТакси()
	
	Если Не ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСостояниеИВидЛида.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.ПредставлениеВПрограмме.ВысотаЗаголовка = 2;
	Элементы.НаименованиеКомпании.ВысотаЗаголовка = 2;
	
	Элементы.ЗаметкиЗавершенияРаботы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;

	Элементы.ДанныеПанелиКонтактнойИнформации.ВысотаВСтрокахТаблицы = 10;
	Элементы.ДанныеПанелиКонтактнойИнформации.РастягиватьПоВертикали = Ложь;
	Элементы.ГруппаКонтактыЛида.РастягиватьПоВертикали = Истина;
	Элементы.ГруппаКомандыЛидаПерваяСтрочка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Элементы.ПодменюПереводаЛида.Вид = ВидГруппыФормы.Подменю;
	Элементы.ФормаПеревестиВЗаказНаряд.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.Авто;
	Элементы.ФормаПеревестиВЗаказПокупателя.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.Авто;
	Элементы.ФормаПеревестиВПокупателя.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.Авто;
	Элементы.Переместить(Элементы.ПодменюПереводаЛида, Элементы.КомандыПереводаЛида, Элементы.НекачественныйЛид);
	Элементы.Переместить(Элементы.НекачественныйЛид, Элементы.КомандыОтменыИВозвратаЛида);
	Элементы.Переместить(Элементы.ВернутьВРаботу, Элементы.КомандыОтменыИВозвратаЛида);
	
	Элементы.Колонки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Элементы.КолонкаСлева.Ширина = 50;
	Элементы.КолонкаСправа.Ширина = 40;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОЛиде.ОтображатьКакКарточку = Ложь;
	
	Элементы.Переместить(Элементы.ГруппаЗавершенияРаботы, Элементы.КолонкаСлева, Элементы.КонтактнаяИнформация);
	Элементы.Переместить(Элементы.ГруппаЗаявки, Элементы.КолонкаСлева);
	Элементы.Комментарий.Высота = 4;
	
	Элементы.ГруппаКонтактыКомандыПервичный.Ширина = 0;
	Элементы.ГруппаКонтактыКонтрагента.Ширина = 0;
	Элементы.ГруппаКонтактыКонтрагента.РастягиватьПоГоризонтали = Истина;
	Элементы.ГруппаКонтактыКомандыПервичный.Ширина = 0;
	Элементы.ГруппаКонтактыЛида.Ширина = 0;
	Элементы.ГруппаКонтактыЛида.РастягиватьПоГоризонтали = Истина;
	Если Элементы.Найти("ДанныеПанелиКонтактнойИнформации") <> Неопределено Тогда
		Элементы.ДанныеПанелиКонтактнойИнформации.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтрокиТаблицы.Авто;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти