
#Область ОписаниеПеременных

&НаКлиенте
Перем Статистика;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НавигационнаяСсылка = "e1cib/app/" + ЭтотОбъект.ИмяФормы;
	
	УстановитьУсловноеОформление();
		
	Номенклатура = Новый Массив;
	
	Параметры.Свойство("Номенклатура",             Номенклатура);
	Параметры.Свойство("ПодсистемаВладелец",       ПодсистемаВладелец);
	Параметры.Свойство("ОтображатьСопоставленные", ОтображатьСопоставленные);
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		НоменклатураДляСопоставления.ЗагрузитьЗначения(Номенклатура);
	КонецЕсли;

	СформироватьСписокФормыСопоставленияНоменклатуры();
	
	НастроитьФормуПриСоздании();
	
	ЗапуститьПоискСоответствийНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполнитьРасчетСтатистики();
	
	НайтиСоответствия();
	УправлениеОтображением();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		Оповестить(РаботаСНоменклатуройКлиент.ОписаниеОповещенийПодсистемы().СопоставлениеНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДействиюПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ОтображатьПоискСервиса Тогда
		ПодключитьОбработчикОжидания("ПоказатьСписокВариантов", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.СписокНоменклатура Тогда
		
		// Открытие номенклатуры
		
		ПоказатьЗначение(, ТекущиеДанные.Номенклатура);
		
	ИначеЕсли Поле = Элементы.СписокХарактеристика Тогда
		
		// Открытие характеристики
		
		ПоказатьЗначение(, ТекущиеДанные.Характеристика);
		
	ИначеЕсли Поле = Элементы.СписокПредставлениеНоменклатурыСервиса Тогда
		
		// Открытие карточки номенклатуры
		
		ВыбратьНоменклатуруСервиса(ТекущиеДанные, Элемент);
		
	ИначеЕсли Поле = Элементы.СписокСостояниеГиперссылка Тогда
		
		ВыполнитьДействиеСтроки(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	Строки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Строка);
	
	ДоступныеДействия = ДоступныеДействияСтрокСписка(Строки);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		Элементы.СнятьПометки.Имя,
		"Доступность",
		ДоступныеДействия.СнятьПометки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		Элементы.УстановитьПометки.Имя,
		"Доступность",
		ДоступныеДействия.УстановитьПометки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		Элементы.СписокОчиститьВыбор.Имя,
		"Доступность",
		ДоступныеДействия.ОчиститьВыбор);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзмененииСоставаВыделенныхСтрок(Элемент)
	
	Строки = Элементы.Список.ПолучитьСтрокиДляОбработки();
	
	ДоступныеДействия = ДоступныеДействияСтрокСписка(Строки);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		Элементы.СписокСнятьПометкиМножественный.Имя,
		"Доступность",
		ДоступныеДействия.СнятьПометки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		Элементы.СписокУстановитьПометкиМножественный.Имя,
		"Доступность",
		ДоступныеДействия.УстановитьПометки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		Элементы.СписокОчиститьВыборМножественный.Имя,
		"Доступность",
		ДоступныеДействия.ОчиститьВыбор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВарианты

&НаКлиенте
Процедура ВариантыПоискаПометкаПриИзменении(Элемент)
	
	// Установить в списке.
	ТекущиеДанныеСписка    = Элементы.Список.ТекущиеДанные;
	ТекущиеДанныеВариантов = Элементы.ВариантыПоиска.ТекущиеДанные;
	
	// Изменение режима подтверждения.
	Отбор = Новый Структура("Номенклатура, Характеристика",
		ТекущиеДанныеСписка.Номенклатура, ТекущиеДанныеСписка.Характеристика);
	
	ЗначенияРеквизитов = Новый Структура();
	
	ЗначенияРеквизитов.Вставить("СтатусСопоставления");
	ЗначенияРеквизитов.Вставить("ИдентификаторНоменклатурыСервиса");
	ЗначенияРеквизитов.Вставить("ИдентификаторХарактеристикиСервиса");
	ЗначенияРеквизитов.Вставить("ПредставлениеНоменклатурыСервиса");
	ЗначенияРеквизитов.Вставить("ПредставлениеХарактеристикиСервиса");
	
	Если ТекущиеДанныеВариантов.Пометка Тогда
		
		// Выбор варианта сопоставления.
		
		ИдентификаторыИспользуются = ИдентификаторыИспользуются(
			ТекущиеДанныеСписка.Номенклатура, 
			ТекущиеДанныеСписка.Характеристика,
			ТекущиеДанныеВариантов.ИдентификаторНоменклатурыСервиса, 
			ТекущиеДанныеВариантов.ИдентификаторХарактеристикиСервиса);
			
		СтатусСопоставления = ?(ИдентификаторыИспользуются, СтатусыСопоставления().Выбрано, СтатусыСопоставления().Проверено);
				
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, ТекущиеДанныеВариантов);
		ЗначенияРеквизитов.СтатусСопоставления = СтатусСопоставления;
		
	Иначе
		
		// Отмена выбора сопоставления.
		
		ЗначенияРеквизитов.СтатусСопоставления = СтатусыСопоставления().НеСопоставлено;
		
		Если ТекущиеДанныеСписка.КоличествоСовпадений > 0 
			И Не ЗначениеЗаполнено(ТекущиеДанныеСписка.ИдентификаторНоменклатурыСервиса) Тогда
			
			ЗначенияРеквизитов.ПредставлениеНоменклатурыСервиса
				= СтрШаблон(НСтр("ru = '<Несколько вариантов (%1)>'"), ТекущиеДанныеСписка.КоличествоСовпадений);
		КонецЕсли;
			
	КонецЕсли;
	
	ИзменитьРеквизитыСписка(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Отбор), ЗначенияРеквизитов, Ложь);
	
	// Сбросить другие пометки.
	Отбор = Новый Структура;
	
	Отбор.Вставить("Номенклатура",   ТекущиеДанныеСписка.Номенклатура);
	Отбор.Вставить("Характеристика", ТекущиеДанныеСписка.Характеристика);
	
	ВариантыПоискаТекущейНоменклатуры = ВариантыПоиска.НайтиСтроки(Отбор);
	
	Для каждого ЭлементКоллекции Из ВариантыПоискаТекущейНоменклатуры Цикл
		Если ЭлементКоллекции <> ТекущиеДанныеВариантов И ЭлементКоллекции.Пометка Тогда
			ЭлементКоллекции.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ВариантыПоиска.ТекущиеДанные;
	
	Если Не ТекущиеДанные.ЭтоГиперссылка Тогда
		ОткрытьКарточкуНоменклатуры(ТекущиеДанные.ИдентификаторНоменклатурыСервиса, ТекущиеДанные.ИдентификаторХарактеристикиСервиса);
	Иначе
		ОткрытьФормуПоискаНоменклатурыСервиса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыПоискаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыПоискаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнятьНоменклатуруПриСопоставленииПриИзменении(Элемент)
	
	Элементы.УстанавливатьАвтоматическийРежимОбновления.Доступность = ЗаполнятьНоменклатуруПриСопоставлении;
	
	Если Не ЗаполнятьНоменклатуруПриСопоставлении Тогда
		УстанавливатьАвтоматическийРежимОбновления = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПоискСервиса(Команда)
	
	ОтображатьПоискСервиса = Не ОтображатьПоискСервиса;
	
	Если ОтображатьПоискСервиса Тогда
		ПодключитьОбработчикОжидания("ПоказатьСписокВариантов", 0.1, Истина);
	КонецЕсли;
	
	УправлениеОтображением();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	Если ЕстьСопоставленияДляСохранения(НоменклатураДляСопоставления, ПодсистемаВладелец) Тогда
		СохранитьПодтвержденныеСопоставления();	
	Иначе
		ТекстСообщения = НСтр("ru = 'Отсутствуют подтвержденные сопоставления'");
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПоискНоменклатурыСервиса(Команда)
	
	ЗапуститьПоискСоответствийНоменклатуры();
	
	НайтиСоответствия();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Отказ = Ложь;
	ТекстСообщения = "";
	
	ОчиститьСообщения();
	
	СтрокиБезСопоставленных = ВыделенныеСтрокиБезСопоставленных(Элементы.Список.ПолучитьСтрокиДляОбработки());
	
	Если Не ЗначениеЗаполнено(СтрокиБезСопоставленных) Тогда
		Возврат;
	КонецЕсли;

	ИзменитьРеквизитыСписка(СтрокиБезСопоставленных, 
		Новый Структура("СтатусСопоставления", СтатусыСопоставления().Проверено), 
		Истина);
	
	Элементы.Список.Обновить();
		
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	ОчиститьСообщения();
	
	СтрокиБезСопоставленных = ВыделенныеСтрокиБезСопоставленных(Элементы.Список.ПолучитьСтрокиДляОбработки());
	
	Если Не ЗначениеЗаполнено(СтрокиБезСопоставленных) Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьРеквизитыСписка(СтрокиБезСопоставленных, 
		Новый Структура("СтатусСопоставления", СтатусыСопоставления().Выбрано),
		Ложь);
		
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВыбор(Команда)
		
	ОтменитьВыборНаСервере(Элементы.Список.ПолучитьСтрокиДляОбработки());
	
	ВыполнитьРасчетСтатистики();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СообщенияПользователю

&НаСервереБезКонтекста
Процедура СообщитьПользователюОНаличииИдентификаторов(НесколькоЭлементов = Истина)
	
	СтрокаСообщения = "";
	
	Если НесколькоЭлементов Тогда
		СтрокаСообщения = НСтр("ru = 'Для некоторых строк не удалось установить признак проверки: выбранная 1С:Номенклатура уже сопоставлена'");
	Иначе
		СтрокаСообщения = НСтр("ru = 'Не удалось установить признак проверки: выбранная 1С:Номенклатура уже сопоставлена'");
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СообщитьПользователюОбОтсутствииНоменклатуры(НесколькоЭлементов = Истина)
	
	СтрокаСообщения = "";
	
	Если НесколькоЭлементов Тогда
		СтрокаСообщения = НСтр("ru = 'Для некоторых строк не удалось установить признак проверки: не выбрана 1С:Номенклатура'");
	Иначе
		СтрокаСообщения = НСтр("ru = 'Не удалось установить признак проверки: не выбрана 1С:Номенклатура'");
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ВыделенныеСтрокиБезСопоставленных(ВыделенныеСтроки)
	
	СтрокиБезСопоставленных = Новый Массив;
	ЕстьСопоставленные = Ложь;
	
	Для каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ТекущаяСтрока);
		
		Если ДанныеСтроки.Сопоставлено Тогда
			ЕстьСопоставленные = Истина;
			Продолжить;
		КонецЕсли;
		
		СтрокиБезСопоставленных.Добавить(ТекущаяСтрока);
		
	КонецЦикла;
	
	Если ЕстьСопоставленные Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Нельзя изменить статус проверки сопоставленных позиций'"));
	КонецЕсли;
	
	Возврат СтрокиБезСопоставленных;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьНоменклатуруСервиса(ТекущиеДанные, Элемент)
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторНоменклатурыСервиса) Тогда
		ОткрытьКарточкуНоменклатуры(ТекущиеДанные.ИдентификаторНоменклатурыСервиса, ТекущиеДанные.ИдентификаторХарактеристикиСервиса);
	Иначе
		
		Если Не ОтображатьПоискСервиса Тогда
			ОтображатьПоискСервиса(Элемент);
		КонецЕсли;
		
		ЭтотОбъект.ТекущийЭлемент = Элементы.ВариантыПоиска;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторыИспользуются(Номенклатура, Характеристика, ИдентификаторНоменклатуры, ИдентификаторХарактеристики)
	
	Параметры = РаботаСНоменклатурой.ПараметрыПроверкиИспользованияИдентификаторов();
	
	Параметры.Номенклатура                       = Номенклатура;
	Параметры.Характеристика                     = Характеристика;
	Параметры.ИдентификаторНоменклатурыСервиса   = ИдентификаторНоменклатуры;
	Параметры.ИдентификаторХарактеристикиСервиса = ИдентификаторХарактеристики;
	Параметры.УчитыватьПроверенные               = Истина;
		
	Возврат РаботаСНоменклатурой.ИдентификаторыИспользуются(Параметры);
	
КонецФункции

&НаСервере
Функция ДанныеДляЗаписиВРегистрСоответствия(НоменклатураИХарактеристики, ЕстьДублиИдентификаторов = Ложь, ЕстьСтрокиБезНоменклатуры = Ложь)
	
	СсылкиНоменклатурыИХарактеристик = Новый ТаблицаЗначений;
	
	СсылкиНоменклатурыИХарактеристик.Колонки.Добавить("Номенклатура", Метаданные.ОпределяемыеТипы.НоменклатураРаботаСНоменклатурой.Тип);
	СсылкиНоменклатурыИХарактеристик.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаРаботаСНоменклатурой.Тип);
	
	Для каждого ЭлементКоллекции Из НоменклатураИХарактеристики Цикл
		ЗаполнитьЗначенияСвойств(СсылкиНоменклатурыИХарактеристик.Добавить(), ЭлементКоллекции);
	КонецЦикла;
	
	СсылкиНоменклатурыИХарактеристик.Свернуть("Номенклатура, Характеристика");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	СсылкиНоменклатурыИХарактеристик.Номенклатура КАК Номенклатура,
	|	СсылкиНоменклатурыИХарактеристик.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ НоменклатураИХарактеристики
	|ИЗ
	|	&СсылкиНоменклатурыИХарактеристик КАК СсылкиНоменклатурыИХарактеристик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураИХарактеристики.Номенклатура КАК Номенклатура,
	|	НоменклатураИХарактеристики.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса, """") КАК ИдентификаторНоменклатуры,
	|	ЕСТЬNULL(СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторХарактеристикиСервиса, """") КАК ИдентификаторХарактеристики
	|ПОМЕСТИТЬ ИдентификаторыОбъектов
	|ИЗ
	|	НоменклатураИХарактеристики КАК НоменклатураИХарактеристики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыРаботаСНоменклатурой КАК СоответствиеНоменклатурыРаботаСНоменклатурой
	|		ПО НоменклатураИХарактеристики.Номенклатура = СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура
	|			И НоменклатураИХарактеристики.Характеристика = СоответствиеНоменклатурыРаботаСНоменклатурой.Характеристика
	|			И (СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса <> """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИдентификаторыОбъектов.Номенклатура КАК Номенклатура,
	|	ИдентификаторыОбъектов.Характеристика КАК Характеристика,
	|	ИдентификаторыОбъектов.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	ИдентификаторыОбъектов.ИдентификаторХарактеристики КАК ИдентификаторХарактеристики
	|ИЗ
	|	ИдентификаторыОбъектов КАК ИдентификаторыОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыРаботаСНоменклатурой КАК СоответствиеНоменклатурыРаботаСНоменклатурой
	|		ПО ИдентификаторыОбъектов.ИдентификаторНоменклатуры = СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса
	|			И ИдентификаторыОбъектов.ИдентификаторХарактеристики = СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторХарактеристикиСервиса
	|			И (СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления В (&СтатусСопоставлено))
	|ГДЕ
	|	(СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура ЕСТЬ NULL
	|			ИЛИ ИдентификаторыОбъектов.Номенклатура = СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура
	|				И ИдентификаторыОбъектов.Характеристика = СоответствиеНоменклатурыРаботаСНоменклатурой.Характеристика)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИдентификаторыОбъектов.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	ИдентификаторыОбъектов.ИдентификаторХарактеристики КАК ИдентификаторХарактеристики
	|ИЗ
	|	ИдентификаторыОбъектов КАК ИдентификаторыОбъектов
	|
	|СГРУППИРОВАТЬ ПО
	|	ИдентификаторыОбъектов.ИдентификаторНоменклатуры,
	|	ИдентификаторыОбъектов.ИдентификаторХарактеристики
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(ИдентификаторыОбъектов.Номенклатура), 0) КАК КоличествоЭлементовДляЗаписи
	|ИЗ
	|	ИдентификаторыОбъектов КАК ИдентификаторыОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИдентификаторыОбъектов.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	ИдентификаторыОбъектов.ИдентификаторХарактеристики КАК ИдентификаторХарактеристики
	|ИЗ
	|	ИдентификаторыОбъектов КАК ИдентификаторыОбъектов
	|ГДЕ
	|	ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрСведений.СоответствиеНоменклатурыРаботаСНоменклатурой КАК СоответствиеНоменклатурыРаботаСНоменклатурой
	|			ГДЕ
	|				ИдентификаторыОбъектов.ИдентификаторХарактеристики <> """"
	|				И СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления В (&СтатусСопоставлено)
	|				И ИдентификаторыОбъектов.ИдентификаторНоменклатуры = СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса
	|				И ИдентификаторыОбъектов.ИдентификаторХарактеристики = СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторХарактеристикиСервиса
	|				И НЕ (ИдентификаторыОбъектов.Номенклатура = СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура
	|				И ИдентификаторыОбъектов.Характеристика = СоответствиеНоменклатурыРаботаСНоменклатурой.Характеристика)
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрСведений.СоответствиеНоменклатурыРаботаСНоменклатурой КАК СоответствиеНоменклатурыРаботаСНоменклатурой
	|			ГДЕ
	|				ИдентификаторыОбъектов.ИдентификаторХарактеристики <> """"
	|				И СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления В (&СтатусСопоставлено)
	|				И СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторХарактеристикиСервиса = """"
	|				И ИдентификаторыОбъектов.ИдентификаторНоменклатуры = СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса
	|				И ИдентификаторыОбъектов.Номенклатура <> СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрСведений.СоответствиеНоменклатурыРаботаСНоменклатурой КАК СоответствиеНоменклатурыРаботаСНоменклатурой
	|			ГДЕ
	|				ИдентификаторыОбъектов.ИдентификаторХарактеристики = """"
	|				И СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления В (&СтатусСопоставлено)
	|				И СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторХарактеристикиСервиса = """"
	|				И ИдентификаторыОбъектов.ИдентификаторНоменклатуры = СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса
	|				И ИдентификаторыОбъектов.Номенклатура <> СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура)";
	
	СтатусСопоставлено = Новый Массив;
	
	СтатусСопоставлено.Добавить(Перечисления.СтатусыСопоставленияРаботаСНоменклатурой.Сопоставлено);
	СтатусСопоставлено.Добавить(Перечисления.СтатусыСопоставленияРаботаСНоменклатурой.Проверено);
	
	Запрос.УстановитьПараметр("СсылкиНоменклатурыИХарактеристик", СсылкиНоменклатурыИХарактеристик);
	Запрос.УстановитьПараметр("СтатусСопоставлено", СтатусСопоставлено);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбъектыДляЗаписи                  = Результат[2].Выгрузить();
	ИдентификаторыДублиТекущейВыборки = Результат[3].Выгрузить();
	КоличествоЭлементовДляЗаписи      = Результат[4].Выгрузить()[0].КоличествоЭлементовДляЗаписи;
	ИдентификаторыДублиПоДаннымИБ     = Результат[5].Выгрузить();
	
	ЕстьДублиИдентификаторов = 
		ИдентификаторыДублиТекущейВыборки.Количество() > 0 
			ИЛИ ИдентификаторыДублиПоДаннымИБ.Количество() >0;
	
	// В запросе нельзя свернуть данные по идентификаторам, поскольку ссылка номенклатуры и характеристики
	// являются разными объектами и нельзя использовать агрегирующие функции сразу на два поля.
	
	Для каждого ЭлементКоллекции Из ИдентификаторыДублиТекущейВыборки Цикл
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("ИдентификаторНоменклатуры", ЭлементКоллекции.ИдентификаторНоменклатуры);
		Отбор.Вставить("ИдентификаторХарактеристики", ЭлементКоллекции.ИдентификаторХарактеристики);
		
		СтрокиДублей = ОбъектыДляЗаписи.НайтиСтроки(Отбор);
		
		// Удаление всех строк кроме первой.
		Для Счетчик = 1 По СтрокиДублей.Количество() - 1 Цикл
			ОбъектыДляЗаписи.Удалить(СтрокиДублей[Счетчик]);
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого ЭлементКоллекции Из ИдентификаторыДублиПоДаннымИБ Цикл
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("ИдентификаторНоменклатуры", ЭлементКоллекции.ИдентификаторНоменклатуры);
		Отбор.Вставить("ИдентификаторХарактеристики", ЭлементКоллекции.ИдентификаторХарактеристики);
		
		СтрокиДублей = ОбъектыДляЗаписи.НайтиСтроки(Отбор);
		
		Для Счетчик = 0 По СтрокиДублей.Количество() - 1 Цикл
			ОбъектыДляЗаписи.Удалить(СтрокиДублей[Счетчик]);
		КонецЦикла;
		
	КонецЦикла;

	Если ОбъектыДляЗаписи.Количество() <> КоличествоЭлементовДляЗаписи Тогда
		ЕстьДублиИдентификаторов = Истина;
	КонецЕсли;
	
	Если НоменклатураИХарактеристики.Количество() <> КоличествоЭлементовДляЗаписи Тогда
		ЕстьСтрокиБезНоменклатуры = Истина;
	КонецЕсли;	
	
	Возврат ОбъектыДляЗаписи;

КонецФункции

&НаСервереБезКонтекста
Функция ЕстьСопоставленияДляСохранения(НоменклатураДляСопоставления, ПодсистемаВладелец)
	
	Запрос = Новый Запрос;
	
	РаботаСНоменклатурой.ПодготовитьЗапросДляПроверкиНаличияПодтвержденныхЗаписей(
		Запрос, НоменклатураДляСопоставления);
		
	Если ПодсистемаВладелец = "ТорговыеПредложения"
		И ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ТорговыеПредложения") Тогда
		МодульТорговыеПредложения = ОбщегоНазначения.ОбщийМодуль("ТорговыеПредложенияСлужебный");
		МодульТорговыеПредложения.ПодготовитьЗапросСопоставленияНоменклатуры(Запрос);	
	КонецЕсли;
				
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ЗапуститьПоискСоответствийНоменклатуры()
	
	ДлительнаяОперация = НайтиСоответствияНаСервере();
	
	Если Не ДлительнаяОперация = Неопределено
		И ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		НастроитьФормуПриДлительнойОперации(Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПриСоздании()
	
	РежимОтбора                                = "ВсяНоменклатура";
	ОтборПоДействию                            = "Все";
	ФонУправляющегоПоля                        = ЦветаСтиля.ЦветФонаШапкиТаблицы;
	ФонОбычный                                 = ЦветаСтиля.ЦветФонаКнопки;
	ВариантыПоискаИндекс                       = Новый ФиксированноеСоответствие(Новый Соответствие);
	ПоказыватьВопросПоВидамНоменклатуры        = ПоказыватьВопросПоЗаполнениюВидовНоменклатуры();
	
	// Отображение поиска выполнять с сохранением данных.
	
	ОтображатьПоискСервиса = Ложь;
	
	// По умолчанию доступность отключена, переопределяется сохраненной настройкой.
	
	Элементы.УстанавливатьАвтоматическийРежимОбновления.Доступность = Ложь;
	
	Если ОтсутствуютДанные Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ОтсутствуютДанные;
		ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПоказыватьВопросПоЗаполнениюВидовНоменклатуры()
	
	СтрокаНастроек = 
		ХранилищеСистемныхНастроек.Загрузить("Обработка.РаботаСНоменклатурой.Форма.ВопросПоЗаполнениюВидовНоменклатуры/ТекущиеДанные");	
	
	Если СтрокаНастроек = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаНастроек) = Тип("Соответствие") 
		И СтрокаНастроек["БольшеНеПоказывать"] <> Неопределено Тогда
		
		Возврат Не СтрокаНастроек["БольшеНеПоказывать"];
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьПредложениеПоСопоставлениюВидовНоменклатуры()
	
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОСопоставленииВидовНоменклатуры", ЭтотОбъект);
	
	ТекстВопроса = НСтр("ru = 'Виды номенклатуры можно заполнить по данным сервиса'");
	Кнопки       = Новый СписокЗначений;
	Кнопки.Добавить("ПерейтиКВидамНоменклатуры", НСтр("ru = 'Перейти к видам номенклатуры'"));
	Кнопки.Добавить("Пропустить", НСтр("ru = 'Пропустить'"));
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.КнопкаПоУмолчанию = "ПерейтиКВидамНоменклатуры";
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Истина;
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Заполнение видов номенклатуры'");
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, ТекстВопроса, Кнопки, ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСопоставленииВидовНоменклатуры(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Значение = "ПерейтиКВидамНоменклатуры" Тогда
			
			ВидыНоменклатуры = ПолучитьИзВременногоХранилища(АдресСопоставленныхВидовНоменклатуры);
			
			РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуСпискаВидаНоменклатуры(
				ВидыНоменклатуры, Неопределено, Неопределено);
			
		КонецЕсли;
		
		Если ПоказыватьВопросПоВидамНоменклатуры = Результат.БольшеНеЗадаватьЭтотВопрос Тогда
			ПоказыватьВопросПоВидамНоменклатуры = Не Результат.БольшеНеЗадаватьЭтотВопрос;
			СохранитьНастройкуБольшеНеПоказыватьВопросНаСервере(Результат.БольшеНеЗадаватьЭтотВопрос);
		КонецЕсли;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОЗавершенииСопоставления()
	
	ПоказатьОповещениеПользователя("1С:Номенклатура",, НСтр("ru = 'Выполнено сопоставление номенклатуры'"));
	Оповестить(РаботаСНоменклатуройКлиент.ОписаниеОповещенийПодсистемы().СопоставлениеНоменклатуры);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтатусыСопоставления()
	
	Результат = Новый Структура;
	
	Результат.Вставить("НеСопоставлено", ПредопределенноеЗначение("Перечисление.СтатусыСопоставленияРаботаСНоменклатурой.НеСопоставлено"));
	Результат.Вставить("Выбрано",        ПредопределенноеЗначение("Перечисление.СтатусыСопоставленияРаботаСНоменклатурой.Выбрано"));
	Результат.Вставить("Проверено",      ПредопределенноеЗначение("Перечисление.СтатусыСопоставленияРаботаСНоменклатурой.Проверено"));
	Результат.Вставить("Сопоставлено",   ПредопределенноеЗначение("Перечисление.СтатусыСопоставленияРаботаСНоменклатурой.Сопоставлено"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СформироватьСписокФормыСопоставленияНоменклатуры()
	
	РаботаСНоменклатурой.СформироватьСписокФормыСопоставления(ПодсистемаВладелец, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПредставлениеРежимаОтбора(Знач Элементы, Знач Режим, Знач Представление)
	
	Если Элементы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.РежимОтбора.СписокВыбора.НайтиПоЗначению(Режим);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Элемент <> Неопределено,
		СтрШаблон(
			НСтр(
				"ru = 'Не удалось найти режим отбора [%1]'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			Режим),
		"УстановитьПредставлениеРежимаОтбора");
	
	Элемент.Представление = Представление;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПодтвержденныеСопоставления()

	ДлительнаяОперация = СохранениеСопоставлений();
	
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ПараметрыОжидания.ТекстСообщения                  = НСтр("ru = 'Сохранение сопоставлений номенклатуры.'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения      = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания            = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения               = Истина;
	
	ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения(
		"СохранитьПодтвержденныеСопоставленияЗавершение", ЭтотОбъект, ПараметрыОжидания);
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
		ДлительнаяОперацияЗавершение,
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПодтвержденныеСопоставленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	РаботаСНоменклатуройКлиент.ВывестиСообщения(Результат);
	
	Отказ = Ложь;
	
	ПолучитьРезультатСохраненияСопоставлений(Отказ, Результат.АдресРезультата);
		
	// Если были произведены новые сопоставления видов номенклатуры, появляется предложение по их заполнению.
	
	Если Не Отказ Тогда
		
		ОповеститьОЗавершенииСопоставления();
		
		Если ЗначениеЗаполнено(АдресСопоставленныхВидовНоменклатуры)
			И ПоказыватьВопросПоВидамНоменклатуры Тогда
			
			ПоказатьПредложениеПоСопоставлениюВидовНоменклатуры();
		Иначе
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьРезультатСохраненияСопоставлений(Отказ, АдресРезультата)
	
	РезультатСохраненияСопоставлений = РаботаСНоменклатурой.ДанныеВременногоХранилища(АдресРезультата);
	
	Если РезультатСохраненияСопоставлений = Неопределено 
		ИЛИ РезультатСохраненияСопоставлений.Отказ Тогда
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(РезультатСохраненияСопоставлений.ВидыНоменклатурыДляСопоставления) Тогда
		АдресСопоставленныхВидовНоменклатуры = ПоместитьВоВременноеХранилище(
			РезультатСохраненияСопоставлений.ВидыНоменклатурыДляСопоставления, УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СохранениеСопоставлений()
	
	НастроитьФормуПриДлительнойОперации(Истина, Истина);
	
	ПараметрыМетода = Новый Структура;
	
	ПараметрыМетода.Вставить("ЗаполнятьНоменклатуруПриСопоставлении",      ЗаполнятьНоменклатуруПриСопоставлении);
	ПараметрыМетода.Вставить("УстанавливатьАвтоматическийРежимОбновления", УстанавливатьАвтоматическийРежимОбновления);
	ПараметрыМетода.Вставить("НоменклатураДляСопоставления",               НоменклатураДляСопоставления);
	ПараметрыМетода.Вставить("ПодсистемаВладелец",                         ПодсистемаВладелец);
	
	НаименованиеЗадания = НСтр("ru = '1С:Номенклатура. Сохранение подтвержденных сопоставлений номенклатуры.'");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.КлючФоновогоЗадания         = "";
	ПараметрыВыполнения.ОжидатьЗавершение           = 0;
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("РаботаСНоменклатурой.СохранитьПодтвержденныеСопоставления",
		ПараметрыМетода, 
		ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтбор()
	
	ОбновитьОтборСписка();
	
	Если РежимОтбора = "ТочноеСовпадение" Тогда
		ОтображатьПоискСервиса = Ложь;
	ИначеЕсли РежимОтбора = "НеточноеСовпадение" Тогда
		ОтображатьПоискСервиса = Истина;
	КонецЕсли;
	
	Если ОтображатьПоискСервиса Тогда
		ПоказатьСписокВариантов();
	КонецЕсли;
	
	УправлениеОтображением();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборСписка()
	
	Если РежимОтбора = "ТочноеСовпадение" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТочноеСовпадение", 
			Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли РежимОтбора = "НеточноеСовпадение" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТочноеСовпадение", 
			Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТочноеСовпадение", 
			Ложь, ВидСравненияКомпоновкиДанных.Равно, , Ложь);
	КонецЕсли;
	
	Если ОтборПоДействию = "Выбрать" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", 
			"НеСопоставлено", ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли ОтборПоДействию = "Подтвердить" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", 
			"НаПроверке", ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли ОтборПоДействию = "Сопоставлено" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", 
			"Проверено", ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", , , , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРеквизитыСпискаНаСервере(Знач ЗаписиДляИзменения, ЗначенияРеквизитов, ТребуетсяПроверка);
	
	ОбщийСчетчик              = 0;
	ТекущийСчетчикПорции      = 0;
	ДанныеДляФильтрации       = Новый Массив;
	КоличествоЭлементов       = ЗаписиДляИзменения.Количество();
	РазмерПорции              = 1000;
	ЕстьСтрокиБезНоменклатуры = Ложь;
	ЕстьДублиИдентификаторов  = Ложь;
	
	Для каждого ЭлементКоллекции Из ЗаписиДляИзменения Цикл
		
		ДанныеДляФильтрации.Добавить(Новый Структура("Номенклатура, Характеристика", 
			ЭлементКоллекции.Номенклатура, ЭлементКоллекции.Номенклатура));
			
		Если ТекущийСчетчикПорции = РазмерПорции
			ИЛИ ОбщийСчетчик = КоличествоЭлементов - 1 Тогда
			
			ИзменитьЗаписиРегистра(ЗаписиДляИзменения, ТребуетсяПроверка, ЗначенияРеквизитов,
				ЕстьДублиИдентификаторов, ЕстьСтрокиБезНоменклатуры);
						
			ТекущийСчетчикПорции = 0;
			
		КонецЕсли;	
		
		ТекущийСчетчикПорции = ТекущийСчетчикПорции + 1;
		ОбщийСчетчик = ОбщийСчетчик + 1;
		
	КонецЦикла;	
	
	Если ЕстьДублиИдентификаторов Тогда
		СообщитьПользователюОНаличииИдентификаторов(ЗаписиДляИзменения.Количество() > 1);
	КонецЕсли;
	
	Если ЕстьСтрокиБезНоменклатуры Тогда
		СообщитьПользователюОбОтсутствииНоменклатуры(ЗаписиДляИзменения.Количество() > 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРеквизитыСписка(Знач ЗаписиДляИзменения, ЗначенияРеквизитов, ТребуетсяПроверка);
	
	ИзменитьРеквизитыСпискаНаСервере(ЗаписиДляИзменения, ЗначенияРеквизитов, ТребуетсяПроверка);
	
	ВыполнитьРасчетСтатистики();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗаписиРегистра(ЗаписиДляИзменения, ТребуетсяПроверка, ЗначенияРеквизитов,
			ЕстьДублиИдентификаторов, ЕстьСтрокиБезНоменклатуры)
	
	Если ТребуетсяПроверка Тогда
		ДанныеДляЗаписи = ДанныеДляЗаписиВРегистрСоответствия(ЗаписиДляИзменения, ЕстьДублиИдентификаторов, ЕстьСтрокиБезНоменклатуры);
	Иначе
		ДанныеДляЗаписи = ЗаписиДляИзменения;
	КонецЕсли;
	
	Если ДанныеДляЗаписи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоменклатураСХарактеристиками = Новый Соответствие;
	
	НачатьТранзакцию();
	
	Попытка
				
		Для каждого ЭлементКоллекции Из ДанныеДляЗаписи Цикл
			
			Запись = РегистрыСведений.СоответствиеНоменклатурыРаботаСНоменклатурой.СоздатьМенеджерЗаписи();
			
			Запись.Номенклатура = ЭлементКоллекции.Номенклатура;
			Запись.Характеристика = ЭлементКоллекции.Характеристика;
			Запись.Прочитать();
				
			ЗаполнитьЗначенияСвойств(Запись, ЗначенияРеквизитов);
			
			Если Не ЗначениеЗаполнено(Запись.ИдентификаторНоменклатурыСервиса) Тогда
				Запись.СтатусСопоставления = СтатусыСопоставления().НеСопоставлено;
			КонецЕсли;

			Если Не ЗначениеЗаполнено(Запись.Характеристика) И ЗначениеЗаполнено(Запись.ИдентификаторХарактеристикиСервиса) Тогда
				// Привязка характеристики сервиса к номенклатуре.
				Запись.РежимЗагрузкиХарактеристик = Перечисления.РежимыЗагрузкиХарактеристикРаботаСНоменклатурой.ЗагружатьХарактеристикиКакНоменклатуру;
			КонецЕсли;
			
			Запись.Записать(Истина);

			Если ЗначениеЗаполнено(ЭлементКоллекции.Характеристика) Тогда
				НоменклатураСХарактеристиками.Вставить(ЭлементКоллекции.Номенклатура);
			КонецЕсли;
						
		КонецЦикла;
		
		// В случае наличия характеристик, производится обновление основных записей регистра соответствия номенклатуры:
		Если НоменклатураСХарактеристиками.Количество() > 0 Тогда
			ИзменитьОсновныеЗаписиСоответствияНоменклатуры(
				РаботаСНоменклатурой.КлючиКоллекцииКакМассив(НоменклатураСХарактеристиками));
		КонецЕсли;
				
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		РаботаСНоменклатурой.ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(
			НСтр("ru = 'Изменение сопоставления 1С:Номенклатура.'"), ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
	КонецПопытки;
			
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуНоменклатуры(ИдентификаторНоменклатуры, ИдентификаторХарактеристики)
	
	Идентификаторы = Новый Структура;
	Идентификаторы.Вставить("ИдентификаторНоменклатуры", ИдентификаторНоменклатуры);
	Идентификаторы.Вставить("ИдентификаторХарактеристики", ИдентификаторХарактеристики);
	
	РаботаСНоменклатуройКлиент.ОткрытьФормуКарточкиНоменклатуры(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Идентификаторы), ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Скрытие характеристики номенклатуры.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокХарактеристика.Имя);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Характеристика");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Скрытие характеристики номенклатуры сервиса.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокПредставлениеХарактеристикиСервиса.Имя);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ИдентификаторХарактеристикиСервиса");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Видимость номенклатуры сервиса (скрыть, если не выбрано значение).
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокПредставлениеНоменклатурыСервиса.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ИдентификаторНоменклатурыСервиса");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Скрытие характеристики варианта номенклатуры сервиса.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВариантыПоискаХарактеристикаСервиса.Имя);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВариантыПоиска.ИдентификаторХарактеристикиСервиса");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Гиперссылка показать все варианты (скрыть основные поля, если гиперссылка).
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВариантыПоискаПометка.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВариантыПоискаНоменклатураСервиса.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВариантыПоискаХарактеристикаСервиса.Имя);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВариантыПоиска.ЭтоГиперссылка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Гиперссылка показать все варианты (скрыть если гиперссылка).
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВариантыПоискаПоказатьВсе.Имя);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВариантыПоиска.ЭтоГиперссылка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Гиперссылка показать все варианты (показать если гиперссылка).
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВариантыПоискаПоказатьВсе.Имя);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВариантыПоиска.ЭтоГиперссылка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
	
	// Оформление состояния проверенных значений
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = 
		НСтр("ru = 'Оформление состояния проверенных значений'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСостояние.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСостояниеГиперссылка.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Проверено";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст",
		НСтр("ru = 'Сопоставлено'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветОтметки", ЦветаПалитры.Зеленый);
	
	// Оформление состояния значений на проверке
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = 
		НСтр("ru = 'Оформление состояния значений на проверке'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСостояние.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСостояниеГиперссылка.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "НаПроверке";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст",
		НСтр("ru = 'Подтвердить'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветОтметки", ЦветаПалитры.Желтый);
	
	// Оформление состояния значений на проверке
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = 
		НСтр("ru = 'Оформление состояния значений на проверке'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСостояние.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСостояниеГиперссылка.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "НеСопоставлено";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст",
		НСтр("ru = 'Выбрать'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветОтметки", ЦветаПалитры.Серый);
	
	// Скрыть состояние с гиперссылой
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = 
		НСтр("ru = 'Скрыть состояние с гиперссылой'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСостояниеГиперссылка.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Проверено";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Скрыть состояние без гиперссыли
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Представление = 
		НСтр("ru = 'Скрыть состояние без гиперссыли'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСостояние.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = "Проверено";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСоответствия()
		
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ПараметрыОжидания.ТекстСообщения                  = НСтр("ru = 'Поиск соответствий 1С:Номенклатура.'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения      = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания            = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения               = Истина;
	ПараметрыОжидания.Вставить("ИдентификаторЗадания", ИдентификаторЗадания);
	
	ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения(
		"НайтиСоответствияЗавершение", ЭтотОбъект, ПараметрыОжидания);
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
		ДлительнаяОперацияЗавершение,
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСоответствияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	РаботаСНоменклатуройКлиент.ВывестиСообщения(Результат, Истина);
	
	ВыполнитьРасчетСтатистики();
	
	Оповестить(РаботаСНоменклатуройКлиент.ОписаниеОповещенийПодсистемы().СопоставлениеНоменклатуры);
	
	УправлениеОтображением();
	
	НастроитьФормуПриДлительнойОперации(Ложь);
	
КонецПроцедуры

&НаСервере
Функция НайтиСоответствияНаСервере()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Статус",                         "Выполняется");
	Результат.Вставить("ИдентификаторЗадания",           Неопределено);
	Результат.Вставить("АдресРезультата",                "");
	Результат.Вставить("АдресДополнительногоРезультата", "");
	Результат.Вставить("КраткоеПредставлениеОшибки",     "");
	Результат.Вставить("ПодробноеПредставлениеОшибки",   "");
	Результат.Вставить("Сообщения",                      Новый ФиксированныйМассив(Новый Массив));
	
	// Поиск запущенного ранее регламентного задания.
	АктивныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода, Состояние",
		"РаботаСНоменклатурой.ПоискСоответствийНоменклатурыСервиса", СостояниеФоновогоЗадания.Активно));
	
	Если АктивныеЗадания.Количество() Тогда
		ЗаполнитьЗначенияСвойств(Результат, АктивныеЗадания[0]);
		Результат.ИдентификаторЗадания = АктивныеЗадания[0].УникальныйИдентификатор;
		Возврат Результат;
	КонецЕсли;
	
	// Поиск запущенного ранее фонового задания из формы.
	НаименованиеЗадания = НСтр("ru = '1С:Номенклатура. Поиск соответствий 1С:Номенклатура.'");
	
	АктивныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Наименование, Состояние",
		НаименованиеЗадания, СостояниеФоновогоЗадания.Активно));
	
	Если АктивныеЗадания.Количество() Тогда
		ЗаполнитьЗначенияСвойств(Результат, АктивныеЗадания[0]);
		Результат.ИдентификаторЗадания = АктивныеЗадания[0].УникальныйИдентификатор;
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Номенклатура", НоменклатураДляСопоставления.ВыгрузитьЗначения());
	ПараметрыМетода.Вставить("ПодсистемаВладелец", ПодсистемаВладелец);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.КлючФоновогоЗадания         = "";
	ПараметрыВыполнения.ОжидатьЗавершение           = 0;
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("РаботаСНоменклатурой.ПоискСоответствийНоменклатурыСервиса",
		ПараметрыМетода, 
		ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСписокВариантов()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Если Элементы.ГруппаПоискаСтраницы.ТекущаяСтраница <> Элементы.ГруппаНичегоНеВыбрано Тогда
			Элементы.ГруппаПоискаСтраницы.ТекущаяСтраница = Элементы.ГруппаНичегоНеВыбрано;
		КонецЕсли;
		ТекущийКлючВариантов = "";
		Возврат;
	КонецЕсли;
	
	НовыйКлюч = "" + ТекущиеДанные.Номенклатура.УникальныйИдентификатор() + "-" + ТекущиеДанные.Характеристика.УникальныйИдентификатор();
	Если ТекущийКлючВариантов = НовыйКлюч Тогда
		Возврат;
	Иначе
		ТекущийКлючВариантов = НовыйКлюч;
	КонецЕсли;
	
	Если ТекущиеДанные.КоличествоСовпадений = 1
		И ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторНоменклатурыСервиса) Тогда
		
		Если ВариантыПоискаИндекс.Получить(ТекущийКлючВариантов) = Неопределено Тогда
			
			СтрокаВарианта = ВариантыПоиска.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВарианта, ТекущиеДанные);
			СтрокаВарианта.Пометка = Истина;
			
			ВариантыПоискаИндексОбновленный = Новый Соответствие(ВариантыПоискаИндекс);
			ВариантыПоискаИндексОбновленный.Вставить(ТекущийКлючВариантов, Истина);
			ВариантыПоискаИндекс = Новый ФиксированноеСоответствие(ВариантыПоискаИндексОбновленный);
			
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",   ТекущиеДанные.Номенклатура);
		Отбор.Вставить("Характеристика", ТекущиеДанные.Характеристика);
		Элементы.ВариантыПоиска.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
		
		Если Элементы.ГруппаПоискаСтраницы.ТекущаяСтраница <> Элементы.ГруппаВарианты Тогда
			Элементы.ГруппаПоискаСтраницы.ТекущаяСтраница = Элементы.ГруппаВарианты;
		КонецЕсли;
		
	Иначе
		
		Если ВариантыПоискаИндекс.Получить(ТекущийКлючВариантов) = Неопределено Тогда
			
			ПараметрыПодбораВариантов = Новый Структура;
			ПараметрыПодбораВариантов.Вставить("КлючВариантов",  ТекущийКлючВариантов);
			ПараметрыПодбораВариантов.Вставить("Номенклатура",   ТекущиеДанные.Номенклатура);
			ПараметрыПодбораВариантов.Вставить("Характеристика", ТекущиеДанные.Характеристика);
			ПараметрыПодбораВариантов.Вставить("ИдентификаторНоменклатурыСервиса",
				ТекущиеДанные.ИдентификаторНоменклатурыСервиса);
			ПараметрыПодбораВариантов.Вставить("ИдентификаторХарактеристикиСервиса",
				ТекущиеДанные.ИдентификаторХарактеристикиСервиса);
			
			НачатьОбновлениеВариантовСопоставления(ПараметрыПодбораВариантов);
			
		Иначе
			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",   ТекущиеДанные.Номенклатура);
			Отбор.Вставить("Характеристика", ТекущиеДанные.Характеристика);
			
			Элементы.ВариантыПоиска.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
			
			Если Элементы.ГруппаПоискаСтраницы.ТекущаяСтраница <> Элементы.ГруппаВарианты Тогда
				Элементы.ГруппаПоискаСтраницы.ТекущаяСтраница = Элементы.ГруппаВарианты;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеОтображением();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОбновлениеВариантовСопоставления(ПараметрыПодбораВариантов)
	
	ДлительнаяОперация = ОбновитьВариантыСопоставленияВФоне(ПараметрыПодбораВариантов,
		ЭтотОбъект.УникальныйИдентификатор);
	
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	Если ДлительнаяОперация <> Неопределено
		И ДлительнаяОперация.Статус = "Выполняется" Тогда
		Элементы.ГруппаПоискаСтраницы.ТекущаяСтраница = Элементы.ГруппаВариантыДлительнаяОперация;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Поиск соответствий 1С:Номенклатура.'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Вставить("ИдентификаторЗадания", ИдентификаторЗадания);
	
	ОбновитьВариантыСопоставленияЗавершение = Новый ОписаниеОповещения("ОбновитьВариантыСопоставленияЗавершение",
		ЭтотОбъект, ПараметрыПодбораВариантов);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
		ОбновитьВариантыСопоставленияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьВариантыСопоставленияВФоне(Знач ПараметрыПодбораВариантов, Знач ИдентификаторФормы)
	
	Результат = Новый Структура;
	Результат.Вставить("Статус",                         "Выполняется");
	Результат.Вставить("ИдентификаторЗадания",           Неопределено);
	Результат.Вставить("АдресРезультата",                "");
	Результат.Вставить("АдресДополнительногоРезультата", "");
	Результат.Вставить("КраткоеПредставлениеОшибки",     "");
	Результат.Вставить("ПодробноеПредставлениеОшибки",   "");
	Результат.Вставить("Сообщения",                      Новый ФиксированныйМассив(Новый Массив));
	
	// Поиск запущенного ранее фонового задания из формы.
	НаименованиеЗадания = НСтр("ru = '1С:Номенклатура. Обновление вариантов сопоставления номенклатуры.'");
	
	АктивныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Наименование, Состояние",
		НаименованиеЗадания, СостояниеФоновогоЗадания.Активно));
	
	Если АктивныеЗадания.Количество() Тогда
		НайденноеЗадание = АктивныеЗадания[0];
		Если НайденноеЗадание.Ключ = ПараметрыПодбораВариантов.КлючВариантов Тогда
			ЗаполнитьЗначенияСвойств(Результат, НайденноеЗадание);
			Результат.ИдентификаторЗадания = АктивныеЗадания[0].УникальныйИдентификатор;
			Возврат Результат;
		Иначе
			НайденноеЗадание.Отменить();
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.КлючФоновогоЗадания = ПараметрыПодбораВариантов.КлючВариантов;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("РаботаСНоменклатурой.ОбновитьВариантыСопоставленияНоменклатуры",
		ПараметрыПодбораВариантов, 
		ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВариантыСопоставленияЗавершение(Результат, ПараметрыПодбораВариантов) Экспорт
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ОтображатьПоискСервиса = Не ОтображатьПоискСервиса;
		
	ИначеЕсли Результат = Неопределено
		Или Результат.Статус <> "Выполнено"
		Или ПараметрыПодбораВариантов.Номенклатура <> ТекущиеДанные.Номенклатура
		Или ПараметрыПодбораВариантов.Характеристика <> ТекущиеДанные.Характеристика
		Или ВариантыПоискаИндекс.Получить(ПараметрыПодбораВариантов.КлючВариантов) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыОбновленияВариантов = Новый Структура;
	ПараметрыОбновленияВариантов.Вставить("ДанныеСервиса", Результат.АдресРезультата);
	ПараметрыОбновленияВариантов.Вставить("ТекущийВариант", ПараметрыПодбораВариантов);
	
	ОбновитьВариантыСопоставленияНаСервере(ПараметрыОбновленияВариантов);
	
	ВыполнитьРасчетСтатистики();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВариантыСопоставленияНаСервере(ПараметрыОбновленияВариантов)
	
	Если ЭтоАдресВременногоХранилища(ПараметрыОбновленияВариантов.ДанныеСервиса) Тогда
		ДанныеСервиса = ПолучитьИзВременногоХранилища(ПараметрыОбновленияВариантов.ДанныеСервиса);
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекущийВариант = ПараметрыОбновленияВариантов.ТекущийВариант;
	
	Если Не ЗначениеЗаполнено(ДанныеСервиса) Тогда		
		
		Элементы.ПустойРезультатПоясняющийТекст.Заголовок = СтрШаблон(НСтр("ru = 'Не найдено вариантов для ""%1""'"),
			Строка(ТекущийВариант.Номенклатура));
		Элементы.ГруппаПоискаСтраницы.ТекущаяСтраница = Элементы.ГруппаПустойРезультат;
		
		Возврат;
		
	КонецЕсли;
	
	Элементы.ГруппаПоискаСтраницы.ТекущаяСтраница = Элементы.ГруппаВарианты;
	
	Для Каждого ДанныеВарианта Из ДанныеСервиса Цикл
		
		Если ДанныеВарианта.Характеристики.Количество() > 0 Тогда
			Для каждого ТекущаяХарактеристика Из ДанныеВарианта.Характеристики Цикл
				
				// Добавление строки варианта для каждой найденной характеристики
				
				НоваяСтрока = ВариантыПоиска.Добавить();
				
				НоваяСтрока.Номенклатура                       = ТекущийВариант.Номенклатура;
				НоваяСтрока.Характеристика                     = ТекущийВариант.Характеристика;
				НоваяСтрока.ПредставлениеНоменклатурыСервиса   = ДанныеВарианта.Наименование;
				НоваяСтрока.ИдентификаторНоменклатурыСервиса   = ДанныеВарианта.Идентификатор;
				НоваяСтрока.ПредставлениеХарактеристикиСервиса = ТекущаяХарактеристика.Наименование;
				НоваяСтрока.ИдентификаторХарактеристикиСервиса = ТекущаяХарактеристика.Идентификатор;

			КонецЦикла;
		Иначе
			
			// Добавление строки варианта для номенклатуры без характеристик
			
			НоваяСтрока = ВариантыПоиска.Добавить();
			
			НоваяСтрока.Номенклатура                     = ТекущийВариант.Номенклатура;
			НоваяСтрока.Характеристика                   = ТекущийВариант.Характеристика;
			НоваяСтрока.ПредставлениеНоменклатурыСервиса = ДанныеВарианта.Наименование;
			НоваяСтрока.ИдентификаторНоменклатурыСервиса = ДанныеВарианта.Идентификатор;
		КонецЕсли;

	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеСервиса) Тогда // обновление количества найденных вариантов
		
		Отбор = Новый Структура("Номенклатура, Характеристика", ТекущийВариант.Номенклатура, ТекущийВариант.Характеристика);
		ЗначенияРеквизитов = Новый Структура("КоличествоВариантов", ДанныеСервиса.Количество());
		
		ИзменитьРеквизитыСпискаНаСервере(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Отбор), ЗначенияРеквизитов, Ложь);
		
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура",   ТекущийВариант.Номенклатура);
	Отбор.Вставить("Характеристика", ТекущийВариант.Характеристика);
	
	Если ВариантыПоиска.НайтиСтроки(Отбор).Количество() >= 50 Тогда
		
		НоваяСтрока = ВариантыПоиска.Добавить();
		НоваяСтрока.Номенклатура   = ТекущийВариант.Номенклатура;
		НоваяСтрока.Характеристика = ТекущийВариант.Характеристика;
		НоваяСтрока.ВсеВарианты    = НСтр("ru = 'Показать все'");
		НоваяСтрока.ЭтоГиперссылка = Истина;
		
	КонецЕсли;
	
	Элементы.ВариантыПоиска.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
	// Установка текущего варианта.
	ОписаниеТекущегоВарианта = Новый Структура;
	ОписаниеТекущегоВарианта.Вставить("ИдентификаторНоменклатурыСервиса",
		ТекущийВариант.ИдентификаторНоменклатурыСервиса);
	ОписаниеТекущегоВарианта.Вставить("ИдентификаторХарактеристикиСервиса",
		ТекущийВариант.ИдентификаторХарактеристикиСервиса);
	ОписаниеТекущегоВарианта.Вставить("Номенклатура",
		ТекущийВариант.Номенклатура);
	ОписаниеТекущегоВарианта.Вставить("Характеристика",
		ТекущийВариант.Характеристика);
	
	Если ЗначениеЗаполнено(ОписаниеТекущегоВарианта.ИдентификаторНоменклатурыСервиса) Тогда
		
		ВыбранныйВариант = ВариантыПоиска.НайтиСтроки(ОписаниеТекущегоВарианта);
		
		Если ВыбранныйВариант.Количество() <> 0 Тогда
			ВыбранныйВариант[0].Пометка = Истина;
			Элементы.ВариантыПоиска.ТекущаяСтрока = ВариантыПоиска.Индекс(ВыбранныйВариант[0]);
		КонецЕсли;
		
	КонецЕсли;
	
	ВариантыПоискаИндексОбновленный = Новый Соответствие(ВариантыПоискаИндекс);
	ВариантыПоискаИндексОбновленный.Вставить(ТекущийВариант.КлючВариантов, Истина);
	
	ВариантыПоискаИндекс = Новый ФиксированноеСоответствие(ВариантыПоискаИндексОбновленный);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПоискаНоменклатурыСервиса(ЗаполнятьСтрокуПоиска = Истина)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыОткрытия = РаботаСНоменклатуройКлиент.ПараметрыФормыЗагрузкиНоменклатуры();
	
	ПараметрыОткрытия.РежимВыбораНоменклатуры       = Истина;
	ПараметрыОткрытия.ЗапрещатьВыборЗагруженных     = Истина;
	ПараметрыОткрытия.ПокупатьНоменклатуруПриВыборе = Ложь;
	
	Если ЗаполнятьСтрокуПоиска Тогда
		ПараметрыОткрытия.СтрокаПоиска = СокрЛП(СтрШаблон("%1 %2", ТекущиеДанные.Номенклатура, ТекущиеДанные.Характеристика));
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("НоменклатураСервисаВыборЗавершение", ЭтотОбъект);
	
	РаботаСНоменклатуройКлиент.ОткрытьФормуЗагрузкиНоменклатуры(
		ПараметрыОткрытия, 
		ЭтотОбъект, 
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСервисаВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	РаботаСНоменклатуройКлиент.ВывестиСообщения(Результат, Истина);
	
	Если Результат = Неопределено 
		ИЛИ Результат.ВыбранныеОбъекты.Количество() = 0 Тогда
		
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Отбор = Новый Структура("Номенклатура, Характеристика",
		ТекущиеДанные.Номенклатура, ТекущиеДанные.Характеристика);
		
	НоменклатураСервисаВыборЗавершениеНаСервере(Результат.ВыбранныеОбъекты[0], Отбор);
	
	ВыполнитьРасчетСтатистики();
	
КонецПроцедуры

&НаСервере
Процедура НоменклатураСервисаВыборЗавершениеНаСервере(СтрокаРезультата, Отбор)
		
	ИдентификаторыИспользуются = ИдентификаторыИспользуются(
		Отбор.Номенклатура, 
		Отбор.Характеристика, 
		СтрокаРезультата.ИдентификаторНоменклатуры, 
		СтрокаРезультата.ИдентификаторХарактеристики);
		
	Если ИдентификаторыИспользуются Тогда
		СообщитьПользователюОНаличииИдентификаторов(Ложь);
	КонецЕсли;	
		
	СтатусСопоставления = ?(ИдентификаторыИспользуются,
		СтатусыСопоставления().Выбрано, 
		СтатусыСопоставления().Проверено);
		
	ЗначенияРеквизитов = Новый Структура;
	
	ЗначенияРеквизитов.Вставить("ИдентификаторНоменклатурыСервиса",   СтрокаРезультата.ИдентификаторНоменклатуры);
	ЗначенияРеквизитов.Вставить("ИдентификаторХарактеристикиСервиса", СтрокаРезультата.ИдентификаторХарактеристики);
	ЗначенияРеквизитов.Вставить("ПредставлениеНоменклатурыСервиса",   СтрокаРезультата.НаименованиеНоменклатуры);
	ЗначенияРеквизитов.Вставить("ПредставлениеХарактеристикиСервиса", СтрокаРезультата.НаименованиеХарактеристики);
	ЗначенияРеквизитов.Вставить("СтатусСопоставления",                СтатусСопоставления);
	
	Если СтрокаРезультата.ИспользуютсяХарактеристики И Не ЗначениеЗаполнено(Отбор.Характеристика) Тогда
		// Привязка номенклатуры с характеристиками к номенклатуре без характеристик
		ЗначенияРеквизитов.Вставить("РежимЗагрузкиХарактеристик", Перечисления.РежимыЗагрузкиХарактеристикРаботаСНоменклатурой.НеЗагружатьХарактеристики);
	КонецЕсли;
	
	ИзменитьРеквизитыСпискаНаСервере(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Отбор), ЗначенияРеквизитов, Ложь);
		
	ВариантыПоискаТекущейНоменклатуры = ВариантыПоиска.НайтиСтроки(Отбор);
	
	// Установка пометки у вариантов.
	Для каждого ЭлементКоллекции Из ВариантыПоискаТекущейНоменклатуры Цикл
		ЭлементКоллекции.Пометка = 
			СтрокаРезультата.ИдентификаторНоменклатуры = ЭлементКоллекции.ИдентификаторНоменклатурыСервиса  
			И СтрокаРезультата.ИдентификаторХарактеристики = ЭлементКоллекции.ИдентификаторХарактеристикиСервиса;  
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьОсновныеЗаписиСоответствияНоменклатуры(Номенклатура)
	
	РаботаСНоменклатурой.ИзменитьОсновныеЗаписиСоответствияНоменклатуры(Номенклатура, Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ПустойРезультатГиперссылкаНажатие(Элемент)
	
	ОткрытьФормуПоискаНоменклатурыСервиса(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьВыборНаСервере(Знач ЗаписиДляИзменения)
	
	ЗначенияРеквизитов = Новый Структура;
	
	ЗначенияРеквизитов.Вставить("ИдентификаторНоменклатурыСервиса",   "");
	ЗначенияРеквизитов.Вставить("ИдентификаторХарактеристикиСервиса", "");
	ЗначенияРеквизитов.Вставить("ПредставлениеНоменклатурыСервиса",   "");
	ЗначенияРеквизитов.Вставить("ПредставлениеХарактеристикиСервиса", "");
	ЗначенияРеквизитов.Вставить("КоличествоВариантов",                0);
	ЗначенияРеквизитов.Вставить("ТочноеСовпадение",                   Ложь);
	ЗначенияРеквизитов.Вставить("СтатусСопоставления",                СтатусыСопоставления().НеСопоставлено);
	
	ИзменитьРеквизитыСпискаНаСервере(ЗаписиДляИзменения, ЗначенияРеквизитов, Ложь);
		
	Элементы.Список.Обновить();
	
	ОчиститьВыбранныеВарианты(ЗаписиДляИзменения);
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьВыбранныеВарианты(ЗаписиДляИзменения)
	
	Для каждого ЭлементКоллекции Из ЗаписиДляИзменения Цикл
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Номенклатура",   ЭлементКоллекции.Номенклатура);
		Отбор.Вставить("Характеристика", ЭлементКоллекции.Характеристика);
		
		ВариантыПоискаТекущейНоменклатуры = ВариантыПоиска.НайтиСтроки(Отбор);
		
		Для каждого ЭлементКоллекции Из ВариантыПоискаТекущейНоменклатуры Цикл
			ЭлементКоллекции.Пометка = Ложь;
		КонецЦикла;
	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПриДлительнойОперации(ЭтоНачалоОперации, ЭтоСохранение = Ложь)
	
	Если Не ЭтоНачалоОперации Тогда
		ОтсутствуютДанные = ДинамическийСписокПуст(Элементы.Список);
	КонецЕсли;
	
	Если ЭтоНачалоОперации Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ДлительнаяОперация;
	ИначеЕсли ОтсутствуютДанные Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ОтсутствуютДанные;
	Иначе
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ОсновныеДанные;
	КонецЕсли;
	
	Если ЭтоСохранение Тогда
		Элементы.НадписьПоискВариантов.Заголовок = НСтр("ru = 'Сохранение сопоставлений'");
	Иначе
		Элементы.НадписьПоискВариантов.Заголовок = НСтр("ru = 'Сопоставление номенклатуры'");
	КонецЕсли;
	
	Элементы.СохранитьСопоставление.Доступность = Не ЭтоНачалоОперации;
	Элементы.ГруппаНастройки.Доступность = Не ЭтоНачалоОперации; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Элементы.УстанавливатьАвтоматическийРежимОбновления.Доступность = ЗаполнятьНоменклатуруПриСопоставлении;
	
КонецПроцедуры

&НаСервере
Функция ДинамическийСписокПуст(ТаблицаФормы)

	СхемаКомпоновкиДанных = ТаблицаФормы.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКомпоновкиДанных = ТаблицаФормы.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
		НастройкиКомпоновкиДанных, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ТекстЗапроса = МакетКомпоновкиДанных.НаборыДанных.НаборДанныхДинамическогоСписка.Запрос;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1].Операторы[0].КоличествоПолучаемыхЗаписей = 1;
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Для каждого ЗначениеПараметра Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(ЗначениеПараметра.Имя, ЗначениеПараметра.Значение);
	КонецЦикла; 
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкуБольшеНеПоказыватьВопросНаСервере(Знач БольшеНеЗадаватьЭтотВопрос)
	
	Настройка = Новый Соответствие;
	Настройка.Вставить("БольшеНеПоказывать", БольшеНеЗадаватьЭтотВопрос);
	ХранилищеСистемныхНастроек.Сохранить(
		"Обработка.РаботаСНоменклатурой.Форма.ВопросПоЗаполнениюВидовНоменклатуры/ТекущиеДанные",, Настройка);
	
КонецПроцедуры

&НаКлиенте
Функция НовыеДоступныеДействияСтрокСписка()
	
	Результат = Новый Структура;
	
	Результат.Вставить("СнятьПометки"      , Ложь);
	Результат.Вставить("УстановитьПометки" , Ложь);
	Результат.Вставить("ОчиститьВыбор"     , Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДоступныеДействияСтрокСписка(Знач Строки)
	
	Результат = НовыеДоступныеДействияСтрокСписка();
	
	Для каждого Строка Из Строки Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(Строка);
		
		Если ДанныеСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеСтроки.Состояние = "Проверено" Тогда
			Результат.СнятьПометки  = Истина;
			Результат.ОчиститьВыбор = Истина;
		ИначеЕсли ДанныеСтроки.Состояние = "НаПроверке" Тогда
			Результат.УстановитьПометки = Истина;
			Результат.ОчиститьВыбор     = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьДействиеСтроки(Знач Строка)
	
	Если Строка.Состояние = "НеСопоставлено" Тогда
		ОткрытьФормуПоискаНоменклатурыСервиса();
	ИначеЕсли Строка.Состояние = "НаПроверке" Тогда
		СтрокиБезСопоставленных = ВыделенныеСтрокиБезСопоставленных(Элементы.Список.ПолучитьСтрокиДляОбработки());
		
		Если Не ЗначениеЗаполнено(СтрокиБезСопоставленных) Тогда
			Возврат;
		КонецЕсли;
		
		ИзменитьРеквизитыСписка(СтрокиБезСопоставленных, 
			Новый Структура("СтатусСопоставления", СтатусыСопоставления().Проверено), 
			Истина);
		
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеОтображением()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		Элементы.ПоказатьВарианты.Имя,
		"Заголовок",
		?(ОтображатьПоискСервиса,
			НСтр("ru = 'Скрыть варианты'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()),
			НСтр("ru = 'Показать варианты'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка())));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		Элементы.ГруппаПоиска.Имя,
		"Видимость",
		ОтображатьПоискСервиса);
	
	ОбновитьОтображениеСтатистики();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементаСтатистики(
	Знач СписокВыбора, 
	Знач ИдентификаторЗначения, 
	Знач ИдентификаторСтатистики, 
	Знач ПредставлениеЗначения)
	
	Элемент = СписокВыбора.НайтиПоЗначению(ИдентификаторЗначения);
	
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Значение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Статистика, ИдентификаторСтатистики, 0);
	
	Если Значение = 0 Тогда
		Представление = ПредставлениеЗначения;
	Иначе
		Представление = 
			СтрШаблон(
				НСтр(
					"ru = '%1(%2)'",
					ОбщегоНазначенияКлиент.КодОсновногоЯзыка()),
				ПредставлениеЗначения,
				Формат(Значение, "ЧН=0"));
	КонецЕсли;
	
	Если Элемент.Представление = Представление Тогда
		Возврат; // Представление уже установлено верно
	КонецЕсли;
	
	Элемент.Представление = Представление;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеСтатистики()
	
	СписокВыбора = Элементы.РежимОтбора.СписокВыбора;
	
	ОбновитьОтображениеЭлементаСтатистики(
		СписокВыбора,
		"ВсяНоменклатура", 
		"Количество",
		НСтр("ru = 'Вся номенклатура'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
	ОбновитьОтображениеЭлементаСтатистики(
		СписокВыбора,
		"ТочноеСовпадение", 
		"ТочноеСовпадение",
		НСтр("ru = 'Точное совпадение'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
	ОбновитьОтображениеЭлементаСтатистики(
		СписокВыбора,
		"НеточноеСовпадение", 
		"НеточноеСовпадение", 
		НСтр("ru = 'Неточное совпадение'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
	
	СписокВыбора = Элементы.ОтборПоДействию.СписокВыбора;
	
	ОбновитьОтображениеЭлементаСтатистики(
		СписокВыбора,
		"ВсяНоменклатура", 
		"Количество",
		НСтр("ru = 'Вся номенклатура'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
	ОбновитьОтображениеЭлементаСтатистики(
		СписокВыбора,
		"Выбрать", 
		"КоличествоНеСопоставлено", 
		НСтр("ru = 'Выбрать'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
	ОбновитьОтображениеЭлементаСтатистики(
		СписокВыбора,
		"Подтвердить", 
		"КоличествоНаПроверке", 
		НСтр("ru = 'Подтвердить'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
	ОбновитьОтображениеЭлементаСтатистики(
		СписокВыбора,
		"Сопоставлено", 
		"КоличествоПодготовлено", 
		НСтр("ru = 'Сопоставлено'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
	
КонецПроцедуры

#Область РасчетСтатистики

&НаСервереБезКонтекста
Функция ВыполнитьРасчетСтатистикиНаСервере(Знач ИдентификаторФормы, ПодсистемаВладелец, Номенклатура)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = 
		НСтр(
			"ru = 'Расчет статистики сопоставления товарос с сервисом 1С:Номенклатура'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, 
		"РаботаСНоменклатурой.СтатистикаСопоставленияНоменклатуры",
		ПодсистемаВладелец,
		Номенклатура);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьРасчетСтатистики()
	
	ДлительнаяОперацияРасчетСтатистики = ВыполнитьРасчетСтатистикиНаСервере(
		УникальныйИдентификатор, ПодсистемаВладелец, НоменклатураДляСопоставления.ВыгрузитьЗначения());
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьРасчетСтатистикиЗавершение", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияРасчетСтатистики, Оповещение, ПараметрыОжидания);
	
	УправлениеОтображением();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРасчетСтатистикиЗавершение(Знач РезультатВыполнения, Знач ДополнительныеПараметры) Экспорт 
	
	Статистика = Неопределено;
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(РезультатВыполнения.ИнформацияОбОшибке);
		Возврат;
	ИначеЕсли РезультатВыполнения.Статус <> "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	Статистика = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
	
	УправлениеОтображением();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти