
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	АдаптацияФормыТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Создать(Команда)
	
	Если ЗначениеЗаполнено(Список.Параметры.Элементы) Тогда 
		ПараметрыОткрытияФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ВладелецКарты", Список.Параметры.Элементы[0].Значение));
	КонецЕсли;
	ОткрытьФорму("Справочник.ДисконтныеКарты.ФормаОбъекта", ПараметрыОткрытияФормы, ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если Не ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	//Элементы.ГруппаГлобальныеКоманды.Видимость = ЭтоИнтерфейсТакси;
	
КонецПроцедуры
#КонецОбласти