#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	АдаптацияТакси();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	Это85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ЭтоТакси = Не Это85;
	
	Если ЭтоТакси Тогда
		
		Элементы.Переместить(Элементы.ФормаВключитьВозможностьРедактирования, КоманднаяПанель);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
