#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает видимость элементов формы по доступному оборудованию на текущем рабочем месте
//
Процедура УстановитьВидимостьЭлементовПоДоступномуПодключаемомуОборудованию(Элементы, ЭлементыТСД="", ЭлементыВесы="") Экспорт
	
	// отключить видимость элементов
	МассивЭлементыТСД  = СтрРазделить(ЭлементыТСД, ",", Ложь);
	Для Каждого ИмяЭлемента Из МассивЭлементыТСД Цикл
		Элементы[СокрЛП(ИмяЭлемента)].Видимость = Ложь;
	КонецЦикла;
	МассивЭлементыВесы = СтрРазделить(ЭлементыВесы, ",", Ложь);
	Для Каждого ИмяЭлемента Из МассивЭлементыВесы Цикл
		Элементы[СокрЛП(ИмяЭлемента)].Видимость = Ложь;
	КонецЦикла;
	
	Если Не УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование() Тогда
		Возврат;
	КонецЕсли;
	
	// установить видимость элементов по доступному оборудованию
	СписокОборудованияОтбор = МенеджерОборудованияКлиентСервер.СписокОборудованияОтбор();
	СписокОборудованияОтбор.ТипыПО.ЭлектронныеВесы     = Истина;
	СписокОборудованияОтбор.ТипыПО.ТерминалСбораДанных = Истина;
	СписокОборудования = МенеджерОборудования.СписокОборудования(СписокОборудованияОтбор);
	Для Каждого ЭлементОборудования Из СписокОборудования Цикл
		Если ЭлементОборудования.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных Тогда
			Для Каждого ИмяЭлемента Из МассивЭлементыТСД Цикл
				Элементы[СокрЛП(ИмяЭлемента)].Видимость = Истина;
			КонецЦикла;
		ИначеЕсли ЭлементОборудования.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы Тогда
			Элементы.ЗапасыПолучитьВес.Видимость = Истина;
			Для Каждого ИмяЭлемента Из МассивЭлементыВесы Цикл
				Элементы[СокрЛП(ИмяЭлемента)].Видимость = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область РаботаСФормойПанельАдминистрирования

// Дополнительные переопределяемые действия с управляемой формой в Панели администрирования БПО
// при событии "ПриСозданииНаСервере".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма настройки оборудования
//  Отказ - Булево - Отказ создания
//  Параметры - Структура - Параметры операции
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура ПанельАдминистрированияПриСозданииНаСервере(Форма, Отказ, Параметры, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы;
	
	УчетРозничныхПродаж = ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаУправлениеОфлайнОборудование", "Видимость", УчетРозничныхПродаж);
	
	ДобавляемыеРеквизиты = Новый Массив();
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьОбменСПодключаемымОборудованиемOffline", Новый ОписаниеТипов("Булево")));
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Форма.ИспользоватьОбменСПодключаемымОборудованиемOffline = Константы.ИспользоватьОбменСПодключаемымОборудованиемOffline.Получить();
	
	Элемент = Элементы.Вставить(
		"ОфлайнОборудованиеПодключено", 
		Тип("ПолеФормы"), 
		Элементы.ГруппаУправлениеОфлайнОборудованиемПерваяСтрока,
		Элементы.ОткрытьОфлайнОборудование);
	Элемент.Вид                  = ВидПоляФормы.ПолеФлажка;
	Элемент.Заголовок            = НСтр("ru = 'Обмен с офлайн-оборудованием'");
	Элемент.ПутьКДанным          = "ИспользоватьОбменСПодключаемымОборудованиемOffline";
	Элемент.ПоложениеЗаголовка   = ПоложениеЗаголовкаЭлементаФормы.Право;
	Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Подсказка            = НСтр("ru = 'Использование правил обмена с оборудованием. 
							|Необходимо для использования офлайн-касс, прайс-чекеров и весов с печатью этикеток.'");
	Элемент.РасширеннаяПодсказка.Заголовок = Подсказка;
	Элемент.РасширеннаяПодсказка.Ширина = 39;
	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииРеквизита");

	РежимРаботы = Новый ФиксированнаяСтруктура(УправлениеНебольшойФирмойПовтИсп.РежимРаботыПрограммы());
	
	Элементы.ГруппаПечатьЭтикетокИЦенников.Видимость = ПолучитьФункциональнуюОпцию("ПечатьЭтикетокИЦенников") И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСтаруюОбработкуПечатиЦенников");
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Получить() Тогда
		Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Установить(Истина);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Дополнительная настройка доступности при изменении реквизита формы
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  РеквизитПутьКДанным - Строка
//
Процедура ПанельАдминистрированияУстановкаДоступности(Форма, РеквизитПутьКДанным) Экспорт
	
	УчетРозничныхПродаж = ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж");
	Если Не УчетРозничныхПродаж Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Обработка.ПанельАдминистрированияБПО.Форма.Настройки" тогда
		Если РеквизитПутьКДанным = "ИспользоватьОбменСПодключаемымОборудованиемOffline"
			Или РеквизитПутьКДанным = "" Тогда
			ОбменДоступен = Форма.ИспользоватьОбменСПодключаемымОборудованиемOffline;
			
			Элементы = Форма.Элементы;
			Элементы.ОткрытьОфлайнОборудование.Доступность = ОбменДоступен;
			Элементы.Группа_ОфлайнДополнение.Доступность = ОбменДоступен;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Позволяет заполнить пользовательские команды на Панели администрирования
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Команды - см. НастройкиПрограммыБПО.ТаблицаКоманд.
//
Процедура ПриЗаполненииКомандПанелиАдминистрирования(Форма, Команды) Экспорт
	
	УчетРозничныхПродаж = ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж");
	Если Не УчетРозничныхПродаж Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	
	Группа = НастройкиПрограммыБПО.НоваяГруппаПанелиАдминистрирования(Форма, "Группа_РабочиеМестаДополнение", Элементы.ГруппаРабочиеМеста);
	Группа.ОтображатьЗаголовок = Ложь;
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = Группа;
	Команда.Важность      = "Важное";
	Команда.Представление = НСтр("ru = 'Настройки РМК'");
	Команда.Подсказка     = НСтр("ru = 'Настройки рабочего места кассира.'");
	Команда.Обработчик    = "e1cib/command/ОбщаяКоманда.ОткрытьСписокНастроекРМК";
	
	Группа = НастройкиПрограммыБПО.НоваяГруппаПанелиАдминистрирования(Форма, "Группа_ОфлайнДополнение", Элементы.ГруппаУправлениеОфлайнОборудование);
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = Группа;
	Команда.Представление = НСтр("ru = 'Правила обмена с оборудованием'");
	Команда.Порядок       = 50;
	Команда.Подсказка     = НСтр("ru = 'Правила для выгрузки информации о товарах в офлайн кассы и весы.'");
	Команда.ИмяФормы      = "Справочник.ПравилаОбменаСПодключаемымОборудованиемOffline.ФормаСписка";
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = Группа;
	Команда.Представление = НСтр("ru = 'Настройка диапазонов SKU весового товара'");
	Команда.Порядок       = 80;
	Команда.Подсказка     = НСтр("ru = 'Для весового товара необходимо назначить диапазон SKU, который будет использоваться на весах в качестве кода товара.'");
	Команда.ИмяФормы      = "ОбщаяФорма.НастройкаДиапазоновSKU";
	
	Группа = НастройкиПрограммыБПО.НоваяГруппаПанелиАдминистрирования(Форма, "Группа_ФЗ54");
	Группа.Заголовок = НСтр("ru = 'Изменения 54-ФЗ'");
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = Группа;
	Команда.Представление = НСтр("ru = 'Подключить кассы к оператору фискальных данных'");
	Команда.Порядок       = 50;
	Команда.Важность      = "Важное";
	Команда.Подсказка     = НСтр("ru = 'Сервис  «1С-ОФД» обеспечит удобное подключение ваших касс к оператору фискальных данных без наценок к официальной стоимости услуг ОФД.'");
	Команда.Обработчик    = "http://v8.1c.ru/cnt.jsp/:kd_roz:/https://portal.1c.ru/applications/56";
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = Группа;
	Команда.Представление = НСтр("ru = 'Все о 54-ФЗ и переходе на онлайн-ККТ'");
	Команда.Порядок       = 80;
	Команда.Важность      = "Важное";
	Команда.Подсказка     = НСтр("ru = 'С 1 июля 2017 года можно будет использовать только те ККТ, которые передают данные о продажах в ФНС через оператора фискальных данных (Федеральный закон 54-ФЗ).'");
	Команда.Обработчик    = "http://v8.1c.ru/cnt.jsp/:kd_roz:/http://v8.1c.ru/kkt/";
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти