////////////////////////////////////////////////////////////////////////////////
// Подсистема "Оплата сервиса УНФ" (клиент).
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. ОплатаСервисаКлиентПереопределяемый.ПриОпределенииФормыНастроекОплатыСервиса
Процедура ПриОпределенииФормыНастроекОплатыСервиса(ИмяФормы) Экспорт
	
	ИмяФормы = "Обработка.ОплатаСервисаУНФ.Форма.НастройкаОплатыСервиса";
	
КонецПроцедуры

// Обработать команду оплаты.
// 
// Параметры:
//  СпособОплаты - Строка - Способ оплаты
//  СчетПоставщика - ДокументСсылка.СчетНаОплатуПоставщика - Счет поставщика
//  ПечатнаяФормаТабличногоДокумента - ТабличныйДокумент - Печатная форма табличного документа
//  Организация - СправочникСсылка.Организации - Организация
Процедура ОбработатьКомандуОплаты(СпособОплаты, СчетПоставщика, ПечатнаяФормаТабличногоДокумента, Организация) Экспорт
	
	Если СпособОплаты = "ОплатаНаличными" Тогда
		ИдентификаторПечатнойФормы = "ПечатнаяФорма";
		НазваниеПечатнойФормы = НСтр("ru = 'Счет поставщика'");
		
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
		ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
		ПечатнаяФорма.ТабличныйДокумент = ПечатнаяФормаТабличногоДокумента;
		ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
		
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
		
	ИначеЕсли СпособОплаты = "ОплатаСРасчетногоСчетаОтправка" Тогда
		ПараметрыОповещения = НовыеПараметрыОповещения(СчетПоставщика, Истина);
		ОповещениеВыбораСчета = Новый ОписаниеОповещения("ОповещениеВыбораСчета", ЭтотОбъект, ПараметрыОповещения);
		РегламентированнаяОтчетностьУСНКлиент.ПолучитьБанковскийСчетДляУплатыНалога(ОповещениеВыбораСчета, Организация);
	ИначеЕсли СпособОплаты = "ОплатаСРасчетногоСчетаРаспечатать" Тогда
		ПараметрыОповещения = НовыеПараметрыОповещения(СчетПоставщика, Ложь);
		ОповещениеВыбораСчета = Новый ОписаниеОповещения("ОповещениеВыбораСчета", ЭтотОбъект, ПараметрыОповещения);
		РегламентированнаяОтчетностьУСНКлиент.ПолучитьБанковскийСчетДляУплатыНалога(ОповещениеВыбораСчета, Организация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СоздатьПодпискуНаТарифНаОснованииСчетаНаОплату(ПараметрКоманды, ДополнительныеПараметры) Экспорт
	
	ОжидаемыеТипы = Новый Массив;
	ОжидаемыеТипы.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	ОжидаемыеТипы.Добавить(Тип("ДокументСсылка.СчетНаОплату"));
	ОжидаемыеТипыОписание = Новый ОписаниеТипов(ОжидаемыеТипы);
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("СоздатьПодпискуНаТарифНаОснованииСчетаНаОплату", "ПараметрКоманды", ПараметрКоманды, ОжидаемыеТипыОписание);
	
	ДанныеСчета = ОплатаСервисаУНФВызовСервера.ДанныеСчетаДляОформленияПодписки(ПараметрКоманды);
	Если ЗначениеЗаполнено(ДанныеСчета.ТекстОшибки) Тогда
		ПоказатьПредупреждение( , ДанныеСчета.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторСчета", ПараметрКоманды.УникальныйИдентификатор());
	ПараметрыФормы.Вставить("ДатаПодключения", ДанныеСчета.ДатаПодключения);
	ПараметрыФормы.Вставить("КодОО", ДанныеСчета.КодОО);
	ПараметрыФормы.Вставить("КодОбслуживаемогоАбонента", ДанныеСчета.КодОбслуживаемогоАбонента);
	
	ОткрытьФорму("Обработка.ОплатаСервисаУНФ.Форма.СозданиеПодписокНаОснованииСчета", 
		ПараметрыФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеПараметрыОповещения(Знач СчетПоставщика, Знач Файл)
	Результат = Новый Структура("СчетПоставщика,Файл", СчетПоставщика, Истина);
	Возврат Результат;
КонецФункции

Процедура ОповещениеВыбораСчета(БанковскийСчет, Параметры) Экспорт
	Если НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда
		Возврат;
	КонецЕсли;
	БанковскийСчетПоУмолчанию = БанковскийСчет;
	
	ПлатежноеПоручение = ОплатаСервисаУНФВызовСервера.ЗаполнитьБанковскийСчетИСоздатьПлатежноеПоручение(
		Параметры.СчетПоставщика, БанковскийСчетПоУмолчанию);
	Если Параметры.Файл Тогда
		СписокВыгрузки = Новый СписокЗначений;
		СписокВыгрузки.Добавить(ПлатежноеПоручение);
		
		ПараметрыОткрытия = Новый Структура("СписокПлатежек, БанковскийСчет", СписокВыгрузки, БанковскийСчетПоУмолчанию);
		ОткрытьФорму("Обработка.КлиентБанк.Форма.Форма", ПараметрыОткрытия);
		
	Иначе
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ПлатежноеПоручение);
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ПлатежноеПоручение", "ПлатежноеПоручение",
			МассивОбъектов, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
