
#Область ПрограммныйИнтерфейс

// Производит разложение данных дорожек магнитной карты по шаблонам.
// Параметры:
//  ДанныеДорожек - Массив -- массив строк. Значения полученные из дорожек.
//  ПараметрыДорожек - Массив - массив структур содержащих параметры настройки устройства, где:
//   * Использовать - булево - признак использования дорожки.
//   * НомерДорожки - число - порядковый номер дорожки 1-3.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Шаблон - СправочникСсылка.ШаблоныМагнитныхКарт - ;
//   * ДанныеДорожек - Структура:
//  	** Поле - Строка
//  	** ЗначениеПоля - Произвольный - 
//
Функция РасшифроватьКодМагнитнойКарты(ДанныеДорожек, ПараметрыДорожек) Экспорт;
	
	Возврат ОборудованиеУстройстваВводаВызовСервера.РасшифроватьКодМагнитнойКарты(ДанныеДорожек, ПараметрыДорожек);
	
КонецФункции            

// Генерировать внешнее событие для устройства ввода.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Процедура ГенерироватьВнешнееСобытие(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыВыполнениеКоманды = МенеджерОборудованияКлиентСервер.ПараметрыВыполнениеКоманды("ExternalEvent", Неопределено, ДополнительныеПараметры, Ложь, Ложь);
		
	МенеджерОборудованияКлиент.НачатьВыполнениеКоманды(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, 
		ПараметрыОперации, ПараметрыВыполнениеКоманды);
	
КонецПроцедуры

Процедура ОчиститьОчередьСобытийСканера() Экспорт
	
	СобытияСканера = МенеджерОборудованияКлиент.ПодключаемоеОборудование().СобытияСканера;
	СобытияСканера.ИдетОбработкаСобытияСканера = Ложь;
	СобытияСканера.ФормаВладелецОчереди = Неопределено;
	СобытияСканера.Очередь.Очистить();
	ОтключитьОбработчикОжидания("ПодключаемоеОборудование_ЗавершенаОбработкаСобытияСканераПоТаймауту");
	
КонецПроцедуры

Процедура ЗавершенаОбработкаСобытияСканера() Экспорт
	
	СобытияСканера = МенеджерОборудованияКлиент.ПодключаемоеОборудование().СобытияСканера;
	
	Если СобытияСканера.ФормаВладелецОчереди <> АктивнаяФорма()
		Или СобытияСканера.ФормаВладелецОчереди = Неопределено Тогда
		ОчиститьОчередьСобытийСканера();
		Возврат;
	КонецЕсли;
	
	СобытияСканера.ИдетОбработкаСобытияСканера = Ложь;
	ОтключитьОбработчикОжидания("ПодключаемоеОборудование_ЗавершенаОбработкаСобытияСканераПоТаймауту");
	
	Очередь = СобытияСканера.Очередь;
	Если Очередь.Количество() > 0 Тогда
		
		Очередь.Удалить(0); // удалить событие из очереди
		Если Очередь.Количество() > 0 Тогда
			
			ОбработатьСледующееСобытиеСканера(СобытияСканера);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// очередь пустая
	СобытияСканера.ФормаВладелецОчереди = Неопределено;
	
КонецПроцедуры

Процедура УстановитьТаймаутОбработкиСобытияСканера(НовыйТаймаут) Экспорт
	
	СобытияСканера = МенеджерОборудованияКлиент.ПодключаемоеОборудование().СобытияСканера;
	Если НовыйТаймаут = 0 Тогда
		ОтключитьОбработчикОжидания("ПодключаемоеОборудование_ЗавершенаОбработкаСобытияСканераПоТаймауту");
	Иначе
		Таймаут = СобытияСканера.ТаймаутОбработкиСобытияСканера;
		Если Таймаут = 0 Тогда
			ПодключитьОбработчикОжидания("ПодключаемоеОборудование_ЗавершенаОбработкаСобытияСканераПоТаймауту", НовыйТаймаут, Истина);
		КонецЕсли;
	КонецЕсли;
	СобытияСканера.ТаймаутОбработкиСобытияСканера = НовыйТаймаут;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработатьСобытиеОтУстройстваВвода(ОписаниеСобытия, РезультатОбработки) Экспорт
	
	Если ИспользоватьОчередьСобытийСканера(ОписаниеСобытия.Событие) Тогда
		ДобавитьСобытиеВОчередь(РезультатОбработки);
	Иначе
		ВыполнитьОповещениеОСобытии(РезультатОбработки);
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользуетсяОчередьСканера() Экспорт
	
	ПодключаемоеОборудование = МенеджерОборудованияКлиент.ПодключаемоеОборудование();
	Возврат ПодключаемоеОборудование.ИспользуетсяОчередьСканера;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСледующееСобытиеСканера(СобытияСканера)
	
	РезультатОбработки = СобытияСканера.Очередь[0];
	СобытияСканера.ИдетОбработкаСобытияСканера = Истина;
	ВыполнитьОповещениеОСобытии(РезультатОбработки, СобытияСканера);
	
КонецПроцедуры

Процедура ВыполнитьОповещениеОСобытии(РезультатОбработки, СобытияСканера = Неопределено)
	
	Если Не СобытияСканера = Неопределено Тогда
		Таймаут = СобытияСканера.ТаймаутОбработкиСобытияСканера;
		Если Таймаут > 0 Тогда
			ПодключитьОбработчикОжидания("ПодключаемоеОборудование_ЗавершенаОбработкаСобытияСканераПоТаймауту", Таймаут, Истина);
		КонецЕсли;
	КонецЕсли;
	
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентПереопределяемый.ОбработатьСобытиеПодключаемогоОборудования(РезультатОбработки.Событие, РезультатОбработки.Данные, СтандартнаяОбработка);
	Если СтандартнаяОбработка Тогда 
		Оповестить(РезультатОбработки.Событие, РезультатОбработки.Данные, "ПодключаемоеОборудование");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСобытиеВОчередь(РезультатОбработки)
	
	АктивнаяФорма = АктивнаяФорма();
	Если АктивнаяФорма = Неопределено
		Или Не ОбщегоНазначенияБПОКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(АктивнаяФорма, "ИспользоватьОчередьСканера") Тогда
		ОчиститьОчередьСобытийСканера();
		ВыполнитьОповещениеОСобытии(РезультатОбработки);
		Возврат;
	КонецЕсли;
	
	СобытияСканера = МенеджерОборудованияКлиент.ПодключаемоеОборудование().СобытияСканера;
	
	Если СобытияСканера.ФормаВладелецОчереди = Неопределено Тогда
		СобытияСканера.ФормаВладелецОчереди = АктивнаяФорма;
	ИначеЕсли Не СобытияСканера.ФормаВладелецОчереди = АктивнаяФорма Тогда
		ОчиститьОчередьСобытийСканера();
		СобытияСканера.ФормаВладелецОчереди = АктивнаяФорма;
	КонецЕсли;
	
	Очередь = СобытияСканера.Очередь;
	Очередь.Добавить(РезультатОбработки);
	
	Если Не СобытияСканера.ИдетОбработкаСобытияСканера Тогда
		СобытияСканера.ИдетОбработкаСобытияСканера = Истина;
		ВыполнитьОповещениеОСобытии(РезультатОбработки, СобытияСканера);
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользоватьОчередьСобытийСканера(Событие)
	
	СобытияСканера = МенеджерОборудованияКлиент.ПодключаемоеОборудование().СобытияСканера;
	Возврат СобытияСканера.ИспользуетсяОчередьСобытийСканера
		И (
			МенеджерОборудованияКлиентСервер.ЭтоСобытиеШтрихкод(Событие)
			Или МенеджерОборудованияКлиентСервер.ЭтоСобытиеШтрихкод64(Событие)
		);
	
	
КонецФункции

Функция АктивнаяФорма()
	
	АктивноеОкноПриложения = АктивноеОкно();
	Если АктивноеОкноПриложения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого Форма Из АктивноеОкноПриложения.Содержимое Цикл
		Возврат Форма;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции


#КонецОбласти
