
#Область ПрограммныйИнтерфейс

// Обработчик создания нового сообщения WhatsApp в панели контактной информации.
// Выполняет открытие формы создания нового сообщения.
//
// Параметры:
//  КонтактнаяИнформация - Структура - информация о контактном телефоне контрагнета.
//  ДополнительныеПараметры - Структура
//
Процедура ОбработчикДействияНаписатьВМессенджерWhatsApp(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	НомерТелефона = УправлениеКонтактнойИнформациейУНФКлиентСервер.НомерТелефонаВМеждународномФормате(
		КонтактнаяИнформация.Представление);
		
	Если ПустаяСтрока(НомерТелефона) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Не указан номер телефона'"));
		Возврат;
	КонецЕсли;
	
	ДопустимаяДлинаНомераТелефона = 12;
	Если СтрДлина(НомерТелефона) <> ДопустимаяДлинаНомераТелефона Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Неверный формат номера телефона.'"));
		Возврат;
	КонецЕсли;
	
	НомерТелефона = СтрЗаменить(НомерТелефона, "+", "");
	
	ВНомереТолькоЦифры = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерТелефона);
	Если Не ВНомереТолькоЦифры Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Неверный формат номера телефона.'"));
		Возврат;		
	КонецЕсли;
	
	ОткрытьФормуСообщенияWhatsAppИзПанелиКИ(НомерТелефона);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработкаВыбораШаблонаСообщенияСистемыВзаимодействия(Обсуждение, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуОтправкиСообщенияИзОбсуждения(Обсуждение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуОтправкиСообщенияИзОбсуждения(Обсуждение)
	
	ПараметрыФормы = Новый Структура("ИдентификаторОбсуждения, ФормаОткрытаИзОбсуждения", Обсуждение, Истина);
	ОткрытьФорму("Обработка.Мессенджеры.Форма.ФормаНовогоСообщенияWhatsApp", ПараметрыФормы);
	
КонецПроцедуры

Процедура ОткрытьФормуСообщенияWhatsAppИзПанелиКИ(НомерТелефона)
		
	ПараметрыОткрытияФормы = ПараметрыОткрытияФормыНовогоСообщения();
	ПараметрыОткрытияФормы.ВнешнийИдентификатор = НомерТелефона;

	ДанныеИнтеграцииСАбонентом = МессенджерыWhatsAppВызовСервера.ДанныеИнтеграцииWhatsAppСАбонентом(НомерТелефона);
	Если ДанныеИнтеграцииСАбонентом.ОбнаруженаОшибка Тогда
		
		Если Не ДанныеИнтеграцииСАбонентом.ОбсужденияДоступны Тогда
			ДанныеОшибки = ДанныеОшибкиОбсужденияНеПодключены();
		ИначеЕсли Не ДанныеИнтеграцииСАбонентом.ИнтеграцияWhatsAppДоступна Тогда 
			ДанныеОшибки = ДанныеОшибкиТипаИнтеграции();
		ИначеЕсли Не ДанныеИнтеграцииСАбонентом.ИнтеграцияWhatsAppНастроена Тогда
			ДанныеОшибки = ДанныеОшибкиИнтеграцииWhatsApp();
		ИначеЕсли Не ДанныеИнтеграцииСАбонентом.ДоступныИнтеграцииСПользователем Тогда
			ДанныеОшибки = ДанныеОшибкиДоступа();
		Иначе
			ДанныеОшибки = ДанныеНеизвестнойОшибки();
		КонецЕсли;

		ПараметрыОткрытияФормы.ОбнаруженаОшибка = Истина;
		ЗаполнитьЗначенияСвойств(ПараметрыОткрытияФормы, ДанныеОшибки);

		ОткрытьФормуНовогоСообщенияWhatsApp(ПараметрыОткрытияФормы, ДанныеИнтеграцииСАбонентом);
		Возврат;

	КонецЕсли;
	
	Если ДанныеИнтеграцииСАбонентом.Интеграции.Количество() = 1 Тогда
		
		ПараметрыОткрытияФормы.ИдентификаторИнтеграции = ДанныеИнтеграцииСАбонентом.Интеграции[0].Значение;
		ПараметрыОткрытияФормы.ИдентификаторОбсуждения = ДанныеИнтеграцииСАбонентом.Обсуждение;
		
		ОткрытьФормуНовогоСообщенияWhatsApp(ПараметрыОткрытияФормы, ДанныеИнтеграцииСАбонентом);
		
	ИначеЕсли ДанныеИнтеграцииСАбонентом.Интеграции.Количество() > 1 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораИнтеграции", ЭтотОбъект,
			ДанныеИнтеграцииСАбонентом);
		
		ДанныеИнтеграцииСАбонентом.Интеграции.ПоказатьВыборЭлемента(ОписаниеОповещения, 
			НСтр("ru='Выберите интеграцию:'"));

	Иначе
		
		Возврат;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПослеВыбораИнтеграции(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторИнтеграции = Результат.Значение;
	
	Если ДополнительныеПараметры.Обсуждение <> Неопределено Тогда
		ИдентификаторОбсуждения = ДополнительныеПараметры.Обсуждение;
	Иначе
		ИдентификаторОбсуждения = МессенджерыВызовСервера.ОбсуждениеСАбонентомИнтеграцииПоЗаголовку(
			ИдентификаторИнтеграции, ДополнительныеПараметры.ВнешнийИдентификатор);
	КонецЕсли;
		
	ПараметрыОткрытияФормы = ПараметрыОткрытияФормыНовогоСообщения();	
	ПараметрыОткрытияФормы.ВнешнийИдентификатор = ДополнительныеПараметры.ВнешнийИдентификатор;
	ПараметрыОткрытияФормы.ИдентификаторИнтеграции = ИдентификаторИнтеграции;
	ПараметрыОткрытияФормы.ИдентификаторОбсуждения = ИдентификаторОбсуждения;
	
	ОткрытьФормуНовогоСообщенияWhatsApp(ПараметрыОткрытияФормы, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОткрытьФормуНовогоСообщенияWhatsApp(ПараметрыОткрытия, ДанныеИнтеграцииСАбонентом)

	ИнтеграцииСПользователем = ДанныеИнтеграцииСАбонентом.ИнтеграцииСПользователем;
	ПользовательОтсутствуетВИнтеграции =
		ИнтеграцииСПользователем.Найти(ПараметрыОткрытия.ИдентификаторИнтеграции) = Неопределено;
	
	Если Не ДанныеИнтеграцииСАбонентом.ОбнаруженаОшибка И ПользовательОтсутствуетВИнтеграции Тогда
		ПараметрыОткрытия.ОбнаруженаОшибка = Истина;
		ДанныеОшибки = ДанныеОшибкиДоступа();
		ПараметрыОткрытия.ТекстОшибки = ДанныеОшибки.ТекстОшибки;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.Мессенджеры.Форма.ФормаНовогоСообщенияWhatsApp", ПараметрыОткрытия);
	
КонецПроцедуры

Функция ПараметрыОткрытияФормыНовогоСообщения()
	
	ТекстОшибки = СтроковыеФункцииКлиент.ФорматированнаяСтрока("");
	ТипВнешнейСистемы = МессенджерыКлиентСервер.ТипВнешнийСистемыWhatsApp();
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИдентификаторОбсуждения",    Неопределено);
	ПараметрыОткрытия.Вставить("ВнешнийИдентификатор",       Неопределено);
	ПараметрыОткрытия.Вставить("ИдентификаторИнтеграции",    Неопределено);
	ПараметрыОткрытия.Вставить("ОбнаруженаОшибка",           Ложь);
	ПараметрыОткрытия.Вставить("ТекстОшибки",                ТекстОшибки);
	ПараметрыОткрытия.Вставить("ТипВнешнейСистемы",          ТипВнешнейСистемы);
	ПараметрыОткрытия.Вставить("ЭтоПредупреждение",          Ложь);
	ПараметрыОткрытия.Вставить("КраткоеПредставлениеОшибки", Ложь);
	ПараметрыОткрытия.Вставить("ТипОшибки",                  "");
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

// Текст ошибки доступа для отображения в форме создания нового сообщения.
// 
// Возвращаемое значение:
//  Структура - ДанныеОшибки
Функция ДанныеОшибкиДоступа()
	
	ТекстОшибки = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru='Пользователь отсутствует в списке для отправки и получения сообщений'"));

	ДанныеОшибки = ДанныеОшибки();
	ДанныеОшибки.ТипОшибки = МессенджерыКлиентСервер.ТипОшибкиОшибкаДоступа();
	ДанныеОшибки.ТекстОшибки = ТекстОшибки;
	ДанныеОшибки.КраткоеПредставлениеОшибки = НСтр("ru='Ошибка доступа'");
	ДанныеОшибки.ЭтоПредупреждение = Истина;
	
	Возврат ДанныеОшибки;
	
КонецФункции

// Текст стандартной ошибки для отображения в форме создания нового сообщения.
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока
Функция ДанныеНеизвестнойОшибки()
	
	ТекстОшибки = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru='Обнаружена ошибка'"));

	ДанныеОшибки = ДанныеОшибки();
	ДанныеОшибки.ТипОшибки = МессенджерыКлиентСервер.ТипОшибкиНеизвестнаяОшибка();
	ДанныеОшибки.КраткоеПредставлениеОшибки = НСтр("ru='Ошибка'");
	ДанныеОшибки.ТекстОшибки = ТекстОшибки;
	
	Возврат ДанныеОшибки;
	
КонецФункции

// Текст ошибки подключения обсуждений для отображения в форме создания нового сообщения
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока
Функция ДанныеОшибкиОбсужденияНеПодключены()
	
	ТекстОшибки = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		 НСтр("ru='Обсуждения не подключены.'"));

	ДанныеОшибки = ДанныеОшибки();
	ДанныеОшибки.ТипОшибки = МессенджерыКлиентСервер.ТипОшибкиОбсужденияНеПодключены();
	ДанныеОшибки.КраткоеПредставлениеОшибки = НСтр("ru='Обсуждения'");
	ДанныеОшибки.ТекстОшибки = ТекстОшибки;

	Возврат ДанныеОшибки;
	
КонецФункции

// Текст ошибки поддержки интеграции WhatsApp сервером, для отображения в форме создания нового сообщения
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока
Функция ДанныеОшибкиТипаИнтеграции()
	
	ТекстОшибки = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		 НСтр("ru='Сервер взаимодействия не поддерживает тип интеграции WhatsApp'"));
		 
	ДанныеОшибки = ДанныеОшибки();
	ДанныеОшибки.ТипОшибки = МессенджерыКлиентСервер.ТипОшибкиИнтеграцияWhatsAppНеПоддерживается();
	ДанныеОшибки.КраткоеПредставлениеОшибки = НСтр("ru='Интеграция не поддерживается'");
	ДанныеОшибки.ТекстОшибки = ТекстОшибки;
	
	Возврат ДанныеОшибки;
	
КонецФункции

// Текст ошибки наличия настроенных интеграций WhatsApp для отображения в форме создания нового сообщения
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока
Функция ДанныеОшибкиИнтеграцииWhatsApp()
	
	ТекстОшибки = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		 НСтр("ru='Интеграция с WhatsApp не настроена.'"));
		 
	ДанныеОшибки = ДанныеОшибки();
	ДанныеОшибки.ТипОшибки = МессенджерыКлиентСервер.ТипОшибкиИнтеграцияWhatsAppНеНастроена();
	ДанныеОшибки.КраткоеПредставлениеОшибки = НСтр("ru='Интеграция не настроена'");
	ДанныеОшибки.ТекстОшибки = ТекстОшибки;
	

	Возврат ДанныеОшибки;
		
КонецФункции

Функция ДанныеОшибки()
	
	ТекстОшибки = СтроковыеФункцииКлиент.ФорматированнаяСтрока("");
	
	ДанныеОшибки = Новый Структура;
	ДанныеОшибки.Вставить("ТекстОшибки",                ТекстОшибки);
	ДанныеОшибки.Вставить("КраткоеПредставлениеОшибки", "");
	ДанныеОшибки.Вставить("ТипОшибки",                  "");
	ДанныеОшибки.Вставить("ЭтоПредупреждение",          Ложь);
	
	Возврат ДанныеОшибки;
	
КонецФункции

#КонецОбласти
