#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОпределитьЗагруженныеЭлементыТНВЭДИзОблачногоКлассификатора(ЭлементыКлассификатора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторТНВЭД.Код КАК Код
	|ИЗ
	|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементыКлассификатора.Добавить(Выборка.Код);
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьОбновитьЭлементыТНВЭДИзОблачногоКлассификатора(ДанныеСервиса, Отказ) Экспорт
	
	КодыДанныхСервиса = ДанныеСервиса.ВыгрузитьКолонку("Код");
	СуществующиеЭлементыТНВЭД = ЭлементыПоКодам(КодыДанныхСервиса);
	
	Для Каждого СтрокаДанныхСервиса Из ДанныеСервиса Цикл
		
		// Загружаем только элементы, строки которых не имеют подчиненных элементов.
		Если СтрокаДанныхСервиса.ПотомковИтого > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СоздатьОбновитьЭлементКлассификатора(СтрокаДанныхСервиса, СуществующиеЭлементыТНВЭД);
		
		НормализованныйКод = НормализоватьКодТНВЭД(СтрокаДанныхСервиса.Код);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьОбновитьЭлементКлассификатора(СвойстваЭлемента, СуществующиеЭлементыТНВЭД = Неопределено) Экспорт
	
	НормализованныйКод = НормализоватьКодТНВЭД(СвойстваЭлемента.Код);
	
	Если ЗначениеЗаполнено(СуществующиеЭлементыТНВЭД) Тогда
		СуществующиеЭлементыТНВЭДДляПоиска = СуществующиеЭлементыТНВЭД;
	Иначе
		КодыДанныхСервиса = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СвойстваЭлемента.Код);
		СуществующиеЭлементыТНВЭДДляПоиска = ЭлементыПоКодам(КодыДанныхСервиса);
	КонецЕсли;
	
	СуществующийЭлемент = СуществующиеЭлементыТНВЭДДляПоиска.Получить(НормализованныйКод);
	Если СуществующийЭлемент = Неопределено Тогда
		ТНВЭДОбъект = Справочники.КлассификаторТНВЭД.СоздатьЭлемент();
	Иначе
		ТНВЭДОбъект = СуществующийЭлемент.ПолучитьОбъект();
	КонецЕсли;
	
	ТНВЭДОбъект.Код = НормализованныйКод;
	ТНВЭДОбъект.Наименование = СвойстваЭлемента.НаименованиеПолное;
	ТНВЭДОбъект.НаименованиеПолное = СвойстваЭлемента.НаименованиеПолное;
	ТНВЭДОбъект.СырьевойТовар = СвойстваЭлемента.Сырьевой;
	ТНВЭДОбъект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду(СвойстваЭлемента.КодОКЕИ);
	ТНВЭДОбъект.Записать();
	
	Возврат ТНВЭДОбъект.Ссылка;
	
КонецФункции

Функция ТаблицаКлассификатораТНВЭД() Экспорт
	
	ТаблицаПоказателей = Новый ТаблицаЗначений;
	
	Макет = Справочники.КлассификаторТНВЭД.ПолучитьМакет("КлассификаторТоварнойНоменклатурыВнешнеэкономическойДеятельности");
	Список = Макет.Области.Найти("Строки");
	
	Если Список.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
		// Заполнение дерева данными списка.
		ВерхОбласти = Список.Верх;
		НизОбласти = Список.Низ;
		
		НомерКолонки = 1;
		Область = Макет.Область(ВерхОбласти - 1, НомерКолонки);
		ИмяКолонки = Область.Текст;
		
		Пока ЗначениеЗаполнено(ИмяКолонки) Цикл
			
			Если ИмяКолонки = "Код" Тогда
				ТаблицаПоказателей.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)));
			ИначеЕсли ИмяКолонки = "Наименование" Тогда
				ТаблицаПоказателей.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
			ИначеЕсли ИмяКолонки = "ЕдиницаИзмерения" Тогда
				ТаблицаПоказателей.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(3)));
			КонецЕсли;
			
			НомерКолонки = НомерКолонки + 1;
			Область = Макет.Область(ВерхОбласти - 1, НомерКолонки);
			ИмяКолонки = Область.Текст;
			
		КонецЦикла;
		
		Для НомСтр = ВерхОбласти По НизОбласти Цикл
			// Отображаем только элементы
			
			Код = СокрП(Макет.Область(НомСтр, 1).Текст);
			Если СтрДлина(Код) = 2 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаСписка = ТаблицаПоказателей.Добавить();
			
			Для Каждого Колонка Из ТаблицаПоказателей.Колонки Цикл
				
				ЗначениеКолонки = СокрП(Макет.Область(НомСтр, ТаблицаПоказателей.Колонки.Индекс(Колонка) + 1).Текст);
				СтрокаСписка[Колонка.Имя] = ЗначениеКолонки;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаПоказателей.Сортировать(ТаблицаПоказателей.Колонки[0].Имя + " Возр");
	
	Возврат ТаблицаПоказателей;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиОбновления

// Обработчик обновления версии 3.0.51
// Устанавливает для созданных элементов справочника единицу измерения в соответствии с классификатором ТНВЭД.
Процедура ЗаполнитьЕдиницуИзмеренияОтложенно(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	КлассификаторТНВЭД.Ссылка
	|ИЗ
	|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|ГДЕ
	|	КлассификаторТНВЭД.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	
	ТаблицаКлассификатора = ТаблицаКлассификатораТНВЭД();
	
	Для каждого СтрокаРезультата Из РезультатЗапроса Цикл
		
		Попытка
			
			ЗаполнитьЕдиницуИзмерения(СтрокаРезультата, ТаблицаКлассификатора);
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			// Если не удалось обработать какой-либо элемент справочника, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать элемент справочника: %1 по причине:
					|%2'"),
					СтрокаРезультата.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Справочники.КлассификаторТНВЭД, СтрокаРезультата.Ссылка, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре ЗаполнитьЕдиницуИзмеренияОтложенно
				|не удалось обработать некоторые элементы справочника Классификатор ТН ВЭД (пропущены): %1'"),
				ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.КлассификаторТНВЭД,,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Процедура ЗаполнитьЕдиницуИзмеренияОтложенно
					|обработала очередную порцию элементов справочника Классификатор ТН ВЭД: %1'"), ОбъектовОбработано));
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЕдиницуИзмерения(СтрокаПоСправочнику, ТаблицаКлассификатора)
	
	НачатьТранзакцию();
	Попытка
		
		// Блокируем объект от изменения другими сеансами.
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.КлассификаторТНВЭД");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаПоСправочнику.Ссылка);
		Блокировка.Заблокировать();
		
		СправочникОбъект = СтрокаПоСправочнику.Ссылка.ПолучитьОбъект();
		
		// Если объект ранее был удален или обработан другими сеансами, пропускаем его.
		Если СправочникОбъект = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(СправочникОбъект.ЕдиницаИзмерения) Тогда
			// Элемент справочника уже обработан.
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		СправочникОбъект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду("166");
		
		ПараметрыОтбора = Новый Структура("Код", СправочникОбъект.Код);
		НайденныеСтроки = ТаблицаКлассификатора.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0
			И ЗначениеЗаполнено(НайденныеСтроки[0].ЕдиницаИзмерения) Тогда
			СправочникОбъект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду(
				НайденныеСтроки[0].ЕдиницаИзмерения);
		КонецЕсли;
		
		// Запись обработанного объекта.
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Функция ищет по коду элементы в справочнике Классификатор ТН ВЭД.
//  Если их нет, то создает элементы справочника в соответствии с классификатором ТН ВЭД ЕАЭС.
//
// Параметры:
//  Код - Строка(10) - Строка с кодом классификатора ТН ВЭД,
//  РежимОбновления - Булево, Истина - признак записи объекта через метод ОбновлениеИнформационнойБазы.ЗаписатьОбъект().
// 
// Возвращаемое значение:
//  Ссылка - ссылка на элемент классификатора или Неопределено, если такого кода нет в ТН ВЭД.
//
Функция НайтиСоздатьЭлементКлассификатораТНВЭД(Код, РежимОбновления = Ложь) Экспорт
	
	СуществующийЭлемент = Справочники.КлассификаторТНВЭД.НайтиПоКоду(Код);
	Если Не ЗначениеЗаполнено(СуществующийЭлемент) Тогда
		
		ТаблицаКлассификатора = ТаблицаКлассификатораТНВЭД();
		ТаблицаКлассификатора.Индексы.Добавить("Код");
		
		СтруктураПоиска = Новый Структура("Код",Код);
		НайденныеСтроки = ТаблицаКлассификатора.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 1 Тогда
			СвойстваЭлемента = НайденныеСтроки[0];
			
			СправочникОбъект = Справочники.КлассификаторТНВЭД.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(СправочникОбъект, СвойстваЭлемента);
			
			СправочникОбъект.НаименованиеПолное = СвойстваЭлемента.Наименование;
			
			Соответствие = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду(СвойстваЭлемента.ЕдиницаИзмерения);
			Если Соответствие <> Неопределено Тогда
				СправочникОбъект.ЕдиницаИзмерения = Соответствие;
			КонецЕсли;
			
			Если РежимОбновления Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
			Иначе
				СправочникОбъект.Записать();
			КонецЕсли;
			
			Возврат СправочникОбъект.Ссылка;
			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат СуществующийЭлемент;
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭлементыПоКодам(КодыТНВЭДСервиса)
	
	СоответствияКодов = Новый Соответствие;
	Если Не ЗначениеЗаполнено(КодыТНВЭДСервиса) Тогда
		Возврат СоответствияКодов;
	КонецЕсли;
	
	КодыТНВЭД = Новый Массив;
	Для Каждого СтрокаКодаТНВЭДСервиса Из КодыТНВЭДСервиса Цикл
		КодыТНВЭД.Добавить(НормализоватьКодТНВЭД(СтрокаКодаТНВЭДСервиса));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодыТНВЭД", КодыТНВЭД);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторТНВЭД.Ссылка КАК Ссылка,
	|	КлассификаторТНВЭД.Код КАК Код
	|ИЗ
	|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|ГДЕ
	|	КлассификаторТНВЭД.Код В(&КодыТНВЭД)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствияКодов.Вставить(Выборка.Код, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СоответствияКодов;
	
КонецФункции

Функция НормализоватьКодТНВЭД(ПолныйКодТНВЭД) 
	// В сервисе код ТНВЭД указан с пробелами, типа "0101 30 000 0".
	// В конфигурации же используется код без пробелов - "0101300000".
	// Поэтому нужно от пробелов избавиться.
	Возврат СтрЗаменить(ПолныйКодТНВЭД, " ", "");
КонецФункции

#КонецОбласти

#КонецЕсли