
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоЗакрытие Тогда
		Отказ = Истина;
		ЭтоЗакрытие = Истина;
		ПодключитьОбработчикОжидания("ЗакрытьСПараметрами", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Вопрос10ПриИзменении(Элемент)
	
	Вопрос10 = Число(Вопрос10Строкой);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назад(Команда)
	
	НомерСтраницы = НомерСтраницы - 1;
	УстановитьСтраницу(НомерСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	НомерСтраницыОтправить = 2;
	НомерСтраницыГотово = 3;
	
	Если НомерСтраницы = 1 И Вопрос10 = 0 Тогда
		Ошибки = Неопределено;
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
		Ошибки, "Вопрос10", НСтр("ru ='Не выбран вариант ответа оценки интерфейса'"), "");
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		Возврат;
	КонецЕсли;
	
	Если НомерСтраницы = НомерСтраницыОтправить Тогда
		ОтправитьОпрос();
		ОпросЗавершен = Истина;
	ИначеЕсли НомерСтраницы = НомерСтраницыГотово Тогда
		ОтправитьКИИЗакрыть();
		Возврат;
	КонецЕсли;
	
	НомерСтраницы = НомерСтраницы + 1;
	УстановитьСтраницу(НомерСтраницы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	ЭтоТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если Не ЭтоТакси Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Вопрос10.Ширина = 46;
	Элементы.ДекорацияВопрос1.Шрифт = ШрифтыСтиля.ЗаголовокЧетвертогоУровня;
	Элементы.ДекорацияВопрос2.Шрифт = ШрифтыСтиля.ЗаголовокЧетвертогоУровня;
	Элементы.ДекорацияВопрос3.Шрифт = ШрифтыСтиля.ЗаголовокЧетвертогоУровня;
	Элементы.ДекорацияВопрос4.Шрифт = ШрифтыСтиля.ЗаголовокЧетвертогоУровня;

КонецПроцедуры

&НаСервере
Процедура УстановитьСтраницу(НомерСтраницы)

	Если НомерСтраницы = 0 Тогда
		Элементы.ФормаНазад.Видимость = Ложь;
	ИначеЕсли НомерСтраницы = 1 Тогда
		Элементы.ФормаДалее.Заголовок = НСтр("ru = 'Далее'");
		Элементы.ФормаДалее.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Элементы.ФормаНазад.Видимость = Истина;
	ИначеЕсли НомерСтраницы = 2 Тогда
		Элементы.ФормаДалее.Заголовок = НСтр("ru = 'Отправить'");
		Элементы.ФормаДалее.Отображение = ОтображениеКнопки.Текст;
	ИначеЕсли НомерСтраницы = 3 Тогда
		Элементы.ФормаДалее.Заголовок = НСтр("ru = 'Готово'");
		Элементы.ФормаДалее.Отображение = ОтображениеКнопки.Текст;
		Элементы.ФормаНазад.Видимость = Ложь;
	КонецЕсли;
	
	ШаблонИмяСтраницы = "Страница%1";
	ИмяСтраницы = СтрШаблон(ШаблонИмяСтраницы, НомерСтраницы + 1);
	Элементы.Страницы.ТекущаяСтраница = Элементы[ИмяСтраницы];
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОпрос()
	
	РезультатОпроса = СформироватьРезультатОпроса();
	ОтправитьРезультатОпроса(РезультатОпроса);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтправитьРезультатОпроса(РезультатОпроса)
	
	ОбратнаяСвязь.ОпросНачалоРаботыОтправитьДанные(РезультатОпроса);
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьРезультатОпроса()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПолноеИмяФормы", "ВсеФормы");
	Результат.Вставить("Событие", "НачалоРаботы");
	Результат.Вставить("ИдентификаторОпроса", "90ab5b6f-a1e9-46c4-a2e2-27574038a441");
	
	РезультатВопрос1 = Новый Структура;
	РезультатВопрос1.Вставить("ТекстВопроса", Элементы.ГруппаОценкаВопрос1.Заголовок);
	РезультатВопрос1.Вставить("Ответ", Вопрос1);
	Результат.Вставить("Вопрос1", РезультатВопрос1);
	
	РезультатВопрос2 = Новый Структура;
	РезультатВопрос2.Вставить("ТекстВопроса", Элементы.ГруппаОценкаВопрос2.Заголовок);
	РезультатВопрос2.Вставить("Ответ", Вопрос2);
	Результат.Вставить("Вопрос2", РезультатВопрос2);
	
	РезультатВопрос3 = Новый Структура;
	РезультатВопрос3.Вставить("ТекстВопроса", Элементы.ГруппаОценкаВопрос3.Заголовок);
	РезультатВопрос3.Вставить("Ответ", Вопрос3);
	Результат.Вставить("Вопрос3", РезультатВопрос3);
	
	РезультатВопрос4 = Новый Структура;
	РезультатВопрос4.Вставить("ТекстВопроса", Элементы.ГруппаОценкаВопрос4.Заголовок);
	РезультатВопрос4.Вставить("Ответ", Вопрос4);
	Результат.Вставить("Вопрос4", РезультатВопрос4);
	
	СоставОтвета5 = Новый Структура;
	СоставОтвета5.Вставить("Ответ51", Вопрос5);
	СоставОтвета5.Вставить("Ответ52", Вопрос6);
	СоставОтвета5.Вставить("Ответ53", Вопрос7);
	СоставОтвета5.Вставить("Ответ54", Вопрос8);
	СоставОтвета5.Вставить("Ответ55", Вопрос9);
	
	РезультатВопрос5 = Новый Структура;
	РезультатВопрос5.Вставить("ТекстВопроса", Элементы.ДекорацияПриветствие2.Заголовок);
	РезультатВопрос5.Вставить("Ответ", СоставОтвета5);
	Результат.Вставить("Вопрос5", РезультатВопрос5);
	
	РезультатВопрос6 = Новый Структура;
	РезультатВопрос6.Вставить("ТекстВопроса", Элементы.Вопрос10.Заголовок);
	РезультатВопрос6.Вставить("Ответ", Вопрос10);
	Результат.Вставить("Вопрос6", РезультатВопрос6);
	
	РезультатВопрос7 = Новый Структура;
	РезультатВопрос7.Вставить("ТекстВопроса", Элементы.ГруппаОценкаВопрос11.Заголовок);
	РезультатВопрос7.Вставить("Ответ", Вопрос11);
	Результат.Вставить("Вопрос6", РезультатВопрос7);
	
	РезультатВопрос8 = Новый Структура;
	РезультатВопрос8.Вставить("ТекстВопроса", Элементы.ГруппаОценкаВопрос12.Заголовок);
	РезультатВопрос8.Вставить("Ответ", Вопрос12);
	Результат.Вставить("Вопрос6", РезультатВопрос8);
	
	РезультатКонтакты = Новый Структура;
	РезультатКонтакты.Вставить("Имя", КонтактИмя);
	РезультатКонтакты.Вставить("Телефон", КонтактТелефон);
	РезультатКонтакты.Вставить("ЭлектроннаяПочта", КонтактЭлектроннаяПочта);
	Результат.Вставить("Контакты", РезультатКонтакты);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьСПараметрами()
	
	Результат = Новый Структура;
	Результат.Вставить("ОпросЗавершен", ОпросЗавершен);
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКИИЗакрыть()
	
	КонтактнаяИнформация = КонтактнаяИнформацияПользователя();
	Если КонтактнаяИнформация <> Неопределено Тогда
		ОтправитьКИ(КонтактнаяИнформация);
	КонецЕсли;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция КонтактнаяИнформацияПользователя()
	
	КонтактнаяИнформация = Новый Структура;
	Если Не ЗначениеЗаполнено(КонтактТелефон) И Не ЗначениеЗаполнено(КонтактЭлектроннаяПочта) Тогда
		Возврат Неопределено;
	Иначе
		КонтактнаяИнформация.Вставить("Имя", КонтактИмя);
		КонтактнаяИнформация.Вставить("Телефон", КонтактТелефон);
		КонтактнаяИнформация.Вставить("ЭлектроннаяПочта", КонтактЭлектроннаяПочта);
		Возврат КонтактнаяИнформация;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтправитьКИ(КонтактнаяИнформация)
	
	ОбратнаяСвязь.ОпросНачалоРаботыОтправитьКонтактнуюИнформацию(КонтактнаяИнформация);
	
КонецПроцедуры

#КонецОбласти