
#Область ОписаниеПеременных

&НаКлиенте
Перем СчетчикНажатийНаКупюры;

&НаКлиенте
Перем ДанныеКПередачеВДисплейПокупателя, ТипыОперацийДисплеяПокупателя;

&НаКлиенте
Перем ЗакрытиеПодтверждено;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	НастроитьФормуПоВходнымПараметрам();
	НастроитьТиповыеГорячиеКлавиши();
	
	ОбщегоНазначенияРМКПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбнулитьСчетчикНажатийКупюр();
	ЗакрытиеПодтверждено = Ложь;
	
	Если РежимВводаСуммы = 2
		Или РежимВводаСуммы = 3 Или РежимВводаСуммы = 4 Тогда
		ВывестиДанныеОБонусах();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	НулеваяЦена = (РежимВводаСуммы = 7 И ЗначениеВвода = 0);
	Если НулеваяЦена И Не ЗавершениеРаботы И Не ЗакрытиеПодтверждено Тогда
		Отказ = Истина;
		ЗапроситьПодтверждениеОтмены();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КодПроверкиИзСМСИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Введено4Цифры = СтрДлина(СокрЛП(Текст)) = 4;
	
	Если Введено4Цифры Тогда
		
		КодПроверкиИзSMS = Текст;
		ПроверитьВведенныйКодИзSMS(КодПроверкиИзSMS);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаОплаченоНалПриИзменении(Элемент)
	
	ОбнулитьСчетчикНажатийКупюр();
	РассчитатьСдачу();
	ОпределитьДоступностьОплатыНаличными();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаОплаченоБонусамиПриИзменении(Элемент)
	СуммаБонусовПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СуммаСертификатаПриИзменении(Элемент)
	Если СуммаСертификата > ДоступноКОплатеСертификатом Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Доступно к оплате сертификатом не более %1 %2'"), ДоступноКОплатеСертификатом, ПредставлениеВалюты);
		ПараметрыОткрытияФормыОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстСообщения);
		ПараметрыОткрытияФормыОшибки.ЭтоПредупреждение = Истина;
		ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект,ПараметрыОткрытияФормыОшибки);
		СуммаСертификата = ДоступноКОплатеСертификатом;
	Иначе
		РассчитатьСдачу();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПанельКупюрПриИзменении(Элемент)
	
	Если ПанельКупюр Тогда
		Элементы.СтраницыВводаСумм.ТекущаяСтраница = Элементы.ГруппаКупюр;
	Иначе
		Элементы.СтраницыВводаСумм.ТекущаяСтраница = Элементы.ГруппаЦифроваяПанель;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаОплаченоБонусамиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элемент.ВыделенныйТекст = "";
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ГорячаяКлавишаEnter(Команда)
	
	ОбработатьГорячуюКлавишуEnter();
	
КонецПроцедуры

&НаКлиенте
Процедура ГорячаяКлавишаESC(Команда)
	
	Закрыть(ШаблонОтвета());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
	ВыполнитьОперациюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОперацию(Команда)
	
	Если РежимВводаСуммы = 7 Тогда
		ЗапроситьПодтверждениеОтмены();
	Иначе
		Закрыть(ШаблонОтвета());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЦифраУниверсальнаяКлавиатура(Команда)
	ОбработатьЦифруЦифровойКлавиатуры(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДваНуляУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуДваНуляЦифровойКлавиатуры();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапятаяУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыЗвездочкаЗапятая();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыОчистить();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьПоследнееУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее();
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьОтправкуСМС(Команда)
	СформироватьСообщениеИОтправитьSMS();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ШаблонОтвета()
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ОперацияПодтверждена", Ложь);
	РезультатФункции.Вставить("Ошибка", Ложь);
	РезультатФункции.Вставить("СуммаОперации", 0);
	РезультатФункции.Вставить("СуммаБонусов", 0);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОперациюКлиент()
	Если ТребуетсяСМС
		И СуммаОплаченоБонусами > 0 Тогда
		ИзменитьЭлементыВводСМС();
	ИначеЕсли РежимВводаСуммы = 3
		И Сдача > 0 Тогда
		ИзменитьЭлементыВводНаличных();
	ИначеЕсли РежимВводаСуммы = 7 И ЗначениеВвода = 0 Тогда
		ВывестиОшибкуВводаЦены();
	Иначе
		ЗакрытьФормуСПараметрами();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьГорячуюКлавишуEnter()
	Если ТекущийЭлемент = Элементы.ВыполнитьОперацию Тогда
		ВыполнитьОперациюКлиент();
	Иначе
		ТекущийЭлемент = Элементы.ВыполнитьОперацию;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуСПараметрами()
	Ответ = ШаблонОтвета();
	
	Если РежимВводаСуммы = 0 Тогда
		Ответ.ОперацияПодтверждена = Истина;
		Ответ.СуммаОперации = СуммаОплаченоНал;
		Ответ.СуммаБонусов = СуммаОплаченоБонусами;
	ИначеЕсли РежимВводаСуммы = 4 Тогда
		Ответ.СуммаБонусов = СуммаОплаченоБонусами;
		Ответ.ОперацияПодтверждена = УспешныйВводСМС;
	ИначеЕсли РежимВводаСуммы = 5 Тогда
		Ответ.ОперацияПодтверждена = СуммаСертификата > 0;
		Ответ.СуммаОперации = СуммаСертификата;
	ИначеЕсли РежимВводаСуммы = 6 Или РежимВводаСуммы = 7 Тогда
		Ответ.СуммаОперации = ЗначениеВвода;
		Ответ.ОперацияПодтверждена = Истина;
	Иначе
		Ответ.СуммаБонусов = СуммаОплаченоБонусами;
		Ответ.ОперацияПодтверждена = УспешныйВводСМС;
	КонецЕсли;
	
	Закрыть(Ответ);
КонецПроцедуры

Процедура НастроитьТиповыеГорячиеКлавиши()
	
	СочетаниеКлавишESC = ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,{0,27,0}}");
	Если НЕ СочетаниеКлавишESC = Неопределено Тогда
		Команды.ГорячаяКлавишаESC.СочетаниеКлавиш = СочетаниеКлавишESC;
	КонецЕсли;
	
	СочетаниеКлавишиEnter = ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,{0,13,0}}");
	Если Не СочетаниеКлавишиEnter = Неопределено Тогда
		Элементы.ГорячаяКлавишаEnter.СочетаниеКлавиш = СочетаниеКлавишиEnter;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭтоКомпактныйРежимПостроения()
	
	РезультатФункции = Ложь;
	Если Параметры.Свойство("КомпактныйРежимПодменю") И Параметры.КомпактныйРежимПодменю = Истина Тогда
		РезультатФункции = Истина;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура НастроитьРеквизитыВКомпактномРежимеПриНеобходимости(КомпактныйРежимПостроения)
	
	Если ЭтоИнтерфейс85 И КомпактныйРежимПостроения Тогда
		Элементы.СуммаИтого.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.СуммаОплаченоЗачетАванса.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.СуммаОплаченоНал.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.СуммаОплаченоВРассрочку.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.Сдача.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.ГруппаСумма.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Лево;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВходнымПараметрам()
	
	РежимВводаСуммы = Параметры.Режим;
	
	РежимКассыСамообслуживания = Параметры.РежимКассыСамообслуживания;
	КомпактныйРежимПостроения = ЭтоКомпактныйРежимПостроения();
	НомерТелефонаПолучателя = Параметры.НомерТелефонаПолучателя;
	ШаблонСообщения = Параметры.ШаблонСообщения;
	ПредставлениеКарты = Параметры.ПредставлениеКарты;
	ДоступноКОплатеБонусами = Параметры.ДоступноБаллов;
	СуммаИтого = Параметры.СуммаИтого;
	СуммаОплаченоБонусами = ДоступноКОплатеБонусами;
	ЗапрашиватьСМС = Параметры.ЗапрашиватьСМС;
	ТребуетсяСМС = Параметры.ЗапрашиватьСМС;
	СуммаПодтвержденияБонусов = Параметры.СуммаПодтвержденияБонусов;
	УспешныйВводСМС = НЕ ЗапрашиватьСМС;
	ПодарочныйСертификат = Параметры.ПодарочныйСертификат;
	СуммаСертификата = Мин(Параметры.СуммаСертификата, СуммаИтого);
	ДоступноКОплатеСертификатом = СуммаСертификата;
	НомерПодарочногоСертификата = Параметры.НомерПодарочногоСертификата;
	ПредставлениеВалюты = ОбщегоНазначенияРМК.ПредставлениеВалюты();
	ИспользоватьПанельВводаНаличных = Параметры.ИспользоватьПанельВводаНаличных;
	ТекущаяНастройкаРМК = Параметры.ТекущаяНастройкаРМК;
	ИспользоватьЦифровуюКлавиатуру = Параметры.ИспользоватьЦифровуюКлавиатуру;
	ЭтоВнесениеПредоплатыПоЗаказу = Параметры.ЭтоВнесениеПредоплатыПоЗаказу;
	СуммаОплаченоЗачетАванса = Параметры.СуммаОплаченоЗачетАванса;
	ПриемАванса = Параметры.ПриемАванса;
	ИспользоватьДисплейПокупателя = Параметры.ИспользоватьДисплейПокупателя;
	ИнтерфейсРМКСлужебный.ПрименитьНаФормеМасштабИзПараметров(ЭтотОбъект, Параметры);
	
	ОжидаемоеКоличествоЧеков = Параметры.ОжидаемоеКоличествоЧеков;
	Если ОжидаемоеКоличествоЧеков > 1 Тогда
		ТекстУведомления = НСтр("ru='Продажа товаров из списка покупок будет оформлена согласно закону №54-ФЗ.%2Ожидаемое количество чеков: %1'");
		ТекстУведомления = СтрШаблон(ТекстУведомления, ОжидаемоеКоличествоЧеков, Символы.ПС);
		Элементы.СуммаОплаченоНал.Подсказка = ТекстУведомления;
	КонецЕсли;

	Элементы.СтраницыВводаСумм.ТекущаяСтраница = Элементы.ГруппаЦифроваяПанель;
	Элементы.ГруппаЦифроваяПанель.Видимость = ИспользоватьЦифровуюКлавиатуру;
	
	МоноСтраницы = ПолучитьМоноСтраницы(Элементы);
	ЗаголовокФормы = "";
	Если РежимВводаСуммы = 1 Тогда
		
		ЗаголовокФормы = НСтр("ru='Введите СМС'");
		УстановитьТекущуюСтраницуОперации(Элементы.СтраницаВводСМС, МоноСтраницы);
		СформироватьСообщениеИОтправитьSMS();
		ИмяЭлементаВводаСуммы = Элементы.КодПроверкиИзСМС.Имя;
		Элементы.ДекорацияДанныеКарты.Заголовок = НомерТелефонаПолучателя;
		Элементы.СтраницыКартинки.ТекущаяСтраница = Элементы.СтраницаКартинкаСМС;
		
	ИначеЕсли РежимВводаСуммы = 2 Тогда
		
		ЗаголовокФормы = НСтр("ru='Оплата бонусами'");
		УстановитьТекущуюСтраницуОперации(Элементы.ОплатаБонусами, МоноСтраницы);
		Элементы.ДекорацияДанныеКарты.Заголовок = ПредставлениеКарты;
		ЗаголовокБаллы = НСтр("ru='Не более %1 баллов'");
		Элементы.ДекорацияДоступноКОплате.Заголовок = СтрШаблон(ЗаголовокБаллы, ДоступноКОплатеБонусами);
		ИмяЭлементаВводаСуммы = Элементы.СуммаОплаченоБонусами.Имя;
		Сдача = Макс(СуммаИтого - СуммаОплаченоБонусами, 0);
		ИмяЭлементаВводаСуммы = Элементы.СуммаОплаченоБонусами.Имя;
		Элементы.ВыполнитьОперацию.Заголовок = НСтр("ru='Списать'");
		Элементы.СтраницыКартинки.ТекущаяСтраница = Элементы.СтраницаКартинкаБонусы;
		
	ИначеЕсли РежимВводаСуммы = 3
		Или РежимВводаСуммы = 4 Тогда
		
		ЗаголовокФормы = НСтр("ru='Списать бонусы?'");
		УстановитьТекущуюСтраницуОперации(Элементы.ОплатаБонусами, МоноСтраницы);
		Элементы.ДекорацияДанныеКарты.Заголовок = ПредставлениеКарты;
		ЗаголовокБаллы = НСтр("ru='Не более %1 баллов'");
		Элементы.ДекорацияДоступноКОплате.Заголовок = СтрШаблон(ЗаголовокБаллы, ДоступноКОплатеБонусами);
		ИмяЭлементаВводаСуммы = Элементы.СуммаОплаченоБонусами.Имя;
		Сдача = Макс(СуммаИтого - СуммаОплаченоБонусами, 0);
		ИмяЭлементаВводаСуммы = Элементы.СуммаОплаченоБонусами.Имя;
		Элементы.ВыполнитьОперацию.Заголовок = НСтр("ru='Списать'");
		Элементы.СтраницыКартинки.ТекущаяСтраница = Элементы.СтраницаКартинкаБонусы;
		
	ИначеЕсли РежимВводаСуммы = 5 Тогда
		
		ЗаголовокФормы = НСтр("ru='Оплата сертификатом'");
		УстановитьТекущуюСтраницуОперации(Элементы.СтраницаОплатаСертификатом, МоноСтраницы);
		ИмяЭлементаВводаСуммы = Элементы.СуммаСертификата.Имя;
		Элементы.СтраницыЗаголовок.ТекущаяСтраница = Элементы.ДанныеСертификата;
		Элементы.ВыполнитьОперацию.Заголовок = НСтр("ru='Оплатить'");
		
		Если ЗначениеЗаполнено(НомерПодарочногоСертификата) Тогда
			Элементы.ДекорацияСертификат.Заголовок = СтрШаблон(НСтр("ru='%1; %2'"), ПодарочныйСертификат, НомерПодарочногоСертификата);
		Иначе
			Элементы.ДекорацияСертификат.Заголовок = ПодарочныйСертификат;
		КонецЕсли;
		ЗаголовокСуммаСертификата = НСтр("ru='Баланс сертификата: %1 %2%3Не более %4 %5'");
		Элементы.ДекорацияСуммаСертификата.Заголовок = СтрШаблон(ЗаголовокСуммаСертификата, Параметры.СуммаСертификата, ПредставлениеВалюты, Символы.ПС,
			ДоступноКОплатеСертификатом, ПредставлениеВалюты);
		Сдача = Макс(СуммаИтого - СуммаСертификата, 0);
		
	ИначеЕсли РежимВводаСуммы = 6 Или РежимВводаСуммы = 7 Тогда
		ЗаголовокФормы = Параметры.ЗаголовокЭлемента;
		ИмяЭлементаВводаСуммы = Элементы.ЗначениеВвода.Имя;
		Элементы.СтраницыЗаголовок.Видимость = Ложь;
		Элементы.ЗначениеВвода.ФорматРедактирования = Параметры.Формат;
		Если ЗначениеЗаполнено(Параметры.МаскаВвода) Тогда
			Элементы.ЗначениеВвода.Маска = Параметры.МаскаВвода;
		КонецЕсли;
		ОписаниеТипа = Новый ОписаниеТипов(Параметры.ТипЗначения);
		Элементы.ЗначениеВвода.ОграничениеТипа = ОписаниеТипа;
		ЗначениеВвода = ОписаниеТипа.ПривестиЗначение(Параметры.ЗначениеЭлемента);
		
		УстановитьТекущуюСтраницуОперации(Элементы.СтраницаВводаЗначений, МоноСтраницы);
	Иначе
		
		ЗаголовокФормы = НСтр("ru='Оплата наличными'");
		Элементы.СтраницыЗаголовок.Видимость = Ложь;
		ИмяЭлементаВводаСуммы = Элементы.СуммаОплаченоНал.Имя;
		Элементы.ВыполнитьОперацию.Заголовок = НСтр("ru='Оплатить'");
		Если ЭтоВнесениеПредоплатыПоЗаказу Тогда
			СуммаОплаченоВРассрочку = СуммаИтого - СуммаОплаченоЗачетАванса;
			Элементы.ВыполнитьОперацию.Доступность = Ложь;
		ИначеЕсли ПриемАванса И СуммаИтого = 0 Тогда
			Элементы.ВыполнитьОперацию.Доступность = Ложь;
		Иначе
			СуммаОплаченоНал = СуммаИтого - СуммаОплаченоЗачетАванса;
		КонецЕсли;
		
		Элементы.СтраницыКартинки.ТекущаяСтраница = Элементы.СтраницаКартинкаОплатаНаличными;
		Элементы.СуммаОплаченоВРассрочку.Видимость = ЭтоВнесениеПредоплатыПоЗаказу;
		Элементы.СуммаОплаченоЗачетАванса.Видимость = СуммаОплаченоЗачетАванса > 0;
		Элементы.СуммаИтого.Видимость = Не (ПриемАванса И СуммаИтого = 0);
		Элементы.Сдача.Видимость = Не (ПриемАванса И СуммаИтого = 0);
		
		ПанельКупюр = ИспользоватьПанельВводаНаличных;
		Если ИспользоватьПанельВводаНаличных Тогда
			Элементы.ПанельКупюр.Видимость = ИспользоватьПанельВводаНаличных И ИспользоватьЦифровуюКлавиатуру;
			Элементы.ГруппаКупюр.Видимость = ИспользоватьПанельВводаНаличных;
			Элементы.СтраницыВводаСумм.ТекущаяСтраница = Элементы.ГруппаКупюр;
			
			ИнтерфейсРМКСлужебный.ПодготовитьПанельВводаНаличныхКупюр(ЭтотОбъект, ИспользоватьПанельВводаНаличных, Истина);
		Иначе
			Элементы.ПанельКупюр.Видимость = ИспользоватьПанельВводаНаличных;
			Элементы.ГруппаКупюр.Видимость = ИспользоватьПанельВводаНаличных;
		КонецЕсли;
		УстановитьТекущуюСтраницуОперации(Элементы.ОплатаНаличными, МоноСтраницы);
		
	КонецЕсли;
	
	Если ИспользоватьЦифровуюКлавиатуру Тогда
		
		ВидыКлавиатуры = ИнтерфейсРМКСлужебный.ВидыЦифровойКлавиатуры();
		ПараметрыПостроения = Новый Структура();
		ПараметрыПостроения.Вставить("ВидКлавиатуры", ВидыКлавиатуры.Стандартный);
		ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиГоризонтальный", ИнтервалМеждуЭлементамиФормы.Одинарный);
		ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиВертикальный", ИнтервалМеждуЭлементамиФормы.Половинный);
		ПараметрыПостроения.Вставить("РастягиватьПоШирине", Истина);
		ПараметрыПостроения.Вставить("ЦветКнопок", ИнтерфейсРМКСлужебный.ЦветУправляющейКнопки(Истина));
		
		ТекстОшибки = ИнтерфейсРМКСлужебный.ПостроитьПанельЦифровойКлавиатуры(ЭтотОбъект,
			Элементы.ГруппаЦифроваяПанель, ПараметрыПостроения);
			
		Если ПустаяСтрока(ТекстОшибки) Тогда
			Элементы.ПоискСтраницы.Видимость = Ложь;
			Элементы.ЗапятаяУниверсальнаяКлавиатура.Доступность = Параметры.ТребуетсяРазделитель;
		Иначе
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если РежимКассыСамообслуживания Тогда
		ЭтотОбъект.ОтображатьКнопкуЗакрытия = Ложь;
	КонецЕсли;
	
	Если РежимВводаСуммы = 7 Тогда
		Элементы.ЗаголовокФормы.Видимость = Истина;
		Элементы.ЗаголовокФормы.Заголовок = ЗаголовокФормы;
		Заголовок = НСтр("ru='Не указана цена'");
		Элементы.ЗаголовокФормы.Шрифт = ШрифтыСтиля.ЗаголовокТретьегоУровня;
		ЭтотОбъект.ОтображатьЗаголовок = Не РежимКассыСамообслуживания; //Не ЭтоИнтерфейс85;
	ИначеЕсли РежимКассыСамообслуживания И ЭтоИнтерфейс85 Тогда
		ЭтотОбъект.ОтображатьЗаголовок = Ложь;
		Элементы.ЗаголовокФормы.Видимость = Истина;
		Элементы.ЗаголовокФормы.Заголовок = ЗаголовокФормы;
	Иначе
		Заголовок = ЗаголовокФормы;
	КонецЕсли;
	НастроитьРеквизитыВКомпактномРежимеПриНеобходимости(КомпактныйРежимПостроения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьМоноСтраницы(Элементы)
	
	МоноСтраницы = Новый Массив;
	МоноСтраницы.Добавить(Элементы.ОплатаНаличными);
	МоноСтраницы.Добавить(Элементы.СтраницаВводаЗначений);
	Возврат МоноСтраницы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекущуюСтраницуОперации(СтраницаОперации, МоноСтраницы)
	
	СтраницаОперации.Родитель.ТекущаяСтраница = СтраницаОперации;
	ВсеСтраницы = СтраницаОперации.Родитель.ПодчиненныеЭлементы;
	Для Каждого СтраницаГруппы Из ВсеСтраницы Цикл
		Если МоноСтраницы.Найти(СтраницаОперации) = Неопределено Тогда
			Если Не СтраницаГруппы.Видимость = Истина Тогда
				СтраницаГруппы.Видимость = Истина;
			КонецЕсли;
		Иначе
			СтраницаГруппы.Видимость = (СтраницаГруппы = СтраницаОперации);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ОплатаНаличными

&НаКлиенте
Процедура РассчитатьСдачу()
	
	Если Элементы.СтраницыОпераций.ТекущаяСтраница = Элементы.ОплатаБонусами Тогда
		Сдача = Макс(0, СуммаИтого - СуммаОплаченоБонусами);
	ИначеЕсли Элементы.СтраницыОпераций.ТекущаяСтраница = Элементы.СтраницаОплатаСертификатом Тогда
		Сдача = Макс(0, СуммаИтого - СуммаСертификата);
	Иначе
		РассчитатьСуммыПоОперациямСДС();
		Если Не ПриемАванса Или Не СуммаИтого = 0 Тогда
			Сдача = Макс(0, (СуммаОплаченоЗачетАванса + СуммаОплаченоНал + СуммаОплаченоВРассрочку) - СуммаИтого);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыПоОперациямСДС()
	
	Если Не ЭтоВнесениеПредоплатыПоЗаказу Тогда
		Возврат;
	КонецЕсли;
	
	СуммаОплаченоВРассрочку = Макс(0, (СуммаИтого - СуммаОплаченоЗачетАванса - СуммаОплаченоНал));
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьДоступностьОплатыНаличными()
	
	ЭтоПредоплатаБезВведеннойСуммы = (ЭтоВнесениеПредоплатыПоЗаказу Или ПриемАванса) И СуммаОплаченоНал = 0;
	
	Элементы.ВыполнитьОперацию.Доступность = Не ЭтоПредоплатаБезВведеннойСуммы И
		(СуммаОплаченоЗачетАванса + СуммаОплаченоНал + СуммаОплаченоВРассрочку) >= СуммаИтого;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЦифровойКлавиатурой

&НаКлиенте
Процедура ПеревестиКурсорНаВводДробнойЧасти()
	
	ЭлементВводаСуммы = Элементы[ИмяЭлементаВводаСуммы];
	ИмяЭлемента = ЭлементВводаСуммы.Имя;
	НачалоВыделения = 0;
	НачалоСтроки = 0;
	КонецВыделения = 0;
	КонецСтроки = 0;
	ЭлементВВодаСуммы.ПолучитьГраницыВыделения(НачалоСтроки, НачалоВыделения, КонецСтроки, КонецВыделения);
	СимволРазделителя = ИнтерфейсРМКСлужебныйКлиентСервер.РазделительДробнойЧасти();
	ПозицияРазделителя = СтрНайти(ЭлементВВодаСуммы.ТекстРедактирования, СимволРазделителя);
	ТекущийЭлемент = ЭлементВводаСуммы;
	Если ПозицияРазделителя > 0 И ПозицияРазделителя >= НачалоВыделения Тогда
		НоваяПозицияКурсора = ПозицияРазделителя + 1;
		ЭлементВВодаСуммы.УстановитьГраницыВыделения(НоваяПозицияКурсора, НоваяПозицияКурсора);
	Иначе
		ЭлементВВодаСуммы.УстановитьГраницыВыделения(НачалоВыделения, КонецВыделения);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЦифруЦифровойКлавиатуры(ИмяКомандыКлавиатуры)

	СимволКлавиатуры = ИнтерфейсРМКСлужебныйКлиент.ПолучитьСимволКоманды(ИмяКомандыКлавиатуры);
	ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, Элементы[ИмяЭлементаВводаСуммы],
		СимволКлавиатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуДваНуляЦифровойКлавиатуры()
	
	Если СуммаОплаченоНал = 0
		И РежимВводаСуммы = 0 Тогда
		ТекущийЭлемент = Элементы[ИмяЭлементаВводаСуммы];
	Иначе
		СимволыКлавиатуры = ИнтерфейсРМКСлужебныйКлиент.ПолучитьТекстКнопкиДваНуля();
		ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, Элементы[ИмяЭлементаВводаСуммы],
			СимволыКлавиатуры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыЗвездочкаЗапятая()
	
	ПеревестиКурсорНаВводДробнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыОчистить()
	ИнтерфейсРМКСлужебныйКлиент.ОчиститьТекстРедактированияВПолеФормы(ЭтотОбъект, Элементы[ИмяЭлементаВводаСуммы]);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее()
	ИнтерфейсРМКСлужебныйКлиент.УдалитьСимволыВРедактируемомПоле(ЭтотОбъект, Элементы[ИмяЭлементаВводаСуммы], Символы.НПП);
КонецПроцедуры

#КонецОбласти

#Область ОтправкаСМС

&НаСервере
Процедура СформироватьСообщениеИОтправитьSMS()
	
	РезультатОтправкиSMS = СформироватьСообщениеИОтправитьSMSСервер();
	
	УспешнаяОтправка = Ложь;
	Если РезультатОтправкиSMS.Результат Тогда
		
		ТекстПояснения = НСтр("ru='Введите код из SMS для подтверждения'");
		КартинкаСообщения = БиблиотекаКартинок.ОтправитьSMS;
		УспешнаяОтправка = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(РезультатОтправкиSMS.ОписаниеОшибки) Тогда
		
		ТекстПояснения = РезультатОтправкиSMS.ОписаниеОшибки;
		КартинкаСообщения = БиблиотекаКартинок.Ошибка32;
		
	Иначе
		
		ТекстПояснения = НСтр("ru='Ошибка отправки SMS'");
		КартинкаСообщения = БиблиотекаКартинок.Ошибка32;
	КонецЕсли;
	
	Элементы.КартинкаСМС.Картинка = КартинкаСообщения;
	Элементы.ДекорацияРезультатОтправкиСМС.Заголовок = ТекстПояснения;
	ИзменитьГруппуРезультатСМС(КартинкаСообщения, ТекстПояснения, УспешнаяОтправка);
	ТекущийЭлемент = Элементы.КодПроверкиИзСМС;
	
КонецПроцедуры

&НаСервере
Функция СформироватьСообщениеИОтправитьSMSСервер()
	
	КодПодтверждения = СлучайноеЧетырехзначноеЧисло();
	ПопытокВвода = 0;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КодПодтверждения", КодПодтверждения);
	
	ТекстСообщения = "";
	ОбщегоНазначенияРМКПереопределяемый.СформироватьТекстСообщения(ШаблонСообщения,
		ДополнительныеПараметры,
		ТекстСообщения);
	
	РезультатОтправки = ОтправитьSMS(ТекстСообщения, НомерТелефонаПолучателя);
	
	Возврат РезультатОтправки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтправитьSMS(ТекстСообщения, НомерТелефона)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатОтправки = Новый Структура;
	РезультатОтправки.Вставить("Результат", Ложь);
	РезультатОтправки.Вставить("ОписаниеОшибки", "");
	РезультатОтправки.Вставить("НомерТелефона", НомерТелефона);
	
	Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда
		РезультатОтправки.ОписаниеОшибки =
			НСтр("ru = 'Не сформирован текст сообщения для отправки.'");
		Возврат РезультатОтправки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		
		МассивНомеров = Новый Массив;
		МассивНомеров.Добавить(НомерТелефона);
		ОбщегоНазначенияРМКПереопределяемый.ОтправитьSMS(МассивНомеров, ТекстСообщения, РезультатОтправки);
		
	Иначе
		РезультатОтправки.ОписаниеОшибки =
			НСтр("ru = 'Для владельца карты не задан номер телефона. Выслать код подтверждения не удалось'");
	КонецЕсли;
	
	Возврат РезультатОтправки;
	
КонецФункции

&НаСервереБезКонтекста
Функция СлучайноеЧетырехзначноеЧисло()
	
	Генератор = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	СлучайноеЧисло = Генератор.СлучайноеЧисло(0, 9999);
	
	Если СлучайноеЧисло < 1000 Тогда
		СлучайноеЧислоСтрокой = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка(СлучайноеЧисло), 4, "0");
	Иначе
		СлучайноеЧислоСтрокой = Формат(СлучайноеЧисло, "ЧГ=0");
	КонецЕсли;
	
	Возврат СлучайноеЧислоСтрокой;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВведенныйКодИзSMS(КодПроверкиИзSMS)
	
	Если ПустаяСтрока(КодПодтверждения) Тогда
		Возврат;
	КонецЕсли;
	
	Если КодПроверкиИзSMS = КодПодтверждения Тогда
		
		ОбработатьУспешноВведенныйКодИзSMS();
		УспешныйВводСМС = Истина;
		ТребуетсяСМС = Ложь;
		
	Иначе
		
		ОбработатьОшибочноВведенныйКодИзSMS();
		УспешныйВводСМС = Ложь;
		ТребуетсяСМС = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьУспешноВведенныйКодИзSMS()
	
	ИзменитьГруппуРезультатСМС(БиблиотекаКартинок.Успешно,
		НСтр("ru='Номер телефона подтвержден.'"), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОшибочноВведенныйКодИзSMS()
	
	ИзменитьГруппуРезультатСМС(БиблиотекаКартинок.Ошибка32,
		НСтр("ru='Повторите ввод кода или отправьте SMS повторно или отмените ввод карты.'"));
	ПопытокВвода = ПопытокВвода + 1;
	
	ТекущийЭлемент = Элементы.КодПроверкиИзСМС;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьГруппуРезультатСМС(КартинкаСМС, ТекстПояснения, Успех = Ложь)
	
	Элементы.КартинкаСМС.Картинка = КартинкаСМС;
	Элементы.ДекорацияРезультатОтправкиСМС.Заголовок = ТекстПояснения;
	Если Успех Тогда
		Элементы.ГруппаРезультатаСМС.ЦветФона = ЦветаПалитры.Зеленый;
	Иначе
		Элементы.ГруппаРезультатаСМС.ЦветФона = ЦветаПалитры.Красный;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЭлементыВводСМС()
	ЗаголовокФормы = НСтр("ru='Введите СМС'");
	Если РежимКассыСамообслуживания И ЭтоИнтерфейс85 Тогда
		Элементы.ЗаголовокФормы.Заголовок = ЗаголовокФормы;
	Иначе
		Заголовок = ЗаголовокФормы;
	КонецЕсли;
	
	МоноСтраницы = ПолучитьМоноСтраницы(Элементы);
	УстановитьТекущуюСтраницуОперации(Элементы.СтраницаВводСМС, МоноСтраницы);
	СформироватьСообщениеИОтправитьSMS();
	ИмяЭлементаВводаСуммы = Элементы.КодПроверкиИзСМС.Имя;
	Элементы.ВыполнитьОперацию.Заголовок = НСтр("ru='Подтвердить'");
	Элементы.ДекорацияДанныеКарты.Заголовок = НомерТелефонаПолучателя;
	Элементы.СтраницыКартинки.ТекущаяСтраница = Элементы.СтраницаКартинкаСМС;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЭлементыВводНаличных()
	
	ЗаголовокФормы = НСтр("ru='Оплата наличными'");
	Если РежимКассыСамообслуживания И ЭтоИнтерфейс85 Тогда
		Элементы.ЗаголовокФормы.Заголовок = ЗаголовокФормы;
	Иначе
		Заголовок = ЗаголовокФормы;
	КонецЕсли;
	
	МоноСтраницы = ПолучитьМоноСтраницы(Элементы);
	Элементы.ВыполнитьОперацию.Заголовок = НСтр("ru='Оплатить'");
	УстановитьТекущуюСтраницуОперации(Элементы.ОплатаНаличными, МоноСтраницы);
	ИмяЭлементаВводаСуммы = Элементы.СуммаОплаченоНал.Имя;
	СуммаОплаченоНал = Сдача;
	СуммаИтого = Сдача;
	Сдача = 0;
	РежимВводаСуммы = 0;
	Элементы.СтраницыКартинки.ТекущаяСтраница = Элементы.СтраницаКартинкаОплатаНаличными;
	Элементы.ДекорацияДанныеКарты.Заголовок = ПредставлениеКарты;
	Элементы.Сдача.Видимость = Не ПриемАванса;
	
КонецПроцедуры

#КонецОбласти

#Область ПокупюрныйВвод

&НаКлиенте
Процедура ОбновитьОтображениеКупюры(КомандаКупюры, НоминалКупюры)
	
	КоличествоНажатий = 0;
	Если Не СчетчикНажатийНаКупюры.Свойство("Номинал" + НоминалКупюры, КоличествоНажатий) Тогда
		КоличествоНажатий = 0;
	КонецЕсли;
	УстановитьЗаголовокКупюры(КомандаКупюры, КоличествоНажатий, НоминалКупюры);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокКупюры(КомандаКупюры, КоличествоНажатий, НоминалКупюры)
	
	ЗаголовокКупюры = "";
	Если КоличествоНажатий > 0 Тогда
		ЗаголовокКупюры = СтрШаблон("(%1) %2", Формат(КоличествоНажатий, "ЧГ="), НоминалКупюры);
	ИначеЕсли НоминалКупюры = "0" Тогда
		ЗаголовокКупюры = "X";
	Иначе
		ЗаголовокКупюры = НоминалКупюры;
	КонецЕсли;
	КомандаКупюры.Заголовок = ЗаголовокКупюры;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыбратьКупюру(Команда)
	НоминалКупюры = сред(Команда.Имя, 12);
	ОбработатьНажатиеКупюры(НоминалКупюры);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеКупюры(НоминалКупюры)
	
	Если НоминалКупюры = "0" Тогда
		СуммаОплаченоНал = 0;
		РассчитатьСдачу();
		ОпределитьДоступностьОплатыНаличными();
		ОбнулитьСчетчикНажатийКупюр();
		Возврат;
	КонецЕсли;
	
	ЭтоНачалоВвода = (СчетчикНажатийНаКупюры.Количество() = 0);
	Если ЭтоНачалоВвода Тогда
		СуммаОплаченоНал = 0;
	КонецЕсли;
	КлючСтруктуры = "Номинал" + НоминалКупюры;
	КоличествоНажатий = 0;
	Если СчетчикНажатийНаКупюры.Свойство(КлючСтруктуры, КоличествоНажатий) Тогда
		КоличествоНажатий = КоличествоНажатий + 1;
	Иначе
		КоличествоНажатий = 1;
	КонецЕсли;
	СчетчикНажатийНаКупюры.Вставить(КлючСтруктуры, КоличествоНажатий);
	КомандаКупюры = Элементы.Найти("Купюра"+НоминалКупюры);
	Если Не КомандаКупюры = Неопределено Тогда
		УстановитьЗаголовокКупюры(КомандаКупюры, КоличествоНажатий, НоминалКупюры);
	КонецЕсли;
	ОписаниеТипа = Новый ОписаниеТипов("Число");
	ТекущаяСумма = ОписаниеТипа.ПривестиЗначение(НоминалКупюры);
	Если ТекущаяСумма = 0 Тогда
		ЗаписатьОшибкуОбработкиНажатияКупюры(НСтр("ru = 'Не корректный номинал купюры:'") + НоминалКупюры);
	Иначе
		ПеренестиВыбраннуюСуммуВНаличные(ТекущаяСумма, ЭтоНачалоВвода);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКоличестваНажатийНаКупюры()
	
	ОбновитьОтображениеКоличестваНажатийВГруппеКупюр(Элементы.ГруппаКупюрРяд1);
	ОбновитьОтображениеКоличестваНажатийВГруппеКупюр(Элементы.ГруппаКупюрРяд2);
	ОбновитьОтображениеКоличестваНажатийВГруппеКупюр(Элементы.ГруппаКупюрРяд3);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнулитьСчетчикНажатийКупюр()
	Если ИспользоватьПанельВводаНаличных Тогда
		СчетчикНажатийНаКупюры = Новый Структура;
		ОбновитьОтображениеКоличестваНажатийНаКупюры();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКоличестваНажатийВГруппеКупюр(ЭлементГруппаКупюр)
	
	Для Каждого ГруппаКупюрыПод Из ЭлементГруппаКупюр.ПодчиненныеЭлементы Цикл
		НоминалКупюры = сред(ГруппаКупюрыПод.Имя, 13);
		ГруппаКупюры = ГруппаКупюрыПод.ПодчиненныеЭлементы.Найти("ГруппаКупюры"+НоминалКупюры);
		КомандаКупюры = ГруппаКупюрыПод.ПодчиненныеЭлементы.Найти("Купюра"+НоминалКупюры);
		ОбновитьОтображениеКупюры(КомандаКупюры, НоминалКупюры);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьОшибкуОбработкиНажатияКупюры(ПодробноеПредставлениеОшибки)
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Выбор номинала купюры.Ошибка обработки нажатия купюры'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки);
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыбраннуюСуммуВНаличные(ТекущаяСумма, ЭтоНачалоВвода)
	
	Если ЭтоНачалоВвода Тогда
		СуммаОплаченоНал = ТекущаяСумма;
	Иначе
		СуммаОплаченоНал = СуммаОплаченоНал + ТекущаяСумма;
	КонецЕсли;
	
	РассчитатьСдачу();
	ОпределитьДоступностьОплатыНаличными();
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура СуммаБонусовПриИзмененииНаКлиенте()
	Отказ = Ложь;
	Если СуммаОплаченоБонусами > ДоступноКОплатеБонусами Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Доступно к оплате бонусами не более %1 баллов'"), ДоступноКОплатеБонусами);
		ПараметрыОткрытияФормыОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстСообщения);
		ПараметрыОткрытияФормыОшибки.ЭтоПредупреждение = Истина;
		ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект,ПараметрыОткрытияФормыОшибки);
		СуммаОплаченоБонусами = ДоступноКОплатеБонусами;
	Иначе
		РассчитатьСдачу();
	КонецЕсли;
	
	Если ЗапрашиватьСМС
		И СуммаПодтвержденияБонусов >= СуммаОплаченоБонусами
		И НЕ СуммаПодтвержденияБонусов = 0 Тогда
		ТребуетсяСМС = Ложь;
		УспешныйВводСМС = Истина;
	Иначе
		ТребуетсяСМС = ЗапрашиватьСМС;
	КонецЕсли;
	
КонецПроцедуры

#Область ВыводНаДисплей
&НаКлиенте
Процедура ВывестиДанныеОБонусах()
	ТипыОперацийДисплеяПокупателя = МенеджерОборудованияРМККлиент.ТипыОперацийДисплеяПокупателя();
	
	ШаблонТекста = НСтр("ru = '%1 %2 %3'");
	ТекстСуммаБонусов = СтрШаблон(ШаблонТекста, НСтр("ru = 'Доступно бонусов:'"), Формат(ДоступноКОплатеБонусами, "ЧДЦ=2; ЧН=0,00; ЧРГ='''"), ПредставлениеВалюты);
	ДанныеКПередачеВДисплейПокупателя = ИнтерфейсРМКСлужебныйКлиент.БуферОбменаДисплеяПокупателя();
	ДанныеКПередачеВДисплейПокупателя.Информация = ТекстСуммаБонусов;
	
	ВывестиИнформациюНаДисплейПокупателя(ТипыОперацийДисплеяПокупателя.Информация);
КонецПроцедуры

&НаКлиенте
Процедура ВывестиИнформациюНаДисплейПокупателя(Операция, ТекстОшибки = "")
	
	Если Не ИспользоватьДисплейПокупателя Тогда
		Возврат;
	КонецЕсли;
	
	ИсходныеДанные = МенеджерОборудованияРМККлиент.ИсходныеДанныеДляПервичнойПередачиНаДисплейПокупателя();
	ИсходныеДанные.ОповещениеПриЗавершении = Новый ОписаниеОповещения("ВывестиИнформациюНаДисплейПокупателяЗавершение", ЭтотОбъект);
	ИсходныеДанные.ИспользоватьПодключаемоеОборудование = Истина;
	ИсходныеДанные.ДанныеДляОтображения = ДанныеКПередачеВДисплейПокупателя;
	ИсходныеДанные.Операция = Операция;
	МенеджерОборудованияРМККлиент.ВывестиИнформациюНаДисплейПокупателя(Операция, ИсходныеДанные, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиИнформациюНаДисплейПокупателяЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РезультатВыполнения, "Результат")
		И НЕ РезультатВыполнения.Результат Тогда
		
		ТекстЗаголовка = НСтр("ru = 'При снятии отчета на фискальном регистраторе произошла ошибка.'");
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось вывести информацию на дисплей покупателя по причине: %1'"),
			РезультатВыполнения.ОписаниеОшибки);
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстСообщения, ТекстЗаголовка);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыОткрытияОшибки, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВывестиОшибкуВводаЦены()
	
	ТекстЗаголовка = НСтр("ru = 'Цена не заполнена.'");
	ТекстСообщения = НСтр("ru = 'Поле с ценой должно быть заполнено.'");
	ПараметрыОткрытияФормыОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстСообщения, ТекстЗаголовка);
	ПараметрыОткрытияФормыОшибки.ЭтоПредупреждение = Истина;
	ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыОткрытияФормыОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьПодтверждениеОтмены()
	
	ТекстВопроса = "";
	Если РежимВводаСуммы = 7 Тогда
		ТекстВопроса = НСтр("ru = 'Товар не будет добавлен в чек. Продолжить?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Вы действительно хотите закрыть форму?'");
	КонецЕсли;
	ОповещениеПодтверждения = Новый ОписаниеОповещения("ПодтверждениеОтменыЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеПодтверждения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеОтменыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытиеПодтверждено = Истина;
		Закрыть(ШаблонОтвета());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти