///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Для Каждого ИдентификаторыВидаКлассификатора Из ДанныеЗаполнения Цикл
			ВидКлассификатора = СПАРКФакторыРиска.ВидКлассификатораПоТегу(ИдентификаторыВидаКлассификатора.Ключ);
			Для Каждого ОписаниеИдентификатора Из ИдентификаторыВидаКлассификатора.Значение Цикл
				
				НоваяЗапись = Добавить();
				НоваяЗапись.ВидКлассификатора  = ВидКлассификатора;
				НоваяЗапись.ИдентификаторРиска = ОписаниеИдентификатора.Идентификатор;
				НоваяЗапись.Название           = ОписаниеИдентификатора.Название;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
