
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если МобильныйКлиентУНФ.ФункциональностьВременноНедоступна(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	РазобранныеПараметры = РазобратьПараметры(Параметры);
	ОбработатьПараметры(РазобранныеПараметры);
	ОбновитьОтображениеПодсказкиПоСодержанию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтображениеСодержанияПриИзменении(Элемент)
	
	ОбновитьОтображениеПодсказкиПоСодержанию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	СохранитьНастройкиОтборов();
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтображениеПодсказкиПоСодержанию()
	
	Если ОтображениеСодержания = "Снизу" Тогда
		
		Элементы.КартинкаПримераПредпросмотра.Картинка = БиблиотекаКартинок.ПредпросмотрСобытияСнизу;
		Элементы.ДекорацияОписаниеОтображенияСодержания.Заголовок = НСтр("ru = 'Показывать содержание письма под списком'");
		
	ИначеЕсли ОтображениеСодержания = "Справа" Тогда
		
		Элементы.КартинкаПримераПредпросмотра.Картинка = БиблиотекаКартинок.ПредпросмотрСобытияСправа;
		Элементы.ДекорацияОписаниеОтображенияСодержания.Заголовок = НСтр("ru = 'Показывать содержание письма справа от списка'");
		
	Иначе
		
		Элементы.КартинкаПримераПредпросмотра.Картинка = БиблиотекаКартинок.КомпактныйСписокПисем;
		Элементы.ДекорацияОписаниеОтображенияСодержания.Заголовок = НСтр("ru = 'Не показывать содержание письма'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазобратьПараметры(Параметры)
	
	Результат = Новый Структура;
	
	НастройкаСпискаСобытий = Неопределено;
	Параметры.Свойство("НастройкаСпискаСобытий", НастройкаСпискаСобытий);
	НеопределеноВЛожь(НастройкаСпискаСобытий);
	Результат.Вставить("НастройкаСпискаСобытий", НастройкаСпискаСобытий);
	
	НастройкаСпискаИстории = Неопределено;
	Параметры.Свойство("НастройкаСпискаИстории", НастройкаСпискаИстории);
	НеопределеноВЛожь(НастройкаСпискаИстории);
	Результат.Вставить("НастройкаСпискаИстории", НастройкаСпискаИстории);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработатьПараметры(РазобранныеПараметры)
	
	Если РазобранныеПараметры.НастройкаСпискаИстории Тогда
		
		ПриСозданииНаСервереДляСпискаИстории();
		
	Иначе
		
		ПриСозданииНаСервереДляОсновногоСписка(РазобранныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереДляСпискаИстории()
	
	ТипНастраиваемогоСписка = "ИсторияПереписки";
	
	Заголовок = НСтр("ru = 'Настройка истории переписки'");
	
	НастройкиСпискаИсторииПереписки = ХранилищеСистемныхНастроек.Загрузить(
	"НастройкиСпискаИсторииПереписки", "ГруппаОтбораСписокПисем_НастройкиСпискаИсторииПереписки");
	
	Если ТипЗнч(НастройкиСпискаИсторииПереписки) = Тип("Структура") Тогда
		
		ВидПредпросмотраПисьма = Неопределено;
		НастройкиСпискаИсторииПереписки.Свойство("ВидПредпросмотраПисьма", ВидПредпросмотраПисьма);
		Если ВидПредпросмотраПисьма = Неопределено Тогда
			ВидПредпросмотраПисьма = "Справа";
		КонецЕсли;
		
		ОтображениеСодержания = ВидПредпросмотраПисьма;
		
	Иначе
		
		ОтображениеСодержания = "Справа";
		
	КонецЕсли;
	
	Элементы.НастройкиСпискаПисем.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереДляОсновногоСписка(РазобранныеПараметры)
	
	ТипНастраиваемогоСписка = "ГлавныйСписок";
	
	Если РазобранныеПараметры.НастройкаСпискаСобытий Тогда
		Заголовок = НСтр("ru = 'Настройки списка событий'");
		Элементы.НастройкиСпискаПисем.Видимость = Ложь;
	КонецЕсли;
	
	НастройкиСпискаПапок = ХранилищеСистемныхНастроек.Загрузить(
	"НастройкиСпискаПапок", "ГруппаОтбораСписокПисем_НастройкиСпискаПапок");
	
	Если ТипЗнч(НастройкиСпискаПапок) = Тип("Структура") Тогда
		
		ВидПредпросмотраПисьма = Неопределено;
		НастройкиСпискаПапок.Свойство("ВидПредпросмотраПисьма", ВидПредпросмотраПисьма);
		Если ВидПредпросмотраПисьма = Неопределено Тогда
			ВидПредпросмотраПисьма = "Снизу";
		КонецЕсли;
		
		ВидСписка = Неопределено;
		НастройкиСпискаПапок.Свойство("ВидСписка", ВидСписка);
		Если ВидСписка = Неопределено Тогда
			ВидСписка = "Компактный";
		КонецЕсли;
		
		ВидПапок = Неопределено;
		НастройкиСпискаПапок.Свойство("ВидПапок", ВидПапок);
		Если ВидПапок = Неопределено Тогда
			ВидПапок = "Использовать";
		КонецЕсли;
		
		ОтображатьКолонкуВложения = Неопределено;
		НастройкиСпискаПапок.Свойство("ОтображатьКолонкуВложения", ОтображатьКолонкуВложения);
		Если ОтображатьКолонкуВложения = Неопределено Тогда
			ОтображатьКолонкуВложения = Истина;
		КонецЕсли;
		
		ОтображениеСодержания = ВидПредпросмотраПисьма;
		ПоказыватьДеревоПапок = (ВидПапок = "Использовать");
		ОтображениеСпискаВДвеСтроки = (ВидСписка <> "Компактный");
		
	Иначе
		
		ОтображатьКолонкуВложения = Истина;
		ОтображениеСодержания = "Снизу";
		
		ПоказыватьДеревоПапок = Истина;
		ОтображениеСпискаВДвеСтроки = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	Если ТипНастраиваемогоСписка = "ГлавныйСписок" Тогда
		СохранитьНастройкиГлавногоСписка(ОтображениеСодержания);
	Иначе
		СохранитьНастройкиИсторииПереписки(ОтображениеСодержания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиГлавногоСписка(ВидПредпросмотраПисьма)
	
	ВидСписка = ?(ОтображениеСпискаВДвеСтроки, "Расширенный", "Компактный");
	ВидПапок = ?(ПоказыватьДеревоПапок, "Использовать", "НеИспользовать");
	
	НастройкиСпискаПапок = Новый Структура;
	НастройкиСпискаПапок.Вставить("ВидСписка", ВидСписка);
	НастройкиСпискаПапок.Вставить("ВидПапок", ВидПапок);
	НастройкиСпискаПапок.Вставить("ОтображатьКолонкуВложения", ОтображатьКолонкуВложения);
	НастройкиСпискаПапок.Вставить("ВидПредпросмотраПисьма", ВидПредпросмотраПисьма);
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		ХранилищеСистемныхНастроек.Сохранить(
		"НастройкиСпискаПапок", "ГруппаОтбораСписокПисем_НастройкиСпискаПапок", НастройкиСпискаПапок);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиИсторииПереписки(ВидПредпросмотраПисьма)
	
	НастройкиСпискаИсторииПереписки = Новый Структура;
	НастройкиСпискаИсторииПереписки.Вставить("ВидПредпросмотраПисьма", ВидПредпросмотраПисьма);
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		ХранилищеСистемныхНастроек.Сохранить(
		"НастройкиСпискаИсторииПереписки", "ГруппаОтбораСписокПисем_НастройкиСпискаИсторииПереписки", НастройкиСпискаИсторииПереписки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НеопределеноВЛожь(Значение)
	
	Если Значение = Неопределено Тогда
		Значение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
