
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СчетЗатрат				= Параметры.СчетЗатрат;
	ВидНачисленияУдержания	= Параметры.Ссылка;
	
	УстановитьСвязьПараметровВыбораНаСервере();
	
	ТекстПредупреждения = "";
	Если ОтказИзменитьСчетЗатрат(ВидНачисленияУдержания) Тогда
		ТекстПредупреждения
			= НСтр("ru = 'В базе есть движения по этому виду начисления (удержания): изменение счета учета запрещено.'");
		
		Элементы.ГруппаСчетовУчета.ТолькоПросмотр = Истина;
		Элементы.ПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
	ТипВида = ТипВидаНачисленияУдержания(ВидНачисленияУдержания);
	Если ТипВида.ЭтоНалог Тогда
		ТекстПредупреждения = НСтр("ru = 'Для начисления типа ""Налог"" счета учета не редактируются.'");
		
		Элементы.ГруппаСчетовУчета.Видимость = Ложь;
		Элементы.ПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстПредупреждения) Тогда
		ВывестиПредупреждениеЗапрет(ТекстПредупреждения);
	КонецЕсли;
	
	Если Не ПравоДоступа("Редактирование", ВидНачисленияУдержания.Метаданные()) Тогда
		Элементы.ГруппаСчетовУчета.ТолькоПросмотр = Истина;
		Элементы.ПоУмолчанию.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СчетЗатратПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетЗатрат) Тогда
		
		СчетЗатрат = ПредопределенноеЗначение("ПланСчетов.Управленческий.УправленческиеРасходы");
		
	КонецЕсли;
	
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры // СчетЗатратПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	СчетЗатрат = ПредопределенноеЗначение("ПланСчетов.Управленческий.УправленческиеРасходы");
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры // ПоУмолчанию()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповеститьОбИзмененииСчетов()
	
	СтруктураПараметры = Новый Структура("СчетЗатрат", СчетЗатрат);
	Оповестить("ИзменилисьСчетаВидыНачисленийИУдержаний", СтруктураПараметры);
	
КонецПроцедуры // ОповеститьОбИзмененииСчетов()

&НаСервере
Функция ОтказИзменитьСчетЗатрат(ВидНачисленияУдержания)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НачисленияИУдержания.Период,
	|	НачисленияИУдержания.Регистратор,
	|	НачисленияИУдержания.НомерСтроки,
	|	НачисленияИУдержания.Активность,
	|	НачисленияИУдержания.Организация,
	|	НачисленияИУдержания.СтруктурнаяЕдиница,
	|	НачисленияИУдержания.Сотрудник,
	|	НачисленияИУдержания.ПериодРегистрации,
	|	НачисленияИУдержания.Валюта,
	|	НачисленияИУдержания.ВидНачисленияУдержания,
	|	НачисленияИУдержания.Сумма,
	|	НачисленияИУдержания.СуммаВал,
	|	НачисленияИУдержания.ДатаНачала,
	|	НачисленияИУдержания.ДатаОкончания,
	|	НачисленияИУдержания.ОтработаноДней,
	|	НачисленияИУдержания.ОтработаноЧасов,
	|	НачисленияИУдержания.Размер
	|ИЗ
	|	РегистрНакопления.НачисленияИУдержания КАК НачисленияИУдержания
	|ГДЕ
	|	НачисленияИУдержания.ВидНачисленияУдержания = &ВидНачисленияУдержания");
	
	Запрос.УстановитьПараметр("ВидНачисленияУдержания",
		?(ЗначениеЗаполнено(ВидНачисленияУдержания), ВидНачисленияУдержания, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции // ОтказИзменитьСчетЗатрат()

&НаСервере
Процедура ВывестиПредупреждениеЗапрет(ТекстПредупреждения)
	
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.ТипСообщения = "Предупреждение";
	ПараметрыСообщения.Скрываемый = Ложь;
	ПараметрыСообщения.Сообщение = ТекстПредупреждения;
	ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Изменение запрещено'");
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеДляВыбораСчетаРасчетов(СтруктураДанных)
	
	ДоступныеТипыСчетовУчета = Новый Массив;
	ВидНачисленияУдержания = СтруктураДанных.ВидНачисленияУдержания;
	ТипВида = ТипВидаНачисленияУдержания(ВидНачисленияУдержания);
	
	Если НЕ ЗначениеЗаполнено(ВидНачисленияУдержания) Тогда
		
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.НезавершенноеПроизводство);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.КосвенныеЗатраты);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.Расходы);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеРасходы);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеВнеоборотныеАктивы);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеДоходы);
	КонецЕсли;
		
	Если ТипВида.ЭтоНачисление Тогда
		
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.НезавершенноеПроизводство);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.КосвенныеЗатраты);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.Расходы);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеРасходы);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеВнеоборотныеАктивы);
	КонецЕсли;
	
	Если ТипВида.ЭтоУдержание Тогда
		
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеДоходы);
		
	КонецЕсли;
	
	СтруктураДанных.Вставить("ДоступныеТипыСчетовУчета", ДоступныеТипыСчетовУчета);
	
КонецПроцедуры // ПолучитьДанныеДляВыбораСчетаРасчетов()

&НаСервере
Процедура УстановитьСвязьПараметровВыбораНаСервере()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ВидНачисленияУдержания", ВидНачисленияУдержания);
		
	ПолучитьДанныеДляВыбораСчетаРасчетов(СтруктураДанных);
	
	НовыйМассив = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСчета",
		Новый ФиксированныйМассив(СтруктураДанных.ДоступныеТипыСчетовУчета));
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы.СчетЗатрат.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
КонецПроцедуры // УстановитьСвязьПараметровВыбораНаСервере()

&НаСервереБезКонтекста
Функция ТипВидаНачисленияУдержания(ВидНачисленияУдержания)
	
	Результат = Новый Структура;
	Результат.Вставить("ЭтоНачисление", Ложь);
	Результат.Вставить("ЭтоУдержание", Ложь);
	Результат.Вставить("ЭтоНалог", Ложь);
	
	Если ЗначениеЗаполнено(ВидНачисленияУдержания) Тогда
		
		ТипВида = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНачисленияУдержания, "Тип");
		Если ТипВида = Перечисления.ТипыНачисленийИУдержаний.Начисление Тогда
			Результат.ЭтоНачисление = Истина;
		КонецЕсли;
		
		Если ТипВида = Перечисления.ТипыНачисленийИУдержаний.Удержание Тогда
			Результат.ЭтоУдержание = Истина;
		КонецЕсли;
		
		Если ТипВида = Перечисления.ТипыНачисленийИУдержаний.Налог Тогда
			Результат.ЭтоНалог = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
