#Область ОписаниеПеременных
&НаКлиенте
Перем ЦветГиперссылки;

// Строка табличной части настройки РМК "Ввод наличных", которую только что отредактировали
&НаКлиенте
Перем ТекущаяСтрокаКупюры;

// Строка дерева горячих клавиш, которую только что отредактировали
&НаКлиенте
Перем ТекущаяСтрокаГорячейКлавиши;

// структура с настройками свойств элементов кнопок по умолчанию.
&НаКлиенте
Перем ЗначенияНастроекЭлементовПоУмолчанию;

&НаКлиенте
Перем ФайлXML;

// Структура с реквизитами палитры для построения схемы формы РМК
&НаКлиенте
Перем РеквизитыПалитры Экспорт;

&НаКлиенте
Перем ЗакрыватьФормуБезКонтроляИзмененийНастроек;

// Таблица клиентская (массив структур) с иерархией построения плитки для текущего типа построения.
&НаКлиенте
Перем ДанныеДляПлитки Экспорт;

// Структура с возможными вариантами типов построения плитки: 0 - по палитре, 1 - весовой товар,
// 3 - распознанный весовой товар.
&НаКлиенте
Перем ТипыПостроенияПлитки Экспорт;

// Текущий тип построения плитки.
&НаКлиенте
Перем ТипПостроенияПлитки Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦветаФормы = ОбщегоНазначенияРМК.ЦветаФормыРМК();
	ТекущийТорговыйОбъект = ОбщегоНазначенияРМК.ТекущийТорговыйОбъект();
	АкселераторыОткрытияИзбранных = ШаблонАкселераторовГорячихКлавиш();
	АктуальныеАкселераторыОткрытияИзбранных = ШаблонАкселераторовГорячихКлавиш();
	УстановитьОтборПоРазделам();
	ЗаполнитьСписокРазделов();
	АктуализироватьЭлементыФормы();
	ЗаполнитьТаблицуПоиска();
	ПараметрыЛогирования = ПолучитьПараметрыЛогирования();
	ПодготовитьПлиточныйИнтерфейсПодбора(Истина, Истина);
	ПодготовитьНастройкиВариантаИнтерфейса();
	ОбщегоНазначенияРМК.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьЗаголовокФормы();
	УстановитьДоступностьЭлементовФормы();
	ВыполнитьСерверныеДействияДляКлиента();
	Если ПараметрыЛогирования <> Неопределено Тогда
		ОбновитьПредставлениеЛогирования();
	КонецЕсли;
	УстановитьАктивностьВерхнегоРаздела();
	ОбновитьОтображениеФормыНастроек(ЭтотОбъект);
	
	ЗаполнитьПервоначальноКнопкиПлиток();
	ПерезаполнитьКнопкиИзбранного();

	УстановитьВидимостьЭлементовНастроекОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы Тогда
		
		ПроверкаНастроекПередЗакрытием(Отказ);
		
	Иначе
		
		Отказ = Истина;
		ТекстПредупреждения = НСтр("ru = 'При закрытии формы все данные будут утеряны. Продолжить?'");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Файл" Тогда
		
		Если Параметр.Свойство("ВладелецФайла") И Параметр.ВладелецФайла = НастройкиРМК.Ссылка Тогда
			
			Если Не ЗначениеЗаполнено(Источник)
				Или (ТипЗнч(Источник) = Тип("Массив")
				И Источник.Количество() = 0) Тогда
				Возврат;
			КонецЕсли;
			
			СсылкаНаФайл = ?(ТипЗнч(Источник) = Тип("Массив"), Источник[0], Источник);
			ОбновитьИзображениеНачалаПродажи(СсылкаНаФайл);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "НастройкиОбменаСохранены" Тогда
		
		НастройкаККМEDСуществует = Истина;
		УстановитьВидимостьЭлементовНастроекОбмена();	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыСписокРазделов
&НаКлиенте
Процедура СписокРазделовПриАктивизацииСтроки(Элемент)
	АктивироватьРазделФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовНастройкиРМКВводНаличных
&НаКлиенте
Процедура НастройкиРМКВводНаличныхПриАктивизацииСтроки(Элемент)
	НастройкаРМКВводНаличныхПриАктивизацииСтрокиКлиент();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКВводНаличныхКлавишаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.НастройкиРМКВводНаличных.ТекущиеДанные;
	
	Если ПустаяСтрока(ТекущаяСтрока.Клавиша) Тогда
		ТекущаяСтрока.Клавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	КонецЕсли;
	ПроверитьНекорректныеКомбинацииГорячихКлавиш();
	ТекущаяСтрокаКупюры = Элементы.НастройкиРМКВводНаличных.ТекущаяСтрока;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоГорячиеКлавиши

&НаКлиенте
Процедура ДеревоГорячиеКлавишиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	КолонкиРеакции = Новый Массив;
	КолонкиРеакции.Добавить("ДеревоГорячиеКлавишиНомерСтроки");
	КолонкиРеакции.Добавить("ДеревоГорячиеКлавишиДействие");
	КолонкиРеакции.Добавить("ДеревоГорячиеКлавишиИмяРаздела");
	КолонкиРеакции.Добавить("ДеревоГорячиеКлавишиСостояниеНастроек");
	
	СценарийСамообслуживания = ПредопределенноеЗначение("Перечисление.СценарииИспользованияРМК.ТерминалСамообслуживания");
	СтрокаДереваГорячихКлавиш = ДеревоГорячиеКлавиши.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаДереваГорячихКлавиш.СостояниеНастроек > ВозможныеСостоянияНастроек.НеИмеетНастроек
			И (Не КолонкиРеакции.Найти(Поле.Имя) = Неопределено
			Или НастройкиРМК.СценарийИспользования = СценарийСамообслуживания) Тогда
		ПараметрыРедактирования = ПараметрыДляРедактированияЭлементаРМК(СтрокаДереваГорячихКлавиш);
		ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеНастроекЭлементаЗавершение", ЭтотОбъект, ВыбраннаяСтрока);
		Если ПараметрыРедактирования.Настройки.Количество() > 0 Тогда
			ОткрытьФорму("Обработка.РедактированиеПанелейРМК.Форма.ФормаРедактированияПанели",
				ПараметрыРедактирования, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГорячиеКлавишиПриАктивизацииСтроки(Элемент)
	ДеревоГорячиеКлавишиПриАктивизацииСтрокиКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГорячиеКлавишиКлавишаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоГорячиеКлавиши.ТекущиеДанные;
	ПустаяКлавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	
	Если ПустаяСтрока(ТекущаяСтрока.Клавиша) Тогда
		ТекущаяСтрока.Клавиша = ПустаяКлавиша;
	КонецЕсли;
	
	Если ТекущаяСтрока.Клавиша = ПустаяКлавиша Тогда
		
		ТекущаяСтрока.АкселераторAlt	= Ложь;
		ТекущаяСтрока.АкселераторCtrl	= Ложь;
		ТекущаяСтрока.АкселераторShift	= Ложь;
		
	КонецЕсли;
	ПроверитьНекорректныеКомбинацииГорячихКлавиш();
	ТекущаяСтрокаГорячейКлавиши = Элементы.ДеревоГорячиеКлавиши.ТекущаяСтрока;
	УстановитьЗаполнениеКлавиш();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГорячиеКлавишиАкселераторAltПриИзменении(Элемент)
	ДеревоГорячиеКлавишиАкселераторAltПриИзмененииКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГорячиеКлавишиАкселераторCtrlПриИзменении(Элемент)
	ДеревоГорячиеКлавишиАкселераторCtrlПриИзмененииКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГорячиеКлавишиАкселераторShiftПриИзменении(Элемент)
	ДеревоГорячиеКлавишиАкселераторShiftПриИзмененииКлиент();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУстройстваРаспознаванияЭлектронныхВесов

&НаКлиенте
Процедура УстройстваРаспознаванияЭлектронныхВесовПриИзменении(Элемент)
	
	ИзмененаТаблицаУстройствРаспознаванияЭлектронныхВесов = Истина;
	УстановитьДоступностьНастроекРаспознавания();
	
КонецПроцедуры

&НаКлиенте
Процедура УстройстваРаспознаванияЭлектронныхВесовЭлектронныеВесыНачалоВыбора(Элемент,
	ДанныеВыбора,
	СтандартнаяОбработка)
	
	ЭлектронныеВесыДляВыбора = ДоступныеЭлектронныеВесы.ВыгрузитьЗначения();
	ТаблицаУстройствРаспознаванияТекущаяСтрока = Элементы.УстройстваРаспознаванияЭлектронныхВесов.ТекущаяСтрока;
	Для Каждого СтрокаОборудования Из УстройстваРаспознаванияЭлектронныхВесов Цикл
		Если ЗначениеЗаполнено(СтрокаОборудования.ЭлектронныеВесы)
				И Не СтрокаОборудования.ПолучитьИдентификатор() = ТаблицаУстройствРаспознаванияТекущаяСтрока Тогда
			
			ИндексЭлемента = ЭлектронныеВесыДляВыбора.Найти(СтрокаОборудования.ЭлектронныеВесы);
			Если Не ИндексЭлемента = Неопределено Тогда
				ЭлектронныеВесыДляВыбора.Удалить(ИндексЭлемента);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	КолонкаЭлектронныеВесы = Элементы.УстройстваРаспознаванияЭлектронныхВесовЭлектронныеВесы;
	КолонкаЭлектронныеВесы.СписокВыбора.ЗагрузитьЗначения(ЭлектронныеВесыДляВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокУстройств

&НаКлиенте
Процедура СписокУстройствПриИзменении(Элемент)
	АктуализироватьНастройкиОборудования();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовНастройкиРМКРаспределениеНоменклатуры
&НаКлиенте
Процедура НастройкиРМКГруппыКатегорииПриИзменении(Элемент)
	Если НастройкиРМК.РаспределениеНоменклатуры.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбОчисткеРаспределения", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Настройки распределения будут очищены. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		УстановитьВидимостьГруппКатегорий();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКРаспределениеНоменклатурыСпециальныйНалоговыйРежимПриИзменении(Элемент)
	УстановитьВидимостьГруппКатегорий();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НастройкиРМКПродажиСНесколькихКассККМПриИзменении(Элемент)
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНесколькоКасс, НастройкиРМК.ПродажиСНесколькихКассККМ);
	УстановитьДоступностьЭлементаФормы(Элементы.НастройкиРМКОсновнаяКассаККМ, НастройкиРМК.ПродажиСНесколькихКассККМ);
	Если Не НастройкиРМК.ПродажиСНесколькихКассККМ Тогда
		НастройкиРМК.ОсновнаяКассаККМ = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКРазрешитьВыборПродавцаПриИзменении(Элемент)
	НастроитьИспользованиеПродавцов();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКОжидатьРезультатПроверкиМарокПриИзменении(Элемент)
	УстановитьДоступностьНастроекИСМП();
	УстановитьДоступностьПредупрежденияСЛ();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКЛокальныйКонтрольКлючаИСМППриИзменении(Элемент)
	УстановитьДоступностьПредупрежденияСЛ();
КонецПроцедуры

&НаКлиенте
Процедура ПередаватьОтчетыОПодключенииКегКОборудованиюРозливаИзРМКПриИзменении(Элемент)
	ПередаватьОтчетыОПодключенииКегКОборудованиюРозливаИзРМКПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеЛогированияЗапросовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
		ОбработкаНавигационнойСсылкиЛогирования(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеЛогированияЗапросовРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ОбработкаНавигационнойСсылкиЛогирования(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКонтрольПродажПриИзменении(Элемент)
	ИспользоватьКонтрольПродажПриИзмененииНаСервере();
	УстановитьНастройкиMAX();
КонецПроцедуры

&НаСервере
Процедура ИспользоватьКонтрольПродажПриИзмененииНаСервере()
	Если Не НастройкиРМК.ИспользоватьКонтрольПродаж И СуществуетСлужебнаяПалитраТоваров() Тогда
		ИспользоватьКонтрольПродаж = Истина;
		ТекстПредупреждения = НСтр("ru = 'Нельзя отключить использование контроля продаж. В системе есть палитра товаров для контроля продаж.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстПредупреждения);
	Иначе
		ИмяКонстанты = ОбщегоНазначенияРМК.ИмяКонстанты("ИспользоватьКонтрольПродаж");
		СохранитьЗначениеКонстанты(ИмяКонстанты, НастройкиРМК.ИспользоватьКонтрольПродаж);
	КонецЕсли;
	
	Элементы.ВыгрузитьКонтрольПродаж.Видимость = НастройкиРМК.ИспользоватьКонтрольПродаж;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРазрешитьВыборСкладаРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьСписокСкладовДляПродажи();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаКонтрольПродажРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.КонтрольПродаж.Форма.ФормаСписка", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаВестиЖурналДействийКассираРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработатьНавигационнуюСсылкаЖурналДействийКассира();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаЗапускВРежимеКиоскРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтраницаКассиры = СписокРазделов.НайтиСтроки(Новый Структура("Имя", "СтраницаКассиры"));
	Если СтраницаКассиры.Количество() > 0 Тогда
	
		Элементы.СписокРазделов.ТекущаяСтрока = СтраницаКассиры[0].Порядок;
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницаКассиры;
		ПриСменеСтраницыНастроек();
		
		ТекущийЭлемент = Элементы.НастройкиРМКВестиЖурналДействийКассира;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКСрокХраненияОперацийСЧекомПриИзменении(Элемент)
	УстановитьТекстНадписиРегламентнойНастройки(Элементы.ОчисткаЖурналаДействийКассира,
		РасписаниеОчисткиЖурналаДействийКассира);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКВестиЖурналДействийКассираПриИзменении(Элемент)
	УстановитьДоступностьЖурналаДействийКассира();
КонецПроцедуры 

&НаКлиенте
Процедура НастройкиРМКОтправлятьSMSКодПриЗаведенииКартыПриИзменении(Элемент)
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНастройкиПриЗаведенииКарты, НастройкиРМК.ОтправлятьSMSКодПриЗаведенииКарты);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКНастроитьКассировДляВходаПриИзменении(Элемент)
	НастроитьЭлементыКассиров();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСерверЛояльностиПолучательДанныхПриИзменении(Элемент)
	ИспользоватьСерверЛояльностиПолучательДанныхПриИзмененииНаСервере();
	НастроитьИспользованиеСервераЛояльности();
	НастроитьИспользованиеПродавцов();
	НастроитьЭлементыSMSПодтверждения();
	НастроитьЭлементыВидовОплатСерверЛояльности();
КонецПроцедуры

&НаКлиенте
Процедура ПарольСервераЛояльностиПриИзменении(Элемент)
	ПарольСервераЛояльностиИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКРаботаВРежимеМедленногоСоединенияПриИзменении(Элемент)
	РаботаВРежимеМедленногоСоединенияПриИзмененииКлиент();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКИспользоватьОплатуПлатежнымиКартамиПриИзменении(Элемент)
	НастроитьЭлементыОсновныхВидовОплат();
	ПроверитьИОткрытьСписокТерминаловПриНеобходимости();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКИспользоватьОплатуНаличнымиПриИзменении(Элемент)
	НастроитьЭлементыОсновныхВидовОплат();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаКонтролироватьОстатокРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "КорректировкаНаличныхВККМ" Тогда
		ОбщегоНазначенияРМККлиент.ОткрытьИнтерфейсКорректировкиОстаткаНаличных();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКИспользоватьПанельВводаНаличныхКупюрПриИзменении(Элемент)
	ОбработатьИзменениеИспользованияПанелиВводаНаличныхНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКИспользоватьОплатуПлатежнымиСистемамиПриИзменении(Элемент)
	НастроитьЭлементыВидовОплатПлатежныеСистемы();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОплатаПлатежнымиСистемамиРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "НастройкаСБП" Тогда
		МодульСистемаБыстрыхПлатежейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СистемаБыстрыхПлатежейКлиент");
		МодульСистемаБыстрыхПлатежейКлиент.НастройкиПодключения(ЭтотОбъект);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "НастройкаЮКасса" Тогда
		МодульОнлайнОплатыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОнлайнОплатыКлиент");
		МодульОнлайнОплатыКлиент.НастройкаОнлайнОплат(ЭтотОбъект);
	Иначе
		ИнтеграцияСПлатежнымиСистемамиРМККлиентПереопределяемый.ОткрытьФормуНастройкиКассовогоQRКода(
			КассаПодключенияКодаСБП,
			Неопределено,
			Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОплатуСертификатамиНСПКПриИзменении(Элемент)
	ИспользоватьОплатуСертификатамиНСПКПриИзмененииСервер();
	НастроитьВидыОплатНСПК();
	
	Если НастройкиРМК.ИспользоватьОплатуСертификатамиНСПК Тогда
		
		ОповещениеМетода = Новый ОписаниеОповещения("НСПКВерсияВКЗавершение", ЭтотОбъект);
		ЭлектронныеСертификатыНСПККлиент.НачатьПолучениеВерсииВК(ОповещениеМетода);
		
	КонецЕсли;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АдресСервисаНСПКПриИзменении(Элемент)
	АдресСервисаНСПКПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонШтрихкодаТовараПриИзменении(Элемент)
	ШаблонШтрихкодаТовараПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ШаблонШтрихкодаТовараПриИзмененииНаСервере()
	
	ИмяКонстанты = ОбщегоНазначенияРМК.ИмяКонстанты("ШаблонШтрихкодаВесовыхТоваров");
	СохранитьЗначениеКонстанты(ИмяКонстанты, ШаблонШтрихкодаТовара);
	
КонецПроцедуры

&НаСервере
Процедура ПрефиксШтрихкодаВесовогоТовараПриИзмененииНаСервере()
	ИмяКонстанты = ОбщегоНазначенияРМК.ИмяКонстанты("ПрефиксШтрихкодаВесовогоТовара");
	СохранитьЗначениеКонстанты(ИмяКонстанты, ПрефиксШтрихкодаВесовогоТовара);
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксШтрихкодаВесовогоТовараПриИзменении(Элемент)
	ПрефиксШтрихкодаВесовогоТовараПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрефиксШтрихкодаШтучногоФасованногоТовараПриИзмененииНаСервере()
	ИмяКонстанты = ОбщегоНазначенияРМК.ИмяКонстанты("ПрефиксШтрихкодаФасованногоТовара");
	СохранитьЗначениеКонстанты(ИмяКонстанты, ПрефиксШтрихкодаШтучногоФасованногоТовара);
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксШтрихкодаШтучногоФасованногоТовараПриИзменении(Элемент)
	ПрефиксШтрихкодаШтучногоФасованногоТовараПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКИспользоватьЛокальныеШаблоныЧековПриИзменении(Элемент)
	УстановитьДоступностьШаблоновЧеков();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКШаблонЧекаПродажиПриИзменении(Элемент)
	НастроитьЭлементНеПечататьКодВозвратаСБП();
	НастроитьЭлементНеПечататьКодВозвратаНСПК();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКЗакрыватьПодборПриВыбореТовараПриИзменении(Элемент)
	УстановитьВидимостьФорматаКорзиныПлиточногоИнтерфейса();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательВариантаИнтерфейсаПриИзменении(Элемент)
	
	Если НеобходимоСохранитьВариантИнтерфейса Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросЗаписатьНастройкиВариантаИнтерфейса", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Записать настройки варианта интерфейса ?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьНастройкиВариантаИнтерфейса();
		УстановитьВидимостьНастроекВариантовИнтерфейса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаписатьНастройкиВариантаИнтерфейса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьВариантИнтерфейсаНаСервере();
	Иначе
		НеобходимоСохранитьВариантИнтерфейса = Ложь;
	КонецЕсли;
	
	ЗаполнитьНастройкиВариантаИнтерфейса();
	УстановитьВидимостьНастроекВариантовИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантИнтерфейсаПриИзменении(Элемент)
	
	НеобходимоСохранитьВариантИнтерфейса = Истина;
	УстановитьВидимостьНастроекВариантовИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантМасштабаИнтерфейса85ПриИзменении(Элемент)
	
	НеобходимоСохранитьВариантИнтерфейса = Истина;
	
	Если ВариантМасштабаИнтерфейса85 = "Обычный" Тогда
		НастройкиРМК.УвеличенныйВариантМасштаба = Истина;
	Иначе
		НастройкиРМК.УвеличенныйВариантМасштаба = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантТемыИнтерфейса85ПриИзменении(Элемент)
	
	НеобходимоСохранитьВариантИнтерфейса = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРасширеннуюФормуПодбораПриИзменении(Элемент)
	НастройкиРМК.ИспользоватьНовыйПодборТоваров = НЕ ИспользоватьРасширеннуюФормуПодбора;
	НастроитьЭлементыПодбораТоваров();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКСтруктураПлиточногоИнтерфейсаПодбораПриИзменении(Элемент)
	
	НастройкиРМК.СтруктураПлиточногоИнтерфейсаПодбора = СтруктураПлиточногоИнтерфейсаПодбора;
	ПостроитьПредпросмотрПлиточногоИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКСтруктураПлиточногоИнтерфейсаПодбораНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораПалитры();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКСтруктураПлиточногоИнтерфейсаПодбораОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуПалитры();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКСтруктураПлиточногоИнтерфейсаПодбораСоздание(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(СтруктураПлиточногоИнтерфейсаПодбора) Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуПалитры();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКСтруктураБыстрыхТоваровПриИзменении(Элемент)
	
	ПостроитьПредпросмотрПлиточногоИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКСтруктураБыстрыхТоваровНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораПалитры(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКСтруктураБыстрыхТоваровОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФормуПалитры(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКСтруктураБыстрыхТоваровСоздание(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(НастройкиРМК.СтруктураБыстрыхТоваров) Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуПалитры(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКРабочееМестоПриИзменении(Элемент)
	АктуализироватьЭлементыФормы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксИнформационнойБазыПриИзменении(Элемент)
	
	ФоновоеЗадание = ЗапуститьИзменениеПрефиксаИБВФоновомЗадании();
	
	Если ФоновоеЗадание <> Неопределено
		И ФоновоеЗадание.Статус = "Выполняется" Тогда
		
		УстановитьДоступностьЭлементаФормы(Элементы.ПрефиксИнформационнойБазы, Ложь);
		УстановитьВидимостьЭлементаФормы(Элементы.ДекорацияОжиданиеИзмененияПрефикса, Истина);
		
	КонецЕсли;
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	
	Обработчик = Новый ОписаниеОповещения("ПослеИзмененияПрефикса", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(ВведеннаяСтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	ВосстановитьИсходнуюВидимостьНастроек();
	ВыполнитьПоискНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискНастройкиНаСервере()
	
	Результат = Новый Соответствие;
	
	Для Каждого СтрокаСловаря Из СловарьПоиска Цикл
		ПроцентСхожести = ПроцентСхожестиСтрок(
			ПолучитьНГраммыСтроки(ВведеннаяСтрокаПоиска),
			ПолучитьНГраммыСтроки(СтрокаСловаря.СтрокаПоиска));
		
		СловоПохожее = ПроцентСхожести >= 52;
		
		Если СловоПохожее Тогда
			Результат.Вставить(СтрокаСловаря.ИмяЭлемента);
		КонецЕсли;
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не найдено настроек, удовлетворяющих заданному поиску'"));
		Возврат;
	КонецЕсли;
	
	СкрытьВсеЭлементыСтраницНастроек();
	СтраницыСНастройками = ПоказатьНайденныеПоискомЭлементы(Результат);
	УстановитьВидимостьРазделовРекурсивно();
	

КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка)
	ВосстановитьИсходнуюВидимостьНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьСкидкуПроцентомПриИзменении(Элемент)
	Если ОтображатьСкидкуПроцентом Тогда
		НастройкиРМК.РежимОтображенияСкидки = 1;
	Иначе
		НастройкиРМК.РежимОтображенияСкидки = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКНаименованиеПриИзменении(Элемент)
	ЗаполнитьЗаголовокФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВестиСведенияДляДекларацийПоАлкогольнойПродукцииПриИзменении(Элемент)
	АктуализироватьДоступностьКонтроляИспользованияКалендарныхЗапретовПродаж(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПереключательСтраницПриИзменении(Элемент)
	ПереключательПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаКартыГоризонтальнаяРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЭквайринговыеТерминалы" Тогда
		СтруктураПараметров = Новый Структура;
		ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуНастройкиЭквайринга(СтруктураПараметров, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКОчиститьАрхивныеЧекиПриИзменении(Элемент)
	УстановитьДоступностьОчисткиАрхивныхЧеков();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКСрокХраненияАрхивныхЧековПриИзменении(Элемент)
	УстановитьТекстНадписиРегламентнойНастройки(Элементы.ОчисткаЖурналаДействийКассира,
		РасписаниеОчисткиЖурналаДействийКассира);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКСпособПечатиЗаказаПокупателяПриИзменении(Элемент)
	УстановитьНастройкиПечатиЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОжидатьПроверкуМарокРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если НавигационнаяСсылкаФорматированнойСтроки = "Настройки маркировки" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Обработка.ПанельАдминистрированияИСМП.Форма.НастройкиИСМП");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьQRОплатыКартойПриИзменении(Элемент)
	НастройкиРМК.СкрыватьQRОплатыКартой = Не ПоказыватьQRОплатыКартой;
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьQRОплатыНаличнымиПриИзменении(Элемент)
	НастройкиРМК.СкрыватьQRОплатыНаличными = Не ПоказыватьQRОплатыНаличными;
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьQRОплатыСБППриИзменении(Элемент)
	НастройкиРМК.СкрыватьQRСБП = Не ПоказыватьQRОплатыСБП;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрГорячиеКлавишиПриИзменении(Элемент)
	УстановитьФильтрГорячихКлавиш();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКОтправлятьSMSКодПриПродажеПриИзменении(Элемент)
	НастроитьЭлементыSMSПодтверждения();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПлиткаНазад(Элемент, СтандартнаяОбработка)
	
	ПереключитьСтраницуПлитки(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПлиткаВперед(Элемент, СтандартнаяОбработка)
	
	ПереключитьСтраницуПлитки(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПодтверждениеВозрастаЧерезMAXПриИзменении(Элемент)
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаПоказыватьНаДисплеиПокупателяQRMAX,
		НастройкиРМК.ИспользоватьПодтверждениеВозрастаЧерезMAX);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКИзображениеПриНачалеПродажиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьИзображениеДляНачалаПродаж();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКИзображениеПриНачалеПродажиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОчиститьИзображениеНачалаПродаж();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКИзображениеПриНачалеПродажиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Ожидание = 0 И Не ЗначениеЗаполнено(НастройкиРМК.ИзображениеПриНачалеПродажи) Тогда
		ВыбратьИзображениеДляНачалаПродаж();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКИзображениеПриНачалеПродажиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьИзображениеНачалаПродаж();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаУказыватьПричинуВозвратаРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПричиныВозврата" Тогда
		ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуПричиныВозврата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКУказыватьПричинуВозвратаПриИзменении(Элемент)
	НастройкиРМКУказыватьПричинуВозвратаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеСкидкиПенсионерамПриИзменении(Элемент)
	
	Модифицированность = Истина;
	СкидкиПенсионерам = НастройкиРМК.СкидкиНаценки.НайтиСтроки(
		Новый Структура("Наименование", "СкидкаПенсионера"));
	
	Если ЗначениеСкидкиПенсионерам <> 0 И СкидкиПенсионерам.Количество() = 1 Тогда
		СкидкиПенсионерам[0].ЗначениеСкидкиНаценки = ЗначениеСкидкиПенсионерам;
	Иначе
		Для каждого СкидкаПенсионера Из СкидкиПенсионерам Цикл
			НастройкиРМК.СкидкиНаценки.Удалить(СкидкаПенсионера);
		КонецЦикла;
		Если ЗначениеСкидкиПенсионерам <> 0 Тогда
			НоваяСкидкаНаценка = НастройкиРМК.СкидкиНаценки.Добавить();
			НоваяСкидкаНаценка.Наименование = "СкидкаПенсионера";
			НоваяСкидкаНаценка.ЗначениеСкидкиНаценки = ЗначениеСкидкиПенсионерам;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКИспользоватьПодтверждениеСтатусовПокупателяЧерезMAXПриИзменении(Элемент)
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаПоказыватьНаДисплеиПокупателяQRMAXСтатусовПокупателя,
		НастройкиРМК.ИспользоватьПодтверждениеСтатусовПокупателяЧерезMAX);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СохранитьНастройкиРМК(Команда)
	СохранитьНастройкиРМКНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеОчисткиЖурналаДействийКассиров(Команда)
	
	НастроитьРасписаниеОчистки(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиОтправкиСМС(Команда)
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуНастройкиСМС(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьПоШаблону(Команда)
	
	УстановитьСценарийНачало(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ТекстСообщенияПользователю = НСтр("ru = ''");
	
	Если НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		
		ИсходныеДанные = НастройкиРМК;
		ПараметрыПроверкиПодключения = ИсходныеДанныеДляПроверкиДоступностиСервераЛояльности(ИсходныеДанные);
		АдресСервера = ПараметрыПроверкиПодключения.АдресСервера;
		
		Если НЕ ЗначениеЗаполнено(АдресСервера) Тогда
			
			СтрокаСообщения = НСтр("ru = 'Не заполнен адрес сервера лояльности.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения,, "НастройкаРМК.АдресСервераЛояльности");
			Возврат;
			
		КонецЕсли;
		
		ПараметрыВыполненияЗапроса = СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыЗапросаПроверитьПодключениеКСерверуЛояльности(ПараметрыПроверкиПодключения);
		РезультатПроверки = СерверЛояльностиПолучательДанныхКлиентСервер.ВыполнитьЗапросКСерверуЛояльности(ПараметрыВыполненияЗапроса);
		ТекстСообщенияПользователю = НСтр("ru = 'Соединение с сервером успешно установлено.'");
		
		Если РезультатПроверки.ЕстьОшибки Тогда
			
			ТекстСообщенияПользователю = РезультатПроверки.ТекстОшибки;
			
		Иначе
			
			ДанныеОтвета = Неопределено;
			СтрокаJSON = РезультатПроверки.ДанныеОтвета;
			СерверЛояльностиПолучательДанныхКлиентСервер.ОбработатьJSON(СтрокаJSON, ДанныеОтвета);
			Если ДанныеОтвета <> Неопределено
				И ТипЗнч(ДанныеОтвета) = Тип("Структура") Тогда
				Если ДанныеОтвета.Error Тогда
					ТекстСообщенияПользователю = ДанныеОтвета.ErrorMessage;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
			
	Иначе
		
		ТекстСообщенияПользователю =
			НСтр("ru = 'Пожалуйста, включите использование сервера лояльности перед проверкой подключения к серверу.'");
			
	КонецЕсли;
		
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияПользователю);
КонецПроцедуры

&НаКлиенте
Процедура АнализШтрихкодов(Команда)
	ОткрытьФорму("ОбщаяФорма.АнализШтрихкодов");
КонецПроцедуры

&НаКлиенте
Процедура ПомощникНастройкиОбмена(Команда)
	ИмяПланаОбмена = "ОбменСУРМК";
	ИдентификаторНастройки = "";
	
	Если Команда.Имя = "ПомощникНастройкиОбмена" Тогда
		ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьПомощникНастройкиОбмена();
		Возврат;
	ИначеЕсли Команда.Имя = "ПомощникНастройкиОбменаУП" Тогда
		ИдентификаторНастройки = "ОбменУП";
	ИначеЕсли Команда.Имя = "ПомощникНастройкиОбменаКА" Тогда
		ИдентификаторНастройки = "ОбменКА";
	ИначеЕсли Команда.Имя = "ПомощникНастройкиОбменаУТ" Тогда
		ИдентификаторНастройки = "ОбменУТ";
	ИначеЕсли Команда.Имя = "ПомощникНастройкиОбменаЭРГО" Тогда
		ИдентификаторНастройки = "ОбменМаркировка";
	КонецЕсли;
	
	ОписаниеВариантаНастройки = ОписаниеВариантаНастройки(ИмяПланаОбмена, ИдентификаторНастройки);
	
	ПараметрыПомощника = Новый Структура;
	ПараметрыПомощника.Вставить("ИмяПланаОбмена",                     ИмяПланаОбмена);
	ПараметрыПомощника.Вставить("ИдентификаторНастройки",             ИдентификаторНастройки);
	ПараметрыПомощника.Вставить("ОписаниеВариантаНастройки",          ОписаниеВариантаНастройки);
	ПараметрыПомощника.Вставить("ОбменДаннымиСВнешнейСистемой",       Ложь);
	ПараметрыПомощника.Вставить("ПараметрыПодключенияВнешнейСистемы", Неопределено);
	ПараметрыПомощника.Вставить("НастройкаНовойСинхронизации");

	КлючУникальностиПомощника = ПараметрыПомощника.ИмяПланаОбмена + "_" + ПараметрыПомощника.ИдентификаторНастройки;
		
	ОткрытьФорму("Обработка.ПомощникСозданияОбменаДанными.Форма.НастройкаСинхронизации", ПараметрыПомощника, , КлючУникальностиПомощника);

КонецПроцедуры

&НаКлиенте
Процедура НастройкиСинхронизацииДанных(Команда)
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		
		МодульОбменДаннымиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменДаннымиКлиент");
		МодульОбменДаннымиКлиент.ОткрытьНастройкиСинхронизацииДанных();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРезервноеКопирование(Команда)
	ОткрытьФорму(
		"Обработка.ПанельАдминистрированияБСП.Форма.Обслуживание",
		Новый Структура("Раздел", "РезервноеКопированиеИВосстановление"),
		ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройкиСвойствЭлементов(Команда)
	СброситьНастройкиСвойствЭлементовКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьНовоеОборудование(Команда)
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуСозданияПодключаемогоОборудования();
КонецПроцедуры

&НаКлиенте
Процедура ДрайверыОборудования(Команда)
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуСпискаДрайверовПодключаемогоОборудования();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНастройкиВФайл(Команда)
	Если НастройкиРМК.Ссылка.Пустая() Тогда
		
		ПоказатьПредупреждение(, НСтр("ru='Сначала сохраните настройку.'"));
		Возврат;
		
	КонецЕсли;
	
	ВыбратьФайлНаКлиенте(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	ВыбратьФайлНаКлиенте(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПалитруПлиткиВФайл(Команда)
	ВыгрузитьПалитры(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПалитруИзбранныхВФайл(Команда)
	ВыгрузитьПалитры(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПалитруИзбранныхИПлиткиВФайл(Команда)
	ВыгрузитьПалитры(Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКонтрольПродаж(Команда)
	ВыбратьФайлНаКлиенте(Ложь, , Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКНастройке(Команда)
	Элементы.СтраницыФормыНастроек.ТекущаяСтраница = Элементы.СтраницаОсновная;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСлужебныеРеквизиты(Команда)
	Элементы.СтраницыФормыНастроек.ТекущаяСтраница = Элементы.СтраницаСистемныеРеквизиты;
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьНастройкиОбластей(Команда)
	
	Если Модифицированность Или НастройкиРМК.Ссылка.Пустая() Тогда
		ВозможныеДействия = ДействияПослеСохраненияНастроек();
		ДополнительныеПараметры = Новый Структура("ИмяДействия", ВозможныеДействия.ОткрытьНастройкиОбластей);
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветСохраненияНастроек", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru = 'Перед открытием формы редактирования настроек областей настройки будут сохранены.
			|Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОткрытьНастройкиОбластей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомбинацииГорячихКлавиш(Команда)
	ТабличныйДокумент = СформироватьТабличныйДокументГорячихКлавиш();
	ТабличныйДокумент.Показать(НСтр("ru='Комбинации горячих клавиш'"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКассираДляВхода(Команда)
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуСозданияКодаДоступа(Новый Структура,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаНачальнуюСтраницу(Команда)
	ПерейтиНаСтраницуДомой();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеУдаленияАрхивныхЧеков(Команда)
	НастроитьРасписаниеОчистки(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключения(Команда)
	НастроитьОборудование();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьАрхивныеЧеки(Команда)
	ОбработатьОчисткуАрхивныхЧеков();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЖурналДействияКассира(Команда)
	ОчиститьЖурналДействийКассираКлиент();
КонецПроцедуры

#КонецОбласти

#Область НастройкиВариантаИнтерфейса

&НаСервере
Процедура ПодготовитьНастройкиВариантаИнтерфейса()
	
	Элементы.НастройкиВариантаИнтерфейса.Видимость = Истина;
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	Элементы.ПользовательВариантаИнтерфейса.Видимость = ЭтоПолноправныйПользователь;
	
	Если НЕ ЭтоПолноправныйПользователь Тогда
		Элементы.ЗаписатьВариантИнтерфейсаПользователя.Заголовок = НСтр("ru='Записать'");
		Элементы.ЗаписатьВариантИнтерфейсаПользователя.РасширеннаяПодсказка.Заголовок = 
			НСтр("ru='Выбранные настройки применятся после перезапуска приложения.'");
	КонецЕсли;
		
	Элементы.ВариантИнтерфейса.СписокВыбора.Добавить("Такси", НСтр("ru = 'Интерфейс ""Такси""'"));
	Элементы.ВариантИнтерфейса.СписокВыбора.Добавить("Версия8_5", НСтр(
		"ru = 'Интерфейс ""Версия 8.5""'"));
	
	Элементы.ВариантМасштабаИнтерфейса85.СписокВыбора.Добавить("Обычный", НСтр("ru = 'Обычный'"));
	Элементы.ВариантМасштабаИнтерфейса85.СписокВыбора.Добавить("Компактный", НСтр("ru = 'Компактный'"));
	
	Элементы.ВариантТемыИнтерфейса85.СписокВыбора.Добавить("Светлая", НСтр("ru = 'Светлая'"));
	Элементы.ВариантТемыИнтерфейса85.СписокВыбора.Добавить("Темная", НСтр("ru = 'Темная'"));
	
	ЗаполнитьНастройкиВариантаИнтерфейса();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиВариантаИнтерфейса()
	
	ИмяПользователя = Неопределено;
	Если ЗначениеЗаполнено(ПользовательВариантаИнтерфейса) Тогда
		ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПользовательВариантаИнтерфейса, "ИдентификаторПользователяИБ");
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		ИмяПользователя = ПользовательИБ.Имя;
	КонецЕсли;
	
	НастройкиКлиентскогоПриложения = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(
		"Общее/НастройкиКлиентскогоПриложения", "",,, ИмяПользователя);
	
	Если НЕ НастройкиКлиентскогоПриложения = Неопределено Тогда
		Если НастройкиКлиентскогоПриложения.ВариантИнтерфейсаКлиентскогоПриложения
			= ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
			ВариантИнтерфейса = "Такси";
		Иначе
			ВариантИнтерфейса = "Версия8_5";
		КонецЕсли;
		
		Если НастройкиРМК.УвеличенныйВариантМасштаба Тогда
			ВариантМасштабаИнтерфейса85 = "Обычный";
		Иначе
			ВариантМасштабаИнтерфейса85 = "Компактный";
		КонецЕсли;
		
		Если НастройкиКлиентскогоПриложения.ТемаКлиентскогоПриложения
			= ТемаКлиентскогоПриложения.Темная Тогда
			ВариантТемыИнтерфейса85 = "Темная";
		Иначе
			ВариантТемыИнтерфейса85 = "Светлая";
		КонецЕсли;
	Иначе
		НеобходимоСохранитьВариантИнтерфейса = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНастроекВариантовИнтерфейса()
	
	Если ВариантИнтерфейса = "Такси" Тогда
		Элементы.НастройкиВариантаИнтерфейса83.Видимость = Истина;
		Элементы.НастройкиВариантаИнтерфейса85.Видимость = Ложь;
	Иначе
		Элементы.НастройкиВариантаИнтерфейса83.Видимость = Ложь;
		Элементы.НастройкиВариантаИнтерфейса85.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура РезультатЗакрытияФормыНастройкиСМС(Результат, ДополнительныеПараметры) Экспорт
	ДоступностьГруппыСМС = Истина;
	РезультатЗакрытияФормыНастройкиСМССервер(ДоступностьГруппыСМС);
	НастроитьЭлементыГруппыСМС(ДоступностьГруппыСМС);
КонецПроцедуры

&НаКлиенте
Процедура ВопросСбросНастроекСвойствЭлементовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		НастройкиЭлементовФормыРМК.Очистить();
		УбратьИзмененныеСостоянияНастроек(ДеревоГорячиеКлавиши.ПолучитьЭлементы());
		ДанныеДляОтображенияЭлементов.СброситьНастройкиСвойствЭлементов_Доступность = Ложь;
		
		ОбновляемыеЭлементы = Новый Массив;
		ОбновляемыеЭлементы.Добавить(Элементы.СброситьНастройкиСвойствЭлементов);
		ОбновитьОтображениеФормыНастроек(ЭтотОбъект, ОбновляемыеЭлементы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиРМКИЗакрыть(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("НастройкаЗаписана", Ложь);
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Результат = СохранитьНастройкиРМКНаСервере();
		ИзмененияСохранены = Результат.ВыполненоУспешно;
		
		Если НЕ ИзмененияСохранены Тогда
			
			ПоказатьПредупреждение(, Результат.ТекстПредупрежденийОшибок,,
				НСтр("ru = 'Ошибка сохранения настроек РМК'"));
			
		КонецЕсли;
		
		ПараметрыОповещения.НастройкаЗаписана = ИзмененияСохранены;
		
	Иначе
		ЗакрыватьФормуБезКонтроляИзмененийНастроек = Истина;
	КонецЕсли;
	
	Оповестить("СохранениеНастроекРМК", ПараметрыОповещения);
	Модифицированность = Ложь;
	
	Если Открыта()
		И Элементы.СтраницыФормыНастроек.ТекущаяСтраница = Элементы.СтраницаОсновная Тогда
		Закрыть();
	Иначе
		АктуализироватьЭлементыФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСходСоСтрокиКупюрыЗавершение(ТекущаяСтрокаКупюры) Экспорт
	
	Элементы.НастройкиРМКВводНаличных.ТекущаяСтрока = ТекущаяСтрокаКупюры;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСходСоСтрокиГорячейКлавишиЗавершение(ТекущаяСтрокаГорячейКлавиши) Экспорт
	
	Элементы.ДеревоГорячиеКлавиши.ТекущаяСтрока = ТекущаяСтрокаГорячейКлавиши;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеНастроекЭлементаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПараметрыОбновления = Новый Структура();
		ПараметрыОбновления.Вставить("ВключитьКнопкуСброса", Ложь);
		ПараметрыОбновления.Вставить("СостояниеНастроек", ВозможныеСостоянияНастроек.НастройкиПоУмолчанию);
		ПараметрыОбновления.Вставить("ИмяЭлемента", Результат.ИмяЭлемента);
		ОтборСтрокНастроек = Новый Структура();
		ОтборСтрокНастроек.Вставить("ИмяЭлемента", Результат.ИмяЭлемента);
		СтрокиНастроекЭлементов = НастройкиЭлементовФормыРМК.НайтиСтроки(ОтборСтрокНастроек);
		Для Каждого ДанныеНастройки Из Результат.Настройки Цикл
			ОбновитьНастройкуЭлементаФормы(СтрокиНастроекЭлементов, ДанныеНастройки, ПараметрыОбновления);
		КонецЦикла;
		
		СтрокаКлавишиДерева = ДеревоГорячиеКлавиши.НайтиПоИдентификатору(ДополнительныеПараметры);
		СтрокаКлавишиДерева.СостояниеНастроек = ПараметрыОбновления.СостояниеНастроек;
		
		АктуализироватьДоступностьКнопкиСбросаНастроекЭлементов(ПараметрыОбновления.ВключитьКнопкуСброса);
		ОбновляемыеЭлементы = Новый Массив;
		ОбновляемыеЭлементы.Добавить(Элементы.СброситьНастройкиСвойствЭлементов);
		ОбновитьОтображениеФормыНастроек(ЭтотОбъект, ОбновляемыеЭлементы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДатаИзУниверсальнойДаты(Знач Значение, Делитель = 1000, ПриводитьКМестномуВремени = Истина) Экспорт
	
	Значение = '00010101' + Цел(Значение / Делитель);
	
	Если ПриводитьКМестномуВремени Тогда
		Возврат МестноеВремя(Значение);
	Иначе
		Возврат Значение;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыборПродолжительностьЛогаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Продолжительность = ВыбранныйЭлемент.Значение;
	Если ДополнительныеПараметры.РежимПродления
		И ЗначениеЗаполнено(ПараметрыЛогирования.ОкончаниеЗаписи) Тогда
		ДатаОкончания = ДатаИзУниверсальнойДаты(ПараметрыЛогирования.ОкончаниеЗаписи);
		Если ДатаОкончания > ТекущаяДата() Тогда
			Продолжительность = Цел((КонецМинуты(ДатаОкончания) - КонецМинуты(ТекущаяДата())) / 60 + Продолжительность);
		КонецЕсли;
	КонецЕсли;
	
	ВключитьЛогированиеЗапросов(Продолжительность);
	ОбновитьПредставлениеЛогирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОповещенияВопросОчиститьЛогЗапросовЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьЛогЗапросов();
	ОбновитьПредставлениеЛогирования();
	
	ПоказатьОповещениеПользователя(НСтр("ru='Лог запросов очищен.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасписаниеОчисткиОпераций(РасписаниеЗадания, Контекст) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[Контекст.ИмяРеквизита] = РасписаниеЗадания;
	ИмяРеквизитаМодификации = СтрШаблон("%1Изменено", Контекст.ИмяРеквизита);
	ЭтаФорма[ИмяРеквизитаМодификации] = Истина;
	ЭлементЗадания = Элементы[Контекст.ИмяЗадания];
	УстановитьТекстНадписиРегламентнойНастройки(ЭлементЗадания, РасписаниеЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСценарийЗавершение(Результат, ВыбранныйСценарий) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановитьСценарийИспользования(ВыбранныйСценарий);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранФайл(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
	Если ДополнительныеПараметры.Свойство("ДляЗагрузки") И ДополнительныеПараметры.ДляЗагрузки Тогда
		
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЧтениеФайлаНастроекЗавершение", ЭтотОбъект);
		
		ФайлXML = Новый ТекстовыйДокумент;
		ФайлXML.НачатьЧтение(ОписаниеОповещения, ПутьКФайлу);
		
	Иначе
		
		РезультатВыполнения = СохранитьНастройкиРМКНаСервере();
		Если НЕ РезультатВыполнения.ВыполненоУспешно Тогда
			ПоказатьПредупреждение(, РезультатВыполнения.ТекстПредупрежденийОшибок);
		Иначе
		
			ТекстXML = НастройкиВФорматеXML(ДополнительныеПараметры);
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписьФайлаНастроекЗавершение", ЭтотОбъект);
		
			ФайлXML = Новый ТекстовыйДокумент;
			ФайлXML.УстановитьТекст(ТекстXML);
			ФайлXML.НачатьЗапись(ОписаниеОповещения, ПутьКФайлу);
		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеФайлаНастроекЗавершение(Результат) Экспорт
	
	ПредыдущийСценарий = НастройкиРМК.СценарийИспользования;
	
	ЕстьОшибки = Ложь;
	ТекстXML = ФайлXML.ПолучитьТекст();
	ТекстОписанияОшибки = "";
	ЗагрузитьНастройкиИзXML(ТекстXML, ЕстьОшибки, ТекстОписанияОшибки);
	
	Если ЕстьОшибки Тогда
		
		Если ПустаяСтрока(ТекстОписанияОшибки) Тогда
			ТекстОписанияОшибки= НСтр("ru='При загрузке настроек произошли ошибки.
				|Подробнее см. в журнале регистрации.'");
		Иначе
			ТекстОписанияОшибки = СтрШаблон(НСтр("ru='%1
				|Подробнее см. в журнале регистрации.'"),
				ТекстОписанияОшибки);
		КонецЕсли;
		ПоказатьПредупреждение(, ТекстОписанияОшибки);
		
	Иначе
		
		СтруктураВлияющихНастроек = ШаблонВлияющихНастроек();
		
		ПоказатьПредупреждение(, НСтр("ru='Настройки успешно загружены.'"));
		НастроитьЭлементыФормыПослеЗагрузкиИзXMLНаСервере(ПредыдущийСценарий, СтруктураВлияющихНастроек);
		НастроитьДоступностьЭлементовВводаНаличных();
		УстановитьДоступностьЭлементовФормы();
		НастроитьЗначениеЭлементаЗакрытьПодбор(НастройкиРМК);
		ОбновитьОтображениеФормыНастроек(ЭтотОбъект);
		ЗапомнитьРеквизитыПалитры();
		ОбновитьИнтерфейс();
		ПостроитьПредпросмотрПлиточногоИнтерфейсаКлиент(СтруктураВлияющихНастроек);
		
	КонецЕсли;
	
	ФайлXML = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьФайлаНастроекЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПоказатьПредупреждение(, НСтр("ru='Настройки успешно выгружены.'"));
	
	ФайлXML = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура НСПКВерсияВКЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт 
	
	Если Не ТипЗнч(РезультатВыполнения) = Тип("Строка") Тогда
		ЭлектронныеСертификатыНСПККлиент.УстановитьКомпонентуИнтеграцииНСПК();
		
		ВерсияКомпонентыНСПК = РезультатВыполнения.Версия;
		ЗаголовокНСПК = НСтр("ru='Оплата электронным сертификатом, записанным на платежную карту МИР.'");
		Элементы.ГруппаОплатаНСПК.РасширеннаяПодсказка.Заголовок = ЗаголовокНСПК + Символы.ПС + СтрШаблон(
			НСтр("ru = 'Настройки подключения к сервису НСПК (v. %1)'"), ВерсияКомпонентыНСПК);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуПользователей(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	Элементы.КассирыДляВхода.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеРаспределения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		НастройкиРМК.РаспределениеНоменклатуры.Очистить();
		УстановитьВидимостьГруппКатегорий();
	Иначе
		НастройкиРМК.ГруппыКатегории = Число(Не Булево(НастройкиРМК.ГруппыКатегории));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНастройкиСкладов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КопироватьДанныеФормы(Результат, НастройкиРМК);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкиФормы

&НаСервере
Процедура ЗаполнитьСписокРазделов()
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаСинхронизацияРезервноеКопирование";
	НоваяСтрока.Представление = НСтр("ru = 'Синхронизация и копирование'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.ЗаменаТоваров;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 0;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаПодключаемоеОборудование";
	НоваяСтрока.Представление = НСтр("ru = 'Подключаемое оборудование'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.РМКУстройствоРаспознавания;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 1;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаВидыОплат";
	НоваяСтрока.Представление = НСтр("ru = 'Виды оплат'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.РМКОткрытьДенежныйЯщик;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 2;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаНастройкиПлатежнымиСистемами";
	НоваяСтрока.Представление = НСтр("ru = 'Платежные системы'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.ВыборЭквайринговогоТерминала;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 3;
		
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаПродажи";
	НоваяСтрока.Представление = НСтр("ru = 'Продажи'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.ПечатьТоварногоЧека;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 4;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаСкупка";
	НоваяСтрока.Представление = НСтр("ru = 'Скупка'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.Buy;
	НоваяСтрока.Видимость = Ложь;
	НоваяСтрока.Порядок = 5;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаМаркировкаИАлкоголь";
	НоваяСтрока.Представление = НСтр("ru = 'Маркировка и алкоголь'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.ScanMark;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 6;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаФормированиеЧека";
	НоваяСтрока.Представление = НСтр("ru = 'Формирование чека'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.РМКШаблонЧека;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 7;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаКассиры";
	НоваяСтрока.Представление = НСтр("ru = 'Кассиры и продавцы'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.СменитьКассира;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 8;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаЗаказы";
	НоваяСтрока.Представление = НСтр("ru = 'Заказы'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.ПродажаПоЗаказу;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 9;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаПредоплатаИРассрочка";
	НоваяСтрока.Представление = НСтр("ru = 'Предоплата и рассрочка'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.ОплатаРассрочки;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 10;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаСерверЛояльности";
	НоваяСтрока.Представление = НСтр("ru = 'Сервер лояльности'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.Настройка;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 11;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СкидкиИОкругления";
	НоваяСтрока.Представление = НСтр("ru = 'Маркетинговые акции'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.SaleBlack;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 12;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаКартыЛояльности";
	НоваяСтрока.Представление = НСтр("ru = 'Карты лояльности'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.РМКВидКарты;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 13;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаИнтерфейс";
	НоваяСтрока.Представление = НСтр("ru = 'Интерфейс'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.НастройкиОтчета;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 14;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаГорячиеКлавиши";
	НоваяСтрока.Представление = НСтр("ru = 'Горячие клавиши'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.РМКГорячаяКлавишаБезналичные;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 15;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаБыстрыеТовары";
	НоваяСтрока.Представление = НСтр("ru = 'Быстрые товары и палитра'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.ИзбранныеТоварыРМК;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 16;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаОкноПриложения";
	НоваяСтрока.Представление = НСтр("ru = 'Окно приложения'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.РМКОтчетЗаСмену;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 17;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаНастройкиПечати";
	НоваяСтрока.Представление = НСтр("ru = 'Настройка печати'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.РМКРедактироватьМакет;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 18;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаРеквизитыЧека";
	НоваяСтрока.Представление = НСтр("ru = 'Реквизиты чека'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.РМКПроверитьЧек16;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 19;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаШаблоныШтрихкодов";
	НоваяСтрока.Представление = НСтр("ru = 'Шаблоны штрихкодов'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.РМКСозданиеШтрихкода;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 20;
	
	НоваяСтрока = СписокРазделов.Добавить();
	НоваяСтрока.Имя = "СтраницаРаспределениеПродаж";
	НоваяСтрока.Представление = НСтр("ru = 'Распределение продаж'");
	НоваяСтрока.Картинка = БиблиотекаКартинок.ПодборТоваровРМК;
	НоваяСтрока.Видимость = Истина;
	НоваяСтрока.Порядок = 21;
	
	СписокРазделов.Сортировать("Порядок Возр");
	
	ОбщегоНазначенияРМКПереопределяемый.ИзменитьСписокРазделов(СписокРазделов);
	
	Для Каждого ОписаниеРаздела Из СписокРазделов Цикл
		ОписаниеРаздела.КэшВидимости = ОписаниеРаздела.Видимость;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура АктуализироватьЭлементыФормы(ПерезаполнитьНастройки = Истина)
	Если ПерезаполнитьНастройки Тогда
		ЗаполнитьНастройкуРабочегоМестаКассира();
	КонецЕсли;
	ИнициализироватьПеременные();
	НастроитьЭлементыФормы();
	ОбновитьРеквизитыПоКонстантам();
	ОбновитьОписаниеОкнаПриложения();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкуРабочегоМестаКассира()
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "НоваяНастройка") Тогда
		НоваяНастройка = Параметры.НоваяНастройка;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "РабочееМестоКассира") Тогда
		РабочееМестоКассира = Параметры.РабочееМестоКассира;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "ПомощникНастройкиРабочегоМеста") Тогда
		ПомощникНастройкиРабочегоМеста = Параметры.ПомощникНастройкиРабочегоМеста;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "НастройкиИзменены") Тогда
		Модифицированность = Параметры.НастройкиИзменены;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "ПарольСервераЛояльностиИзменен") Тогда
		ПарольСервераЛояльностиИзменен = Параметры.ПарольСервераЛояльностиИзменен;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "НомерСтраницы") Тогда
		ПереключательСтраниц = Параметры.НомерСтраницы;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "ПарольСерверЛояльности") Тогда
		ПарольСерверЛояльности = Параметры.ПарольСерверЛояльности;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "СписокПереключателей") Тогда
		Для Каждого СтрокаМассива Из Параметры.СписокПереключателей Цикл
			Элементы.ПереключательСтраниц.СписокВыбора.Добавить(СтрокаМассива.НомерСтраницы, СтрокаМассива.Представление);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущееРабочееМесто) Тогда
		ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.НастройкаРабочегоМеста) Тогда
		
		Если НоваяНастройка Тогда
			НастройкиОбъект = Параметры.НастройкаРабочегоМеста.Скопировать();
		Иначе
			ЗаблокироватьДанныеДляРедактирования(Параметры.НастройкаРабочегоМеста, Параметры.НастройкаРабочегоМеста.ВерсияДанных,
				УникальныйИдентификатор);
			НастройкиОбъект = Параметры.НастройкаРабочегоМеста.ПолучитьОбъект();
		КонецЕсли;
		ЗначениеВРеквизитФормы(НастройкиОбъект, "НастройкиРМК");
		ТекущееРабочееМесто =  НастройкиРМК.РабочееМесто;
		
	ИначеЕсли ПомощникНастройкиРабочегоМеста
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "НастройкаРМК") Тогда
		
		КопироватьДанныеФормы(Параметры.НастройкаРМК,НастройкиРМК);
		
	ИначеЕсли НоваяНастройка Тогда
		
		НастройкиРМК.РабочееМесто = ТекущееРабочееМесто;
		НастройкиРМК.ВидОтображения = Перечисления.ВидыОтображения.Стандартный;
		НастройкиРМК.ИспользоватьНовыйПодборТоваров = Истина;
		
	Иначе
		
		ДоступныеНастройкиРМК = ОбщегоНазначенияРМК.НастройкиРМКДляТекущегоРабочегоМеста(ТекущееРабочееМесто);
		КоличествоДоступныхНастроек = ДоступныеНастройкиРМК.Количество();
		
		Если КоличествоДоступныхНастроек = 1
			И ЗначениеЗаполнено(ДоступныеНастройкиРМК[0]) Тогда
			ЗаблокироватьДанныеДляРедактирования(ДоступныеНастройкиРМК[0], ДоступныеНастройкиРМК[0].ВерсияДанных,
				УникальныйИдентификатор);
			НастройкиОбъект = ДоступныеНастройкиРМК[0].ПолучитьОбъект();
			ЗначениеВРеквизитФормы(НастройкиОбъект, "НастройкиРМК");
			ТекущееРабочееМесто = НастройкиРМК.РабочееМесто;
		КонецЕсли;
	КонецЕсли;
	
	Если НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		ПарольСервераЛояльности = ?(ЗначениеЗаполнено(ПарольСервераЛояльности), УникальныйИдентификатор, "");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НастройкиРМК.Наименование) Тогда
		НастройкиРМК.Наименование = НСтр("ru = 'Настройка РМК'");
	КонецЕсли;
	
	Если НастройкиРМК.ВидОтображения.Пустая() Тогда
		НастройкиРМК.ВидОтображения = Перечисления.ВидыОтображения.Стандартный;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементаФормы(Элемент, Видимость)
	Элемент.Видимость = Видимость;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементаФормы(Элемент, Доступность)
	Элемент.Доступность = Доступность;
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	СценарийТерминалСамообслуживания = Перечисления.СценарииИспользованияРМК.ТерминалСамообслуживания;
	ЭтоСценарийТерминал = (НастройкиРМК.СценарийИспользования = СценарийТерминалСамообслуживания);
	ОтображатьСкидкуПроцентом = НастройкиРМК.РежимОтображенияСкидки = 1;
	ОбщегоназначенияРМК.НастроитьСценарийИспользованияРМК(ЭтотОбъект);
	
	УстановитьВидимостьЭлементаФормы(Элементы.ПереключательСтраниц, ПомощникНастройкиРабочегоМеста);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНесколькоКасс, НастройкиРМК.ПродажиСНесколькихКассККМ);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНастройкиПродавцов, НастройкиРМК.РазрешитьВыборПродавца);
	ОбщегоНазначенияРМКПереопределяемый.УстановитьНастройкиЭлементовФормыНастроекРМК(ЭтотОбъект);
	ОбщегоНазначенияРМКПереопределяемый.ПереопределитьДинамическийСписокКассирыДляВхода(КассирыДляВхода);
	ОбщегоНазначенияРМКПереопределяемый.ПереопределитьДинамическийСписокУстройств(СписокУстройств, ТекущееРабочееМесто);
	
	ДоступностьГруппыСМС = Истина;
	ОбщегоНазначенияРМКПереопределяемый.НастроитьИспользованиеОтправкиSMS(ДоступностьГруппыСМС);
	Элементы.ГруппаНастройкиСМС.Доступность = ДоступностьГруппыСМС;
	
	ЗаполнитьНастройкиЭлементов();
	ЗаполнитьГорячиеКлавиши(НастройкиРМК);
	ЗаполнитьСписокНаименованийПользователейПриЗапросеПрав();
	УстановитьУсловноеОформление();
	УстановитьВидимостьЭлементыДляКассира();
	АктуализироватьНастройкиОборудования();
	ЗаполнитьПорядокИДеревоОбластейФормы();
	СкрытьРазделыПомощникНастройкиРабочегоМеста();
	УстановитьПодсказкуПоляКонтролироватьЕМРЦ();
	УстановитьВидимостьФорматаКорзиныПлиточногоИнтерфейса();
	ОтразитьДанныеПоОтображениюQR();
	ПроверитьАктуальностьИзображенияНачалаПродажи();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	УстановитьДоступностьНастроекИСМП();
	УстановитьДоступностьПредупрежденияСЛ();
	УстановитьДоступностьЖурналаДействийКассира();
	НастроитьЭлементыSMSПодтверждения();
	НастроитьЭлементыКассиров();
	НастроитьИспользованиеВводаКартЛояльности();
	НастроитьИспользованиеПродавцов();
	НастроитьИспользованиеСервераЛояльности();
	НастроитьЭлементыОсновныхВидовОплат();
	НастроитьЭлементыВидовОплатПлатежныеСистемы();
	НастроитьВидыОплатНСПК();
	УстановитьДоступностьШаблоновЧеков();
	УстановитьДоступностьОчисткиАрхивныхЧеков();
	УстановитьНастройкиПечатиЗаказа();
	УстановитьДоступностьПоляТаймаут();
	УстановитьВидимостьГруппКатегорий();
	УстановитьНастройкиMAX();
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНастройкаПакет, НастройкиРМК.РазрешитьБыстроеДобавлениеПакета);
	ЗакрыватьФормуБезКонтроляИзмененийНастроек = Ложь;
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьПеременные()
	
	ВозможныеСостоянияНастроек = Новый Структура();
	ВозможныеСостоянияНастроек.Вставить("НеИмеетНастроек", -1);
	ВозможныеСостоянияНастроек.Вставить("НастройкиПоУмолчанию", 0);
	ВозможныеСостоянияНастроек.Вставить("НастройкиИзменены", 1);
	
	ДанныеДляОтображенияЭлементов = Новый Структура;
	ДанныеДляОтображенияЭлементов.Вставить("СброситьНастройкиСвойствЭлементов_Доступность", Ложь);
	
	НастройкиПодключения = РегистрыСведений.СоответствиеНастроекИнтеграцииРМК.НастроенаОплатаПлатежнойСистемой();

	ПодключитьКассовыйQRКод = Ложь;
	Если НастройкиПодключения.ИспользоватьОплатуСБП Тогда
		
		ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.НастроитьПодключениеКассовойСсылкиВНастройкеРабочегоМеста(
			ПодключитьКассовыйQRКод,
			КассаПодключенияКодаСБП);
			
	КонецЕсли;
	
	ИспользоватьРасширеннуюФормуПодбора = НЕ НастройкиРМК.ИспользоватьНовыйПодборТоваров;
	ГоризонтальнаяОриентация = Не НастройкиРМК.ВертикальнаяОриентация;
	СтруктураПлиточногоИнтерфейсаПодбора = НастройкиРМК.СтруктураПлиточногоИнтерфейсаПодбора;
	
	ИспользоватьСинхронизациюДанных = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
	Если НЕ ИспользоватьСинхронизациюДанных Тогда
		Константы.ИспользоватьСинхронизациюДанных.Установить(Истина);
	КонецЕсли;
	
	НастройкаСинхронизацииСуществует = 
		ОбщегоНазначенияРМК.НастройкаСинхронизацииДанныхСуществует();

	НастройкаККМEDСуществует =
		ОбщегоНазначенияРМК.НастройкаККМEDСуществует();
		
	Если НастройкаСинхронизацииСуществует
		И НастройкаККМEDСуществует Тогда	
		ТипОбмена = 0;
	ИначеЕсли НастройкаККМEDСуществует Тогда
		ТипОбмена = 1;
	Иначе
		ТипОбмена = 0;
	КонецЕсли;	
	
	ОчищатьПрефикс = НЕ НастройкаСинхронизацииСуществует;
	ТекущийПрефиксИБ = "";
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТекущийПрефиксИБ(ОчищатьПрефикс, ТекущийПрефиксИБ);
	Если ЗначениеЗаполнено(ТекущийПрефиксИБ) И НЕ ТекущийПрефиксИБ = ПрефиксИнформационнойБазы Тогда
		ПрефиксИнформационнойБазы = ТекущийПрефиксИБ;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"БаннерИнформация",
		"Видимость",
		НастройкаСинхронизацииСуществует);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДекорацияОжиданиеИзмененияПрефикса",
		"Видимость",
		Ложь);

	СкидкиПенсионерам = НастройкиРМК.СкидкиНаценки.НайтиСтроки(
		Новый Структура("Наименование", "СкидкаПенсионера"));
	Если СкидкиПенсионерам.Количество() Тогда
		ЗначениеСкидкиПенсионерам = СкидкиПенсионерам[0].ЗначениеСкидкиНаценки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	ИнтерфейсРМКСлужебный.УстановитьУсловноеОформлениеГорячихКлавиш(ЭтотОбъект);
	
	ЭлементыОформления = УсловноеОформление.Элементы;
	ЭлементОформления = ЭлементыОформления.Добавить();
	Элемент = ЭлементыОформления.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокУстройств.Имя);
	
	ЭлементОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.СписокУстройствИспользуется.ПутьКДанным);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветАктивнойКнопкиРМК);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЗначениеЭлементаЗакрытьПодбор(НастройкиРМК, Модификация = Ложь)
	
	Если НастройкиРМК.СценарийИспользования
			= ПредопределенноеЗначение("Перечисление.СценарииИспользованияРМК.ТерминалСамообслуживания") Тогда
			
		ЗначениеЗакрывать = (Не НастройкиРМК.ОсновнойПодборПлиточный);
		Если Не НастройкиРМК.ЗакрыватьПодборПриВыбореТовара = ЗначениеЗакрывать Тогда
			НастройкиРМК.ЗакрыватьПодборПриВыбореТовара = ЗначениеЗакрывать;
			Модификация = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаголовокФормы()
	Если ПомощникНастройкиРабочегоМеста Тогда
		Заголовок = НСтр("ru = 'Настройки РМК'");
	Иначе
		ШаблонЗаголовка = НСтр("ru = '%1 (Настройки рабочего места кассира)'");
		Заголовок = СтрШаблон(ШаблонЗаголовка, НастройкиРМК.Наименование);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоРазделам()
	
	Элементы.СписокРазделов.ОтборСтрок = Новый ФиксированнаяСтруктура("Видимость", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьРазделФормы()
	ТекущиеДанные = Элементы.СписокРазделов.ТекущиеДанные;
	Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы[ТекущиеДанные.Имя];
	ПриСменеСтраницыНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницыНастроек()
	
	Если Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницаОкноПриложения Тогда
		ЗаполнитьДеревоОбластейФормы();
		ПоказатьСхемуФормыРМК();
	ИначеЕсли Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницаБыстрыеТовары Тогда
		ОбновитьПредпросмотрПлиточногоИнтерфейсаПриНеобходимости();
	ИначеЕсли Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницаИнтерфейс Тогда
		УстановитьВидимостьНастроекВариантовИнтерфейса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАктивностьВерхнегоРаздела()
	СтрокиРазделов = СписокРазделов.НайтиСтроки(Новый Структура("Видимость", Истина));
	Если СтрокиРазделов.Количество() > 0 Тогда
		Элементы.СписокРазделов.ТекущаяСтрока = СтрокиРазделов[0].ПолучитьИдентификатор();
		АктивироватьРазделФормы();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНаименованийПользователейПриЗапросеПрав()
	
	СписокВыбора = Элементы.НастройкиРМКНаименованиеПользователяПриЗапросеПрав.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(НСтр("ru = 'администратору'"));
	СписокВыбора.Добавить(НСтр("ru = 'старшему кассиру'"));
	СписокВыбора.Добавить(НСтр("ru = 'сотруднику магазина'"));
	Если ЗначениеЗаполнено(НастройкиРМК.НаименованиеПользователяПриЗапросеПрав) Тогда
		СписокВыбора.Добавить(НастройкиРМК.НаименованиеПользователяПриЗапросеПрав);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкрытьРазделыПомощникНастройкиРабочегоМеста()
	Если Не ПомощникНастройкиРабочегоМеста Тогда
		Возврат;
	КонецЕсли;
	СтрокиТаблицы = СписокРазделов.НайтиСтроки(Новый Структура("Имя", "СтраницаСерверЛояльности"));
	СтрокиТаблицы = СписокРазделов.НайтиСтроки(Новый Структура("Имя", "СтраницаСинхронизацияРезервноеКопирование"));
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		СтрокаТаблицы.Видимость = Ложь;
	КонецЦикла;
	СтрокиТаблицы = СписокРазделов.НайтиСтроки(Новый Структура("Имя", "СтраницаПодключаемоеОборудование"));
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		СтрокаТаблицы.Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсобенностиПродаж()
	
	ОбщегоНазначенияРМКПереопределяемый.УстановитьПризнакФормеПоДаннымФункциональнойОпции(ЭтотОбъект,
		"ВестиСведенияДляДекларацийПоАлкогольнойПродукции");
	
	АктуализироватьДоступностьКонтроляИспользованияКалендарныхЗапретовПродаж();
	
	Если НастройкиРМК.ИспользоватьОплатуСертификатамиНСПК Тогда
		ЗаполнитьПараметрыПодключенияНСПК();
	КонецЕсли;
	
	Элементы.ВыгрузитьКонтрольПродаж.Видимость = НастройкиРМК.ИспользоватьКонтрольПродаж;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуПоляКонтролироватьЕМРЦ()
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	ВидМаркированнойПродукции = Перечисления.ВидыМаркированнойПродукцииБПО.Табак;
	ЕМРЦ = 0;
	ОбщегоНазначенияРМКПереопределяемый.ПолучитьЦенуЕМРЦ(ВидМаркированнойПродукции,, ЕМРЦ);
	
	Если ЕМРЦ > 0 Тогда
		
		ЧислоРублей = Цел(ЕМРЦ);
		ЧислоКопеек = 100 * (ЕМРЦ - ЧислоРублей);
		РублиСтрокой = Строка(ЧислоРублей);
		КопейкиСтрокой = Формат(ЧислоКопеек, "ЧЦ=2; ЧН=00; ЧВН=" );
		НомерГода = Формат(ТекущаяДатаСеанса, НСтр("ru='ДФ=''гггг'''"));
		ШаблонСтрокиТекста = НСтр("ru = 'Контролировать ЕМРЦ при продаже табачной и алкогольной продукций согласно №504-ФЗ. 
			|Устанавливать МРЦ из контрольной марки для табачной продукции, как цену продажи. ЕМРЦ табачной продукции, установленная на %1 год: %2 руб. %3 коп.'");
		ТекстПодсказки = СтрШаблон(ШаблонСтрокиТекста, НомерГода, РублиСтрокой, КопейкиСтрокой);
		
		Элементы.НастройкиРМККонтролироватьЕМРЦ.РасширеннаяПодсказка.Заголовок = ТекстПодсказки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКонстантами

&НаСервере
Функция ЛокальныйРасчетСкидокПоддерживаетПромокоды()
	Возврат ОбщегоНазначенияРМК.ЛокальныйРасчетСкидокПоддерживаетПромокоды();
КонецФункции

&НаСервере
Процедура СохранитьЗначениеКонстанты(КонстантаИмя, ТекущееЗначениеКонстанты)
	
	Если КонстантаИмя <> "" Тогда
		
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = ТекущееЗначениеКонстанты;
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыПоКонстантам()
	
	ИспользоватьШаблоныСообщений = ИспользоватьШаблоныСообщений();
	ИспользоватьПромокоды = ЛокальныйРасчетСкидокПоддерживаетПромокоды();
	ОбщегоНазначенияРМКПереопределяемый.ОбновитьРеквизитыНастроекПоКонстантам(ЭтотОбъект);
	ЗаполнитьОсобенностиПродаж();
КонецПроцедуры

&НаСервере 
Процедура АктуализироватьДоступностьКонтроляИспользованияКалендарныхЗапретовПродаж(СохранятьКонстанту = Ложь)
	
	Если СохранятьКонстанту Тогда
		ИмяКонстанты = ОбщегоНазначенияРМК.ИмяКонстанты("ВестиСведенияДляДекларацийПоАлкоголю");
		СохранитьЗначениеКонстанты(ИмяКонстанты, ВестиСведенияДляДекларацийПоАлкогольнойПродукции);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область КонтрольМаркируемойПродукции
&НаКлиенте
Процедура УстановитьДоступностьНастроекИСМП()
	
	Элементы.ПредставлениеЛогированияЗапросов.Видимость         = НастройкиРМК.ОжидатьРезультатПроверкиМарок
																	И ПараметрыЛогирования <> Неопределено;
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаКонтрольМаркированнойПродукцииГоризонтальная, НастройкиРМК.ОжидатьРезультатПроверкиМарок)
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПредупрежденияСЛ()
	Если НастройкиРМК.ОжидатьРезультатПроверкиМарок И Не НастройкиРМК.ЛокальныйКонтрольКлючаИСМП
			И Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		Элементы.ГруппаПредупреждениеСЛ.Видимость = Истина;
	Иначе
		Элементы.ГруппаПредупреждениеСЛ.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередаватьОтчетыОПодключенииКегКОборудованиюРозливаИзРМКПриИзмененииСервер()
	ИмяКонстанты = ОбщегоНазначенияРМК.ИмяКонстанты("ПередаватьОтчетыОПодключенииКегКОборудованиюРозливаИзРМК");
	СохранитьЗначениеКонстанты(ИмяКонстанты, ПередаватьОтчетыОПодключенииКегКОборудованиюРозливаИзРМК);
КонецПроцедуры
#КонецОбласти

#Область ЛогированиеЗапросов

&НаСервере
Процедура ВключитьЛогированиеЗапросов(ПродолжительностьВМинутах)
	МодульЛогированияИСМП = ОбщегоНазначения.ОбщийМодуль("ЛогированиеЗапросовИСМП");
	МодульЛогированияИС   = ОбщегоНазначения.ОбщийМодуль("ЛогированиеЗапросовИС");
	
	ПараметрыЛогирования = МодульЛогированияИСМП.ПараметрыЛогированияЗапросов();
	МодульЛогированияИС.ВключитьЛогированиеЗапросов(ПараметрыЛогирования, ПродолжительностьВМинутах * 60);
	МодульЛогированияИСМП.УстановитьПараметрыЛогированияЗапросов(ПараметрыЛогирования);
КонецПроцедуры

&НаСервере
Процедура ОтключитьЛогированиеЗапросов()
	
	МодульЛогированияИСМП = ОбщегоНазначения.ОбщийМодуль("ЛогированиеЗапросовИСМП");
	
	МодульЛогированияИСМП.ОтключитьЛогированиеЗапросов();
	
	ПараметрыЛогирования = ПолучитьПараметрыЛогирования();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЛогЗапросов()
	МодульЛогированияИСМП = ОбщегоНазначения.ОбщийМодуль("ЛогированиеЗапросовИСМП");
	МодульЛогированияИС   = ОбщегоНазначения.ОбщийМодуль("ЛогированиеЗапросовИС");
	
	МодульЛогированияИС.ОчиститьЛогЗапросов(ПолучитьПараметрыЛогирования());
	МодульЛогированияИСМП.УстановитьПараметрыЛогированияЗапросов(ПараметрыЛогирования);
	ПараметрыЛогирования = ПолучитьПараметрыЛогирования();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыЛогирования()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.БазоваяФункциональность.БРМК") Тогда
		МодульЛогированияИСМП = ОбщегоНазначения.ОбщийМодуль("ЛогированиеЗапросовИСМП");
		МодульЛогированияИС   = ОбщегоНазначения.ОбщийМодуль("ЛогированиеЗапросовИС");
		
		ПараметрыЛогирования = МодульЛогированияИСМП.ПараметрыЛогированияЗапросов();
		МодульЛогированияИС.ЗаполнитьПараметрыЛогирования(ПараметрыЛогирования);
	КонецЕсли;
	
	Возврат ПараметрыЛогирования;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОбработкаОжиданияЗавершенияЛогирования()
	
	ПараметрыЛогирования = ПолучитьПараметрыЛогирования();
	
	Если ПараметрыЛогирования <> Неопределено Тогда
		ОбновитьПредставлениеЛогирования();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиЛогирования(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ВключитьЛогЗапросов" Тогда
		
		СписокПродолжительностьЛога = Новый СписокЗначений();
		СписокПродолжительностьЛога.Добавить(5,  НСтр("ru='5 мин.'"));
		СписокПродолжительностьЛога.Добавить(10, НСтр("ru='10 мин.'"));
		СписокПродолжительностьЛога.Добавить(15, НСтр("ru='15 мин.'"));
		
		ПараметрыВыбораПродолжительности = Новый Структура;
		ПараметрыВыбораПродолжительности.Вставить("РежимПродления", Ложь);
		
		ОповещениеОВыбора = Новый ОписаниеОповещения("ВыборПродолжительностьЛогаЗавершение", ЭтотОбъект, ПараметрыВыбораПродолжительности);
		ПоказатьВыборИзСписка(ОповещениеОВыбора, СписокПродолжительностьЛога, Элемент);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьЛогЗапросов" Тогда
		
		МодульЛогированияИСКлиент   = ОбщегоНазначенияКлиент.ОбщийМодуль("ЛогированиеЗапросовИСКлиент");
		МодульЛогированияИСКлиент.ОткрытьПросмотрЛогаЗапросов(УникальныйИдентификатор, "ИСМП");
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ИзменитьВремяОкончанияЗаписиЛогов" Тогда
		
		СписокПродолжительностьЛога = Новый СписокЗначений();
		СписокПродолжительностьЛога.Добавить(5,  НСтр("ru='продлить на 5 мин.'"));
		СписокПродолжительностьЛога.Добавить(10, НСтр("ru='продлить на 10 мин.'"));
		СписокПродолжительностьЛога.Добавить(15, НСтр("ru='продлить на 15 мин.'"));
		
		ПараметрыВыбораПродолжительности = Новый Структура;
		ПараметрыВыбораПродолжительности.Вставить("РежимПродления", Истина);
		
		ОповещениеОВыбора = Новый ОписаниеОповещения("ВыборПродолжительностьЛогаЗавершение", ЭтотОбъект, ПараметрыВыбораПродолжительности);
		ПоказатьВыборИзСписка(ОповещениеОВыбора, СписокПродолжительностьЛога, Элемент);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтключитьЗаписьЛогов" Тогда
		
		ОтключитьЛогированиеЗапросов();
		ОбновитьПредставлениеЛогирования();
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОчиститьЛогЗапросов" Тогда
		
		ОписаниеОповещенияВопросОчиститьЛогЗапросовЗавершение = Новый ОписаниеОповещения("ОписаниеОповещенияВопросОчиститьЛогЗапросовЗавершение", ЭтотОбъект);
		
		ПоказатьВопрос(
			ОписаниеОповещенияВопросОчиститьЛогЗапросовЗавершение,
			НСтр("ru='Очистить лог запросов?'"),
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеЛогирования()
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбработкаОжиданияЗавершенияЛогирования");
	
	ДанныеОсновнойЧасти = Новый Массив();
	ДанныеПодсказки     = Новый Массив();
	
	Если ПараметрыЛогирования.Включено
		Или ЗначениеЗаполнено(ПараметрыЛогирования.ОкончаниеЗаписи) Тогда
		ДанныеПодсказки.Добавить(НСтр("ru='Логирование запросов'"));
		ДанныеПодсказки.Добавить(" ");
		ДанныеПодсказки.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru='посмотреть'"),,
					ЦветГиперссылки,,
					"ОткрытьЛогЗапросов"));
		ДанныеПодсказки.Добавить(" ");
		ДанныеПодсказки.Добавить(НСтр("ru='подробную'"));
	Иначе
		ДанныеПодсказки.Добавить(НСтр("ru='Логирование запросов позволяет получить подробную'"));
	КонецЕсли;
	ДанныеПодсказки.Добавить(" ");
	ДанныеПодсказки.Добавить(НСтр("ru='техническую информацию по взаимодействию с ГИС МТ'"));
	ДанныеПодсказки.Добавить(" ");
	ДанныеПодсказки.Добавить(НСтр("ru='для расследования проблем и ошибок службами поддержки.'"));
	
	Если ПараметрыЛогирования.Включено Тогда
		
		Если ЗначениеЗаполнено(ПараметрыЛогирования.ОкончаниеЗаписи) Тогда
			ДатаЗавершенияЛогирования = ДатаИзУниверсальнойДаты(ПараметрыЛогирования.ОкончаниеЗаписи);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаЗавершенияЛогирования) Тогда
			
			ДанныеОсновнойЧасти.Добавить(НСтр("ru='Логирование запросов производится до'"));
			ДанныеОсновнойЧасти.Добавить(" ");
			
			Если НачалоДня(ТекущаяДата()) <> НачалоДня(ДатаЗавершенияЛогирования) Тогда
				ПредставлениеДаты = СтрШаблон(
					" (%1)",
					Формат(ДатаЗавершенияЛогирования, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
			
			ПредставлениеВремени = СтрШаблон(
				"%1%2",
				Формат(ДатаЗавершенияЛогирования, "ДФ=HH:mm;"),
				ПредставлениеДаты);
			
			ДанныеОсновнойЧасти.Добавить(
				Новый ФорматированнаяСтрока(
					ПредставлениеВремени,,
					ЦветГиперссылки,,
					"ИзменитьВремяОкончанияЗаписиЛогов"));
			
			ПодключитьОбработчикОжидания(
				"Подключаемый_ОбработкаОжиданияЗавершенияЛогирования",
				(ДатаЗавершенияЛогирования - ТекущаяДата()) + 10,
				Истина);
			
		Иначе
			
			ДанныеОсновнойЧасти.Добавить(НСтр("ru='Запись логов запросов продолжается'"));
			
		КонецЕсли;
		
		ДанныеОсновнойЧасти.Добавить(" ");
		ДанныеОсновнойЧасти.Добавить(
			Новый ФорматированнаяСтрока(
				НСтр("ru='Отключить'"),,
				ЦветГиперссылки,,
				"ОтключитьЗаписьЛогов"));
		
	Иначе
		
		ДанныеОсновнойЧасти.Добавить(НСтр("ru='Запись логов запросов не производится.'"));
		
		ДанныеОсновнойЧасти.Добавить(" ");
		ДанныеОсновнойЧасти.Добавить(
			Новый ФорматированнаяСтрока(
				НСтр("ru='Включить'"),,
				ЦветГиперссылки,,
				"ВключитьЛогЗапросов"));
		
	КонецЕсли;
	
	Если ПараметрыЛогирования.Включено
		Или ЗначениеЗаполнено(ПараметрыЛогирования.ОкончаниеЗаписи) Тогда
		
		ДанныеПодсказки.Добавить(НСтр("ru='При необходимости можно'"));
		ДанныеПодсказки.Добавить(" ");
		ДанныеПодсказки.Добавить(
			Новый ФорматированнаяСтрока(
				НСтр("ru='очистить'"),,
				ЦветГиперссылки,,
				"ОчиститьЛогЗапросов"));
		ДанныеПодсказки.Добавить(" ");
		ДанныеПодсказки.Добавить(НСтр("ru='записи.'"));
	КонецЕсли;
	
	ПредставлениеЛогированияЗапросов = Новый ФорматированнаяСтрока(ДанныеОсновнойЧасти);
	Элементы.ПредставлениеЛогированияЗапросов.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(ДанныеПодсказки);
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ОткрытьСписокСкладовДляПродажи()
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаНастройкиСкладов", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("НастройкиРМК", НастройкиРМК);
	ОткрытьФорму("Справочник.НастройкиРабочегоМестаКассира.Форма.ФормаИспользуемыхСкладов", ПараметрыОткрытияФормы, ЭтотОбъект,,,,
		ОповещениеОЗакрытии, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
КонецПроцедуры

#Область НастройкиЖурналаДействийКассира
&НаКлиенте
Процедура ОбработатьНавигационнуюСсылкаЖурналДействийКассира()
	ОткрытьЖурналДействийКассираКлиент();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОчиститьИсториюОперацийНаСервере(ИмяФоновогоЗадания, ИмяПроцедуры, ПараметрыОчистки)
	
	Задание = ФоновыеЗадания.Выполнить(ИмяПроцедуры, ПараметрыОчистки);
	Задание = Задание.ОжидатьЗавершенияВыполнения(2);
	Возврат Задание.Состояние = СостояниеФоновогоЗадания.Активно;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекстНадписиРегламентнойНастройки(ЭлементЗадания, РасписаниеЗадания)
	
	ТекстЗадания = НСтр("ru = 'Расписание'");
	Если ЭлементЗадания.Доступность Тогда
		ТекстРасписания = СтрШаблон(НСтр("ru = '%1: %2'"), ТекстЗадания, Строка(РасписаниеЗадания));
	Иначе
		ТекстРасписания = СтрШаблон(НСтр("ru = '%1 (НЕ АКТИВНО)'"), ТекстЗадания);
	КонецЕсли;;
	ЭлементЗадания.Заголовок = ТекстРасписания;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеОчистки(Команда)
	
	Контекст = Новый Структура();
	Контекст.Вставить("ИмяЗадания", "");
	Контекст.Вставить("ИмяРеквизита", "");
	Если Команда = Команды.НастроитьРасписаниеОчисткиЖурналаДействийКассиров Тогда
		Контекст.ИмяЗадания		= "ОчисткаЖурналаДействийКассира";
		Контекст.ИмяРеквизита	= "РасписаниеОчисткиЖурналаДействийКассира";
	ИначеЕсли Команда = Команды.НастроитьРасписаниеУдаленияАрхивныхЧеков Тогда
		Контекст.ИмяЗадания		= "ОчисткаАрхивныхЧеков";
		Контекст.ИмяРеквизита	= "РасписаниеУдаленияАрхивныхЧеков";
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = ЭтаФорма[Контекст.ИмяРеквизита];
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		#Если Не МобильноеПриложениеКлиент Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
		#КонецЕсли
	КонецЕсли;
	Если Не РасписаниеРегламентногоЗадания = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьРасписаниеОчисткиОпераций", ЭтотОбъект, Контекст);
		Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
		Диалог.Показать(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЖурналаДействийКассира()

	ВедениеЖурнала = НастройкиРМК.ВестиЖурналДействийКассира;
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаКонтрольРаботыКассировГоризонтальная, ВедениеЖурнала);
	УстановитьДоступностьОчисткиЖурналаДействийКассира(ВедениеЖурнала);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьОчисткиЖурналаДействийКассира(ВедениеЖурнала = Истина)
	
	ОчисткаДоступна = Ложь;
	Если ВедениеЖурнала Тогда
		СрокХранения = НастройкиРМК.СрокХраненияОперацийСЧеком;
		ОчисткаДоступна = (ЗначениеЗаполнено(СрокХранения) И Не ЭтоСрокХраненияВесьПериод(СрокХранения));
	КонецЕсли;
	УстановитьТекстНадписиРегламентнойНастройки(Элементы.ОчисткаЖурналаДействийКассира,
		РасписаниеОчисткиЖурналаДействийКассира);
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция ЭтоСрокХраненияВесьПериод(СрокХранения)
	
	Возврат ОбщегоНазначенияРМК.ЭтоСрокХраненияВесьПериод(СрокХранения);
	
КонецФункции

&НаСервере
Процедура РезультатЗакрытияФормыНастройкиСМССервер(ДоступностьГруппыСМС)
	ОбщегоНазначенияРМКПереопределяемый.НастроитьИспользованиеОтправкиSMS(ДоступностьГруппыСМС);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЖурналДействийКассираКлиент()
	ПараметрыОчистки = Новый Массив;
	ИмяФоновогоЗадания = "ОчисткаЖурналаДействийКассира";
	ИмяПроцедуры = "ОбщегоНазначенияРМК.ОчиститьИсториюЖурналаДействийКассираСОтбором";
	ПараметрыОчистки.Добавить(НастройкиРМК.РабочееМесто);
	ПараметрыОчистки.Добавить(НастройкиРМК.СрокХраненияОперацийСЧеком);
	
	Результат = ОчиститьИсториюОперацийНаСервере(ИмяФоновогоЗадания, ИмяПроцедуры, ПараметрыОчистки);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналДействийКассираКлиент()
	ПараметрыОткрытия = Новый Структура("Отбор", Новый Структура("РабочееМесто", НастройкиРМК.РабочееМесто));
		
	ОткрытьФорму("РегистрСведений.ЖурналДействийКассира.ФормаСписка",
			ПараметрыОткрытия, ЭтотОбъект, , , , ,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений
&НаКлиенте
Процедура НастроитьЭлементыГруппыСМС(ДоступностьГруппыСМС)
	Элементы.ГруппаНастройкиСМС.Доступность = ДоступностьГруппыСМС;
	
	Если Не ДоступностьГруппыСМС Тогда
		НастройкиРМК.ОтправлятьSMSКодПриЗаведенииКарты = Ложь;
		НастройкиРМК.ОтправлятьSMSКодПриПродаже = ПредопределенноеЗначение("Перечисление.ВариантыОтправкиSMSПриПродаже.ПустаяСсылка");
	КонецЕсли;
	
	НастроитьЭлементыSMSПодтверждения();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыSMSПодтверждения()
	
	СтандартнаяОбработка = Истина;
	
	ОбщегоНазначенияРМККлиентПереопределяемый.НастроитьЭлементыSMSПодтвержденияНаФормеНастроек(
		ЭтотОбъект, СтандартнаяОбработка);
		
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
			
	Если НЕ НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных
		И НЕ ИспользоватьШаблоныСообщений Тогда
		НастройкиРМК.ОтправлятьSMSКодПриЗаведенииКарты = Ложь;
	КонецЕсли;
	
	Если НастройкиРМК.ОтправлятьSMSКодПриПродаже = ПредопределенноеЗначение("Перечисление.ВариантыОтправкиSMSПриПродаже.ПриВыборе") Тогда
		УстановитьВидимостьЭлементаФормы(Элементы.СтраницыШаблон, Истина);
		Элементы.СтраницыШаблон.ТекущаяСтраница = Элементы.СтраницаШаблонПриПродаже;
	ИначеЕсли НастройкиРМК.ОтправлятьSMSКодПриПродаже = ПредопределенноеЗначение("Перечисление.ВариантыОтправкиSMSПриПродаже.ПриОплатеБаллами") Тогда
		УстановитьВидимостьЭлементаФормы(Элементы.СтраницыШаблон, Истина);
		Элементы.СтраницыШаблон.ТекущаяСтраница = Элементы.СтраницаОплатыБонусов;
	Иначе
		УстановитьВидимостьЭлементаФормы(Элементы.СтраницыШаблон, Ложь);
	КонецЕсли;
	
	ИспользоватьСерверЛояльностиИШаблоны = (НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Или ВводДисконтныхКарт)
		И ИспользоватьШаблоныСообщений;
	
	УстановитьДоступностьЭлементаФормы(Элементы.НастройкиРМКОтправлятьSMSКодПриЗаведенииКарты, ИспользоватьСерверЛояльностиИШаблоны);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНастройкиПриЗаведенииКарты,
		ИспользоватьСерверЛояльностиИШаблоны И НастройкиРМК.ОтправлятьSMSКодПриЗаведенииКарты);
		
		
	УстановитьДоступностьЭлементаФормы(Элементы.НастройкиРМКОтправлятьSMSКодПриПродаже, ИспользоватьШаблоныСообщений);
	
КонецПроцедуры

&НаСервере
Функция ИспользоватьШаблоныСообщений()
	
	РезультатФункции = Ложь;
	Если ПодсистемаШаблоновСообщенийСуществует() Тогда
		РезультатФункции = Константы.ИспользоватьШаблоныСообщений.Получить();
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Функция ПодсистемаШаблоновСообщенийСуществует()
	
	РезультатФункции = Ложь;
	СтандартныеПодсистемы = Метаданные.Подсистемы.Найти("СтандартныеПодсистемы");
	Если Не СтандартныеПодсистемы = Неопределено Тогда
		РезультатФункции = (СтандартныеПодсистемы.Подсистемы.Найти("ШаблоныСообщений") <> Неопределено);
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти

#Область СценарииИспользования
&НаКлиенте
Процедура НастроитьЭлементыКассиров()
	УстановитьВидимостьЭлементаФормы(Элементы.СтраницаКассирыДляВхода, НастройкиРМК.НастроитьКассировДляВхода);
	Если НастройкиРМК.НастроитьКассировДляВхода Тогда
		Элементы.СтраницыНастройкиКассиров.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе
		Элементы.СтраницыНастройкиКассиров.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыделитьСценарийИспользования()
	ИмяВыбранногоСценария = ОбщегоНазначения.ИмяЗначенияПеречисления(НастройкиРМК.СценарийИспользования);
	Для Каждого КнопкаСценария Из Элементы.ГруппаПодменюСценарииИспользования.ПодчиненныеЭлементы Цикл
		ИмяСценарияКнопки = Сред(КнопкаСценария.Имя, 22);
		КнопкаСценария.Пометка = (ИмяВыбранногоСценария = ИмяСценарияКнопки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСценарийНачало(ИмяКомандыСценария)
	
	ИмяСценария = Сред(ИмяКомандыСценария, 22);
	ВыбранныйСценарий = ПредопределенноеЗначение("Перечисление.СценарииИспользованияРМК." + ИмяСценария);
	ПроизвольныйСценарий = ПредопределенноеЗначение("Перечисление.СценарииИспользованияРМК.Произвольный");
	Если Не ВыбранныйСценарий = НастройкиРМК.СценарийИспользования Тогда
		Если ВыбранныйСценарий = ПроизвольныйСценарий Тогда
			УстановитьСценарийИспользования(ВыбранныйСценарий);
		Иначе
			
			ТекстВопроса = НСтр("ru = 'При смене сценария использования часть настроек будет 
				|заменена на значения по умолчанию. Продолжить?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьСценарийЗавершение", ЭтотОбъект, ВыбранныйСценарий);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , ,
				НСтр("ru = 'Продолжение смены сценария использования.'"));
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСценарийИспользования(НовоеЗначениеСценария)
	
	НастройкиРМК.СценарийИспользования = НовоеЗначениеСценария;
	ОбработатьВыборСценария();
	СброситьЛишниеНастройкиСценария();
	НастроитьЗначениеЭлементаЗакрытьПодбор(НастройкиРМК);
	УстановитьДоступностьЖурналаДействийКассира();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборСценария()
	
	ГоризонтальнаяОриентацияДо = ГоризонтальнаяОриентация;
	ВыделитьСценарийИспользования();
	ОбщегоНазначенияРМК.НастроитьСценарийИспользованияРМК(ЭтотОбъект);
	Если НастройкиРМК.СценарийИспользования = Перечисления.СценарииИспользованияРМК.ТерминалСамообслуживания Тогда
		УстановитьЗначенияНастроекДляТерминалаСамообслуживания();
	КонецЕсли;
	Если Не ГоризонтальнаяОриентацияДо = ГоризонтальнаяОриентация Тогда
		ОбновитьОписаниеОкнаПриложения();
		ЗаполнитьДеревоОбластейФормы();
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьЛишниеНастройкиСценария()
	
	ЛишниеНастройки = Новый Массив;
	ОбластиПересчета = Новый Массив;
	СценарийСамообслуживания = ПредопределенноеЗначение("Перечисление.СценарииИспользованияРМК.ТерминалСамообслуживания");
	Если НастройкиРМК.СценарийИспользования = СценарийСамообслуживания Тогда
		ЛишниеНастройки.Добавить(ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ПоказыватьСтатусСмены"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуОбластиДереваПоЗаголовку(СтрокиДерева, ЗаголовокОбласти)
	
	РезультатФункции = Неопределено;
	КоличествоСтрок = СтрокиДерева.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		ТекущаяСтрока = СтрокиДерева.Получить(ИндексСтроки);
		Если ТекущаяСтрока.ЗаголовокОбласти = ЗаголовокОбласти Тогда
			РезультатФункции = ТекущаяСтрока;
		Иначе
			РезультатФункции = ПолучитьСтрокуОбластиДереваПоЗаголовку(ТекущаяСтрока.ПолучитьЭлементы(), ЗаголовокОбласти);
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначенияНастроекДляТерминалаСамообслуживания()
	ОбщегоНазначенияРМК.УстановитьЗначенияНастроекДляТерминалаСамообслуживания(ЭтотОбъект);
	ИспользоватьОплатуСертификатамиНСПКПриИзмененииСервер();
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура НастроитьИспользованиеВводаКартЛояльности()
	
	Если Не ВводДисконтныхКарт Тогда
		НастройкиРМК.НапоминатьПроВводКартыЛояльности = Ложь;
	КонецЕсли;
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНапоминатьВводКарты, ВводДисконтныхКарт);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаРазрешатьЗамену, ВводДисконтныхКарт);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИспользованиеПродавцов()
	Если Не ИспользоватьПродавцов Тогда
		НастройкиРМК.РазрешитьВыборПродавца = Ложь;
	КонецЕсли;
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаВыборПродавца, ИспользоватьПродавцов);
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНастройкиПродавцов, НастройкиРМК.РазрешитьВыборПродавца);
	Если Не НастройкиРМК.РазрешитьВыборПродавца Тогда
		НастройкиРМК.ИспользоватьКассираКакПродавца = Ложь;
		НастройкиРМК.ПроверятьЗаполнениеПродавцов = Ложь;
	КонецЕсли;
		
КонецПроцедуры

#Область НастройкиСкидок
&НаКлиенте
Процедура НастроитьИспользованиеСервераЛояльности()
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНастройкиСервераЛояльностиГоризонтальная, НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных);
	
	Если НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных
		И НЕ ПарольСервераЛояльностиИзменен Тогда
		ПарольСервераЛояльности = УникальныйИдентификатор;
	КонецЕсли;
	
	Если Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных
		И Не ИспользоватьАвтоматическиеСкидки Тогда
		НастройкиРМК.ПроизводитьПолныйРасчетСкидок = Ложь;
	КонецЕсли;
	
	Если НастройкиРМК.РаботаВРежимеМедленногоСоединения
		И Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		НастройкиРМК.РаботаВРежимеМедленногоСоединения = Ложь;
	КонецЕсли;
	
	Если НастройкиРМК.ВыполнятьЛокальныйРасчетСкидок
		И Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		НастройкиРМК.ВыполнятьЛокальныйРасчетСкидок = Ложь;
	КонецЕсли;
	
	Если НастройкиРМК.ЗапретитьПробитиеЧекаБезРасчетаСкидок
		И Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		НастройкиРМК.ЗапретитьПробитиеЧекаБезРасчетаСкидок = Ложь;
	КонецЕсли;
	
	Если НастройкиРМК.РазрешитьЗапросОстатка
		И Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		НастройкиРМК.РазрешитьЗапросОстатка = Ложь;
	КонецЕсли;
	
	ЗаполнитьТекстПодсказкиСервераЛояльности();
	УстановитьДоступностьПредупрежденияСЛ();
	
	НастроитьЭлементыАвтоматическихСкидок();
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьСерверЛояльностиПолучательДанныхПриИзмененииНаСервере()
	
	ИмяКонстанты = ОбщегоНазначенияРМК.ИмяКонстанты("ИспользоватьСерверЛояльностиПолучательДанных");
	СохранитьЗначениеКонстанты(ИмяКонстанты, НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных);
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьИспользованиеАвтоматическихСкидок(НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных, ИспользоватьАвтоматическиеСкидки, ЕстьАвтоматическиеСкидки);
	ОбщегоНазначенияРМКПереопределяемый.УстановитьНастройкиПродавцов(ИспользоватьПродавцов, НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыАвтоматическихСкидок()
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаВопросПоРасчету, ИспользоватьАвтоматическиеСкидки);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаИспользоватьПромокоды, ИспользоватьАвтоматическиеСкидки);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаВыдаватьПодарок, ИспользоватьАвтоматическиеСкидки);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаПересчитытватьСкидки, ИспользоватьАвтоматическиеСкидки);
	
	Если Не ИспользоватьАвтоматическиеСкидки Тогда
		НастройкиРМК.ВопросПоРасчетуСкидок = Ложь;
		НастройкиРМК.ИспользоватьПромокоды = Ложь;
		НастройкиРМК.ЗапрашиватьКартуЛояльностиЗаказПокупателя = Ложь;
	КонецЕсли;
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаВыполнятьЛокальныйРасчет,
		ЕстьАвтоматическиеСкидки И НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных);
	Если Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		НастройкиРМК.ВыполнятьЛокальныйРасчетСкидок = Ложь;
	КонецЕсли;
	
	УстановитьНастройкиПолногоРасчетаСкидок();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыВидовОплатСерверЛояльности()
	Если Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		НастройкиРМК.ИспользоватьОплатуБонусами = Ложь;
		НастройкиРМК.ИспользоватьОплатуСертификатами = Ложь;
		
		Если Не ИспользоватьПромокоды Тогда
			НастройкиРМК.ИспользоватьПромокоды = Ложь;
		КонецЕсли;
		УстановитьДоступностьЭлементаФормы(Элементы.ГруппаИспользоватьПромокоды, ИспользоватьПромокоды);
	Иначе
		УстановитьДоступностьЭлементаФормы(Элементы.ГруппаИспользоватьПромокоды, Истина);
	КонецЕсли;
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаОплатаБонусами, НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаОплатаСертификатом, НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПарольСервераЛояльности(ТекущаяНастройкаРМК)
	Возврат ОбщегоНазначенияРМК.ПарольСервераЛояльности(ТекущаяНастройкаРМК);
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТекстПодсказкиСервераЛояльности()
	
	ТекстПодсказкиБонусы = НСтр("ru='Принимать оплату по данным бонусного баланса карты из управляющей системы.'");
	ОбщегоНазначенияРМККлиентПереопределяемый.ТекстПодсказкиИспользованиеБонусныхБаллов(ТекстПодсказкиБонусы, НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных);
	Элементы.ГруппаОплатаБонусами.Заголовок = ТекстПодсказкиБонусы;
	
	ТекстПодсказкиСертификат = НСтр("ru='Принимать оплату по данным статуса и баланса сертификата из управляющей системы.'");
	ОбщегоНазначенияРМККлиентПереопределяемый.ТекстПодсказкиИспользованиеСертификатов(ТекстПодсказкиСертификат, НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных);
	Элементы.ГруппаОплатаСертификатом.Заголовок = ТекстПодсказкиСертификат;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИсходныеДанныеДляПроверкиДоступностиСервераЛояльности(НастройкиРМК)
	
	Таймаут = ?(НастройкиРМК.РаботаВРежимеМедленногоСоединения, НастройкиРМК.ТаймаутСерверЛояльности, 0);
	
	Результат = Новый Структура();
	Результат.Вставить("АдресСервера", НастройкиРМК.АдресСервераЛояльности);
	Результат.Вставить("Логин", НастройкиРМК.ПользовательСервераЛояльности);
	Результат.Вставить("Таймаут", Таймаут);
	Результат.Вставить("Пароль", ПарольСервераЛояльности(НастройкиРМК.Ссылка));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РаботаВРежимеМедленногоСоединенияПриИзмененииКлиент()
	
	УстановитьДоступностьПоляТаймаут();
	Если Не НастройкиРМК.РаботаВРежимеМедленногоСоединения Тогда
		НастройкиРМК.ТаймаутСерверЛояльности = 0;
	КонецЕсли;
	УстановитьНастройкиПолногоРасчетаСкидок();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПоляТаймаут()
	
	УстановитьДоступностьЭлементаФормы(Элементы.НастройкиРМКТаймаутСерверЛояльности, НастройкиРМК.РаботаВРежимеМедленногоСоединения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПолногоРасчетаСкидок()
	Если НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		ДоступностьПолногоРасчета = НЕ НастройкиРМК.РаботаВРежимеМедленногоСоединения;
	Иначе
		ДоступностьПолногоРасчета = ИспользоватьАвтоматическиеСкидки;
	КонецЕсли;
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаПолныйПересчет, ДоступностьПолногоРасчета);
	
	Если Не ДоступностьПолногоРасчета Тогда
		НастройкиРМК.ПроизводитьПолныйРасчетСкидок = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область НастройкиНаличные
&НаКлиенте
Процедура НастроитьЭлементыОсновныхВидовОплат()
	
	ИспользоватьОплатуНаличными = НастройкиРМК.ИспользоватьОплатуНаличными;
	ИспользоватьОплатуПлатежнымиКартами = НастройкиРМК.ИспользоватьОплатуПлатежнымиКартами;
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаВыдаватьНаличные, ИспользоватьОплатуНаличными И ИспользоватьОплатуПлатежнымиКартами);
		
	Если Не ИспользоватьОплатуНаличными Или Не ИспользоватьОплатуПлатежнымиКартами Тогда
		НастройкиРМК.ВыдаватьНаличныеНаКассе = Ложь;
	КонецЕсли;
	
	Если Не ИспользоватьОплатуНаличными Тогда
		НастройкиРМК.ИспользоватьПанельВводаНаличныхКупюр = Ложь;
		НастройкиРМК.СкрыватьQRОплатыНаличными = Ложь;
		ПоказыватьQRОплатыНаличными = Ложь;
	Иначе
		ПоказыватьQRОплатыНаличными = ИспользоватьОплатуНаличными И НЕ НастройкиРМК.СкрыватьQRОплатыНаличными;
	КонецЕсли;
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаПлатежныеКартыГоризонтальная, ИспользоватьОплатуПлатежнымиКартами);
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаВыдаватьНаличные, ИспользоватьОплатуНаличными И ИспользоватьОплатуПлатежнымиКартами);
	Если НЕ ИспользоватьОплатуПлатежнымиКартами Тогда
		НастройкиРМК.СкрыватьQRОплатыКартой = Ложь;
		ПоказыватьQRОплатыКартой = Ложь;
	Иначе
		ПоказыватьQRОплатыКартой = ИспользоватьОплатуПлатежнымиКартами И НЕ НастройкиРМК.СкрыватьQRОплатыКартой;
	КонецЕсли;
	
	НастроитьДоступностьЭлементовВводаНаличных();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьЭлементовВводаНаличных()
	ИспользоватьОплатуНаличными = НастройкиРМК.ИспользоватьОплатуНаличными;
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаОплатаНаличные, ИспользоватьОплатуНаличными);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаПокупюрныйВвод, ИспользоватьОплатуНаличными);
	
	ОбработатьИзменениеИспользованияПанелиВводаНаличныхНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеИспользованияПанелиВводаНаличныхНаКлиенте()
	Если НастройкиРМК.ИспользоватьОплатуНаличными
		И НастройкиРМК.ИспользоватьПанельВводаНаличныхКупюр Тогда
		ПерезаполнитьПанельВводаНаличныхПриНеобходимости();
		Элементы.СтраницыНастройкиОплат.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе
		Элементы.СтраницыНастройкиОплат.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	НастроитьВидимостьТаблицыВводаНаличных();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПанельВводаНаличныхПриНеобходимости()
	
	МассивНоминаловКупюр = ОбщегоНазначенияРМККлиентСервер.НоминалыКупюр();
	ИспользуемыеНоминалыКупюр = ПолучитьИспользуемыеНоминалыКупюр();
	Если Не ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(МассивНоминаловКупюр, ИспользуемыеНоминалыКупюр) Тогда
		ПерезаполнитьТаблицуВводаНаличных(МассивНоминаловКупюр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьТаблицыВводаНаличных()
	
	ДоступностьПанелиВводаНаличных = (НастройкиРМК.ИспользоватьОплатуНаличными 
		И НастройкиРМК.ИспользоватьПанельВводаНаличныхКупюр);
	УстановитьВидимостьЭлементаФормы(Элементы.СтраницаПокупюрныйВвод, ДоступностьПанелиВводаНаличных);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТаблицуВводаНаличных(МассивНоминаловКупюр)
	ПустаяКлавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	КлавишиНоминалов = ПолучитьКлавишиНоминалов();
	НастройкиРМК.ВводНаличных.Очистить();
	Для Каждого ЭлементНоминала Из МассивНоминаловКупюр Цикл
		НоваяСтрока = НастройкиРМК.ВводНаличных.Добавить();
		НоваяСтрока.Номинал = ЭлементНоминала;
		НоваяСтрока.Использование = Истина;
		ПредыдущаяКлавиша = КлавишиНоминалов.Получить(ЭлементНоминала);
		Если ПредыдущаяКлавиша = Неопределено Тогда
			НоваяСтрока.Клавиша = ПустаяКлавиша;
		Иначе
			НоваяСтрока.Клавиша = ПредыдущаяКлавиша.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКлавишиНоминалов()
	
	ПустаяКлавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	КлавишиНоминалов = Новый Соответствие;
	Для Каждого СтрокаНаличных Из НастройкиРМК.ВводНаличных Цикл
		Если ЗначениеЗаполнено(СтрокаНаличных.Клавиша) И Не СтрокаНаличных.Клавиша = ПустаяКлавиша Тогда
			КлавишиНоминалов.Вставить(СтрокаНаличных.Номинал, СтрокаНаличных.Клавиша);
		КонецЕсли;
	КонецЦикла;
	Возврат КлавишиНоминалов;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИспользуемыеНоминалыКупюр()
	
	МассивИспользуемыхНоминаловКупюр = Новый Массив;
	Для Каждого СтрокаНоминала Из НастройкиРМК.ВводНаличных Цикл
		МассивИспользуемыхНоминаловКупюр.Добавить(СтрокаНоминала.Номинал);
	КонецЦикла;
	Возврат МассивИспользуемыхНоминаловКупюр;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьИОткрытьСписокТерминаловПриНеобходимости()
	Если НЕ НастройкиРМК.ИспользоватьОплатуПлатежнымиКартами Тогда
		Возврат;
	КонецЕсли;
	ЕстьТерминалы = Ложь;
	ПроверитьНаличиеТерминалов(ЕстьТерминалы);
	
	Если НЕ ЕстьТерминалы Тогда
		ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуНастройкиЭквайринга(Новый Структура, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеТерминалов(ЕстьТерминалы)
	МассивЭквайрингов = Новый Массив;
	ОбщегоНазначенияРМКПереопределяемый.ЭквайринговыеТерминалыСККМ(МассивЭквайрингов);
	
	ЕстьТерминалы = МассивЭквайрингов.Количество() > 0;
КонецПроцедуры

#КонецОбласти

#Область ПлатежныеСистемы

&НаКлиенте
Процедура НастроитьЭлементыВидовОплатПлатежныеСистемы()
	
	НастроитьЭлементНеПечататьКодВозвратаСБП();
	
	Если Не НастройкиРМК.ИспользоватьОплатуПлатежнымиСистемами Тогда
		НастройкиРМК.СкрыватьQRСБП = Ложь;
		ПоказыватьQRОплатыСБП = Ложь;
	Иначе
		ПоказыватьQRОплатыСБП = НастройкиРМК.ИспользоватьОплатуПлатежнымиСистемами
			И НЕ НастройкиРМК.СкрыватьQRСБП;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементНеПечататьКодВозвратаСБП()
	
	ДоступенКодВозвратаСБП = НастройкиРМК.ИспользоватьОплатуПлатежнымиСистемами
		И НЕ ЗначениеЗаполнено(НастройкиРМК.ШаблонЧекаПродажи);
		
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаСБП, НастройкиРМК.ИспользоватьОплатуПлатежнымиСистемами);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНеПечататьВозвратСПБ, ДоступенКодВозвратаСБП);
	
	Если НЕ ДоступенКодВозвратаСБП Тогда
		НастройкиРМК.НеПечататьКодВозвратаСБП = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьОплатуСертификатамиНСПКПриИзмененииСервер()
	
	ИмяКонстанты = ОбщегоНазначенияРМК.ИмяКонстанты("ИспользоватьОплатуСертификатамиНСПК");
	СохранитьЗначениеКонстанты(ИмяКонстанты, НастройкиРМК.ИспользоватьОплатуСертификатамиНСПК);
	
	Если НастройкиРМК.ИспользоватьОплатуСертификатамиНСПК Тогда
		ЭлектронныеСертификатыНСПКРМКПереопределяемый.СоздатьВидыОплатНСПК();
		ЗаполнитьПараметрыПодключенияНСПК();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементНеПечататьКодВозвратаНСПК()
	
	ДоступенКодВозвратаНСПК = НастройкиРМК.ИспользоватьОплатуСертификатамиНСПК
		И НЕ ЗначениеЗаполнено(НастройкиРМК.ШаблонЧекаПродажи);
		
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНеПечататьВозвратНСПК, ДоступенКодВозвратаНСПК);
	Если НЕ ДоступенКодВозвратаНСПК Тогда
		НастройкиРМК.НеПечататьКодВозвратаНСПК = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПодключенияНСПК()
	
	Если НастройкиРМК.ИспользоватьОплатуСертификатамиНСПК Тогда
		
		ПараметрыПодключенияНСПК = Новый Структура("АдресСервисаНСПК, КлючДоступаНСПК");
		ЭлектронныеСертификатыНСПКРМКПереопределяемый.ЗаполнитьПараметрыПодключенияНСПК(ПараметрыПодключенияНСПК);
		
		АдресСервисаНСПК = ПараметрыПодключенияНСПК.АдресСервисаНСПК;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдресСервисаНСПКПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(АдресСервисаНСПК) Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("ЭС_НСПК_МИР", АдресСервисаНСПК, "АдресСервисаНСПК");
	Иначе
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища("ЭС_НСПК_МИР", "АдресСервисаНСПК");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидыОплатНСПК()
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНастройкиНСПКГоризонтальная, НастройкиРМК.ИспользоватьОплатуСертификатамиНСПК);
	
	НастроитьЭлементНеПечататьКодВозвратаНСПК();
КонецПроцедуры
#КонецОбласти

#Область ПокупюрныйВвод
&НаКлиенте
Процедура НастройкаРМКВводНаличныхПриАктивизацииСтрокиКлиент()
	ОбработатьСходСоСтрокиКупюры();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСходСоСтрокиКупюры(СменаСтраницы = Ложь)
	
	ТипНарушенияЗапрещеннаяКомбинация = "ЗапрещеннаяКомбинация";
	ТекущиеДанныеКупюры = Неопределено;
	Если Не ТекущаяСтрокаКупюры = Неопределено Тогда
		ТекущиеДанныеКупюры = НастройкиРМК.ВводНаличных.НайтиПоИдентификатору(ТекущаяСтрокаКупюры);
	КонецЕсли;
	Если СменаСтраницы Тогда
		Если (Не ТекущиеДанныеКупюры = Неопределено)
				И СтрНайти(ТекущиеДанныеКупюры.ТипНарушения, ТипНарушенияЗапрещеннаяКомбинация) > 0 Тогда
			Элементы.СтраницыНастройкиРМК.ТекущаяСтраница = Элементы.СтраницаВводНаличных;
			ТекстПредупреждения = СформироватьПредупреждениеЗапртеКомбинацииДляСтрокиНоминала(ТекущиеДанныеКупюры);
			ПоказатьПредупреждение(, ТекстПредупреждения);
		Иначе
			ТекущаяСтрокаКупюры = Неопределено;
		КонецЕсли;
	ИначеЕсли Не ТекущаяСтрокаКупюры = Элементы.НастройкиРМКВводНаличных.ТекущаяСтрока Тогда
		Если (Не ТекущиеДанныеКупюры = Неопределено)
				И СтрНайти(ТекущиеДанныеКупюры.ТипНарушения, ТипНарушенияЗапрещеннаяКомбинация) > 0 Тогда
			ТекстПредупреждения = СформироватьПредупреждениеЗапртеКомбинацииДляСтрокиНоминала(ТекущиеДанныеКупюры);
			ОписаниеЗавершенияПредупреждения = Новый ОписаниеОповещения("ОбработатьСходСоСтрокиКупюрыЗавершение",
				ЭтотОбъект, ТекущаяСтрокаКупюры);
			ПоказатьПредупреждение(ОписаниеЗавершенияПредупреждения, ТекстПредупреждения);
		Иначе
			ТекущаяСтрокаКупюры = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьПредупреждениеЗапртеКомбинацииДляСтрокиНоминала(ТекущиеДанныеКупюры)
	
	СоставляющаяCtrl = ?(НастройкиРМК.ВводНаличныхАкселераторCtrl, "Ctrl + ", "");
	СоставляющаяAlt = ?(НастройкиРМК.ВводНаличныхАкселераторAlt, "Alt + ", "");
	СоставляющаяShift = ?(НастройкиРМК.ВводНаличныхАкселераторShift, "Shift + ", "");
	СтроковоеПредставлениеКомбинации = СтрШаблон("%1%2%3%4",
		СоставляющаяCtrl, СоставляющаяAlt, СоставляющаяShift, ТекущиеДанныеКупюры.Клавиша);
	
	ТекстНачала = НСтр("ru = 'Комбинация'");
	ТекстОкончания = НСтр("ru = 'является недопустимой. Выберите другую комбинацию.'");
	
	РезультатФункции = СтрШаблон("%1 %2 %3", ТекстНачала, СтроковоеПредставлениеКомбинации, ТекстОкончания);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция СформироватьПредупреждениеЗапретКомбинацииДляСтрокиГорячейКлавиши(ТекущиеДанныеГорячейКлавиши)
	
	ТипНарушенияЗапрещеннаяКомбинацияБуфер = "ЗапрещеннаяКомбинацияБуфер";
	
	СоставляющаяCtrl = ?(ТекущиеДанныеГорячейКлавиши.АкселераторCtrl, "Ctrl + ", "");
	СоставляющаяAlt = ?(ТекущиеДанныеГорячейКлавиши.АкселераторAlt, "Alt + ", "");
	СоставляющаяShift = ?(ТекущиеДанныеГорячейКлавиши.АкселераторShift, "Shift + ", "");
	СтроковоеПредставлениеКомбинации = СтрШаблон("%1%2%3%4",
		СоставляющаяCtrl, СоставляющаяAlt, СоставляющаяShift, ТекущиеДанныеГорячейКлавиши.Клавиша);
	
	ТекстНачала = НСтр("ru = 'Комбинация'");
	ТекстОкончания = НСтр("ru = 'является недопустимой. Выберите другую комбинацию.'");
	Если ТекущиеДанныеГорячейКлавиши.ТипНарушения = ТипНарушенияЗапрещеннаяКомбинацияБуфер Тогда
		ТекстНедопустимаяКомбинация = НСтр("ru = 'является недопустимой для действия ""'");
		ТекстДругаяКомбинация = НСтр("ru = '"". Выберите другую комбинацию.'");
		ТекстОкончания = СтрШаблон("%1%2%3", ТекстНедопустимаяКомбинация,
			ТекущиеДанныеГорячейКлавиши.Действие, ТекстДругаяКомбинация);
	КонецЕсли;
	РезультатФункции = СтрШаблон("%1 %2 %3", ТекстНачала, СтроковоеПредставлениеКомбинации, ТекстОкончания);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ПолучитьНекорректнуюКомбинациюПоНоминалу(ДанныеНекорректныхКомбинаций, Номинал)
	
	Возврат ПолучитьНекорректнуюКомбинациюПоЗначениюКолонки(ДанныеНекорректныхКомбинаций, "Номинал", Номинал);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьОписаниеГорячейКлавишиКупюры(ГорячиеКлавишиКупюр, СтрокаКупюры)
	
	ОписаниеСтрокиКупюры = Новый Структура();
	ОписаниеСтрокиКупюры.Вставить("Номинал", СтрокаКупюры.Номинал);
	ОписаниеСтрокиКупюры.Вставить("Клавиша", СтрокаКупюры.Клавиша);
	ОписаниеСтрокиКупюры.Вставить("АкселераторAlt", НастройкиРМК.ВводНаличныхАкселераторAlt);
	ОписаниеСтрокиКупюры.Вставить("АкселераторCtrl", НастройкиРМК.ВводНаличныхАкселераторCtrl);
	ОписаниеСтрокиКупюры.Вставить("АкселераторShift", НастройкиРМК.ВводНаличныхАкселераторShift);
	ГорячиеКлавишиКупюр.Добавить(ОписаниеСтрокиКупюры);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УстановитьДоступностьШаблоновЧеков()
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаШаблоныЧекаГоризонтальная, НастройкиРМК.ИспользоватьЛокальныеШаблоныЧеков);
	Элементы.НастройкиРМКШаблонЧекаПродажи.КнопкаОчистки = НастройкиРМК.ИспользоватьЛокальныеШаблоныЧеков;
	Элементы.НастройкиРМКШаблонЧекаВозврата.КнопкаОчистки = НастройкиРМК.ИспользоватьЛокальныеШаблоныЧеков;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьФорматаКорзиныПлиточногоИнтерфейса()
	
	Элементы.НастройкиРМКФорматКорзиныПлиточногоИнтерфейса.Видимость = Не НастройкиРМК.ЗакрыватьПодборПриВыбореТовара
		И ЗначениеЗаполнено(НастройкиРМК.СтруктураПлиточногоИнтерфейсаПодбора);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыПодбораТоваров()
	
	ОбщегоНазначенияРМКПереопределяемый.НастроитьЭлементыПодбораТоваров(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКРазрешитьБыстроеДобавлениеПакетаПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНастройкаПакет, НастройкиРМК.РазрешитьБыстроеДобавлениеПакета);
	ПостроитьПредпросмотрПлиточногоИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКНоменклатураПакетПриИзменении(Элемент)
	ПостроитьПредпросмотрПлиточногоИнтерфейса();
КонецПроцедуры

#Область ОбменДанными
&НаСервереБезКонтекста
Функция ОписаниеВариантаНастройки(ИмяПланаОбмена, ИдентификаторНастройки)
	
	ОписаниеВариантаНастройки = Новый Структура;
	ОписаниеВариантаНастройки.Вставить("ЗаголовокКомандыДляСозданияНовогоОбменаДанными", "");
	ОписаниеВариантаНастройки.Вставить("КраткаяИнформацияПоОбмену", Новый ФорматированнаяСтрока(""));
	ОписаниеВариантаНастройки.Вставить("ПодробнаяИнформацияПоОбмену", "");
	ОписаниеВариантаНастройки.Вставить("ЗаголовокПомощникаСозданияОбмена", "");
	ОписаниеВариантаНастройки.Вставить("НаименованиеКорреспондента", "");

	ЗначенияНастроекДляВарианта = ОбменДаннымиСервер.ЗначениеНастройкиПланаОбмена(ИмяПланаОбмена,
		"НаименованиеКонфигурацииКорреспондента,
		|ЗаголовокКомандыДляСозданияНовогоОбменаДанными,
		|ЗаголовокПомощникаСозданияОбмена,
		|КраткаяИнформацияПоОбмену,
		|ПодробнаяИнформацияПоОбмену",
		ИдентификаторНастройки);
		
	ЗаполнитьЗначенияСвойств(ОписаниеВариантаНастройки, ЗначенияНастроекДляВарианта);
	ОписаниеВариантаНастройки.НаименованиеКорреспондента = ЗначенияНастроекДляВарианта.НаименованиеКонфигурацииКорреспондента;
	
	Возврат ОписаниеВариантаНастройки;
	
КонецФункции

&НаСервере
Функция ЗапуститьИзменениеПрефиксаИБВФоновомЗадании()
	
	ПараметрыПроцедуры = Новый Структура("НовыйПрефиксИБ, ПродолжитьНумерацию",
		ПрефиксИнформационнойБазы, Истина);
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Изменение префикса'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("ПрефиксацияОбъектовСлужебный.ИзменитьПрефиксИБ",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ПослеИзмененияПрефикса(ФоновоеЗадание, ДополнительныеПараметры) Экспорт

	Если НЕ Элементы.ПрефиксИнформационнойБазы.Доступность Тогда
		УстановитьДоступностьЭлементаФормы(Элементы.ПрефиксИнформационнойБазы, Истина);
	КонецЕсли;
	
	Если Элементы.ДекорацияОжиданиеИзмененияПрефикса.Видимость Тогда
		УстановитьВидимостьЭлементаФормы(Элементы.ДекорацияОжиданиеИзмененияПрефикса, Ложь);
	КонецЕсли;
	
	Если ФоновоеЗадание <> Неопределено
		И ФоновоеЗадание.Статус = "Выполнено" Тогда
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Префикс изменен.'"));
		
	Иначе
		
		Элементы.ПрефиксИнформационнойБазы.ОбновитьТекстРедактирования();
		
		Если ФоновоеЗадание <> Неопределено Тогда
			
			ТекстОшибки = НСтр("ru='Не удалось изменить префикс.
				|См. подробности в журнале регистрации.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Персонализация

&НаСервере
Функция ПолучитьКэшированноеЗначениеСвойстваПоУмолчанию(КэшСвойствЭлементовПоУмолчанию,
		НастройкиПоУмолчанию, СвойствоЭлементов)
		
	РезультатФункции = Неопределено;
	СтрокаНастройкиПоУмолчанию = КэшСвойствЭлементовПоУмолчанию.Получить(СвойствоЭлементов);
	Если СтрокаНастройкиПоУмолчанию = Неопределено Тогда
		СтрокаНастройкиПоУмолчанию = НастройкиПоУмолчанию.Найти(СвойствоЭлементов, "СвойствоЭлементов");
		Если Не СтрокаНастройкиПоУмолчанию = Неопределено Тогда
			КэшСвойствЭлементовПоУмолчанию.Вставить(СвойствоЭлементов, СтрокаНастройкиПоУмолчанию);
			РезультатФункции = СтрокаНастройкиПоУмолчанию.ЗначениеСвойства;
		КонецЕсли;
	Иначе
		РезультатФункции = СтрокаНастройкиПоУмолчанию.ЗначениеСвойства;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНастройкиЭлементов()
	
	КэшСвойствЭлементовПоУмолчанию = Новый Соответствие;
	
	НастройкиЭлементовФормыРМК.Очистить();
	НастройкиПоУмолчанию = ИнтерфейсРМКСлужебный.ПолучитьПервоначальныеНастройкиЭлементовРМК();
	ДобавитьИндивидуальныеПервоначальныеНастройки(НастройкиПоУмолчанию);
	Для Каждого СтрокаНастройки Из НастройкиРМК.НастройкиЭлементов Цикл
		ЗначениеПоУмолчанию = ПолучитьКэшированноеЗначениеСвойстваПоУмолчанию(КэшСвойствЭлементовПоУмолчанию,
			НастройкиПоУмолчанию, СтрокаНастройки.СвойствоЭлементов);
		Если Не ЗначениеПоУмолчанию = Неопределено И Не СтрокаНастройки.ЗначениеСвойства = ЗначениеПоУмолчанию Тогда
			НоваяСтрока = НастройкиЭлементовФормыРМК.Добавить();
			НоваяСтрока.ИмяЭлемента = СтрокаНастройки.ИмяЭлемента;
			НоваяСтрока.СвойствоЭлементов = СтрокаНастройки.СвойствоЭлементов;
			НоваяСтрока.ЗначениеСвойства = СтрокаНастройки.ЗначениеСвойства;
			НоваяСтрока.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьИндивидуальныеПервоначальныеНастройки(НастройкиПоУмолчанию)
	
	ИндивидуальныеНастройкиПоУмолчанию
		= ИнтерфейсРМКСлужебный.ПолучитьИндивидуальныеПервоначальныеНастройки();
		
	Для Каждого СтрокаИндивидуальнойНастройки Из ИндивидуальныеНастройкиПоУмолчанию Цикл
		Если НастройкиПоУмолчанию.Найти(СтрокаИндивидуальнойНастройки.СвойствоЭлементов, "СвойствоЭлементов")
				= Неопределено Тогда
				
			НоваяСтрока = НастройкиПоУмолчанию.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИндивидуальнойНастройки);
				
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПорядокИДеревоОбластейФормы()
	
	ЗаполнитьМодельСхемыРМК();
	ЗаполнитьНастройкиОбластей();
	ЗаполнитьПорядокОбластейФормы();
	ЗаполнитьДеревоОбластейФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМодельСхемыРМК()
	
	МодельОбластейРМК = Новый Структура();
	МодельОбластейРМК.Вставить("ГоризонтальнаяОриентация",
		ПолучитьСтруктуруОбластейФормыРМК(Элементы.ГоризонтальнаяОриентация));
	МодельОбластейРМК.Вставить("ВертикальнаяОриентация",
		ПолучитьСтруктуруОбластейФормыРМК(Элементы.ВертикальнаяОриентация));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОбластейФормыРМК(ГруппаФормы)
	
	ТипыГруппировок = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыГруппировок();
	ТипГруппировки = ?(ГруппаФормы.Группировка
		= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ТипыГруппировок.Вертикальная, ТипыГруппировок.Горизонтальная);
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("Имя", ГруппаФормы.Имя);
	РезультатФункции.Вставить("Заголовок", ГруппаФормы.Заголовок);
	РезультатФункции.Вставить("Группировка", ТипГруппировки);
	РезультатФункции.Вставить("Ширина", ГруппаФормы.Ширина);
	РезультатФункции.Вставить("Высота", ГруппаФормы.Высота);
	РезультатФункции.Вставить("ЦветФона", ГруппаФормы.ЦветФона);
	
	ОписаниеПодчиненныхЭлементов = Новый Массив;
	Для Каждого ПодчиненнаяОбласть Из ГруппаФормы.ПодчиненныеЭлементы Цикл
		ОписаниеГруппыФормы = ПолучитьСтруктуруОбластейФормыРМК(ПодчиненнаяОбласть);
		ОписаниеПодчиненныхЭлементов.Добавить(ОписаниеГруппыФормы);
	КонецЦикла;
	РезультатФункции.Вставить("ПодчиненныеЭлементы", ОписаниеПодчиненныхЭлементов);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНастройкиОбластей()
	
	НастройкиОбластейФормыРМК.Загрузить(НастройкиРМК.НастройкиОбластей.Выгрузить());
	НастройкиПоУмолчанию = ИнтерфейсРМКСлужебный.ПолучитьПервоначальныеНастройкиОбластейРМК();
	Для Каждого СтрокаБазовойНастройки Из НастройкиПоУмолчанию Цикл
		ОтборСтрок = Новый Структура();
		ОтборСтрок.Вставить("ЗаголовокОбласти", СтрокаБазовойНастройки.ЗаголовокОбласти);
		ОтборСтрок.Вставить("СвойствоЭлементовОбласти", СтрокаБазовойНастройки.СвойствоЭлементовОбласти);
		СтрокиНастроекФормы = НастройкиОбластейФормыРМК.НайтиСтроки(ОтборСтрок);
		Если СтрокиНастроекФормы.Количество() = 0 Тогда
			НоваяСтрока = НастройкиОбластейФормыРМК.Добавить();
			НоваяСтрока.ЗаголовокОбласти = СтрокаБазовойНастройки.ЗаголовокОбласти;
			НоваяСтрока.СвойствоЭлементовОбласти = СтрокаБазовойНастройки.СвойствоЭлементовОбласти;
			НоваяСтрока.ЗначениеСвойства = СтрокаБазовойНастройки.ЗначениеСвойства;
			НоваяСтрока.ЗначениеПоУмолчанию = СтрокаБазовойНастройки.ЗначениеСвойства;
		Иначе
			СтрокиНастроекФормы[0].ЗначениеПоУмолчанию = СтрокаБазовойНастройки.ЗначениеСвойства;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПорядокОбластейФормы()
	
	ПорядокОбластей.Загрузить(НастройкиРМК.ПорядокОбластей.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОбластейФормы()
	
	ПараметрыЗаполнения = ПараметрыЗаполненияОбластейФормыРМК(НастройкиРМК);
	ИнтерфейсРМКСлужебный.ЗаполнитьДеревоОбластейФормы(ЭтотОбъект, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыЗаполненияОбластейФормыРМК(НастройкаРМК)
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("ПанельИзбранных", ЗначениеЗаполнено(НастройкаРМК.СтруктураБыстрыхТоваров));
	ПараметрыЗаполнения.Вставить("ПлиточныйИнтерфейс", НастройкаРМК.ОсновнойПодборПлиточный);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

&НаСервере
Процедура ОбновитьОписаниеОкнаПриложения()
	
	ТекстОриентации = ?(НастройкиРМК.ВертикальнаяОриентация, НСтр("ru='Вертикальная'"), НСтр("ru='Горизонтальная'"));
	ТекстМасштаб = "";
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		Если НастройкиРМК.ВидОтображения = Перечисления.ВидыОтображения.Увеличенный Тогда
			ТекстМасштаб = НСтр("ru=', Крупный'");
		ИначеЕсли НастройкиРМК.ВидОтображения = Перечисления.ВидыОтображения.Уменьшенный Тогда
			ТекстМасштаб = НСтр("ru=', Мелкий'");
		Иначе
			ТекстМасштаб = НСтр("ru=', 100%'");
		КонецЕсли;
	КонецЕсли;
	ТекстНачальныйЭкран = "";
	Если НастройкиРМК.ОсновнойПодборПлиточный Тогда
		ТекстНачальныйЭкран = НСтр("ru=', Палитра'");
	Иначе
		ТекстНачальныйЭкран = НСтр("ru=', Корзина'");
	КонецЕсли;
	ОписаниеОкнаПриложения = СтрШаблон("%1%2%3", ТекстОриентации, ТекстМасштаб, ТекстНачальныйЭкран);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыДляФормыНастройкиОбластей()
	
	ПараметрыЗаполнения = ПараметрыЗаполненияОбластейФормыРМК(НастройкиРМК);
	ПараметрыЗаполнения.Удалить("ПлиточныйИнтерфейс");
	ПараметрыЗаполнения.Вставить("СценарийИспользования", НастройкиРМК.СценарийИспользования);
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ВидОтображения", НастройкиРМК.ВидОтображения);
	РезультатФункции.Вставить("ГоризонтальнаяОриентация", ГоризонтальнаяОриентация);
	РезультатФункции.Вставить("Палитра", НастройкиРМК.СтруктураПлиточногоИнтерфейсаПодбора);
	РезультатФункции.Вставить("ОсновнойПодборПлиточный", НастройкиРМК.ОсновнойПодборПлиточный);
	РезультатФункции.Вставить("УвеличенныйВариантМасштаба", НастройкиРМК.УвеличенныйВариантМасштаба);
	РезультатФункции.Вставить("ВлияющиеПараметры", ПараметрыЗаполнения);
	РезультатФункции.Вставить("МодельОбластей", МодельОбластейРМК);
	РезультатФункции.Вставить("НастройкаРМК", НастройкиРМК.Ссылка);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьНастройкиОбластей()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеНастроекОбластейЗавершение", ЭтотОбъект);
	
	ПараметрыРедактирования = ПолучитьПараметрыДляФормыНастройкиОбластей();
	ОткрытьФорму("Обработка.РедактированиеПанелейРМК.Форма.ФормаНастройкиОбластей",
		ПараметрыРедактирования, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеНастроекОбластейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		
		СтруктураВлияющихНастроек = ШаблонВлияющихНастроек();
		
		НастроитьЭлементыФормыПослеРедактированияОбластей(СтруктураВлияющихНастроек);
		ЗапомнитьРеквизитыПалитры();
		ПоказатьСхемуФормыРМК();
		ПостроитьПредпросмотрПлиточногоИнтерфейсаКлиент(СтруктураВлияющихНастроек);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ГорячиеКлавиши

&НаСервере
Процедура ЗаполнитьГорячиеКлавиши(ТекущаяНастройкаРМК)
	
	ДанныеДляОтображенияЭлементов.СброситьНастройкиСвойствЭлементов_Доступность = Ложь;
	Макет = Справочники.НастройкиРабочегоМестаКассира.ПолучитьМакет("ГорячиеКлавиши");
	КолСтрок = Макет.ВысотаТаблицы;
	ИмяРаздела = "";
	ИмяЭлементаПанельИзбранных = "ОткрытьПанельИзбранныхТоваров";
	СтрокаРаздела = Неопределено;
	НомераКолонок = НомераКолонокГорячихКлавиш();
	НомерНачальнойСтроки = 2;
	Если ДеревоГорячиеКлавиши.ПолучитьЭлементы().Количество() > 0 Тогда
		ДеревоГорячиеКлавиши.ПолучитьЭлементы().Очистить();
	КонецЕсли;
	
	Для НомерСтрокиМакета = НомерНачальнойСтроки По КолСтрок Цикл
		
		ИмяРазделаМакета
			= Макет.Область(НомерСтрокиМакета, НомераКолонок.ИмяРаздела, НомерСтрокиМакета, НомераКолонок.ИмяРаздела).Текст;
		Если СтрокаРаздела = Неопределено Или Не ИмяРаздела = ИмяРазделаМакета Тогда
			ИмяРаздела = ИмяРазделаМакета;
			СтрокаРаздела = ДобавитьСтрокуРазделаГорячихКлавиш(ИмяРаздела);
		КонецЕсли;
		ОбластьЭлемента
			= Макет.Область(НомерСтрокиМакета, НомераКолонок.ИмяЭлемента, НомерСтрокиМакета, НомераКолонок.ИмяЭлемента);
		ИмяЭлемента = ОбластьЭлемента.Текст;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИмяКнопки", ИмяЭлемента);
		
		МассивСтрок = ТекущаяНастройкаРМК.ГорячиеКлавиши.НайтиСтроки(СтруктураПоиска);
		
		СтрокаНастройки = ?(МассивСтрок.Количество() = 0, Неопределено, МассивСтрок[0]);
		ДобавитьЭлементВРазделГорячихКлавиш(СтрокаРаздела, ИмяЭлемента, Макет, НомерСтрокиМакета, СтрокаНастройки);
		Если ИмяЭлемента = ИмяЭлементаПанельИзбранных Тогда
			ЗаполнитьЗначениеАкселератораИзбранных(СтрокаНастройки);
		КонецЕсли;
		
	КонецЦикла;
	Элементы.ДеревоГорячиеКлавишиКлавиша.СписокВыбора.ЗагрузитьЗначения(МассивКлавиш());
	Элементы.НастройкиРМКВводНаличныхКлавиша.СписокВыбора.ЗагрузитьЗначения(МассивКлавиш());
	ОбновитьПодсказкуТаблицыГорячихКлавиш(ТекущаяНастройкаРМК);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениеАкселератораИзбранных(СтрокаНастройки)
	
	Если Не СтрокаНастройки = Неопределено Тогда
		АкселераторыОткрытияИзбранных.Alt = СтрокаНастройки.АкселераторAlt;
		АкселераторыОткрытияИзбранных.Ctrl = СтрокаНастройки.АкселераторCtrl;
		АкселераторыОткрытияИзбранных.Shift = СтрокаНастройки.АкселераторShift;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НомераКолонокГорячихКлавиш()
	
	НомераКолонок = Новый Структура;
	НомераКолонок.Вставить("ИмяРаздела", 1);
	НомераКолонок.Вставить("ИмяЭлемента", 2);
	НомераКолонок.Вставить("ТипКоманды", 3);
	НомераКолонок.Вставить("Действие", 4);
	НомераКолонок.Вставить("Клавиша", 5);
	НомераКолонок.Вставить("Alt", 6);
	НомераКолонок.Вставить("Ctrl", 7);
	НомераКолонок.Вставить("Shift", 8);
	Возврат НомераКолонок;
	
КонецФункции

&НаСервереБезКонтекста
Функция МассивКлавиш()
	
	МассивКлавиш = Новый Массив;
	
	// 0 ... 9
	Для Счетчик = 0 По 9 Цикл
		МассивКлавиш.Добавить(СтрШаблон("_%1", Счетчик));
	КонецЦикла;
	
	// A...Z
	Для Счетчик = 65 По 90 Цикл
		МассивКлавиш.Добавить(Символ(Счетчик));
	КонецЦикла;
	
	МассивКлавиш.Добавить(Строка(Клавиша.BackSpace));
	
	// F1..F12
	Для Счетчик = 1 По 12 Цикл
		МассивКлавиш.Добавить(СтрШаблон("F%1", Счетчик));
	КонецЦикла;
	
	// Num0 ... Num9 
	Для Счетчик = 0 По 9 Цикл
		МассивКлавиш.Добавить(СтрШаблон("Num%1", Счетчик));
	КонецЦикла;
	
	МассивКлавиш.Добавить(Строка(Клавиша.NumAdd));
	МассивКлавиш.Добавить(Строка(Клавиша.NumDecimal));
	МассивКлавиш.Добавить(Строка(Клавиша.NumDivide));
	МассивКлавиш.Добавить(Строка(Клавиша.NumMultiply));
	МассивКлавиш.Добавить(Строка(Клавиша.NumSubtract));
	МассивКлавиш.Добавить(Строка(Клавиша.Space));
	МассивКлавиш.Добавить(Строка(Клавиша.Нет));
	
	Возврат МассивКлавиш;
	
КонецФункции

&НаСервере
Функция ДобавитьСтрокуРазделаГорячихКлавиш(ИмяРаздела)
	
	ИмяЭлемента = ПолучитьИмяЭлементаРаздела(ИмяРаздела);
	
	СтрокаРаздела = ДеревоГорячиеКлавиши.ПолучитьЭлементы().Добавить();
	СтрокаРаздела.ИмяРаздела = ИмяРаздела;
	СтрокаРаздела.Действие = ИмяРаздела;
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
		СтрокаРаздела.ИмяЭлемента = ИмяЭлемента;
		Если ЕстьИзмененныеНастройкиЭлементаФормы(ИмяЭлемента) Тогда
			ДанныеДляОтображенияЭлементов.СброситьНастройкиСвойствЭлементов_Доступность = Истина;
			СтрокаРаздела.СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиИзменены;
		Иначе
			СтрокаРаздела.СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиПоУмолчанию;
		КонецЕсли;
	Иначе
		СтрокаРаздела.СостояниеНастроек = ВозможныеСостоянияНастроек.НеИмеетНастроек;
	КонецЕсли;
	Возврат СтрокаРаздела;
	
КонецФункции

&НаСервере
Процедура ДобавитьЭлементВРазделГорячихКлавиш(СтрокаРаздела, ИмяЭлемента, Макет, НомерСтрокиМакета, СтрокаНастройки)
	
	СостояниеНастроек = ВозможныеСостоянияНастроек.НеИмеетНастроек;
	НомераКолонок = НомераКолонокГорячихКлавиш();
	СтрокаЭлемента = СтрокаРаздела.ПолучитьЭлементы().Добавить();
	Если СтрокаНастройки = Неопределено Тогда
		СтрокаЭлемента.Клавиша
			= Макет.Область(НомерСтрокиМакета, НомераКолонок.Клавиша, НомерСтрокиМакета, НомераКолонок.Клавиша).Текст;
		СтрокаЭлемента.АкселераторAlt
			= Булево(Макет.Область(НомерСтрокиМакета, НомераКолонок.Alt, НомерСтрокиМакета, НомераКолонок.Alt).Текст);
		СтрокаЭлемента.АкселераторCtrl
			= Булево(Макет.Область(НомерСтрокиМакета, НомераКолонок.Ctrl, НомерСтрокиМакета, НомераКолонок.Ctrl).Текст);
		СтрокаЭлемента.АкселераторShift
			= Булево(Макет.Область(НомерСтрокиМакета, НомераКолонок.Shift, НомерСтрокиМакета, НомераКолонок.Shift).Текст);
	Иначе
		ЗаполнитьЗначенияСвойств(СтрокаЭлемента, СтрокаНастройки);
	КонецЕсли;
	ТипКоманды
		= Макет.Область(НомерСтрокиМакета, НомераКолонок.ТипКоманды, НомерСтрокиМакета, НомераКолонок.ТипКоманды).Текст;
	Если ТипКоманды = "КнопкаФормы" Тогда
		Если ЕстьИзмененныеНастройкиЭлементаФормы(ИмяЭлемента) Тогда
			ДанныеДляОтображенияЭлементов.СброситьНастройкиСвойствЭлементов_Доступность = Истина;
			СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиИзменены;
		Иначе
			СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	СтрокаЭлемента.Действие
			= Макет.Область(НомерСтрокиМакета, НомераКолонок.Действие, НомерСтрокиМакета, НомераКолонок.Действие).Текст;
	СтрокаЭлемента.НомерСтроки = НомерСтрокиМакета - 1;
	СтрокаЭлемента.ИмяЭлемента = ИмяЭлемента;
	СтрокаЭлемента.СостояниеНастроек = СостояниеНастроек;
	ПустаяКлавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	Если СтрокаЭлемента.АкселераторAlt
		Или СтрокаЭлемента.АкселераторCtrl
		Или СтрокаЭлемента.АкселераторShift
		Или НЕ СтрокаЭлемента.Клавиша = ПустаяКлавиша Тогда
		СтрокаЭлемента.КлавишаУстановлена = Истина;
	Иначе
		СтрокаЭлемента.КлавишаУстановлена = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьИмяЭлементаРаздела(ИмяРаздела)
	
	ЭлементыРазделов = Новый Соответствие();
	ЭлементыРазделов.Вставить(НСтр("ru = 'Меню Режим'"), "КомандаРежим");
	ЭлементыРазделов.Вставить(НСтр("ru = 'Меню Еще'"), "КомандаЕще");
	
	ИмяЭлементаРаздела = ЭлементыРазделов.Получить(ИмяРаздела);
	Возврат ИмяЭлементаРаздела;
	
КонецФункции

&НаСервере
Функция ЕстьИзмененныеНастройкиЭлементаФормы(ИмяЭлемента)
	
	РезультатФункции = Ложь;
	
	ОтборСтрокНастроек = Новый Структура();
	ОтборСтрокНастроек.Вставить("ИмяЭлемента", ИмяЭлемента);
	СтрокиНастроек = НастройкиЭлементовФормыРМК.НайтиСтроки(ОтборСтрокНастроек);
	ИндексСтроки = 0;
	Пока ИндексСтроки < СтрокиНастроек.Количество() И Не РезультатФункции Цикл
		СтрокаНастройки = СтрокиНастроек[ИндексСтроки];
		Если Не СтрокаНастройки.ЗначениеСвойства = СтрокаНастройки.ЗначениеПоУмолчанию Тогда
			РезультатФункции = Истина;
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ПараметрыДляРедактированияЭлементаРМК(СтрокаДереваГорячихКлавиш)
	
	ЭтоТерминалСамообслуживания = НастройкиРМК.СценарийИспользования
		= ПредопределенноеЗначение("Перечисление.СценарииИспользованияРМК.ТерминалСамообслуживания");
	ИмяЭлемента = СтрокаДереваГорячихКлавиш.ИмяЭлемента;
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ЗаголовокОбъекта", СтрокаДереваГорячихКлавиш.Действие);
	РезультатФункции.Вставить("ИмяЭлемента", ИмяЭлемента);
	РезультатФункции.Вставить("ТипОбъекта", Тип("КнопкаФормы"));
	ОтборСтрокНастроек = Новый Структура();
	ОтборСтрокНастроек.Вставить("ИмяЭлемента", ИмяЭлемента);
	СтрокиНастроек = НастройкиЭлементовФормыРМК.НайтиСтроки(ОтборСтрокНастроек);
	СоответствиеНастроек = Новый Соответствие;
	ИмяКнопкиДробногоКоличества = "ТекущийТоварУстановитьДробноеКоличество";
	ИмяКнопкиВводаДанныхПокупателя = "ВвестиДанныеПокупателя";
	СвойствоВысотаКнопки = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ВысотаКнопок");
	ЭлементыПанелиОпераций = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЭлементыОбластиПанельОпераций();
	
	Если Не ЭлементыПанелиОпераций.Найти(ИмяЭлемента) = Неопределено Тогда
		ЗначенияНастроекПоУмолчанию = ЗначенияНастроекЭлементовПоУмолчанию.КнопкиПанелиОпераций;
	ИначеЕсли ЗначенияНастроекЭлементовПоУмолчанию.ИменаКвадратныхЭлементов.Найти(ИмяЭлемента) = Неопределено Тогда
		ЗначенияНастроекПоУмолчанию = ЗначенияНастроекЭлементовПоУмолчанию.Обычные;
	Иначе
		ЗначенияНастроекПоУмолчанию = ЗначенияНастроекЭлементовПоУмолчанию.Квадратные;
	КонецЕсли;
	
	ИндивидуальныеНастройкиПоУмолчанию = ЗначенияНастроекЭлементовПоУмолчанию.Индивидуальные.Получить(ИмяЭлемента);
	
	ДобавитьНастройкиЭлемента(СоответствиеНастроек, СтрокиНастроек, ЗначенияНастроекПоУмолчанию);
	Если Не ИндивидуальныеНастройкиПоУмолчанию = Неопределено Тогда
		ДобавитьНастройкиЭлемента(СоответствиеНастроек, СтрокиНастроек, ИндивидуальныеНастройкиПоУмолчанию);
	КонецЕсли;
	Если ИмяЭлемента = ИмяКнопкиДробногоКоличества
			И Не СоответствиеНастроек.Получить(СвойствоВысотаКнопки) = Неопределено Тогда
		
		СоответствиеНастроек.Удалить(СвойствоВысотаКнопки);
		
	КонецЕсли;
	
	Если ИмяЭлемента = ИмяКнопкиВводаДанныхПокупателя И ЭтоТерминалСамообслуживания Тогда	
		СвойствоШиринаКнопки = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ШиринаКнопок");
		Если Не СоответствиеНастроек.Получить(СвойствоШиринаКнопки) = Неопределено Тогда
			СоответствиеНастроек.Удалить(СвойствоШиринаКнопки);
		КонецЕсли;
		
		СвойствоЦветШрифта = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ЦветШрифта");
		Если Не СоответствиеНастроек.Получить(СвойствоЦветШрифта) = Неопределено Тогда
			СоответствиеНастроек.Удалить(СвойствоЦветШрифта);
		КонецЕсли;
		
		СвойствоШрифт = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ШрифтКнопок");
		Если Не СоответствиеНастроек.Получить(СвойствоШрифт) = Неопределено Тогда
			СоответствиеНастроек.Удалить(СвойствоШрифт);
		КонецЕсли;
	КонецЕсли;
	РезультатФункции.Вставить("Настройки", СоответствиеНастроек);
	
	Если ИмяЭлемента = ИмяКнопкиВводаДанныхПокупателя
			И ЭтоТерминалСамообслуживания Тогда
		
		РезультатФункции.Вставить("ИспользоватьНастройкиРазмера", Истина);
		
	КонецЕсли;
	
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ДобавитьНастройкиЭлемента(СоответствиеНастроек, СтрокиНастроек, ЗначенияНастроекПоУмолчанию)
	
	Для Каждого ДанныеНастройки Из ЗначенияНастроекПоУмолчанию Цикл
		СтрокаНастроекЭлементов = ПолучитьСтрокуНастройкиЭлементаФормыРМК(СтрокиНастроек, ДанныеНастройки.СвойствоЭлементов);
		ЗначенияНастройки = Новый Структура();
		Если СтрокаНастроекЭлементов = Неопределено Тогда
			ЗначенияНастройки.Вставить("ЗначениеСвойства", ДанныеНастройки.ЗначениеСвойства);
		Иначе
			ЗначенияНастройки.Вставить("ЗначениеСвойства", СтрокаНастроекЭлементов.ЗначениеСвойства);
		КонецЕсли;
		ЗначенияНастройки.Вставить("ЗначениеПоУмолчанию", ДанныеНастройки.ЗначениеСвойства);
		СоответствиеНастроек.Вставить(ДанныеНастройки.СвойствоЭлементов, ЗначенияНастройки);
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуНастройкиЭлементаФормыРМК(СтрокиНастроек, СвойствоЭлементов)
	
	РезультатФункции = Неопределено;
	
	КоличествоНастроек = СтрокиНастроек.Количество();
	ИндексНастройки = 0;
	Пока ИндексНастройки < КоличествоНастроек И РезультатФункции = Неопределено Цикл
		ТекущаяСтрокаНастройки = СтрокиНастроек.Получить(ИндексНастройки);
		Если ТекущаяСтрокаНастройки.СвойствоЭлементов = СвойствоЭлементов Тогда
			РезультатФункции = ТекущаяСтрокаНастройки;
		КонецЕсли;
		ИндексНастройки = ИндексНастройки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНастройкуЭлементаФормы(СтрокиНастроекЭлементов, ДанныеНастройки, ПараметрыОбновления)
	
	СтрокаНастройкиЭлемента = ПолучитьСтрокуНастройкиЭлементаФормыРМК(СтрокиНастроекЭлементов, ДанныеНастройки.Ключ);
	ЗначениеПоУмолчанию = ПолучитьЗначениеПоУмолчаниюНастройкиЭлемента(ПараметрыОбновления.ИмяЭлемента,
		ДанныеНастройки.Ключ);
	Если Не ДанныеНастройки.Значение = ЗначениеПоУмолчанию Тогда
		Если СтрокаНастройкиЭлемента = Неопределено Тогда
			СтрокаНастройкиЭлемента = НастройкиЭлементовФормыРМК.Добавить();
			СтрокаНастройкиЭлемента.ИмяЭлемента = ПараметрыОбновления.ИмяЭлемента;
			СтрокаНастройкиЭлемента.СвойствоЭлементов = ДанныеНастройки.Ключ;
			СтрокаНастройкиЭлемента.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
			СтрокаНастройкиЭлемента.ЗначениеСвойства = ДанныеНастройки.Значение;
		Иначе
			СтрокаНастройкиЭлемента.ЗначениеСвойства = ДанныеНастройки.Значение;
		КонецЕсли;
		ПараметрыОбновления.СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиИзменены;
		ПараметрыОбновления.ВключитьКнопкуСброса = Истина;
	ИначеЕсли Не СтрокаНастройкиЭлемента = Неопределено Тогда
		НастройкиЭлементовФормыРМК.Удалить(СтрокаНастройкиЭлемента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьДоступностьКнопкиСбросаНастроекЭлементов(ВключитьДоступность = Ложь)

	Если ВключитьДоступность Тогда
		ДанныеДляОтображенияЭлементов.СброситьНастройкиСвойствЭлементов_Доступность = Истина;
	Иначе
		ДанныеДляОтображенияЭлементов.СброситьНастройкиСвойствЭлементов_Доступность
			= ЕстьПерсонализированныеНастройкиЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтображениеФормыНастроек(ФормаНастроек, ОбновляемыеЭлементы = Неопределено)

	ЭлементыФормы = ФормаНастроек.Элементы;
	СвойстваЭлементов = ФормаНастроек.ДанныеДляОтображенияЭлементов;
	
	Если ОбновляемыеЭлементы = Неопределено
			Или Не ОбновляемыеЭлементы.Найти(ЭлементыФормы.СброситьНастройкиСвойствЭлементов) = Неопределено Тогда
			
		ЭлементыФормы.СброситьНастройкиСвойствЭлементов.Доступность
			= СвойстваЭлементов.СброситьНастройкиСвойствЭлементов_Доступность;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьСмещенныеОбласти(СтрокиУровня)
	
	РезультатФункции = Ложь;
	
	КоличествоСтрок = СтрокиУровня.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И Не РезультатФункции Цикл
		СтрокаБлока = СтрокиУровня[ИндексСтроки];
		Если СтрокиУровня.Индекс(СтрокаБлока) = СтрокаБлока.ИсходныйПорядок - 1 Тогда
			РезультатФункции = ЕстьСмещенныеОбласти(СтрокаБлока.ПолучитьЭлементы());
		Иначе
			РезультатФункции = Истина;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗначениеПоУмолчаниюНастройкиЭлемента(ИмяЭлемента, СвойствоЭлементов)
	
	РезультатФункции = Неопределено;
	
	ИндексСвойства = 0;
	Пока ИндексСвойства < ЗначенияНастроекЭлементовПоУмолчанию.Обычные.Количество()
			И РезультатФункции = Неопределено Цикл
		НастройкаПоУмолчанию = ЗначенияНастроекЭлементовПоУмолчанию.Обычные.Получить(ИндексСвойства);
		Если НастройкаПоУмолчанию.СвойствоЭлементов = СвойствоЭлементов Тогда
			РезультатФункции = НастройкаПоУмолчанию.ЗначениеСвойства;
		КонецЕсли;
		ИндексСвойства = ИндексСвойства + 1;
	КонецЦикла;
	Если РезультатФункции = Неопределено Тогда
		ИндивидуальныеНастройкиПоУмолчанию = ЗначенияНастроекЭлементовПоУмолчанию.Индивидуальные.Получить(ИмяЭлемента);
		ИндексСвойства = 0;
		Пока ИндексСвойства < ИндивидуальныеНастройкиПоУмолчанию.Количество() И РезультатФункции = Неопределено Цикл
			ЭлементСвойства = ИндивидуальныеНастройкиПоУмолчанию.Получить(ИндексСвойства);
			Если ЭлементСвойства.СвойствоЭлементов = СвойствоЭлементов Тогда
				РезультатФункции = ЭлементСвойства.ЗначениеСвойства;
			КонецЕсли;
			ИндексСвойства = ИндексСвойства + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ЕстьПерсонализированныеНастройкиЭлементов()
	
	РезультатФункции = Ложь;

	СтрокиГрупп = ДеревоГорячиеКлавиши.ПолучитьЭлементы();
	ИндексГруппы = 0;
	Пока ИндексГруппы < СтрокиГрупп.Количество() И Не РезультатФункции Цикл
		СтрокаГруппы = СтрокиГрупп[ИндексГруппы];
		СтрокиКлавиш = СтрокаГруппы.ПолучитьЭлементы();
		ИндексКлавиши = 0;
		Пока ИндексКлавиши < СтрокиКлавиш.Количество() И Не РезультатФункции Цикл
			СтрокаКлавиши = СтрокиКлавиш[ИндексКлавиши];
			Если СтрокаКлавиши.СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиИзменены Тогда
				РезультатФункции = Истина;
			КонецЕсли;
			
			ИндексКлавиши = ИндексКлавиши + 1;
		КонецЦикла;
		ИндексГруппы = ИндексГруппы + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ДеревоГорячиеКлавишиПриАктивизацииСтрокиКлиент()
	ОбработатьСходСоСтрокиГорячейКлавиши();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСходСоСтрокиГорячейКлавиши(СменаСтраницы = Ложь)
	
	ТипНарушенияЗапрещеннаяКомбинация = "ЗапрещеннаяКомбинация";
	ТекущиеДанныеГорячейКлавиши = Неопределено;
	Если Не ТекущаяСтрокаГорячейКлавиши = Неопределено Тогда
		ТекущиеДанныеГорячейКлавиши = ДеревоГорячиеКлавиши.НайтиПоИдентификатору(ТекущаяСтрокаГорячейКлавиши);
	КонецЕсли;
	Если СменаСтраницы Тогда
		Если (Не ТекущиеДанныеГорячейКлавиши = Неопределено)
				И СтрНайти(ТекущиеДанныеГорячейКлавиши.ТипНарушения, ТипНарушенияЗапрещеннаяКомбинация) > 0 Тогда
			Элементы.СтраницыНастройкиРМК.ТекущаяСтраница = Элементы.СтраницаГорячиеКлавиши;
			ТекстПредупреждения
				= СформироватьПредупреждениеЗапретКомбинацииДляСтрокиГорячейКлавиши(ТекущиеДанныеГорячейКлавиши);
			ПоказатьПредупреждение(, ТекстПредупреждения);
		Иначе
			ТекущаяСтрокаГорячейКлавиши = Неопределено;
		КонецЕсли;
	ИначеЕсли Не ТекущаяСтрокаГорячейКлавиши = Элементы.ДеревоГорячиеКлавиши.ТекущаяСтрока Тогда
		
		Если (Не ТекущиеДанныеГорячейКлавиши = Неопределено)
				И СтрНайти(ТекущиеДанныеГорячейКлавиши.ТипНарушения, ТипНарушенияЗапрещеннаяКомбинация) > 0 Тогда
			ТекстПредупреждения
				= СформироватьПредупреждениеЗапретКомбинацииДляСтрокиГорячейКлавиши(ТекущиеДанныеГорячейКлавиши);
			ОписаниеЗавершенияПредупреждения = Новый ОписаниеОповещения("ОбработатьСходСоСтрокиГорячейКлавишиЗавершение",
				ЭтотОбъект, ТекущаяСтрокаГорячейКлавиши);
			ПоказатьПредупреждение(ОписаниеЗавершенияПредупреждения, ТекстПредупреждения);
		Иначе
			ТекущаяСтрокаГорячейКлавиши = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройкиСвойствЭлементовКлиент()
	
	ОповещениеСброса = Новый ОписаниеОповещения("ВопросСбросНастроекСвойствЭлементовЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Настройки кнопок будут сброшены. Продолжить?'");
	ПоказатьВопрос(ОповещениеСброса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьИзмененныеСостоянияНастроек(СтрокиУровня)
	
	Для Каждого СтрокаОбласти Из СтрокиУровня Цикл
		Если СтрокаОбласти.СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиИзменены Тогда
			СтрокаОбласти.СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиПоУмолчанию;
		КонецЕсли;
		УбратьИзмененныеСостоянияНастроек(СтрокаОбласти.ПолучитьЭлементы())
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодсказкуТаблицыГорячихКлавиш(ТекущаяНастройкаРМК)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИмяКнопки", "ОткрытьПанельИзбранныхТоваров");
	МассивСтрок = ТекущаяНастройкаРМК.ГорячиеКлавиши.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаГорячихКлавишИзбранного = МассивСтрок[0];
	
	Если (НЕ СтрокаГорячихКлавишИзбранного = Неопределено)
		И (СтрокаГорячихКлавишИзбранного.АкселераторAlt 
			ИЛИ СтрокаГорячихКлавишИзбранного.АкселераторCtrl
			ИЛИ СтрокаГорячихКлавишИзбранного.АкселераторShift)
		И НЕ ПустаяСтрока(СтрокаГорячихКлавишИзбранного.Клавиша) Тогда
		
		СоставляющаяCtrl = ?(СтрокаГорячихКлавишИзбранного.АкселераторCtrl, "Ctrl +", "");
		СоставляющаяAlt = ?(СтрокаГорячихКлавишИзбранного.АкселераторAlt, "Alt +", "");
		СоставляющаяShift = ?(СтрокаГорячихКлавишИзбранного.АкселераторShift, "Shift +", "");
		
		КомбинацияГорячихКлавишСтрокой = СтрШаблон("%1%2%3", СоставляющаяCtrl, СоставляющаяAlt, СоставляющаяShift);
		ТекстПодсказки = СтрШаблон(ШаблонТекстКомбинации(), КомбинацияГорячихКлавишСтрокой);
		Элементы.НастройкиРМКСтруктураБыстрыхТоваров.РасширеннаяПодсказка.Заголовок = ТекстПодсказки;
		Элементы.НастройкиРМКСтруктураБыстрыхТоваров.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		
	Иначе
		Элементы.НастройкиРМКСтруктураБыстрыхТоваров.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодсказкуИзбранногоГорячихКлавиш(АкселераторыОткрытияИзбранных)
	
	ТекстБыстрыеТовары = НСтр("ru = 'Быстрые товары'");
	ТекстНомерТовара = НСтр("ru = 'Номер карточки'");
	Если (АкселераторыОткрытияИзбранных.Ctrl Или АкселераторыОткрытияИзбранных.Alt
			Или АкселераторыОткрытияИзбранных.Shift) Тогда
		СоставляющаяCtrl = ?(АкселераторыОткрытияИзбранных.Ctrl, "Ctrl +", "");
		СоставляющаяAlt = ?(АкселераторыОткрытияИзбранных.Alt, "Alt +", "");
		СоставляющаяShift = ?(АкселераторыОткрытияИзбранных.Shift, "Shift +", "");
		
		КомбинацияГорячихКлавишСтрокой = СтрШаблон("%1%2%3", СоставляющаяCtrl, СоставляющаяAlt, СоставляющаяShift);
		ТекстПодсказки = СтрШаблон(ШаблонТекстКомбинации(), КомбинацияГорячихКлавишСтрокой);
		Элементы.НастройкиРМКСтруктураБыстрыхТоваров.РасширеннаяПодсказка.Заголовок = ТекстПодсказки;
		Элементы.НастройкиРМКСтруктураБыстрыхТоваров.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		ТекстБыстрыеТовары = СтрШаблон("%1 (%2 %3)", ТекстБыстрыеТовары, КомбинацияГорячихКлавишСтрокой, ТекстНомерТовара);
	Иначе
		Элементы.НастройкиРМКСтруктураБыстрыхТоваров.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	Элементы.ДекорацияБыстрыеТовары.Заголовок = ТекстБыстрыеТовары;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонТекстКомбинации()
	
	Возврат НСтр("ru = 'Комбинация горячих клавиш для товара определяется как %1 порядковый номер карточки.
		|Для кнопок назад и вперед используются комбинации %1 9 и %1 0.'");
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНекорректныеКомбинацииГорячихКлавиш()
	
	ТипНарушенияЗапрещеннаяКомбинация = "ЗапрещеннаяКомбинация";
	ДанныеГорячихКлавиш = ПодготовитьДанныеДляПроверкиГорячихКлавиш();
	ДанныеНекорректныхКомбинаций = ПолучитьОписаниеНекорректныхКомбинацийГорячихКлавиш(ДанныеГорячихКлавиш);
	АкселераторыОткрытияИзбранных = ДанныеГорячихКлавиш.АкселераторыОткрытияПанелиИзбранных;
	
	ОтклоненияГорячихКлавиш = Новый Структура();
	ОтклоненияГорячихКлавиш.Вставить("ЕстьДублиГорячихКлавиш", Ложь);
	ОтклоненияГорячихКлавиш.Вставить("ЕстьДублиГорячихКлавишКупюр", Ложь);
	ОтклоненияГорячихКлавиш.Вставить("ЕстьЗапрещенныеКомбинацииГорячихКлавиш", Ложь);
	ОтклоненияГорячихКлавиш.Вставить("ЕстьЗапрещенныеКомбинацииГорячихКлавишКупюр", Ложь);
	
	Для Каждого СтрокаГруппы Из ДеревоГорячиеКлавиши.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаДерева Из СтрокаГруппы.ПолучитьЭлементы() Цикл
			НекорректнаяКомбинация = ПолучитьНекорректнуюКомбинациюПоНомеруСтроки(ДанныеНекорректныхКомбинаций,
				СтрокаДерева.НомерСтроки);
			Если НекорректнаяКомбинация = Неопределено Тогда
				СтрокаДерева.ТипНарушения = "";
			Иначе
				СтрокаДерева.ТипНарушения = НекорректнаяКомбинация.ТипНарушения;
				Если НекорректнаяКомбинация.ТипНарушения = ТипНарушенияЗапрещеннаяКомбинация Тогда
					ОтклоненияГорячихКлавиш.ЕстьЗапрещенныеКомбинацииГорячихКлавиш = Истина;
				Иначе
					ОтклоненияГорячихКлавиш.ЕстьДублиГорячихКлавиш = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если НастройкиРМК.ИспользоватьПанельВводаНаличныхКупюр Тогда
		Для Каждого СтрокаКупюры Из НастройкиРМК.ВводНаличных Цикл
			НекорректнаяКомбинация = ПолучитьНекорректнуюКомбинациюПоНоминалу(ДанныеНекорректныхКомбинаций,
				СтрокаКупюры.Номинал);
			Если НекорректнаяКомбинация = Неопределено Тогда
				СтрокаКупюры.ТипНарушения = "";
			Иначе
				СтрокаКупюры.ТипНарушения = НекорректнаяКомбинация.ТипНарушения;
				Если НекорректнаяКомбинация.ТипНарушения = ТипНарушенияЗапрещеннаяКомбинация Тогда
					ОтклоненияГорячихКлавиш.ЕстьЗапрещенныеКомбинацииГорячихКлавишКупюр = Истина;
				Иначе
					ОтклоненияГорячихКлавиш.ЕстьДублиГорячихКлавишКупюр = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	НастроитьВидимостьИнформацииОНекорректныхКомбинацияхГорячихКлавиш(ОтклоненияГорячихКлавиш);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонАкселераторовГорячихКлавиш()
	
	Возврат Новый Структура("Alt,Ctrl,Shift", Ложь, Ложь, Ложь);
	
КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеДляПроверкиГорячихКлавиш()
	
	РезультатФункции = Новый Структура;
	
	ПустаяКлавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	МаксимальныйНомерСтроки = 0;
	
	АкселераторыОткрытияПанелиИзбранных = ШаблонАкселераторовГорячихКлавиш();
	ОсновныеГорячиеКлавиши = ПодготовитьОсновныеГорячиеКлавиши(АкселераторыОткрытияПанелиИзбранных, ПустаяКлавиша,
		МаксимальныйНомерСтроки);
	
	ГорячиеКлавишиКупюр = Новый Массив;
	Если НастройкиРМК.ИспользоватьПанельВводаНаличныхКупюр Тогда
		Для Каждого СтрокаКупюры Из НастройкиРМК.ВводНаличных Цикл
			Если Не (СтрокаКупюры.Клавиша = ПустаяКлавиша Или ПустаяСтрока(СтрокаКупюры.Клавиша)) Тогда
				
				ДобавитьОписаниеГорячейКлавишиКупюры(ГорячиеКлавишиКупюр, СтрокаКупюры);
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РезультатФункции.Вставить("ОсновныеГорячиеКлавиши", ОсновныеГорячиеКлавиши);
	РезультатФункции.Вставить("ГорячиеКлавишиКупюр", ГорячиеКлавишиКупюр);
	РезультатФункции.Вставить("АкселераторыОткрытияПанелиИзбранных", АкселераторыОткрытияПанелиИзбранных);
	РезультатФункции.Вставить("МаксимальныйНомерСтроки", МаксимальныйНомерСтроки);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОписаниеНекорректныхКомбинацийГорячихКлавиш(Знач ДанныеГорячихКлавиш)
	
	ТаблицыГорячихКлавиш = ПодготовитьТаблицыГорячихКлавиш(ДанныеГорячихКлавиш);
	ТаблицаСтрокНекорректныхКомбинаций
		= Справочники.НастройкиРабочегоМестаКассира.ПолучитьСтрокиНекорректныхКомбинацийГорячихклавиш(ТаблицыГорячихКлавиш);
		
	НекорректныеКомбинации = Новый Массив;
	Для Каждого СтрокаНекорректнойКомбинации Из ТаблицаСтрокНекорректныхКомбинаций Цикл
		
		ДанныеНекорректнойКомбинации = Новый Структура();
		ДанныеНекорректнойКомбинации.Вставить("ТипНарушения", СтрокаНекорректнойКомбинации.ТипНарушения);
		ДанныеНекорректнойКомбинации.Вставить("НомерСтроки", СтрокаНекорректнойКомбинации.НомерСтроки);
		ДанныеНекорректнойКомбинации.Вставить("Номинал", СтрокаНекорректнойКомбинации.Номинал);
		
		НекорректныеКомбинации.Добавить(ДанныеНекорректнойКомбинации);
		
	КонецЦикла;
	Возврат НекорректныеКомбинации;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодготовитьТаблицыГорячихКлавиш(ДанныеГорячихКлавиш)
	
	ОсновныеГорячиеКлавиши = Справочники.НастройкиРабочегоМестаКассира.ПолучитьШаблонТаблицыГорячихКлавиш();
	ГорячиеКлавишиКупюр = Справочники.НастройкиРабочегоМестаКассира.ПолучитьШаблонТаблицыГорячихКлавишКупюр();
	ГорячиеКлавишиИзбранное = Справочники.НастройкиРабочегоМестаКассира.ПолучитьШаблонТаблицыГорячихКлавиш();
	
	Для Каждого СтруктураГорячаяКлавиша Из ДанныеГорячихКлавиш.ОсновныеГорячиеКлавиши Цикл
		НоваяСтрока = ОсновныеГорячиеКлавиши.Добавить();
		НоваяСтрока.НомерСтроки = СтруктураГорячаяКлавиша.НомерСтроки;
		НоваяСтрока.ИмяКнопки = СтруктураГорячаяКлавиша.ИмяКнопки;
		НоваяСтрока.ЗаголовокКнопки = СтруктураГорячаяКлавиша.ЗаголовокКнопки;
		НоваяСтрока.Клавиша = СтруктураГорячаяКлавиша.Клавиша;
		НоваяСтрока.АкселераторAlt = СтруктураГорячаяКлавиша.АкселераторAlt;
		НоваяСтрока.АкселераторCtrl = СтруктураГорячаяКлавиша.АкселераторCtrl;
		НоваяСтрока.АкселераторShift = СтруктураГорячаяКлавиша.АкселераторShift;
	КонецЦикла;
	
	Для Каждого СтруктураКлавишаКупюры Из ДанныеГорячихКлавиш.ГорячиеКлавишиКупюр Цикл
		НоваяСтрока = ГорячиеКлавишиКупюр.Добавить();
		НоваяСтрока.Номинал = СтруктураКлавишаКупюры.Номинал;
		НоваяСтрока.Клавиша = СтруктураКлавишаКупюры.Клавиша;
		НоваяСтрока.АкселераторAlt = СтруктураКлавишаКупюры.АкселераторAlt;
		НоваяСтрока.АкселераторCtrl = СтруктураКлавишаКупюры.АкселераторCtrl;
		НоваяСтрока.АкселераторShift = СтруктураКлавишаКупюры.АкселераторShift;
	КонецЦикла;
	
	АкселераторыИзбранныхТоваров = ДанныеГорячихКлавиш.АкселераторыОткрытияПанелиИзбранных;
	Если АкселераторыИзбранныхТоваров.Alt
		Или АкселераторыИзбранныхТоваров.Ctrl
		Или АкселераторыИзбранныхТоваров.Shift Тогда
		
		ПозицияСтроки = ДанныеГорячихКлавиш.МаксимальныйНомерСтроки + 1;
		НомерПП = 0;
		Пока НомерПП < 10 Цикл
			НоваяСтрока = ГорячиеКлавишиИзбранное.Добавить();
			НоваяСтрока.НомерСтроки = ПозицияСтроки + НомерПП;
			НоваяСтрока.ЗаголовокКнопки = СтрШаблон(НСтр("ru = 'ИзбранныйТовар%1'"), НомерПП);
			НоваяСтрока.ИмяКнопки = НоваяСтрока.ЗаголовокКнопки;
			НоваяСтрока.Клавиша = СтрШаблон("_%1", НомерПП);
			НоваяСтрока.АкселераторAlt = АкселераторыИзбранныхТоваров.Alt;
			НоваяСтрока.АкселераторCtrl = АкселераторыИзбранныхТоваров.Ctrl;
			НоваяСтрока.АкселераторShift = АкселераторыИзбранныхТоваров.Shift;
			
			НомерПП = НомерПП + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ОсновныеГорячиеКлавиши", ОсновныеГорячиеКлавиши);
	РезультатФункции.Вставить("ГорячиеКлавишиКупюр", ГорячиеКлавишиКупюр);
	РезультатФункции.Вставить("ГорячиеКлавишиИзбранное", ГорячиеКлавишиИзбранное);
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ПолучитьНекорректнуюКомбинациюПоНомеруСтроки(ДанныеНекорректныхКомбинаций, НомерСтроки)
	
	Возврат ПолучитьНекорректнуюКомбинациюПоЗначениюКолонки(ДанныеНекорректныхКомбинаций, "НомерСтроки", НомерСтроки);
	
КонецФункции

&НаКлиенте
Процедура НастроитьВидимостьИнформацииОНекорректныхКомбинацияхГорячихКлавиш(ОтклоненияГорячихКлавиш)
	
	Если ОтклоненияГорячихКлавиш.ЕстьДублиГорячихКлавиш
			Или ОтклоненияГорячихКлавиш.ЕстьЗапрещенныеКомбинацииГорячихКлавиш Тогда
		Элементы.СтраницыРасшифровкаОшибокГорячихКлавиш.ТекущаяСтраница = Элементы.СтраницаРасшифровкиОшибок;
	Иначе
		Элементы.СтраницыРасшифровкаОшибокГорячихКлавиш.ТекущаяСтраница = Элементы.СтраницаБезРасшифровки;
	КонецЕсли;
	
	Если ОтклоненияГорячихКлавиш.ЕстьДублиГорячихКлавишКупюр
			Или ОтклоненияГорячихКлавиш.ЕстьЗапрещенныеКомбинацииГорячихКлавишКупюр Тогда
		Элементы.СтраницыРасшифровкаОшибокГорячихКлавишКупюр.ТекущаяСтраница = Элементы.СтраницаРасшифровкиОшибокКупюр;
	Иначе
		Элементы.СтраницыРасшифровкаОшибокГорячихКлавишКупюр.ТекущаяСтраница = Элементы.СтраницаБезРасшифровкиКупюр;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНекорректнуюКомбинациюПоЗначениюКолонки(ДанныеНекорректныхКомбинаций, ИмяКолонки, ЗначениеКолонки)
	
	РезультатФункции = Неопределено;
	
	КоличествоКомбинаций = ДанныеНекорректныхКомбинаций.Количество();
	ИндексКомбинации = 0;
	Пока ИндексКомбинации < КоличествоКомбинаций И РезультатФункции = Неопределено Цикл
		Комбинация = ДанныеНекорректныхКомбинаций[ИндексКомбинации];
		ЗначениеКомбинации = Неопределено;
		Комбинация.Свойство(ИмяКолонки, ЗначениеКомбинации);
		Если ЗначениеКомбинации = ЗначениеКолонки Тогда
			РезультатФункции = Комбинация;
		КонецЕсли;
		ИндексКомбинации = ИндексКомбинации + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ПодготовитьОсновныеГорячиеКлавиши(АкселераторыОткрытияПанелиИзбранных, ПустаяКлавиша, МаксимальныйНомерСтроки)
	
	ОсновныеГорячиеКлавиши = Новый Массив;
	Для Каждого СтрокаГруппы Из ДеревоГорячиеКлавиши.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаГорячаяКлавиша Из СтрокаГруппы.ПолучитьЭлементы() Цикл
			Если Не (СтрокаГорячаяКлавиша.Клавиша = ПустаяКлавиша Или ПустаяСтрока(СтрокаГорячаяКлавиша.Клавиша)) Тогда
				
				ДобавитьОписаниеОсновнойГорячейКлавиши(ОсновныеГорячиеКлавиши, СтрокаГорячаяКлавиша,
					АкселераторыОткрытияПанелиИзбранных);
				
			КонецЕсли;
			Если СтрокаГорячаяКлавиша.НомерСтроки > МаксимальныйНомерСтроки Тогда
				МаксимальныйНомерСтроки = СтрокаГорячаяКлавиша.НомерСтроки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат ОсновныеГорячиеКлавиши;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьОписаниеОсновнойГорячейКлавиши(ОсновныеГорячиеКлавиши, СтрокаГорячаяКлавиша,
		АкселераторыОткрытияПанелиИзбранных)
	
	ИмяЭлементаПанельИзбранных = "ОткрытьПанельИзбранныхТоваров";
	ОписаниеСтроки = Новый Структура();
	ОписаниеСтроки.Вставить("НомерСтроки", СтрокаГорячаяКлавиша.НомерСтроки);
	ОписаниеСтроки.Вставить("ИмяКнопки", СтрокаГорячаяКлавиша.ИмяЭлемента);
	ОписаниеСтроки.Вставить("ЗаголовокКнопки", СтрокаГорячаяКлавиша.Действие);
	ОписаниеСтроки.Вставить("Клавиша", СтрокаГорячаяКлавиша.Клавиша);
	ОписаниеСтроки.Вставить("АкселераторAlt", СтрокаГорячаяКлавиша.АкселераторAlt);
	ОписаниеСтроки.Вставить("АкселераторCtrl", СтрокаГорячаяКлавиша.АкселераторCtrl);
	ОписаниеСтроки.Вставить("АкселераторShift", СтрокаГорячаяКлавиша.АкселераторShift);
	ОсновныеГорячиеКлавиши.Добавить(ОписаниеСтроки);
	
	Если СтрокаГорячаяКлавиша.ИмяЭлемента = ИмяЭлементаПанельИзбранных Тогда
		ЗаполнитьАкселераторыПанелиИзбранныхТоваров(АкселераторыОткрытияПанелиИзбранных, СтрокаГорячаяКлавиша);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАкселераторыПанелиИзбранныхТоваров(АкселераторыОткрытияПанелиИзбранных, СтрокаГорячаяКлавиша)
	
	АкселераторыОткрытияПанелиИзбранных.Alt = СтрокаГорячаяКлавиша.АкселераторAlt;
	АкселераторыОткрытияПанелиИзбранных.Ctrl = СтрокаГорячаяКлавиша.АкселераторCtrl;
	АкселераторыОткрытияПанелиИзбранных.Shift = СтрокаГорячаяКлавиша.АкселераторShift;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГорячиеКлавишиАкселераторAltПриИзмененииКлиент()
	ПроверитьНекорректныеКомбинацииГорячихКлавиш();
	ТекущаяСтрокаГорячейКлавиши = Элементы.ДеревоГорячиеКлавиши.ТекущаяСтрока;
	УстановитьЗаполнениеКлавиш();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГорячиеКлавишиАкселераторCtrlПриИзмененииКлиент()
	ПроверитьНекорректныеКомбинацииГорячихКлавиш();
	ТекущаяСтрокаГорячейКлавиши = Элементы.ДеревоГорячиеКлавиши.ТекущаяСтрока;
	УстановитьЗаполнениеКлавиш();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГорячиеКлавишиАкселераторShiftПриИзмененииКлиент()
	ПроверитьНекорректныеКомбинацииГорячихКлавиш();
	ТекущаяСтрокаГорячейКлавиши = Элементы.ДеревоГорячиеКлавиши.ТекущаяСтрока;
	УстановитьЗаполнениеКлавиш();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСерверныеДействияДляКлиента()
	
	ПараметрыНастройки = Новый Структура();
	ПараметрыНастройки.Вставить("Палитра", НастройкиРМК.СтруктураПлиточногоИнтерфейсаПодбора);
	ПараметрыНастройки.Вставить("ЭтоГоризонтальнаяОриентация", Не НастройкиРМК.ВертикальнаяОриентация);
	ЭтоТерминалСамообслуживания = НастройкиРМК.СценарийИспользования = ПредопределенноеЗначение("Перечисление.СценарииИспользованияРМК.ТерминалСамообслуживания");
	ПараметрыНастройки.Вставить("ЭтоТерминалСамообслуживания", ЭтоТерминалСамообслуживания);
	ДополнительныеДанные = ВыполнитьДействияИПолучитьДанныеДляКлиента(ПараметрыНастройки);
	ЗначенияНастроекЭлементовПоУмолчанию = ДополнительныеДанные.ЗначенияНастроекЭлементовПоУмолчанию;
	РеквизитыПалитры = ДополнительныеДанные.ДанныеРазмеров;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьДействияИПолучитьДанныеДляКлиента(ПараметрыНастройки)
	
	ДополнительныеДанные = Новый Структура();
	
	НастройкиЭлементовПоУмолчанию = Новый Структура();
	
	ДанныеНастроекОбычныхЭлементов = СформироватьСтруктуруПервоначальныхНастроекЭлементов(Ложь);
	ДанныеНастроекКвадратныхЭлементов = СформироватьСтруктуруПервоначальныхНастроекЭлементов(Истина);
	ДанныеИндивидуальныхНастроек = СформироватьСтруктуруПервоначальныхИндивидуальныхНастроек(ПараметрыНастройки.ЭтоТерминалСамообслуживания);
	ИменаКвадратныхЭлементов = ИнтерфейсРМКСлужебный.ПолучитьМассивИменКвадратныхКнопок();
	КнопкиПанелиОпераций = СформироватьСтруктуруПервоначальныхНастроекКнопокОпераций();
	
	НастройкиЭлементовПоУмолчанию.Вставить("Обычные", ДанныеНастроекОбычныхЭлементов);
	НастройкиЭлементовПоУмолчанию.Вставить("Квадратные", ДанныеНастроекКвадратныхЭлементов);
	НастройкиЭлементовПоУмолчанию.Вставить("Индивидуальные", ДанныеИндивидуальныхНастроек);
	НастройкиЭлементовПоУмолчанию.Вставить("ИменаКвадратныхЭлементов", ИменаКвадратныхЭлементов);
	НастройкиЭлементовПоУмолчанию.Вставить("КнопкиПанелиОпераций", КнопкиПанелиОпераций);
	ДополнительныеДанные.Вставить("ЗначенияНастроекЭлементовПоУмолчанию", НастройкиЭлементовПоУмолчанию);
	
	ДанныеРазмеров = ПолучитьРеквизитыПалитры(ПараметрыНастройки);
	ДополнительныеДанные.Вставить("ДанныеРазмеров", ДанныеРазмеров);
	
	Возврат ДополнительныеДанные;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьСтруктуруПервоначальныхНастроекПоТипу(ТипБлока = "", КвадратныеКнопки = Ложь)
	
	Перем НастройкиОбычныхЭлементовПоУмолчанию;
	
	ДанныеНастроекЭлементов = Новый Массив;
	
	Если ТипБлока = "ПанельОпераций" Тогда
		НастройкиОбычныхЭлементовПоУмолчанию
			= ИнтерфейсРМКСлужебный.ПолучитьПервоначальныеНастройкиЭлементовПанелиОперацииРМК();
	Иначе
		НастройкиОбычныхЭлементовПоУмолчанию
			= ИнтерфейсРМКСлужебный.ПолучитьПервоначальныеНастройкиЭлементовРМК(КвадратныеКнопки);
	КонецЕсли;
		
	Для Каждого СтрокаНастройкиЭлемента Из НастройкиОбычныхЭлементовПоУмолчанию Цикл
		СтрокаДанных = Новый Структура("СвойствоЭлементов,ЗначениеСвойства", Неопределено, Неопределено);
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаНастройкиЭлемента);
		ДанныеНастроекЭлементов.Добавить(СтрокаДанных);
	КонецЦикла;
	Возврат ДанныеНастроекЭлементов;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьСтруктуруПервоначальныхНастроекКнопокОпераций()
	
	Возврат СформироватьСтруктуруПервоначальныхНастроекПоТипу("ПанельОпераций");
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьСтруктуруПервоначальныхНастроекЭлементов(КвадратныеКнопки)
	
	Возврат СформироватьСтруктуруПервоначальныхНастроекПоТипу(, КвадратныеКнопки);
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьСтруктуруПервоначальныхИндивидуальныхНастроек(ЭтоТерминалСамообслуживания)
	
	ИндивидуальныеНастройки = Новый Соответствие();
	
	ТаблицаИндивидуальныхНастроек = ИнтерфейсРМКСлужебный.ПолучитьИндивидуальныеПервоначальныеНастройки("", ЭтоТерминалСамообслуживания);
	ИмяТекущегоЭлемента = "";
	МассивНастроек = Новый Массив;
	Для Каждого СтрокаИндивидуальнойНастройки Из ТаблицаИндивидуальныхНастроек Цикл
		
		Если Не СтрокаИндивидуальнойНастройки.ИмяЭлемента = ИмяТекущегоЭлемента Тогда
			
			ИмяТекущегоЭлемента = СтрокаИндивидуальнойНастройки.ИмяЭлемента;
			МассивНастроек = Новый Массив;
			ИндивидуальныеНастройки.Вставить(ИмяТекущегоЭлемента, МассивНастроек);
			
		КонецЕсли;
		СтрокаДанных = Новый Структура("СвойствоЭлементов,ЗначениеСвойства", Неопределено, Неопределено);
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаИндивидуальнойНастройки);
		МассивНастроек.Добавить(СтрокаДанных);
		
	КонецЦикла;
	
	Возврат ИндивидуальныеНастройки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыПалитры(ПараметрыНастройки)
	
	ИменаРеквизитовЭлемента = "КоличествоЭлементовВРяду,КоличествоРядов";
	ИменаСвойств = "КоличествоЭлементовВРяду,КоличествоРядовНаСтранице";
	РазмерыПалитры = Новый Структура(ИменаСвойств, 0, 0);
	
	Если ЗначениеЗаполнено(ПараметрыНастройки.Палитра) Тогда
		ДанныеПалитры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыНастройки.Палитра, ИменаРеквизитовЭлемента);
		РазмерыПалитры.КоличествоЭлементовВРяду = ДанныеПалитры.КоличествоЭлементовВРяду;
		РазмерыПалитры.КоличествоРядовНаСтранице = ДанныеПалитры.КоличествоРядов;
	КонецЕсли;
	Если РазмерыПалитры.КоличествоЭлементовВРяду = 0 Или РазмерыПалитры.КоличествоРядовНаСтранице = 0 Тогда
		ЭтоВертикальнаяОриентация = (Не ПараметрыНастройки.ЭтоГоризонтальнаяОриентация);
		РазмерыПлиткиПоУмолчанию
			= ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьРазмерыПлиткиПоУмолчанию(ЭтоВертикальнаяОриентация);
		ЗаполнитьЗначенияСвойств(РазмерыПалитры, РазмерыПлиткиПоУмолчанию);
	КонецЕсли;
	
	Возврат РазмерыПалитры;
	
КонецФункции

&НаСервере
Функция СформироватьТабличныйДокументГорячихКлавиш()
	
	ГорячиеКлавишиПечать = Новый ТабличныйДокумент;
	ПустаяКлавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	МакетПечати = Справочники.НастройкиРабочегоМестаКассира.ПолучитьМакет("ПечатьГорячихКлавиш");
	ОбластьШапкаДействия = МакетПечати.ПолучитьОбласть("ШапкаДействия");	
	
	СтроковоеПредставлениеКомбинацииОткрытияПанелиИзбранного = "";
	
	ГорячиеКлавишиПечать.Вывести(ОбластьШапкаДействия);
	ВывестиОсновныеГорячиеКлавишиВТабличныйДокумент(МакетПечати, ГорячиеКлавишиПечать, СтроковоеПредставлениеКомбинацииОткрытияПанелиИзбранного);

	ВывестиГорячиеКлавишиКупюрВТабличныйДокумент(МакетПечати, ГорячиеКлавишиПечать);
	
	Если Не СтроковоеПредставлениеКомбинацииОткрытияПанелиИзбранного = "" Тогда
		
		ТекстДополнения = СтрШаблон(
			НСтр("ru = 'Для избранных товаров зарезервированы комбинации клавиш ""%1"" [0-9] цифрового ряда.'"),
			СтроковоеПредставлениеКомбинацииОткрытияПанелиИзбранного);
		
		ОбластьДополнение = МакетПечати.ПолучитьОбласть("Дополнение");
		ОбластьДополнение.Параметры.Дополнение = ТекстДополнения;
		ГорячиеКлавишиПечать.Вывести(ОбластьДополнение);
		
	КонецЕсли;
	
	Возврат ГорячиеКлавишиПечать;
	
КонецФункции

&НаСервере
Процедура ВывестиОсновныеГорячиеКлавишиВТабличныйДокумент(МакетПечати, ГорячиеКлавишиПечать,
		СтроковоеПредставлениеКомбинацииОткрытияПанелиИзбранного)
	
	ОбластьРядРаздела = МакетПечати.ПолучитьОбласть("РядРаздела");
	ОбластьРядДействия = МакетПечати.ПолучитьОбласть("РядДействия");
	ПустаяКлавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	ИмяКнопкиОткрытьИзбранное = "ОткрытьПанельИзбранныхТоваров";
	Для Каждого СтрокаРаздела Из ДеревоГорячиеКлавиши.ПолучитьЭлементы() Цикл
		НачалоРаздела = Истина;
		Для Каждого СтрокаКомбинации Из СтрокаРаздела.ПолучитьЭлементы() Цикл
			Если ЗначениеЗаполнено(СтрокаКомбинации.Клавиша) И Не СтрокаКомбинации.Клавиша = ПустаяКлавиша Тогда
				Если НачалоРаздела Тогда
					ОбластьРядРаздела.Параметры.ИмяРаздела = СтрокаРаздела.ИмяРаздела;
					ГорячиеКлавишиПечать.Вывести(ОбластьРядРаздела);
					НачалоРаздела = Ложь;
				КонецЕсли;
				ДобавитьКомбинациюКлавишДействия(ГорячиеКлавишиПечать, ОбластьРядДействия, СтрокаКомбинации);
				Если СтрокаКомбинации.ИмяЭлемента = ИмяКнопкиОткрытьИзбранное И ОтмеченАкселератор(СтрокаКомбинации) Тогда
					СтроковоеПредставлениеКомбинацииОткрытияПанелиИзбранного = 
						СформироватьСтроковоеПредставлениеКомбинацииОткрытияПанелиИзбранного(СтрокаКомбинации);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиГорячиеКлавишиКупюрВТабличныйДокумент(МакетПечати, ГорячиеКлавишиПечать)

	ПустаяКлавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	НачалоРаздела = Истина;
	Если НастройкиРМК.ИспользоватьОплатуНаличными И НастройкиРМК.ИспользоватьПанельВводаНаличныхКупюр Тогда
		ОбластьШапкаКупюр = МакетПечати.ПолучитьОбласть("ШапкаКупюр");
		ОбластьРядКупюры = МакетПечати.ПолучитьОбласть("РядКупюры");
		Для Каждого СтрокаКупюры Из НастройкиРМК.ВводНаличных Цикл
			Если ЗначениеЗаполнено(СтрокаКупюры.Клавиша) И Не СтрокаКупюры.Клавиша = ПустаяКлавиша Тогда
				Если НачалоРаздела Тогда
					ГорячиеКлавишиПечать.Вывести(ОбластьШапкаКупюр);
					НачалоРаздела = Ложь;
				КонецЕсли;
				ДобавитьКомбинациюКлавишКупюры(ГорячиеКлавишиПечать, ОбластьРядКупюры, СтрокаКупюры);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьСтроковоеПредставлениеКомбинацииОткрытияПанелиИзбранного(СтрокаКомбинации)
	
	СоставляющаяCtrl = ?(СтрокаКомбинации.АкселераторCtrl, "Ctrl +", "");
	СоставляющаяAlt = ?(СтрокаКомбинации.АкселераторAlt, "Alt +", "");
	СоставляющаяShift = ?(СтрокаКомбинации.АкселераторShift, "Shift +", "");
	
	Возврат СтрШаблон("%1%2%3", СоставляющаяCtrl, СоставляющаяAlt, СоставляющаяShift);
	
КонецФункции

&НаСервере
Процедура ДобавитьКомбинациюКлавишКупюры(ГорячиеКлавишиПечать, ОбластьРядКупюры, СтрокаНоминала)
	ОбластьРядКупюры.Параметры.Номинал = СтрокаНоминала.Номинал;
	ОбластьРядКупюры.Параметры.Клавиша = СтрокаНоминала.Клавиша;
	ОбластьРядКупюры.Параметры.Alt = ПредставлениеАкселератора(НастройкиРМК.ВводНаличныхАкселераторAlt);
	ОбластьРядКупюры.Параметры.Ctrl = ПредставлениеАкселератора(НастройкиРМК.ВводНаличныхАкселераторCtrl);
	ОбластьРядКупюры.Параметры.Shift = ПредставлениеАкселератора(НастройкиРМК.ВводНаличныхАкселераторShift);
	ГорячиеКлавишиПечать.Вывести(ОбластьРядКупюры);
КонецПроцедуры

&НаСервере
Функция ПредставлениеАкселератора(ЗначениеАкселератора)
	Возврат ?(ЗначениеАкселератора, "V", "");
КонецФункции

&НаСервере
Функция ОтмеченАкселератор(СтрокаКомбинации)
	Возврат (СтрокаКомбинации.АкселераторAlt Или СтрокаКомбинации.АкселераторCtrl Или СтрокаКомбинации.АкселераторShift);
КонецФункции

&НаСервере
Процедура ДобавитьКомбинациюКлавишДействия(ГорячиеКлавишиПечать, ОбластьРядДействия, СтрокаКомбинации)
	ОбластьРядДействия.Параметры.Номер = СтрокаКомбинации.НомерСтроки;
	ОбластьРядДействия.Параметры.Действие = СтрокаКомбинации.Действие;
	ОбластьРядДействия.Параметры.Клавиша = СтрокаКомбинации.Клавиша;
	ОбластьРядДействия.Параметры.Alt = ПредставлениеАкселератора(СтрокаКомбинации.АкселераторAlt);
	ОбластьРядДействия.Параметры.Ctrl = ПредставлениеАкселератора(СтрокаКомбинации.АкселераторCtrl);
	ОбластьРядДействия.Параметры.Shift = ПредставлениеАкселератора(СтрокаКомбинации.АкселераторShift);
	ГорячиеКлавишиПечать.Вывести(ОбластьРядДействия);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаполнениеКлавиш()
	ТекущаяСтрока = Элементы.ДеревоГорячиеКлавиши.ТекущиеДанные;
	ПустаяКлавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	Если ТекущаяСтрока.АкселераторAlt
		Или ТекущаяСтрока.АкселераторCtrl
		Или ТекущаяСтрока.АкселераторShift
		Или НЕ ТекущаяСтрока.Клавиша = ПустаяКлавиша Тогда
		ТекущаяСтрока.КлавишаУстановлена = Истина;
	Иначе
		ТекущаяСтрока.КлавишаУстановлена = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФильтрГорячихКлавиш()
	УстановитьФильтрГорячихКлавишНаСервере();
	СтрокиДерева = ДеревоГорячиеКлавиши.ПолучитьЭлементы();
	Для Каждого Строка Из СтрокиДерева Цикл
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Элементы.ДеревоГорячиеКлавиши.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтрГорячихКлавишНаСервере()
	ДеревоГорячиеКлавишиОбъект = РеквизитФормыВЗначение("ДеревоГорячиеКлавиши");
	Если ФильтрГорячиеКлавиши = 1 Тогда
		СкопироватьДеревоГорячихКлавиш(ДеревоГорячиеКлавишиОбъект);
		УстановитьФильтрТолькоУстановленные(ДеревоГорячиеКлавишиОбъект);
	Иначе
		СброситьФильтрГорячиеКлавиши(ДеревоГорячиеКлавишиОбъект);
	КонецЕсли;
	ЗначениеВРеквизитФормы(ДеревоГорячиеКлавишиОбъект, "ДеревоГорячиеКлавиши");
КонецПроцедуры

&НаСервере
Процедура СкопироватьДеревоГорячихКлавиш(ДеревоГорячиеКлавишиОбъект)
	ДеревоКопия = ДеревоГорячиеКлавишиОбъект.Скопировать();
	СоздатьНовоеПустоеДеревоКопированием(ДеревоКопия);
	ЗначениеВРеквизитФормы(ДеревоКопия, "КопияДеревоГорячиеКлавиши");
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтрТолькоУстановленные(ДеревоГорячиеКлавишиОбъект)
	РодителиКУдалению = Новый Массив;
	СтрокиКУдалению = Новый Массив;
	
	Для Каждого ТекущийРодитель Из ДеревоГорячиеКлавишиОбъект.Строки Цикл
		ЕстьНазначенныеКлавиши = Ложь;
		Для Каждого ТекущаяСтрока Из ТекущийРодитель.Строки Цикл
			Если ТекущаяСтрока.КлавишаУстановлена Тогда
				ЕстьНазначенныеКлавиши = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЕстьНазначенныеКлавиши Тогда
			РодителиКУдалению.Добавить(ТекущийРодитель);
		Иначе
			Для Каждого ТекущаяСтрока Из ТекущийРодитель.Строки Цикл
				Если НЕ ТекущаяСтрока.КлавишаУстановлена Тогда
					СтрокиКУдалению.Добавить(ТекущаяСтрока);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Родитель Из РодителиКУдалению Цикл
		ДеревоГорячиеКлавишиОбъект.Строки.Удалить(Родитель);
	КонецЦикла;
	
	Для Каждого Строка Из СтрокиКУдалению Цикл
		Для Каждого ТекущийРодитель Из ДеревоГорячиеКлавишиОбъект.Строки Цикл
			СтрокиКУдалениюСРодителем = Новый Массив;
			Для Каждого ТекущаяСтрока Из ТекущийРодитель.Строки Цикл
				Если Строка = ТекущаяСтрока Тогда
					СтрокиКУдалениюСРодителем.Добавить(ТекущаяСтрока);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого СтрокаРодитель Из СтрокиКУдалениюСРодителем Цикл
				ТекущийРодитель.Строки.Удалить(СтрокаРодитель);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СброситьФильтрГорячиеКлавиши(ДеревоГорячиеКлавишиОбъект)
	ДеревоГорячиеКлавишиОбъектКопия = РеквизитФормыВЗначение("КопияДеревоГорячиеКлавиши");
	Для Каждого ТекущийРодитель Из ДеревоГорячиеКлавишиОбъект.Строки Цикл
		СтрокиДереваКопия = ДеревоГорячиеКлавишиОбъектКопия.Строки.Найти(ТекущийРодитель.ИмяРаздела, "ИмяРаздела");
		Для Каждого ТекущаяСтрока Из ТекущийРодитель.Строки Цикл
			Для Каждого ТекущаяСтрокаКопия Из СтрокиДереваКопия.Строки Цикл
				Если ТекущаяСтрокаКопия.Действие = ТекущаяСтрока.Действие Тогда
					ЗаполнитьЗначенияСвойств(ТекущаяСтрокаКопия, ТекущаяСтрока);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	ДеревоГорячиеКлавишиОбъект = ДеревоГорячиеКлавишиОбъектКопия.Скопировать();
КонецПроцедуры

&НаСервере
Процедура СоздатьНовоеПустоеДеревоКопированием(ДеревоИсходник)
	
	СтруктураРеквизитКопия = Новый Структура("КопияДеревоГорячиеКлавиши", Неопределено);
	
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитКопия, ЭтотОбъект);
	Если НЕ СтруктураРеквизитКопия.КопияДеревоГорячиеКлавиши = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовоеДерево = Новый РеквизитФормы("КопияДеревоГорячиеКлавиши", Новый ОписаниеТипов("ДеревоЗначений"));
	МассивДобавленныхРеквизитов = Новый Массив;
	МассивДобавленныхРеквизитов.Добавить(НовоеДерево);
	Для Каждого ТекущаяКолонка Из ДеревоИсходник.Колонки Цикл
		Колонка = Новый РеквизитФормы(ТекущаяКолонка.Имя, ТекущаяКолонка.ТипЗначения, "КопияДеревоГорячиеКлавиши");
		МассивДобавленныхРеквизитов.Добавить(Колонка);
	КонецЦикла;
	ИзменитьРеквизиты(МассивДобавленныхРеквизитов);
КонецПроцедуры

#КонецОбласти

#Область УстройствоРаспознования

&НаСервере
Процедура АктуализироватьНастройкиОборудования()
	
	УстройстваПоТипам = Новый Структура();
	ЭлектронныеВесыРабочегоМеста = ОбщегоНазначенияРМК.ПолучитьПодключенноеОборудованиеПоТипу("ЭлектронныеВесы",
		НастройкиРМК.РабочееМесто);
	Если РаботаСУстройствамиРаспознавания Тогда
		УстройстваРаспознаванияРабочегоМеста
			= ОбщегоНазначенияРМК.ПолучитьПодключенноеОборудованиеПоТипу("УстройствоРаспознавания", НастройкиРМК.РабочееМесто);
	Иначе
		УстройстваРаспознаванияРабочегоМеста = Новый Массив;
	КонецЕсли;
	УстройстваПоТипам.Вставить("ЭлектронныеВесыРабочегоМеста", ЭлектронныеВесыРабочегоМеста);
	УстройстваПоТипам.Вставить("УстройстваРаспознаванияРабочегоМеста", УстройстваРаспознаванияРабочегоМеста);
	
	АктуализироватьОтображениеСтраницыОборудования(УстройстваПоТипам);
	ЗаполнитьКомплектациюОборудованияПоДаннымИБ(УстройстваПоТипам);
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьОтображениеСтраницыОборудования(УстройстваПоТипам)

	ЭлектронныеВесыРабочегоМеста = УстройстваПоТипам.ЭлектронныеВесыРабочегоМеста;
	УстройстваРаспознаванияРабочегоМеста = УстройстваПоТипам.УстройстваРаспознаванияРабочегоМеста;
	Если ЭлектронныеВесыРабочегоМеста.Количество() > 0 И УстройстваРаспознаванияРабочегоМеста.Количество() > 0 Тогда
		УстановитьВидимостьЭлементаФормы(Элементы.СтраницаОборудование, Истина);
		ДоступныеЭлектронныеВесы.ЗагрузитьЗначения(ЭлектронныеВесыРабочегоМеста);
		КолонкаУстройствоРаспознавания = Элементы.УстройстваРаспознаванияЭлектронныхВесовУстройствоРаспознавания;
		КолонкаУстройствоРаспознавания.СписокВыбора.ЗагрузитьЗначения(УстройстваРаспознаванияРабочегоМеста);
		Элементы.СтраницыНастройкиОборудования.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе
		УстановитьВидимостьЭлементаФормы(Элементы.СтраницаОборудование, Ложь);
		Элементы.СтраницыНастройкиОборудования.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомплектациюОборудованияПоДаннымИБ(УстройстваПоТипам = Неопределено)
	
	Если УстройстваПоТипам = Неопределено Тогда
		КолонкаУстройствоРаспознавания = Элементы.УстройстваРаспознаванияЭлектронныхВесовУстройствоРаспознавания;
		УстройстваРаспознавания = КолонкаУстройствоРаспознавания.СписокВыбора.ВыгрузитьЗначения();
		УстройстваПоТипам = Новый Структура();
		УстройстваПоТипам.Вставить("ЭлектронныеВесыРабочегоМеста", ДоступныеЭлектронныеВесы.ВыгрузитьЗначения());
		УстройстваПоТипам.Вставить("УстройстваРаспознаванияРабочегоМеста", УстройстваРаспознавания);
	КонецЕсли;
	ЗаполнитьУстройстваРаспознаванияЭлектронныхВесовПоДаннымИБ(УстройстваПоТипам);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУстройстваРаспознаванияЭлектронныхВесовПоДаннымИБ(УстройстваПоТипам)

	РегистрКомплектации = РегистрыСведений.КомплектацияПодключаемогоОборудования;
	УстройстваРаспознаванияЭлектронныхВесов.Очистить();
	ЭлектронныеВесыРабочегоМеста = УстройстваПоТипам.ЭлектронныеВесыРабочегоМеста;
	УстройстваРаспознаванияРабочегоМеста = УстройстваПоТипам.УстройстваРаспознаванияРабочегоМеста;
	ЗапросКомплектации = Новый Запрос;
	ЗапросКомплектации.Текст = РегистрКомплектации.ПолучитьТекстЗапросаУстройствРаспознаванияЭлектронныхВесов();
	ЗапросКомплектации.УстановитьПараметр("ЭлектронныеВесы", ЭлектронныеВесыРабочегоМеста);
	ЗапросКомплектации.УстановитьПараметр("УстройстваРаспознавания", УстройстваРаспознаванияРабочегоМеста);
	РезультатЗапроса = ЗапросКомплектации.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = УстройстваРаспознаванияЭлектронныхВесов.Добавить();
			НоваяСтрока.ЭлектронныеВесы = Выборка.ЭлектронныеВесыСсылка;
			НоваяСтрока.УстройствоРаспознавания = Выборка.УстройствоРаспознаванияСсылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьУстройстваРаспознаванияЭлектронныхВесов()
	
	ЭлектронныеВесыРабочегоМеста = ДоступныеЭлектронныеВесы.ВыгрузитьЗначения();
	КолонкаУстройствоРаспознавания = Элементы.УстройстваРаспознаванияЭлектронныхВесовУстройствоРаспознавания;
	УстройстваРаспознаванияРабочегоМеста = КолонкаУстройствоРаспознавания.СписокВыбора.ВыгрузитьЗначения();
	
	УстройстваРабочегоМеста = Новый Структура;
	УстройстваРабочегоМеста.Вставить("ЭлектронныеВесы", ЭлектронныеВесыРабочегоМеста);
	УстройстваРабочегоМеста.Вставить("УстройстваРаспознавания", УстройстваРаспознаванияРабочегоМеста);
	ТаблицаУстройств = УстройстваРаспознаванияЭлектронныхВесов.Выгрузить();
	ОбщегоНазначенияРМК.ЗаписатьУстройстваРаспознаванияЭлектронныхВесов(ТаблицаУстройств, УстройстваРабочегоМеста);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеКомплектацииОборудования()
	
	РезультатФункции = "";
	ИндексСтроки = 0;
	Для Каждого СтрокаОборудования Из УстройстваРаспознаванияЭлектронныхВесов Цикл
		ИндексСтроки = ИндексСтроки + 1;
		Если Не (ЗначениеЗаполнено(СтрокаОборудования.ЭлектронныеВесы)
				И ЗначениеЗаполнено(СтрокаОборудования.УстройствоРаспознавания)) Тогда
			
			ТекстОшибки
				= СтрШаблон(НСтр("ru = 'Заполните оборудование в строке %1 таблицы устройств распознавания электронных весов.'"),
					ИндексСтроки);
			СимволПереноса = ?(РезультатФункции = "" , "", Символы.ПС);
			РезультатФункции = СтрШаблон("%1%2%3", РезультатФункции, СимволПереноса, ТекстОшибки);
			
		КонецЕсли;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьНастроекРаспознавания()
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНастроекРаспознавания, УстройствоРаспознаванияВыбрано());
КонецПроцедуры

&НаКлиенте
Функция УстройствоРаспознаванияВыбрано()
	
	РезультатФункции = Ложь;
	КоличествоСтрокОборудования = УстройстваРаспознаванияЭлектронныхВесов.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрокОборудования И Не РезультатФункции Цикл
		
		СтрокаКомплектации = УстройстваРаспознаванияЭлектронныхВесов.Получить(ИндексСтроки);
		Если ЗначениеЗаполнено(СтрокаКомплектации.УстройствоРаспознавания) Тогда
			РезультатФункции = Истина;
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
		
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти

#Область РаботаСПалитрой

&НаСервере
Функция СуществуетСлужебнаяПалитраТоваров()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПалитраТоваровРМК.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПалитраТоваровРМК КАК ПалитраТоваровРМК
	|ГДЕ
	|	ПалитраТоваровРМК.Служебная";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат (Не РезультатЗапроса.Пустой());
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеПакетаЗаполнены(ПакетаДанные)
	Возврат ((Не ПакетаДанные = Неопределено) И ЗначениеЗаполнено(ПакетаДанные.Номенклатура));
КонецФункции

&НаСервере
Процедура ЗагрузитьИсходныеДанные()
	
	ТекущийПервыйИндексИзбранного = -1;
	ТекущийВторойИндексИзбранного = -1;
	Если ЗначениеЗаполнено(СтруктураПлиточногоИнтерфейсаПодбора) Или ДанныеПакетаЗаполнены(ДанныеПакета)
			Или ЗначениеЗаполнено(НастройкиРМК.СтруктураБыстрыхТоваров) Тогда
		
		ИнтерфейсРМКСлужебный.ЗаполнитьОпорныеДанныеПанелиПлиточногоИнтерфейса(ЭтотОбъект);
		ОбщегоНазначенияРМК.ДополнитьОпорныеДанныеПанелиДляПостроенияПлиточногоИнтерфейса(ЭтотОбъект);
		
	Иначе
		
		ОпорныеДанные.Очистить();
		
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыИзбранного()
	
	КоличествоВложенныхЭлементов = Элементы.ГруппаРядовКнопокБыстрыхТоваров.ПодчиненныеЭлементы.Количество();
	Для ИндексЭлемента = 1 По КоличествоВложенныхЭлементов Цикл
		ТекущийИндекс = КоличествоВложенныхЭлементов - ИндексЭлемента;
		ВложенныйЭлемент = Элементы.ГруппаРядовКнопокБыстрыхТоваров.ПодчиненныеЭлементы.Получить(ТекущийИндекс);
		Элементы.Удалить(ВложенныйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыПлиток()
	
	КоличествоВложенныхЭлементов = Элементы.ПлиточныйИнтерфейс.ПодчиненныеЭлементы.Количество();
	Для ИндексЭлемента = 1 По КоличествоВложенныхЭлементов Цикл
		ТекущийИндекс = КоличествоВложенныхЭлементов - ИндексЭлемента;
		ВложенныйЭлемент = Элементы.ПлиточныйИнтерфейс.ПодчиненныеЭлементы.Получить(ТекущийИндекс);
		Элементы.Удалить(ВложенныйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ИзмененыПараметрыПостроенияПлиточногоИнтерфейса(ИзменениеОстатка)
	
	ВсеПараметрыРавны = (КоличествоРядовНаСтранице = АктуальноеКоличествоРядовНаСтранице
		И КоличествоЭлементовВРяду = АктуальноеКоличествоЭлементовВРяду
		И НастройкиРМК.ОтображатьОстаток = АктуальноеЗначениеОтображатьОстаток
		И СкрыватьЦену = АктуальноеЗначениеСкрыватьЦену);
		
	ИзменениеОстатка = Не (НастройкиРМК.ОтображатьОстаток = АктуальноеЗначениеОтображатьОстаток);
		
	Возврат Не ВсеПараметрыРавны;
	
КонецФункции

&НаСервере
Функция ИзмененыПараметрыПостроенияИзбранного(ИзменениеОстатка)
	
	ВсеПараметрыРавны = (ЕстьГруппыИзбранногоБолее4 = АктуальноеНаличиеГруппИзбранныхБолее4
		И НастройкиРМК.ОтображатьОстаток = АктуальноеЗначениеОтображатьОстаток
		И СкрыватьЦенуИзбранных = АктуальноеЗначениеСкрыватьЦенуИзбранных
		И АкселераторыРавны(АктуальныеАкселераторыОткрытияИзбранных, АкселераторыОткрытияИзбранных));
		
	Возврат ИзменениеОстатка Или Не ВсеПараметрыРавны;
	
КонецФункции

&НаСервере
Функция ИзмененыДанныеПанелиИзбранныхСервер()
	
	ВсеДанныеРавны = (НастройкиРМК.СтруктураБыстрыхТоваров = АктуальнаяПалитраБыстрыхТоваров
		И АктуальныйПакет = НастройкиРМК.НоменклатураПакет
		И (АктуальноеРазрешениеДобавленияПакета = НастройкиРМК.РазрешитьБыстроеДобавлениеПакета
			Или Не ЗначениеЗаполнено(НастройкиРМК.НоменклатураПакет)));
		
	Возврат Не ВсеДанныеРавны;
	
КонецФункции

&НаКлиенте
Функция ИзмененыДанныеПанелиИзбранныхКлиент()
	
	ВсеДанныеРавны = (НастройкиРМК.СтруктураБыстрыхТоваров = АктуальнаяПалитраБыстрыхТоваров
		И АкселераторыРавны(АктуальныеАкселераторыОткрытияИзбранных, АкселераторыОткрытияИзбранных)
		И АктуальныйПакет = НастройкиРМК.НоменклатураПакет
		И (АктуальноеРазрешениеДобавленияПакета = НастройкиРМК.РазрешитьБыстроеДобавлениеПакета
			Или Не ЗначениеЗаполнено(НастройкиРМК.НоменклатураПакет)));
		
	Возврат Не ВсеДанныеРавны;
	
КонецФункции

&НаСервере
Процедура ПодготовитьПлиточныйИнтерфейсПодбора(ОбновитьПринудительноПлитку,
		ОбновитьПринудительноИзбранное, ЕстьПлитка = Ложь, ЕстьИзбранное = Ложь, Перезаполнение = Ложь)
		
	АктуализироватьДанныеПакета();
	ОбновитьПринудительно = (ОбновитьПринудительноПлитку Или ОбновитьПринудительноИзбранное);
	ИсточникиДанных = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	Если ОбновитьПринудительно Или ИзмененыДанныеПанелиИзбранныхСервер()
			Или Не СтруктураПлиточногоИнтерфейсаПодбора = АктуальнаяПалитраТоваров Тогда
		ЗагрузитьИсходныеДанные();
		АктуальнаяПалитраТоваров = СтруктураПлиточногоИнтерфейсаПодбора;
		АктуальнаяПалитраБыстрыхТоваров = НастройкиРМК.СтруктураБыстрыхТоваров;
		АктуальноеРазрешениеДобавленияПакета = НастройкиРМК.РазрешитьБыстроеДобавлениеПакета;
		АктуальныйПакет = НастройкиРМК.НоменклатураПакет;
		Перезаполнение = Истина;
	КонецЕсли;
	АктуализироватьОтображениеЦенПалитры();
	Если Не АкселераторыРавны(АктуальныеАкселераторыОткрытияИзбранных, АкселераторыОткрытияИзбранных) Тогда
		ОбновитьПодсказкуИзбранногоГорячихКлавиш(АкселераторыОткрытияИзбранных);
	КонецЕсли;
	ОтображатьОстаток = НастройкиРМК.ОтображатьОстаток;
	ИзменениеОстатка = Ложь;
	Если ЗначениеЗаполнено(СтруктураПлиточногоИнтерфейсаПодбора) Тогда
		НаименованиеПалитры
			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураПлиточногоИнтерфейсаПодбора, "Наименование");
	Иначе
		НаименованиеПалитры = "";
	КонецЕсли;
	
	ОтборПалитра = Новый Структура("ИсточникПлитки", ИсточникиДанных.Палитра);
	ОтборИзбранное = Новый Структура("ИсточникПлитки", ИсточникиДанных.Избранное);
	СтрокиПалитры = ОпорныеДанные.НайтиСтроки(ОтборПалитра);
	СтрокиИзбранного = ОпорныеДанные.НайтиСтроки(ОтборИзбранное);
	Если СтрокиПалитры.Количество() > 0 Тогда
		ЕстьПлитка = Истина;
		Если ИзмененыПараметрыПостроенияПлиточногоинтерфейса(ИзменениеОстатка) Или Перезаполнение Тогда
			
			Если АктуальноеКоличествоРядовНаСтранице > 0 Тогда
				УдалитьЭлементыПлиток();
			КонецЕсли;
			
			ИнтерфейсРМКСлужебный.СформироватьЭлементыПлиток(ЭтотОбъект);
			АктуальноеКоличествоРядовНаСтранице = КоличествоРядовНаСтранице;
			АктуальноеКоличествоЭлементовВРяду = КоличествоЭлементовВРяду;
			АктуальноеЗначениеОтображатьОстаток = НастройкиРМК.ОтображатьОстаток;
			АктуальноеЗначениеСкрыватьЦену = СкрыватьЦену;
			
		КонецЕсли;
		Элементы.СтраницыПросмотрПлитки.ТекущаяСтраница = Элементы.СтраницаПлитка;
	Иначе
		Элементы.СтраницыПросмотрПлитки.ТекущаяСтраница = Элементы.СтраницаПлиткаПусто;
	КонецЕсли;
	Если СтрокиИзбранного.Количество() > 0 Тогда
		ЕстьИзбранное = Истина;
		Если ИзмененыПараметрыПостроенияИзбранного(ИзменениеОстатка) Или Перезаполнение Тогда
			
			Если Элементы.ГруппаРядовКнопокБыстрыхТоваров.ПодчиненныеЭлементы.Количество() > 0 Тогда
				УдалитьЭлементыИзбранного();
			КонецЕсли;
			
			ИнтерфейсРМКСлужебный.СформироватьЭлементыПанелиИзбранныхПозиций(ЭтотОбъект, АкселераторыОткрытияИзбранных);
			АктуальноеНаличиеГруппИзбранныхБолее4 = ЕстьГруппыИзбранногоБолее4;
			АктуальноеЗначениеОтображатьОстаток = НастройкиРМК.ОтображатьОстаток;
			АктуальноеЗначениеСкрыватьЦенуИзбранных = СкрыватьЦенуИзбранных;
			АктуальныеАкселераторыОткрытияИзбранных = АкселераторыОткрытияИзбранных;
			
		КонецЕсли;
		Элементы.СтраницыПросмотрИзбранное.ТекущаяСтраница = Элементы.СтраницаИзбранныхТоваров;
	Иначе
		Элементы.СтраницыПросмотрИзбранное.ТекущаяСтраница = Элементы.СтраницаИзбранноеПусто;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьОтображениеЦенПалитры()
	
	СкрыватьЦену = Ложь;
	СкрыватьЦенуИзбранных = Ложь;
	МассивПалитр = Новый Массив;
	Если ЗначениеЗаполнено(СтруктураПлиточногоИнтерфейсаПодбора) Тогда
		МассивПалитр.Добавить(СтруктураПлиточногоИнтерфейсаПодбора);
	КонецЕсли;
	Если ЗначениеЗаполнено(НастройкиРМК.СтруктураБыстрыхТоваров) Тогда
		МассивПалитр.Добавить(НастройкиРМК.СтруктураБыстрыхТоваров);
	КонецЕсли;
	Если МассивПалитр.Количество() > 0 Тогда
		ЗначенияРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивПалитр, "СкрыватьЦену");
		Если Не ЗначенияРеквизита[СтруктураПлиточногоИнтерфейсаПодбора] = Неопределено Тогда
			СкрыватьЦену = ЗначенияРеквизита[СтруктураПлиточногоИнтерфейсаПодбора];
		КонецЕсли;
		Если Не ЗначенияРеквизита[НастройкиРМК.СтруктураБыстрыхТоваров] = Неопределено Тогда
			СкрыватьЦенуИзбранных = ЗначенияРеквизита[НастройкиРМК.СтруктураБыстрыхТоваров];
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеВыбораНоменклатуры(НоменклатураПакет)
	
	ДанныеВыбора = Новый Структура;
	ДанныеВыбора.Вставить("Номенклатура", НоменклатураПакет);
	ДанныеВыбора.Вставить("Характеристика");
	ДанныеВыбора.Вставить("Упаковка");
	ДанныеВыбора.Вставить("Цена");
	ДанныеВыбора.Вставить("ОсобенностьУчета");
	ДанныеВыбора.Вставить("ВидНоменклатуры");
	ДанныеВыбора.Вставить("ВыборТовараВручную");
	
	Возврат ДанныеВыбора;
	
КонецФункции

&НаСервере
Процедура АктуализироватьДанныеПакета()
	
	Если НастройкиРМК.РазрешитьБыстроеДобавлениеПакета И ЗначениеЗаполнено(НастройкиРМК.НоменклатураПакет) Тогда
		ДанныеПакета = ПодготовитьДанныеВыбораНоменклатуры(НастройкиРМК.НоменклатураПакет);
	Иначе
		ДанныеПакета = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьПредпросмотрПлиточногоИнтерфейсаСервер(СтруктураВлияющихНастроек)
	
	СтруктураВлияющихНастроек.ВлияющиеНастройкиПлиткиИзменены
		= (Не СтруктураПлиточногоИнтерфейсаПодбора = АктуальнаяПалитраТоваров);
	СтруктураВлияющихНастроек.ВлияющиеНастройкиИзбранногоИзменены = ИзмененыДанныеПанелиИзбранныхСервер()
		И АкселераторыРавны(АктуальныеАкселераторыОткрытияИзбранных, АкселераторыОткрытияИзбранных);
	СтруктураВлияющихНастроек.ОтображениеОстаткаИзменено
		= (Не НастройкиРМК.ОтображатьОстаток = АктуальноеЗначениеОтображатьОстаток);
	СтруктураВлияющихНастроек.ВлияющиеНастройкиИзменены = СтруктураВлияющихНастроек.ВлияющиеНастройкиПлиткиИзменены
		Или СтруктураВлияющихНастроек.ВлияющиеНастройкиИзбранногоИзменены
		Или СтруктураВлияющихНастроек.ОтображениеОстаткаИзменено;
		
	Если СтруктураВлияющихНастроек.ВлияющиеНастройкиИзменены Тогда
		ПодготовитьПлиточныйИнтерфейсПодбора(Ложь, Ложь, СтруктураВлияющихНастроек.ЕстьПлитка,
			СтруктураВлияющихНастроек.ЕстьИзбранное, СтруктураВлияющихНастроек.Перезаполнение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьПредпросмотрПлиточногоИнтерфейсаКлиент(СтруктураВлияющихНастроек)
	
	Если СтруктураВлияющихНастроек.ЕстьПлитка И (СтруктураВлияющихНастроек.ВлияющиеНастройкиПлиткиИзменены
			Или СтруктураВлияющихНастроек.ОтображениеОстаткаИзменено Или СтруктураВлияющихНастроек.Перезаполнение) Тогда
		ПерезаполнитьКнопкиПлиток();
	КонецЕсли;
	Если СтруктураВлияющихНастроек.ЕстьИзбранное И (СтруктураВлияющихНастроек.ВлияющиеНастройкиИзбранногоИзменены
			Или СтруктураВлияющихНастроек.ОтображениеОстаткаИзменено Или СтруктураВлияющихНастроек.Перезаполнение) Тогда
		ПерезаполнитьКнопкиИзбранного();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ШаблонВлияющихНастроек()
	
	СтруктураВлияющихНастроек = Новый Структура();
	СтруктураВлияющихНастроек.Вставить("ВлияющиеНастройкиПлиткиИзменены", Ложь);
	СтруктураВлияющихНастроек.Вставить("ВлияющиеНастройкиИзбранногоИзменены", Ложь);
	СтруктураВлияющихНастроек.Вставить("ОтображениеОстаткаИзменено", Ложь);
	СтруктураВлияющихНастроек.Вставить("ВлияющиеНастройкиИзменены", Ложь);
	СтруктураВлияющихНастроек.Вставить("ЕстьПлитка", Ложь);
	СтруктураВлияющихНастроек.Вставить("ЕстьИзбранное", Ложь);
	СтруктураВлияющихНастроек.Вставить("Перезаполнение", Ложь);
	
	Возврат СтруктураВлияющихНастроек;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПредпросмотрПлиточногоИнтерфейсаПриНеобходимости()
	
	Если Не (АктуальноеЗначениеОтображатьОстаток = НастройкиРМК.ОтображатьОстаток
		И АкселераторыРавны(АктуальныеАкселераторыОткрытияИзбранных, АкселераторыОткрытияИзбранных)) Тогда
		
		ПостроитьПредпросмотрПлиточногоИнтерфейса();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция АкселераторыРавны(Акселератор1, Акселератор2)
	
	Возврат (Акселератор1.Ctrl = Акселератор2.Ctrl И Акселератор1.Alt = Акселератор2.Alt
		И Акселератор1.Shift = Акселератор2.Shift);
	
КонецФункции

&НаКлиенте
Процедура ПостроитьПредпросмотрПлиточногоИнтерфейса(ОбновитьПринудительноПлитку = Ложь,
		ОбновитьПринудительноИзбранное = Ложь)
	
	ВлияющиеНастройкиПлиткиИзменены = (Не СтруктураПлиточногоИнтерфейсаПодбора = АктуальнаяПалитраТоваров);
	ВлияющиеНастройкиИзбранногоИзменены = ИзмененыДанныеПанелиИзбранныхКлиент();
	ОтображениеОстаткаИзменено = (Не НастройкиРМК.ОтображатьОстаток = АктуальноеЗначениеОтображатьОстаток);
	ВлияющиеНастройкиИзменены = ВлияющиеНастройкиПлиткиИзменены Или ВлияющиеНастройкиИзбранногоИзменены
		Или ОтображениеОстаткаИзменено;
	
	Если ОбновитьПринудительноПлитку Или ОбновитьПринудительноИзбранное Или ВлияющиеНастройкиИзменены Тогда
		
		ЕстьПлитка = Ложь;
		ЕстьИзбранное = Ложь;
		Перезаполнение = Ложь;
		ПодготовитьПлиточныйИнтерфейсПодбора(ОбновитьПринудительноПлитку,
			ОбновитьПринудительноИзбранное, ЕстьПлитка, ЕстьИзбранное, Перезаполнение);
		Если ЕстьПлитка И (ОбновитьПринудительноПлитку Или ВлияющиеНастройкиПлиткиИзменены
				Или ОтображениеОстаткаИзменено Или Перезаполнение) Тогда
			ПерезаполнитьКнопкиПлиток();
		КонецЕсли;
		Если ЕстьИзбранное И (ОбновитьПринудительноИзбранное Или ВлияющиеНастройкиИзбранногоИзменены
				Или ОтображениеОстаткаИзменено Или Перезаполнение) Тогда
			ПерезаполнитьКнопкиИзбранного();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПервоначальноКнопкиПлиток()
	
	ИнтерфейсРМКСлужебныйКлиент.ИнициализироватьТипыПостроенияПлитки(ЭтотОбъект);
	ДанныеДляПлитки = Новый Массив;
	ТипПостроенияПлитки = ТипыПостроенияПлитки.ПоПалитре;
	ИнтерфейсРМКСлужебныйКлиент.ПодготовитьДанныеДляПлитки(ЭтотОбъект);
	ИнтерфейсРМКСлужебныйКлиент.ЗаполнитьКнопкиПлиток(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьКнопкиПлиток()
	
	ТекущийПервыйИндексПлитки = 0;
	ИнтерфейсРМКСлужебныйКлиент.ПодготовитьДанныеДляПлитки(ЭтотОбъект);
	ИнтерфейсРМКСлужебныйКлиент.ЗаполнитьКнопкиПлиток(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьКнопкиИзбранного()
	
	ИнтерфейсРМКСлужебныйКлиент.ЗаполнитьКнопкиИзбранныхПозиций(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницуПлитки(Дельта)
	
	КоличествоПлиток = КоличествоЭлементовВРяду * КоличествоРядовНаСтранице;
	СтрокаДанных = ДанныеДляПлитки[ТекущийПервыйИндексПлитки];
	ТекущаяКатегорияРамещения = СтрокаДанных.НомерКатегорииРазмещенияЭлемента;
	Если ТекущаяКатегорияРамещения = 0 Тогда
		ТекущийПервыйИндексПлитки = ТекущийПервыйИндексПлитки + Дельта * (КоличествоПлиток - 1);
		ТекущийВторойИндексПлитки = 0;
	Иначе
		ТекущийВторойИндексПлитки = ТекущийВторойИндексПлитки + Дельта * (КоличествоПлиток - 2);
	КонецЕсли;
	ИнтерфейсРМКСлужебныйКлиент.ЗаполнитьКнопкиПлиток(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуДомой()
	
	ТекущийПервыйИндексПлитки = 0;
	ТекущийВторойИндексПлитки = 0;
	ИнтерфейсРМКСлужебныйКлиент.ЗаполнитьКнопкиПлиток(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПлиткаВыбор(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомерНажатой = Число(ИнтерфейсРМКСлужебныйКлиент.ПолучитьНомерНажатойПлитки(Элемент));
	ТекущийЭлемент = Элементы.ПерейтиНаНачальнуюСтраницу;
	СтрокаНажатойКнопки = ДанныеКнопокПлиток.Получить(НомерНажатой);
	
	Если СтрокаНажатойКнопки.ЭтоКатегория ИЛИ СтрокаНажатойКнопки.ЭтоТекущаяКатегория
			ИЛИ СтрокаНажатойКнопки.ИмеетсяВложенность Тогда
		ТекущийПервыйИндексПлитки = СтрокаНажатойКнопки.ПервыйИндексПлитки;
		ТекущийВторойИндексПлитки = СтрокаНажатойКнопки.ВторойИндексПлитки;
		ИнтерфейсРМКСлужебныйКлиент.ЗаполнитьКнопкиПлиток(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИзбранноеКоманда(Команда)
	
	ОбработатьВыборИзбранного(Команда, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИзбранноеВыбор(Элемент)
	
	ОбработатьВыборИзбранного(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборИзбранного(ОбъектИнтерфейса, ИзКоманды = Ложь)
	
	ИменаЭлементов = ИнтерфейсРМКСлужебныйКлиент.ПолучитьИменаЭлементовИзбранного();
	НомерСтрокой = ИнтерфейсРМКСлужебныйКлиент.ПолучитьНомерНажатогоИзбранного(ОбъектИнтерфейса);
	Если Не НомерСтрокой = Неопределено Тогда
		
		НомерНажатой = Число(НомерСтрокой);
		ИмяКонтейнера = СтрШаблон("%1%2", ИменаЭлементов.Контейнер, НомерНажатой);
		ИмяПустойОбласти = СтрШаблон("%1%2", ИменаЭлементов.ВидПустой, НомерНажатой);
		ИмяСтраницаИзбранное = СтрШаблон("%1%2", ИменаЭлементов.СтраницаИзбранное, НомерНажатой);
		ИмяСтраницыИзбранного = СтрШаблон("%1%2", ИменаЭлементов.СтраницыИзбранного, НомерНажатой);
		ИмяСтраницаЭлемента = СтрШаблон("%1%2", ИменаЭлементов.СтраницаЭлемента, НомерНажатой);
		ИмяСтраницаЭлементаСКартинкой = СтрШаблон("%1%2", ИменаЭлементов.СтраницаЭлементаСКартинкой, НомерНажатой);
		
		СтрокаКарточки = ДанныеКнопок.Получить(НомерНажатой - 1);
		ВидимостьКартинки = ЗначениеЗаполнено(СтрокаКарточки.АдресИзображения);
		Если СтрокаКарточки.ЭтоКатегория ИЛИ СтрокаКарточки.ЭтоТекущаяКатегория ИЛИ СтрокаКарточки.ИмеетсяВложенность Тогда
			ТекущийПервыйИндексИзбранного = СтрокаКарточки.ПервыйИндексПлитки;
			ТекущийВторойИндексИзбранного = СтрокаКарточки.ВторойИндексПлитки;
			ИнтерфейсРМКСлужебныйКлиент.ЗаполнитьКнопкиИзбранныхПозиций(ЭтотОбъект);
		Иначе
			Если ЗначениеЗаполнено(СтрокаКарточки.Номенклатура) Тогда
				
				Элементы[ИмяКонтейнера].ТекущаяСтраница = Элементы[ИмяСтраницаИзбранное];
				Элементы[ИмяСтраницыИзбранного].ТекущаяСтраница
					= ?(ВидимостьКартинки, Элементы[ИмяСтраницаЭлементаСКартинкой], Элементы[ИмяСтраницаЭлемента]);
			ИначеЕсли НавигацияИзбранногоВключена И НомерНажатой = 8 Тогда
				Элементы.КонтейнерИзбранное_8.ТекущаяСтраница = Элементы.СтраницаИзбранноеНавигация;
			Иначе
				Элементы[ИмяКонтейнера].ТекущаяСтраница = Элементы[ИмяПустойОбласти];
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	ТекущийЭлемент = Элементы.ДекорацияБыстрыеТовары;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИзбранноеНазад(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПереключитьСтраницуИзбранного(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИзбранноеВперед(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПереключитьСтраницуИзбранного(1);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИзбранноеКомандаНазад(Команда)
	
	Элементы.СтраницыНавигацииНазад.ТекущаяСтраница = Элементы.СтраницаНавигацииИзображениеНазад;
	ПереключитьСтраницуИзбранного(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИзбранноеКомандаВперед(Команда)
	
	Элементы.СтраницыНавигацииВперед.ТекущаяСтраница = Элементы.СтраницаНавигацииИзображениеВперед;
	ПереключитьСтраницуИзбранного(1);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриСменеСтраницыИзбранное(Элемент, ТекущаяСтраница)
	Если Элемент = Элементы.СтраницыНавигацииНазад Тогда
		Элементы.СтраницыНавигацииНазад.ТекущаяСтраница = Элементы.СтраницаНавигацииИзображениеНазад;
	ИначеЕсли Элемент = Элементы.СтраницыНавигацииВперед Тогда
		Элементы.СтраницыНавигацииВперед.ТекущаяСтраница = Элементы.СтраницаНавигацииИзображениеВперед;
	КонецЕсли;
	ТекущийЭлемент = Элементы.ДекорацияБыстрыеТовары;
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницуИзбранного(Дельта)
	
	КоличествоНаСтранице = ИнтерфейсРМКСлужебныйКлиентСервер.КоличествоКарточекИзбранногоНаСтранице();
	СтрокаОпорныхДанных = ОпорныеДанные[ТекущийПервыйИндексИзбранного];
	Если Не СтрокаОпорныхДанных = Неопределено Тогда
		ТекущаяКатегорияРамещения = СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента;
		Если ТекущаяКатегорияРамещения = 0 Тогда
			ТекущийПервыйИндексИзбранного = ТекущийПервыйИндексИзбранного + Дельта * (КоличествоНаСтранице - 1);
			ТекущийВторойИндексИзбранного = 0;
		Иначе
			ТекущийВторойИндексИзбранного = ТекущийВторойИндексИзбранного + Дельта * (КоличествоНаСтранице - 2);
		КонецЕсли;
		ИнтерфейсРМКСлужебныйКлиент.ЗаполнитьКнопкиИзбранныхПозиций(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПалитры(ЭтоПалитраИзбранного = Ложь)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Ключ",
		?(ЭтоПалитраИзбранного, НастройкиРМК.СтруктураБыстрыхТоваров, СтруктураПлиточногоИнтерфейсаПодбора));
	ПараметрыОткрытия.Вставить("ВызовИзНастроек", Истина);
	ПараметрыОткрытия.Вставить("ЭтоПалитраИзбранного", ЭтоПалитраИзбранного);
	ОткрытьФорму("Справочник.ПалитраТоваровРМК.Форма.ФормаЭлемента", ПараметрыОткрытия, ЭтотОбъект, , , , ,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаписьПалитры(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.ПалитраТоваровРМК") И ЗначениеЗаполнено(Результат) Тогда
		
		Если ДополнительныеПараметры.ЭтоПалитраИзбранного Тогда
			Если Не ЗначениеЗаполнено(НастройкиРМК.СтруктураБыстрыхТоваров) Тогда
				НастройкиРМК.СтруктураБыстрыхТоваров = Результат;
			КонецЕсли;
			ПостроитьПредпросмотрПлиточногоИнтерфейса(Ложь, Истина);
		Иначе
			Если Не ЗначениеЗаполнено(СтруктураПлиточногоИнтерфейсаПодбора) Тогда
				СтруктураПлиточногоИнтерфейсаПодбора = Результат;
				НастройкиРМК.СтруктураПлиточногоИнтерфейсаПодбора = Результат;
			КонецЕсли;
			ПостроитьПредпросмотрПлиточногоИнтерфейса(Истина, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПалитры(ЭтоПалитраИзбранного = Ложь)
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ЭтоПалитраИзбранного", ЭтоПалитраИзбранного);
	ОповещениеВыбора = Новый ОписаниеОповещения("ОбработатьВыборПалитры", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыОткрытия = Новый Структура();
	МассивИсключения = Новый Массив;
	Если ЗначениеЗаполнено(СтруктураПлиточногоИнтерфейсаПодбора) И ЭтоПалитраИзбранного Тогда
		МассивИсключения.Добавить(СтруктураПлиточногоИнтерфейсаПодбора);
	ИначеЕсли ЗначениеЗаполнено(НастройкиРМК.СтруктураБыстрыхТоваров) И Не ЭтоПалитраИзбранного Тогда
		МассивИсключения.Добавить(НастройкиРМК.СтруктураБыстрыхТоваров);
	КонецЕсли;
	Если МассивИсключения.Количество() > 0 Тогда
		ПараметрыОткрытия.Вставить("ПалитраИсключение", МассивИсключения);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ДляИнтерфейса", Истина);
	ОткрытьФорму("Справочник.ПалитраТоваровРМК.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеВыбора,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПалитры(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Если ДополнительныеПараметры.ЭтоПалитраИзбранного Тогда
			НастройкиРМК.СтруктураБыстрыхТоваров = Результат;
		Иначе
			СтруктураПлиточногоИнтерфейсаПодбора = Результат;
			НастройкиРМК.СтруктураПлиточногоИнтерфейсаПодбора = Результат;
		КонецЕсли;
		ПостроитьПредпросмотрПлиточногоИнтерфейса();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОкноПриложения

&НаКлиенте
Процедура ПоказатьСхемуФормыРМК()
	
	СхемаФормыРМК = ИнтерфейсРМКСлужебныйКлиент.СформироватьДокументСхемыФормыРМК(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеНастроек

&НаСервере
Функция СохранитьНастройкиРМКНаСервере()
	
	ПеренестиГорячиеКлавишиВТабличнуюЧастьОбъекта();
	СохранитьПерсонализированныеНастройкиЭлементов();
	
	РезультатВыполнения = Новый Структура("ВыполненоУспешно,ТекстПредупрежденийОшибок", Истина, "");
	
	ОбъектНастройки = РеквизитФормыВЗначение("НастройкиРМК");
	
	Если НЕ ЗначениеЗаполнено(НастройкиРМК.Ссылка) Тогда
		
		Если КоличествоДоступныхНастроек > 0 Тогда
			
			ТекстПредупреждения =
				НСтр("ru = 'Невозможно создать еще одну настройку для текущего рабочего места
					|Пожалуйста, выберите подходящую настройку из существующих'");
			РезультатВыполнения.Вставить("ВыполненоУспешно", Ложь);
			РезультатВыполнения.Вставить("ТекстПредупрежденийОшибок", ТекстПредупреждения);
			
			Возврат РезультатВыполнения;
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(НастройкиРМК.Наименование) Тогда
				
				ТекстПредупреждения =
					НСтр("ru = 'Пожалуйста, укажите наименование для настройки.'");
				РезультатВыполнения.Вставить("ВыполненоУспешно", Ложь);
				РезультатВыполнения.Вставить("ТекстПредупрежденийОшибок", ТекстПредупреждения);
				
				Возврат РезультатВыполнения;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекущееРабочееМесто) Тогда
				ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбъектНастройки.РабочееМесто = ТекущееРабочееМесто;
	
	НастройкиДляПроверкиЗаполнения = НастройкиДляПроверкиЗаполнения();
	Для Каждого ПроверяемаяНастройка Из НастройкиДляПроверкиЗаполнения Цикл
		
		Если Не ЗначениеЗаполнено(НастройкиРМК[ПроверяемаяНастройка.ИмяНастройки]) Тогда
			
			РезультатВыполнения.Вставить("ВыполненоУспешно", Ложь);
			РезультатВыполнения.Вставить("ТекстПредупрежденийОшибок", ПроверяемаяНастройка.ТекстПредупреждения);
			Возврат РезультатВыполнения;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НастройкиРМК.ПродажиСНесколькихКассККМ
		И НЕ ЗначениеЗаполнено(НастройкиРМК.ОсновнаяКассаККМ) Тогда
		
		ТекстПредупреждения =
			НСтр("ru = 'Пожалуйста, выберите основную кассу ККМ.'");
		РезультатВыполнения.Вставить("ВыполненоУспешно", Ложь);
		РезультатВыполнения.Вставить("ТекстПредупрежденийОшибок", ТекстПредупреждения);
		
		Возврат РезультатВыполнения;
		
	КонецЕсли;
	
	Если НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных
			И (НЕ ЗначениеЗаполнено(НастройкиРМК.АдресСервераЛояльности)
				ИЛИ НЕ ЗначениеЗаполнено(НастройкиРМК.ПользовательСервераЛояльности)) Тогда
		
		ТекстПредупреждения =
			НСтр("ru = 'Пожалуйста, укажите адрес и пользователя сервера лояльности.'");
		РезультатВыполнения.Вставить("ВыполненоУспешно", Ложь);
		РезультатВыполнения.Вставить("ТекстПредупрежденийОшибок", ТекстПредупреждения);
		
		Возврат РезультатВыполнения;
		
	КонецЕсли;
	
	Если УстройстваРаспознаванияЭлектронныхВесов.Количество() > 0 Тогда
		ТекстПредупреждения = ПроверитьЗаполнениеКомплектацииОборудования();
		Если Не ТекстПредупреждения = "" Тогда
			РезультатВыполнения.Вставить("ВыполненоУспешно", Ложь);
			РезультатВыполнения.Вставить("ТекстПредупрежденийОшибок", ТекстПредупреждения);
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияРМКПереопределяемый.ПриСохраненииНастроекРМК(ЭтотОбъект, РезультатВыполнения);
	Если НЕ РезультатВыполнения.ВыполненоУспешно Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		Если НеобходимоСохранитьВариантИнтерфейса Тогда
			ЗаписатьВариантИнтерфейсаНаСервере();
		КонецЕсли;
		ЗаписатьНастройкиРМКНаСервере(ОбъектНастройки);
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Модифицированность = Истина;
		
		ТекстОшибки = НСтр("ru = 'Ошибка при записи настроек РМК.'");
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка при записи настроек РМК.'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		РезультатВыполнения.Вставить("ВыполненоУспешно", Ложь);
		РезультатВыполнения.Вставить("ТекстПредупрежденийОшибок", ТекстОшибки);
		Возврат РезультатВыполнения;
		
	КонецПопытки;
	
	Если ПарольСервераЛояльностиИзменен Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ОбъектНастройки.Ссылка,
			ПарольСервераЛояльности, "ПарольСервераЛояльности");
		УстановитьПривилегированныйРежим(Ложь);
		ПарольСервераЛояльности = ?(ЗначениеЗаполнено(ПарольСервераЛояльности), УникальныйИдентификатор, "");
		ПарольСервераЛояльностиИзменен = Ложь;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ОбъектНастройки, "НастройкиРМК");
	ОбновитьПодсказкуТаблицыГорячихКлавиш(ОбъектНастройки);
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура ПеренестиГорячиеКлавишиВТабличнуюЧастьОбъекта()
	
	НастройкиРМК.ГорячиеКлавиши.Очистить();
	Для Каждого СтрокаРаздела Из ДеревоГорячиеКлавиши.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаГорячейКлавиши Из СтрокаРаздела.ПолучитьЭлементы() Цикл
			
			НоваяСтрокаГорячейКлавиши = НастройкиРМК.ГорячиеКлавиши.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаГорячейКлавиши, СтрокаГорячейКлавиши, , "НомерСтроки");
			НоваяСтрокаГорячейКлавиши.ИмяКнопки = СтрокаГорячейКлавиши.ИмяЭлемента;
			НоваяСтрокаГорячейКлавиши.ЗаголовокКнопки = СтрокаГорячейКлавиши.Действие;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПерсонализированныеНастройкиЭлементов()
	
	НастройкиРМК.НастройкиЭлементов.Очистить();
	Для Каждого НастройкаЭлемента Из НастройкиЭлементовФормыРМК Цикл
		
		Если Не НастройкаЭлемента.ЗначениеСвойства = НастройкаЭлемента.ЗначениеПоУмолчанию Тогда
			
			НоваяСтрока = НастройкиРМК.НастройкиЭлементов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НастройкаЭлемента);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НастройкиДляПроверкиЗаполнения()
	
	МассивНастроек = Новый Массив;
	
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		ТекстПредупреждения = НСтр("ru = 'Пожалуйста, выберите вариант масштаба интерфейса.'");
		ДобавитьНастройкуДляПроверкиЗаполнения(МассивНастроек, "ВидОтображения", ТекстПредупреждения);
	КонецЕсли;
	
	Возврат МассивНастроек;
	
КонецФункции

&НаСервере
Процедура ДобавитьНастройкуДляПроверкиЗаполнения(МассивНастроек, Знач ИмяНастройки, Знач ТекстПредупреждения)
	
	ОписаниеНастройки = Новый Структура;
	ОписаниеНастройки.Вставить("ИмяНастройки", ИмяНастройки);
	ОписаниеНастройки.Вставить("ТекстПредупреждения", ТекстПредупреждения);
	
	МассивНастроек.Добавить(ОписаниеНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбойтиСтрокиИерархииТоваров(СтрокиИерархии, ВложенныеПалитры)
	
	Для Каждого СтрокаТовара Из СтрокиИерархии Цикл
		Если ЗначениеЗаполнено(СтрокаТовара.Палитра) Тогда
			ВложенныеПалитры.Добавить(СтрокаТовара.Палитра);
		ИначеЕсли СтрокаТовара.ЭтоКатегория Тогда
			ОбойтиСтрокиИерархииТоваров(СтрокаТовара.ПолучитьЭлементы(), ВложенныеПалитры);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиРМКНаСервере(ОбъектНастройки)
	
	СохранитьРасписанияНастроек();
	Если ИзмененаТаблицаУстройствРаспознаванияЭлектронныхВесов Тогда
		ЗаписатьУстройстваРаспознаванияЭлектронныхВесов();
	КонецЕсли;
	ОбъектНастройки.СтруктураБыстрыхТоваров = НастройкиРМК.СтруктураБыстрыхТоваров;
	
	ОбъектНастройки.Записать(); // АПК:566 - допустимый синхронный вызов
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРасписанияНастроек()
	СохранитьРасписаниеОчисткиЖурналаДействийКассира();
	СохранитьРасписаниеОчисткиАрхивныхЧеков();
КонецПроцедуры

&НаСервере
Процедура СохранитьРасписаниеОчисткиЖурналаДействийКассира()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.ОчисткаЖурналаДействийКассира);
	ТекущиеЗадания	= РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	РасписаниеИзменено = (РасписаниеОчисткиЖурналаДействийКассираИзменено
		И Не РасписаниеОчисткиЖурналаДействийКассира = Неопределено);
	ИспользованиеЗадания = (НастройкиРМК.ВестиЖурналДействийКассира
		И Не РасписаниеОчисткиЖурналаДействийКассира = Неопределено);
	
	Если ЗначениеЗаполнено(ТекущиеЗадания) Тогда
		
		РасписаниеЗадания = РасписаниеОчисткиЖурналаДействийКассира;
		Если РасписаниеЗадания = Неопределено Тогда
			РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
		КонецЕсли;
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Использование", ИспользованиеЗадания);
		ПараметрыЗадания.Вставить("Расписание", РасписаниеЗадания);
		Для Каждого ТекущееЗадание Из ТекущиеЗадания Цикл
			РегламентныеЗаданияСервер.ИзменитьЗадание(ТекущееЗадание, ПараметрыЗадания);
		КонецЦикла;
		
	ИначеЕсли ИспользованиеЗадания Тогда
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Использование", ИспользованиеЗадания);
		ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОчисткаЖурналаДействийКассира);
		ПараметрыЗадания.Вставить("Ключ", Строка(Новый УникальныйИдентификатор));
		ПараметрыЗадания.Вставить("Расписание", РасписаниеОчисткиЖурналаДействийКассира);
		
		РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		
	КонецЕсли;
	РасписаниеОчисткиЖурналаДействийКассираИзменено = Ложь;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаНастроекПередЗакрытием(Отказ)
	
	Если Не ЗакрыватьФормуБезКонтроляИзмененийНастроек
		И (Модифицированность Или НеобходимоСохранитьВариантИнтерфейса Или Не ЗначениеЗаполнено(НастройкиРМК.Ссылка)) Тогда
		
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиРМКИЗакрыть", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Сохранить настройки?'");
		СписокОтветов = Новый СписокЗначений;
		СписокОтветов.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Сохранить'"));
		СписокОтветов.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Отмена'"));
		ПоказатьВопрос(Оповещение, ТекстВопроса, СписокОтветов);
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СохранитьНастройкиРМКНаКлиенте()
	РезультатВыполнения = СохранитьНастройкиРМКНаСервере();
	
	Если НЕ РезультатВыполнения.ВыполненоУспешно Тогда
		
		ПоказатьПредупреждение(, РезультатВыполнения.ТекстПредупрежденийОшибок);
		
	Иначе
		
		ПараметрыОповещения = Новый Структура();
		ПараметрыОповещения.Вставить("РабочееМестоКассираУспешноНастроено", Истина);
		ОткрытаФормаСписка = Ложь;
		ИмяФормыСписка = НСтр("ru = ''");
		Если ЭтотОбъект.ВладелецФормы <> Неопределено Тогда
			Если ТипЗнч(ЭтотОбъект.ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
				ИмяФормыСписка = ЭтотОбъект.ВладелецФормы.ИмяФормы;
			ИначеЕсли ТипЗнч(ЭтотОбъект.ВладелецФормы) = Тип("ТаблицаФормы") Тогда
				ИмяФормыСписка = ЭтотОбъект.ВладелецФормы.Имя;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяФормыСписка)
			И (Найти(ИмяФормыСписка, НСтр("ru = 'ФормаСписка'")) > 0
				Или Найти(ИмяФормыСписка, НСтр("ru = 'Список'")) > 0) Тогда
			ОткрытаФормаСписка = Истина;
		КонецЕсли;
		ПараметрыОповещения.Вставить("ОткрытаФормаСписка", ОткрытаФормаСписка);
		Оповестить("РабочееМестоКассираУспешноНастроено", ПараметрыОповещения, ЭтотОбъект);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьРасписаниеОчисткиАрхивныхЧеков()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.ОчисткаАрхивныхЧеков);
	ТекущиеЗадания	= РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	РасписаниеИзменено = (РасписаниеУдаленияАрхивныхЧековИзменено
		И Не РасписаниеУдаленияАрхивныхЧеков = Неопределено);
	ИспользованиеЗадания = (Элементы.ОчисткаАрхивныхЧеков.Доступность
		И Не РасписаниеУдаленияАрхивныхЧеков = Неопределено);
	
	Если ЗначениеЗаполнено(ТекущиеЗадания) Тогда
		
		РасписаниеЗадания = РасписаниеУдаленияАрхивныхЧеков;
		Если РасписаниеЗадания = Неопределено Тогда
			РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
		КонецЕсли;
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Использование", ИспользованиеЗадания);
		ПараметрыЗадания.Вставить("Расписание", РасписаниеЗадания);
		Для Каждого ТекущееЗадание Из ТекущиеЗадания Цикл
			РегламентныеЗаданияСервер.ИзменитьЗадание(ТекущееЗадание, ПараметрыЗадания);
		КонецЦикла;
		
	ИначеЕсли ИспользованиеЗадания Тогда
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Использование", ИспользованиеЗадания);
		ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОчисткаАрхивныхЧеков);
		ПараметрыЗадания.Вставить("Ключ", Строка(Новый УникальныйИдентификатор));
		ПараметрыЗадания.Вставить("Расписание", РасписаниеУдаленияАрхивныхЧеков);
		
		РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		
	КонецЕсли;
	РасписаниеУдаленияАрхивныхЧековИзменено = Ложь;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВариантИнтерфейсаПользователя(Команда)
	
	Если НеобходимоСохранитьВариантИнтерфейса Тогда
		ЗаписатьВариантИнтерфейсаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВариантИнтерфейсаНаСервере()
	
	СтандартнаяОбработка = Истина;
	ОбщегоНазначенияРМКПереопределяемый.ЗаписатьВариантИнтерфейсаНаСервере(ЭтотОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ИмяПользователя = Неопределено;
		Если ЗначениеЗаполнено(ПользовательВариантаИнтерфейса) Тогда
			ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПользовательВариантаИнтерфейса, "ИдентификаторПользователяИБ");
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
			ИмяПользователя = ПользовательИБ.Имя;
		КонецЕсли;
		
		НастройкиКлиентскогоПриложения = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения",,, ИмяПользователя);
		Если НастройкиКлиентскогоПриложения = Неопределено Тогда
			НастройкиКлиентскогоПриложения = Новый НастройкиКлиентскогоПриложения();
		КонецЕсли;
		НастройкиКлиентскогоПриложения.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения[ВариантИнтерфейса];
		НастройкиКлиентскогоПриложения.ВариантМасштабаКлиентскогоПриложения = ВариантМасштабаКлиентскогоПриложения[ВариантМасштабаИнтерфейса85];
		НастройкиКлиентскогоПриложения.ТемаКлиентскогоПриложения = ТемаКлиентскогоПриложения[ВариантТемыИнтерфейса85];
		
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",,НастройкиКлиентскогоПриложения,, ИмяПользователя);
		
		НеобходимоСохранитьВариантИнтерфейса = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаЗагрузкаНастроек

&НаКлиенте
Процедура ВыбратьФайлНаКлиенте(ДляЗагрузки = Ложь, ПалитрыДляВыгрузки = Неопределено, ВыгружатьКонтрольПродаж = Ложь)
	
	РежимДиалогаВыбора = ?(ДляЗагрузки, РежимДиалогаВыбораФайла.Открытие, РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбора);
	Если ПалитрыДляВыгрузки = Неопределено Тогда
		ДиалогОткрытияФайла.Фильтр = НСтр("ru = 'НастройкиРМК (*.xml)|*.xml'");
		ДиалогОткрытияФайла.ПолноеИмяФайла = НСтр("ru = 'НастройкиРМК'");
	Иначе
		ДиалогОткрытияФайла.Фильтр = НСтр("ru = 'ПалитраТоваров (*.xml)|*.xml'");
		ДиалогОткрытияФайла.ПолноеИмяФайла = НСтр("ru = 'ПалитраТоваров'");
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДляЗагрузки", ДляЗагрузки);
	ДополнительныеПараметры.Вставить("ВыгружатьОбщиеНастройки", Ложь);
	ДополнительныеПараметры.Вставить("ВыгружатьПалитруИзбранных", Ложь);
	ДополнительныеПараметры.Вставить("ВыгружатьПалитруПлитки", Ложь);
	ДополнительныеПараметры.Вставить("ВыгружатьКонтрольПродаж", Ложь);
	
	Если ВыгружатьКонтрольПродаж Тогда
		ДополнительныеПараметры.ВыгружатьКонтрольПродаж = Истина;
	ИначеЕсли ПалитрыДляВыгрузки = Неопределено Тогда
		ДополнительныеПараметры.ВыгружатьОбщиеНастройки = Истина;
		ДополнительныеПараметры.ВыгружатьПалитруИзбранных = Истина;
		ДополнительныеПараметры.ВыгружатьПалитруПлитки = Истина;
	Иначе
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ПалитрыДляВыгрузки);
	КонецЕсли;
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыбранФайл", ЭтотОбъект, ДополнительныеПараметры);
	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОповещениеВыбора, ДиалогОткрытияФайла);
	
КонецПроцедуры

&НаСервере
Функция НастройкиВФорматеXML(ПараметрыВыгрузки)
	
	СтруктураНастроек = Новый Структура;
	Если ПараметрыВыгрузки.ВыгружатьОбщиеНастройки Тогда
		ОбщегоНазначенияРМКПереопределяемый.СформироватьСтруктуруНастроек(СтруктураНастроек, НастройкиРМК);
		Если СтруктураНастроек.Свойство("НастройкаРМК_ИзображениеПриНачалеПродажи")
				И ЗначениеЗаполнено(СтруктураНастроек.НастройкаРМК_ИзображениеПриНачалеПродажи) Тогда
				
			Справочники.НастройкиРабочегоМестаКассира.ДобавитьВСтруктуруНастроекФайлЗаставки(СтруктураНастроек);
				
		КонецЕсли;
	КонецЕсли;

	КорневыеПалитры = Новый Массив;
	Если ПараметрыВыгрузки.ВыгружатьПалитруИзбранных Тогда
		ПалитраТоваровДляФормирования = Новый Массив;
		ПалитраТоваровДляФормирования.Добавить(НастройкиРМК.СтруктураБыстрыхТоваров);
		КорневыеПалитры.Добавить(НастройкиРМК.СтруктураБыстрыхТоваров);
		Справочники.НастройкиРабочегоМестаКассира.ДобавитьВСтруктуруНастроекПалитруТоваров(
			ПалитраТоваровДляФормирования, СтруктураНастроек);
	КонецЕсли; 
	
	Если ПараметрыВыгрузки.ВыгружатьПалитруПлитки Тогда
		ПалитраТоваровДляФормирования = Новый Массив;
		ПалитраТоваровДляФормирования.Добавить(НастройкиРМК.СтруктураПлиточногоИнтерфейсаПодбора);
		КорневыеПалитры.Добавить(НастройкиРМК.СтруктураПлиточногоИнтерфейсаПодбора);
		Справочники.НастройкиРабочегоМестаКассира.ДобавитьВСтруктуруНастроекПалитруТоваров(
			ПалитраТоваровДляФормирования, СтруктураНастроек, Истина);
	КонецЕсли;
	
	Если КорневыеПалитры.Количество() > 0 Тогда
		ВложенныеПалитры = ИнтерфейсРМКСлужебный.ПолучитьВложенныеПалитры(КорневыеПалитры);
		Если ВложенныеПалитры.Количество() > 0 Тогда
			Справочники.НастройкиРабочегоМестаКассира.ДобавитьВСтруктуруНастроекПалитруТоваров(
				ВложенныеПалитры, СтруктураНастроек, Ложь, "ВложенныеПалитры");
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыВыгрузки.ВыгружатьКонтрольПродаж Тогда
		Справочники.НастройкиРабочегоМестаКассира.ДобавитьВСтруктуруНастроекКонтрольПродаж(СтруктураНастроек);
	КонецЕсли;
	
	ТекстXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураНастроек);
	
	Возврат ТекстXML;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкиИзXML(ТекстXML, ЕстьОшибки, ТекстОписанияОшибки)
	
	Если НастройкиРМК.Ссылка.Пустая() Тогда
		ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
		НастройкаРМКОбъект = Справочники.НастройкиРабочегоМестаКассира.СоздатьЭлемент();
		НастройкаРМКОбъект.РабочееМесто = ТекущееРабочееМесто;
	Иначе
		НастройкаРМКОбъект = НастройкиРМК.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Справочники.НастройкиРабочегоМестаКассира.ЗагрузитьНастройкиИзXML(ТекстXML, ЕстьОшибки, НастройкаРМКОбъект, ТекстОписанияОшибки);
		ЗаполнитьКомплектациюОборудованияПоДаннымИБ();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыПослеЗагрузкиИзXMLНаСервере(ПредыдущийСценарий, СтруктураВлияющихНастроек)
	
	АктуализироватьЭлементыФормы();
	Если Не НастройкиРМК.СценарийИспользования = ПредыдущийСценарий Тогда
		ВыделитьСценарийИспользования();
	КонецЕсли;
	
	ПостроитьПредпросмотрПлиточногоИнтерфейсаСервер(СтруктураВлияющихНастроек);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыПослеРедактированияОбластей(СтруктураВлияющихНастроек)
	
	АктуализироватьЭлементыФормы();
	ПостроитьПредпросмотрПлиточногоИнтерфейсаСервер(СтруктураВлияющихНастроек);
	Модификация = ЛожЬ;
	НастроитьЗначениеЭлементаЗакрытьПодбор(НастройкиРМК, Модификация);
	Если Модификация Тогда
		УстановитьВидимостьФорматаКорзиныПлиточногоИнтерфейса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьРеквизитыПалитры()
	
	ПараметрыНастройки = Новый Структура();
	ПараметрыНастройки.Вставить("Палитра", НастройкиРМК.СтруктураПлиточногоИнтерфейсаПодбора);
	ПараметрыНастройки.Вставить("ЭтоГоризонтальнаяОриентация", НЕ НастройкиРМК.ВертикальнаяОриентация);
	
	ДанныеРазмеров = ПолучитьРеквизитыПалитры(ПараметрыНастройки);
	ЗаполнитьЗначенияСвойств(РеквизитыПалитры, ДанныеРазмеров);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПалитры(ВыгружатьПалитруИзбранных, ВыгружатьПалитруПлитки)
	
	Если НастройкиРМК.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, НСтр("ru='Сначала сохраните настройку.'"));
		Возврат;
	КонецЕсли;
	
	Если ВыгружатьПалитруИзбранных И Не ЗначениеЗаполнено(НастройкиРМК.СтруктураПлиточногоИнтерфейсаПодбора) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Палитра плиточного подбора товаров не выбрана.'"));
		Возврат;
	КонецЕсли;
	
	Если ВыгружатьПалитруПлитки И Не ЗначениеЗаполнено(НастройкиРМК.СтруктураБыстрыхТоваров) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Палитра избранных товаров не выбрана.'"));
		Возврат;
	КонецЕсли;
	
	ПалитрыДляВыгрузки = Новый Структура;
	ПалитрыДляВыгрузки.Вставить("ВыгружатьПалитруПлитки", ВыгружатьПалитруПлитки);
	ПалитрыДляВыгрузки.Вставить("ВыгружатьПалитруИзбранных", ВыгружатьПалитруИзбранных);
	
	ВыбратьФайлНаКлиенте(,ПалитрыДляВыгрузки);
	
КонецПроцедуры

#КонецОбласти

#Область СписокОборудования
&НаКлиенте
Процедура НастроитьОборудование()
	ТекущиеДанные = Элементы.СписокУстройств.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьПараметровПодключаемогоОборудования(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область Поиск

&НаСервере
Процедура ЗаполнитьТаблицуПоиска()
	Для Каждого СтраницаНастроек Из Элементы.СтраницыНастроек.ПодчиненныеЭлементы Цикл
		Для Каждого Элемент Из СтраницаНастроек.ПодчиненныеЭлементы Цикл
			ЗаголовкиЭлементов = ПолучитьЗаголовкиПодчиненныхЭлементовГруппыРекурсивно(Элемент);
			Для Каждого КлючЗначение Из ЗаголовкиЭлементов Цикл
				ДобавитьСтрокиПоискаВСловарь(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаголовкиПодчиненныхЭлементовГруппыРекурсивно(Элемент)
	
	Результат = Новый Соответствие;
	Если НЕ Элемент.Видимость Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Или ТипЗнч(Элемент) = Тип("СтраницаФормы") Тогда
		Для Каждого ЭлементГруппы Из Элемент.ПодчиненныеЭлементы Цикл
			ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(Результат, ПолучитьЗаголовкиПодчиненныхЭлементовГруппыРекурсивно(ЭлементГруппы));
		КонецЦикла;
	ИначеЕсли ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
		ЗаголовокЭлемента = ЗаголовокЭлемента(Элемент);
		Если ЗначениеЗаполнено(ЗаголовокЭлемента) Тогда
			Результат.Вставить(Элемент.Имя, ЗаголовокЭлемента);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаголовокЭлемента(Элемент)
	
	Если ЗначениеЗаполнено(Элемент.Заголовок) Тогда
		Возврат Элемент.Заголовок;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
		ЗаголовокЭлемента = ЗаголовокРеквизитаФормы(Элемент.ПутьКДанным);
	ИначеЕсли ТипЗнч(Элемент) = Тип("КнопкаФормы")
		И ЗначениеЗаполнено(Элемент.ИмяКоманды) Тогда
		ЗаголовокЭлемента = Команды[Элемент.ИмяКоманды].Заголовок;
	Иначе
		ЗаголовокЭлемента = "";
	КонецЕсли;
	
	Возврат ЗаголовокЭлемента;
	
КонецФункции

&НаСервере
Функция ЗаголовокРеквизитаФормы(ИмяРеквизита)
	
	ЗаполнитьЗаголовкиРеквизитовФормы();
	Результат = ЗаголовкиРеквизитовФормы.НайтиПоЗначению(ИмяРеквизита);
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Представление;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЗаголовкиРеквизитовФормы()
	
	Если ЗаголовкиРеквизитовФормы.Количество() <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВсеРеквизитыФормы = ПолучитьРеквизиты();
	Для Каждого РеквизитФормы Из ВсеРеквизитыФормы Цикл
		ЗаголовкиРеквизитовФормы.Добавить(РеквизитФормы.Имя, РеквизитФормы.Заголовок);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиПоискаВСловарь(Элемент, СтрокаПоиска)
	
	Если ТипЗнч(СтрокаПоиска) = Тип("Массив") Тогда
		СтрокиПоиска = СтрокаПоиска;
	Иначе
		СтрокиПоиска = Новый Массив;
		СтрокиПоиска.Добавить(СтрокаПоиска);
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("Строка") Тогда
		ИмяЭлемента = Элемент;
	Иначе
		ИмяЭлемента = Элемент.Имя;
	КонецЕсли;
	
	Для Каждого СтрокаСписка Из СтрокиПоиска Цикл
		ПриведеннаяСтрокаПоиска = НРег(СтрокаСписка);
		ОтборСтрокаПоиска = Новый Структура;
		ОтборСтрокаПоиска.Вставить("ИмяЭлемента", ИмяЭлемента);
		ОтборСтрокаПоиска.Вставить("СтрокаПоиска", ПриведеннаяСтрокаПоиска);
		
		Строки = СловарьПоиска.НайтиСтроки(ОтборСтрокаПоиска);
		Если Строки.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СловарьПоиска.Добавить(), ОтборСтрокаПоиска);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроцентСхожестиСтрок(МассивНГраммПоисковойСтроки, МассивНГраммСловаря)
	
	Если МассивНГраммПоисковойСтроки.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	КоличествоСовпавшихНГрамм = ЭлементыВходногоМассиваПрисутствующиеВИскомом(
		МассивНГраммПоисковойСтроки,
		МассивНГраммСловаря).Количество();
	
	Возврат ПроцентОт(КоличествоСовпавшихНГрамм, МассивНГраммПоисковойСтроки.Количество());
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроцентОт(Значение, ЗначениеОт)
	
	Возврат Значение * 100 / ЗначениеОт;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭлементыВходногоМассиваПрисутствующиеВИскомом(ВходнойМассив, ИсковыйМассив)
	
	Результат = Новый Массив;
	
	Для Каждого Значение Из ВходнойМассив Цикл
		Если ИсковыйМассив.Найти(Значение) <> Неопределено Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьНГраммыСтроки(Знач ИсходнаяСтрока)
	
	НГраммыСтроки = Новый Массив;
	
	ИсходнаяСтрока = НРег(ИсходнаяСтрока);
	СловаИсходнойСтроки = СтрРазделить(ИсходнаяСтрока, " ", Ложь);
	
	Для Каждого Слово Из СловаИсходнойСтроки Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НГраммыСтроки, НГраммыСлова(Слово));
	КонецЦикла;
	
	Возврат НГраммыСтроки;
	
КонецФункции

&НаСервере
Функция НГраммыСлова(Слово)
	
	НГраммыСлова = Новый Массив;
	
	Для Итератор = 0 По СтрДлина(Слово) - 3 Цикл
		НГрамма = "";
		Для ИтераторНГраммы = 0 По 2 Цикл
			НГрамма = НГрамма + Сред(Слово, ИтераторНГраммы + 1 + Итератор, 1);
		КонецЦикла;
		НГраммыСлова.Добавить(НГрамма);
	КонецЦикла;
	
	Возврат НГраммыСлова;
	
КонецФункции

&НаСервере
Процедура СкрытьВсеЭлементыСтраницНастроек()
	
	Для Каждого СтраницаНастроек Из Элементы.СтраницыНастроек.ПодчиненныеЭлементы Цикл
		
		СкрытьВсеЭлементыСтраницыНастроек(СтраницаНастроек);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СкрытьВсеЭлементыСтраницыНастроек(СтраницаНастроек)
	
	Для Каждого ЭлементФормы Из СтраницаНастроек.ПодчиненныеЭлементы Цикл
		
		Если ЭтоГруппаФормы(ЭлементФормы)
			Или ЭтоСтраницыФормы(ЭлементФормы)
			Или ЭтоСтраницаФормы(ЭлементФормы) Тогда
			СкрытьВсеЭлементыСтраницыНастроек(ЭлементФормы);
		Иначе
			НоваяСтрока = КэшЭлементовНастроек.Добавить();
			НоваяСтрока.ИмяЭлемента = ЭлементФормы.Имя;
			НоваяСтрока.Видимость = ЭлементФормы.Видимость;
			
			ЭлементФормы.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЭтоГруппаФормы(ЭлементФормы)
	
	Возврат ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы")
		И ЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
КонецФункции

&НаСервере
Функция ЭтоСтраницыФормы(ЭлементФормы)
	
	Возврат ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы")
		И ЭлементФормы.Вид = ВидГруппыФормы.Страницы;
КонецФункции

&НаСервере
Функция ПоказатьНайденныеПоискомЭлементы(Результат)
	
	СтраницыСНастройками = Новый Массив;
	
	Для Каждого КлючЗначение Из Результат Цикл
		
		ИмяЭлемента = КлючЗначение.Ключ;
		Элемент = Элементы[ИмяЭлемента];
		
		РодительДляОтображения = ВерхнийЭлементРодительНастройки(Элемент);
		СледующийРодитель = РодительДляОтображения.Родитель;

		ПоказатьСодержимоеПодчиненныхСворачиваемыхГрупп(РодительДляОтображения);
		
		ДанныеЭлементов = КэшЭлементовНастроек.НайтиСтроки(Новый Структура("ИмяЭлемента", РодительДляОтображения.Имя));
		
		Если ДанныеЭлементов.Количество() <> 0
			И ДанныеЭлементов[0].Видимость Тогда
			
			РодительДляОтображения.Видимость = Истина;
			СтраницаРодитель = РодительДляОтображения.Родитель;
			
			Если СтраницыСНастройками.Найти(СтраницаРодитель.Имя) = Неопределено Тогда
				СтраницыСНастройками.Добавить(СтраницаРодитель.Имя);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтраницыСНастройками;
	
КонецФункции

&НаСервере
Процедура ПоказатьСодержимоеПодчиненныхСворачиваемыхГрупп(ГруппаФормы)
	
	Если ТипЗнч(ГруппаФормы) <> Тип("ГруппаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПодчиненныйЭлемент Из ГруппаФормы.ПодчиненныеЭлементы Цикл
		ПоказатьСодержимоеПодчиненныхСворачиваемыхГрупп(ПодчиненныйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВерхнийЭлементРодительНастройки(Элемент)
	
	РодительТекущегоЭлемента = Элемент.Родитель;
	СледующийРодитель = РодительТекущегоЭлемента.Родитель;
	
	Если (ЭтоСтраницаФормы(СледующийРодитель) 
		ИЛИ ЭтоГруппаФормы(СледующийРодитель)) Тогда
		Возврат Элемент;
	КонецЕсли;
	
	Если ЭтоСтраницаФормы(РодительТекущегоЭлемента) Тогда
		Возврат Элемент;
	КонецЕсли;
	
	Возврат ВерхнийЭлементРодительНастройки(РодительТекущегоЭлемента);
	
КонецФункции

&НаСервере
Функция ЭтоСтраницаФормы(ЭлементФормы)
	
	Возврат ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы")
		И ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьРазделовРекурсивно()
	
	Для Каждого ОписаниеРаздела Из СписокРазделов Цикл
		
		СтраницаФормы = Элементы.Найти(ОписаниеРаздела.Имя);
		Если СтраницаФормы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеРаздела.КэшВидимости = ОписаниеРаздела.Видимость;
		
		ОписаниеРаздела.Видимость = ЕстьВидимыеЭлементыВнутриЭлемента(СтраницаФормы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЕстьВидимыеЭлементыВнутриЭлемента(ПроверяемыйЭлементФормы)
	
	ЭтоГруппа = ТипЗнч(ПроверяемыйЭлементФормы) = Тип("ГруппаФормы");
	
	Если ЭтоГруппа И НЕ ПроверяемыйЭлементФормы.Видимость Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Возврат ПроверяемыйЭлементФормы.Видимость;
	КонецЕсли;
	
	Для Каждого ЭлементФормы Из ПроверяемыйЭлементФормы.ПодчиненныеЭлементы Цикл
		ЕстьВидимыеЭлементыВнутриЭлемента = ЕстьВидимыеЭлементыВнутриЭлемента(ЭлементФормы);
		Если ЕстьВидимыеЭлементыВнутриЭлемента Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ВосстановитьИсходнуюВидимостьНастроек()
	
	Для каждого ДанныеЭлемента Из КэшЭлементовНастроек Цикл
		Элементы[ДанныеЭлемента.ИмяЭлемента].Видимость = ДанныеЭлемента.Видимость;
	КонецЦикла;
	
	ВосстановитьВидимостьРазделов();
	
	КэшЭлементовНастроек.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьВидимостьРазделов()
	
	Для Каждого ОписаниеРаздела Из СписокРазделов Цикл
		
		СтраницаФормы = Элементы.Найти(ОписаниеРаздела.Имя);
		Если СтраницаФормы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеРаздела.Видимость = ОписаниеРаздела.КэшВидимости;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область РабочееМестоКассира
&НаСервере
Процедура УстановитьВидимостьЭлементыДляКассира()
	Если Не РабочееМестоКассира
		Или СписокВидимыхРазделовКассира.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаРаздела Из СписокРазделов Цикл
		СтрокиТаблицы = СписокВидимыхРазделовКассира.НайтиСтроки(Новый Структура("ИмяРаздела", СтрокаРаздела.Имя));
		Если СтрокиТаблицы.Количество() = 0 Тогда
			СтрокаРаздела.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПомощникНастройкиКассовогоМеста
&НаКлиенте
Процедура ПереключательПриИзменении()
	ВладелецФормы.ФормаНастроекОткрыта = Ложь;
	ВладелецФормы.ПереключательСтраниц = ПереключательСтраниц;
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область РаспределениеПродаж
&НаКлиенте
Процедура УстановитьВидимостьГруппКатегорий()
	
	УстановитьВидимостьЭлементаФормы(Элементы.НастройкиРМКРаспределениеНоменклатурыГруппаНоменклатуры, НастройкиРМК.ГруппыКатегории = 0);
	УстановитьВидимостьЭлементаФормы(Элементы.НастройкиРМКРаспределениеНоменклатурыКатегорияНоменклатуры, НастройкиРМК.ГруппыКатегории = 1);
	
	ЕстьЕСХН = Ложь;
	ОбщегоНазначенияРМККлиентПереопределяемый.ПроверитьНаличиеЕСХН(НастройкиРМК.РаспределениеНоменклатуры, ЕстьЕСХН);
	
	Если Не ЕстьЕСХН Тогда
		Для Каждого СтрокаРаспределения Из НастройкиРМК.РаспределениеНоменклатуры Цикл
			СтрокаРаспределения.УчетНДС = Ложь;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьВидимостьЭлементаФормы(Элементы.НастройкиРМКРаспределениеНоменклатурыУчетНДС, ЕстьЕСХН);
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура УстановитьДоступностьОчисткиАрхивныхЧеков()
	
	ОчисткаАрхивныхЧеков = НастройкиРМК.УдалятьАрхивныеЧеки;
	УстановитьДоступностьУдаленияАрхивныхЧеков(ОчисткаАрхивныхЧеков);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьУдаленияАрхивныхЧеков(УдалятьАрхивныеЧеки = Истина)
	
	ОчисткаДоступна = Ложь;
	Если УдалятьАрхивныеЧеки Тогда
		СрокХранения = НастройкиРМК.СрокХраненияАрхивныхЧеков;
		ОчисткаДоступна = (ЗначениеЗаполнено(СрокХранения) И Не ЭтоСрокХраненияВесьПериод(СрокХранения));
	КонецЕсли;
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаСрокОчисткаАрхивныхЧеков, УдалятьАрхивныеЧеки);
	УстановитьТекстНадписиРегламентнойНастройки(Элементы.ОчисткаАрхивныхЧеков,
		РасписаниеУдаленияАрхивныхЧеков);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПечатиЗаказа()
	НеПечататьЗаказ = НастройкиРМК.СпособПечатиЗаказаПокупателя = 0;
	УстановитьДоступностьЭлементаФормы(Элементы.НастройкиРМКПечатьЗаказаПриПробитииЧека, НЕ НеПечататьЗаказ);
	УстановитьДоступностьЭлементаФормы(Элементы.НастройкиРМКПечататьЗаказПриСоздании, НЕ НеПечататьЗаказ);
	Если НеПечататьЗаказ Тогда
		НастройкиРМК.ПечатьЗаказаПриПробитииЧека = Ложь;
		НастройкиРМК.ПечататьЗаказПриСоздании = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	РазблокироватьДанныеДляРедактирования(НастройкиРМК.Ссылка, УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ОтразитьДанныеПоОтображениюQR()
	ПоказыватьQRОплатыКартой = Не НастройкиРМК.СкрыватьQRОплатыКартой И НастройкиРМК.ИспользоватьОплатуПлатежнымиКартами;
	ПоказыватьQRОплатыНаличными = Не НастройкиРМК.СкрыватьQRОплатыНаличными И НастройкиРМК.ИспользоватьОплатуНаличными;
	ПоказыватьQRОплатыСБП = Не НастройкиРМК.СкрыватьQRСБП И НастройкиРМК.ИспользоватьОплатуПлатежнымиСистемами;
КонецПроцедуры

&НаСервере
Процедура ПроверитьАктуальностьИзображенияНачалаПродажи()
	
	ИскатьИзображение = Истина;
	Если ЗначениеЗаполнено(НастройкиРМК.ИзображениеПриНачалеПродажи) Тогда
		
		Если ОбщегоНазначения.СсылкаСуществует(НастройкиРМК.ИзображениеПриНачалеПродажи) Тогда
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкиРМК.ИзображениеПриНачалеПродажи, "ПометкаУдаления") Тогда
				ОчиститьИзображениеНачалаПродажСервер(НастройкиРМК.ИзображениеПриНачалеПродажи);
			Иначе
				ИскатьИзображение = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	Если ИскатьИзображение Тогда
		НастройкиРМК.ИзображениеПриНачалеПродажи
			= Справочники.НастройкиРабочегоМестаКассира.ПолучитьИзображениеНастройки(НастройкиРМК.Ссылка);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОчисткуАрхивныхЧеков()
	
	ПараметрыОчистки = Новый Массив;
	ИмяФоновогоЗадания = "ОчисткаАрхивныхЧеков";
	ИмяПроцедуры = "ОбщегоНазначенияРМК.ОчиститьАрхивныеЧеки";
	
	Результат = ОчиститьИсториюОперацийНаСервере(ИмяФоновогоЗадания, ИмяПроцедуры, ПараметрыОчистки);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиMAX()
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаПодтверждениеВозрастаЧерезMAX,
		НастройкиРМК.ИспользоватьКонтрольПродаж);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаПоказыватьНаДисплеиПокупателяQRMAX,
		НастройкиРМК.ИспользоватьКонтрольПродаж И НастройкиРМК.ИспользоватьПодтверждениеВозрастаЧерезMAX);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаПоказыватьНаДисплеиПокупателяQRMAXСтатусовПокупателя,
		НастройкиРМК.ИспользоватьПодтверждениеСтатусовПокупателяЧерезMAX);
	Если Не НастройкиРМК.ИспользоватьКонтрольПродаж Тогда
		НастройкиРМК.ИспользоватьПодтверждениеВозрастаЧерезMAX = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзображениеДляНачалаПродаж()
	
	Если НастройкиРМК.Ссылка.Пустая() Тогда
		
		ВозможныеДействия = ДействияПослеСохраненияНастроек();
		ДополнительныеПараметры = Новый Структура("ИмяДействия", ВозможныеДействия.ВыбратьИзображениеНачалаПродаж);
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветСохраненияНастроек", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru = 'Перед выбором изображения настройки будут записаны.
			|Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ВыбратьИзображениеДляНачалаПродажПродолжение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзображениеДляНачалаПродажПродолжение()
	
	ИдентификаторФайла = Новый УникальныйИдентификатор;
	РаботаСФайламиКлиент.ДобавитьФайлы(НастройкиРМК.Ссылка, ИдентификаторФайла, РасширенияИзображений());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзображениеНачалаПродажи(СсылкаНаФайл)
	
	Если ЗначениеЗаполнено(НастройкиРМК.ИзображениеПриНачалеПродажи) Тогда
		ОчиститьИзображениеНачалаПродажСервер(НастройкиРМК.ИзображениеПриНачалеПродажи);
	КонецЕсли;
	НастройкиРМК.ИзображениеПриНачалеПродажи = СсылкаНаФайл;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИзображениеНачалаПродаж()
	
	Если ЗначениеЗаполнено(НастройкиРМК.ИзображениеПриНачалеПродажи) Тогда
		ОчиститьИзображениеНачалаПродажСервер(НастройкиРМК.ИзображениеПриНачалеПродажи);
		НастройкиРМК.ИзображениеПриНачалеПродажи = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьИзображениеНачалаПродажСервер(СсылкаНаФайл)
	
	УстановитьПривилегированныйРежим(Истина);
	НаборСведений = РегистрыСведений.СведенияОФайлах.СоздатьНаборЗаписей();
	НаборСведений.Отбор.Файл.Установить(СсылкаНаФайл);
	НаборСведений.Прочитать();
	Если НаборСведений.Количество() > 0 Тогда
		НаборСведений.Записать(РежимЗамещения.Удаление);
	КонецЕсли;
	ИзображениеОбъект = СсылкаНаФайл.ПолучитьОбъект();
	ИзображениеОбъект.Удалить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИзображениеНачалаПродаж()
	
	Если ЗначениеЗаполнено(НастройкиРМК.ИзображениеПриНачалеПродажи) Тогда
		ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(НастройкиРМК.ИзображениеПриНачалеПродажи,
			УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветСохраненияНастроек(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		РезультатВыполнения = СохранитьНастройкиРМКНаСервере();
		Если НЕ РезультатВыполнения.ВыполненоУспешно Тогда
			ПоказатьПредупреждение(, РезультатВыполнения.ТекстПредупрежденийОшибок);
		Иначе
			ВыполнитьЗапланированноеДействиеПослеСохраненияНастроек(ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапланированноеДействиеПослеСохраненияНастроек(ДополнительныеПараметры)
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("ИмяДействия") Тогда
		ВозможныеДействия = ДействияПослеСохраненияНастроек();
		Если ДополнительныеПараметры.ИмяДействия = ВозможныеДействия.ОткрытьНастройкиОбластей Тогда
			ОткрытьНастройкиОбластей();
		ИначеЕсли ДополнительныеПараметры.ИмяДействия = ВозможныеДействия.ВыбратьИзображениеНачалаПродаж Тогда
			ВыбратьИзображениеДляНачалаПродажПродолжение();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция РасширенияИзображений()
	
	ПереченьРасширений = СтрШаблон(НСтр("ru = 'Все изображения (%1)|%1"
		                            + "|Все файлы(*.*)|*.*"
		                            + "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
		                            + "|Формат GIF(*.gif*)|*.gif"
		                            + "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
		                            + "|Формат PNG(*.png*)|*.png"
		                            + "|Формат TIFF(*.tif)|*.tif"
		                            + "|Формат icon(*.ico)|*.ico"
		                            + "|Формат Svg(*.svg)|*.svg"
		                            + "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'"),
		"*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.svg;*.wmf;*.emf");
	Возврат ПереченьРасширений;
									
КонецФункции

&НаКлиенте
Функция ДействияПослеСохраненияНастроек()
	
	РезультатФункции = Новый Структура();
	
	РезультатФункции.Вставить("ОткрытьНастройкиОбластей", 0);
	РезультатФункции.Вставить("ВыбратьИзображениеНачалаПродаж", 1);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура НастройкиРМКУказыватьПричинуВозвратаПриИзмененииНаСервере()
	ИмяКонстанты = ОбщегоНазначенияРМК.ИмяКонстанты("УказыватьПричинуВозвратов");
	СохранитьЗначениеКонстанты(ИмяКонстанты, НастройкиРМК.УказыватьПричинуВозврата);
КонецПроцедуры

&НаКлиенте
Процедура ТипОбменаПриИзменении(Элемент)
	
	Если ТипОбмена = 0
		И НастройкаККМEDСуществует Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбУдаленииНастроекККМED", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Существует настроенный обмен через формат ККМ ED.
			|Настройки обмена будут удалены.
			|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		УстановитьВидимостьЭлементовНастроекОбмена();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбУдаленииНастроекККМED(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УдалитьУзелОбменаККМED();
		УстановитьВидимостьЭлементовНастроекОбмена();
	Иначе
		ТипОбмена = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьУзелОбменаККМED()

	ОбщегоНазначенияРМК.УдалитьУзелОбменаККМED();
	НастройкаККМEDСуществует = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовНастроекОбмена()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НастройкиОбменаСДругимиПрограммами",
		"Видимость",
		НЕ НастройкаСинхронизацииСуществует
		И ТипОбмена = 0);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НастройкаОбменаККМED",
		"Видимость",
		НЕ НастройкаККМEDСуществует
		И ТипОбмена = 1);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗагрузкаВыгрузкаДанныхККМED",
		"Видимость",
		НастройкаККМEDСуществует
		И ТипОбмена = 1);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НастройкиСинхронизацииДанных",
		"Видимость",
		НастройкаСинхронизацииСуществует
		И ТипОбмена = 0);
		
КонецПроцедуры

#КонецОбласти
