
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВывестиБаннеры();
	
	ОбработатьПараметры(Параметры);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов") Тогда 
		
		// Установим настройки формы для случая открытия в режиме выбора
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
		Элементы.Список.МножественныйВыбор = ?(Параметры.ЗакрыватьПриВыборе = Неопределено, Ложь, Не Параметры.ЗакрыватьПриВыборе);
		Если Параметры.РежимВыбора Тогда
			КлючНазначенияИспользования = "ВыборПодбор";
			РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Иначе
			КлючНазначенияИспользования = "Список";
		КонецЕсли;
		
	КонецЕсли;
	
	ОпределитьИнтерфейсПриСоздании();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ИспользоватьНесколькоВидовЗаказов() Тогда
		ПараметрыФормы = Новый Структура("Ключ", ПредопределенноеЗначение("Справочник.ВидыЗаказНарядов.Основной"));
		ОткрытьФорму("Справочник.ВидыЗаказНарядов.Форма.ФормаЭлемента", ПараметрыФормы);     
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбраннаяСтрока) <> Тип("СправочникСсылка.ВидыЗаказНарядов")
		Или Не ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПервоеВключениеЗаявок Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкаПроцессов");
	ПараметрыФормы.Вставить("ПервоеВключениеЗаявок");
	ПараметрыФормы.Вставить("Ключ", ВыбраннаяСтрока);
	ОткрытьФорму("Справочник.ВидыЗаказНарядов.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиБаннеры()
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Заявки настраиваются через процессы отдельно для каждого вида заказов.
	|Выберите вид заказа, чтобы перейти к процессам, и установите режим ""Заявка"" для необходимых состояний'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Первая настройка заявок'");
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.Баннер);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользоватьНесколькоВидовЗаказов()
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов");
	
КонецФункции

&НаСервере
Процедура ОбработатьПараметры(Параметры)
	
	ПервоеВключениеЗаявок = Параметры.Свойство("ПервоеВключениеЗаявок");
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьИнтерфейсПриСоздании()
	
	Элементы.Баннер.Видимость = ПервоеВключениеЗаявок;
	
КонецПроцедуры

#КонецОбласти
