
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Договор, Контрагент, Организация, Ответственный,
		|Период, Состояние, СтатусПриглашения, ТипДокумента, ТипРегламента");
	
	ШаблонЗаголовка = НСтр("ru='Дополнительные фильтры (%1)'");
	Элементы.КомандаДополнительныеФильтры.Заголовок = СтрШаблон(ШаблонЗаголовка, Параметры.КоличествоДополнительныхОтборов);
	Элементы.КомандаДополнительныеФильтры.Видимость = Параметры.КоличествоДополнительныхОтборов <> 0;
	
	Элементы.Ответственный.Видимость = Параметры.ДоступенФильтрОтветственный;
	Элементы.Состояние.Видимость = Параметры.ДоступенФильтрСостояние;
	Элементы.ТипДокумента.Видимость = Параметры.ДоступенФильтрТипДокумента;
	Элементы.ТипРегламента.Видимость = Параметры.ДоступенФильтрТипРегламента;
	Элементы.СтатусПриглашения.Видимость = Параметры.ДоступенФильтрСтатусПриглашения;
	
	Элементы.Состояние.СписокВыбора.Вставить(0, 
		"ТребуетВнимания", НСтр("ru = 'Требует внимания'"),, БиблиотекаКартинок.ТребуетВниманияЖелтыйШарБЭД);
	Элементы.СтатусПриглашения.СписокВыбора.Вставить(0, 
		"ТребуетВнимания", НСтр("ru = 'Требует внимания'"),, БиблиотекаКартинок.ТребуетВниманияЖелтыйШарБЭД);
		
	ВыполненПереходНаУниверсальныеСообщения = РегламентыЭДО.ВыполненПереходНаУниверсальныеСообщения();
	Если ВыполненПереходНаУниверсальныеСообщения Тогда
		Элементы.Состояние.СписокВыбора.Вставить(Элементы.Состояние.СписокВыбора.Количество() - 1, 
		"КонтрагентОтказалВПодписи", НСтр("ru = 'Контрагент отказал'"));
		Элементы.Состояние.СписокВыбора.Вставить(Элементы.Состояние.СписокВыбора.Количество() - 1, 
		"ОтказаноВПодписиКонтрагенту", НСтр("ru = 'Отказано контрагенту'"));
	КонецЕсли;
	Если ИнтерфейсДокументовЭДО.ВыводитьЧатУниверсальныхСообщений() Тогда
		Элементы.Состояние.СписокВыбора.Вставить(Элементы.Состояние.СписокВыбора.Количество()-1, 
		"НовыеСообщения", НСтр("ru = 'Новые сообщения'"));
	КонецЕсли;
	
	Если Не НастройкиЭДО.ОтправлятьВходящиеДокументыНаУтверждение() Тогда
		ЗначениеУтвердить = Элементы.Состояние.СписокВыбора.НайтиПоЗначению("Утвердить");
		Элементы.Состояние.СписокВыбора.Удалить(ЗначениеУтвердить);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПользовательскиеОтборы(Команда)
	
	ПараметрыЗакрытия = ПараметрыЗакрытияФормы();
	ПараметрыЗакрытия.ТребуетсяОткрытиеДополнительныхОтборов = Истина;
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьФильтры(Команда)
	Закрыть(ПараметрыЗакрытияФормы());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПараметрыЗакрытияФормы()
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ТребуетсяОткрытиеДополнительныхОтборов", Ложь);
	ПараметрыЗакрытия.Вставить("Договор", Договор);
	ПараметрыЗакрытия.Вставить("Контрагент", Контрагент);
	ПараметрыЗакрытия.Вставить("Организация", Организация);
	ПараметрыЗакрытия.Вставить("Ответственный", Ответственный);
	ПараметрыЗакрытия.Вставить("Период", Период);
	ПараметрыЗакрытия.Вставить("Состояние", Состояние);
	ПараметрыЗакрытия.Вставить("СтатусПриглашения", СтатусПриглашения);
	ПараметрыЗакрытия.Вставить("ТипДокумента", ТипДокумента);
	ПараметрыЗакрытия.Вставить("ТипРегламента", ТипРегламента);
	Возврат ПараметрыЗакрытия;

КонецФункции

#КонецОбласти
