
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.АварийныйРежимВключен Тогда
		
		Элементы.СтраницыТекущееСостояниеАварийногоРежима.ТекущаяСтраница = Элементы.СтраницаАварийныйРежимВключен;
		
		Элементы.СтраницаАварийныйРежимВыключен.Видимость = Ложь;
		Элементы.ВключитьАварийныйРежим.Видимость        = Ложь;
		
		ШаблонСтроки = НСтр("ru = 'Аварийный режим включен до %1.'");
		Элементы.СтатусВключенияВАварийногоРежима.Заголовок = СтрШаблон(ШаблонСтроки, Параметры.АварийныйРежимДо);
		
		ПериодПродления = 1;
		
		Если ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85() Тогда
			Элементы.ФормаОтключитьАварийныйРежим.Важность  = ВажностьКнопки.Главная;
		Иначе
			Элементы.ФормаОтключитьАварийныйРежим.КнопкаПоУмолчанию  = Истина;
		КонецЕсли;
		
	Иначе
		
		Элементы.СтраницыТекущееСостояниеАварийногоРежима.ТекущаяСтраница = Элементы.СтраницаАварийныйРежимВыключен;
		
		Элементы.ВключитьАварийныйРежим.Видимость = Истина;
		Элементы.СтраницаАварийныйРежимВключен.Видимость = Ложь;
		
		Элементы.ФормаПродлитьАварийныйРежим.Видимость  = Ложь;
		Элементы.ФормаОтключитьАварийныйРежим.Видимость = Ложь;
		
		ПериодВключения = 24;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьАварийныйРежим(Команда)
	
	СтруктураВозврата = Новый Структура("АктивностьРежима, СрокДействияВЧасах", Истина, ПериодВключения);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьАварийныйРежим(Команда)
	
	СтруктураВозврата = Новый Структура("АктивностьРежима", Ложь);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьАварийныйРежим(Команда)
	
	СтруктураВозврата = Новый Структура("АктивностьРежима, СрокДействияВЧасах", Истина, ПериодПродления);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти
