
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПользовательскиеМакетыПечати) Тогда
		Элементы.ЗадатьДействиеПриВыбореМакетаПечатнойФормы.Видимость = Ложь;
	КонецЕсли;
	
	ЭтоВебКлиент = ОбщегоНазначения.ЭтоВебКлиент();
	
	ВыполнитьПроверкуПравДоступа("СохранениеДанныхПользователя", Метаданные);
	
	// СтандартныеПодсистемы.БазоваяФункциональность
	Если Не ЭтоВебКлиент Тогда
		Элементы.РаботаВВебКлиенте.Видимость = Ложь;
	КонецЕсли;
	ЗапрашиватьПодтверждениеПриЗавершенииПрограммы = СтандартныеПодсистемыСервер.ЗапрашиватьПодтверждениеПриЗавершенииПрограммы();
	ПоказыватьПредупреждениеОбУстановленныхОбновленияхПрограммы = СтандартныеПодсистемыСервер.ПоказыватьПредупреждениеОбУстановленныхОбновленияхПрограммы();
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
	// СтандартныеПодсистемы.Пользователи
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	Если ПравоДоступа("Просмотр", Метаданные.НайтиПоТипу(ТипЗнч(АвторизованныйПользователь))) Тогда
		Элементы.СведенияОПользователе.Заголовок = АвторизованныйПользователь;
	Иначе
		Элементы.ГруппаУчетнаяЗапись.Видимость = Ложь;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Пользователи
	
	// СтандартныеПодсистемы.ЭлектроннаяПодпись
	Элементы.НастройкиЭлектроннойПодписиИШифрования.Видимость =
		ПравоДоступа("СохранениеДанныхПользователя", Метаданные);
	// Конец СтандартныеПодсистемы.ЭлектроннаяПодпись
	
	ИспользоватьЗадачиСотрудников = ПолучитьФункциональнуюОпцию("ИспользоватьЗадачиСотрудников");
	Элементы.ГруппаЗадачи.Видимость = ИспользоватьЗадачиСотрудников;
	
	Если ИспользоватьЗадачиСотрудников Тогда
		ЗаполнитьПараметрыУведомлений();
	КонецЕсли;
	
	Элементы.ВариантИнтерфейса.СписокВыбора.Добавить("Такси", НСтр("ru = 'Интерфейс ""Такси""'"));
	Элементы.ВариантИнтерфейса.СписокВыбора.Добавить("Версия8_5", НСтр("ru = 'Интерфейс ""Версия 8.5""'"));
	
	НастройкиКлиентскогоПриложения = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(
		"Общее/НастройкиКлиентскогоПриложения", "");
	Если НастройкиКлиентскогоПриложения.ВариантИнтерфейсаКлиентскогоПриложения
		= ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5 Тогда
		ВариантИнтерфейса = "Версия8_5";
	Иначе
		ВариантИнтерфейса = "Такси";
	КонецЕсли;
	
	ТекущийВариантИнтерфейса = ВариантИнтерфейса;
	
	ВывестиБаннеры();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
#Если ВебКлиент Тогда
	ОбновитьГруппуРаботыВВебКлиенте();
#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьОповещение", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НачатьПодключениеОбсуждений(Команда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	НачатьПодключениеОбсуждений();
	
КонецПроцедуры

&НаКлиенте
Процедура УведомлятьОНовыхЗадачахСотрудникаПриИзменении(Элемент)
	
	СохранитьПараметрыУведомления("УведомлятьОНовыхЗадачахСотрудника");
	
КонецПроцедуры

&НаКлиенте
Процедура УведомлятьОВыполненииЗадачиСотрудникаПриИзменении(Элемент)
	
	СохранитьПараметрыУведомления("УведомлятьОВыполненииЗадачиСотрудника");
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантИнтерфейсаПриИзменении(Элемент)
	
	ТекущийИнтерфейс85 = ТекущийВариантИнтерфейса = "Версия8_5";
	
	Если ТекущийИнтерфейс85 И ВариантИнтерфейса = "Такси"
		Или Не ТекущийИнтерфейс85 И ВариантИнтерфейса = "Версия8_5" Тогда
		ТекстПодсказки = НСтр("ru = 'Выбранный интерфейс будет включен после перезапуска приложения'");
		Элементы.ПерезапуститьПриложение.Видимость = Истина;
	Иначе
		ТекстПодсказки = "";
		Элементы.ПерезапуститьПриложение.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ВариантИнтерфейса.Подсказка = ТекстПодсказки;
	
	Если Не ТекущийИнтерфейс85 Тогда
		Элементы.ОтступПерезапуститьПриложение.Видимость = Истина;
	КонецЕсли;
	
	Если ОпросУжеПроизведен() Тогда
		Возврат;
	КонецЕсли;
	
	Если ВариантИнтерфейса = "Такси" И ТекущийИнтерфейс85 Тогда
		ОткрытьФорму("Обработка.ПерсональныеНастройки.Форма.ВозвратНаТакси");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СведенияОПользователе(Команда)
	
	ПоказатьЗначение(, АвторизованныйПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасширениеРаботыСФайламиНаКлиенте(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьРасширениеРаботыСФайламиНаКлиентеЗавершение", ЭтотОбъект);
	НачатьУстановкуРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональнаяНастройкаПроксиСервера(Команда)
	
	ПолучениеФайловИзИнтернетаКлиент.ОткрытьФормуПараметровПроксиСервера(Новый Структура("НастройкаПроксиНаКлиенте",
		Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьДействиеПриВыбореМакетаПечатнойФормы(Команда)
	
	УправлениеПечатьюКлиент.ЗадатьДействиеПриВыбореМакетаПечатнойФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональныеНастройкиРаботыСФайлами(Команда)
	ОткрытьФорму("Обработка.ПерсональныеНастройки.Форма.РаботаСФайлами");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЭлектроннойПодписиИШифрования(Команда)
	
	ЭлектроннаяПодписьКлиент.ОткрытьНастройкиЭлектроннойПодписиИШифрования();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасширениеРаботыСКриптографиейНаКлиенте(Команда)
	НачатьУстановкуРасширенияРаботыСКриптографией(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНапоминаний(Команда)
	НапоминанияПользователяКлиент.ОткрытьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодключениеОбсуждений()
	
	Продолжение = Новый ОписаниеОповещения("ЗавершитьПодключениеОбсуждений", ЭтотОбъект);
	ОбсужденияКлиент.ПоказатьПодключение(Продолжение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезапуститьПриложение(Команда)
	
	СохранитьНастройки();
	ЗавершитьРаботуСистемы(Ложь, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиБаннеры()

	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Для отправки уведомлений требуется подключить обсуждения.'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Отправка уведомлений'");
	
	ПараметрыДействия = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	ПараметрыДействия.ИмяКоманды = "НачатьПодключениеОбсуждений";
	ПараметрыДействия.Обработчик = "Подключаемый_НачатьПодключениеОбсуждений";
	ПараметрыДействия.Заголовок = НСтр("ru = 'Перейти к настройке'");
	ПараметрыВажногоСообщения.ПараметрыДействия = ПараметрыДействия;
	
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.ПанельИнформации.Имя);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиИЗакрытьФорму()
	
	СохранитьНастройки();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьОповещение(Результат, Контекст) Экспорт
	СохранитьНастройкиИЗакрытьФорму();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасширениеРаботыСФайламиНаКлиентеЗавершение(ДополнительныеПараметры) Экспорт
	
	ОбновитьГруппуРаботыВВебКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГруппуРаботыВВебКлиентеЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ?(Подключено, Элементы.ГруппаРасширениеУстановлено, 
		Элементы.ГруппаРасширениеНеУстановлено);
		
	Элементы.ГруппаРасширениеУстановлено.Видимость =
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРасширениеУстановлено;
		
	Элементы.ГруппаРасширениеНеУстановлено.Видимость =
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРасширениеНеУстановлено;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГруппуРаботыВВебКлиенте()
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьГруппуРаботыВВебКлиентеЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботы1СПредприятия(Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиНаСервере(Настройки)
	
	// СтандартныеПодсистемы.БазоваяФункциональность
	ОбщегоНазначения.СохранитьПерсональныеНастройки(Настройки);
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
	СохранитьСвойстваКоллекции("ОбщиеНастройкиПользователя", ЭтотОбъект,
		"ПредлагатьПерейтиНаСайтПриЗапуске");
	
	НастройкиКлиентскогоПриложения = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(
		"Общее/НастройкиКлиентскогоПриложения", "");
	НастройкиКлиентскогоПриложения.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения[ВариантИнтерфейса];
	
	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();	
	Если Не ЭтоВариантИнтерфейса85 И НастройкиКлиентскогоПриложения.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5 Тогда
		НастройкиКлиентскогоПриложения.ВариантОткрытияОконКлиентскогоПриложения = ВариантОткрытияОконКлиентскогоПриложения.ОткрыватьДанныеВоВкладках;
	КонецЕсли;
	
	ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Общее/НастройкиКлиентскогоПриложения", "",
		НастройкиКлиентскогоПриложения);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСвойстваКоллекции(КлючОбъекта, Коллекция, ИменаРеквизитов)
	СтруктураРеквизитов = Новый Структура(ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Коллекция);
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПодключениеОбсуждений(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьПараметрыУведомлений();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыУведомлений()

	ИнформационнаяБазаЗарегистрирована = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	
	Элементы.ПанельИнформации.Видимость = Не ИнформационнаяБазаЗарегистрирована;
	Элементы.ГруппаУведомления.Доступность = Не Элементы.ПанельИнформации.Видимость;
	
	Если Не ИнформационнаяБазаЗарегистрирована Тогда
		Возврат;
	КонецЕсли;
	
	УведомлятьОНовыхЗадачахСотрудника = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПараметрыУведомленийЗадачиСотрудника", 
		"УведомлятьОНовыхЗадачахСотрудника", Истина);
	
	УведомлятьОВыполненииЗадачиСотрудника = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПараметрыУведомленийЗадачиСотрудника", 
		"УведомлятьОВыполненииЗадачиСотрудника", Истина);
			
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыУведомления(НаименованиеПараметра)

	ПараметрыУведомлений = Новый Структура(НаименованиеПараметра, ЭтотОбъект[НаименованиеПараметра]);
	СохранитьСвойстваКоллекции("ПараметрыУведомленийЗадачиСотрудника", ПараметрыУведомлений, НаименованиеПараметра);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗафиксироватьПереключениеИнтерфейса(ТекущийИнтерфейс85)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	ДатаВремяПредыдущегоПереключения = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсторияПереключенияИнтерфейса.Пользователь КАК Пользователь,
	|	ИсторияПереключенияИнтерфейса.ДатаПереключения КАК ДатаПереключения,
	|	ИсторияПереключенияИнтерфейса.ЭтоВозвратНаТакси КАК ЭтоВозвратНаТакси
	|ИЗ
	|	РегистрСведений.ИсторияПереключенияИнтерфейса КАК ИсторияПереключенияИнтерфейса
	|ГДЕ
	|	ИсторияПереключенияИнтерфейса.Пользователь = &Пользователь
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПереключения УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ДатаВремяПредыдущегоПереключения = Выборка.ДатаПереключения;
	
	КонецЦикла;
	
	ТекущаяДатаВремя = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(ДатаВремяПредыдущегоПереключения) Тогда
		ВремяРаботыДоПереключения = Окр((ТекущаяДатаВремя - ДатаВремяПредыдущегоПереключения) / 60, 0);
	Иначе
		ВремяРаботыДоПереключения = 0;
	КонецЕсли;
	ИнформацияОСистеме = Новый СистемнаяИнформация;
	ВерсияПлатформы = ИнформацияОСистеме.ВерсияПриложения;
	ВерсияПриложения = Метаданные.Версия;
	
	ЗаписьРегистра = РегистрыСведений.ИсторияПереключенияИнтерфейса.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Пользователь = Пользователи.АвторизованныйПользователь();
	ЗаписьРегистра.ДатаПереключения = ТекущаяДатаВремя;
	ЗаписьРегистра.ЭтоВозвратНаТакси = ТекущийИнтерфейс85;
	ЗаписьРегистра.ВремяРаботыНаИнтерфейсеВМинутах = ВремяРаботыДоПереключения;
	ЗаписьРегистра.ВерсияПлатформы = ВерсияПлатформы;
	ЗаписьРегистра.ВерсияКонфигурации = ВерсияПриложения;
	ЗаписьРегистра.Записать();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпросУжеПроизведен()
	
	СохраненнаяНастройка = ХранилищеСистемныхНастроек.Загрузить("Обработка.ПерсональныеНастройки.Форма.ВозвратНаТакси",
		"ВыполненаКомандаОтправить");
	
	Если СохраненнаяНастройка = Неопределено Тогда
		СохраненнаяНастройка = Ложь;
	КонецЕсли;
	
	Возврат СохраненнаяНастройка;
	
КонецФункции

&НаКлиенте
Процедура СохранитьНастройки()
	
	Настройки = Новый Структура;
	Настройки.Вставить("НапоминатьОбУстановкеРасширенияРаботыСФайлами", НапоминатьОбУстановкеРасширенияРаботыСФайлами);
	Настройки.Вставить("ЗапрашиватьПодтверждениеПриЗавершенииПрограммы", ЗапрашиватьПодтверждениеПриЗавершенииПрограммы);
	Настройки.Вставить("ПоказыватьПредупреждениеОбУстановленныхОбновленияхПрограммы", ПоказыватьПредупреждениеОбУстановленныхОбновленияхПрограммы);
	
	УстановитьНастройкиНаСервере(Настройки);
	
	ОбщегоНазначенияКлиент.СохранитьПерсональныеНастройки(Настройки);
	
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	Модифицированность = Ложь;
	
	ТекущийИнтерфейс85 = ТекущийВариантИнтерфейса = "Версия8_5";
	Если ТекущийИнтерфейс85 И ВариантИнтерфейса = "Такси"
		Или Не ТекущийИнтерфейс85 И ВариантИнтерфейса = "Версия8_5" Тогда
		ЗафиксироватьПереключениеИнтерфейса(ТекущийИнтерфейс85);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
