#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	РежимИсправления  = Параметры.РежимИсправления;
	
	УстановитьВидимостьЭлементовДляИнтерфейса85();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Закрыть(РежимИсправления);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовДляИнтерфейса85()
	
	Элементы.Отмена.Видимость = Не ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85();
	
	ОформляемыеГруппыФормы = ОбщегоНазначенияИС.НоваяСтруктураОформляемыхГруппФормы();
	ОформляемыеГруппыФормы.Информация = "ГруппаПоясняющийТекстРасформироватьАгрегат,ГруппаПоясняющийТекстУдалятьАгрегат";
	ОбщегоНазначенияИС.УстановитьОформлениеГруппФормы(ЭтотОбъект, ОформляемыеГруппыФормы, Ложь);
	
	ОформляемыеГруппыФормы = ОбщегоНазначенияИС.НоваяСтруктураОформляемыхГруппФормы();
	ОформляемыеГруппыФормы.Предупреждение = "ГруппаПоясняющийТекстУдалятьСтрокуОтчета";
	ОбщегоНазначенияИС.УстановитьОформлениеГруппФормы(ЭтотОбъект, ОформляемыеГруппыФормы, Ложь);
	
КонецПроцедуры

#КонецОбласти