#Область ОбработчикиСобыимйФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();

	Элементы.ФормаСнятьОтметкуВыгруженТакси.Видимость = Не ЭтоВариантИнтерфейса85;
	Элементы.ФормаОбновитьТакси.Видимость = Не ЭтоВариантИнтерфейса85;

	Элементы.ФормаСнятьОтметкуВыгружен.Видимость = ЭтоВариантИнтерфейса85;
	Элементы.ФормаОбновить.Видимость = ЭтоВариантИнтерфейса85;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьОтметкуВыгружен(Команда)
	СнятьОтметкуВыгруженНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СнятьОтметкуВыгруженНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	СоответствияОбъектовСайта.УзелИнформационнойБазы,
				   |	СоответствияОбъектовСайта.УникальныйИдентификаторСайта,
				   |	СоответствияОбъектовСайта.СсылкаНаОбъект,
				   |	СоответствияОбъектовСайта.УникальныйИдентификаторИнформационнойБазы,
				   |	ЛОЖЬ КАК ОбъектВыгружен,
				   |	СоответствияОбъектовСайта.ТипОбъекта
				   |ИЗ
				   |	РегистрСведений.СоответствияОбъектовСайта КАК СоответствияОбъектовСайта";

	Результат = Запрос.Выполнить().Выгрузить();

	НЗ = РегистрыСведений.СоответствияОбъектовСайта.СоздатьНаборЗаписей();
	НЗ.Загрузить(Результат);
	НЗ.Записать();
    
    Элементы.Список.Обновить();
    
КонецПроцедуры

#КонецОбласти
