#Область ОписаниеПеременных

&НаКлиенте
Перем ТипыОперацийДисплеяПокупателя;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = Параметры.ТекстЗаголовка;
	Элементы.ДекорацияТекстИнформации.Заголовок = Параметры.ТекстСообщения;
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ИнтерфейсРМКСлужебный.ПрименитьНаФормеМасштабИзПараметров(ЭтотОбъект, Параметры);
	ИспользоватьДисплейПокупателя = Параметры.ИспользоватьДисплейПокупателя;
	ИспользоватьПодключаемоеОборудование = Параметры.ИспользоватьПодключаемоеОборудование;
	Организация = Параметры.Организация;
	ПодключенаОблачнаяККТ = Параметры.ПодключенаОблачнаяККТ;
	ЭтоОшибкаПроверкиСтатусаЧекаВОблаке = Параметры.ЭтоОшибкаПроверкиСтатусаЧекаВОблаке;
	
	Если Параметры.РежимКассыСамообслуживания Тогда
		Элементы.ДекорацияИзображениеИнформации.Высота = 11;
		Элементы.ДекорацияИзображениеИнформации.Ширина = 48;
		Элементы.ДекорацияТекстИнформации.Ширина = 47;
		Элементы.ДекорацияИзображениеИнформации.РазмерКартинки = РазмерКартинки.Пропорционально;
		Элементы.ГруппаИнформация.РастягиватьПоВертикали = Ложь;
		ЭтотОбъект.ОтображатьЗаголовок = Ложь;
		РежимКассыСамообслуживания = Истина;
	ИначеЕсли Не ЭтоИнтерфейс85 Тогда
		Элементы.СтраницыУправленияФормой.Высота = 3;
		Элементы.СтраницыУправленияФормой.РастягиватьПоВертикали = Ложь;
	КонецЕсли;
	
	Если Параметры.ЭтоТерминалБезПодключения Тогда
		
		Элементы.СтраницаТерминалБезПодключения.Видимость = Истина;
		Элементы.СтраницыУправленияФормой.ТекущаяСтраница = Элементы.СтраницаТерминалБезПодключения;
		Элементы.ДекорацияИзображениеИнформации.Картинка  = БиблиотекаКартинок.РМКЭквайринговыйТерминал;
		Если Параметры.ЭтоОшибкаФискализации Тогда
			Элементы.ТерминалПодтверждениеОплаты.Видимость = Ложь;
			Элементы.ТерминалОтказОплаты.Видимость         = Ложь;
			Элементы.ТерминалЗакрыть.Видимость             = Истина;
		КонецЕсли
		
	ИначеЕсли Параметры.ЭтоОжиданиеОплаты Тогда
		
		Элементы.ДекорацияИзображениеИнформации.Картинка = БиблиотекаКартинок.РМКЭквайринговыйТерминал;
		ЭтотОбъект.ОтображатьКоманднуюПанель = Ложь;
		Если Параметры.РежимКассыСамообслуживания Тогда
			Элементы.ДекорацияТекстИнформации.Шрифт = Новый Шрифт(ШрифтыСтиля.ЗаголовокПервогоУровня,,,,,,, 120);
			Элементы.ДекорацияТекстИнформации.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		КонецЕсли;
		
	ИначеЕсли Параметры.ЭтоАвтономнаяККТ Тогда
		
		Элементы.СтраницаАвтономнаяККТ.Видимость = Истина;
		Элементы.СтраницыУправленияФормой.ТекущаяСтраница = Элементы.СтраницаАвтономнаяККТ;
		Элементы.ДекорацияИзображениеИнформации.Картинка  = БиблиотекаКартинок.РМКАвтономнаяККТ;
		
	ИначеЕсли Параметры.ЭтоОшибкаЭквайринговойОперации Тогда
		
		Если Параметры.РежимКассыСамообслуживания Тогда
			Если СтрДлина(Элементы.ДекорацияТекстИнформации.Заголовок) > 128 И ЭтоИнтерфейс85 Тогда
				Элементы.ДекорацияТекстИнформации.Шрифт = Новый Шрифт(ШрифтыСтиля.ТекстВторогоУровня);
			Иначе
				Элементы.ДекорацияТекстИнформации.Шрифт = Новый Шрифт(ШрифтыСтиля.ЗаголовокВторогоУровня);
			КонецЕсли;
			Элементы.ГруппаОшибкаТерминала.Высота = 4;
			Элементы.ГруппаОшибкаТерминала.РастягиватьПоВертикали = Ложь;
			Элементы.ЗакрытьОкноТерминала.Ширина = 23;
			Элементы.ЗакрытьОкноТерминала.Заголовок = НСтр("ru = 'Закрыть'");
			Если ЭтоИнтерфейс85 Тогда
				Элементы.ЗакрытьОкноТерминала.Важность = ВажностьКнопки.Главная;
			Иначе
				Элементы.ЗакрытьОкноТерминала.ЦветФона = ЦветаПалитры.Желтый;
			КонецЕсли;
			Элементы.ГруппаОшибкаТерминала.ОтображатьЗаголовок = Не ЭтоИнтерфейс85;
			Элементы.ПозватьСотрудникаОшибкаТерминала.Видимость = Истина;
			Элементы.ГруппаОшибкаТерминала.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		КонецЕсли;
		
		ЭтаФорма.Заголовок = НСтр("ru = 'Ошибка операции на терминале'");
		Элементы.ДекорацияИзображениеИнформации.Картинка  = БиблиотекаКартинок.РМКЭквайринговыйТерминал;
		Элементы.СтраницаОшибкаТерминала.Видимость = Истина;
		Элементы.СтраницыУправленияФормой.ТекущаяСтраница = Элементы.СтраницаОшибкаТерминала;
		Элементы.ГруппаКомандОтчет.Видимость = Не Параметры.РежимКассыСамообслуживания;
		
		Если Параметры.НеобходимоСторно Тогда
			
			Элементы.ВыполнитьОтменуОплатыТерминала.Видимость = Истина;
			Элементы.ЗакрытьОкноТерминала.Видимость           = Ложь;
			
		Иначе
			
			Элементы.ВыполнитьОтменуОплатыТерминала.Видимость = Ложь;
			Элементы.ЗакрытьОкноТерминала.Видимость           = Истина;
			
		КонецЕсли;
		
	Иначе
		
		ЭтаФорма.Заголовок = НСтр("ru = 'Ошибка пробития чека'");
		Элементы.СтраницаОшибкаФискализации.Видимость = Истина;
		Элементы.СтраницыУправленияФормой.ТекущаяСтраница = Элементы.СтраницаОшибкаФискализации;
		Элементы.ДекорацияИзображениеИнформации.Картинка  = БиблиотекаКартинок.РМКОшибкаФискализации;
		ОтобразитьКнопкуОтменыПлатежа = Истина;
		ОтобразитьКнопкуУдалитьЧек = Истина;
		Элементы.ГруппаКомандОтчет.Видимость = Не РежимКассыСамообслуживания;
		
		Если Параметры.НеобходимоСторно Тогда
			
			Элементы.ВыполнитьПовторноеПробитие.Видимость = НЕ Параметры.ОшибкаФормированияИсходныхДанных;
			Элементы.ОтложитьЧекИзОшибки.Видимость        = Истина;
			
			Если ЗначениеЗаполнено(Параметры.ТипОплаты) Тогда
				Если Параметры.ЭтоПродажа И (Параметры.ТранзакцияПоКартеЗавершена ИЛИ Параметры.ТипОплаты = "СБП") Тогда
					ОтобразитьКнопкуОтменыПлатежа = Истина;
					ОтобразитьКнопкуУдалитьЧек = Ложь;
				ИначеЕсли Не Параметры.ЭтоПродажа И (Параметры.ТранзакцияПоКартеЗавершена ИЛИ Параметры.ТипОплаты = "СБП") Тогда
					ОтобразитьКнопкуОтменыПлатежа = Ложь;
					ОтобразитьКнопкуУдалитьЧек = Ложь;
				ИначеЕсли Параметры.ТипОплаты = "ЮКасса" Тогда
					ОтобразитьКнопкуОтменыПлатежа = Ложь;
					ОтобразитьКнопкуУдалитьЧек = Ложь;
				Иначе
					ОтобразитьКнопкуОтменыПлатежа = Истина;
					ОтобразитьКнопкуУдалитьЧек = Истина;
				КонецЕсли;
			Иначе
				ОтобразитьКнопкуУдалитьЧек = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПодключенаОблачнаяККТ Тогда
			Элементы.ВыполнитьПовторноеПробитие.Видимость = НЕ Параметры.ОшибкаФормированияИсходныхДанных;
			Элементы.ВыполнитьПовторноеПробитие.Заголовок = "Повторить";
			Элементы.ПозватьСотрудникаОшибкаФискализации.Видимость = Истина;
			Элементы.ОтложитьЧекИзОшибки.Видимость = Ложь;
			ОтобразитьКнопкуУдалитьЧек = Ложь;
			Если ЭтоОшибкаПроверкиСтатусаЧекаВОблаке
				И Не Параметры.ЭтоОшибкаПовторногоПробития Тогда
				ОтобразитьКнопкуОтменыПлатежа = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Элементы.ВыполнитьОтменуОплаты.Видимость = ОтобразитьКнопкуОтменыПлатежа;
		Элементы.УдалитьЧекИзОшибки.Видимость = ОтобразитьКнопкуУдалитьЧек;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТипыОперацийДисплеяПокупателя = МенеджерОборудованияРМККлиент.ТипыОперацийДисплеяПокупателя();
	Если ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		Элементы.ДекорацияТекстИнформации.ЦветФона = WebЦвета.Белый;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ПрограммноеЗакрытие Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьСообщениеВПоддержку(Команда)
	
	МодульТехническойПоддержки = ОбщегоНазначенияКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиент");
	Если МодульТехническойПоддержки = Неопределено Тогда
	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для отправки сообщения в службу поддержки необходимо установить Библиотеку интернет-поддержки пользователей.'"));
		
	Иначе
		
		МодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер =
			ОбщегоНазначенияКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиентСервер");
		
		ДанныеСообщения = МодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер.ДанныеСообщения();
		ДанныеСообщения.Получатель						= "v8";
		ДанныеСообщения.Тема							= ЭтаФорма.Заголовок;
		ДанныеСообщения.Сообщение						= Элементы.ДекорацияТекстИнформации.Заголовок;
		ДанныеСообщения.ИспользоватьСтандартныйШаблон	= Ложь;
		
		МодульТехническойПоддержки.ОтправитьСообщение(ДанныеСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетОбОшибке(Команда)
	
	ЗаголовокОшибки = Новый ФорматированнаяСтрока(ЭтаФорма.Заголовок, Новый Шрифт(,, Истина));
	ТекстОшибки = Элементы.ДекорацияТекстИнформации.Заголовок;
	
	Попытка
		ВызватьИсключение(ЗаголовокОшибки, КатегорияОшибки.ОшибкаКонфигурации, "PayDesk.error", ТекстОшибки);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОбработкаОшибок.ПоказатьИнформациюОбОшибке(ИнформацияОбОшибке, ЗаголовокОшибки, ТекстОшибки, Истина);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТерминалПодтвердитьОплату(Команда)
	ПараметрыЗакрытияФорма = Новый Структура("ТерминалОплатаПодтверждена", Истина);
	ЗакрытьФорму(ПараметрыЗакрытияФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТерминалОтменитьОплату(Команда)
	ПараметрыЗакрытияФорма = Новый Структура("ТерминалОплатаОтклонена", Истина);
	ЗакрытьФорму(ПараметрыЗакрытияФорма);
КонецПроцедуры

&НаКлиенте
Процедура АвтономнаяККТПодтвердитьОплату(Команда)
	ПараметрыЗакрытияФорма = Новый Структура("АвтономнаяККТОплатаПодтверждена", Истина);
	ЗакрытьФорму(ПараметрыЗакрытияФорма);
КонецПроцедуры

&НаКлиенте
Процедура АвтономнаяККТОтменитьОплату(Команда)
	ПараметрыЗакрытияФорма = Новый Структура("АвтономнаяККТОплатаОтклонена", Истина);
	ЗакрытьФорму(ПараметрыЗакрытияФорма);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьОтменуОплаты(Команда)
	
	Если РежимКассыСамообслуживания Тогда
		
		ТекстВопроса = НСтр("ru = 'Возникла проблема при продаже. При продолжении будет произведен возврат оплаты.'");
		
		СписокОтветов = Новый СписокЗначений;
		СписокОтветов.Добавить("Продолжить");
		СписокОтветов.Добавить("Отмена");
		
		Результат = Ждать ВопросАсинх(ТекстВопроса, СписокОтветов, , "Продолжить");
		
		Если Результат <> "Продолжить" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗакрытияФорма = Новый Структура("ОтменитьОплатуКартой", Истина);
	Если ЭтоОшибкаПроверкиСтатусаЧекаВОблаке Тогда
		ПараметрыЗакрытияФорма.Вставить("НеобходимоПодтверждениеОперации", Истина);
	КонецЕсли;
	
	ЗакрытьФорму(ПараметрыЗакрытияФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПовторноеПробитие(Команда)
	ПараметрыЗакрытияФорма = Новый Структура("ПовторитьПробитие", Истина);
	ЗакрытьФорму(ПараметрыЗакрытияФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтложитьЧекИзОшибки(Команда)
	ПараметрыЗакрытияФорма = Новый Структура("ОтложитьЧек", Истина);
	ЗакрытьФорму(ПараметрыЗакрытияФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьОперациюПакетнойФискализации(Команда)
	ПараметрыЗакрытияФорма = Новый Структура("ПовторитьФискальнуюОперацию", Истина);
	ЗакрытьФорму(ПараметрыЗакрытияФорма);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЧекИзОшибки(Команда)
	ПараметрыЗакрытияФорма = Новый Структура("УдалитьЧек", Истина);
	ЗакрытьФорму(ПараметрыЗакрытияФорма);
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьСторноПоКарте(Команда)
	ПараметрыЗакрытияФорма = Новый Структура("ВыполнитьСторноПоКарте", Истина);
	ЗакрытьФорму(ПараметрыЗакрытияФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОкно(Команда)
	ПараметрыЗакрытияФорма = Новый Структура("ТерминалОплатаОтклонена", Истина);
	ЗакрытьФорму(ПараметрыЗакрытияФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПозватьСотрудникаОшибкаТерминала(Команда)
	ОткрытьОкноВызоваСотрудника();
КонецПроцедуры

&НаКлиенте
Процедура ПозватьСотрудникаОшибкаФискализации(Команда)
	ОткрытьОкноВызоваСотрудника();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьОкноВызоваСотрудника()
	
	НаименованиеПользователяВОбращении = "";
	Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения")
			И ВладелецФормы.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК" Тогда
		НаименованиеПользователяВОбращении = ВладелецФормы.НаименованиеПользователяПриЗапросеПрав;
	КонецЕсли;
	ТекстЗаголовка = ИнтерфейсРМКСлужебныйКлиент.СформироватьЗаголовокВызоваСотрудника(ПодключенаОблачнаяККТ,
		НаименованиеПользователяВОбращении);
	
	ТекстОшибки = НСтр("ru = 'Чтобы отменить вызов сотрудника, закройте текущее сообщение.'");
	ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки, ТекстЗаголовка);
	ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ЗакрытиеСообщенияОбОшибке", ЭтотОбъект);
	
	ПараметрыОткрытияОшибки.Вставить("РежимКассыСамообслуживания", РежимКассыСамообслуживания);
	ПараметрыОткрытияОшибки.Вставить("УвеличенныйВариантМасштаба", УвеличенныйВариантМасштаба);
	ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыОткрытияОшибки, ОбработкаОповещения);
	
	ВывестиИнформациюНаДисплейПокупателя(ТипыОперацийДисплеяПокупателя.Ошибка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСообщенияОбОшибке(Результат, ДополнительныеПараметры) Экспорт
	ВывестиСветовойСигналНаДисплей("РабочееМестоРаботает");
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСветовойСигналНаДисплей(ИмяСтатуса)
	
	ПараметрыОперации = МенеджерОборудованияРМККлиент.ПараметрыОперацииДисплейПокупателя();
	Если ПараметрыОперации.Свойство("СтатусРабочегоМеста") Тогда
		ПолноеИмяСтатуса = СтрШаблон("Перечисление.СтатусРабочегоМестаНаДисплее.%1", ИмяСтатуса);
		СтатусРабочегоМеста = ПредопределенноеЗначение(ПолноеИмяСтатуса);
		ПараметрыОперации.СтатусРабочегоМеста = СтатусРабочегоМеста;
			
		МенеджерОборудованияРМККлиент.НачатьВыводСтатусаРабочегоМестаНаДисплейПокупателя(Неопределено,
			Неопределено, Неопределено, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиИнформациюНаДисплейПокупателя(Операция, ТекстОшибки = "")
	
	Если Не ИспользоватьДисплейПокупателя Тогда
		Возврат;
	КонецЕсли;
	
	ИсходныеДанные = МенеджерОборудованияРМККлиент.ИсходныеДанныеДляПервичнойПередачиНаДисплейПокупателя();
	ИсходныеДанные.ОповещениеПриЗавершении = Новый ОписаниеОповещения("ВывестиИнформациюНаДисплейПокупателяЗавершение", ЭтотОбъект);
	ИсходныеДанные.ИспользоватьПодключаемоеОборудование = ИспользоватьПодключаемоеОборудование;
	ИсходныеДанные.ДанныеДляОтображения = ИнтерфейсРМКСлужебныйКлиент.БуферОбменаДисплеяПокупателя();
	ИсходныеДанные.Операция = Операция;
	ИсходныеДанные.Организация = Объект.Организация;
	ИсходныеДанные.ТекстОшибки = ТекстОшибки;
	МенеджерОборудованияРМККлиент.ВывестиИнформациюНаДисплейПокупателя(Операция, ИсходныеДанные, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(ПараметрыЗакрытияФорма)
	ПрограммноеЗакрытие = Истина;
	Закрыть(ПараметрыЗакрытияФорма);
КонецПроцедуры

#КонецОбласти