
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	ИспользоватьМногофирменныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Если Не ИспользоватьМногофирменныйУчет И ЗначениеЗаполнено(Запись.Организация) Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Организация.Гиперссылка = Истина;
	КонецЕсли;
	
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ЛеваяКолонка.Ширина = 0;
	Элементы.ЛеваяКолонка.РастягиватьПоГоризонтали = Истина;
	
	Элементы.ПраваяКолонка.Ширина = 0;
	Элементы.ПраваяКолонка.РастягиватьПоГоризонтали = Истина;
	
	Элементы.Тариф.Ширина = 0;
	Элементы.Тариф.РастягиватьПоГоризонтали = Истина;
	
КонецПроцедуры

#КонецОбласти