#Область ОписаниеПеременных

// Структура с реквизитами палитры для построения схемы формы РМК
&НаКлиенте
Перем РеквизитыПалитры Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьПеременные();
	ЗаполнитьФормуПоВходнымПараметрам();
	НастроитьЭлементыФормы();
	ЗаполнитьНастройкиОбластей();
	ЗаполнитьПорядокОбластейФормы();
	ЗаполнитьДеревоОбластейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполнитьСерверныеДействияДляКлиента();
	
	ПоказатьСхемуФормыРМК();
	ОбновитьОтображениеФормыНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		ОповещениеЗакрытия = Новый ОписаниеОповещения("ОбработатьОтветОЗакрытии", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(ОповещениеЗакрытия, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаРМКВертикальнаяОриентацияПриИзменении(Элемент)
	
	ПараметрыНастройки = ПараметрыДляПолученияРеквизитовПалитры();
	ПриИзмененииОриентацииСервер(ПараметрыНастройки, РеквизитыПалитры);
	ЗаполнитьДеревоОбластейФормы();
	РазвернутьСтрокиДерева();
	ПоказатьСхемуФормыРМК();
	
	ОбновитьОтображениеКомандДереваОбластей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПалитраПлиточногоИнтерфейсаПриИзменении(Элемент)
	
	ПалитраПлиточногоИнтерфейсаВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ПалитраПлиточногоИнтерфейсаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораПалитры();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийЭкранПриИзменении(Элемент)
	
	ОбработатьИзменениеТекущегоЭкрана();
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаФормыРМКПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СхемаФормыРМКПриНажатииКлиент(ДанныеСобытия.Element);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойПодборПлиточныйПриИзменении(Элемент)
	
	ТекущийЭкран = ?(ОсновнойПодборПлиточный, 1, 0);
	ОбработатьИзменениеТекущегоЭкрана();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийДереваОбластейФормыРМК

&НаКлиенте
Процедура ДеревоОбластейФормыРМКЗаголовокОбластиОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбластейПереместитьВверх(Команда)
	
	ДанныеПозиции = ПолучитьДанныеПозицииТекущегоЭлементаДереваОбластей();
	Если (Не ДанныеПозиции.НаборСтрок = Неопределено) И ДанныеПозиции.ИндексЭлемента > 0 Тогда
		ДанныеПозиции.НаборСтрок.Сдвинуть(ДанныеПозиции.ИндексЭлемента, -1);
		ПриИзмененииДанныхДереваОбластей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбластейПереместитьВниз(Команда)
	
	ДанныеПозиции = ПолучитьДанныеПозицииТекущегоЭлементаДереваОбластей();
	Если Не ДанныеПозиции.НаборСтрок = Неопределено Тогда
		КоличествоСтрок = ДанныеПозиции.НаборСтрок.Количество();
		Если ДанныеПозиции.ИндексЭлемента < (КоличествоСтрок - 1) Тогда
			ДанныеПозиции.НаборСтрок.Сдвинуть(ДанныеПозиции.ИндексЭлемента, 1);
			ПриИзмененииДанныхДереваОбластей();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбластейФормыРМКПриИзменении(Элемент)
	
	ПриИзмененииДанныхДереваОбластей();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбластейФормыРМКВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаОбластиДерева = ДеревоОбластейФормыРМК.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПараметрыРедактирования
		= ПараметрыДляРедактированияОбластиРМК(СтрокаОбластиДерева.ЗаголовокОбласти);
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеНастроекОбластиЗавершение", ЭтотОбъект, ВыбраннаяСтрока);
	Если ПараметрыРедактирования.Настройки.Количество() > 0 Тогда
		ОткрытьФорму("Обработка.РедактированиеПанелейРМК.Форма.ФормаРедактированияПанели",
			ПараметрыРедактирования, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбластейФормыРМКПриАктивизацииСтроки(Элемент)
	ПоказатьСхемуФормыРМК();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	ЗаписатьИЗакрытьКлиент();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	ПроверитьДанныеИСохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройкиПорядкаОбластей(Команда)
	
	ВосстановитьНастройкиПорядкаОбластейКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройкиСвойствОбластей(Команда)
	
	СброситьНастройкиСвойствОбластейКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзменениеТекущегоЭкрана()
	
	ЗаполнитьДеревоОбластейФормы();
	РазвернутьСтрокиДерева();
	ПоказатьСхемуФормыРМК();
	ОбновитьОтображениеФормыНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКомандДереваОбластей()
	
	ОбновляемыеЭлементы = Новый Массив;
	ОбновляемыеЭлементы.Добавить(Элементы.ДеревоОбластейФормыРМКСброситьНастройкиСвойствОбластей);
	ОбновляемыеЭлементы.Добавить(Элементы.ДеревоОбластейФормыРМКВосстановитьНастройкиПорядкаОбластей);
	ОбновитьОтображениеФормыНастроек(ЭтотОбъект, ОбновляемыеЭлементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДанныхДереваОбластей()
	
	ПересчитатьПорядокОбластейСхемыРМК();
	ПоказатьСхемуФормыРМК();
	ОбновляемыеЭлементы = Новый Массив;
	ОбновляемыеЭлементы.Добавить(Элементы.ДеревоОбластейФормыРМКВосстановитьНастройкиПорядкаОбластей);
	ОбновитьОтображениеФормыНастроек(ЭтотОбъект, ОбновляемыеЭлементы);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСхемуФормыРМК()
	
	СхемаФормыРМК = ИнтерфейсРМКСлужебныйКлиент.СформироватьДокументСхемыФормыРМК(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтрокиДерева()
	
	СтрокиДерева = ДеревоОбластейФормыРМК.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор();
		Если Не Элементы.ДеревоОбластейФормыРМК.Развернут(ИдентификаторСтроки) Тогда
			Элементы.ДеревоОбластейФормыРМК.Развернуть(ИдентификаторСтроки, Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьСписокРежимовНачальнойСтраницы(Форма)
	
	СписокЭкранов = Форма.Элементы.ТекущийЭкран.СписокВыбора;
	СписокЭкранов.Очистить();
	
	ТекстКорзина = НСтр("ru='Корзина'");
	СписокЭкранов.Добавить(0, ТекстКорзина);
	
	ТекстПалитра = НСтр("ru='Палитра'");
	СписокЭкранов.Добавить(1, ТекстПалитра);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыДляПолученияРеквизитовПалитры()
	
	ПараметрыНастройки = Новый Структура();
	ПараметрыНастройки.Вставить("Палитра", ПалитраПлиточногоИнтерфейса);
	ПараметрыНастройки.Вставить("ЭтоГоризонтальнаяОриентация", ГоризонтальнаяОриентация);
	
	Возврат ПараметрыНастройки;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСерверныеДействияДляКлиента()
	
	ПараметрыНастройки = ПараметрыДляПолученияРеквизитовПалитры();
	ДополнительныеДанные = ВыполнитьДействияИПолучитьДанныеДляКлиента(ПараметрыНастройки);
	РеквизитыПалитры = ДополнительныеДанные.ДанныеРазмеров;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьДействияИПолучитьДанныеДляКлиента(ПараметрыНастройки)
	
	ДополнительныеДанные = Новый Структура();
	
	ДанныеРазмеров = ПолучитьРеквизитыПалитры(ПараметрыНастройки);
	ДополнительныеДанные.Вставить("ДанныеРазмеров", ДанныеРазмеров);
	
	Возврат ДополнительныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗапомнитьРеквизитыПалитры()
	
	ПараметрыНастройки = ПараметрыДляПолученияРеквизитовПалитры();
	ДанныеРазмеров = ПолучитьРеквизитыПалитры(ПараметрыНастройки);
	ЗаполнитьЗначенияСвойств(РеквизитыПалитры, ДанныеРазмеров);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыПалитры(ПараметрыНастройки)
	
	ИменаРеквизитовЭлемента = "КоличествоЭлементовВРяду,КоличествоРядов";
	ИменаСвойств = "КоличествоЭлементовВРяду,КоличествоРядовНаСтранице";
	РазмерыПалитры = Новый Структура(ИменаСвойств, 0, 0);
	
	Если ЗначениеЗаполнено(ПараметрыНастройки.Палитра) Тогда
		ДанныеПалитры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыНастройки.Палитра, ИменаРеквизитовЭлемента);
		РазмерыПалитры.КоличествоЭлементовВРяду = ДанныеПалитры.КоличествоЭлементовВРяду;
		РазмерыПалитры.КоличествоРядовНаСтранице = ДанныеПалитры.КоличествоРядов;
	КонецЕсли;
	Если РазмерыПалитры.КоличествоЭлементовВРяду = 0 Или РазмерыПалитры.КоличествоРядовНаСтранице = 0 Тогда
		ЭтоВертикальнаяОриентация = (Не ПараметрыНастройки.ЭтоГоризонтальнаяОриентация);
		РазмерыПлиткиПоУмолчанию
			= ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьРазмерыПлиткиПоУмолчанию(ЭтоВертикальнаяОриентация);
		ЗаполнитьЗначенияСвойств(РазмерыПалитры, РазмерыПлиткиПоУмолчанию);
	КонецЕсли;
	
	Возврат РазмерыПалитры;
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	УстановитьУсловноеОформление();
	
	НастроитьСписокРежимовНачальнойСтраницы(ЭтотОбъект);
	Элементы.ГруппаУправлениеЭкраном.Видимость = ЗначениеЗаполнено(ПалитраПлиточногоИнтерфейса);
	Элементы.ОсновнойПодборПлиточный.Видимость = ЗначениеЗаполнено(ПалитраПлиточногоИнтерфейса);
	Если ОсновнойПодборПлиточный Тогда
		ТекущийЭкран = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	ИнтерфейсРМКСлужебный.УстановитьУсловноеОформлениеДереваОбластейФормыРМК(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьПеременные()
	
	ЗаставкаСтрокой = ПолучитьСтрокуДанныхЗаставкиПродажи();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуДанныхЗаставкиПродажи()
	
	ДанныеКартинки = БиблиотекаКартинок.РМКЗаставкаПродажа.ПолучитьДвоичныеДанные();
	ТекстДанныхКартинки = ПолучитьBase64СтрокуИзДвоичныхДанных(ДанныеКартинки);
	ТекстКартинки = СтрШаблон("data:image/svg+xml;utf8;base64,%1", ТекстДанныхКартинки);
	
	Возврат ТекстКартинки;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоОбластейФормы()
	
	ИнтерфейсРМКСлужебный.ЗаполнитьДеревоОбластейФормы(ЭтотОбъект, ПодготовитьПараметрыЗаполнения());
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеПозицииТекущегоЭлементаДереваОбластей()
	
	РезультатФункции = Новый Структура("НаборСтрок,ИндексЭлемента", Неопределено, 0);
	ТекущийЭлементДерева = Элементы.ДеревоОбластейФормыРМК.ТекущиеДанные;
	Если Не ТекущийЭлементДерева = Неопределено Тогда
		НаборСтрок = ПолучитьНаборСтрокРодителя(ТекущийЭлементДерева);
		ИндексТекущегоЭлемента = НаборСтрок.Индекс(ТекущийЭлементДерева);
		РезультатФункции.Вставить("НаборСтрок", НаборСтрок);
		РезультатФункции.Вставить("ИндексЭлемента", ИндексТекущегоЭлемента);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ПолучитьНаборСтрокРодителя(ЭлементДерева)
	
	РезультатФункции = Неопределено;
	
	РодительЭлемента = ЭлементДерева.ПолучитьРодителя();
	Если РодительЭлемента = Неопределено Тогда
		РезультатФункции = ДеревоОбластейФормыРМК.ПолучитьЭлементы();
	Иначе
		РезультатФункции = РодительЭлемента.ПолучитьЭлементы();
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьФормуПоВходнымПараметрам()
	
	НастройкиРМК = Параметры.НастройкаРМК;
	ГоризонтальнаяОриентация = Параметры.ГоризонтальнаяОриентация;
	ПалитраПлиточногоИнтерфейса = Параметры.Палитра;
	ОсновнойПодборПлиточный = Параметры.ОсновнойПодборПлиточный;
	МодельОбластейРМК = Параметры.МодельОбластей;
	ВлияющиеПараметры = Параметры.ВлияющиеПараметры;
	СценарийИспользования = ВлияющиеПараметры.СценарийИспользования;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиОбластей()
	
	ЗапросНастроек = Новый Запрос;
	ЗапросНастроек.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираНастройкиОбластей.ЗаголовокОбласти КАК ЗаголовокОбласти,
	|	НастройкиРабочегоМестаКассираНастройкиОбластей.СвойствоЭлементовОбласти КАК СвойствоЭлементовОбласти,
	|	НастройкиРабочегоМестаКассираНастройкиОбластей.ЗначениеСвойства КАК ЗначениеСвойства
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.НастройкиОбластей КАК НастройкиРабочегоМестаКассираНастройкиОбластей
	|ГДЕ
	|	НастройкиРабочегоМестаКассираНастройкиОбластей.Ссылка = &НастройкаРМК
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиРабочегоМестаКассираНастройкиОбластей.НомерСтроки";
	ЗапросНастроек.УстановитьПараметр("НастройкаРМК", НастройкиРМК);
	ТаблицаНастроек = ЗапросНастроек.Выполнить().Выгрузить();
	
	НастройкиОбластейФормыРМК.Загрузить(ТаблицаНастроек);
	НастройкиПоУмолчанию = ИнтерфейсРМКСлужебный.ПолучитьПервоначальныеНастройкиОбластейРМК();
	Для Каждого СтрокаБазовойНастройки Из НастройкиПоУмолчанию Цикл
		ОтборСтрок = Новый Структура();
		ОтборСтрок.Вставить("ЗаголовокОбласти", СтрокаБазовойНастройки.ЗаголовокОбласти);
		ОтборСтрок.Вставить("СвойствоЭлементовОбласти", СтрокаБазовойНастройки.СвойствоЭлементовОбласти);
		СтрокиНастроекФормы = НастройкиОбластейФормыРМК.НайтиСтроки(ОтборСтрок);
		Если СтрокиНастроекФормы.Количество() = 0 Тогда
			НоваяСтрока = НастройкиОбластейФормыРМК.Добавить();
			НоваяСтрока.ЗаголовокОбласти = СтрокаБазовойНастройки.ЗаголовокОбласти;
			НоваяСтрока.СвойствоЭлементовОбласти = СтрокаБазовойНастройки.СвойствоЭлементовОбласти;
			НоваяСтрока.ЗначениеСвойства = СтрокаБазовойНастройки.ЗначениеСвойства;
			НоваяСтрока.ЗначениеПоУмолчанию = СтрокаБазовойНастройки.ЗначениеСвойства;
		Иначе
			СтрокиНастроекФормы[0].ЗначениеПоУмолчанию = СтрокаБазовойНастройки.ЗначениеСвойства;
		КонецЕсли;
	КонецЦикла;
	КоличествоНастроек = НастройкиОбластейФормыРМК.Количество();
	ИндексНастройки = 0;
	Пока ИндексНастройки < КоличествоНастроек Цикл
		ТекущийИндекс = КоличествоНастроек - ИндексНастройки - 1;
		СтрокаНастройки = НастройкиОбластейФормыРМК.Получить(ТекущийИндекс);
		ОтборСтрок = Новый Структура();
		ОтборСтрок.Вставить("ЗаголовокОбласти", СтрокаНастройки.ЗаголовокОбласти);
		ОтборСтрок.Вставить("СвойствоЭлементовОбласти", СтрокаНастройки.СвойствоЭлементовОбласти);
		СтрокиНастроекПоУмолчанию = НастройкиПоУмолчанию.НайтиСтроки(ОтборСтрок);
		Если СтрокиНастроекПоУмолчанию.Количество() = 0 Тогда
			НастройкиОбластейФормыРМК.Удалить(ТекущийИндекс);
		КонецЕсли;
		ИндексНастройки = ИндексНастройки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПорядокОбластейФормы()
	
	ЗапросПорядкаОбластей = Новый Запрос;
	ЗапросПорядкаОбластей.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираПорядокОбластей.ОбластьРодитель КАК ОбластьРодитель,
	|	НастройкиРабочегоМестаКассираПорядокОбластей.Область КАК Область,
	|	НастройкиРабочегоМестаКассираПорядокОбластей.Порядок КАК Порядок,
	|	НастройкиРабочегоМестаКассираПорядокОбластей.ВертикальнаяОриентация КАК ВертикальнаяОриентация
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.ПорядокОбластей КАК НастройкиРабочегоМестаКассираПорядокОбластей
	|ГДЕ
	|	НастройкиРабочегоМестаКассираПорядокОбластей.Ссылка = &НастройкаРМК
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиРабочегоМестаКассираПорядокОбластей.НомерСтроки";
	ЗапросПорядкаОбластей.УстановитьПараметр("НастройкаРМК", НастройкиРМК);
	ТаблицаПорядка = ЗапросПорядкаОбластей.Выполнить().Выгрузить();
	
	ПорядокОбластей.Загрузить(ТаблицаПорядка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРасположениеЗаголовков()
	
	Если ГоризонтальнаяОриентация Тогда
		
		Элементы.НастройкаРМКВертикальнаяОриентация.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.ПалитраПлиточногоИнтерфейса.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		
	Иначе
		
		Элементы.НастройкаРМКВертикальнаяОриентация.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		Элементы.ПалитраПлиточногоИнтерфейса.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОриентацииСервер(ПараметрыНастройки, РеквизитыПалитры)
	
	Если ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		ОбновитьРасположениеЗаголовков();
	КонецЕсли;
	ДанныеРазмеров = ПолучитьРеквизитыПалитры(ПараметрыНастройки);
	ЗаполнитьЗначенияСвойств(РеквизитыПалитры, ДанныеРазмеров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПорядокОбластейСхемыРМК()
	
	КорневаяГруппа = ?(ГоризонтальнаяОриентация,
		МодельОбластейРМК.ГоризонтальнаяОриентация, МодельОбластейРМК.ВертикальнаяОриентация);
	ОчиститьПорядокОбластей();
	ЗаписатьПорядокОбластейРодителя(КорневаяГруппа.Имя, ДеревоОбластейФормыРМК.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПорядокОбластей()
	
	КоличествоСтрок = ПорядокОбластей.Количество();
	Если КоличествоСтрок > 0 Тогда
		Для Счт = 1 По КоличествоСтрок Цикл
			ИндексСтроки = КоличествоСтрок - Счт;
			СтрокаПорядка = ПорядокОбластей.Получить(ИндексСтроки);
			Если Не СтрокаПорядка.ВертикальнаяОриентация = ГоризонтальнаяОриентация Тогда
				ПорядокОбластей.Удалить(СтрокаПорядка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПорядокОбластейРодителя(ИмяРодителя, СтрокиУровня)
	
	ПорядковыйНомерОбласти = 1;
	Для Каждого СтрокаОбласти Из СтрокиУровня Цикл
		
		ОтборДляПоиска = Новый Структура();
		ОтборДляПоиска.Вставить("Область", СтрокаОбласти.ИмяОбласти);
		ОтборДляПоиска.Вставить("ВертикальнаяОриентация", (Не ГоризонтальнаяОриентация));
		
		НоваяСтрока = ПорядокОбластей.Добавить();
		НоваяСтрока.Область = СтрокаОбласти.ИмяОбласти;
		НоваяСтрока.ВертикальнаяОриентация = Не ГоризонтальнаяОриентация;
		НоваяСтрока.Порядок = ПорядковыйНомерОбласти;
		НоваяСтрока.ОбластьРодитель = ИмяРодителя;
		
		ПорядковыйНомерОбласти = ПорядковыйНомерОбласти + 1;
		ПодчиненныеСтроки = СтрокаОбласти.ПолучитьЭлементы();
		Если ПодчиненныеСтроки.Количество() > 0 Тогда
			ЗаписатьПорядокОбластейРодителя(СтрокаОбласти.ИмяОбласти, ПодчиненныеСтроки);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтображениеФормыНастроек(ФормаНастроек, ОбновляемыеЭлементы = Неопределено)

	ЭлементыФормы = ФормаНастроек.Элементы;
	
	Если ОбновляемыеЭлементы = Неопределено
			Или Не ОбновляемыеЭлементы.Найти(ЭлементыФормы.ДеревоОбластейФормыРМКСброситьНастройкиСвойствОбластей)
				= Неопределено Тогда
		
		ЭлементыФормы.ДеревоОбластейФормыРМКСброситьНастройкиСвойствОбластей.Доступность
			= ЕстьПерсонализированныеНастройкиОбластей(ФормаНастроек.НастройкиОбластейФормыРМК);
		
	КонецЕсли;
	Если ОбновляемыеЭлементы = Неопределено
			Или Не ОбновляемыеЭлементы.Найти(ЭлементыФормы.ДеревоОбластейФормыРМКВосстановитьНастройкиПорядкаОбластей)
				= Неопределено Тогда
				
		ЭлементыФормы.ДеревоОбластейФормыРМКВосстановитьНастройкиПорядкаОбластей.Доступность
			= ЕстьСмещенныеОбласти(ФормаНастроек.ДеревоОбластейФормыРМК.ПолучитьЭлементы());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьПерсонализированныеНастройкиОбластей(СтрокиНастроек)
	
	РезультатФункции = Ложь;
	
	ИндексСтроки = 0;
	КоличествоСтрок = СтрокиНастроек.Количество();
	Пока ИндексСтроки < КоличествоСтрок И Не РезультатФункции Цикл
		СтрокаНастроек = СтрокиНастроек.Получить(ИндексСтроки);
		Если Не СтрокаНастроек.ЗначениеПоУмолчанию = СтрокаНастроек.ЗначениеСвойства Тогда
			РезультатФункции = Истина;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьСмещенныеОбласти(СтрокиУровня)
	
	РезультатФункции = Ложь;
	
	КоличествоСтрок = СтрокиУровня.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И Не РезультатФункции Цикл
		СтрокаБлока = СтрокиУровня[ИндексСтроки];
		Если СтрокиУровня.Индекс(СтрокаБлока) = СтрокаБлока.ИсходныйПорядок - 1 Тогда
			РезультатФункции = ЕстьСмещенныеОбласти(СтрокаБлока.ПолучитьЭлементы());
		Иначе
			РезультатФункции = Истина;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ПараметрыДляРедактированияОбластиРМК(ЗаголовокОбласти)
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ЗаголовокОбъекта", ЗаголовокОбласти);
	РезультатФункции.Вставить("ТипОбъекта", Тип("ГруппаФормы"));
	РезультатФункции.Вставить("СценарийИспользования", ВлияющиеПараметры.СценарийИспользования);
	ОтборСтрокНастроек = Новый Структура();
	ОтборСтрокНастроек.Вставить("ЗаголовокОбласти", ЗаголовокОбласти);
	СтрокиНастроекФормы = НастройкиОбластейФормыРМК.НайтиСтроки(ОтборСтрокНастроек);
	СоответствиеНастроек = Новый Соответствие;
	Для Каждого СтрокаНастройки Из СтрокиНастроекФормы Цикл
		ЗначенияНастройки = Новый Структура();
		ЗначенияНастройки.Вставить("ЗначениеСвойства", СтрокаНастройки.ЗначениеСвойства);
		ЗначенияНастройки.Вставить("ЗначениеПоУмолчанию", СтрокаНастройки.ЗначениеПоУмолчанию);
		СоответствиеНастроек.Вставить(СтрокаНастройки.СвойствоЭлементовОбласти, ЗначенияНастройки);
	КонецЦикла;
	РезультатФункции.Вставить("Настройки", СоответствиеНастроек);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура РедактированиеНастроекОбластиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ВозможныеСостоянияНастроек = ИнтерфейсРМКСлужебныйКлиентСервер.ВозможныеСостоянияНастроек();
		ВключитьКнопкуСброса = Ложь;
		СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиПоУмолчанию;
		ОтборСтрокНастроек = Новый Структура();
		ОтборСтрокНастроек.Вставить("ЗаголовокОбласти", Результат.ЗаголовокОбъекта);
		СтрокиНастроекФормы = НастройкиОбластейФормыРМК.НайтиСтроки(ОтборСтрокНастроек);
		Для Каждого СтрокаНастройки Из СтрокиНастроекФормы Цикл
			
			НовоеЗначение = Результат.Настройки.Получить(СтрокаНастройки.СвойствоЭлементовОбласти);
			Если НовоеЗначение = Неопределено Тогда
				СтрокаНастройки.ЗначениеСвойства = СтрокаНастройки.ЗначениеПоУмолчанию;
			Иначе
				СтрокаНастройки.ЗначениеСвойства = НовоеЗначение;
			КонецЕсли;
			Если ИнтерфейсРМКСлужебныйКлиентСервер.НастройкаОбластиСоответствуетСценариюИспользования(СтрокаНастройки.ЗаголовокОбласти,
					СтрокаНастройки.СвойствоЭлементовОбласти, ВлияющиеПараметры.СценарийИспользования) 
					И Не СтрокаНастройки.ЗначениеСвойства = СтрокаНастройки.ЗначениеПоУмолчанию Тогда
					
				СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиИзменены;
				ВключитьКнопкуСброса = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		СтрокаОбластиДерева = ДеревоОбластейФормыРМК.НайтиПоИдентификатору(ДополнительныеПараметры);
		СтрокаОбластиДерева.СостояниеНастроек = СостояниеНастроек;
		
		ОбновляемыеЭлементы = Новый Массив;
		ОбновляемыеЭлементы.Добавить(Элементы.ДеревоОбластейФормыРМКСброситьНастройкиСвойствОбластей);
		ОбновитьОтображениеФормыНастроек(ЭтотОбъект, ОбновляемыеЭлементы);
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыЗаполнения()
	
	РежимПлитки = 1;
	ПараметрыЗаполнения = ВлияющиеПараметры;
	ПараметрыЗаполнения.Вставить("ПлиточныйИнтерфейс", ТекущийЭкран = РежимПлитки);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

&НаСервере
Процедура ВосстановитьПервоначальноеДеревоОбластейФормы()
	
	ИнтерфейсРМКСлужебный.ВосстановитьПервоначальноеДеревоОбластейФормы(ЭтотОбъект, ПодготовитьПараметрыЗаполнения());
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройкиПорядкаОбластейКлиент()
	
	ОповещениеВосстановления = Новый ОписаниеОповещения("ВопросВосстановлениеПорядкаОбластейЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Порядок следования областей будет сброшен к первоначальному. Продолжить?'");
	ПоказатьВопрос(ОповещениеВосстановления, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросВосстановлениеПорядкаОбластейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВосстановитьПервоначальноеДеревоОбластейФормы();
		ПересчитатьПорядокОбластейСхемыРМК();
		РазвернутьСтрокиДерева();
		
		ОбновляемыеЭлементы = Новый Массив;
		ОбновляемыеЭлементы.Добавить(Элементы.ДеревоОбластейФормыРМКВосстановитьНастройкиПорядкаОбластей);
		ОбновитьОтображениеФормыНастроек(ЭтотОбъект, ОбновляемыеЭлементы);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройкиСвойствОбластейКлиент()
	
	ОповещениеСброса = Новый ОписаниеОповещения("ВопросСбросНастроекСвойствОбластейЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Настройки элементов областей будут сброшены. Продолжить?'");
	ПоказатьВопрос(ОповещениеСброса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьИзмененныеСостоянияНастроек(СтрокиУровня)
	
	ВозможныеСостоянияНастроек = ИнтерфейсРМКСлужебныйКлиентСервер.ВозможныеСостоянияНастроек();
	Для Каждого СтрокаОбласти Из СтрокиУровня Цикл
		Если СтрокаОбласти.СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиИзменены Тогда
			СтрокаОбласти.СостояниеНастроек = ВозможныеСостоянияНастроек.НастройкиПоУмолчанию;
		КонецЕсли;
		УбратьИзмененныеСостоянияНастроек(СтрокаОбласти.ПолучитьЭлементы())
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСбросНастроекСвойствОбластейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Для Каждого СтрокаНастройкиОбласти Из НастройкиОбластейФормыРМК Цикл
			СтрокаНастройкиОбласти.ЗначениеСвойства = СтрокаНастройкиОбласти.ЗначениеПоУмолчанию;
		КонецЦикла;
		УбратьИзмененныеСостоянияНастроек(ДеревоОбластейФормыРМК.ПолучитьЭлементы());
		Элементы.ДеревоОбластейФормыРМКСброситьНастройкиСвойствОбластей.Доступность = Ложь;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуУровня(СтрокиУровня, ИмяОбласти)
	
	РезультатФункции = Неопределено;
	КоличествоСтрок = СтрокиУровня.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаУровня = СтрокиУровня.Получить(ИндексСтроки);
		Если СтрокаУровня.ИмяОбласти = ИмяОбласти Тогда
			РезультатФункции = СтрокаУровня;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура СхемаФормыРМКПриНажатииКлиент(Знач EventElement)
	
	ИмяИменногоТэга = "td";
	МассивИменГрупп = Новый Массив;
	Пока Не EventElement = Неопределено Цикл
		Если Нрег(EventElement.tagName) = ИмяИменногоТэга И ЗначениеЗаполнено(EventElement.id) Тогда
			ИмяГруппы = EventElement.id;
			МассивИменГрупп.Вставить(0, ИмяГруппы);
		КонецЕсли;
		EventElement = EventElement.parentElement;
	КонецЦикла;
	КоличествоГрупп = МассивИменГрупп.Количество();
	СтрокаДерева = ?(КоличествоГрупп > 0, ДеревоОбластейФормыРМК, Неопределено);
	ИндексГруппы = 0;
	Пока ИндексГруппы < КоличествоГрупп И Не СтрокаДерева = Неопределено Цикл
		ИмяГруппы = МассивИменГрупп[ИндексГруппы];
		СтрокаДерева = ПолучитьСтрокуУровня(СтрокаДерева.ПолучитьЭлементы(), ИмяГруппы);
		ИндексГруппы = ИндексГруппы + 1;
	КонецЦикла;
	Если Не СтрокаДерева = Неопределено Тогда
		Элементы.ДеревоОбластейФормыРМК.ТекущаяСтрока = СтрокаДерева.ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПалитры()
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ОбработатьВыборПалитры", ЭтотОбъект, Неопределено);
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ДляИнтерфейса", Истина);
	ОткрытьФорму("Справочник.ПалитраТоваровРМК.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеВыбора,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПалитры(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ПалитраПлиточногоИнтерфейса = Результат;
		ПалитраПлиточногоИнтерфейсаВыбор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПалитраПлиточногоИнтерфейсаВыбор()
	
	Если ТекущийЭкран = 1 И Не ЗначениеЗаполнено(ПалитраПлиточногоИнтерфейса) Тогда
		ТекущийЭкран = 0;
		ЗаполнитьДеревоОбластейФормы();
		РазвернутьСтрокиДерева();
	КонецЕсли;
	Элементы.ГруппаУправлениеЭкраном.Видимость = ЗначениеЗаполнено(ПалитраПлиточногоИнтерфейса);
	Элементы.ОсновнойПодборПлиточный.Видимость = ЗначениеЗаполнено(ПалитраПлиточногоИнтерфейса);
	Если ОсновнойПодборПлиточный И Не ЗначениеЗаполнено(ПалитраПлиточногоИнтерфейса) Тогда
		ОсновнойПодборПлиточный = Ложь;
	КонецЕсли;
	ЗапомнитьРеквизитыПалитры();
	ПоказатьСхемуФормыРМК();
	
КонецПроцедуры

#Область СохранениеНастроек

&НаСервере
Функция СохранитьНастройки()
	
	ТекстОшибки = "";
	Попытка
		
		НастройкаОбъект = НастройкиРМК.ПолучитьОбъект();
		НастройкаОбъект.ПорядокОбластей.Загрузить(ПорядокОбластей.Выгрузить());
		
		НастройкаОбъект.НастройкиОбластей.Очистить();
		Для Каждого СтрокаНастройки Из НастройкиОбластейФормыРМК Цикл
			Если Не СтрокаНастройки.ЗначениеСвойства = СтрокаНастройки.ЗначениеПоУмолчанию Тогда
			
				НоваяСтрока = НастройкаОбъект.НастройкиОбластей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНастройки);
			
			КонецЕсли;
		КонецЦикла;
		НастройкаОбъект.ВертикальнаяОриентация = Не ГоризонтальнаяОриентация;
		НастройкаОбъект.СтруктураПлиточногоИнтерфейсаПодбора = ПалитраПлиточногоИнтерфейса;
		НастройкаОбъект.ОсновнойПодборПлиточный = ОсновнойПодборПлиточный;
		НастройкаОбъект.ОбменДанными.Загрузка = Истина;
		НастройкаОбъект.Записать();
		Модифицированность = Ложь;
		
	Исключение
		
		ОбщаяИнформацияОбОшибке = НСтр("ru = 'Ошибка записи настроек областей РМК.'", ОбщегоНазначения.КодОсновногоЯзыка());
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ОбщаяИнформацияОбОшибке, УровеньЖурналаРегистрации.Ошибка,
			, , ПодробноеПредставлениеОшибки);
		ТекстОшибки = НСтр("ru = 'Возникла Ошибка при записи настроек областей РМК.
			|Обратитесь к администратору, подробности в журнале регистрации.'", ОбщегоНазначения.КодОсновногоЯзыка());
		
	КонецПопытки;
	Возврат ТекстОшибки;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИЗакрытьКлиент()
	
	Если ПроверитьДанныеИСохранитьНастройки() Тогда
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДанныеИСохранитьНастройки()
	
	ТекстОшибки = СохранитьНастройки();
	Если Не ТекстОшибки = "" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		
	КонецЕсли;
	Возврат (ТекстОшибки = "");
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОтветОЗакрытии(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьИЗакрытьКлиент();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти