#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ПолноеИмяФормы = Параметры.ПолноеИмяФормы;
	НельзяОтключитьВсеПечатныеФормы = Параметры.НельзяОтключитьВсеПечатныеФормы;
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	ЗагрузитьТекущиеНастройкиПользователя();
	КэшПечатныеФормы = ПечатныеФормы.Скопировать();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НельзяОтключитьВсеПечатныеФормы Тогда
		
		Для Каждого ПечатнаяФорма Из ПечатныеФормы Цикл
			
			Если ПечатнаяФорма.Пометка Тогда
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Выберите хотя бы одну печатную форму'"), , , , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПредложитьВозможностьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Тег = СтрШаблон(НСтр("ru = 'Настройки печатных форм, родитель - %1'"), ПолноеИмяФормы);
	Текст = НСтр("ru = 'Опишите, каких печатных форм вам не хватает в программе:'");
	УправлениеНебольшойФирмойКлиент.ПредложитьВозможностьНажатие(Тег, Текст);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПечатныеФормы

&НаКлиенте
Процедура ПечатныеФормыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.КнопкаСохранить.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПечатныеФормыПриИзменении(Элемент)
	Элементы.КнопкаСохранить.Доступность = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	ВыборЗаписан = ЗаписатьВыборПользователя();
	Если Не ВыборЗаписан Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокИзменен = Ложь;
	Для Каждого ПечатнаяФорма Из ПечатныеФормы Цикл
		Если Не ПечатнаяФорма.Пометка Тогда
			Продолжить;
		КонецЕсли;
		ПечатнаяФормаКэш = КэшПечатныеФормы.Получить(ПечатныеФормы.Индекс(ПечатнаяФорма));
		Если ПечатнаяФормаКэш.Значение <> ПечатнаяФорма.Значение Тогда
			ПорядокИзменен = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	СокращенноеИмяФормы = ПечатьДокументовУНФКлиент.СократитьПолноеИмяФормы(ПолноеИмяФормы);
	СтруктураОповещения = Новый Структура("ПолноеИмяФормы, ПечатныеФормы, ПорядокИзменен", СокращенноеИмяФормы,
		ПечатныеФормы, ПорядокИзменен);
	Оповестить("ВыполненаНастройкаПечатнойФормыПоУмолчанию", СтруктураОповещения);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройкиПоУмолчанию(Команда)
	ВосстановитьНастройкиПоУмолчаниюНаСервере();
	Элементы.КнопкаСохранить.Доступность = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаписатьВыборПользователя()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РегистрыСведений.НастройкиПечатныхФормПоУмолчанию.ЗаписатьНастройкиПользователя(
	ТекущийПользователь, ПолноеИмяФормы, "", ПечатныеФормы);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьТекущиеНастройкиПользователя(Восстановление = Ложь)
	ПечатныеФормы.Очистить();
	Если Восстановление Или Параметры.СведенияОПечатныхФормах.Количество() = 0 Тогда
		Сведения = Параметры.СведенияОПечатныхФормахПоУмолчанию;
	Иначе
		Сведения = Параметры.СведенияОПечатныхФормах;
	КонецЕсли;

	СтруктураНастроек = РегистрыСведений.НастройкиПечатныхФормПоУмолчанию.НастройкиПользователя(ТекущийПользователь,
		ПолноеИмяФормы);
	Если Восстановление Или СтруктураНастроек = Неопределено Тогда
		Для Каждого ЭлементСведений Из Сведения Цикл
			ПечатныеФормы.Добавить(ЭлементСведений.Значение, ЭлементСведений.Представление, Истина);
		КонецЦикла;
	Иначе

		НастройкиИзХранилища = СтруктураНастроек.ПечатныеФормы;
		Для Каждого НастройкаИзХранилища Из НастройкиИзХранилища Цикл
			ПечатныеФормы.Добавить(НастройкаИзХранилища.Значение, НастройкаИзХранилища.Представление,
				НастройкаИзХранилища.Пометка);
		КонецЦикла;
		Для Каждого ЭлементСведений Из Сведения Цикл
			НастройкаВХранилище = НастройкиИзХранилища.НайтиПоЗначению(ЭлементСведений.Значение);
			Если НастройкаВХранилище = Неопределено Тогда
				НастройкиИзХранилища.Добавить(ЭлементСведений.Значение, ЭлементСведений.Представление, Истина);
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиПоУмолчаниюНаСервере()
	ЗагрузитьТекущиеНастройкиПользователя(Истина);
КонецПроцедуры

#КонецОбласти