#Область ОписаниеПеременных

// Номер текущего элемента таблицы касс ККМ
&НаКлиенте
Перем НомерТекущегоЭлемента;

// Данные об операциях, выполненных с кассами
&НаКлиенте
Перем ДанныеОбработки;

// Считает, от скольки экв. терминалов еще ожидаем ответ
&НаКлиенте
Перем СчетчикДоступностиСверки;

// Признак того, что было открытие смены
&НаКлиенте
Перем БылоОткрытиеСмены;

// Признак того, что было закрытие смены
&НаКлиенте
Перем БылоЗакрытиеСмены;

// Признак того, что было внесение или выемка
&НаКлиенте
Перем БылоВнесениеВыемка;

// Признак того, что было обновление данных касс после внесения или выемки
&НаКлиенте
Перем БылоОбновлениеПослеВнесенияВыемки;

// Признак того, что было изменение статуса ТС ПИоТ
&НаКлиенте
Перем БылоИзменениеСтатусаТСПИоТ;

// Флаг интерактивного закрытия
&НаКлиенте
Перем ИнтерактивноеЗакрытие Экспорт;

// Буфер данных к передаче на дисплей покупателя
&НаКлиенте
Перем ДанныеКПередачеВДисплейПокупателя;

// Типы возможных операций, отображаемых на дисплее покупателя
&НаКлиенте
Перем ТипыОперацийДисплеяПокупателя;

// Признак того, что запущено пакетное открытие смен
&НаКлиенте
Перем ПакетноеОткрытие;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьФормуПоВходнымПараметрам();
	НастроитьТиповыеГорячиеКлавиши();
	НастроитьГорячиеКлавиши();
	СформироватьКарточкиКассККМ();
	ПредставлениеВалюты = ОбщегоНазначенияРМК.ПредставлениеВалюты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НомерТекущегоЭлемента = 0;
	ИнтерактивноеЗакрытие = Ложь;
	БылоОткрытиеСмены = Ложь;
	БылоЗакрытиеСмены = Ложь;
	БылоВнесениеВыемка = Ложь;
	БылоОбновлениеПослеВнесенияВыемки = Ложь;
	БылоИзменениеСтатусаТСПИоТ = Ложь;
	ПакетноеОткрытие = Ложь;
	ДанныеОбработки = Новый Массив;
	ДанныеКПередачеВДисплейПокупателя = ИнтерфейсРМКСлужебныйКлиент.БуферОбменаДисплеяПокупателя();
	ТипыОперацийДисплеяПокупателя = МенеджерОборудованияРМККлиент.ТипыОперацийДисплеяПокупателя();
	ОбновитьДоступностьКнопкиПродолжения();
	УстановитьТекущимЭлементомГруппуСтроки(1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеСостоянияКассовойСмены" Тогда
		ОбновитьДанныеТаблицыКассККМ();
	ИначеЕсли ИмяСобытия = "ОбновлениеСтатусаТСПИоТ" Тогда
		
		ОбновитьСтатусТСПИоТ(Параметр.Статус, Параметр.ИдентификаторУстройства);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не (ИнтерактивноеЗакрытие Или ЗавершениеРаботы) Тогда
		Отказ = Истина;
		ВернутьсяКФормеИсточнику(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаКарточкаНажатие(Элемент)
	
	НомерВыбраннойГруппы = Число(Сред(Элемент.Имя, 14));
	УстановитьТекущимЭлементомГруппуСтроки(НомерВыбраннойГруппы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Вернуться(Команда)
	
	ВернутьсяКФормеИсточнику();
	
КонецПроцедуры

&НаКлиенте
Процедура ГорячаяКлавишаВверх(Команда)
	
	Если НомерТекущегоЭлемента > 1 Тогда
		НовыйНомер = НомерТекущегоЭлемента - 1;
	Иначе
		НовыйНомер = НомерТекущегоЭлемента;
	КонецЕсли;
	УстановитьТекущимЭлементомГруппуСтроки(НовыйНомер);
	
КонецПроцедуры

&НаКлиенте
Процедура ГорячаяКлавишаВниз(Команда)
	
	Если НомерТекущегоЭлемента < ТаблицаКассККМОрганизаций.Количество() Тогда
		НовыйНомер = НомерТекущегоЭлемента + 1;
	Иначе
		НовыйНомер = НомерТекущегоЭлемента;
	КонецЕсли;
	УстановитьТекущимЭлементомГруппуСтроки(НовыйНомер);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусСмены(Команда)
	
	НомерВыбраннойГруппы = Число(Сред(Команда.Имя, 20));
	УстановитьТекущимЭлементомГруппуСтроки(НомерВыбраннойГруппы);
	ОткрытьЗакрытьСменуВКассе();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗакрытьСмену(Команда)
	ОткрытьЗакрытьСменуВКассе();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВнесение(Команда)
	ВнесениеКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыемку(Команда)
	ВыемкаКлиент();
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтчетБезГашения(Команда)
	СнятьОтчетБезГашенияКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВнесениеИзКарточки(Команда)
	
	НомерВыбраннойГруппы = Число(Сред(Команда.Имя, 9));
	УстановитьТекущимЭлементомГруппуСтроки(НомерВыбраннойГруппы);
	ВнесениеКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыемкуИзКарточки(Команда)
	
	НомерВыбраннойГруппы = Число(Сред(Команда.Имя, 7));
	УстановитьТекущимЭлементомГруппуСтроки(НомерВыбраннойГруппы);
	ВыемкаКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтчетБезГашенияИзКарточки(Команда)
	
	НомерВыбраннойГруппы = Число(Сред(Команда.Имя, 16));
	УстановитьТекущимЭлементомГруппуСтроки(НомерВыбраннойГруппы);
	СнятьОтчетБезГашенияКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВсеСмены(Команда)
	ЗапуститьОткрытиеСледующейСмены(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусТСПИоТИзКарточки(Команда)
	
	Если НомерТекущегоЭлемента <= ТаблицаКассККМОрганизаций.Количество() Тогда
		СтрокаКассы = ТаблицаКассККМОрганизаций[НомерТекущегоЭлемента - 1];
		
		Если СтрокаКассы.НастроенТСПИоТ Тогда
			
			СтрокаКассы.ИдетОбработкаСтатусаТСПИоТ = Истина;
			
			ПодключитьОбработчикОжидания("ЗапуститьОбработкуСтатусовТСПИоТ", 0.5, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапуститьОткрытиеСледующейСмены(ПервыйЗапуск = Ложь)
	
	СтрокаКассы = ПолучитьПервуюСтрокуКассыДляОткрытия();
	Если СтрокаКассы = Неопределено Тогда
		ПакетноеОткрытие = Ложь;
	Иначе
		
		Если ПервыйЗапуск Тогда
			ПакетноеОткрытие = Истина;
		КонецЕсли;
		ИндексСтроки = ТаблицаКассККМОрганизаций.Индекс(СтрокаКассы);
		Если ИндексСтроки + 1 <> НомерТекущегоЭлемента Тогда
			УстановитьТекущимЭлементомГруппуСтроки(ИндексСтроки + 1);
		КонецЕсли;
		ОткрытьСмену(СтрокаКассы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПервуюСтрокуКассыДляОткрытия()
	
	РезультатФункции = Неопределено;
	
	ИндексСтроки = 0;
	Пока ИндексСтроки < ТаблицаКассККМОрганизаций.Количество() И РезультатФункции = Неопределено Цикл
		СтрокаКассы = ТаблицаКассККМОрганизаций.Получить(ИндексСтроки);
		Если Не СтрокаКассы.Открыта Тогда
			РезультатФункции = СтрокаКассы;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура ВычислитьМинимальнуюДатуНачалаСмены()
	
	Дата = ТекущаяДатаСеанса();
	Сутки = 86400;
	ВремяНачалаСменыВСекундах = ВремяНачалаСмены - Дата(1, 1, 1);
	МинимальноеДатаНачалаСмены = НачалоДня(Дата) + ВремяНачалаСменыВСекундах;
	Если Дата < МинимальноеДатаНачалаСмены Тогда
		МинимальноеДатаНачалаСмены = МинимальноеДатаНачалаСмены - Сутки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеТаблицыКассККМ()
	
	РезультатОбновления = ОбновитьДанныеТаблицыКассККМСервер();
	Если РезультатОбновления.Успех Тогда
		
		БылоОбновлениеПослеВнесенияВыемки = Истина;
		
	Иначе
		
		ДополнительныеПараметры = Новый Структура("ЗакрытьФорму", Истина);
		
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(РезультатОбновления.ТекстСообщения, РезультатОбновления.ТекстЗаголовка);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки, ДополнительныеПараметры);
	
	КонецЕсли;
	ОбновитьДоступностьКнопкиПродолжения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьКнопкиПродолжения()
	
	ДоступностьПродолжения = ВсеСменыОткрыты() Или Не РежимКассыСамообслуживания;
	Если Не Элементы.Вернуться.Доступность = ДоступностьПродолжения Тогда
		Элементы.Вернуться.Доступность = ДоступностьПродолжения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеТаблицыКассККМСервер()
	
	РезультатФункции = Новый Структура("Успех", Истина);
	
	ВычислитьМинимальнуюДатуНачалаСмены();
	
	Запрос = Новый Запрос;
	ПараметрыЗапросаДанныхКасс = Новый Структура();
	ПараметрыЗапросаДанныхКасс.Вставить("ТорговыйОбъект", ТорговыйОбъект);
	ПараметрыЗапросаДанныхКасс.Вставить("РабочееМесто", РабочееМесто);
	ПараметрыЗапросаДанныхКасс.Вставить("РежимКСО", РежимКассыСамообслуживания);
	
	ОбщегоНазначенияРМКПереопределяемый.СформироватьЗапросДанныеКассыККМ(Запрос,
		Неопределено, ПараметрыЗапросаДанныхКасс);
		
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		
		МассивОбновленныхКасс = Новый Массив;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() И РезультатФункции.Успех Цикл
			ОтборПоКассе = Новый Структура("КассаККМ", Выборка.КассаККМ);
			СтрокиКассы = ТаблицаКассККМОрганизаций.НайтиСтроки(ОтборПоКассе);
			Если СтрокиКассы.Количество() > 0 Тогда
				МассивОбновленныхКасс.Добавить(Выборка.КассаККМ);
				СтрокаКассы = СтрокиКассы[0];
				ЗаполнитьСтрокуКассыАктуальнымиДанными(СтрокаКассы, Выборка, РезультатФункции);
			КонецЕсли;
		КонецЦикла;
		Если РезультатФункции.Успех Тогда
			ОбщегоНазначенияРМКПереопределяемый.ПроверитьКоличествоНепробитыхЧеков(ЭтотОбъект);
			УдалитьНеАктуальныеКассыККМ(МассивОбновленныхКасс);
			Если ТаблицаКассККМОрганизаций.Количество() = 0 Тогда
				ЗафиксироватьОшибкуОпределенияДоступныхКасс(РезультатФункции);
			Иначе
				ОбновитьЭлементыКарточек();
			КонецЕсли;
		КонецЕсли;
		ОтборСтрок = Новый Структура("Открыта", Ложь);
		СтрокиЗакрытыхСмен = ТаблицаКассККМОрганизаций.НайтиСтроки(ОтборСтрок);
		Элементы.ОткрытьВсеСмены.Доступность = (СтрокиЗакрытыхСмен.Количество() > 0);
		Элементы.ОткрытьВсеСмены.Видимость = (ТаблицаКассККМОрганизаций.Количество() > 1);
		
	Иначе
		
		ЗафиксироватьОшибкуОпределенияДоступныхКасс(РезультатФункции);
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура ЗафиксироватьОшибкуОпределенияДоступныхКасс(РезультатФункции)
	
	ТекстЗаголовка = НСтр("ru = 'Ошибка определения доступных касс ККМ'");
	ТекстСообщения = НСтр("ru = 'Не сформирован запрос для получения данных Касс ККМ'");
	
	РезультатФункции.Успех = Ложь;
	РезультатФункции.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	РезультатФункции.Вставить("ТекстСообщения", ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНеАктуальныеКассыККМ(МассивОбновленныхКасс)
	
	КоличествоКасс = ТаблицаКассККМОрганизаций.Количество();
	ИндексКассы = 0;
	Пока ИндексКассы < КоличествоКасс Цикл
		ТекущийИндекс = КоличествоКасс - ИндексКассы - 1;
		СтрокаКассы = ТаблицаКассККМОрганизаций.Получить(ТекущийИндекс);
		Если МассивОбновленныхКасс.Найти(СтрокаКассы.КассаККМ) = Неопределено Тогда
			ТаблицаКассККМОрганизаций.Удалить(ТекущийИндекс);
		КонецЕсли;
		ИндексКассы = ИндексКассы + 1;
	КонецЦикла;
	ИндексКассы = КоличествоКасс;
	Пока ИндексКассы > ТаблицаКассККМОрганизаций.Количество() Цикл
		ИмяГруппыКассы = СтрШаблон("КарточкаКассы%1", ИндексКассы);
		Элементы[ИмяГруппыКассы].Видимость = Ложь;
		ИндексКассы = ИндексКассы - 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыКарточек()
	
	НомерКарточки = 0;
	Для Каждого СтрокаКассы Из ТаблицаКассККМОрганизаций Цикл
		
		НомерКарточки = НомерКарточки + 1;
		
		ИмяДекорации = СтрШаблон("ДекорацияСтатус%1", НомерКарточки);
		ИмяКарточкиДекорации = СтрШаблон("КарточкаДекорацииСтатуса%1", НомерКарточки);
		
		НаборКнопок = Неопределено;
		Если Не РежимВыбора Тогда
			ИмяКнопкиИзменитьСтатус = СтрШаблон("ИзменитьСтатусСмены%1", НомерКарточки);
			ИмяКнопкиТСПИоТ = СтрШаблон("ОбновитьСтатусТСПИоТ%1", НомерКарточки);
			ИмяКнопкиВнесение = СтрШаблон("Внесение%1", НомерКарточки);
			ИмяКнопкиВыемка = СтрШаблон("Выемка%1", НомерКарточки);
			
			НаборКнопок = Новый Структура;
			НаборКнопок.Вставить("КнопкаВнесение", Неопределено);
			НаборКнопок.Вставить("КнопкаВыемка", Неопределено);
			НаборКнопок.Вставить("КнопкаОперации", Элементы[ИмяКнопкиИзменитьСтатус]);
			Если ИспользоватьОплатуНаличными Тогда
				НаборКнопок.Вставить("КнопкаВнесение", Элементы[ИмяКнопкиВнесение]);
				НаборКнопок.Вставить("КнопкаВыемка", Элементы[ИмяКнопкиВыемка]);
			КонецЕсли;
			
			Если СтрокаКассы.НастроенТСПИоТ Тогда
				
				ИмяДекорацииТСПИоТ = СтрШаблон("ДекорацияСтатусТСПИоТ%1", НомерКарточки);
				ЭлементДекорацииТСПИоТ = Элементы[ИмяДекорацииТСПИоТ];
				
				Если Не СтрокаКассы.ВнешнийТСПИоТ Тогда
					НаборКнопок.Вставить("КнопкаТСПИоТ", Элементы[ИмяКнопкиТСПИоТ]);
				КонецЕсли;
				
			Иначе
				
				ЭлементДекорацииТСПИоТ = Неопределено;
				
			КонецЕсли;
			
			НаборКнопок.Вставить("КнопкаОперации", Элементы[ИмяКнопкиИзменитьСтатус]);
			
		КонецЕсли;
		
		НастроитьОформлениеКарточкиКассы(СтрокаКассы, Элементы[ИмяКарточкиДекорации], Элементы[ИмяДекорации], ЭлементДекорацииТСПИоТ, НаборКнопок);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПодключаемоеОборудованиеИспользуется(ПроверяемоеПодключаемоеОборудование)
	
	РезультатФункции = Истина;
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьПризнакИспользованияПодключаемогоОборудования(ПроверяемоеПодключаемоеОборудование,
		РезультатФункции);
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуКассыАктуальнымиДанными(СтрокаКассы, ВыборкаКасс, РезультатФункции)
	
	Если НЕ ВыборкаКасс.ИспользоватьБезПодключенияОборудования Тогда
		Если (Не РежимКассыСамообслуживания) Или (ЗначениеЗаполнено(ВыборкаКасс.ПодключаемоеОборудование)
				И ПодключаемоеОборудованиеИспользуется(ВыборкаКасс.ПодключаемоеОборудование)) Тогда
			
			ОписаниеПоследнейКассовойСмены
				= КассовыеСменыВызовСервера.ОписаниеПоследнейКассовойСмены(ВыборкаКасс.ПодключаемоеОборудование);
			
		Иначе
			
			РезультатФункции.Успех = Ложь;
			ТекстЗаголовка = НСтр("ru = 'Ошибка определения подключаемого оборудования кассы ККМ'");
			ТекстСообщения = НСтр("ru = 'Подключаемое оборудование не настроено на кассе ККМ.
				|Обратитесь к администратору системы.'");
			
		КонецЕсли;
	Иначе
		ОписаниеПоследнейКассовойСмены = КассовыеСменыВызовСервера.ОписаниеПоследнейКассовойСмены(ВыборкаКасс.КассаККМ);
	КонецЕсли;
	Если РезультатФункции.Успех Тогда
		
		Если ИспользоватьОплатуНаличными Тогда
			ЗаполнитьНаличныеВКассеККМ(СтрокаКассы);
		КонецЕсли;
		СтрокаКассы.СверятьСДаннымиОФД = ВыборкаКасс.СверятьДанныеССервисомОФД;
		Если ОписаниеПоследнейКассовойСмены = Неопределено Тогда
			СтрокаКассы.КассоваяСмена = Неопределено;
			СтрокаКассы.НачалоКассовойСмены = Неопределено;
			СтрокаКассы.ДатаИстеченияСрокаДействия = Неопределено;
			СтрокаКассы.Открыта = Ложь
		Иначе
			СтрокаКассы.КассоваяСмена = ОписаниеПоследнейКассовойСмены.КассоваяСмена;
			СтрокаКассы.ДатаИстеченияСрокаДействия = ОписаниеПоследнейКассовойСмены.ДатаИстеченияСрокаДействия;
			Если МенеджерОборудованияРМК.КассоваяСменаОткрыта(ОписаниеПоследнейКассовойСмены.Статус) Тогда
				СтрокаКассы.Открыта = Истина;
				СтрокаКассы.НачалоКассовойСмены = ОписаниеПоследнейКассовойСмены.НачалоКассовойСмены;
			Иначе
				СтрокаКассы.Открыта = Ложь;
				СтрокаКассы.НачалоКассовойСмены = Неопределено;
			КонецЕсли;
		КонецЕсли;
		РассчитатьВычисляемыеЗначенияВСтрокеКассы(СтрокаКассы, ТекущаяДатаСеанса(),
			ЭтотОбъект, ОписаниеПоследнейКассовойСмены);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаличныеВКассеККМ(СтрокаКассыККМ)
	
	ДенежныеСредстваВКассеККМ = ОбщегоНазначенияРМК.ПолучитьНаличныеДенежныеСредстваВКассеККМ(СтрокаКассыККМ.Организация,
		СтрокаКассыККМ.КассаККМ);
	СтрокаКассыККМ.ДенежныеСредстваВКассеККМ = ДенежныеСредстваВКассеККМ;
		
	ПараметрыВыемкиПриЗакрытииСмены
		= ОбщегоНазначенияРМК.ПолучитьПараметрыВыемкиПриЗакрытииСмены(СтрокаКассыККМ.Организация, СтрокаКассыККМ.КассаККМ);
	СтрокаКассыККМ.ТребуетсяВыемкаПриЗакрытииСмены = ПараметрыВыемкиПриЗакрытииСмены.ТребуетсяВыемкаПриЗакрытииСмены;
	СтрокаКассыККМ.МинимальныйОстатокНаличныхВКассе = ПараметрыВыемкиПриЗакрытииСмены.МинимальныйОстатокНаличныхВКассе;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнесениеКлиент()
	
	Если НомерТекущегоЭлемента <= ТаблицаКассККМОрганизаций.Количество() Тогда
		СтрокаКассы = ТаблицаКассККМОрганизаций[НомерТекущегоЭлемента - 1];
		Если СтрокаКассы.Открыта Тогда
			
			Если ОбщегоНазначенияРМККлиент.ИспользоватьСтандартныйИнтерфейсВнесения() Тогда
				ОткрытьФормуВнесения(СтрокаКассы);
			Иначе
				ПараметрыВнесения = ИнтерфейсРМКСлужебныйКлиент.ШаблонПараметровВнесенияВыемки(Истина);
				ЗаполнитьПараметрыОперацииВнесения(ПараметрыВнесения, СтрокаКассы);
				ОбщегоНазначенияРМККлиентПереопределяемый.ВыполнитьОперациюВнесение(ПараметрыВнесения);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыемкаКлиент()
	
	Если НомерТекущегоЭлемента <= ТаблицаКассККМОрганизаций.Количество() Тогда
		СтрокаКассы = ТаблицаКассККМОрганизаций[НомерТекущегоЭлемента - 1];
		Если СтрокаКассы.Открыта Тогда
			
			ОткрытьФормуВыемки(СтрокаКассы, 0);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтчетБезГашенияКлиент()
	
	Если НомерТекущегоЭлемента <= ТаблицаКассККМОрганизаций.Количество() Тогда
		СтрокаКассы = ТаблицаКассККМОрганизаций[НомерТекущегоЭлемента - 1];
		
		ДополнительныеПараметры = Новый Структура("СтрокаКассы", СтрокаКассы);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СнятиеОтчетаБезГашенияЗавершение",
			ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru='Уверены, что хотите снять отчет без гашения (X - отчет)?'");
		ЗаголовокВопроса = НСтр("ru='Отчет без гашения'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиСнятиеОтчетаБезГашения(СтрокаКассы)
	
	ОповещениеОФормированияОтчетаБезГашения = Новый ОписаниеОповещения("ЗавершитьФормированиеОтчетаБезГашения",
		ЭтотОбъект);
	
	ПараметрыОперации = МенеджерОборудованияРМККлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	ДополнительныеПараметрыДляПечати = ИнтерфейсРМКСлужебныйКлиент.ДополнительныеПараметрыОткрытияЗакрытияСмены();
	ДополнительныеПараметрыДляПечати.Пользователь = ПользовательБД;
	ДополнительныеПараметрыДляПечати.Кассир = Кассир;
	ДополнительныеПараметрыДляПечати.КассаККМ = СтрокаКассы.КассаККМ;
	ДополнительныеПараметрыДляПечати.ВариантЗаполненияМестаРасчетов = ВариантЗаполненияМестаРасчетов;
	
	ЗаполнитьПараметрыОткрытияЗакрытияСмены(ПараметрыОперации, ДополнительныеПараметрыДляПечати);
	
	Доступность = Ложь;
	МенеджерОборудованияРМККлиент.НачатьФормированиеОтчетаБезГашения(
		ОповещениеОФормированияОтчетаБезГашения,
		Неопределено,
		СтрокаКассы.ИдентификаторУстройства,
		ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыОперацииВнесения(ПараметрыОперации, СтрокаКассыККМ)
	
	ПараметрыОперации.КассаККМ = СтрокаКассыККМ.КассаККМ;
	ПараметрыОперации.Кассир = Кассир;
	ПараметрыОперации.ПользовательБД = ПользовательБД;
	ПараметрыОперации.ПодключаемоеОборудование = СтрокаКассыККМ.ИдентификаторУстройства;
	ПараметрыОперации.Организация = СтрокаКассыККМ.Организация;
	ПараметрыОперации.СписокРолейПользователя = СписокРолейПользователя;
	ПараметрыОперации.УникальныйИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыОперации.ТаблицаКассККМОрганизаций = ТаблицаКассККМОрганизаций;
	ПараметрыОперации.ФормаИсточник = ЭтотОбъект;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗакрытьСменуВКассе()
	
	Если НомерТекущегоЭлемента <= ТаблицаКассККМОрганизаций.Количество() Тогда
		СтрокаКассы = ТаблицаКассККМОрганизаций[НомерТекущегоЭлемента - 1];
		Если СтрокаКассы.Открыта Тогда
			ЗакрытьСмену(СтрокаКассы);
		Иначе
			ОткрытьСмену(СтрокаКассы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСмену(СтрокаКассы)
	
	СохранятьПодключение = Неопределено;
	ИспользоватьКассуККМБезПодключенияОборудования = Истина;
	Если Не СтрокаКассы.ИспользоватьБезПодключенияОборудования Тогда 
		СохранятьПодключение = Истина;
		ИспользоватьКассуККМБезПодключенияОборудования = Ложь;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("КассаККМ", СтрокаКассы.КассаККМ);
	ДополнительныеПараметры.Вставить("Магазин", ТорговыйОбъект);
	ДополнительныеПараметры.Вставить("Организация", СтрокаКассы.Организация);
	ДополнительныеПараметры.Вставить("ОставитьПодключенным", СохранятьПодключение);
	ПараметрыОперации = МенеджерОборудованияРМККлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	
	Если ИспользоватьПодключаемоеОборудование
		И НЕ ИспользоватьКассуККМБезПодключенияОборудования
		И ЗначениеЗаполнено(СтрокаКассы.ИдентификаторУстройства) Тогда
		
		ДополнительныеПараметрыДляПечати = ИнтерфейсРМКСлужебныйКлиент.ДополнительныеПараметрыОткрытияЗакрытияСмены();
		ДополнительныеПараметрыДляПечати.Пользователь = ПользовательБД;
		ДополнительныеПараметрыДляПечати.Кассир = Кассир;
		ДополнительныеПараметрыДляПечати.КассаККМ = СтрокаКассы.КассаККМ;
		ДополнительныеПараметрыДляПечати.ВариантЗаполненияМестаРасчетов = ВариантЗаполненияМестаРасчетов;
		
		ЗаполнитьПараметрыОткрытияЗакрытияСмены(ПараметрыОперации, ДополнительныеПараметрыДляПечати);
		
		Если ПодключенаОблачнаяККТ Тогда
			ПараметрыОперации.ОблачнаяККТ = Истина;
			ДополнительныеПараметры.ОставитьПодключенным = Ложь;
		КонецЕсли;
		
	ИначеЕсли ИспользоватьКассуККМБезПодключенияОборудования Тогда
		ПараметрыОперации.КассаККМ = СтрокаКассы.КассаККМ;
		ПараметрыОперации.АвтономнаяККТ = Истина;
	КонецЕсли;
	
	Контекст = Новый Структура("КассаККМ", СтрокаКассы.КассаККМ);
	Оповещение = Новый ОписаниеОповещения("ОткрытьСменуЗавершение", ЭтотОбъект, Контекст);
	
	ИмяКонтейнера = СтрШаблон("ОбластьКарточки%1", НомерТекущегоЭлемента);
	ИмяСтраницы = СтрШаблон("СтраницаОжидания%1", НомерТекущегоЭлемента);
	Элементы[ИмяКонтейнера].ТекущаяСтраница = Элементы[ИмяСтраницы];
	
	МенеджерОборудованияРМККлиент.НачатьОткрытиеСменыНаФискальномУстройстве(Оповещение, Неопределено,
		СтрокаКассы.ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСмену(СтрокаКассы)
	
	ДополнительныеПараметры = Новый Структура("СтрокаКассы", СтрокаКассы);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьСменуПродолжение", ЭтотОбъект, ДополнительныеПараметры);
	Если СтрокаКассы.КоличествоОтложенныхИНепробитыхЧеков <> 0 Тогда
		
		ТекстЗаголовка = НСтр("ru = 'Проверка непробитых чеков.'");
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Имеются непробитые и отложенные чеки в количестве: %1.
											|Закрыть смену?'"), СтрокаКассы.КоличествоОтложенныхИНепробитыхЧеков);
		КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Закрыть");
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Отменить");
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок, , КнопкаПоУмолчанию, ТекстЗаголовка);
		
	Иначе
		
		ТекстВопроса = НСтр("ru='Уверены, что хотите закрыть смену?'");
		ЗаголовокВопроса = НСтр("ru='Закрытие смены'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТиповыеГорячиеКлавиши()
	
	СочетаниеКлавишВверх = ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,{0,38,0}}");
	Если НЕ СочетаниеКлавишВверх = Неопределено Тогда
		Команды.ГорячаяКлавишаВверх.СочетаниеКлавиш = СочетаниеКлавишВверх;
	КонецЕсли;
	
	СочетаниеКлавишиВниз = ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,{0,40,0}}");
	Если Не СочетаниеКлавишиВниз = Неопределено Тогда
		Команды.ГорячаяКлавишаВниз.СочетаниеКлавиш = СочетаниеКлавишиВниз;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИменаКнопокГорячихКлавиш()
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("УправлениеСменами", "ЗакрытьСмену");
	РезультатФункции.Вставить("Продолжение", "ВыходИзРежимаВыбораКассы");
	РезультатФункции.Вставить("ОткрытьВсеСмены", "ОткрытьВсеСмены");
	РезультатФункции.Вставить("Внесение", "Внесение");
	РезультатФункции.Вставить("Выемка", "Выемка");
	РезультатФункции.Вставить("СнятьОтчетБезГашения", "СнятьОтчетБезГашения");
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура НастроитьГорячиеКлавиши()
	
	ИменаКнопок = ИменаКнопокГорячихКлавиш();
	
	МассивИменКнопок = Новый Массив;
	МассивИменКнопок.Добавить(ИменаКнопок.УправлениеСменами);
	МассивИменКнопок.Добавить(ИменаКнопок.Продолжение);
	МассивИменКнопок.Добавить(ИменаКнопок.ОткрытьВсеСмены);
	МассивИменКнопок.Добавить(ИменаКнопок.Внесение);
	МассивИменКнопок.Добавить(ИменаКнопок.Выемка);
	МассивИменКнопок.Добавить(ИменаКнопок.СнятьОтчетБезГашения);
	
	ЗапросГорячихКлавиш = Новый Запрос;
	ЗапросГорячихКлавиш.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.ИмяКнопки КАК ИмяКнопки,
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.Клавиша КАК Клавиша,
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.АкселераторAlt КАК АкселераторAlt,
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.АкселераторCtrl КАК АкселераторCtrl,
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.АкселераторShift КАК АкселераторShift
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.ГорячиеКлавиши КАК НастройкиРабочегоМестаКассираГорячиеКлавиши
	|ГДЕ
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.Ссылка = &НастройкаРМК
	|	И НастройкиРабочегоМестаКассираГорячиеКлавиши.ИмяКнопки В(&ИменаКнопок)";
	ЗапросГорячихКлавиш.УстановитьПараметр("НастройкаРМК", НастройкаРМК);
	ЗапросГорячихКлавиш.УстановитьПараметр("ИменаКнопок", МассивИменКнопок);
	
	РезультатЗапроса = ЗапросГорячихКлавиш.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаГорячихКлавиш = РезультатЗапроса.Выбрать();
		Пока ВыборкаГорячихКлавиш.Следующий() Цикл
			УстановитьКомбинациюГорячихКлавишКоманде(ВыборкаГорячихКлавиш);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКомбинациюГорячихКлавишКоманде(СтрокаКомбинации)
	
	ИменаКнопок = ИменаКнопокГорячихКлавиш();
	
	ТекущаяКоманда = Неопределено;
	Если СтрокаКомбинации.ИмяКнопки = ИменаКнопок.УправлениеСменами Тогда
		ТекущаяКоманда = Команды.ОткрытьЗакрытьСмену;
	ИначеЕсли СтрокаКомбинации.ИмяКнопки = ИменаКнопок.Продолжение Тогда
		ТекущаяКоманда = Команды.Вернуться;
	ИначеЕсли СтрокаКомбинации.ИмяКнопки = ИменаКнопок.ОткрытьВсеСмены Тогда
		ТекущаяКоманда = Команды.ОткрытьВсеСмены;
	ИначеЕсли СтрокаКомбинации.ИмяКнопки = ИменаКнопок.Внесение Тогда
		ТекущаяКоманда = Команды.ВыполнитьВнесение;
	ИначеЕсли СтрокаКомбинации.ИмяКнопки = ИменаКнопок.Выемка Тогда
		ТекущаяКоманда = Команды.ВыполнитьВыемку;
	ИначеЕсли СтрокаКомбинации.ИмяКнопки = ИменаКнопок.СнятьОтчетБезГашения Тогда
		ТекущаяКоманда = Команды.СнятьОтчетБезГашения;
	КонецЕсли;
	
	Если Не (СтрокаКомбинации.Клавиша = "" Или СтрокаКомбинации.Клавиша = "Нет" Или ТекущаяКоманда = Неопределено) Тогда
		
		СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша[СтрокаКомбинации.Клавиша],
			СтрокаКомбинации.АкселераторAlt,
			СтрокаКомбинации.АкселераторCtrl,
			СтрокаКомбинации.АкселераторShift);
			
		ТекущаяКоманда.СочетаниеКлавиш = СочетаниеКлавиш;
		
		Если СтрокаКомбинации.ИмяКнопки = ИменаКнопок.Продолжение И Не РежимКассыСамообслуживания Тогда
			ДобавитьВЗаголовокТекстГорячихКлавиш(Элементы.Вернуться, СочетаниеКлавиш);
		ИначеЕсли СтрокаКомбинации.ИмяКнопки = ИменаКнопок.ОткрытьВсеСмены И Не РежимКассыСамообслуживания Тогда
			ДобавитьВЗаголовокТекстГорячихКлавиш(Элементы.ОткрытьВсеСмены, СочетаниеКлавиш);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВЗаголовокТекстГорячихКлавиш(ЭлементФормы, СочетаниеКлавиш)
	
	ЭлементФормы.Заголовок = СтрШаблон("%1 (%2)", ЭлементФормы.Заголовок,
		ИнтерфейсРМКСлужебный.ВернутьТекстСочетанияКлавиш(СочетаниеКлавиш));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущимЭлементомГруппуСтроки(НомерЭлемента, Старт = Ложь)
	
	НомерПредЭлемента = НомерТекущегоЭлемента;
	Если НомерПредЭлемента = 0 Тогда
		НомерПредЭлемента = 1;
	КонецЕсли;
	ИмяГруппы = СтрШаблон("КарточкаКассы%1", НомерПредЭлемента);
	Если Не РежимВыбора Тогда
		ИмяКнопки = СтрШаблон("ИзменитьСтатусСмены%1", НомерПредЭлемента);
		ТекущийЭлемент = Элементы[ИмяКнопки];
	КонецЕсли;
	Элементы[ИмяГруппы].ЦветФона = ЦветФонаКарточки;
	
	НомерТекущегоЭлемента = НомерЭлемента;
	ИмяГруппы = СтрШаблон("КарточкаКассы%1", НомерЭлемента);
	ИмяСтатуса = СтрШаблон("ДекорацияСтатус%1", НомерЭлемента);
	Если ТаблицаКассККМОрганизаций.Количество() > 1 Тогда
		Элементы[ИмяГруппы].ЦветФона = ЦветФонаВыбраннойКарточки;
	КонецЕсли;
	ТекущийЭлемент = Элементы[ИмяСтатуса];
	Если Не РежимВыбора Тогда
		ИмяКнопки = СтрШаблон("ИзменитьСтатусСмены%1", НомерЭлемента);
		ТекущийЭлемент = Элементы[ИмяКнопки];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьГруппуОжидания(НомерЭлемента, СтраницаОжидания)
	
	ИмяЭлемента = СтрШаблон("ГруппаОжидания%1", НомерЭлемента);
	ГруппаОжидания = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницаОжидания);
	ГруппаОжидания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОжидания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаОжидания.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОжидания.ОтображатьЗаголовок = Ложь;
	ГруппаОжидания.РастягиватьПоВертикали = Истина;
	ГруппаОжидания.РастягиватьПоГоризонтали = Истина;
	ГруппаОжидания.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	ГруппаОжидания.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	
	ИмяЭлемента = СтрШаблон("ДекорацияОжидание%1", НомерЭлемента);
	ДекорацияОжидание = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаОжидания);
	ДекорацияОжидание.Вид = ВидДекорацииФормы.Картинка;
	ДекорацияОжидание.Картинка = БиблиотекаКартинок.ДлительнаяОперацияРМК48;
	ДекорацияОжидание.Заголовок = "";
	ДекорацияОжидание.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	ДекорацияОжидание.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	
	ИмяЭлемента = СтрШаблон("ДекорацияОжиданиеТекст%1", НомерЭлемента);
	ДекорацияОжиданиеТекст = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаОжидания);
	ДекорацияОжиданиеТекст.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияОжиданиеТекст.Заголовок = НСтр("ru = 'Пожалуйста, подождите...'");
	ДекорацияОжиданиеТекст.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКарточкиКассККМ()
	
	Интерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЦветСтатуса = ?(Интерфейс85, ЦветаПалитры.Серый, WebЦвета.ТемноСерый);
	ЦветФонаКарточки = ?(Интерфейс85, Новый Цвет(), ЦветаПалитры.СветлоБежевыйРМК);
	ЦветФонаВыбраннойКарточки = ЦветаПалитры.БежевыйРМК;
	ЦветФонаАктуальнойСмены = ?(Интерфейс85, ЦветаПалитры.Зеленый, ЦветаПалитры.ЗеленыйСветлоТусклыйРМК);
	ЦветФонаЗакрытойСмены = ?(Интерфейс85, ЦветаПалитры.Красный, ЦветаПалитры.КрасныйСветлоТусклыйРМК);
	Если Не Интерфейс85 Тогда
		Элементы.КонтейнерКарточекКассы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Полуторный;
	КонецЕсли;
	ТипБезРамки = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	ШрифтКартинкиСтатуса = Новый Шрифт(ШрифтыСтиля.ТекстТретьегоУровня,,,,,,,70);
	
	Для Каждого СтрокаКассы Из ТаблицаКассККМОрганизаций Цикл
		
		ИндексЭлемента = ТаблицаКассККМОрганизаций.Индекс(СтрокаКассы);
		НомерЭлемента = ИндексЭлемента + 1;
		АктуальнаяСмена = СменаКассыАктуальна(СтрокаКассы);
		
		ИмяЭлемента = СтрШаблон("ОбластьКарточки%1", НомерЭлемента);
		ОбластьКарточки = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Элементы.КонтейнерКарточекКассы);
		ОбластьКарточки.Вид = ВидГруппыФормы.Страницы;
		ОбластьКарточки.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		ОбластьКарточки.РастягиватьПоГоризонтали = Истина;
		ОбластьКарточки.РастягиватьПоВертикали = Ложь;
	
		ИмяЭлемента = СтрШаблон("СтраницаКарточка%1", НомерЭлемента);
		СтраницаКарточка = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ОбластьКарточки);
		СтраницаКарточка.Вид = ВидГруппыФормы.Страница;
		СтраницаКарточка.ОтображатьЗаголовок = Ложь;
		
		ИмяЭлемента = СтрШаблон("СтраницаОжидания%1", НомерЭлемента);
		СтраницаОжидания = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ОбластьКарточки);
		СтраницаОжидания.Вид = ВидГруппыФормы.Страница;
		СтраницаОжидания.ОтображатьЗаголовок = Ложь;
		
		СформироватьГруппуОжидания(НомерЭлемента, СтраницаОжидания);
		
		ИмяЭлемента = СтрШаблон("КарточкаКассы%1", НомерЭлемента);
		ПлиткаКарточка = ИнтерфейсРМКСлужебный.ДобавитьГруппуКарточку(Элементы, СтраницаКарточка, ИмяЭлемента,
			"ГруппаКарточкаНажатие");
		ПлиткаКарточка.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
		ПлиткаКарточка.ЦветФона = ЦветФонаКарточки;
		
		ИмяЭлемента = СтрШаблон("ГруппаСтатус%1", НомерЭлемента);
		ГруппаСтатус = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ПлиткаКарточка);
		ГруппаСтатус.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСтатус.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаСтатус.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСтатус.ОтображатьЗаголовок = Ложь;
		ГруппаСтатус.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ГруппаСтатус.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		
		ИмяЭлемента = СтрШаблон("КарточкаДекорацииСтатуса%1", НомерЭлемента);
		КарточкаДекорации = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаСтатус);
		КарточкаДекорации.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		КарточкаДекорации.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		КарточкаДекорации.Отображение = ОтображениеОбычнойГруппы.Нет;
		КарточкаДекорации.ОтображатьЗаголовок = Ложь;
		КарточкаДекорации.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		
		ИмяЭлемента = СтрШаблон("ДекорацияСтатус%1", НомерЭлемента);
		ДекорацияСтатус = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), КарточкаДекорации);
		ДекорацияСтатус.Вид = ВидДекорацииФормы.Картинка;
		ДекорацияСтатус.Рамка = ТипБезРамки;
		ДекорацияСтатус.Шрифт = ШрифтКартинкиСтатуса;
		ДекорацияСтатус.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		ДекорацияСтатус.ОтображениеФона = ОтображениеФонаКартинки.НеОтображать;
		
		Если СтрокаКассы.НастроенТСПИоТ Тогда
			ИмяЭлемента = СтрШаблон("ДекорацияСтатусТСПИоТ%1", НомерЭлемента);
			ДекорацияСтатусТСПИоТ = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), КарточкаДекорации);
			ДекорацияСтатусТСПИоТ.Вид = ВидДекорацииФормы.Картинка;
			ДекорацияСтатусТСПИоТ.Рамка = ТипБезРамки;
			ДекорацияСтатусТСПИоТ.Шрифт = ШрифтКартинкиСтатуса;
			ДекорацияСтатусТСПИоТ.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
			ДекорацияСтатусТСПИоТ.ОтображениеФона = ОтображениеФонаКартинки.НеОтображать;
		Иначе
			ДекорацияСтатусТСПИоТ = Неопределено;
		КонецЕсли;
		
		ИмяЭлемента = СтрШаблон("ГруппаОписаниеСтатуса%1", НомерЭлемента);
		ГруппаОписаниеСтатуса = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаСтатус);
		ГруппаОписаниеСтатуса.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаОписаниеСтатуса.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаОписаниеСтатуса.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаОписаниеСтатуса.ОтображатьЗаголовок = Ложь;
		ГруппаОписаниеСтатуса.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ГруппаОписаниеСтатуса.РастягиватьПоВертикали = Ложь;
		
		ИмяЭлемента = СтрШаблон("ПолеСтатусПодробно%1", НомерЭлемента);
		ПолеСтатусПодробно = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаОписаниеСтатуса);
		ПолеСтатусПодробно.Вид = ВидПоляФормы.ПолеНадписи;
		ПолеСтатусПодробно.ПутьКДанным = СтрШаблон("ТаблицаКассККМОрганизаций[%1].СтатусПодробно", ИндексЭлемента);
		ПолеСтатусПодробно.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеСтатусПодробно.ЦветТекста = ЦветСтатуса;
		
		ИмяЭлемента = СтрШаблон("ПолеСтатусКратко%1", НомерЭлемента);
		ПолеСтатусКратко = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаОписаниеСтатуса);
		ПолеСтатусКратко.Вид = ВидПоляФормы.ПолеНадписи;
		ПолеСтатусКратко.ПутьКДанным = СтрШаблон("ТаблицаКассККМОрганизаций[%1].СтатусКратко", ИндексЭлемента);
		ПолеСтатусКратко.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		ИмяЭлемента = СтрШаблон("ПолеОрганизация%1", НомерЭлемента);
		ПолеОрганизация = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ПлиткаКарточка);
		ПолеОрганизация.Вид = ВидПоляФормы.ПолеНадписи;
		ПолеОрганизация.ПутьКДанным = СтрШаблон("ТаблицаКассККМОрганизаций[%1].Организация", ИндексЭлемента);
		ПолеОрганизация.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеОрганизация.Шрифт = Новый Шрифт(ШрифтыСтиля.ТекстВторогоУровня, , , Истина);
		
		Если ИспользоватьОплатуНаличными И ПравоПросмотраОстаткаНаличныхРМК Тогда
			ИмяЭлемента = СтрШаблон("ГруппаНаличные%1", НомерЭлемента);
			ГруппаНаличные = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ПлиткаКарточка);
			ГруппаНаличные.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаНаличные.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаНаличные.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаНаличные.ОтображатьЗаголовок = Ложь;
			ГруппаНаличные.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
			
			ИмяЭлемента = СтрШаблон("ЗаголовокНаличные%1", НомерЭлемента);
			ЗаголовокНаличные = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаНаличные);
			ЗаголовокНаличные.Вид = ВидДекорацииФормы.Надпись;
			ЗаголовокНаличные.Заголовок = НСтр("ru = 'Наличные:'");
			ЗаголовокНаличные.Рамка = ТипБезРамки;
			
			ИмяЭлемента = СтрШаблон("ПолеНаличные%1", НомерЭлемента);
			ПолеНаличные = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаНаличные);
			ПолеНаличные.Вид = ВидПоляФормы.ПолеНадписи;
			ПолеНаличные.ТолькоПросмотр = Истина;
			ПолеНаличные.ПутьКДанным = СтрШаблон("ТаблицаКассККМОрганизаций[%1].НаличныеПредставление", ИндексЭлемента);
			ПолеНаличные.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		КонецЕсли;
		
		НаборКнопок = Неопределено;
		Если Не РежимВыбора Тогда
			СформироватьКоманднуюПанельКарточки(НомерЭлемента, ПлиткаКарточка, НаборКнопок);
		КонецЕсли;
		НастроитьОформлениеКарточкиКассы(СтрокаКассы, КарточкаДекорации, ДекорацияСтатус, ДекорацияСтатусТСПИоТ, НаборКнопок);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКоманднуюПанельКарточки(НомерЭлемента, ПлиткаКарточка, НаборКнопок)
	
	Интерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	
	ИмяЭлемента = СтрШаблон("ГруппаКомандКарточки%1", НомерЭлемента);
	ГруппаКомандКарточки = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ПлиткаКарточка);
	ГруппаКомандКарточки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомандКарточки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаКомандКарточки.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКомандКарточки.ОтображатьЗаголовок = Ложь;
	
	ГруппаКомандКарточки.РастягиватьПоВертикали = Ложь;
	Если Не Интерфейс85 Тогда
		ГруппаКомандКарточки.Высота = 3;
	КонецЕсли;
	
	ГруппаИзменитьСтатус = ДобавитьГруппуКоманды("ГруппаИзменитьСтатус", НомерЭлемента, ГруппаКомандКарточки);
	
	ИмяКнопки = СтрШаблон("ИзменитьСтатусСмены%1", НомерЭлемента);
	НоваяКоманда = Команды.Добавить(ИмяКнопки);
	НоваяКоманда.Действие = "ИзменитьСтатусСмены";
	КнопкаОперации = ДобавитьКнопкуВКарточке(ИмяКнопки, ГруппаИзменитьСтатус);
	
	Если ИспользоватьОплатуНаличными И Не ПодключенаОблачнаяККТ Тогда
		
		ГруппаВнесение = ДобавитьГруппуКоманды("ГруппаВнесение", НомерЭлемента, ГруппаКомандКарточки);
		
		ИмяКнопки = СтрШаблон("Внесение%1", НомерЭлемента);
		НоваяКоманда = Команды.Добавить(ИмяКнопки);
		НоваяКоманда.Действие = "ВыполнитьВнесениеИзКарточки";
		КнопкаВнесение = ДобавитьКнопкуВКарточке(ИмяКнопки, ГруппаВнесение);
		
		ГруппаВыемка = ДобавитьГруппуКоманды("ГруппаВыемка", НомерЭлемента, ГруппаКомандКарточки);
		
		ИмяКнопки = СтрШаблон("Выемка%1", НомерЭлемента);
		НоваяКоманда = Команды.Добавить(ИмяКнопки);
		НоваяКоманда.Действие = "ВыполнитьВыемкуИзКарточки";
		КнопкаВыемка = ДобавитьКнопкуВКарточке(ИмяКнопки, ГруппаВыемка);
		
		Если (Не Интерфейс85) И Масштаб >= 100 Тогда
			КнопкаВнесение.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;
			КнопкаВыемка.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;
		КонецЕсли;
		
	КонецЕсли;
	
	Если (Не Интерфейс85) И Масштаб >= 100 Тогда
		КнопкаОперации.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;
	КонецЕсли;
	
	ЗаголовокВнесение = НСтр("ru = 'Внесение'");
	ЗаголовокВыемка = НСтр("ru = 'Выемка'");
	ЗаголовокОтчет = НСтр("ru = 'X-отчет'");
	Если ИспользоватьПодключаемоеОборудование Или ИспользоватьОплатуНаличными Тогда
		
		Если Не РежимКассыСамообслуживания Тогда
			ДобавитьВЗаголовкиГорячиеКлавиши(ЗаголовокВнесение, ЗаголовокВыемка, ЗаголовокОтчет);
		КонецЕсли;
		Если ИспользоватьОплатуНаличными Тогда
			КнопкаВнесение.Заголовок = ЗаголовокВнесение;
			КнопкаВыемка.Заголовок = ЗаголовокВыемка;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИспользоватьПодключаемоеОборудование И Не ПодключенаОблачнаяККТ Тогда
		
		ГруппаОтчетБезГашения = ДобавитьГруппуКоманды("ГруппаОтчетБезГашения", НомерЭлемента, ГруппаКомандКарточки);
		
		ИмяКнопки = СтрШаблон("ОтчетБезГашения%1", НомерЭлемента);
		НоваяКоманда = Команды.Добавить(ИмяКнопки);
		НоваяКоманда.Действие = "СнятьОтчетБезГашенияИзКарточки";
		КнопкаОтчет = ДобавитьКнопкуВКарточке(ИмяКнопки, ГруппаОтчетБезГашения);
		Если (Не Интерфейс85) И Масштаб >= 100 Тогда
			КнопкаОтчет.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;
		КонецЕсли;
		КнопкаОтчет.Заголовок = ЗаголовокОтчет;
	
	КонецЕсли;
	
	Если ТаблицаКассККМОрганизаций[НомерЭлемента - 1].НастроенТСПИоТ И Не ТаблицаКассККМОрганизаций[НомерЭлемента - 1].ВнешнийТСПИоТ Тогда
		
		ГруппаТСПИоТ = ДобавитьГруппуКоманды("ГруппаТСПИоТ", НомерЭлемента, ГруппаКомандКарточки);
		
		ИмяКнопки = СтрШаблон("ОбновитьСтатусТСПИоТ%1", НомерЭлемента);
		НоваяКоманда = Команды.Добавить(ИмяКнопки);
		НоваяКоманда.Действие = "ОбновитьСтатусТСПИоТИзКарточки";
		КнопкаТСПИоТ = ДобавитьКнопкуВКарточке(ИмяКнопки, ГруппаТСПИоТ);
		Если (Не Интерфейс85) И Масштаб >= 100 Тогда
			КнопкаТСПИоТ.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;
		КонецЕсли;
		
	КонецЕсли;
	
	НаборКнопок = Новый Структура;
	НаборКнопок.Вставить("КнопкаВнесение", Неопределено);
	НаборКнопок.Вставить("КнопкаВыемка", Неопределено);
	НаборКнопок.Вставить("КнопкаОперации", КнопкаОперации);
	Если ИспользоватьОплатуНаличными И Не ПодключенаОблачнаяККТ Тогда
		НаборКнопок.Вставить("КнопкаВнесение", КнопкаВнесение);
		НаборКнопок.Вставить("КнопкаВыемка", КнопкаВыемка);
	КонецЕсли;
	Если ТаблицаКассККМОрганизаций[НомерЭлемента - 1].НастроенТСПИоТ И Не ТаблицаКассККМОрганизаций[НомерЭлемента - 1].ВнешнийТСПИоТ Тогда
		НаборКнопок.Вставить("КнопкаТСПИоТ", КнопкаТСПИоТ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВЗаголовкиГорячиеКлавиши(ЗаголовокВнесение, ЗаголовокВыемка, ЗаголовокОтчет)
	
	ТекстСочетанияВнесение
		= ИнтерфейсРМКСлужебный.ВернутьТекстСочетанияКлавиш(Команды.ВыполнитьВнесение.СочетаниеКлавиш);
	ТекстСочетанияВыемка = ИнтерфейсРМКСлужебный.ВернутьТекстСочетанияКлавиш(Команды.ВыполнитьВыемку.СочетаниеКлавиш);
	ТекстСочетанияОтчет
		= ИнтерфейсРМКСлужебный.ВернутьТекстСочетанияКлавиш(Команды.СнятьОтчетБезГашения.СочетаниеКлавиш);
	Если Не ТекстСочетанияВнесение = "" Тогда
		ЗаголовокВнесение = СтрШаблон("%1 (%2)", ЗаголовокВнесение, ТекстСочетанияВнесение);
	КонецЕсли;
	Если Не ТекстСочетанияВыемка = "" Тогда
		ЗаголовокВыемка = СтрШаблон("%1 (%2)", ЗаголовокВыемка, ТекстСочетанияВыемка);
	КонецЕсли;
	Если Не ТекстСочетанияОтчет = "" Тогда
		ЗаголовокОтчет = СтрШаблон("%1 (%2)", ЗаголовокОтчет, ТекстСочетанияОтчет);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьГруппуКоманды(ОсновнаяЧастьИмени, НомерЭлемента, ГруппаРодитель)
	
	ИмяЭлемента = СтрШаблон("%1%2", ОсновнаяЧастьИмени, НомерЭлемента);
	ГруппаКоманды = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаРодитель);
	ГруппаКоманды.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКоманды.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаКоманды.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКоманды.ОтображатьЗаголовок = Ложь;
	//ГруппаКоманды.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		ГруппаКоманды.Высота = 3;
	КонецЕсли;
	
	Возврат ГруппаКоманды;
	
КонецФункции

&НаСервере
Функция ДобавитьКнопкуВКарточке(ИмяКнопки, ГруппаРодитель)
	
	КнопкаКарточки = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаРодитель);
	КнопкаКарточки.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаКарточки.ИмяКоманды = ИмяКнопки;
	КнопкаКарточки.Отображение = ОтображениеКнопки.Текст;
	КнопкаКарточки.РастягиватьПоВертикали = Истина;
	Если СтрНайти(ИмяКнопки, "ОбновитьСтатусТСПИоТ") <> 0 Тогда
		
		КнопкаКарточки.Картинка = БиблиотекаКартинок.РМКОбновитьНовая;
		КнопкаКарточки.Отображение = ОтображениеКнопки.КартинкаИТекст;
		
	КонецЕсли;
	
	Возврат КнопкаКарточки;
	
КонецФункции

&НаСервере
Функция СменаКассыАктуальна(СтрокаКассы)
	
	Возврат (СтрокаКассы.Открыта И СтрокаКассы.НачалоКассовойСмены >= МинимальноеДатаНачалаСмены
		И Не СтрокаКассы.Истекла);
	
КонецФункции

&НаСервере
Процедура НастроитьОформлениеКарточкиКассы(СтрокаКассы, КарточкаДекорации, ДекорацияСтатус, ДекорацияСтатусТСПИоТ, НаборКнопок)
	
	АктуальнаяСмена = СменаКассыАктуальна(СтрокаКассы);
	КарточкаДекорации.ЦветФона = ?(АктуальнаяСмена, ЦветФонаАктуальнойСмены, ЦветФонаЗакрытойСмены);
	ДекорацияСтатус.Картинка = ?(АктуальнаяСмена, БиблиотекаКартинок.РМКЗеленыйКруг, БиблиотекаКартинок.РМККрасныйКруг);
	
	Если СтрокаКассы.НастроенТСПИоТ Тогда
		ДекорацияСтатусТСПИоТ.Картинка = ?(СтрокаКассы.ГотовКРаботеТСПИоТ, БиблиотекаКартинок.РМКУспешноеСканирование, БиблиотекаКартинок.РМКОшибкаСканирования);
	КонецЕсли;
	
	Если Не НаборКнопок = Неопределено Тогда
		КнопкаОперации = НаборКнопок.КнопкаОперации;
		ЗаголовокКнопки = ?(СтрокаКассы.Открыта, НСтр("ru = 'Закрыть смену'"), НСтр("ru = 'Открыть смену'"));
		ТекстСочетания = ИнтерфейсРМКСлужебный.ВернутьТекстСочетанияКлавиш(Команды.ОткрытьЗакрытьСмену.СочетаниеКлавиш);
		Если Не (ТекстСочетания = "" Или РежимКассыСамообслуживания) Тогда
			ЗаголовокКнопки = СтрШаблон("%1 (%2)", ЗаголовокКнопки, ТекстСочетания);
		КонецЕсли;
		КнопкаОперации.Заголовок = ЗаголовокКнопки;
		
		Если ИспользоватьОплатуНаличными Тогда
			НаборКнопок.КнопкаВнесение.Доступность = СтрокаКассы.Открыта;
			НаборКнопок.КнопкаВыемка.Доступность = СтрокаКассы.Открыта;
		КонецЕсли;
		
		Если СтрокаКассы.НастроенТСПИоТ И Не СтрокаКассы.ВнешнийТСПИоТ Тогда
			
			НаборКнопок.КнопкаТСПИоТ.Доступность = СтрокаКассы.Открыта;
			НаборКнопок.КнопкаТСПИоТ.Заголовок = НСтр("ru = 'ТС ПИоТ'");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВходнымПараметрам()
	
	РежимВыбора = Параметры.РежимВыбора;
	ИспользоватьЦифровуюКлавиатуру = Параметры.ИспользоватьЦифровуюКлавиатуру;
	РежимКассыСамообслуживания = Параметры.РежимКассыСамообслуживания;
	ИспользоватьОплатуНаличными = Параметры.ИспользоватьОплатуНаличными;
	ПравоПросмотраОстаткаНаличныхРМК = Параметры.ПравоПросмотраОстаткаНаличныхРМК;
	ИспользоватьПодключаемоеОборудование = Параметры.ИспользоватьПодключаемоеОборудование;
	ПодключенаОблачнаяККТ = Параметры.ПодключенаОблачнаяККТ;
	ИспользоватьДисплейПокупателя = Параметры.ИспользоватьДисплейПокупателя;
	ПользовательБД = Параметры.Пользователь;
	Кассир = Параметры.Кассир;
	ТорговыйОбъект = Параметры.ТорговыйОбъект;
	НастройкаРМК = Параметры.НастройкаРМК;
	РабочееМесто = Параметры.РабочееМесто;
	ЗапомнитьПараметрыНастроек();
	
	КассовыеСменыККМ = Новый Массив;
	МассивКасс = Параметры.ТаблицаКассККМ;
	Для Каждого ДанныеКассы Из МассивКасс Цикл
		
		НоваяСтрокаКассы = ТаблицаКассККМОрганизаций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаКассы, ДанныеКассы);
		Если ЗначениеЗаполнено(НоваяСтрокаКассы.КассоваяСмена)
				И КассовыеСменыККМ.Найти(НоваяСтрокаКассы.КассоваяСмена) = Неопределено Тогда
			КассовыеСменыККМ.Добавить(НоваяСтрокаКассы.КассоваяСмена);
		КонецЕсли;
		
	КонецЦикла;
	
	МассивТерминалов = Параметры.ТаблицаТерминалов;
	Для Каждого ДанныеТерминала Из МассивТерминалов Цикл
		
		НоваяСтрокаТерминала = ТаблицаТерминалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТерминала, ДанныеТерминала);
		
	КонецЦикла;
	
	ОбновитьВычисляемыеПараметры(КассовыеСменыККМ);
	Если РежимВыбора Тогда
		Элементы.ОткрытьВсеСмены.Видимость = Ложь;
	Иначе
		Если РежимКассыСамообслуживания Тогда
			Элементы.Вернуться.Заголовок = НСтр("ru = 'Продолжить работу'");
		Иначе
			Элементы.Вернуться.Видимость = Ложь;
			Элементы.Вернуться.Важность = ВажностьКнопки.Обычная;
			Элементы.ОткрытьВсеСмены.Важность = ВажностьКнопки.Главная;
		КонецЕсли;
	КонецЕсли;
	СписокРолейПользователя.ЗагрузитьЗначения(Параметры.СписокРолейПользователя.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьПараметрыНастроек()
	
	РеквизитыНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаРМК,
		"ВариантЗаполненияМестаРасчетов,ВремяНачалаСмены");
	ВариантЗаполненияМестаРасчетов = РеквизитыНастройки.ВариантЗаполненияМестаРасчетов;
	ВремяНачалаСмены = РеквизитыНастройки.ВремяНачалаСмены;
	ИнтерфейсРМКСлужебный.ПрименитьНаФормеМасштабИзПараметров(ЭтотОбъект, Параметры);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВычисляемыеПараметры(КассовыеСменыККМ)
	
	ТребуетсяОткрытие = Ложь;
	ВычислитьМинимальнуюДатуНачалаСмены();
	ДатыКассовыхСмен = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(КассовыеСменыККМ,
		"НачалоКассовойСмены,ОкончаниеКассовойСмены");
	Для Каждого СтрокаКассы Из ТаблицаКассККМОрганизаций Цикл
		
		ДатыСмены = ДатыКассовыхСмен.Получить(СтрокаКассы.КассоваяСмена);
		РассчитатьВычисляемыеЗначенияВСтрокеКассы(СтрокаКассы, ТекущаяДатаСеанса(), ЭтотОбъект, ДатыСмены);
		Если Не (ТребуетсяОткрытие Или СтрокаКассы.Открыта) Тогда
			ТребуетсяОткрытие = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Элементы.ОткрытьВсеСмены.Доступность = ТребуетсяОткрытие;
	Элементы.ОткрытьВсеСмены.Видимость = (ТаблицаКассККМОрганизаций.Количество() > 1);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьОбозначениеВремени(ЗначениеВремени ,ВМинутах = Ложь)
	
	МассивОбозначений = Новый Массив();
	Если ВМинутах Тогда
		МассивОбозначений.Добавить(НСтр("ru = 'минут'"));
		МассивОбозначений.Добавить(НСтр("ru = 'минута'"));
		МассивОбозначений.Добавить(НСтр("ru = 'минуты'"));
	Иначе
		МассивОбозначений.Добавить(НСтр("ru = 'часов'"));
		МассивОбозначений.Добавить(НСтр("ru = 'час'"));
		МассивОбозначений.Добавить(НСтр("ru = 'часа'"));
	КонецЕсли;
	РезультатФункции = МассивОбозначений[0];
	КоличествоДесятков = Цел(ЗначениеВремени / 10);
	Остаток = ЗначениеВремени - КоличествоДесятков * 10;
	Если Остаток = 1 И КоличествоДесятков <> 1 Тогда
		РезультатФункции = МассивОбозначений[1];
	ИначеЕсли Остаток > 1 И Остаток < 5 И КоличествоДесятков <> 1 Тогда
		РезультатФункции = МассивОбозначений[2];
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьВычисляемыеЗначенияВСтрокеКассы(СтрокаКассы, ТекущаяДатаВремя, КонтекстФормы, ДатыКассовойСмены)
	
	Сутки = 86400;
	СтатусКратко = НСтр("ru = 'Не было смен'");
	СтатусПодробно = СтатусКратко;
	СтрокаКассы.Истекла = Ложь;
	Если ЗначениеЗаполнено(СтрокаКассы.КассоваяСмена) Тогда
		ДатаНачалаСтрокой = Формат(ДатыКассовойСмены.НачалоКассовойСмены, "Л=ru; ДФ='dd.MM.yyyy, HH:mm'");
		Если СтрокаКассы.Открыта Тогда
			
			РазницаВремени = ТекущаяДатаВремя - ДатыКассовойСмены.НачалоКассовойСмены;
			ВремениОсталось = Сутки - РазницаВремени;
			Если ВремениОсталось > 0 Тогда
				ОсталосьМинут = Окр(ВремениОсталось / 60, 0, 0);
				Если ОсталосьМинут > 99 Тогда
					ОсталосьЧасов = Окр(ВремениОсталось / 3600, 0, 0);
					СтатусКратко = СтрШаблон(НСтр("ru = 'Осталось %1 %2'"), ОсталосьЧасов, ПолучитьОбозначениеВремени(ОсталосьЧасов));
				Иначе
					СтатусКратко = СтрШаблон(НСтр("ru = 'Осталось %1 %2'"),
						ОсталосьМинут, ПолучитьОбозначениеВремени(ОсталосьМинут, Истина));
				КонецЕсли;
			Иначе
				СтатусКратко = НСтр("ru = 'Истекла'");
				СтрокаКассы.Истекла = Истина;
			КонецЕсли;
			СтатусПодробно = СтрШаблон(НСтр("ru = 'Открыта %1'"), ДатаНачалаСтрокой);
			
		Иначе
			
			СтатусКратко = НСтр("ru = 'Закрыта'");
			ДатаЗавершенияСтрокой = Формат(ДатыКассовойСмены.ОкончаниеКассовойСмены, "Л=ru; ДФ='dd.MM.yyyy, HH:mm'");
			СтатусПодробно = СтрШаблон(НСтр("ru = 'Открыта %1, закрыта %2'"), ДатаНачалаСтрокой, ДатаЗавершенияСтрокой);
			
		КонецЕсли;
	КонецЕсли;
	СтрокаКассы.СтатусКратко = СтатусКратко;
	СтрокаКассы.СтатусПодробно = СтатусПодробно;
	Если КонтекстФормы.ИспользоватьОплатуНаличными И КонтекстФормы.ПравоПросмотраОстаткаНаличныхРМК Тогда
		СтрокаКассы.НаличныеПредставление
			= СтрШаблон(НСтр("ru = '%1 руб.'"), Формат(СтрокаКассы.ДенежныеСредстваВКассеККМ, "ЧДЦ=2; ЧРД=,; ЧН=0,00"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуЗавершение(СтрокаКассы)
	
	БылоЗакрытиеСмены = Истина;
	ЗакрытиеСменыПереопределено = Ложь;
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("КонтекстФормы", ЭтотОбъект);
	ПараметрыЗакрытия.Вставить("СтрокаКассы", СтрокаКассы);
	ОбщегоНазначенияРМККлиентПереопределяемый.ЗакрытьСмену(ПараметрыЗакрытия, ЗакрытиеСменыПереопределено);
	
	Если Не ЗакрытиеСменыПереопределено Тогда
		
		ЗакрытьСменуСтандартно(СтрокаКассы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуСтандартно(СтрокаКассы)
	
	ОповещениеЗакрытияСменыСтандартно = Новый ОписаниеОповещения("ЗакрытьСменуСтандартноПродолжение", ЭтотОбъект,
		СтрокаКассы);
		
	Если СтрокаКассы.СверятьСДаннымиОФД Тогда
		ОбщегоНазначенияРМККлиент.СверитьСДаннымиОФД(ЭтотОбъект,
			ОповещениеЗакрытияСменыСтандартно, Ложь, СтрокаКассы.КассаККМ);
	Иначе
		ЗакрытьСменуСтандартноЗавершение(СтрокаКассы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьСтруктуруДляПроверкиКассовойСмены()
	
	СтруктураДляПроверкиКассовойСмены = Новый Структура();
	СтруктураДляПроверкиКассовойСмены.Вставить("Отказ", Ложь);
	СтруктураДляПроверкиКассовойСмены.Вставить("НужноЗакрытьСмену", Ложь);
	СтруктураДляПроверкиКассовойСмены.Вставить("НужноОткрытьСмену", Ложь);
	СтруктураДляПроверкиКассовойСмены.Вставить("ТекстОшибки", НСтр("ru = ''"));
	СтруктураДляПроверкиКассовойСмены.Вставить("ДанныеКассаККМ");
	СтруктураДляПроверкиКассовойСмены.Вставить("ФИОКассира", НСтр("ru = ''"));
	
	Возврат СтруктураДляПроверкиКассовойСмены;
	
КонецФункции

&НаСервере
Процедура ЗаархивироватьЧекиККМ(СтруктураПараметров, СтруктураСтрокиКассы)
	
	ВходныеПараметры = Новый Структура();
	ОбщегоНазначенияРМКПереопределяемый.ПараметрыАрхивацииЧековККМ(ЭтотОбъект, СтруктураСтрокиКассы, ВходныеПараметры);
	ОбщегоНазначенияРМКПереопределяемый.ЗаархивироватьЧекиККМ(ВходныеПараметры, СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуСтандартноЗавершение(СтрокаКассы)
	
	ВыполнитьСверкуИтогов(СтрокаКассы);
	СтруктураДляПроверкиКассовойСмены = СформироватьСтруктуруДляПроверкиКассовойСмены();
	СтруктураСтрокиКассы = Новый Структура("Организация,КассаККМ,КассоваяСмена", Неопределено, Неопределено, Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураСтрокиКассы, СтрокаКассы);
	ЗаархивироватьЧекиККМ(СтруктураДляПроверкиКассовойСмены, СтруктураСтрокиКассы);
	Если СтруктураДляПроверкиКассовойСмены.Отказ Тогда
		
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(СтруктураДляПроверкиКассовойСмены.ТекстОшибки);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыОткрытияОшибки);
		Возврат;
		
	КонецЕсли;
	ПараметрыОперации = МенеджерОборудованияРМККлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	ПараметрыОперации.КассаККМ = СтрокаКассы.КассаККМ;
	ДополнительныеПараметрыДляПечати = ИнтерфейсРМКСлужебныйКлиент.ДополнительныеПараметрыОткрытияЗакрытияСмены();
	ДополнительныеПараметрыДляПечати.Пользователь = ПользовательБД;
	ДополнительныеПараметрыДляПечати.Кассир = Кассир;
	ДополнительныеПараметрыДляПечати.КассаККМ = СтрокаКассы.КассаККМ;
	ДополнительныеПараметрыДляПечати.ВариантЗаполненияМестаРасчетов = ВариантЗаполненияМестаРасчетов;
	
	ЗаполнитьПараметрыОткрытияЗакрытияСмены(ПараметрыОперации, ДополнительныеПараметрыДляПечати);
	
	Если ПодключенаОблачнаяККТ Тогда
		ПараметрыОперации.ОблачнаяККТ = Истина;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗакрытиеСменыОкончаниеФискальныйОтчетПечатьЗавершение",
		ЭтотОбъект, СтрокаКассы);
		
	ИмяКонтейнера = СтрШаблон("ОбластьКарточки%1", НомерТекущегоЭлемента);
	ИмяСтраницы = СтрШаблон("СтраницаОжидания%1", НомерТекущегоЭлемента);
	Элементы[ИмяКонтейнера].ТекущаяСтраница = Элементы[ИмяСтраницы];
	
	ДополнительныеПараметры = Новый Структура();
	МенеджерОборудованияРМККлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(Оповещение, Неопределено,
		СтрокаКассы.ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПараметрыОткрытияЗакрытияСмены(ПараметрыОперации, ДополнительныеПараметрыДляПечати)
	
	ПараметрыОперации.Кассир = НСтр("ru='Администратор'");
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьПараметрыКассираДляПечати(ПараметрыОперации,
		ДополнительныеПараметрыДляПечати);
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьПараметрыАдресаМестаРасчетов(ПараметрыОперации,
		ДополнительныеПараметрыДляПечати);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  СоздатьДокументКассоваяСменаБезТО(ПараметрыКассовойСмены, Отказ)
	
	Возврат ОбщегоНазначенияРМК.ОткрытьКассовуюСменуБезОборудования(Отказ, ПараметрыКассовойСмены);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗакрытьКассовуюСменуВДокументеБезТО(Отказ, КассоваяСмена)
	
	ОбщегоНазначенияРМК.ЗакрытьКассовуюСменуБезОборудования(Отказ, КассоваяСмена);
	
КонецПроцедуры

&НаКлиенте
Функция ТерминалДляСверкиДобавлен(СтрокаТерминала, ТерминалыДляСверки)
	
	РезультатФункции = Ложь;
	
	КоличествоЭлементов = ТерминалыДляСверки.Количество();
	ИндексТерминала = 0;
	Пока ИндексТерминала < КоличествоЭлементов И Не РезультатФункции Цикл
		ТекущийТерминалСверки = ТерминалыДляСверки.Получить(ИндексТерминала);
		
		Если ТекущийТерминалСверки.ИспользоватьБезПодключенияОборудования
				= СтрокаТерминала.ИспользоватьБезПодключенияОборудования
				И ТекущийТерминалСверки.ПодключаемоеОборудование = СтрокаТерминала.ПодключаемоеОборудование
				И ТекущийТерминалСверки.Организация = СтрокаТерминала.Организация Тогда
			РезультатФункции = Истина;
		КонецЕсли;
		
		ИндексТерминала = ИндексТерминала + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ТерминалыДляСверкиИтогов(ОрганизацияОтбор)
	
	ТерминалыДляСверки = Новый Массив();
	Для Каждого СтрокаТерминала Из ТаблицаТерминалы Цикл
		Если СтрокаТерминала.Организация = ОрганизацияОтбор Тогда
		
			Если Не ТерминалДляСверкиДобавлен(СтрокаТерминала, ТерминалыДляСверки) Тогда
				ТерминалДляСверки = ИнтерфейсРМКСлужебныйКлиент.НовыйТерминалДляСверкиИтогов();
				ЗаполнитьЗначенияСвойств(ТерминалДляСверки, СтрокаТерминала);
				ТерминалыДляСверки.Добавить(ТерминалДляСверки);
			КонецЕсли;
		
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТерминалыДляСверки;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСверкуИтогов(СтрокаКассы)
	
	СчетчикДоступностиСверки = 0;
	ТерминалыДляСверкиИтогов = ТерминалыДляСверкиИтогов(СтрокаКассы.Организация);
	Для Каждого Терминал Из ТерминалыДляСверкиИтогов Цикл
	
		Если НЕ Терминал.ИспользоватьБезПодключенияОборудования
			И ЗначениеЗаполнено(Терминал.ПодключаемоеОборудование) Тогда
			
			СчетчикДоступностиСверки = СчетчикДоступностиСверки + 1;
			
			Оповещение = Новый ОписаниеОповещения("ВыполнитьСверкуИтоговЗавершение", ЭтотОбъект);
			ПечатающееУстройство = СтрокаКассы.ИдентификаторУстройства;
			
			ЭквайринговыйТерминал = Терминал.ПодключаемоеОборудование;
			ПараметрыОперации = МенеджерОборудованияРМККлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
			Если ПодключенаОблачнаяККТ Тогда
				ПараметрыОперации.ИспользоватьПечатающееУстройство = Ложь;
				ПечатающееУстройство = Неопределено;
			КонецЕсли;
			МенеджерОборудованияРМККлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(Оповещение,
				Неопределено, ЭквайринговыйТерминал, ПараметрыОперации, , ПечатающееУстройство);
			
		КонецЕсли;
		
	КонецЦикла;
	Если СчетчикДоступностиСверки > 0 Тогда
		Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСообщенияОбОшибке(ПараметрыДляОткрытия, ДополнительныеПараметры = Неопределено)
	
	ПараметрыДляОткрытия.Вставить("РежимКассыСамообслуживания", РежимКассыСамообслуживания);
	ОбработкаОповещения = Новый ОписаниеОповещения("ЗакрытиеСообщенияОбОшибке", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаСообщенияОбОшибке", ПараметрыДляОткрытия, ЭтотОбъект,,,,
		ОбработкаОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКФормеИсточнику(ОтказОтОперации = Ложь)
	
	ИнтерактивноеЗакрытие = Истина;
	Ответ = Новый Структура("ПродолжитьДействие", Ложь);
	Ответ.Вставить("БылоОткрытиеСмены", БылоОткрытиеСмены);
	Ответ.Вставить("БылоЗакрытиеСмены", БылоЗакрытиеСмены);
	Ответ.Вставить("БылоВнесениеВыемка", БылоВнесениеВыемка);
	Ответ.Вставить("БылоОбновлениеПослеВнесенияВыемки", БылоОбновлениеПослеВнесенияВыемки);
	Ответ.Вставить("БылоИзменениеСтатусаТСПИоТ", БылоИзменениеСтатусаТСПИоТ);
	Если Не ОтказОтОперации Тогда
		Если РежимВыбора Тогда
			Ответ.ПродолжитьДействие = Истина;
			СтрокаКассы = ТаблицаКассККМОрганизаций[НомерТекущегоЭлемента - 1];
			Ответ.Вставить("КассаККМ", СтрокаКассы.КассаККМ);
		КонецЕсли;
	КонецЕсли;
	Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Функция ВсеСменыОткрыты()
	
	РезультатФункции = Истина;
	
	КоличествоККМ = ТаблицаКассККМОрганизаций.Количество();
	ИндексКассы = 0;
	Пока ИндексКассы < КоличествоККМ И РезультатФункции Цикл
		СтрокаКассы = ТаблицаКассККМОрганизаций.Получить(ИндексКассы);
		Если СтрокаКассы.Истекла Или Не СтрокаКассы.Открыта
				Или СтрокаКассы.НачалоКассовойСмены < МинимальноеДатаНачалаСмены Тогда
			РезультатФункции = Ложь;
		КонецЕсли;
		ИндексКассы = ИндексКассы + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВыемки(СтрокаКассы, СуммаВыемки)
	
	ДополнительныеПараметры = Новый Структура("КассаККМ", СтрокаКассы.КассаККМ);
	ДополнительныеПараметры.Вставить("ЭтоВнесение", Ложь);
	ДополнительныеПараметры.Вставить("ЭтоВыемкаПриЗакрытииСмены", (СуммаВыемки > 0));
	
	ПараметрыДляОткрытия = Новый Структура();
	ПараметрыДляОткрытия.Вставить("ЭтоВнесение", Ложь);
	ПараметрыДляОткрытия.Вставить("СуммаОперации", СуммаВыемки);
	
	ОткрытьФормуВнесенияВыемки(СтрокаКассы, ПараметрыДляОткрытия, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВнесения(СтрокаКассы)
	
	ДополнительныеПараметры = Новый Структура("КассаККМ", СтрокаКассы.КассаККМ);
	ДополнительныеПараметры.Вставить("ЭтоВнесение", Истина);
	ДополнительныеПараметры.Вставить("ЭтоВыемкаПриЗакрытииСмены", Ложь);
	
	ПараметрыДляОткрытия = Новый Структура();
	ПараметрыДляОткрытия.Вставить("ЭтоВнесение", Истина);
	ПараметрыДляОткрытия.Вставить("СуммаОперации", 0);
	
	ОткрытьФормуВнесенияВыемки(СтрокаКассы, ПараметрыДляОткрытия, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВнесенияВыемки(СтрокаКассы, ПараметрыДляОткрытия, ДополнительныеПараметры)
	
	ТекстПодсказки = СформироватьТекстПодсказкиДляВнесенияВыемки(СтрокаКассы);
	ВывестиИнформациюНаДисплейПокупателя(ТипыОперацийДисплеяПокупателя.Сервис, СтрокаКассы.Организация);
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ФормаВнесенияВыемкиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыДляОткрытия.Вставить("ТекстПодсказки", ТекстПодсказки);
	ПараметрыДляОткрытия.Вставить("ИспользоватьЦифровуюКлавиатуру", ИспользоватьЦифровуюКлавиатуру);
	ПараметрыДляОткрытия.Вставить("ПравоПросмотраОстаткаНаличныхРМК", ПравоПросмотраОстаткаНаличныхРМК);
	ПараметрыДляОткрытия.Вставить("НаличныеВКассе", СтрокаКассы.ДенежныеСредстваВКассеККМ);
	ПараметрыДляОткрытия.Вставить("ЭтоВыемкаПриЗакрытииСмены", ДополнительныеПараметры.ЭтоВыемкаПриЗакрытииСмены);
	ПараметрыДляОткрытия.Вставить("Организация", СтрокаКассы.Организация);
	ПараметрыДляОткрытия.Вставить("КассаККМ", СтрокаКассы.КассаККМ);
	ПараметрыДляОткрытия.Вставить("КассоваяСмена", СтрокаКассы.КассоваяСмена);
	ПараметрыДляОткрытия.Вставить("ПодключаемоеОборудование", СтрокаКассы.ИдентификаторУстройства);
	ПараметрыДляОткрытия.Вставить("Кассир", Кассир);
	ПараметрыДляОткрытия.Вставить("ПользовательБД", ПользовательБД);
	ПараметрыДляОткрытия.Вставить("СписокРолейПользователя", СписокРолейПользователя);
	ПараметрыДляОткрытия.Вставить("НесколькоКасс", (ТаблицаКассККМОрганизаций.Количество() > 1));
	ПараметрыДляОткрытия.Вставить("ТорговыйОбъект", ТорговыйОбъект);
	ПараметрыДляОткрытия.Вставить("Масштаб", Масштаб);
	
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаВнесенияВыемки", ПараметрыДляОткрытия, ЭтотОбъект,,,,
		ОбработкаОповещения);
	
	ВывестиИнформациюНаДисплейПокупателя(ТипыОперацийДисплеяПокупателя.НачалоРаботы, СтрокаКассы.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеВКарточкеКассы(СтрокаКассы)
	
	ДатаТекущая = ОбщегоНазначенияКлиент.ДатаСеанса();
	ДатыСмены = Новый Структура();
	ДатыСмены.Вставить("НачалоКассовойСмены", СтрокаКассы.НачалоКассовойСмены);
	ДатыСмены.Вставить("ОкончаниеКассовойСмены", Дата(1, 1, 1));
	РассчитатьВычисляемыеЗначенияВСтрокеКассы(СтрокаКассы, ДатаТекущая, ЭтотОбъект, ДатыСмены);
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьТекстПодсказкиДляВнесенияВыемки(СтрокаКассы)
	
	ТекстПодсказки = "";
	
	Если ПравоПросмотраОстаткаНаличныхРМК Тогда
		
		ТекстПодсказки = СтрШаблон(НСтр("ru='Наличные в кассе: %1 %2'"),
			СтрокаКассы.ДенежныеСредстваВКассеККМ, ПредставлениеВалюты);
			
		Если СтрокаКассы.МинимальныйОстатокНаличныхВКассе > 0 Тогда
			ТекстПодсказки = ТекстПодсказки + Символы.ПС
				+ СтрШаблон(НСтр("ru='Минимальный остаток: %1 %2'"),
					СтрокаКассы.МинимальныйОстатокНаличныхВКассе, ПредставлениеВалюты);
		КонецЕсли;
		Если ТаблицаКассККМОрганизаций.Количество() > 1 Тогда
			ДенежныеСредстваВсего = ТаблицаКассККМОрганизаций.Итог("ДенежныеСредстваВКассеККМ");
			ТекстПодсказки = ТекстПодсказки + Символы.ПС
				+ СтрШаблон(НСтр("ru='Наличные всего: %1 %2'"), ДенежныеСредстваВсего, ПредставлениеВалюты);
		КонецЕсли;
		
	ИначеЕсли СтрокаКассы.МинимальныйОстатокНаличныхВКассе > 0 Тогда
		ТекстПодсказки = СтрШаблон(НСтр("ru='Минимальный остаток: %1 %2'"),
			СтрокаКассы.МинимальныйОстатокНаличныхВКассе, ПредставлениеВалюты);
	КонецЕсли;
	
	Возврат ТекстПодсказки;
	
КонецФункции

&НаКлиенте
Процедура ВывестиИнформациюНаДисплейПокупателя(Операция, Организация)
	
	Если Не ИспользоватьДисплейПокупателя Тогда
		Возврат;
	КонецЕсли;
	
	ИсходныеДанные = МенеджерОборудованияРМККлиент.ИсходныеДанныеДляПервичнойПередачиНаДисплейПокупателя();
	ИсходныеДанные.ОповещениеПриЗавершении
		= Новый ОписаниеОповещения("ВывестиИнформациюНаДисплейПокупателяЗавершение", ЭтотОбъект);
	ИсходныеДанные.ИспользоватьПодключаемоеОборудование = ИспользоватьПодключаемоеОборудование;
	ИсходныеДанные.ДанныеДляОтображения = ДанныеКПередачеВДисплейПокупателя;
	ИсходныеДанные.Операция = Операция;
	ИсходныеДанные.Организация = Организация;
	МенеджерОборудованияРМККлиент.ВывестиИнформациюНаДисплейПокупателя(Операция, ИсходныеДанные, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс
&НаКлиенте
Процедура СнятиеОтчетаБезГашенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПроизвестиСнятиеОтчетаБезГашения(ДополнительныеПараметры.СтрокаКассы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьФормированиеОтчетаБезГашения(Результат, Параметры) Экспорт
	
	Доступность = Истина;
	
	Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(Результат, "Результат") И Не Результат.Результат Тогда
		
		ТекстОшибки = НСтр("ru = 'При снятии отчета на фискальном регистраторе произошла ошибка.
		|%1
		|Отчет на фискальном регистраторе не сформирован.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Результат.ОписаниеОшибки);
		ЗаголовокОшибки = НСтр("ru = 'Ошибка печати отчета без гашения'");
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки, ЗаголовокОшибки);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		СтрокаКассы = ДополнительныеПараметры.СтрокаКассы;
		
		ТребуетсяВыемкаПриЗакрытииСмены = Ложь;
		СуммаВыемки = 0;
		Если СтрокаКассы.ТребуетсяВыемкаПриЗакрытииСмены
				И ВладелецФормы.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК" Тогда
			СуммаВыемки = СтрокаКассы.ДенежныеСредстваВКассеККМ - СтрокаКассы.МинимальныйОстатокНаличныхВКассе;
			ТребуетсяВыемкаПриЗакрытииСмены = (СуммаВыемки > 0);
		КонецЕсли;
		
		Если ТребуетсяВыемкаПриЗакрытииСмены Тогда
			ОткрытьФормуВыемки(СтрокаКассы, СуммаВыемки);
		Иначе
			ЗакрытьСменуЗавершение(СтрокаКассы);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуСтандартноПродолжение(ПараметрыСверкиИЗакрытия, СтрокаКассы) Экспорт
	
	Если ПараметрыСверкиИЗакрытия.ЕстьРасхожденияВСверке Тогда
		
		ТекстЗаголовка = НСтр("ru = 'Проверка данных в ОФД.'");
		ТекстВопроса = НСтр("ru = 'Данные смены в сервисе ОФД и в базе различаются. Продолжить закрытие смены?'");
		КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
		ПараметрыЗавершения = Новый Структура();
		ПараметрыЗавершения.Вставить("ДанныеСверки", ПараметрыСверкиИЗакрытия.ДанныеСверки);
		ПараметрыЗавершения.Вставить("СтрокаКассы", СтрокаКассы);
		
		ОповещениеЗавершения = Новый ОписаниеОповещения("ЗакрытьСменуСтандартноПродолжениеВопрос",
			ЭтотОбъект, ПараметрыЗавершения);
		ПоказатьВопрос(ОповещениеЗавершения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КнопкаПоУмолчанию, ТекстЗаголовка);
		
	Иначе
		
		ЗакрытьСменуСтандартноЗавершение(СтрокаКассы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуСтандартноПродолжениеВопрос(Результат, ПараметрыЗавершения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗакрытьСменуСтандартноЗавершение(ПараметрыЗавершения.СтрокаКассы);
		
	ИначеЕсли ВладелецФормы.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК" Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыполнитьВыводОтчетаЗаСмену", ВладелецФормы);
		ВыполнитьОбработкуОповещения(Оповещение, ПараметрыЗавершения.ДанныеСверки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗакрытиеСменыОкончаниеФискальныйОтчетПечатьЗавершение(РезультатВыполнения,
	ПараметрыВыполнения) Экспорт
	
	ИмяКонтейнера = СтрШаблон("ОбластьКарточки%1", НомерТекущегоЭлемента);
	ИмяСтраницы = СтрШаблон("СтраницаКарточка%1", НомерТекущегоЭлемента);
	Элементы[ИмяКонтейнера].ТекущаяСтраница = Элементы[ИмяСтраницы];
	Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "Результат")
			И НЕ РезультатВыполнения.Результат Тогда
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеТекущегоСостоянияККТПриЗакрытии", ЭтотОбъект);
		МенеджерОборудованияРМККлиент.НачатьПолучениеТекущегоСостоянияФискальногоУстройства(
			ОповещениеОЗавершении, Неопределено, РезультатВыполнения.ИдентификаторУстройства);
		
		ТекстЗаголовка = НСтр("ru = 'При снятии отчета на фискальном регистраторе произошла ошибка.'");
		ТекстСообщения =
			СтрШаблон(НСтр("ru = '""%1""
				|Отчет на фискальном регистраторе не сформирован.'"), РезультатВыполнения.ОписаниеОшибки);
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстСообщения, ТекстЗаголовка);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
		
	Иначе
		Оповестить("ИзменениеСостоянияКассовойСмены", ПараметрыВыполнения.КассаККМ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСменуЗавершение(РезультатВыполнения, ПараметрыВыполнения) Экспорт
	
	БылоОткрытиеСмены = Истина;
	ИмяКонтейнера = СтрШаблон("ОбластьКарточки%1", НомерТекущегоЭлемента);
	ИмяСтраницы = СтрШаблон("СтраницаКарточка%1", НомерТекущегоЭлемента);
	Элементы[ИмяКонтейнера].ТекущаяСтраница = Элементы[ИмяСтраницы];
	
	Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "Результат")
			И РезультатВыполнения.Результат Тогда
			
		Оповестить("ИзменениеСостоянияКассовойСмены", ПараметрыВыполнения.КассаККМ);	
		ВсеСменыОткрыты = ВсеСменыОткрыты();
		ФормаВладелецОшибки = ?(ВсеСменыОткрыты И Не РежимВыбора, ЭтотОбъект.ВладелецФормы, ЭтотОбъект);
		ТекстСообщения = НСтр("ru = 'Кассовая смена в системе открыта'");
		Если Не ПакетноеОткрытие Тогда
			ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстСообщения);
			ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
			ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ФормаВладелецОшибки, ПараметрыОткрытияОшибки);
		КонецЕсли;
		
		Если ВсеСменыОткрыты() Тогда
			Если ПакетноеОткрытие Тогда
				ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстСообщения);
				ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
				ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ФормаВладелецОшибки, ПараметрыОткрытияОшибки);
				ПакетноеОткрытие = Ложь;
			КонецЕсли;
			Если Не РежимВыбора Тогда
				ВернутьсяКФормеИсточнику();
			КонецЕсли;
		ИначеЕсли ПакетноеОткрытие Тогда
			ЗапуститьОткрытиеСледующейСмены();
		КонецЕсли;
		
	Иначе
		
		ПакетноеОткрытие = Ложь;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеТекущегоСостоянияККТПриОткрытии", ЭтотОбъект);
		МенеджерОборудованияРМККлиент.НачатьПолучениеТекущегоСостоянияФискальногоУстройства(
			ОповещениеОЗавершении, Неопределено, РезультатВыполнения.ИдентификаторУстройства);
		
		ТекстЗаголовка = НСтр("ru = 'Ошибка открытия смены'");
		
		ЛокализованныйТекстСообщения = СтрШаблон(НСтр("ru = 'При открытии смены произошла ошибка.
			|%1
			|Смена не открыта на фискальном устройстве.'"), РезультатВыполнения.ОписаниеОшибки);
		
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ЛокализованныйТекстСообщения, ТекстЗаголовка);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеТекущегоСостоянияККТПриЗакрытии(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВыполнения = Неопределено И ТипЗнч(РезультатВыполнения) = Тип("Структура") Тогда
		Если РезультатВыполнения.Свойство("Результат") И РезультатВыполнения.Свойство("СтатусСмены") Тогда
			Если РезультатВыполнения.Результат И РезультатВыполнения.СтатусСмены = 1 Тогда //1-закрыта
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьКассовуюСменуВручную", ЭтотОбъект, РезультатВыполнения);
				ТекстВопроса = НСтр("ru='Актуализировать кассовую смену в программе?
					|Кассовая смена в программе будет закрыта, при этом отчет о закрытии смены не будет распечатан.'");
				ЗаголовокВопроса = НСтр("ru='На ККТ смена уже была закрыта ранее.'");
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеТекущегоСостоянияККТПриОткрытии(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВыполнения = Неопределено И ТипЗнч(РезультатВыполнения) = Тип("Структура") Тогда
		Если РезультатВыполнения.Свойство("Результат") И РезультатВыполнения.Свойство("СтатусСмены") Тогда
			Если РезультатВыполнения.Результат 
				И (РезультатВыполнения.СтатусСмены = 2 ИЛИ РезультатВыполнения.СтатусСмены = 3) Тогда //2-открыта, 3-просрочена
			
				ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьКассовуюСменуВручную", ЭтотОбъект, РезультатВыполнения);
				ТекстВопроса = НСтр("ru='Актуализировать кассовую смену в программе?
					|Кассовая смена в программе будет открыта, при этом чек об открытии смены не будет распечатан.'");
				ЗаголовокВопроса = НСтр("ru='На ККТ смена уже была открыта ранее.'");
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьКассовуюСменуВручную(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		РезультатВыполнения = ДополнительныеПараметры;
		
		Отбор = Новый Структура("ИдентификаторУстройства", РезультатВыполнения.ИдентификаторУстройства);
		СтрокаКассы = ТаблицаКассККМОрганизаций.НайтиСтроки(Отбор)[0];
		
		ПодключаемоеОборудование = СтрокаКассы.ИдентификаторУстройства;
		ККМПоддерживаетПроверкуКодовМаркировки = СтрокаКассы.ПоддерживаетПроверкуКодовМаркировки;
		
		Отказ = Ложь;
		ЗакрытьКассовуюСменуВДокументеБезТО(Отказ, СтрокаКассы.КассоваяСмена);
		
		Если Не Отказ Тогда
			Оповестить("ИзменениеСостоянияКассовойСмены", СтрокаКассы.КассаККМ);
		Иначе
			
			ТекстЗаголовка = НСтр("ru = 'Ошибка закрытия смены'");
			ТекстОшибки = НСтр("ru = 'При закрытии смены произошла ошибка. Смена не закрыта.'");
			ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки, ТекстЗаголовка);
			ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКассовуюСменуВручную(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		РезультатВыполнения = ДополнительныеПараметры;
		
		Отбор = Новый Структура("ИдентификаторУстройства", РезультатВыполнения.ИдентификаторУстройства);
		СтрокаКассы = ТаблицаКассККМОрганизаций.НайтиСтроки(Отбор)[0];
		
		ПодключаемоеОборудование = СтрокаКассы.ИдентификаторУстройства;
		ККМПоддерживаетПроверкуКодовМаркировки = СтрокаКассы.ПоддерживаетПроверкуКодовМаркировки;
		
		Отказ = Ложь;
		ПараметрыКассовойСмены = Новый Структура();
		ПараметрыКассовойСмены.Вставить("НомерСменыККТ", РезультатВыполнения.НомерСменыККТ);
		ПараметрыКассовойСмены.Вставить("КассаККМ", СтрокаКассы.КассаККМ);
		ПараметрыКассовойСмены.Вставить("ИдентификаторКассыККМ", ПодключаемоеОборудование);
		ПараметрыКассовойСмены.Вставить("РабочееМесто", РабочееМесто);
		НоваяКассоваяСмена = СоздатьДокументКассоваяСменаБезТО(ПараметрыКассовойСмены, Отказ);
		
		Если Не Отказ Тогда
			Оповестить("ИзменениеСостоянияКассовойСмены", СтрокаКассы.КассаККМ);
		Иначе
			
			ТекстЗаголовка = НСтр("ru = 'Ошибка открытия смены'");
			ТекстОшибки = НСтр("ru = 'При открытии смены произошла ошибка. Смена не открыта.'");
			ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки, ТекстЗаголовка);
			ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтоговЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт 
	
	СчетчикДоступностиСверки = СчетчикДоступностиСверки - 1;
	Если СчетчикДоступностиСверки < 1 И Не Доступность Тогда
		Доступность = Истина;
	КонецЕсли;
	
	Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "Результат")
			И НЕ РезультатВыполнения.Результат Тогда
		
		ТекстЗаголовка = НСтр("ru = 'При выполнении операции произошла ошибка'");
		ТекстСообщения = НСтр("ru = '""%ОписаниеОшибки%""
										|Операция сверки итогов не была проведена.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстСообщения, ТекстЗаголовка);
		ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСообщенияОбОшибке(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("ЗакрытьФорму")
			И ДополнительныеПараметры.ЗакрытьФорму = Истина Тогда
			
		ВернутьсяКФормеИсточнику(Истина);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаВнесенияВыемкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ОтборПоКассе = Новый Структура("КассаККМ", ДополнительныеПараметры.КассаККМ);
		СтрокиКасс = ТаблицаКассККМОрганизаций.НайтиСтроки(ОтборПоКассе);
		Если СтрокиКасс.Количество() > 0 Тогда
			СтрокаКассы = СтрокиКасс[0];
			Если Результат.ОперацияПодтверждена И Не Результат.Ошибка Тогда
				
				БылоВнесениеВыемка = Истина;
				БылоОбновлениеПослеВнесенияВыемки = Ложь;
				СуммаДельта = ?(ДополнительныеПараметры.ЭтоВнесение, 1, -1) * Результат.СуммаОперации;
				СтрокаКассы.ДенежныеСредстваВКассеККМ = СтрокаКассы.ДенежныеСредстваВКассеККМ + СуммаДельта;
				ОбновитьПредставлениеВКарточкеКассы(СтрокаКассы);
				
			КонецЕсли;
			Если Не Результат.Ошибка И ДополнительныеПараметры.Свойство("ЭтоВыемкаПриЗакрытииСмены")
					И ДополнительныеПараметры.ЭтоВыемкаПриЗакрытииСмены = Истина Тогда
				ЗакрытьСменуЗавершение(СтрокаКассы);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюВнесениеЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "Результат")
			И РезультатВыполнения.Результат Тогда
		
		БылоВнесениеВыемка = Истина;
		БылоОбновлениеПослеВнесенияВыемки = Ложь;
		Если НомерТекущегоЭлемента <= ТаблицаКассККМОрганизаций.Количество() Тогда
			СтрокаКассы = ТаблицаКассККМОрганизаций[НомерТекущегоЭлемента - 1];
			ОбновитьПредставлениеВКарточкеКассы(СтрокаКассы);
		КонецЕсли;
		
	Иначе
		
		ТекстЗаголовка = НСтр("ru = 'Ошибка внесения.'");
		ТекстОшибки = НСтр("ru='Ошибка внесения'");
		Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "ТекстСообщения") Тогда
			ТекстОшибки = РезультатВыполнения.ТекстСообщения;
		КонецЕсли;
		Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "ОписаниеОшибки") Тогда
			ТекстОшибки = РезультатВыполнения.ОписаниеОшибки;
		КонецЕсли;
		
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки, ТекстЗаголовка);
		ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиИнформациюНаДисплейПокупателяЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(РезультатВыполнения, "Результат")
			И НЕ РезультатВыполнения.Результат Тогда
		
		ТекстЗаголовка = НСтр("ru = 'При снятии отчета на фискальном регистраторе произошла ошибка.'");
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось вывести информацию на дисплей покупателя по причине: %1'"),
			РезультатВыполнения.ОписаниеОшибки);
			
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстСообщения, ТекстЗаголовка);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбработкуСтатусовТСПИоТ() Экспорт
	
	ОбщегоНазначенияРМККлиент.ЗапуститьОбработкуСтатусовТСПИоТ(ТаблицаКассККМОрганизаций, ЭтотОбъект.ВладелецФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусТСПИоТИзВнешнихДанных(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Отбор = Новый Структура("ИдентификаторУстройства", ДополнительныеПараметры.ИдентификаторУстройства);
	СтрокаКассы = ТаблицаКассККМОрганизаций.НайтиСтроки(Отбор)[0];
	
	ЗаполнитьЗначенияСвойств(СтрокаКассы, ДополнительныеПараметры, "АвторизацияПройденаТСПИоТ, ГотовКРаботеТСПИоТ, НастроенТСПИоТ, ВнешнийТСПИоТ");
	
	ОбновитьЭлементыКарточек();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусТСПИоТ(Статус, ККТ)
	
	ОбщегоНазначенияРМККлиент.ОбновитьСтатусТСПИоТ(Статус, ККТ, ТаблицаКассККМОрганизаций);
	
	ОбновитьЭлементыКарточек();
	
КонецПроцедуры

#КонецОбласти
