// @strict-types


#Область ПрограммныйИнтерфейс

// @skip-check property-return-type
// 
// Подключаемый обработчик. Выполняется при нажатии на статус.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Параметры - Структура:
//   * Идентификатор - Строка - идентификатор статуса.
//   * Родитель      - ГруппаФормы - элемент формы, к которому привязывается расшифровка статуса.
Процедура ПерейтиКДетальномуОписаниюСтатуса(Форма, Параметры) Экспорт
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Форма", Форма);
	ПараметрыЗакрытия.Вставить("Контекст", Форма.ЭДО_ПараметрыСтатуса);
	ПараметрыЗакрытия.Вставить("ПараметрыСтатуса", Параметры);
	
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ВыполнитьКоманду", ПодключаемыеСтатусыЭДОКлиент, ПараметрыЗакрытия);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контекст", Форма.ЭДО_ПараметрыСтатуса);
	ОткрытьФорму("ОбщаяФорма.ПодключаемыеСтатусыЭДО", ПараметрыФормы, Форма,,,, ОповещениеЗакрытия);
КонецПроцедуры

// Обработка оповещения формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ИмяСобытия - Строка - Имя события
Процедура ОбработкаОповещения(Форма, ИмяСобытия) Экспорт
	Если ИмяСобытия = ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияСостоянияЭДО() Тогда
		//@skip-check dynamic-access-method-not-found
		Форма.Прочитать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выполнить команду после закрытия.
// 
// Параметры:
//  ИмяКоманды - Строка - Имя команды
//             - Неопределено
//  ДополнительныеПараметры - Структура:
//    *Форма - ФормаКлиентскогоПриложения
//    *Контекст - Структура:
//      **Ссылка - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//      **Организация - ОпределяемыйТип.Организация
//      **Контрагент - ОпределяемыйТип.УчастникЭДО
//      **Направление - ПеречислениеСсылка.НаправленияЭДО - направление документа, для которого получаем статус
//      **СтатусЭДО - ПеречислениеСсылка.СтатусыЭДО - первоначальный статус
//    *ПараметрыСтатуса - см. ПерейтиКДетальномуОписаниюСтатуса.Параметры
//
Процедура ВыполнитьКоманду(ИмяКоманды, ДополнительныеПараметры) Экспорт

	Контекст = ДополнительныеПараметры.Контекст;
	Владелец = ДополнительныеПараметры.Форма;
	Если ИмяКоманды = Неопределено Тогда
		Возврат;
	ИначеЕсли ИмяКоманды = "ВыгрузитьДанныеВФайл" Тогда
		ПараметрыВыполненияКоманды = Новый Структура("Источник", Владелец);
		ИнтерфейсДокументовЭДОКлиент.ВыгрузитьДанныеВФайл(Контекст.Ссылка, ПараметрыВыполненияКоманды);
	ИначеЕсли ИмяКоманды = "ДеревоЭД" Тогда
		ПараметрыВыполненияКоманды = Новый Структура("Источник", Владелец);
		ИнтерфейсДокументовЭДОКлиент.ОткрытьДеревоЭлектронныхДокументов(Контекст.Ссылка, ПараметрыВыполненияКоманды);
	ИначеЕсли ИмяКоманды = "ОткрытьАктуальныйЭД" Тогда
		ПараметрыВыполненияКоманды = Новый Структура("Источник", Владелец);
		ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокументОбъектаУчетаКоманда(Контекст.Ссылка, 
			ПараметрыВыполненияКоманды);
	ИначеЕсли ИмяКоманды = "ПерезаполнитьДокумент" Тогда
		ПараметрыВыполненияКоманды = Новый Структура("Источник", Владелец);
		ИнтерфейсДокументовЭДОКлиент.ПерезаполнитьДокумент(Контекст.Ссылка, ПараметрыВыполненияКоманды);
	ИначеЕсли ИмяКоманды = "ПодключитьОрганизацию" Тогда
		ПараметрыВыполненияКоманды = Новый Структура("Источник", Владелец);
		ИнтерфейсДокументовЭДОКлиент.ПодключитьКЭДО(Контекст.Организация, ПараметрыВыполненияКоманды);
	ИначеЕсли ИмяКоманды = "ПригласитьКОбменуЭДО" Тогда
		ПараметрыВыполненияКоманды = СинхронизацияЭДОКлиент.НовыеПараметрыОткрытияПомощникаОтправкиПриглашения();
		ПараметрыВыполненияКоманды.Контрагент = ИнтерфейсДокументовЭДОВызовСервера.КонтрагентыДляОтправкиПриглашений(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Контекст.Контрагент));
		ПараметрыВыполненияКоманды.Организация = Контекст.Организация;
		СинхронизацияЭДОКлиент.ОткрытьПомощникОтправкиПриглашения(ПараметрыВыполненияКоманды);
	ИначеЕсли ИмяКоманды = "СоздатьПроизвольныйДокумент" Тогда
		ПараметрыВыполненияКоманды = Новый Структура("Источник", Владелец);
		ИнтерфейсДокументовЭДОКлиент.ОткрытьНовыйПроизвольныйЭлектронныйДокументНаОсновании(Контекст.Ссылка,
			ПараметрыВыполненияКоманды);
	ИначеЕсли ИмяКоманды = "СформироватьПодписатьОтправитьЭД" Тогда
		ПараметрыВыполненияКоманды = Новый Структура("Источник", Владелец);
		ЭлектронныеДокументыЭДОКлиент.СформироватьПодписатьОтправитьЭД(Контекст.Ссылка, ПараметрыВыполненияКоманды);
	ИначеЕсли ИмяКоманды = "СформироватьПодписатьЭД" Тогда
		ПараметрыВыполненияКоманды = Новый Структура("Источник", Владелец);
		ЭлектронныеДокументыЭДОКлиент.СформироватьПодписатьПодготовитьКОтправкеЭД(Контекст.Ссылка,
			ПараметрыВыполненияКоманды);
	ИначеЕсли ИмяКоманды = "ОткрытьТекущиеДелаЭДО" Тогда
		ПараметрыВыполненияКоманды = Новый Структура("Источник", Владелец);
		ИнтерфейсДокументовЭДОКлиент.ОткрытьТекущиеДелаЭДОКоманда(Контекст.Ссылка, ПараметрыВыполненияКоманды);
	Иначе
		ОповещениеПослеПредупреждения = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаПредупреждения",
			ПодключаемыеСтатусыЭДОКлиент, ДополнительныеПараметры);
		ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Ошибка выполнения команды - %1'"), ИмяКоманды);
		ПоказатьПредупреждение(ОповещениеПослеПредупреждения, ТекстПредупреждения);
	КонецЕсли;
КонецПроцедуры

// см. ВыполнитьКоманду
Процедура ПослеЗакрытияДиалогаПредупреждения(ДополнительныеПараметры) Экспорт
	ПерейтиКДетальномуОписаниюСтатуса(ДополнительныеПараметры.Форма, ДополнительныеПараметры.ПараметрыСтатуса);
КонецПроцедуры

#КонецОбласти