#Область ОписаниеПеременных

// Структура с кодами возможных операций сотрудника на КСО.
&НаКлиенте
Перем ВозможныеОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнтерфейсРМКСлужебный.ПрименитьНаФормеМасштабИзПараметров(ЭтотОбъект, Параметры);
	ЗапомнитьЗначенияВходныхПараметров();
	Элементы.ОбучениеУстройствРаспознавания.Видимость = Параметры.ОбучениеУстройствРаспознавания;
	Элементы.ВыполнитьСверкуИтогов.Видимость = (ОборудованиеДляСверки.Количество() > 0);
	НастроитьКомандуУправленияКассовойСменой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВозможныеОперации = ИнтерфейсРМКСлужебныйКлиент.ВозможныеОперацииСотрудникаВКСО();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	
	Закрыть(ВозможныеОперации.ЗавершитьРаботу);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЧек(Команда)
	
	Закрыть(ВозможныеОперации.ПроверитьЧек);
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяВРежимКассыСамообслуживания(Команда)
	
	Закрыть(ВозможныеОперации.ПродолжитьРаботу);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбучениеУстройствРаспознавания(Команда)
	
	Закрыть(ВозможныеОперации.ОбучитьУстройстваРаспознавания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОткрытьКассовуюСмену(Команда)

	Закрыть(ВозможныеОперации.ЗакрытьОткрытьКассовуюСмену);

КонецПроцедуры

&НаКлиенте
Процедура Заблокировать(Команда)
	
	Закрыть(ВозможныеОперации.ЗаблокироватьКСО);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтогов(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеСверкиИтоговЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Уверены, что хотите выполнить сверку итогов?'");
	ЗаголовокВопроса = НСтр("ru='Сверка итогов'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьКомандуУправленияКассовойСменой()
	
	Если ЗначениеЗаполнено(ПараметрыКассовойСмены.КассаККМ) Тогда
		Сутки = 86400;
		ДатаТекущая = ТекущаяДатаСеанса();
		СменаАктуальна = ПараметрыКассовойСмены.СменаОткрыта;
		ВремяНачалаСменыВСекундах = ПараметрыКассовойСмены.ВремяНачалаСмены - Дата(1, 1, 1);
		МинимальнаяДатаНачалаСмены = НачалоДня(ДатаТекущая) + ВремяНачалаСменыВСекундах;
		Если ДатаТекущая < МинимальнаяДатаНачалаСмены Тогда
			МинимальнаяДатаНачалаСмены = МинимальнаяДатаНачалаСмены - Сутки;
		КонецЕсли;
		
		Если СменаАктуальна И (ДатаТекущая - ПараметрыКассовойСмены.НачалоКассовойСмены >= Сутки
				Или ПараметрыКассовойСмены.НачалоКассовойСмены < МинимальнаяДатаНачалаСмены) Тогда
			СменаАктуальна = Ложь;
		КонецЕсли;
		НачалоЗаголовка = НСтр("ru = 'Кассовая смена'");
		ПродолжениеЗаголовка = ?(ПараметрыКассовойСмены.СменаОткрыта,
			Формат(ПараметрыКассовойСмены.НачалоКассовойСмены, ""),
			НСтр("ru = 'закрыта'"));
		ЗаголовокКнопки = СтрШаблон("%1 (%2)", НачалоЗаголовка, ПродолжениеЗаголовка);
		
		Если СменаАктуальна Тогда
			Элементы.ЗакрытьОткрытьКассовуюСмену.ЦветТекста = ЦветаСтиля.ЦветТекстаПоложительногоЗначения;
		Иначе
			Элементы.ЗакрытьОткрытьКассовуюСмену.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекстаРМК;
		КонецЕсли;
		Элементы.ЗакрытьОткрытьКассовуюСмену.Заголовок = ЗаголовокКнопки;
		Элементы.ЗакрытьОткрытьКассовуюСмену.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьЗначенияВходныхПараметров()
	
	ТекущаяНастройкаРМК = Параметры.ТекущаяНастройкаРМК;
	ПараметрыКассовойСмены = Параметры.ПараметрыКассовойСмены;
	ПодключенаОблачнаяККТ = Параметры.ПодключенаОблачнаяККТ;
	Для Каждого СтрокаТерминала Из Параметры.ОборудованиеДляСверки Цикл
		НоваяСтрока = ОборудованиеДляСверки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТерминала);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеСверкиИтоговЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьСверкуИтоговКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтоговКлиент()
	
	Для Каждого СтрокаТерминала Из ОборудованиеДляСверки Цикл
		
		Доступность = Ложь;
		Оповещение = Новый ОписаниеОповещения("ВыполнитьСверкуИтоговЗавершение", ЭтотОбъект);
		
		ЭквайринговыйТерминал = СтрокаТерминала.Терминал;
		ПараметрыОперации = МенеджерОборудованияРМККлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
		ПечатающееУстройство = СтрокаТерминала.ККМ;
		Если ПодключенаОблачнаяККТ Тогда
			ПараметрыОперации.ИспользоватьПечатающееУстройство = Ложь;
			ПечатающееУстройство = Неопределено;
		КонецЕсли;
		МенеджерОборудованияРМККлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(Оповещение,
			Неопределено, ЭквайринговыйТерминал, ПараметрыОперации, , ПечатающееУстройство);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтоговЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт 
	
	Доступность = Истина;
	
	Если ЕстьСвойство(РезультатВыполнения, "Результат") И НЕ РезультатВыполнения.Результат Тогда
		
		ТекстЗаголовка = НСтр("ru = 'При выполнении операции произошла ошибка'");
		ТекстСообщения = НСтр("ru = '""%ОписаниеОшибки%"".
										|Операция сверки итогов не была проведена.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстСообщения, ТекстЗаголовка);
		ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Сверка итогов выполнена.'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьСвойство(Объект, ИмяРеквизита)
	Возврат ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(Объект, ИмяРеквизита);
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуСообщенияОбОшибке(ПараметрыДляОткрытия)
	
	//ОбработкаОповещения = Новый ОписаниеОповещения("ЗакрытиеСообщенияОбОшибке", ЭтотОбъект, ДополнительныеПараметры);
	ОбработкаОповещения = Неопределено;
	
	ПараметрыДляОткрытия.Вставить("РежимКассыСамообслуживания", РежимКассыСамообслуживания);
	ПараметрыДляОткрытия.Вставить("УвеличенныйВариантМасштаба", УвеличенныйВариантМасштаба);
	ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыДляОткрытия, ОбработкаОповещения);
	
КонецПроцедуры

#КонецОбласти