#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Эквайринг
	Если НЕ Параметры.СписокОтбораПоВидамОпераций = Перечисления.ВидыОперацийПриходнаяНакладная.ПустаяСсылка() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидОперации",
			Параметры.СписокОтбораПоВидамОпераций, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	КонецЕсли;
	// Конец Эквайринг
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	АдаптацияФормыТакси()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Интерфейс8_5 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Элементы.Список.ОтображатьКоманднуюПанель = Интерфейс8_5;
	
КонецПроцедуры

#КонецОбласти
