
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаПредставление = ОбщегоНазначенияРМК.ПредставлениеВалюты();
	
	Параметры.Свойство("Заголовок",             ЭтотОбъект.Заголовок);
	Параметры.Свойство("АктивацияNFC",          АктивацияNFC);
	Параметры.Свойство("РежимКСО",              РежимКСО);
	Параметры.Свойство("ЗапретитьОткладывание", ЗапретитьОткладывание);
	
	ПлатежнаяСистема = Параметры.ПлатежнаяСистема;
	
	ПереданныеПараметры = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПараметрыИнициализации();
	ЗаполнитьЗначенияСвойств(ПереданныеПараметры, Параметры);
	
	ТипыПлатежныхСистем = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ПолучитьТипыПлатежныхСистем();
	Если ПлатежнаяСистема = ТипыПлатежныхСистем.ЮКасса Тогда
		Если Не ПереданныеПараметры.ВидОперацииПродажа Тогда
			ТекстОшибки = НСтр("ru = 'Возврат платежной системой ЮKassa запрещен.
									|Выполните возврат другим видом оплаты.'");
			Возврат;
		ИначеЕсли ПереданныеПараметры.Оплачивается Тогда
			ТекстОшибки = НСтр("ru = 'Оплачиваемый документ был отложен другим видом оплаты.'");
			Возврат;
		Иначе
			ЗапретитьОткладывание = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Параметры.Свойство("РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы") Тогда
		ПереданныеПараметры.РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы = 
			Пользователи.РолиДоступны("РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы");
	КонецЕсли;
	
	Если ПереданныеПараметры.ВидОперацииПродажа Тогда
		ПереданныеПараметры.ДокументОплаты   = Параметры.Документ;
	Иначе
		ПереданныеПараметры.ДокументВозврата = Параметры.Документ;
		ПереданныеПараметры.ДокументОплаты   = Параметры.ДокументОплаты;
	КонецЕсли;
	
	ПереданныеПараметры.ИтогПоОрганизации = Параметры.СуммаОперации;
	ПереданныеПараметры.НомерДокумента    = 1;
	
	СуммаКОплате = Параметры.СуммаОперации;
	
	НастройкиИнтеграции = Неопределено;
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ЗаполнитьНастройкиИнтеграцииПлатежныхСистем(
		НастройкиИнтеграции, ПереданныеПараметры.Организация, ПереданныеПараметры.Магазин);
	
	Если НастройкиИнтеграции <> Неопределено Тогда
		
		Если ПереданныеПараметры.Оплачивается Тогда
			
			Если ПереданныеПараметры.ВидОперацииПродажа Тогда
				ОтложенныйДокумент = ПереданныеПараметры.ДокументОплаты;
			Иначе
				ОтложенныйДокумент = ПереданныеПараметры.ДокументВозврата;
			КонецЕсли;
			
			НастройкиИнтеграцииДокумента = Неопределено;
			ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ПолучитьНастройкиИнтеграцииОтложенногоДокумента(НастройкиИнтеграцииДокумента, ОтложенныйДокумент);
			
			Если НастройкиИнтеграцииДокумента <> Неопределено Тогда
				НастройкиИнтеграции = НастройкиИнтеграции.Скопировать(Новый Структура("Интеграция", НастройкиИнтеграцииДокумента));
			Иначе
				ТекстОшибки = НСтр("ru = 'Не удалось определить настройки оплачиваемого документа.'");
				Возврат;
			КонецЕсли;
			
		Иначе
			
			Если Не ПереданныеПараметры.ВидОперацииПродажа Тогда
				
				ПараметрыВозврата = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ПолучитьПараметрыДокументаОплаты(
					ПереданныеПараметры.ДокументОплаты);
				
				Если ЗначениеЗаполнено(ПараметрыВозврата.ВидОплатыВозврата) Тогда
					
					ПлатежнаяСистема_ИдентификаторОплаты = ПараметрыВозврата.ИдентификаторОплаты;
					ПлатежнаяСистема_ИдентификаторПС     = ПараметрыВозврата.ИдентификаторПС;
					
					ЗаполнитьЗначенияСвойств(ПереданныеПараметры, ПараметрыВозврата);
					
					ОтборНастроек = Новый Структура("СпособОплаты,ИдентификаторПС",
						ПараметрыВозврата.СпособОплаты, ПараметрыВозврата.ИдентификаторПС);
					НастройкиИнтеграции = НастройкиИнтеграции.Скопировать(ОтборНастроек);
					
					Если НастройкиИнтеграции.Количество() > 0
						И НастройкиИнтеграции[0].ПлатежнаяСистема = ТипыПлатежныхСистем.ЮКасса Тогда
							ТекстОшибки = НСтр("ru = 'Документ был оплачен платежной системой ЮKassa.
													|Выполните возврат другим видом оплаты.'");
							Возврат;
					КонецЕсли;
					
				КонецЕсли;
				
				ЮридическоеЛицо = Ложь;
				ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.КонтрагентДокументаЮридическоеЛицо(
					ЮридическоеЛицо, ПереданныеПараметры.ДокументВозврата);
				Если ЮридическоеЛицо Тогда
					ТекстОшибки = НСтр("ru='Не поддерживается возврат СБП для юридических лиц.'");
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекстОшибки = НСтр("ru = 'Не удалось определить настройки интеграции с платежной системой. Операция не выполнена'");
		Возврат;
		
	КонецЕсли;
	
	КлючПС = Новый Структура("ПлатежнаяСистема", ПлатежнаяСистема);
	НастройкиИнтеграции = НастройкиИнтеграции.Скопировать(КлючПС);
	
	Если НастройкиИнтеграции.Количество() = 0 Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru='Не настроена интеграция для платежной системы %1.'"), Строка(ПлатежнаяСистема));
		Возврат;
	КонецЕсли;
	
	ПлатежнаяСистема_ВидыОплат.Загрузить(НастройкиИнтеграции);
	
	Если РежимКСО Тогда
		Если ПлатежнаяСистема_ВидыОплат.Количество() <> 1 Тогда
			ТекстОшибки = НСтр("ru = 'Не определен идентификатор оплаты платежной системы в режиме КСО.'");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПереданныеПараметры.ВидОперацииПродажа Тогда
		
		ШаблонДекорации = НСтр("ru = 'Сумма оплаты: %1 %2'");
		Элементы.ДекорацияСуммаЧека.Заголовок = СтрШаблон(
			ШаблонДекорации, 
			Формат(ПереданныеПараметры.ИтогПоОрганизации, "ЧДЦ=2; ЧГ="), 
			ВалютаПредставление);
			
	Иначе
		
		Для Каждого СтрокаВидОплаты Из ПлатежнаяСистема_ВидыОплат Цикл
			Элементы.ПлатежнаяСистема_ИдентификаторПС.СписокВыбора.Добавить(СтрокаВидОплаты.ИдентификаторПС, СтрокаВидОплаты.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПлатежнаяСистема_ВидыОплат.Количество() = 1 Тогда
		
		ПлатежнаяСистема_ВидОплаты       = ПлатежнаяСистема_ВидыОплат[0].ВидОплаты;
		ПлатежнаяСистема_ИдентификаторПС = ПлатежнаяСистема_ВидыОплат[0].ИдентификаторПС;
		СпособОплатыПлатежнойСистемы     = ПлатежнаяСистема_ВидыОплат[0].СпособОплаты;
		
		ПереданныеПараметры.Вставить("ВидОплатыПлатежнойСистемы",    ПлатежнаяСистема_ВидОплаты);
		ПереданныеПараметры.Вставить("ИдентификаторПС",              ПлатежнаяСистема_ИдентификаторПС);
		ПереданныеПараметры.Вставить("СпособОплатыПлатежнойСистемы", СпособОплатыПлатежнойСистемы);
		
	КонецЕсли;
	
	ОбщегоНазначенияРМКПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ПараметрыСтраницы = Новый Структура("СообщениеОбОшибке", ТекстОшибки);
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаОшибка", ПараметрыСтраницы);
		Возврат;
		
	КонецЕсли;
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ИнициализироватьПараметры(
		ЭтотОбъект,
		ПереданныеПараметры,
		ПлатежнаяСистема_ВидыОплат);
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ЗапуститьФоновыеЗадания(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ТекущийСлой = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьТекущийСлойГруппы(
		Элементы.ГруппаСлоевПанелиДействийПлатежнойСистемы);
		
	Если ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ТекущаяСтраница(Элементы.ГруппаОшибка, ТекущийСлой) Тогда
		ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
	ИначеЕсли ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ТекущаяСтраница(Элементы.ГруппаЗавершение, ТекущийСлой)
		И Не ПлатежнаяСистема_СанкционированноеЗакрытие Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОбработкаПрерыванияОперацииПлатежнойСистемы(ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "Штрихкод" Или ИмяСобытия = "ПолученШтрихкод" Или ИмяСобытия = "ScanData" Тогда
			
			Штрихкод = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			
			Если ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьТекущийСлойГруппы(
				Элементы.ГруппаСлоевПанелиДействийПлатежнойСистемы) = Элементы.ГруппаОсновнаяСтраница
				И Элементы.ГруппаВозврат.Видимость
				И Элементы.ИдентификаторОплаты.Видимость Тогда
				
				ПлатежнаяСистема_ИдентификаторОплаты = Штрихкод;
				ИдентификаторОплатыПриИзменении(Элементы.ИдентификаторОплаты);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлатежнаяСистемаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ПодобратьПлатежнуюСистему(ДанныеВыбора, Текст);
	
	Если ДанныеВыбора.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторОплатыПриИзменении(Элемент)
	
	ПлатежнаяСистема_НоваяЗаявка.ИдентификаторОплаты = ПлатежнаяСистема_ИдентификаторОплаты;
	Элементы.ФормаВозвратПлатежа.Доступность = ЗначениеЗаполнено(ПлатежнаяСистема_НоваяЗаявка.ИдентификаторОплаты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСоздатьQRКод(Команда)
	
	Если ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа Тогда
		
		ТекущаяСтрока = Элементы.ВидыОплатПС.ТекущаяСтрока;
		
		Если ТекущаяСтрока = Неопределено Тогда
			
			ПоказатьПредупреждение(, НСтр("ru = 'Не выбран способ оплаты'"));
			Возврат;
			
		КонецЕсли;
		
		ПлатежнаяСистема_ВидОплаты       = ПлатежнаяСистема_ВидыОплат.НайтиПоИдентификатору(ТекущаяСтрока).ВидОплаты;
		ПлатежнаяСистема_ИдентификаторПС = ПлатежнаяСистема_ВидыОплат.НайтиПоИдентификатору(ТекущаяСтрока).ИдентификаторПС;
		СпособОплатыДокумента            = ПлатежнаяСистема_ВидыОплат.НайтиПоИдентификатору(ТекущаяСтрока).СпособОплаты;
		
		ПлатежнаяСистема_НоваяЗаявка.Вставить("ВидОплатыПлатежнойСистемы",    ПлатежнаяСистема_ВидОплаты);
		ПлатежнаяСистема_НоваяЗаявка.Вставить("ИдентификаторПС",              ПлатежнаяСистема_ИдентификаторПС);
		ПлатежнаяСистема_НоваяЗаявка.Вставить("СпособОплатыПлатежнойСистемы", СпособОплатыДокумента);
		
		ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.НастроитьФормуПоВидуОплаты(ЭтотОбъект, ПлатежнаяСистема_ВидыОплат);
		
		ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
			НСтр("ru = 'Получение QR-кода оплаты платежной системы. Пожалуйста, подождите...'"));
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
		ПодключитьОбработчикОжидания("ПолучитьИдентификаторОплаты", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВозвратПлатежа(Команда)
	
	Если Не ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа Тогда
		
		Если ЗначениеЗаполнено(ПлатежнаяСистема_ИдентификаторОплаты) Тогда
			
			ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
				НСтр("ru = 'Выполнение возврата в платежной системе. Пожалуйста, подождите...'"));
			ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
			ПодключитьОбработчикОжидания("ВыполнитьВозвратПлатежнойСистемой", 0.1, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьВозврат(Команда)
	
	ШаблонПояснения = НСтр("ru = 'Операция возврата в платежной системе не выполнена!
									|Подтвердить возврат оплаты принудительно?
									|
									|Сумма операции: %1 %2
									|'");
	
	ТекстПредупреждения  = НСтр("ru = 'Проверьте выполнение операции возврата платежной системы.'");
	ПояснениеПредупреждения = СтрШаблон(
		ШаблонПояснения,
		ПлатежнаяСистема_НоваяЗаявка.ИтогПоОрганизации,
		ВалютаПредставление);
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ВывестиИнформацию(
		ЭтотОбъект,
		ТекстПредупреждения,
		ПояснениеПредупреждения,
		"ГруппаПодтверждениеОплатыВозврата");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПовторить(Команда)
	
	Если ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа Тогда
		Если ПлатежнаяСистема_НоваяЗаявка.Оплачивается Тогда
			ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
				НСтр("ru = 'Получение подтверждения оплаты. Пожалуйста, подождите...'"));
			ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
		Иначе
			ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаQRКод");
		КонецЕсли;
		ПодключитьОбработчикОжидания("ОпределитьСтатусОплаты", 0.1, Истина);
	Иначе
		ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
			НСтр("ru = 'Получение подтверждения возврата оплаты. Пожалуйста, подождите...'"));
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
		ПодключитьОбработчикОжидания("ОпределитьСтатусВозврата", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьОплату(Команда)
	
	ШаблонПояснения = НСтр("ru = 'Операция оплаты в платежной системе не выполнена!
									|Подтвердить получение оплаты принудительно?
									|
									|Сумма операции: %1 %2
									|'");
	
	ТекстПредупреждения  = НСтр("ru = 'Проверьте выполнение операции оплаты платежной системы.'");
	ПояснениеПредупреждения = СтрШаблон(
		ШаблонПояснения,
		ПлатежнаяСистема_НоваяЗаявка.ИтогПоОрганизации,
		ВалютаПредставление);
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ВывестиИнформацию(
		ЭтотОбъект,
		ТекстПредупреждения,
		ПояснениеПредупреждения,
		"ГруппаПодтверждениеОплатыВозврата");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтложить(Команда)
	
	ОповещениеЗавершитьОперацию = Новый ОписаниеОповещения("ЗавершитьОплатуВозвратПлатежнойСистемой", ЭтотОбъект);
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОтложитьЧек(
		ЭтотОбъект,
		ОповещениеЗавершитьОперацию);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьОплату(Команда)
	
	ПрерватьОперациюСОтменой();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрытьОплату(Команда)
	
	ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрытьПринудительно(Команда)
	
	ПрерватьОперациюСОтменой();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтложитьПринудительно(Команда)
	
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьТекущийСлойГруппы(Элементы.ГруппаПанельДействий);
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОтложитьОперацию(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ЗавершитьОплатуВозвратПлатежнойСистемой", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьОплатуВозвратПринудительно(Команда)
	
	ОплатаВозвратЗавершение = Новый ОписаниеОповещения("ОплатаВозвратЗавершение", ЭтотОбъект);
	
	Если Не ПлатежнаяСистема_НоваяЗаявка.РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы Тогда
		
		ОперацияПлатежнойСистемы = ?(ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа, "Оплата", "Возврат");
		
		ИнтеграцияСПлатежнымиСистемамиРМККлиентПереопределяемый.ПодтверждениеПравНаОперациюПлатежнойСистемы(
			ОперацияПлатежнойСистемы, ОплатаВозвратЗавершение);
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ОплатаВозвратЗавершение, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПречек(Команда)
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПечатьПречека(
		ЭтотОбъект, Истина, ПлатежнаяСистема_НоваяЗаявка.ПодключаемоеОборудование);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнструкция(Команда)
	
	Если ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьТекущийСлойГруппы(
		Элементы.ГруппаСлоевПанелиДействийПлатежнойСистемы) <> Элементы.ГруппаИнструкция Тогда
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаИнструкция");
	Иначе
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, ТекущийСлойГруппы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВернутьсяКОплате(Команда)
	
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьТекущийСлойГруппы(Элементы.ГруппаПанельДействий);
	ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.НастроитьФормуПоИнтеграции(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФоновыеОбработчики

&НаКлиенте
Процедура ПолучитьИдентификаторОплаты()
	
	ПечатьQRКода = Не РежимКСО И Не ИспользоватьКассовуюСсылку;
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПолучитьИдентификаторОплаты(
		ЭтотОбъект,
		ПечатьQRКода);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьСтатусОплаты()
	
	ОповещениеЗавершитьОперацию = Новый ОписаниеОповещения("ЗавершитьОплатуВозвратПлатежнойСистемой", ЭтотОбъект);
	КоличествоПовторов = ?(ПлатежнаяСистема_НоваяЗаявка.Оплачивается, 1, 3);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершитьОперацию", ОповещениеЗавершитьОперацию);
	ДополнительныеПараметры.Вставить("КоличествоПовторов",          КоличествоПовторов);
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОпределитьСтатусОплаты(
		ЭтотОбъект,
		ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВозвратПлатежнойСистемой()
	
	ОповещениеЗавершитьОперацию = Новый ОписаниеОповещения("ЗавершитьОплатуВозвратПлатежнойСистемой", ЭтотОбъект);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершитьОперацию", ОповещениеЗавершитьОперацию);
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ВозвратОплаты(
		ЭтотОбъект,
		ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьСтатусВозврата()
	
	ОповещениеЗавершитьОперацию = Новый ОписаниеОповещения("ЗавершитьОплатуВозвратПлатежнойСистемой", ЭтотОбъект);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершитьОперацию", ОповещениеЗавершитьОперацию);
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОпределитьСтатусВозврата(
		ЭтотОбъект,
		ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗавершитьОплатуВозвратПлатежнойСистемой(Действие, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Действие = "ОтложитьЧек" Тогда
		
		ПодключитьОбработчикОжидания("ОтложитьОплачиваемыйЧекПлатежнойСистемой", 2, 1);
		
	ИначеЕсли Действие = "ОтменитьЧек" Тогда
		
		ПодключитьОбработчикОжидания("ОтменитьОплатуПлатежнойСистемой", 2, 1);
		
	ИначеЕсли Действие = "ДобавитьВидОплаты" Тогда
		
		ПлатежнаяСистема_НоваяЗаявка.БылоПодтверждениеПлатежнойСистемы = Истина;
		ПодключитьОбработчикОжидания("ЗавершитьОплатуПлатежнойСистемой", 2, 1);
		
	ИначеЕсли Действие = "ДобавитьВидОплатыРучноеПодтверждение" Тогда
		
		ПодключитьОбработчикОжидания("ЗавершитьОплатуПлатежнойСистемой", 2, 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОплатуПлатежнойСистемой()
	
	ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
	
	Если ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа Тогда
		Документ = ПлатежнаяСистема_НоваяЗаявка.ДокументОплаты;
	Иначе
		Документ = ПлатежнаяСистема_НоваяЗаявка.ДокументВозврата;
	КонецЕсли;
	
	Если ПлатежнаяСистема_НоваяЗаявка.БылоПодтверждениеПлатежнойСистемы Тогда
		
		СсылочныйНомерСБП = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ИдентификаторыОперацииОплаты(
			ПлатежнаяСистема_НоваяЗаявка.Интеграция,
			Документ);
		
		СсылочныйНомер = ?(ЗначениеЗаполнено(СсылочныйНомерСБП),
			СсылочныйНомерСБП, ПлатежнаяСистема_НоваяЗаявка.СсылочныйНомер);
		
	Иначе
		
		СсылочныйНомер = "";
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Действие",                      "ЗавершитьОплату");
	Результат.Вставить("ВидОплаты",                     ПлатежнаяСистема_ВидОплаты);
	Результат.Вставить("СсылочныйНомер",                СсылочныйНомер);
	Результат.Вставить("ИдентификаторПлатежнойСистемы", ПлатежнаяСистема_ИдентификаторПС);
	Результат.Вставить("ЭквайринговыйТерминал",         ПлатежнаяСистема_НоваяЗаявка.СпособОплатыПлатежнойСистемы);
	Результат.Вставить("Сумма",                         ПлатежнаяСистема_НоваяЗаявка.СуммаОперации);
	Результат.Вставить("Документ",                      Документ);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОплатуПлатежнойСистемой()
	
	ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
	
	Результат = Новый Структура;
	Результат.Вставить("Действие",  "ОтменитьОплату");
	Результат.Вставить("ВидОплаты", ПлатежнаяСистема_ВидОплаты);
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложитьОплачиваемыйЧекПлатежнойСистемой()
	
	ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
		
	Если ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа Тогда
		ОтложенныйЧек = ПлатежнаяСистема_НоваяЗаявка.ДокументОплаты;
	Иначе
		ОтложенныйЧек = ПлатежнаяСистема_НоваяЗаявка.ДокументВозврата;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Действие",      "ОтложитьЧек");
	Результат.Вставить("ОтложенныйЧек", ОтложенныйЧек);
	Результат.Вставить("ВидОплаты",     ПлатежнаяСистема_ВидОплаты);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьОперациюСОтменой()
	
	ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
		НСтр("ru = 'Отмена операции. Пожалуйста, подождите...'"));
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
	
	ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
	
	ОповещениеЗавершитьОтмену = Новый ОписаниеОповещения("ЗавершитьОплатуВозвратПлатежнойСистемой", ЭтотОбъект);
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОтменитьОперацию(ЭтотОбъект, ОповещениеЗавершитьОтмену);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаВозвратЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат Тогда
		
		ОповещениеЗавершитьОперацию = Новый ОписаниеОповещения("ЗавершитьОплатуВозвратПлатежнойСистемой", ЭтотОбъект);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма",                       ЭтотОбъект);
		ДополнительныеПараметры.Вставить("ОповещениеЗавершитьОперацию", ОповещениеЗавершитьОперацию);
		
		Если ПлатежнаяСистема_НоваяЗаявка.ВидОперацииПродажа Тогда
			ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПодтвердитьОплату(ЭтотОбъект, ДополнительныеПараметры);
		Иначе
			ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПодтвердитьВозврат(ЭтотОбъект, ДополнительныеПараметры);
		КонецЕсли;
		
	Иначе
		
		Элементы.ДекорацияТекстПодтверждениеОплатыОшибка.Заголовок = НСтр(
			"ru = 'Подтверждение прав на выполнение операции не выполнено.'");
		
		ПодключитьОбработчикОжидания("СкрытьОшибкиПлатежнойСистемы", 5, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьОшибкиПлатежнойСистемы()
	
	Элементы.ДекорацияТекстПодтверждениеОплатыОшибка.Заголовок = "";
	
КонецПроцедуры

#КонецОбласти

