#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ОтборВидаЦен;
	
	Если Параметры.Свойство("ВидЦены", ОтборВидаЦен) <> Истина Или Не ЗначениеЗаполнено(ОтборВидаЦен) Тогда
		
		ВызватьИсключение НСтр("ru ='Самостоятельное использование формы не предусмотрено.'"); 
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПрайсЛисты, "ВидыЦен.ВидЦен", ОтборВидаЦен,
		ВидСравненияКомпоновкиДанных.Равно, "ВидЦен", Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПрайсЛистыСоздать", 
			"Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПрайсЛистыСкопировать", 
			"Видимость", Ложь); 	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПрайсЛистыДействияСтрокиСкопировать", 
			"Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПрайсЛистыДействияСтрокиИзменить", 
			"Видимость", Ложь);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьПрайсЛист(Команда)
	
	ДанныеТекущейСтроки = Элементы.ПрайсЛисты.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ПрайсЛистыОрганизации.Форма", Новый Структура("ПрайсЛист", ДанныеТекущейСтроки.Ссылка),
		ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
