#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок           = Параметры.Заголовок;
	ВыбранныеЗначения   = Параметры.ВыбранныеЗначения;
	ДоступныеЗначения   = Параметры.ДоступныеЗначения;
	ЗначениеОграничения = Параметры.ЗначениеОграничения;
	
	ЗаполнитьПредставленияЗначенийСписка(ВыбранныеЗначения);
	ЗаполнитьПредставленияЗначенийСписка(ДоступныеЗначения);
	
	ДоступныеЗначения.СортироватьПоПредставлению();
	ВыбранныеЗначения.СортироватьПоПредставлению();
	
	СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницу =
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииОбязательнойОнлайнПроверкиПередРозничнойПродажейНаДату();
	
	КоличествоВключенныхТоварныхГрупп           = СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницу.Количество();
	ВедетсяУчетТГТребующихОбязательногоКонтроля = КоличествоВключенныхТоварныхГрупп > 0;
	
	Элементы.ГруппаИнформация.Видимость         = Параметры.ПоказыватьПодсказкуОграниченияИсключений И ВедетсяУчетТГТребующихОбязательногоКонтроля;
	
	Если Элементы.ГруппаИнформация.Видимость Тогда
	
		ТекстКомментария = 
			НСтр("ru = 'При розничной продаже невозможно отключение контроля в ГИС МТ согласно
			           |ФЗ № 381-ФЗ «Об основах торговой деятельности в Российской Федерации»'");
		
		Элементы.Комментарий.Заголовок = ТекстКомментария;
		
	КонецЕсли;
	
	СтандартныеПодсистемыСервер.СброситьРазмерыИПоложениеОкна(ЭтотОбъект);
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВПанельАдминистрированияИСМП" Тогда
		
		ИмяФормыНастройкиИСМП = "Обработка.ПанельАдминистрированияИСМП.Форма.НастройкиИСМП";
		
		ОткрытьФорму(ИмяФормыНастройкиИСМП);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеЗначения

&НаКлиенте
Процедура ДоступныеЗначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПереместитьЭлемент(Элементы.ДоступныеЗначения.Имя, Элементы.ВыбранныеЗначения.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыбранныеЗначения

&НаКлиенте
Процедура ВыбранныеЗначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПереместитьЭлемент(Элементы.ВыбранныеЗначения.Имя, Элементы.ДоступныеЗначения.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЭлемент(Команда)
	
	ПереместитьЭлемент(Элементы.ДоступныеЗначения.Имя, Элементы.ВыбранныеЗначения.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсеЭлементы(Команда)
	
	ПереместитьВсеЭлементы(Элементы.ДоступныеЗначения.Имя, Элементы.ВыбранныеЗначения.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлемент(Команда)
	
	ПереместитьЭлемент(Элементы.ВыбранныеЗначения.Имя, Элементы.ДоступныеЗначения.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЭлементы(Команда)
	
	ПереместитьВсеЭлементы(Элементы.ВыбранныеЗначения.Имя, Элементы.ДоступныеЗначения.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	ВыбранныеЗначения.СортироватьПоПредставлению();
	Закрыть(ВыбранныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДоступныеВидыПродукцииЗначение");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ДоступныеВидыПродукцииЗначение.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = ЗначениеОграничения;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВыбранныеВидыПродукцииЗначение");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ВыбранныеВидыПродукцииЗначение.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = ЗначениеОграничения;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПредставленияЗначенийСписка(Список)
	
	Для Каждого Элемент Из Список Цикл
		Если ЗначениеЗаполнено(Элемент.Представление) Тогда
			Продолжить;
		КонецЕсли;
		Элемент.Представление = Строка(Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлемент(ИмяИсточника, ИмяПриемника)
	
	ОбрабатываемыеСтроки = Элементы[ИмяИсточника].ПолучитьСтрокиДляОбработки();
	
	Если ОбрабатываемыеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбработанныеСтроки = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из ОбрабатываемыеСтроки Цикл
		
		ТекущаяСтрока = ЭтотОбъект[ИмяИсточника].НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если ЗначениеОграничения.НайтиПоЗначению(ТекущаяСтрока.Значение) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтотОбъект[ИмяПриемника].Добавить(ТекущаяСтрока.Значение, ТекущаяСтрока.Представление);
		
		ОбработанныеСтроки.Добавить(ТекущаяСтрока);
		
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из ОбработанныеСтроки Цикл
		ЭтотОбъект[ИмяИсточника].Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	ЭтотОбъект[ИмяПриемника].СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВсеЭлементы(ИмяИсточника, ИмяПриемника)
	
	Если ЭтотОбъект[ИмяИсточника].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияДляУдаления = Новый Массив();
	
	Для Каждого ЭлементСписка Из ЭтотОбъект[ИмяИсточника] Цикл
		
		Если ЗначениеОграничения.НайтиПоЗначению(ЭлементСписка.Значение) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтотОбъект[ИмяПриемника].Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		
		ЗначенияДляУдаления.Добавить(ЭлементСписка.Значение);
		
	КонецЦикла;
	
	ЭтотОбъект[ИмяПриемника].СортироватьПоПредставлению();
	
	Для Каждого Элемент Из ЗначенияДляУдаления Цикл
		
		ЭтотОбъект[ИмяИсточника].Удалить(ЭтотОбъект[ИмяИсточника].НайтиПоЗначению(Элемент));
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
