#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСообщения = Объект.ПараметрыСообщения.Получить();
	Если ЗначениеЗаполнено(ПараметрыСообщения) И ПараметрыСообщения.Свойство("ИдентификаторФискальнойЗаписи") ТОгда
		КлючФискальнойЗаписи = КлючФискальнойОперации(ПараметрыСообщения.ИдентификаторФискальнойЗаписи);
		Если КлючФискальнойЗаписи = Неопределено Тогда
			Элементы.ФормаОткрытьФискальнуюЗапись.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтотОбъект.ТолькоПросмотр = Истина;
	
	Если ПустаяСтрока(Объект.ОписаниеОшибки) Тогда
		Элементы.ОписаниеОшибки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФискальнуюЗапись(Команда)
	// Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", КлючФискальнойЗаписи);
	ОткрытьФорму("РегистрСведений.ФискальныеОперации.ФормаЗаписи", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти


Функция КлючФискальнойОперации(ИдентификаторЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФискальныеОперации.ДокументОснование КАК ДокументОснование,
		|	ФискальныеОперации.ИдентификаторЗаписи КАК ИдентификаторЗаписи
		|ИЗ
		|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		|ГДЕ
		|	ФискальныеОперации.ИдентификаторЗаписи = &ИдентификаторЗаписи";
	
	Запрос.УстановитьПараметр("ИдентификаторЗаписи", ИдентификаторЗаписи);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("ДокументОснование", Выборка.ДокументОснование);
	ЗначенияКлюча.Вставить("ИдентификаторЗаписи", Выборка.ИдентификаторЗаписи);
	Возврат РегистрыСведений.ФискальныеОперации.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции
