
#Область ПрограммныйИнтерфейс

// Заполняет структуру дополнительных параметров операции на Оборудовании.
// 
// Параметры:
//  СтрокиТекста - Строка - строки текста для отображения.
//  ЗначениеQRКода - Строка, Неопределено - Значение QRКода
// 
// Возвращаемое значение:
//  Структура - Параметры операции дисплей покупателя:
//    * СтрокиТекста - Строка - Текстовая строка
//    * ЗначениеQRКода - Строка - значение QR кода
//    * КартинкаQRКода - Строка - строка с base64 представлением png картинки логотипа.
//    * Сумма - Число - Сумма операции.
//    * СтатусОперации - ПеречислениеСсылка.СтатусОперацииНаДисплее - Статус операции
//    * СтатусРабочегоМеста - ПеречислениеСсылка.СтатусРабочегоМестаНаДисплее  - Статус рабочего места
//    * ЗвуковойСигнал - Булево - Звуковой сигнал.
//    * ТекстHTML - Строка - строка с base64 представлением png картинки логотипа.
//    * НазваниеОрганизации - Строка - Название организации 
//    * Операция - Строка - выполняемая операция.
//    * ТипПлатежнойСистемы - ПеречислениеСсылка.ТипыПлатежнойСистемыККТ
//                          - Неопределено
//    * НаличнаяОплата - Булево - Наличная оплата.
//    * ДополнительныйТекст - Строка - Дополнительный текст.
//    * Сдача - Число - Сдача по операции. 
//    * ГотовностьКРаботе - Булево - Готовность кассы к работе.
//    * КартинкаBase64 - Строка - строка с base64 представлением png картинки логотипа. 
//    * КолонкиТабличнойЧасти - Массив из Структура
//    * ТабличнаяЧасть - Массив из Соответствие 
//    * Возврат - Булево - флаг того что операция является возвратом
//    * ПодвалСумма - Число - Сумма табличной части    
//    * ВнутренняяОперация - Булево - отображение на дисплее выполняется БПО
//
Функция ПараметрыОперацииДисплейПокупателя(СтрокиТекста = "", ЗначениеQRКода = Неопределено) Экспорт
	
	Возврат ОборудованиеДисплеиПокупателяКлиентСервер.ПараметрыОперацииДисплейПокупателя(СтрокиТекста, ЗначениеQRКода);
	
КонецФункции

Функция КнопкаДисплеяПокупателя(Идентификатор, Наименование = "") Экспорт
	
	Возврат ОборудованиеДисплеиПокупателяКлиентСервер.КнопкаДисплеяПокупателя(Идентификатор, Наименование);
	
КонецФункции

// Заполняет структуру параметров колонки табличной части дисплея покупателя.
// 
// Параметры:
//  Имя - Строка
//  Заголовок - Строка
//  Ширина - Число
//  Выравнивание - ГоризонтальноеПоложение
// Возвращаемое значение:
//  Структура -Параметры операции дисплей покупателя
//
Функция ПараметрыКолонкиТабличнойЧастиДисплеяПокупателя(Имя, Заголовок = "", Ширина = 0, Выравнивание = Неопределено) Экспорт
	
	Возврат ОборудованиеДисплеиПокупателяКлиентСервер.
		ПараметрыКолонкиТабличнойЧастиДисплеяПокупателя(Имя, Заголовок, Ширина, Выравнивание);
	
КонецФункции

// Подключенные дисплеи покупателя выводят QR код.
// 
// Возвращаемое значение:
//  Булево
//
Функция ПодключенныеДисплеиПокупателяВыводятQRКод() Экспорт
	
	Результат = Ложь;
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
	ПодключенныеУстройства = МенеджерОборудованияКлиент.ПолучитьПодключенныеУстройства(ПоддерживаемыеТипы);
	Если ПодключенныеУстройства.Количество() > 0 Тогда
		Для Каждого Устройство Из ПодключенныеУстройства Цикл
			Если Устройство.ДисплейОтображаетQRКод Или Устройство.ДисплейОтображаетГрафику Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции     

// Подключенные дисплеи покупателя выводят HTML.
// 
// Возвращаемое значение:
//  Булево
//
Функция ПодключенныеДисплеиПокупателяВыводятHTML() Экспорт
	
	Результат = Ложь;
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
	ПодключенныеУстройства = МенеджерОборудованияКлиент.ПолучитьПодключенныеУстройства(ПоддерживаемыеТипы);
	Если ПодключенныеУстройства.Количество() > 0 Тогда
		Для Каждого Устройство Из ПодключенныеУстройства Цикл
			Если Устройство.ДисплейОтображаетHTML Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Начать вывод тестовых строк на подключенные дисплеи покупателя.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет выведено на все.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьВыводИнформацииНаДисплейПокупателя(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Ждать ВывестиИнформациюНаДисплеиПокупателяАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		Для Каждого Результат Из Результаты Цикл
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Начать вывод тестовых строк на подключенные дисплеи покупателя.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет выведено на все.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьОтображениеИнформацииНаДисплейПокупателя(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Ждать ОтображениеИнформацииНаДисплеяхПокупателяАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		Для Каждого Результат Из Результаты Цикл
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

 // Начать вывод QR-кода на подключенные дисплеи покупателя.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет выведено на все
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьВыводQRКодаНаДисплейПокупателя(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Ждать ВывестиQRКодНаДисплеиПокупателяАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		Для Каждого Результат Из Результаты Цикл
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Начать вывод HTML на подключенные дисплеи покупателя.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет выведено на все
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьВыводHTMLНаДисплейПокупателя(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Ждать ВывестиHTMLНаДисплеиПокупателяАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		Для Каждого Результат Из Результаты Цикл
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Начать очистку подключенных дисплеев покупателя.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьОчисткуДисплеяПокупателя(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства = Неопределено, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Ждать ОчиститьДисплеиПокупателяАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		Для Каждого Результат Из Результаты Цикл
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Начать отображение статус операции на подключенные дисплеи покупателя.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет выведено на все
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьВыводСтатусаОперацииНаДисплейПокупателя(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Ждать ВывестиСтатусОперацииНаДисплеиПокупателя(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		Для Каждого Результат Из Результаты Цикл
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Начать отображение статуса рабочего места на подключенные дисплеи покупателя.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет выведено на все
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьВыводСтатусаРабочегоМестаНаДисплейПокупателя(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Ждать ВывестиСтатусРабочегоМестаНаДисплеиПокупателя(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		Для Каждого Результат Из Результаты Цикл
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Вывести тестовые строки на подключенные дисплеи покупателя.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ВывестиИнформациюНаДисплеиПокупателяАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Новый Массив;
	Команда = "DisplayText";
	Контекст = ОборудованиеДисплеиПокупателяКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
		ПодключенныеУстройства = МенеджерОборудованияКлиент.ПолучитьПодключенныеУстройства(ПоддерживаемыеТипы);
		Если ПодключенныеУстройства.Количество() > 0 Тогда
			Для Каждого Устройство Из ПодключенныеУстройства Цикл
				Контекст.ОсновноеУстройство = Устройство.ИдентификаторУстройства;
				Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
			КонецЦикла;
		КонецЕсли;
	Иначе
		Контекст.ОсновноеУстройство = Устройство;
		Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
	КонецЕсли;
	
	Возврат Результаты;
	
КонецФункции

 // Вывести QR-код на подключенные дисплеи покупателя.
//
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ВывестиQRКодНаДисплеиПокупателяАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Новый Массив;
	Команда = "DisplayQRCode";
	Контекст = ОборудованиеДисплеиПокупателяКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
		ПодключенныеУстройства = МенеджерОборудованияКлиент.ПолучитьПодключенныеУстройства(ПоддерживаемыеТипы);
		Если ПодключенныеУстройства.Количество() > 0 Тогда
			Для Каждого Устройство Из ПодключенныеУстройства Цикл
				Контекст.ОсновноеУстройство = Устройство.ИдентификаторУстройства;
				Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
			КонецЦикла;
		КонецЕсли;
	Иначе
		Контекст.ОсновноеУстройство = Устройство;
		Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
	КонецЕсли;
	
	Возврат Результаты;
	
КонецФункции

// Отображение информации на дисплеях покупателя.
//
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ОтображениеИнформацииНаДисплеяхПокупателяАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Новый Массив;
	Команда = "DisplayInfo";
	Контекст = ОборудованиеДисплеиПокупателяКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.ПодготовитьДанныеСервер = Истина;
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	ПараметрыОперации.Вставить("КодСтатусаРабочегоМеста", СтатусРабочегоМестаНаДисплее(ПараметрыОперации.СтатусРабочегоМеста));
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
		ПодключенныеУстройства = МенеджерОборудованияКлиент.ПолучитьПодключенныеУстройства(ПоддерживаемыеТипы);
		Если ПодключенныеУстройства.Количество() > 0 Тогда
			Для Каждого Устройство Из ПодключенныеУстройства Цикл
				Контекст.ОсновноеУстройство = Устройство.ИдентификаторУстройства;
				Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
			КонецЦикла;
		КонецЕсли;
	Иначе
		Контекст.ОсновноеУстройство = Устройство;
		Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
	КонецЕсли;
	
	Возврат Результаты;
	
КонецФункции

// Вывести HTML на подключенные дисплеи покупателя.
//
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ВывестиHTMLНаДисплеиПокупателяАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Новый Массив;
	Команда = "OutputHTML";
	Контекст = ОборудованиеДисплеиПокупателяКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
		ПодключенныеУстройства = МенеджерОборудованияКлиент.ПолучитьПодключенныеУстройства(ПоддерживаемыеТипы);
		Если ПодключенныеУстройства.Количество() > 0 Тогда
			Для Каждого Устройство Из ПодключенныеУстройства Цикл
				Контекст.ОсновноеУстройство = Устройство.ИдентификаторУстройства;
				Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
			КонецЦикла;
		КонецЕсли;
	Иначе
		Контекст.ОсновноеУстройство = Устройство;
		Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
	КонецЕсли;
	
	Возврат Результаты;
	
КонецФункции

// Очистить подключенные дисплеи покупателя.
//
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ОчиститьДисплеиПокупателяАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Новый Массив;
	Команда = "ClearText";
	Контекст = ОборудованиеДисплеиПокупателяКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
		ПодключенныеУстройства = МенеджерОборудованияКлиент.ПолучитьПодключенныеУстройства(ПоддерживаемыеТипы);
		Если ПодключенныеУстройства.Количество() > 0 Тогда
			Для Каждого Устройство Из ПодключенныеУстройства Цикл
				Контекст.ОсновноеУстройство = Устройство.ИдентификаторУстройства;
				Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
			КонецЦикла;
		КонецЕсли;
	Иначе
		Контекст.ОсновноеУстройство = Устройство;
		Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
	КонецЕсли;
	
	Возврат Результаты;
	
КонецФункции

// Отобразить статус операции на подключенных дисплеях покупателя.
//
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ВывестиСтатусОперацииНаДисплеиПокупателя(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Новый Массив;
	Команда = "DisplayStatus";
	Контекст = ОборудованиеДисплеиПокупателяКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	ПараметрыОперации.Вставить("КодСтатусОперации", СтатусОперацииНаДисплее(ПараметрыОперации.СтатусОперации));
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
		ПодключенныеУстройства = МенеджерОборудованияКлиент.ПолучитьПодключенныеУстройства(ПоддерживаемыеТипы);
		Если ПодключенныеУстройства.Количество() > 0 Тогда
			Для Каждого Устройство Из ПодключенныеУстройства Цикл
				Контекст.ОсновноеУстройство = Устройство.ИдентификаторУстройства;
				Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
			КонецЦикла;
		КонецЕсли;
	Иначе
		Контекст.ОсновноеУстройство = Устройство;
		Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
	КонецЕсли;
	
	Возврат Результаты;
	
КонецФункции

// Отобразить статус рабочего места на подключенных дисплеях покупателя.
//
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ВывестиСтатусРабочегоМестаНаДисплеиПокупателя(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Результаты = Новый Массив;
	Команда = "DisplayStatusRM";
	Контекст = ОборудованиеДисплеиПокупателяКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	ПараметрыОперации.Вставить("КодСтатусаРабочегоМеста", СтатусРабочегоМестаНаДисплее(ПараметрыОперации.СтатусРабочегоМеста));
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
		ПодключенныеУстройства = МенеджерОборудованияКлиент.ПолучитьПодключенныеУстройства(ПоддерживаемыеТипы);
		Если ПодключенныеУстройства.Количество() > 0 Тогда
			Для Каждого Устройство Из ПодключенныеУстройства Цикл
				Контекст.ОсновноеУстройство = Устройство.ИдентификаторУстройства;
				Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
			КонецЦикла;
		КонецЕсли;
	Иначе
		Контекст.ОсновноеУстройство = Устройство;
		Результаты.Добавить(Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации));
	КонецЕсли;
	
	Возврат Результаты;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Асинх Функция ВыбратьДисплейПокупателяАсинх() Экспорт
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
	РезультатВыбора = Ждать МенеджерОборудованияКлиент.ВыбратьУстройствоАсинх(
		ПоддерживаемыеТипы,
		НСтр("ru='Выберите дисплей покупателя'"),
		НСтр("ru='Дисплеи покупателя не подключены.'"), 
		НСтр("ru='Дисплеи покупателя не выбраны.'"));
		
	Если Не РезультатВыбора.Результат Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатВыбора.ИдентификаторУстройства;
	
КонецФункции

Асинх Функция ПриПодготовкеДанныхОперацииАсинх(ДанныеОперации, ПараметрыПодключения, Команда, ПараметрыОперации) Экспорт
	
КонецФункции

Асинх Функция ПриОбработкеРезультатовОперацииАсинх(ДанныеОперации, ПараметрыПодключения, Команда, РезультатОперации) Экспорт
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код статуса рабочего места на дисплее.
// 
// Параметры:    
//   СтатусРабочегоМеста - ПеречислениеСсылка.СтатусРабочегоМестаНаДисплее - Cтатус рабочего места на дисплее
//   
// Возвращаемое значение:
//   Число - Код статуса.
//
Функция СтатусРабочегоМестаНаДисплее(СтатусРабочегоМеста) Экспорт
	
	Если СтатусРабочегоМеста = Неопределено Тогда
		КодСтатуса = 0
	Иначе
		СтатусыРабочегоМеста = Новый Соответствие(); 
		СтатусыРабочегоМеста.Вставить(ПредопределенноеЗначение("Перечисление.СтатусРабочегоМестаНаДисплее.НеУстановлен")        , 0);
		СтатусыРабочегоМеста.Вставить(ПредопределенноеЗначение("Перечисление.СтатусРабочегоМестаНаДисплее.СервисныйРежим")      , 1);
		СтатусыРабочегоМеста.Вставить(ПредопределенноеЗначение("Перечисление.СтатусРабочегоМестаНаДисплее.РабочееМестоСвободно"), 2);
		СтатусыРабочегоМеста.Вставить(ПредопределенноеЗначение("Перечисление.СтатусРабочегоМестаНаДисплее.РабочееМестоРаботает"), 3);
		СтатусыРабочегоМеста.Вставить(ПредопределенноеЗначение("Перечисление.СтатусРабочегоМестаНаДисплее.ОшибкаНаРабочемМесте"), 4);
		КодСтатуса = СтатусыРабочегоМеста.Получить(СтатусРабочегоМеста);
	КонецЕсли;
	
	Возврат КодСтатуса;
	
КонецФункции    

// Код статуса операции на дисплее.
// 
// Параметры:    
//   СтатусОперации - ПеречислениеСсылка.СтатусОперацииНаДисплее - Cтатус операции на дисплее
//   
// Возвращаемое значение:
//   Число - Код статуса.
//
Функция СтатусОперацииНаДисплее(СтатусОперации) Экспорт
	
	Если СтатусОперации = Неопределено Тогда
		КодСтатуса = 0
	Иначе
		СтатусыОперации = Новый Соответствие(); 
		СтатусыОперации.Вставить(ПредопределенноеЗначение("Перечисление.СтатусОперацииНаДисплее.НеУстановлен")       , 0);
		СтатусыОперации.Вставить(ПредопределенноеЗначение("Перечисление.СтатусОперацииНаДисплее.ВыполненоУспешно")   , 1);
		СтатусыОперации.Вставить(ПредопределенноеЗначение("Перечисление.СтатусОперацииНаДисплее.ОперацияНеВыполнена"), 2);
		СтатусыОперации.Вставить(ПредопределенноеЗначение("Перечисление.СтатусОперацииНаДисплее.ОжиданиеОперации")   , 0);
		СтатусыОперации.Вставить(ПредопределенноеЗначение("Перечисление.СтатусОперацииНаДисплее.Информация")         , 0);
		КодСтатуса = СтатусыОперации.Получить(СтатусОперации);
	КонецЕсли;
	
	Возврат КодСтатуса;
	
КонецФункции

#КонецОбласти