
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если ЗначениеЗаполнено(Параметры.Сотрудник) Тогда
			Объект.Сотрудник = Параметры.Сотрудник;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда
			Объект.Организация = Параметры.Организация;
		КонецЕсли;
		
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		Если Не ЗначениеЗаполнено(Объект.НалоговыйПериод) Тогда
			Если Месяц(ТекущаяДатаСеанса) > 1 Тогда
				Год = Год(ТекущаяДатаСеанса);
			Иначе
				Год = Год(ТекущаяДатаСеанса) - 1;
			КонецЕсли;
			Объект.НалоговыйПериод = Год;
		КонецЕсли;
	
	КонецЕсли;
		
	ИспользуетсяРеглУчет = ИспользуетсяРеглУчетЗарплаты(Объект.Организация);	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Сотрудник) И ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.ПоДаннымРегламентированногоУчета = ИспользуетсяРеглУчет;
		СправкиПоНДФЛ.ЗаполнитьСправку2НДФЛПоСотруднику(Объект, Объект.ПоДаннымРегламентированногоУчета);
	КонецЕсли;
	
	ИспользоватьМногофирменныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Если Не ИспользоватьМногофирменныйУчет И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Организация.Гиперссылка = Истина;
	КонецЕсли;
	
	УправлениеФормой();

	АдаптацияФормыТакси();
	МобильныйКлиентУНФ.НастроитьФормуОбъектаМобильныйКлиент(Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьЗаголовокПодписи();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
	УстановитьЗаголовокПодписи();
КонецПроцедуры
        
&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СправкуПодписалПриИзменении(Элемент)
	УстановитьЗаголовокПодписи();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьДанные(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеглУчет(Команда)
	ЗаполнитьДанные(Истина);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ЭтоИнтерфейсТакси = НЕ ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ЭтоИнтерфейсТакси Тогда
		Элементы.ГруппаПодписи.ЦветТекстаЗаголовка = ЦветаСтиля.ГиперссылкаТабличнойЧасти;
		Элементы.ГруппаПодписи.ШрифтЗаголовка = ШрифтыСтиля.ОбычныйШрифтТекста;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.РегистрацияВНалоговомОргане = РегламентированнаяОтчетностьУСН.ПолучитьРегистрациюВИФНС(Объект.Организация);
		Объект.Телефон = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Объект.Организация,
			Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации, , ТекущаяДатаСеанса());
		Объект.КодНалоговогоОрганаПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация,
			"КодНалоговогоОрганаПолучателя");
		ЗаполнитьЗначенияСвойств(Объект, СправкиПоНДФЛ.ДанныеПодписывающихЛиц(Объект.Организация, Объект.Дата));
		ИспользуетсяРеглУчет = ИспользуетсяРеглУчетЗарплаты(Объект.Организация);
	Иначе
		Объект.РегистрацияВНалоговомОргане = Неопределено;
		Объект.Телефон = "";
		Объект.СправкуПодписал = "";
		ИспользуетсяРеглУчет = Ложь;
	КонецЕсли;
	
	Если НЕ ИспользуетсяРеглУчет Тогда
		Объект.ПоДаннымРегламентированногоУчета = Ложь;
	КонецЕсли;
	
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаполнитьРеглУчет",
		"Видимость", ИспользуетсяРеглУчет);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоДаннымРегламентированногоУчета",
		"Видимость", ИспользуетсяРеглУчет);
		
	ЗаголовокУпрУчет = ?(ИспользуетсяРеглУчет, НСтр("ru = 'Заполнить (упр. учет)'"), НСтр("ru = 'Заполнить'"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Заполнить", "Заголовок",
			ЗаголовокУпрУчет);
	УстановитьНастройкиФормыПоВидуУчета();
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	ТаблицаСотрудников = Новый ТаблицаЗначений;
	ТаблицаСотрудников.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаСотрудников.Колонки.Добавить("Ставка", Новый ОписаниеТипов("ПеречислениеСсылка.НДФЛСтавкиУНФ"));
	СтрокаСотрудника = ТаблицаСотрудников.Добавить();
	СтрокаСотрудника.Сотрудник = Объект.Сотрудник;
	СтрокаСотрудника.Ставка = Перечисления.НДФЛСтавкиУНФ.Ставка13;
	ДанныеСотрудника = СправкиПоНДФЛ.ДанныеСотрудников(ТаблицаСотрудников, Объект.Дата, Объект.НалоговыйПериод);
	Если ДанныеСотрудника.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(Объект,	ДанныеСотрудника[0]);
	КонецЕсли;
	ЗаполнитьНаСервере(ИспользуетсяРеглУчет);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользуетсяРеглУчетЗарплаты(Организация)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРегламентированныйУчетЗарплатыИКадров") Тогда
		
		ДанныеОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,
			"ИПИспользуетТрудНаемныхРаботников, ИспользуетсяОтчетность");
		
		Возврат (Истина = ДанныеОрганизации.ИспользуетсяОтчетность)
			И (Истина = ДанныеОрганизации.ИПИспользуетТрудНаемныхРаботников);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДанные(РеглУчет)
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заполнен сотрудник'"), , , , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заполнена организация'"), , , , Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере(РеглУчет);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(Знач РеглУчет)
	
	ДокСправка = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.СправкаНДФЛУНФ"));
	СправкиПоНДФЛ.ЗаполнитьСправку2НДФЛПоСотруднику(ДокСправка, РеглУчет);
	ЗначениеВРеквизитФормы(ДокСправка, "Объект");
	Объект.ПоДаннымРегламентированногоУчета = РеглУчет;
	УстановитьНастройкиФормыПоВидуУчета();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиФормыПоВидуУчета()
	
	Если Объект.ПоДаннымРегламентированногоУчета Тогда
		Элементы.СведенияОДоходахКодДохода.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыДоходовНДФЛ");
		Элементы.СведенияОДоходахКодВычета.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыВычетовНДФЛ");
		Элементы.СведенияОВычетахКодВычета.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыВычетовНДФЛ");
	Иначе
		Элементы.СведенияОДоходахКодДохода.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КодыДоходовНДФЛ");
		Элементы.СведенияОДоходахКодВычета.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВычетыНДФЛ");
		Элементы.СведенияОВычетахКодВычета.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВычетыНДФЛ");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокПодписи()
	
	Если ЗначениеЗаполнено(Объект.СправкуПодписал) Тогда
		Если СтрНайти(Объект.СправкуПодписал, ".") > 0 Тогда
			ФИОКратко = Объект.СправкуПодписал;
		Иначе
			ФИОКратко = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Объект.СправкуПодписал);
		КонецЕсли;
		ТекстПодписал = ФИОКратко;
	Иначе
		ТекстПодписал = НСтр("ru = '<Не указана>'");
	КонецЕсли;
	
	ШаблонЗаголовок = НСтр("ru = 'Подпись: %1'");
	Элементы.ГруппаПодписи.Заголовок = СтрШаблон(ШаблонЗаголовок, ТекстПодписал);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти