#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ТипЗнчДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнчДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;

	ДанныеОбъекта = ДанныеЗаполнения.ПолучитьОбъект();

	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнчДанныеЗаполнения);

	ЗначенияРеквизитов.Очистить();

	Для Каждого ТекРеквизит Из ДанныеЗаполнения.Ссылка.Метаданные().Реквизиты Цикл

		Если ТекРеквизит.Имя = "Автор" Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ЗначенияРеквизитов.Добавить();
		НоваяСтрока.Реквизит = ТекРеквизит.Имя;
		НоваяСтрока.Значение = ДанныеОбъекта[ТекРеквизит.Имя];
		НоваяСтрока.Использование = ЗначениеЗаполнено(НоваяСтрока.Значение);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли