#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.СтруктураНастроекРасчета) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,Параметры.СтруктураНастроекРасчета,,"ДополнительныеПоляМетодаПрогноза");
		ДанныеФормыКоллекцияДополнительныеПоляМетодаПрогноза = Параметры.СтруктураНастроекРасчета.ДополнительныеПоляМетодаПрогноза;
		ТаблицаЗначенийДополнительныеПоляМетодаПрогноза = ДанныеФормыКоллекцияДополнительныеПоляМетодаПрогноза.Выгрузить();
		ДополнительныеПоляМетодаПрогноза.Загрузить(ТаблицаЗначенийДополнительныеПоляМетодаПрогноза);
	КонецЕсли;
	
	Элементы.ПериодичностьПланирования.СписокВыбора.Очистить();
	
	Для Каждого ИмяПеречисления Из Перечисления.Периодичность.ПустаяСсылка().Метаданные().ЗначенияПеречисления Цикл
		Элементы.ПериодичностьПланирования.СписокВыбора.Добавить(Перечисления.Периодичность[ИмяПеречисления.Имя]);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПериодичностьПланирования)
		И Элементы.ПериодичностьПланирования.СписокВыбора.НайтиПоЗначению(ПериодичностьПланирования) = Неопределено Тогда
		Элементы.ПериодичностьПланирования.СписокВыбора.Добавить(ПериодичностьПланирования);
	КонецЕсли;
	
	Элементы.ГруппаПроверкаПраваСохранениеНастроек.Видимость =  ЕстьПравоСохраненияВариантаРасчетаПотребности;
	
	РасчетПотребностейВызовСервера.ОбновитьМетодыПрогноза(ЭтотОбъект, МетодПрогноза);
	
	ОбновитьСписокВыбораГруппировать();
	
	УправлениеВидимостьюЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьДополнительныеПоля();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодичностьПланированияПриИзменении(Элемент)
	
	ПериодПоВсемПериодам	= РасчетПотребностейКлиентСервер.ПериодПоДатеНачалаИДлительности(
		ДатаНачалаПланирования, 
		КоличествоДнейПланирования, 
		ПоВсемПериодам);
	
	Если ПериодичностьПланирования = ПоВсемПериодам 
		ИЛИ ПериодПланирования.ДатаОкончания = ПериодПоВсемПериодам.ДатаОкончания Тогда

		КоличествоДнейПланирования  = 1;
		ПериодПланирования 			= РасчетПотребностейКлиентСервер.ПериодПоДатеНачалаИДлительности(
			ДатаНачалаПланирования, 
			КоличествоДнейПланирования, 
			ПериодичностьПланирования);
		
	Иначе
		
		ДатаОкончанияПериода		= ПериодПланирования.ДатаОкончания;
		КоличествоДнейПланирования  = 1;
	
		// +1, чтобы отловить в какой момент период выходит за пределы предыдущего, и не делать его еще больше
		ПериодПроверки				= РасчетПотребностейКлиентСервер.ПериодПоДатеНачалаИДлительности(
			ДатаНачалаПланирования, 
			КоличествоДнейПланирования + 1, 
			ПериодичностьПланирования); 

		Пока ПериодПроверки.ДатаОкончания <= ДатаОкончанияПериода Цикл

			КоличествоДнейПланирования  = КоличествоДнейПланирования + 1;
			ПериодПроверки				= РасчетПотребностейКлиентСервер.ПериодПоДатеНачалаИДлительности(
				ДатаНачалаПланирования, 
				КоличествоДнейПланирования + 1, 
				ПериодичностьПланирования);
		
		КонецЦикла;
	
		ПериодПланирования 			= РасчетПотребностейКлиентСервер.ПериодПоДатеНачалаИДлительности(
			ДатаНачалаПланирования, 
			КоличествоДнейПланирования, 
			ПериодичностьПланирования);

	КонецЕсли;
	
	Если Не ПроизвольныйПериод Тогда
		НастроитьДополнительныеПоля(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейПланированияПриИзменении(Элемент)
	
	ПериодПланирования = РасчетПотребностейКлиентСервер.ПериодПоДатеНачалаИДлительности(ДатаНачалаПланирования, КоличествоДнейПланирования, ПериодичностьПланирования);
	
	Если Не ПроизвольныйПериод Тогда
		НастроитьДополнительныеПоля(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПланированияПриИзменении(Элемент)
	
	Если ДатаНачалаПланирования < НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ДатаНачалаПланирования = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;

	ПериодПланирования = РасчетПотребностейКлиентСервер.ПериодПоДатеНачалаИДлительности(ДатаНачалаПланирования, КоличествоДнейПланирования, ПериодичностьПланирования);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитыватьПриИзменении(Элемент)

	НастроитьДополнительныеПоля();

КонецПроцедуры

&НаКлиенте
Процедура МетодПрогнозаПриИзменении(Элемент)
	
	НастроитьДополнительныеПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура МетодПрогнозаРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "СоздатьНовыйПрогноз" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму(
			"Справочник.МетодыПрогнозаПродаж.Форма.ПомощникСозданияРасширения", 
			, 
			Элементы.МетодПрогноза);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйПериодПриИзменении(Элемент)
	
	НастроитьДополнительныеПоля(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПериодовПрогнозаПриИзменении(Элемент)
	
	НастроитьДополнительныеПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаПродажНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ПериодПродаж;
	
	Диалог.Показать(Новый ОписаниеОповещения("ПредставлениеПериодаПродажНажатиеЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура МетодОбеспеченияПриИзменении(Элемент)
	
	НастроитьДополнительныеПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура МетодРасчетаСтраховогоЗапасаПриИзменении(Элемент)

	СтраховойЗапас = 0;
	
	НастроитьДополнительныеПоля();

КонецПроцедуры

&НаКлиенте
Процедура ПоставкаОднойДатойПриИзменении(Элемент)
	
	ЗаказыПоставщикуРазнымиДатами = Ложь;
	УправлениеВидимостьюЭлементов(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоставкиПриИзменении(Элемент)
	
	Если ДатаПоставки < НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ДатаПоставки = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьПриИзменении(Элемент)
	УправлениеВидимостьюЭлементов(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПоЗаказамПриИзменении(Элемент)
	УправлениеВидимостьюЭлементов(Элемент.Имя);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапомнитьИПрименить(Команда)
	
	СтруктураНастроекРасчета = РасчетПотребностейКлиентСервер.СтруктураНастроекРасчетаПотребностей();
	ЗаполнитьЗначенияСвойств(СтруктураНастроекРасчета,ЭтотОбъект);
	СтруктураНастроекРасчета.СохранитьНастройки = Истина;
	
	Закрыть(СтруктураНастроекРасчета);
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	СтруктураНастроекРасчета = РасчетПотребностейКлиентСервер.СтруктураНастроекРасчетаПотребностей();
	ЗаполнитьЗначенияСвойств(СтруктураНастроекРасчета,ЭтотОбъект);
	
	Закрыть(СтруктураНастроекРасчета);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеВнешнимВидомФормы 

&НаКлиенте
Процедура НастроитьДополнительныеПоля(ПересчитатьКоличествоПрогноза = Ложь)

	УчитыватьСтраховойЗапас = ЗначениеЗаполнено(МетодРасчетаСтраховогоЗапаса);
	
	Элементы.ГруппаУчитыватьСтраховойЗапас.Видимость = МетодОбеспечения = "РасчетПоСтатистике"; 
	Элементы.ГруппаСтраховойЗапас.Видимость 		 = МетодОбеспечения = "РасчетПоСтатистике" И УчитыватьСтраховойЗапас;
	
	Если УчитыватьСтраховойЗапас Тогда            
		
		Если МетодРасчетаСтраховогоЗапаса = "ПоПоставке" Тогда
			ПредставлениеМетода	= НСтр("ru = 'Кол-во дней'");
		ИначеЕсли МетодРасчетаСтраховогоЗапаса = "ПоПроцентуПродаж" Тогда
			ПредставлениеМетода	= НСтр("ru = 'Процент от продаж'");
		Иначе
			ПредставлениеМетода	= НСтр("ru = 'Страховой запас'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраховойЗапас", "Заголовок", 
			ПредставлениеМетода);
		
	КонецЕсли;
	
	Если Не ПроизвольныйПериод Тогда

		Если КоличествоПериодовПродаж = 0 
			ИЛИ ПересчитатьКоличествоПрогноза Тогда

			КоличествоПериодовПродаж = 3 * КоличествоДнейПланирования;
			
			Если ПериодичностьПланирования = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
				КоличествоПериодовПродаж = МАКС(КоличествоПериодовПродаж, 14);
			КонецЕсли;
			
		КонецЕсли;
		
		ПериодПродаж.ДатаОкончания = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса())-1; // Текущий день в статистику не берем
        ПериодПродаж.ДатаНачала	   = РасчетПотребностейКлиентСервер.РассчитатьДатуОкончанияПериода(
			ПериодПродаж.ДатаОкончания,
			ПериодичностьПланирования,
			-КоличествоПериодовПродаж);

		ПериодПродаж.ДатаНачала	   = КонецДня(ПериодПродаж.ДатаНачала) + 1; // Особенности процедуры РассчитатьДатуОкончанияПериода
		
	КонецЕсли;
	
	ПредставлениеПериодаПродаж = РасчетПотребностейКлиент.СформироватьПредставлениеПериодаАнализа(
		ПериодПродаж.ДатаНачала, 
		ПериодПродаж.ДатаОкончания);
	
    Элементы.ПредставлениеПериодаПродаж.Доступность		= ПроизвольныйПериод;
    Элементы.КоличествоПериодовПрогноза.Видимость		= Не ПроизвольныйПериод;

	Элементы.КоличествоПериодовПрогноза.Доступность		= ПериодичностьПланирования <> ПоВсемПериодам;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаМетодРасчетаПоПродажам", "Видимость", 
		СтрНачинаетсяС(Рассчитывать, РасчетПотребностейКлиентСервер.РассчитыватьПоПродажам()));
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МетодПрогноза", "Видимость", 
		Рассчитывать = РасчетПотребностейКлиентСервер.РассчитыватьПоПродажамРасширение());
		
	Для Каждого СтрокаДополнительноеПоле Из ДополнительныеПоляМетодаПрогноза Цикл

		ИмяЭлементаНаФорме = ?(ЗначениеЗаполнено(СтрокаДополнительноеПоле.ИмяЭлементаНаФорме), 
			СтрокаДополнительноеПоле.ИмяЭлементаНаФорме,
			СтрокаДополнительноеПоле.Имя);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			ИмяЭлементаНаФорме, 
			"Доступность", 
			Истина);
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, 
			ИмяЭлементаНаФорме,
			"Видимость", 
			СтрокаДополнительноеПоле.ИдентификаторМетодаПрогноза = МетодПрогноза
				И Рассчитывать = РасчетПотребностейКлиентСервер.РассчитыватьПоПродажамРасширение()
				ИЛИ СтрокаДополнительноеПоле.ИдентификаторМетодаПрогноза = Рассчитывать);
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЭлементов(Знач ИмяРеквизита = "")

	Если ПустаяСтрока(ИмяРеквизита) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезервироватьЗаказомНаПеремещение", 
			"Видимость", ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияПеремещение() 
			ИЛИ ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияВсе());
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаказыПоставщикуРазнымиДатами", 
			"Видимость", ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияЗакупка() 
			ИЛИ ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияЗакупкаПереработка()
			ИЛИ ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияВсе());
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаполнитьНоменклатуруПоставщика", 
			"Видимость", ПолучитьФункциональнуюОпцию("УчетНоменклатурыПоставщиков")
				И (ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияЗакупка() 
					ИЛИ ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияЗакупкаПереработка()
					ИЛИ ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияВсе()));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтдельныеДокументыПоЗаказамПокупателя", 
			"Видимость", ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияЗакупка() 
			ИЛИ ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияПроизводство() 
			ИЛИ ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияЗакупкаПереработка()
			ИЛИ ОтборСпособПополнения = РасчетПотребностейКлиентСервер.СпособПополненияВсе());
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяРеквизита) ИЛИ ИмяРеквизита = Элементы.Группировать.Имя Тогда
		Элементы.ПоЗаказам.Видимость = (Группировать <> РасчетПотребностейКлиентСервер.ГруппировкаЗаказНоменклатура() 
										И РезервированиеЗапасов);
		Если НЕ Элементы.ПоЗаказам.Видимость Тогда
			ПоЗаказам = Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяРеквизита) ИЛИ ИмяРеквизита = Элементы.ПоЗаказам.Имя Тогда
		Элементы.ОтдельныеДокументыПоЗаказамПокупателя.Доступность = (ПоЗаказам ИЛИ Группировать = РасчетПотребностейКлиентСервер.ГруппировкаЗаказНоменклатура());
		Если ОтдельныеДокументыПоЗаказамПокупателя И НЕ Элементы.ОтдельныеДокументыПоЗаказамПокупателя.Доступность Тогда
			ОтдельныеДокументыПоЗаказамПокупателя = Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяРеквизита) ИЛИ ИмяРеквизита = Элементы.ПоставкаОднойДатой.Имя Тогда
		Элементы.ЗаказыПоставщикуРазнымиДатами.Видимость = Элементы.ЗаказыПоставщикуРазнымиДатами.Видимость И НЕ ПоставкаОднойДатой;
		Элементы.ДатаПоставки.Видимость = ПоставкаОднойДатой;
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПредставлениеПериодаПродажНажатиеЗавершение(НовыйПериод, Параметры) Экспорт
	
	Если НовыйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПериодПродаж = НовыйПериод;
	Если НЕ ЗначениеЗаполнено(ПериодПродаж) Тогда
		ПериодПродаж = РасчетПотребностейКлиент.ПериодПродажПоУмолчанию();
	КонецЕсли; 

	НастроитьДополнительныеПоля();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораГруппировать()
	
	Элементы.Группировать.СписокВыбора.Очистить();
	Элементы.Группировать.СписокВыбора.Добавить(РасчетПотребностейКлиентСервер.ИмяГруппировкиНоменклатура(), НСтр("ru = 'Номенклатуре'"));
	Элементы.Группировать.СписокВыбора.Добавить(РасчетПотребностейКлиентСервер.ГруппировкаНоменклатураДень(), НСтр("ru = 'Номенклатуре и дням'"));	
	Элементы.Группировать.СписокВыбора.Добавить(РасчетПотребностейКлиентСервер.ГруппировкаДеньНоменклатура(), НСтр("ru = 'Дням и номенклатуре'"));	
	Если РезервированиеЗапасов Тогда
		Элементы.Группировать.СписокВыбора.Добавить(РасчетПотребностейКлиентСервер.ГруппировкаЗаказНоменклатура(), НСтр("ru = 'Заказам и номенклатуре'"));
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти