#Область СобытияФормИСПереопределяемый

// Устанавливает условное оформление для поля "Характеристика".
//
// Параметры:
//  Форма - УправляемаяФорма - форма, в которой нужно установить условное оформление,
//  ИмяПоляВводаХарактеристики - Строка - имя элемента формы "Характеристика",
//  ПутьКПолюОтбора - Строка - полный путь к реквизиту "Характеристики используются".
//
Процедура УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
	Форма,
	ИмяПоляВводаХарактеристики,
	ПутьКПолюОтбора) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Возврат;
	КонецЕсли;
																
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаХарактеристики].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ИмяТЧ = "";
	
	Если ИмяПоляВводаХарактеристики = "ТоварыХарактеристика" Тогда
		ПутьКТЧ = "Объект.Товары";
		ИмяТЧ = "Товары";
		
	ИначеЕсли ИмяПоляВводаХарактеристики = "СырьеХарактеристика" Тогда
		ПутьКТЧ = "Объект.Сырье";
		ИмяТЧ = "Сырье";
	Иначе Возврат;
	КонецЕсли;
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ПроверятьЗаполнениеХарактеристики", Новый ОписаниеТипов("Булево"), ПутьКТЧ, "ПроверятьЗаполнениеХарактеристики", Истина));
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);

	НоваяКолонка = Форма.Элементы.Добавить(ИмяТЧ+"ПроверятьЗаполнениеХарактеристики", Тип("ПолеФормы"), Форма.Элементы[ИмяТЧ]);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода; 
	НоваяКолонка.ПутьКДанным = ПутьКТЧ + "." + "ПроверятьЗаполнениеХарактеристики";
	НоваяКолонка.Видимость = Ложь;
	
	ИмяПоляПроверятьЗаполнениеХарактеристики = "Объект."+ИмяТЧ+ ".ПроверятьЗаполнениеХарактеристики";
	
	ИмяПоляХарактеристики = ИмяПоляВводаХарактеристики;
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляПроверятьЗаполнениеХарактеристики, Истина, ВидСравненияКомпоновкиДанных.Равно);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляПроверятьЗаполнениеХарактеристики, Ложь, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект."+ИмяТЧ+".Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

// Устанавливаем условное оформление для единиц измерения номенклатуры
//
// Параметры:
// 		Форма - Форма - Содержит данную форму
// 		ИмяПоляВводаЕдиницИзмерения - Строка - Наименование элемента формы, содержащего ед. измерения номенклатуры,
//									   			если оно отличается от "ТоварыНоменклатураЕдиницаИзмерения"
// 		ПутьКПолюОтбора - Строка - Полный путь к реквизиту "Упаковка",
//									если он отличается от "Объект.Товары.Упаковка".
//
Процедура УстановитьУсловноеОформлениеЕдиницИзмерения(Форма,
													  ИмяПоляВводаЕдиницИзмерения,
													  ПутьКПолюОтбора) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаЕдиницИзмерения].Имя);

	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);	
	
КонецПроцедуры

// Устанавливает условное оформление для поля "Серия".
//
// Параметры:
//	Форма - УправляемаяФорма - Форма, в которой нужно установить условное оформление,
//
Процедура УстановитьУсловноеОформлениеСерийНоменклатуры(Форма,
														ИмяПоляВводаСерии,
														ПутьКПолюОтбораСтатусУказанияСерий,
														ПутьКПолюОтбораТипНоменклатуры) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаСерии].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбораСтатусУказанияСерий);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<серии не используются>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ИмяТЧ = "";
	
	Если ИмяПоляВводаСерии = "ТоварыСерия" Тогда
		ПутьКТЧ = "Объект.Товары";
		ИмяТЧ = "Товары";
		
	ИначеЕсли ИмяПоляВводаСерии = "СырьеСерия" Тогда
		ПутьКТЧ = "Объект.Сырье";
		ИмяТЧ = "Сырье";
	Иначе Возврат;
	КонецЕсли;
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ПроверятьЗаполнениеСерии", Новый ОписаниеТипов("Булево"), ПутьКТЧ, "ПроверятьЗаполнениеСерии", Истина));
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);

	НоваяКолонка = Форма.Элементы.Добавить(ИмяТЧ+"ПроверятьЗаполнениеСерии", Тип("ПолеФормы"), Форма.Элементы[ИмяТЧ]);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода; 
	НоваяКолонка.ПутьКДанным = ПутьКТЧ + "." + "ПроверятьЗаполнениеСерии";
	НоваяКолонка.Видимость = Ложь;
	
	ИмяПоляПроверятьЗаполнениеСерии = "Объект."+ИмяТЧ+ ".ПроверятьЗаполнениеСерии";
	
	ИмяПоляСерии = ИмяПоляВводаСерии;
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляПроверятьЗаполнениеСерии, Истина, ВидСравненияКомпоновкиДанных.Равно);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляСерии);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляПроверятьЗаполнениеСерии, Ложь, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляСерии);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект."+ИмяТЧ+".Серия", Справочники.ПартииНоменклатуры.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляСерии);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

// Переопределяемая часть обработки проверки заполнения формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма.
//   Отказ - Булево - Истина если проверка заполнения не пройдена
//   ПроверяемыеРеквизиты - Массив Из Строка - реквизиты формы, отмеченные для проверки
Процедура ОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если Форма.ИмяФормы = "ОбщаяФорма.ФормаУточненияДанныхИС"
		Или Форма.ИмяФормы = "Обработка.ПроверкаИПодборПродукцииИС.Форма.УточнениеПодобраннойПродукции" Тогда
		
		Номенклатура = Форма.Номенклатура;
		НепроверяемыеРеквизиты = Новый Массив;
		
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			
			ЗначениеРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, 
				"ИспользоватьПартии, ПроверятьЗаполнениеПартий, ИспользоватьХарактеристики, ПроверятьЗаполнениеХарактеристики");
			
			Если НЕ (ЗначениеРеквизитов.ИспользоватьПартии И ЗначениеРеквизитов.ПроверятьЗаполнениеПартий) Тогда
				
				НепроверяемыеРеквизиты.Добавить("Серия");
			
			КонецЕсли;
			
			Если НЕ (ЗначениеРеквизитов.ИспользоватьХарактеристики И ЗначениеРеквизитов.ПроверятьЗаполнениеХарактеристики) Тогда
				
				НепроверяемыеРеквизиты.Добавить("Характеристика");
				
			КонецЕсли;
			
		Иначе
			
			НепроверяемыеРеквизиты.Добавить("Серия");
			НепроверяемыеРеквизиты.Добавить("Характеристика");
			
		КонецЕсли;
		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
		
	КонецЕсли;
	
КонецПроцедуры

// Возникает на сервере при записи константы в формах настроек
// если запись одной константы может повлечь изменение других отображаемых в этой же форме.
//
// Параметры:
//  Форма             - ФормаКлиентскогоПриложения - форма,
//  КонстантаИмя      - Строка           - записываемая константа,
//  КонстантаЗначение - Произвольный     - значение константы.
Процедура ОбновитьФормуНастройкиПриЗаписиПодчиненныхКонстант(Форма, КонстантаИмя, КонстантаЗначение) Экспорт

	Если КонстантаИмя = "ВестиУчетМаркировкиПродукцииВГИСМ" И КонстантаЗначение Тогда
		
		Константы.ИспользоватьСерииНоменклатуры.Установить(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет действия при изменении номенклатуры в объекте (форме, строке табличной части итп).
//
// Параметры:
//  Форма                  - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока          - Произвольный - контекст редактирования (текущая строка таблицы, шапка объекта, форма)
//  КэшированныеЗначения   - Неопределено, Структура - сохраненные значения параметров, используемых при обработке,
//  ПараметрыУказанияСерий - Произвольный - параметры указания серий формы
Процедура ПриИзмененииНоменклатуры(Форма, ТекущаяСтрока, КэшированныеЗначения, ПараметрыУказанияСерий, ПараметрыСканирования) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ИмяФормы")
		И (Форма.ИмяФормы = "ОбщаяФорма.ФормаУточненияДанныхИС" 
		ИЛИ Форма.ИмяФормы = "Документ.МаркировкаТоваровИСМП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Обработка.ПроверкаИПодборПродукцииИС.Форма.ПроверкаИПодбор") Тогда
		
		ТекущаяСтрока.ХарактеристикиИспользуются = 
			ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") 
			И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) 
			И ТекущаяСтрока.Номенклатура.ИспользоватьХарактеристики;
		
		ТекущаяСтрока.СтатусУказанияСерий = ?(
			ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") 
			И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) 
			И ТекущаяСтрока.Номенклатура.ИспользоватьСерииНоменклатуры,
			1,
			0);
	
	КонецЕсли;
	
	СлужебныеРеквизиты = Новый Структура;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ТребуетВзвешивания") Тогда
		СлужебныеРеквизиты.Вставить("ТребуетВзвешивания");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ПроизвольнаяЕдиницаУчета") Тогда
		СлужебныеРеквизиты.Вставить("ПроизвольнаяЕдиницаУчета");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "СкоропортящаясяПродукция") Тогда
		СлужебныеРеквизиты.Вставить("СкоропортящаясяПродукция", ТекущаяСтрока.СкоропортящаясяПродукция);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ЕдиницаИзмерения") Тогда
		СлужебныеРеквизиты.Вставить("ЕдиницаИзмерения");
	КонецЕсли;
	
	Если СлужебныеРеквизиты.Количество() Тогда
		Если ПараметрыСканирования = Неопределено Тогда
			ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Форма);
		КонецЕсли;
		ИнтеграцияИСУНФКлиентСервер.ЗаполнитьСлужебныеРеквизитыСтроки(Форма, ТекущаяСтрока, ПараметрыСканирования, СлужебныеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
	Если Форма.КэшДанныхГОСИС = Неопределено Тогда
		Форма.КэшДанныхГОСИС = Новый Структура;
	КонецЕсли;
	
	//ИнтеграцияИСУНФ.ПриСозданииЧтенииНаСервере(Форма);
	
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"
		ИЛИ Форма.ИмяФормы = "Справочник.КатегорииНоменклатуры.Форма.ФормаЭлемента" Тогда
		
		Если ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			ДанныеНастроек = ИнтеграцияИС.ДанныеНастроекПараметровНоменклатуры(Форма.Объект.Ссылка);
			Форма.КлючВидовПродукции = ДанныеНастроек.ОписаниеНоменклатурыИС.КлючВидовПродукции;
		
			Форма.АдресДанныхНастроекПараметровНоменклатурыИС =
				ПоместитьВоВременноеХранилище(ДанныеНастроек, Новый УникальныйИдентификатор);		
		КонецЕсли;
		
	КонецЕсли;
	
	СобытияФормИС.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	Если Форма.КэшДанныхГОСИС =  Неопределено Тогда
		Форма.КэшДанныхГОСИС = Новый Структура;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ПередачаТоваровМеждуОрганизациями.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.РасходнаяНакладная.Форма.ФормаДокумента" Тогда
		ФОВестиУчетПодконтрольныхТоваровВЕТИС = ПолучитьФункциональнуюОпцию("ВестиУчетПодконтрольныхТоваровВЕТИС");
		Если ФОВестиУчетПодконтрольныхТоваровВЕТИС Тогда
			Форма.КэшДанныхГОСИС.Вставить("ИнтеграцияВЕТИС");
			ИнтеграцияИС.ПриСозданииНаСервереВФормеДокументаОснования(
				Форма,
				Форма.Объект,
				ИнтеграцияИС.ПараметрыИнтеграцииВФорме("ВетИС",ИнтеграцияИС.ИмяЭлементаДляРазмещения()));
		КонецЕсли;
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		Если НЕ ИнтеграцияИСУНФ.ИнициализацияФормыВыполнена(Форма, Ложь) Тогда
			
			ИнтеграцияИС.ИнициализироватьНастройкиФормыДляУстановкиКлючаВидовПродукции(Форма);
			Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
				ОписаниеНоменклатуры = Неопределено;
				Если Форма.Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Форма.Параметры.ЗначениеКопирования) Тогда
					ОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(Форма.Параметры.ЗначениеКопирования)[Форма.Параметры.ЗначениеКопирования];
				ИначеЕсли ЗначениеЗаполнено(Форма.Объект.КатегорияНоменклатуры) Тогда
					ОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(Форма.Объект.КатегорияНоменклатуры)[Форма.Объект.КатегорияНоменклатуры];
				КонецЕсли;
				Если Не ОписаниеНоменклатуры = Неопределено Тогда
					Форма.КлючВидовПродукции = ОписаниеНоменклатуры.КлючВидовПродукции;
				КонецЕсли;
			КонецЕсли;
			ИнтеграцияИС.ЗаполнитьДанныеПоКлючуВидовПродукции(Форма);
			
			Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка)
				И ЗначениеЗаполнено(Форма.КлючВидовПродукции) Тогда
				Форма.Объект.ПризнакПредметаРасчета = РозничныеПродажиСервер.ПолучитьОжидаемыйПризнакПредметаРасчета(Форма.Объект.ТипНоменклатуры,
					Форма.КлючВидовПродукции,
					Форма.Объект.ВидМаркировки,
					Форма.Объект.ПодакцизныйТовар,
					Форма.Объект.ПродаетсяВРозлив);
				
				Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияВЕТИС(Форма.КлючВидовПродукции)
					И Не Форма.Объект.ПодконтрольнаяПродукцияВЕТИС Тогда
					Форма.Объект.ПодконтрольнаяПродукцияВЕТИС = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияИСМП")
				Или Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияЕГАИС") Тогда
				ИмяЭлементаНастройки = "НастройкаПараметровНоменклатурыИС";
				ДобавляемыеРеквизиты = Новый Массив;
				ДобавляемыеРеквизиты.Добавить(
					Новый РеквизитФормы(ИмяЭлементаНастройки, Новый ОписаниеТипов("ФорматированнаяСтрока")));
				Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
				
				Элемент = Форма.Элементы.Вставить(
					ИмяЭлементаНастройки,
					Тип("ПолеФормы"),
					Форма.Элементы.ГруппаПродукцияИС,
					Форма.Элементы.ПрепаратОтпускаетсяПоДокументу);
				Элемент.ПутьКДанным            = ИмяЭлементаНастройки;
				Элемент.ПоложениеЗаголовка     = ПоложениеЗаголовкаЭлементаФормы.Нет;
				
				ИнтеграцияИСУНФКлиентСервер.ЗаполнитьДанныеНастройкиПараметровНоменклатурыИС(Форма);
			КонецЕсли;
			
			Если Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияЕГАИС")
				И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СоответствиеНоменклатурыЕГАИС) Тогда
				Элемент = Форма.Элементы.Вставить(
					"СопоставленнаяАлкогольнаяПродукция",
					Тип("ДекорацияФормы"),
					Форма.Элементы.ГруппаАлкогольнаяПродукция,);
				Элемент.Вид = ВидДекорацииФормы.Надпись;
				
				Элемент.Заголовок = ИнтеграцияЕГАИСУНФВызовСервера.ПредставлениеСопоставленнойАлкогольнойПродукция(
					Форма.Объект.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияЗЕРНО") И Не Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияИСМП") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "КодОКПД2", "КнопкаВыбора", Ложь);
		КонецЕсли;

	ИначеЕсли Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаСписка" Тогда
		
		Команда = Форма.Команды.Добавить("НастроитьИнтеграциюСФГИС");
		Команда.Заголовок = НСтр("ru = 'Настроить интеграцию с ФГИС'");
		Команда.Действие = "НастроитьИнтеграциюСФГИС";
		
		Кнопка = Форма.Элементы.Добавить("СписокЗапасыНастроитьИнтеграциюСФГИС", Тип("КнопкаФормы"), Форма.Элементы.СписокЗапасыКонтекстноеМенюГруппаЕЩЕ);
		Кнопка.Заголовок = НСтр("ru = 'Настроить интеграцию с ФГИС'");
		Кнопка.ИмяКоманды = "НастроитьИнтеграциюСФГИС";
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.КатегорииНоменклатуры.Форма.ФормаЭлемента" Тогда
		
		ИнтеграцияИС.ИнициализироватьНастройкиФормыДляУстановкиКлючаВидовПродукции(Форма);
		Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			ОписаниеНоменклатуры = Неопределено;
			Если Форма.Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Форма.Параметры.ЗначениеКопирования) Тогда
				ОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(Форма.Параметры.ЗначениеКопирования)[Форма.Параметры.ЗначениеКопирования];
			КонецЕсли;
			Если Не ОписаниеНоменклатуры = Неопределено Тогда
				Форма.КлючВидовПродукции = ОписаниеНоменклатуры.КлючВидовПродукции;
			КонецЕсли;
		КонецЕсли;
		ИнтеграцияИС.ЗаполнитьДанныеПоКлючуВидовПродукции(Форма);
		
		Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка)
			И ЗначениеЗаполнено(Форма.КлючВидовПродукции)
			И РозничныеПродажиСервер.ТребуетсяПризнакПредметаРасчета(Форма.Объект.ТипНоменклатурыПоУмолчанию) Тогда
			Форма.Объект.ПризнакПредметаРасчета = РозничныеПродажиСервер.ПолучитьОжидаемыйПризнакПредметаРасчета(
				Форма.Объект.ТипНоменклатурыПоУмолчанию,
				Форма.КлючВидовПродукции,
				Форма.Объект.ВидМаркировки,
				Форма.Объект.ПодакцизныйТовар,
				Форма.Объект.ПродаетсяВРозлив);
			
			Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияВЕТИС(Форма.КлючВидовПродукции)
				И Не Форма.Объект.ПодконтрольнаяПродукцияВЕТИС Тогда
				Форма.Объект.ПодконтрольнаяПродукцияВЕТИС = Истина;
			КонецЕсли;
		КонецЕсли;
		
		// ИнтеграцияГОСИС
		// ВЕТИС
		Если Не ПолучитьФункциональнуюОпцию("ВестиУчетПодконтрольныхТоваровВЕТИС") Тогда
			Форма.Элементы.ГруппаВЕТИС.Видимость = Ложь;
		КонецЕсли;
		//Конец ВЕТИС
		
		Форма.ВестиСведенияДляДекларацийПоАлкогольнойПродукции = ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукции");
		Форма.ВестиУчетМаркировкиПродукцииВГИСМ = ПолучитьФункциональнуюОпцию("ВестиУчетМаркировкиПродукцииВГИСМ") И НЕ ИнтеграцияГИСМ.ПодсистемаНеИспользуется();
		Форма.ВестиУчетПодконтрольныхТоваровВЕТИС = ПолучитьФункциональнуюОпцию("ВестиУчетПодконтрольныхТоваровВЕТИС");
		Форма.ВестиУчетМаркируемойПродукцииИСМП = ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");
		//Форма.ВестиУчетМаркируемойПродукцииЗЕРНО = ПолучитьФункциональнуюОпцию("ВестиУчетЗернаИПродуктовПереработкиЗЕРНО");
		//Форма.ВестиУчетПродукцииСАТУРН = ПолучитьФункциональнуюОпцию("ВестиУчетПестицидовАгрохимикатовТукосмесейСАТУРН");
		
	КонецЕсли;
	
	СобытияФормИС.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ПриЗаписиНаСервере(Форма, ТекущийОбъект, Отказ) Экспорт
	
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"
		Или Форма.ИмяФормы = "Справочник.КатегорииНоменклатуры.Форма.ФормаЭлемента" Тогда
		
		Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"
			И Форма.Объект.ПрепаратОтпускаетсяПоДокументу
			И Не КонструкторИСМПКлиентСервер.ВидПродукцииИспользуетВетеринарныйСертификат(Форма.КлючВидовПродукции) Тогда
			Форма.Объект.ПрепаратОтпускаетсяПоДокументу = Ложь;
		КонецЕсли;
		
		ДанныеЗаписиНоменклатуры = Новый Структура;
		
		ДанныеОписания = ОбщегоНазначенияИС.ИнициализироватьДанныеОписанияНоменклатуры();
		ДанныеОписания.Номенклатура = ТекущийОбъект.Ссылка;
		
		Если ЗначениеЗаполнено(Форма.КлючВидовПродукции) Тогда
			
			Если ЭтоАдресВременногоХранилища(Форма.АдресДанныхНастроекПараметровНоменклатурыИС) Тогда
				ДанныеНастроек = ПолучитьИзВременногоХранилища(Форма.АдресДанныхНастроекПараметровНоменклатурыИС);
				ЗаполнитьЗначенияСвойств(ДанныеОписания, ДанныеНастроек.ОписаниеНоменклатурыИС);
				
				ДанныеЗаписиНоменклатуры.Вставить("НастройкиЧастичногоВыбытияПродукцииИС", ДанныеНастроек.НастройкиЧастичногоВыбытияПродукцииИС);
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ДанныеОписания, ТекущийОбъект);
			ЗаполнитьЗначенияСвойств(ДанныеОписания, Форма);
			ДанныеОписания.ТребуетВзвешивания = ТекущийОбъект.Весовой;
			
			Если Форма.Объект.Весовой Тогда
				ДанныеОписания.КоличествоВПотребительскойУпаковке = 0;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Форма.КлючВидовПродукции) И Не ЭтоАдресВременногоХранилища(Форма.АдресДанныхНастроекПараметровНоменклатурыИС) Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеЗаписиНоменклатуры.Вставить("ДанныеОписания", ДанныеОписания);
		
		ИнтеграцияИСУНФ.ЗаписатьДанныеНоменклатуры(ДанныеЗаписиНоменклатуры, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма) Экспорт
	
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"
		Или Форма.ИмяФормы = "Справочник.КатегорииНоменклатуры.Форма.ФормаЭлемента" Тогда
		
		//ИнтеграцияИСУТ.ЗаполнитьЗначениеПолейНоменклатуры(ЭтотОбъект);
		ИнтеграцияИС.ЗаполнитьДанныеПоКлючуВидовПродукции(Форма);
		//НастроитьЭлементыФормыИС(ЭтотОбъект);
		//ЗаполнитьСопоставлениеСПродукциейПодсистем();
		
	КонецЕсли;
	
	СобытияФормИС.ПослеЗаписиНаСервере(Форма);
	
КонецПроцедуры

Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ Форма.КэшДанныхГОСИС.Свойство("Инициализация") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	Если Элемент = "ТабличнаяЧасть" Тогда
		ИдентификаторСтроки = Неопределено;
		Элемент = Форма.КэшДанныхГОСИС.ИмяТабличнойЧасти;
		
		Если ДополнительныеПараметры.Свойство("ТребуетсяЗаполнениеСлужебныхРеквизитов", ИдентификаторСтроки) Тогда
			ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Форма);
			СлужебныеРеквизиты = Новый Структура("МаркируемаяПродукция, ВидПродукцииИС, КоэффициентЕдиницыИзмеренияГосИС, КоличествоВБазовыхЕдиницахГосИС,
				|АвтоматическийОСУИС, РазрешенОборотНемаркированныхОстатков, ДействуетКонтрольОборотаМарок");
			Если ИдентификаторСтроки = Неопределено Тогда
				ИнтеграцияИСУНФ.ЗаполнитьСлужебныеРеквизитыВКоллекции(Форма, Форма.Объект[Элемент], ПараметрыСканирования, СлужебныеРеквизиты);
			Иначе
				СтрокаТЧ = Форма.Объект[Элемент].НайтиПоИдентификатору(ИдентификаторСтроки);
				ИнтеграцияИСУНФКлиентСервер.ЗаполнитьСлужебныеРеквизитыСтроки(Форма, СтрокаТЧ, ПараметрыСканирования, СлужебныеРеквизиты);
			КонецЕсли;
		КонецЕсли;
		
		Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента" Тогда
			ДобавитьИзменитьКодМаркировкиКегаНаОборудованииРозлива(Форма, Элемент, ДополнительныеПараметры, ИдентификаторСтроки);
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ТребуетсяЗаполнениеКэша") Тогда
			НастройкиКэша = ИнтеграцияИСУНФ.НастройкиИсточникаКешаЧека();
			ПроверкаИПодборПродукцииИС.ЗаполнитьКешШтрихкодовУпаковок(Форма, НастройкиКэша);
		КонецЕсли;
		
	КонецЕсли;
	
	СобытияФормИС.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьИзменитьКодМаркировкиКегаНаОборудованииРозлива(Форма, Элемент, ДополнительныеПараметры, ИдентификаторСтроки)
	
	СтрокаТЧ = Неопределено;
	Если Не ИдентификаторСтроки = Неопределено Тогда
		СтрокаТЧ = Форма.Объект[Элемент].НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Не КонструкторИСМПОбщегоНазначенияКлиентСервер.ПоддерживаетсяПодключениеКОборудованиюРозлива(СтрокаТЧ.ВидПродукцииИС) Тогда
			Возврат;
		КонецЕсли;
		ТаблицаЗапасы = Форма.Объект.Запасы.Выгрузить(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТЧ));
	Иначе
		ТаблицаЗапасы = Форма.Объект.Запасы.Выгрузить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЗапасы", ТаблицаЗапасы);
	Запрос.УстановитьПараметр("ТаблицаСерии", Форма.Объект.СерииНоменклатуры.Выгрузить());
	ТекстЗапроса = ИнтеграцияИСУНФ.ТекстЗапросаТоварыСерии(ТаблицаЗапасы);
	
	ВидыПродукцииГИСМТ = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоддерживающиеПодключениеКОборудованиюРозлива();
	Запрос.УстановитьПараметр("ВидыПродукцииГИСМТ", ВидыПродукцииГИСМТ);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ОтборНоменклатуры",
		"ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ В (&ВидыПродукцииГИСМТ)");
	
	Запрос.Текст = ТекстЗапроса;
	Запасы = Запрос.Выполнить().Выгрузить();
	
	ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Форма);
	Результат = ШтрихкодированиеИС.ДобавитьИзменитьКодМаркировкиВскрытойПотребительскойУпаковки(
		ПараметрыСканирования,
		Запасы,
		Форма.Объект[ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок]);
		
	Если Результат.ЕстьИзменения Тогда
		
		ДополнительныеПараметры.Вставить("ТребуетсяЗаполнениеКэша", Истина);
		
		ПараметрыПоиска = Новый Структура(ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки);
		Для Каждого ШтрихкодУпаковки Из Результат.УдалитьКодыМакрировки Цикл
			ПараметрыПоиска[ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки] = ШтрихкодУпаковки;
			ШтрихкодыУпаковок = Форма.Объект[ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок].НайтиСтроки(ПараметрыПоиска);
			Для Каждого СтрокаКУдалению Из ШтрихкодыУпаковок Цикл
				Форма.Объект[ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок].Удалить(СтрокаКУдалению);
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из Результат.КодыМаркировки Цикл
			
			СтрокаТовары   = КлючИЗначение.Ключ;
			ДанныеУпаковки = КлючИЗначение.Значение;
			
			Для Каждого СтрокаДанныхУпаковки Из ДанныеУпаковки Цикл
				ПараметрыПоиска[ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки] = СтрокаДанныхУпаковки.ШтрихкодУпаковки;
				ШтрихкодыУпаковок = Форма.Объект[ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок].НайтиСтроки(ПараметрыПоиска);
				Если ШтрихкодыУпаковок.Количество() = 0 Тогда
					ШтрихкодУпаковки = Форма.Объект[ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок].Добавить();
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ШтрихкодУпаковки, "КлючСвязи") Тогда
						ШтрихкодУпаковки.КлючСвязи = СтрокаТовары.КлючСвязи;
					КонецЕсли;
				Иначе
					ШтрихкодУпаковки = ШтрихкодыУпаковок[0];
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ШтрихкодУпаковки, СтрокаДанныхУпаковки);
				ШтрихкодУпаковки[ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки] = СтрокаДанныхУпаковки.ШтрихкодУпаковки;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти