////////////////////////////////////////////////////////////////////////////////
// Подсистема "Торговые предложения".
// ОбщийМодуль.ТорговыеПредложенияСлужебныйКлиентСервер.
////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Описание настроек поиска по товарам.
// 
// Возвращаемое значение:
//  Структура - описание структуры для хранения настроек поиска по товарам:
// * ПревышениеМинимальнойЦены - Число
// * МаксимальныйСрокПоставки - Число
// * ОграничениеТорговыхПредложений - Число
// * ПоискПоНаименованию - Булево
// * ПоискПоАртикулу - Булево
// * ПоискПоШтрихКоду - Булево
// * ПоискПоНоменклатуреСервиса - Булево
//
Функция ОписаниеНастроекПоискаПоТоварам() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПревышениеМинимальнойЦены",     25);
	Результат.Вставить("МаксимальныйСрокПоставки",       7);
	Результат.Вставить("ОграничениеТорговыхПредложений", 5);
	Результат.Вставить("ПоискПоНаименованию",        Ложь);
	Результат.Вставить("ПоискПоАртикулу",            Истина);
	Результат.Вставить("ПоискПоШтрихКоду",           Истина);
	Результат.Вставить("ПоискПоНоменклатуреСервиса", Истина);
	
	Возврат Результат;
	
КонецФункции

// Имя реквизита рекомендации фоновое задание.
// 
// Возвращаемое значение:
//  Строка - Имя реквизита рекомендации фоновое задание
//
Функция ИмяРеквизитаРекомендацииФоновоеЗадание() Экспорт
	
	Результат = "Подключаемый_ТорговыеПредложенияРекомендацияФЗ";
	Возврат Результат;
	
КонецФункции

#Область Конструкторы
	
// Параметры изменения состояния торговых предложений.
// 
// Возвращаемое значение:
//  Структура - параметры изменения состояния торговых предложений:
// * ТорговыеПредложения - Массив из ОпределяемыйТип.ТорговоеПредложение
// * ЭтоУдаление - Булево
// * ЭтоОтменаУдаления - Булево
// * ЭтоОтключениеПубликации - Булево
// * ЭтоВключениеПубликации - Булево
//
Функция НовыйПараметрыИзмененияСостоянияТорговыхПредложений() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ТорговыеПредложения",     Новый Массив);
	Результат.Вставить("ЭтоУдаление",             Ложь);
	Результат.Вставить("ЭтоОтменаУдаления",       Ложь);
	Результат.Вставить("ЭтоОтключениеПубликации", Ложь);
	Результат.Вставить("ЭтоВключениеПубликации",  Ложь);
	Результат.Вставить("ЭтоДобавлениеПубликации", Истина);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Проверяет, используется ли интерфейс версии 8.5.
//
// Возвращаемое значение:
//   Булево - Истина, если текущий интерфейс соответствует версии 8.5, иначе Ложь.
Функция ЭтоИнтерфейс85() Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область АдресаИзображений
	
// Возвращает адрес предварительного изображения, полученный по адресу основного изображения из сервиса.
//
// Параметры:
//   АдресОсновногоИзображения - Строка - Адрес основного изображения
//
// Возвращаемое значение:
//   Строка - Адрес предварительного изображения
Функция АдресПредварительногоИзображенияПоАдресуОсновногоИзображенияИзСервиса(АдресОсновногоИзображения) Экспорт
	
	Результат = "";
	
	Если  ЭтоАбсолютныйАдресИнтернетРесурса(АдресОсновногоИзображения) Тогда
		Результат = АдресОсновногоИзображения; 
	Иначе
		
		РазбиениеАдресаИРасширения = СтрРазделить(АдресОсновногоИзображения, ".", Ложь);
		Если РазбиениеАдресаИРасширения.Количество() > 1 Тогда
			
			Расширение = РазбиениеАдресаИРасширения[РазбиениеАдресаИРасширения.ВГраница()];
			РазбиениеАдресаИРасширения.Удалить(РазбиениеАдресаИРасширения.ВГраница());
			АдресБезРасширения = СтрСоединить(РазбиениеАдресаИРасширения, ".");
			СтрокаВставкиПредварительногоИзображенияВСервисе = "-preview";
			
			Результат = СтрШаблон("%1%2.%3", 
				АдресБезРасширения,
				СтрокаВставкиПредварительногоИзображенияВСервисе,
				Расширение);
			
		КонецЕсли;

	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции 

Функция ЭтоАбсолютныйАдресИнтернетРесурса(АдресИнтернетРесурса) Экспорт
	Возврат СтрНайти(АдресИнтернетРесурса, "http") <> 0;
КонецФункции

#КонецОбласти

// Источники данных торгового предложения.
// 
// Возвращаемое значение:
//  Структура:
//  * ИнформационнаяБаза - Строка - источник данных торгового предложения в информационной базе.
//  * Сервис - Строка - источник данных торгового предложения в сервисе.
//
Функция ИсточникиДанныхТорговогоПредложения() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ИнформационнаяБаза", "ИнформационнаяБаза");
	Результат.Вставить("Сервис", "Сервис");
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти