#Область ПрограммныйИнтерфейс

// Функция - Текст сообщения о недоступной функциональности
// 
// Возвращаемое значение:
//  Строка
//
Функция ТекстСообщенияОНедоступнойФункциональности() Экспорт
	
	Возврат НСтр("ru = 'Эта возможность для мобильных устройств пока не реализована. Чтобы её использовать, войдите через браузер или настольное приложение'");
	
КонецФункции

// Функциональность временно недоступна.
// 
// Параметры:
//  Отказ - Булево - Отказ
// 
// Возвращаемое значение:
//  Булево - Функциональность временно недоступна
Функция ФункциональностьВременноНедоступна(Отказ) Экспорт
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОНедоступнойФункциональности(), , , , Отказ);
	
	Возврат Истина;
	
КонецФункции

// Функция - Названия элементов для настройки формы объекта мобильный клиент
// 
// Возвращаемое значение:
//  Структура:
//   * Организация - Строка
//   * ШапкаКарточка - Строка
//   * КолонкаСсылки - Строка
//   * ПодвалПраво - Строка
//   * ПодвалПравоСвернутый - Строка
//   * ПодвалСвернут - Строка
//   * ПодвалРазвернут - Строка
//   * Дата - Строка
//   * ГруппаОстатокВзаиморасчетов - Строка
//
Функция НазванияЭлементовДляНастройкиФормыОбъектаМобильныйКлиент() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация",          "Организация");
	Результат.Вставить("ШапкаКарточка",        "ШапкаКарточка");
	Результат.Вставить("КолонкаСсылки",        "КолонкаСсылки");
	Результат.Вставить("ПодвалПраво",          "ПодвалПраво");
	Результат.Вставить("ПодвалПравоСвернутый", "ПодвалПраво1");
	Результат.Вставить("ПодвалСвернут",        "ПодвалСвернут");
	Результат.Вставить("ПодвалРазвернут",      "ПодвалРазвернут");	
	Результат.Вставить("Дата",                 "Дата");
	
	Результат.Вставить("ГруппаОстатокВзаиморасчетов", "ГруппаОстатокВзаиморасчетов");
	
	Возврат Результат;
	
КонецФункции

// Настраивает форму объекта для корректного отображения в мобильном клиенте.
//
// Параметры:
//  ЭлементыФормы - ВсеЭлементыФормы
//  Таблицы - Строка - Имена элементов-таблицы
//  НазванияЭлементов - см. НазванияЭлементовДляНастройкиФормыОбъектаМобильныйКлиент
//
Процедура НастроитьФормуОбъектаМобильныйКлиент(ЭлементыФормы, Таблицы = "Запасы", НазванияЭлементов = Неопределено) Экспорт

	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Если НазванияЭлементов = Неопределено Тогда
		НазванияЭлементов = НазванияЭлементовДляНастройкиФормыОбъектаМобильныйКлиент();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, НазванияЭлементов.Организация,
		"ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Авто);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, НазванияЭлементов.Организация,
		"АвтоМаксимальнаяШирина", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, НазванияЭлементов.ШапкаКарточка,
		"ОтображатьКакКарточку", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, НазванияЭлементов.КолонкаСсылки,
		"ВертикальныйИнтервал", ИнтервалМеждуЭлементамиФормы.Авто);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, НазванияЭлементов.ПодвалПраво,
		"ГоризонтальноеПоложениеПодчиненных", ГоризонтальноеПоложениеЭлемента.Лево);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, НазванияЭлементов.ПодвалПравоСвернутый,
		"ГоризонтальноеПоложениеПодчиненных", ГоризонтальноеПоложениеЭлемента.Лево);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, НазванияЭлементов.Дата,
		"РастягиватьПоГоризонтали", Истина);

	НастроитьПодвалФормы(ЭлементыФормы, НазванияЭлементов);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы,
		НазванияЭлементов.ГруппаОстатокВзаиморасчетов, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто);
	
КонецПроцедуры


// Настраивает видимость и поведение подвала формы в мобильном клиенте.
//
// Параметры:
//   ЭлементыФормы - ЭлементыФормы - коллекция элементов формы для настройки
//   НазванияЭлементов - см. НазванияЭлементовДляНастройкиФормыОбъектаМобильныйКлиент
Процедура НастроитьПодвалФормы(ЭлементыФормы, НазванияЭлементов = Неопределено) Экспорт
	
	Если НазванияЭлементов = Неопределено Тогда
		НазванияЭлементов = НазванияЭлементовДляНастройкиФормыОбъектаМобильныйКлиент();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, НазванияЭлементов.ПодвалСвернут,
		"Видимость", Ложь);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, НазванияЭлементов.ПодвалРазвернут,
		"Поведение", ПоведениеОбычнойГруппы.Обычное);			
		
КонецПроцедуры

// Настраивает вспомогательную форму для корректного отображения в мобильном клиенте.
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - форма, для которой следует настроить отображение.
//
Процедура НастроитьВспомогательнуюФормуМобильныйКлиент(Форма) Экспорт

	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;

	Если Форма.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Низ Тогда
		Форма.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Авто;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти