
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьПараметрыФормы();
	
	Если Не ЗначениеЗаполнено(ИсточникДанных) Тогда
		УстановитьИсточникДанныхПоУмолчанию();
	КонецЕсли;
		
	ЕстьПодсистемаРаботаСНоменклатурой = 
		ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.РаботаСНоменклатурой");
		
	ЗагрузкаДанныхИзСервиса = 
		ИсточникДанных = ТорговыеПредложенияСлужебныйКлиентСервер.ИсточникиДанныхТорговогоПредложения().Сервис;
		
	ЗагрузитьКарточкуТорговогоПредложенияВФоне();
	
	ЧитатьДанныеИзКорзины = ЗагрузкаДанныхИзСервиса;
	Если ЧитатьДанныеИзКорзины Тогда
		ЗапуститьЧтениеКорзины();
	КонецЕсли;

	ПроверятьНаличиеОшибокПредупреждений = Не ЗагрузкаДанныхИзСервиса;
	Если ПроверятьНаличиеОшибокПредупреждений Тогда
		ПозицияТорговогоПредложенияДляДиагностики = ПозицияТорговогоПредложенияДляДиагностики();
		ПроверитьНаличиеОшибокПредупрежденийНаСервере(ПозицияТорговогоПредложенияДляДиагностики, ЕстьПредупреждения);
		ПоказатьСкрытьКнопкуПредупреждений(Элементы, ЕстьПредупреждения);
	КонецЕсли;
	
	УстановитьНастройкиОформленияФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОжидатьЗавершенияФоновогоЗаданияЗагрузкиКарточки();
	ОжидатьЗавершенияЧтенияКорзины();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТорговыеПредложения_ИзменитьКоличествоВЗаказе"
		И Параметр.ИдентификаторЗаказа = ИдентификаторЗаказа
		И Параметр.Идентификатор = Идентификатор
		И Источник <> ЭтотОбъект Тогда
				
		Параметр.Свойство("Количество", КоличествоВКорзине);
		КоличествоВКорзинеДоИнтерактивногоИзменения = КоличествоВКорзине;
				
	ИначеЕсли ИмяСобытия = "ТорговыеПредложения_УдалитьИзЗаказа"
		И Параметр.ИдентификаторЗаказа = ИдентификаторЗаказа
		И Источник <> ЭтотОбъект Тогда
			
		ИдентификаторыПредложений = Новый Массив;
		Параметр.Свойство("ИдентификаторыПредложений", ИдентификаторыПредложений);
		Если Не ЗначениеЗаполнено(ИдентификаторыПредложений)
			Или ИдентификаторыПредложений.Найти(Идентификатор) = Неопределено Тогда
			Возврат;
		КонецЕсли;

		КоличествоВКорзине = 0;
		КоличествоВКорзинеДоИнтерактивногоИзменения = 0;
		
	ИначеЕсли ИмяСобытия = "ТорговыеПредложения_ПеречитатьДанныеКорзины" Тогда
		
		ПеречитатьДанныеКорзиныИзХранилища(Параметр.АдресДанныхКорзины);
	
	ИначеЕсли ИмяСобытия = "ТорговыеПредложения_ОбновлениеСостоянийТорговыхПредложений" 
		И Источник <> ЭтотОбъект Тогда
			
		Если Не ТребуетсяОбновитьДанныеКарточкиПослеДиагностики(Параметр) Тогда
			Возврат;
		КонецЕсли;
		
		ЗагрузитьКарточкуТорговогоПредложенияВФоне(); 
		ОжидатьЗавершенияФоновогоЗаданияЗагрузкиКарточки();
		
		ПроверитьНаличиеОшибокПредупрежденийНаСервере(ПозицияТорговогоПредложенияДляДиагностики, ЕстьПредупреждения);
		ПоказатьСкрытьКнопкуПредупреждений(Элементы, ЕстьПредупреждения);
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЧитатьДанныеИзКорзины Тогда
		НастроитьВидимостьЭлементовИКомандУправленияКорзиной(Элементы, КоличествоВКорзине);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_АдресПредварительногоИзображенияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработатьНажатиеПредварительногоПросмотра(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

#Если Не ВебКлиент Тогда
	
	Если Не ПустаяСтрока(АдресКартинки) И ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("АдресВХранилище", АдресКартинки);
		ЭлементСписка = КэшИзображений.НайтиСтроки(ПараметрыОтбора);

		ФайловаяСистемаКлиент.ОткрытьФайл(АдресКартинки, , ЭлементСписка[0].РасширениеФайла);

	КонецЕсли;
	
#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура КатегорияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОчиститьСообщения();
	
	ПараметрыОткрытия = ПараметрыОткрытияФормыПоиска();
	ПараметрыОткрытия.ИдентификаторКатегории = ИдентификаторКатегории;
	Оповестить("ТорговыеПредложения_ПоискПоОтборам_Обновить", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНоменклатурыСервисаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОчиститьСообщения();

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИдентификаторНоменклатуры", ИдентификаторНоменклатурыСервиса);
	ПараметрыОткрытия.Вставить("ИдентификаторХарактеристики", ИдентификаторХарактеристикиСервиса);

	// Открытие формы если существует подсистема РаботаСНоменклатурой
	Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСНоменклатуройКлиент");
	Модуль.ОткрытьФормуКарточкиНоменклатуры(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОткрытия), ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура КоличествоВКорзинеРегулирование(Элемент, Направление, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	КоличествоВКорзинеОбработкаРегулирования(Направление);
	
	Если КоличествоВКорзине = 0 
		Или ТорговыеПредложенияКлиент.КоличествоВведеноКорректно(
		КоличествоВКорзине, МинимальноеКоличество, КратностьУпаковкиЧислом) Тогда
		ОбработатьИзмененияКоличестваВКорзине();
	Иначе
		КоличествоВКорзине = КоличествоВКорзинеДоИнтерактивногоИзменения;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура КоличествоВКорзинеПриИзменении(Элемент)
	
	Если КоличествоВКорзине = 0 
		Или ТорговыеПредложенияКлиент.КоличествоВведеноКорректно(
		КоличествоВКорзине, МинимальноеКоличество, КратностьУпаковкиЧислом) Тогда
		ОбработатьИзмененияКоличестваВКорзине();
	Иначе
		КоличествоВКорзине = КоличествоВКорзинеДоИнтерактивногоИзменения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеКонтрагентаГиперссылкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОчиститьСообщения();

	ПараметрыОткрытия = БизнесСетьКлиентСервер.ОписаниеИдентификацииОрганизацииКонтрагентов();
	ПараметрыОткрытия.ИНН = ИННКонтрагента;
	ПараметрыОткрытия.КПП = КППКонтрагента;
	БизнесСетьСлужебныйКлиент.ОткрытьПрофильУчастника(ПараметрыОткрытия);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВКорзину(Команда)
	
	Если КоличествоВКорзине = 0 Тогда
		КоличествоВКорзине = Макс(МинимальноеКоличество, КратностьУпаковкиЧислом);
	КонецЕсли;
	КоличествоВКорзинеДоИнтерактивногоИзменения = КоличествоВКорзине;
	
	ДобавитьТоварИзменитьКоличество();
	
КонецПроцедуры

&НаКлиенте
Процедура СледующаяКартинка(Команда)
	ПереключитьИзображение(1);
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяКартинка(Команда)
	ПереключитьИзображение(-1);
КонецПроцедуры 

&НаКлиенте
Процедура ПерейтиВКорзину(Команда)
	ОчиститьСообщения();
	ТорговыеПредложенияКлиент.ОткрытьФормуКорзины(Организация, , , Идентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьТекущуюДлительнуюОперацию(Команда)
	
	ЗагрузитьКарточкуТорговогоПредложенияВФоне(); 
	ОжидатьЗавершенияФоновогоЗаданияЗагрузкиКарточки();

	Если ЧитатьДанныеИзКорзины Тогда
		ЗапуститьЧтениеКорзины();
		ОжидатьЗавершенияЧтенияКорзины();
	КонецЕсли;

	Если ПроверятьНаличиеОшибокПредупреждений Тогда
		ПозицияТорговогоПредложенияДляДиагностики = ПозицияТорговогоПредложенияДляДиагностики();
		ПроверитьНаличиеОшибокПредупрежденийНаСервере(ПозицияТорговогоПредложенияДляДиагностики, ЕстьПредупреждения);
		ПоказатьСкрытьКнопкуПредупреждений(Элементы, ЕстьПредупреждения);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьЖурналРегистрации(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Данные", НаименованиеФоновогоЗаданияПолучениеДанных);
	
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьОписание(Команда)
	ТорговыеПредложенияСлужебныйКлиент.ПоместитьТекстВБуфераОбмена(ОписаниеТовара);
КонецПроцедуры  

&НаКлиенте
Процедура КопироватьДополнительноеОписание(Команда)
	ТорговыеПредложенияСлужебныйКлиент.ПоместитьТекстВБуфераОбмена(ДополнительноеОписание);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждения(Команда)
		
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ПрайсЛист", ПрайсЛист);
	ПараметрыОткрытияФормы.Вставить("ТребуетсяВыполнитьПроверкуДанных", Ложь);
	
	ПозицияТорговогоПредложенияДляДиагностикиВМассиве = 
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПозицияТорговогоПредложенияДляДиагностики);
	ПараметрыОткрытияФормы.Вставить("ПозицииТорговыхПредложений", ПозицияТорговогоПредложенияДляДиагностикиВМассиве);
		
	ТорговыеПредложенияКлиент.ОткрытьФормуДиагностикиТорговыхПредложений(ПараметрыОткрытияФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область РаботаСКорзиной

#Область ЧтениеКорзины

&НаСервере
Процедура ЗапуститьЧтениеКорзины()
	
	ОтобразитьСтраницуДлительнойОперацииКорзины();
	АдресКорзины = ТорговыеПредложенияСлужебный.АдресКорзиныИзЛокальногоХранилища();

	ПараметрыМетода = Новый Структура;
	
	ПараметрыМетода.Вставить("Организация", Организация);
	ПараметрыМетода.Вставить("АдресКорзины", АдресКорзины);
	
	ФоновоеЗаданиеЧтениеКорзины = ТорговыеПредложенияСлужебный.СоздатьПрочитатьКорзинуВФоне(
		ПараметрыМетода, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершенияЧтенияКорзины()
	
	Если Не ЗначениеЗаполнено(ФоновоеЗаданиеЧтениеКорзины) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения    = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ЧтениеКорзиныЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗаданиеЧтениеКорзины, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеКорзиныЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ПеречитатьДанныеКорзиныИзХранилища(Результат.АдресРезультата); 
		
КонецПроцедуры

&НаСервере
Процедура ПеречитатьДанныеКорзиныИзХранилища(Знач АдресДанныхКорзиныВХранилище)
	
	ОтобразитьСтраницуДлительнойОперацииКорзины();

	КоличествоВКорзине = 0;
	КоличествоВКорзинеДоИнтерактивногоИзменения = 0;
	АдресКомандыИзменитьКоличество = "";
	АдресКомандыУдалить = "";

	Если Не ЗначениеЗаполнено(АдресДанныхКорзиныВХранилище) Тогда
		АдресКорзины = "";
		ОтобразитьСтраницуРезультатаКорзины();
		Возврат;
	КонецЕсли;
	
	ДанныеСервиса = ПолучитьИзВременногоХранилища(АдресДанныхКорзиныВХранилище);
	
	Если Не ЗначениеЗаполнено(ДанныеСервиса) Тогда
		АдресКорзины = "";
		ОтобразитьСтраницуРезультатаКорзины();
		Возврат;
	КонецЕсли;
	
	ДанныеКорзины = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСервиса, "ДанныеКорзины");
	
	Если Не ЗначениеЗаполнено(ДанныеКорзины) Тогда
		АдресКорзины = "";
		ОтобразитьСтраницуРезультатаКорзины();
		Возврат;
	КонецЕсли;
	
	АдресКорзины = ДанныеКорзины.АдресКорзины;
	АдресКомандыДобавить = ДанныеКорзины.АдресаКоманд.ДобавитьТовар;

	Для каждого Заказ Из ДанныеКорзины.Заказы Цикл 
		
		НайденнаяСтрокаТовара = Заказ.Товары.Найти(Идентификатор, "Идентификатор");
		Если НайденнаяСтрокаТовара <> Неопределено Тогда
			КоличествоВКорзине = НайденнаяСтрокаТовара.Количество;
			АдресКомандыИзменитьКоличество = НайденнаяСтрокаТовара.АдресаКоманд.УстановитьКоличество;
			АдресКомандыУдалить = НайденнаяСтрокаТовара.АдресаКоманд.УдалитьТовар;
			Прервать;
		КонецЕсли;
	
	КонецЦикла; 
	
	КоличествоВКорзинеДоИнтерактивногоИзменения = КоличествоВКорзине;
	
	ОтобразитьСтраницуРезультатаКорзины();
		
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КоличествоВКорзинеОбработкаРегулирования(Направление)
			
	ОстатокОтДеления = КоличествоВКорзине % КратностьУпаковкиЧислом;
	
	Если Направление = 1 Тогда
		Количество = КоличествоВКорзине + (КратностьУпаковкиЧислом - ОстатокОтДеления);
		КоличествоВКорзине = Макс(МинимальноеКоличество, Количество);
	Иначе
		Если КоличествоВКорзине = МинимальноеКоличество Тогда
			КоличествоВКорзине = 0;
		Иначе
			КоличествоВКорзине = КоличествоВКорзине 
				- (?(ОстатокОтДеления = 0, КратностьУпаковкиЧислом, ОстатокОтДеления));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура СоздатьКорзину(Знач Организация, АдресКорзины, АдресКомандыДобавитьТовар)
	ТорговыеПредложенияСлужебный.СоздатьКорзинуИЗаполнитьКоманды(Организация, АдресКорзины, АдресКомандыДобавитьТовар);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияКоличестваВКорзине()
	
	КоличествоВКорзинеДоИнтерактивногоИзменения = КоличествоВКорзине;
	Если КоличествоВКорзине > 0 Тогда
		ПодключитьОбработчикОжидания("ДобавитьТоварИзменитьКоличество", 0.5, Истина);
	Иначе
		ПодключитьОбработчикОжидания("УдалитьТоварИзКорзины", 0.5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварИзменитьКоличество()
	
	Если Не ЗначениеЗаполнено(АдресКорзины) Тогда
		
		СоздатьКорзину(Организация, АдресКорзины, АдресКомандыДобавить);
		
		Если Не ЗначениеЗаполнено(АдресКорзины) Или Не ЗначениеЗаполнено(АдресКомандыДобавить) Тогда
			Шаблон = НСтр("ru = 'Ошибка при создании корзины. Подробности в журнале регистрации.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(Шаблон);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействияНадТоваром", ЭтотОбъект);
	
	ПараметрыРаботыСТоваром = ТорговыеПредложенияКлиент.ОписаниеПараметровРаботыСТоваромКорзины();
	ПараметрыРаботыСТоваром.ИдентификаторТорговогоПредложения = Идентификатор;
	ПараметрыРаботыСТоваром.Организация                       = Организация;
	ПараметрыРаботыСТоваром.АдресКомандыДобавить              = АдресКомандыДобавить;
	ПараметрыРаботыСТоваром.АдресКомандыИзменитьКоличество    = АдресКомандыИзменитьКоличество;
	ПараметрыРаботыСТоваром.Количество                        = КоличествоВКорзине;
	ПараметрыРаботыСТоваром.ПрочитатьКорзину                  = Истина;
	ПараметрыРаботыСТоваром.АдресКорзины                      = АдресКорзины;

	ТорговыеПредложенияКлиент.ВыполнитьДействиеСТоваромКорзины(ПараметрыРаботыСТоваром, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТоварИзКорзины()
	
	ПараметрыОповещения = Новый Структура("Идентификатор", Идентификатор);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействияНадТоваром", ЭтотОбъект, ПараметрыОповещения);
	
	ПараметрыРаботыСТоваром = ТорговыеПредложенияКлиент.ОписаниеПараметровРаботыСТоваромКорзины();
	
	ПараметрыРаботыСТоваром.Организация         = Организация;
	ПараметрыРаботыСТоваром.АдресКомандыУдалить = АдресКомандыУдалить;
	ПараметрыРаботыСТоваром.АдресКорзины        = АдресКорзины;
	ПараметрыРаботыСТоваром.ВидОперации         = "Удаление";
	ПараметрыРаботыСТоваром.ПрочитатьКорзину    = Истина;
	
	ТорговыеПредложенияКлиент.ВыполнитьДействиеСТоваромКорзины(ПараметрыРаботыСТоваром, ЭтотОбъект, Оповещение);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыполненияДействияНадТоваром(Результат, ДополнительныеПараметры) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		Возврат;
	КонецЕсли;

	Если Не ДействиеНадТоваромВыполнено(Результат.АдресРезультата) Тогда
		Возврат;
	КонецЕсли;

	ТорговыеПредложенияКлиент.ОповеститьОбИзмененииКорзины(Результат.АдресРезультата, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДействиеНадТоваромВыполнено(Знач АдресРезультата)
	
	РезультатыДействияНадТоваром = ПолучитьИзВременногоХранилища(АдресРезультата);
	Ошибка = РезультатыДействияНадТоваром.Ошибка;
	Если Ошибка <> Неопределено Тогда
		Если Не ПустаяСтрока(Ошибка.ТекстОшибкиСервиса) Тогда
			ОбщегоНазначения.СообщитьПользователю(Ошибка.ТекстОшибкиСервиса);
		ИначеЕсли Не ПустаяСтрока(Ошибка.ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(Ошибка.ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Результат = Не  РезультатыДействияНадТоваром.Отказ;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСИзображениями  

&НаСервере
Процедура СформироватьЭлементыИзображений()
	
	ДобавитьЭлементыПредварительныхИзображений();
	УстановитьОформлениеПредварительныхИзображений(Элементы, ИндексТекущегоИзображения, 
		ИндексСледующегоИзображения, НастройкиОформленияПредварительныхИзображений);
		
	ПоказатьИзображение(АдресКартинки, КэшИзображений, ИндексСледующегоИзображения);

КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыПредварительныхИзображений()
	
	КоличествоИзображений = КэшИзображений.Количество();
	Если КоличествоИзображений = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ВысотаПредварительныхИзображений = 2;
	Для Счетчик = 1 По КоличествоИзображений Цикл
		
		ИмяЭлемента = СтрШаблон("%1%2", ИмяЭлементаПредварительногоИзображения(), Счетчик);
		НайденныйЭлемент = Элементы.Найти(ИмяЭлемента); 
		Если НайденныйЭлемент <> Неопределено Тогда
			НайденныйЭлемент.Видимость = Счетчик <= КоличествоВидимыхПредварительныхИзображений;
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаПредварительныеИзображения);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеКартинки;
		НовыйЭлемент.ПутьКДанным = СтрШаблон("КэшИзображений[%1].АдресВХранилище", Счетчик - 1);
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.Высота = ВысотаПредварительныхИзображений;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
		НовыйЭлемент.РазмерКартинки = РазмерКартинки.АвтоРазмерБезУчетаМасштаба;
		НовыйЭлемент.ТекстНевыбраннойКартинки = НСтр("ru = 'Нет изображения'", ОбщегоНазначения.КодОсновногоЯзыка());
		НовыйЭлемент.Шрифт = ШрифтыСтиля.ПодзаголовокПервогоУровня;
		НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_АдресПредварительногоИзображенияНажатие");
 		НовыйЭлемент.Видимость = Счетчик <= КоличествоВидимыхПредварительныхИзображений;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКоличествоВидимыхПредварительныхИзображений()
	
	КоличествоИзображений = КэшИзображений.Количество();
	КоличествоВидимыхПредварительныхИзображений = 4;
	
	Если КоличествоИзображений > КоличествоВидимыхПредварительныхИзображений Тогда
		КоличествоВидимыхПредварительныхИзображений = КоличествоВидимыхПредварительныхИзображений - 1;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеПредварительногоПросмотра(Элемент)
	
	ПорядковыйНомерПредварительногоИзображения = ПорядковыйНомерПредварительногоИзображения(Элемент);
	ИндексСледующегоИзображения = Макс(ПорядковыйНомерПредварительногоИзображения - 1, 0);
	
	Если ИндексСледующегоИзображения = ИндексТекущегоИзображения Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьИзображение(АдресКартинки, КэшИзображений, ИндексСледующегоИзображения);
	
	УстановитьОформлениеПредварительныхИзображений(Элементы, ИндексТекущегоИзображения, 
		ИндексСледующегоИзображения, НастройкиОформленияПредварительныхИзображений);
	
	ИндексТекущегоИзображения = ИндексСледующегоИзображения;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПорядковыйНомерПредварительногоИзображения(Элемент)

	НомерПредварительногоИзображенияСтрокой = СтрЗаменить(Элемент.Имя, ИмяЭлементаПредварительногоИзображения(), "");
	НомерПредварительногоИзображения = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НомерПредварительногоИзображенияСтрокой);
	
	Возврат НомерПредварительногоИзображения;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьИзображение(АдресКартинки, КэшИзображений, ИндексИзображения)
	
	Если ИндексИзображения > КэшИзображений.Количество() - 1 Тогда
		Возврат;
	КонецЕсли;
	
	АдресКартинки = КэшИзображений[ИндексИзображения].АдресВХранилище;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция ИмяЭлементаПредварительногоИзображения()
	Возврат "АдресПредварительногоИзображения";	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОформлениеПредварительныхИзображений(Элементы, 
	ИндексТекущегоИзображения, ИндексСледующегоИзображения, НастройкиОформления)
	
	ИмяЭлементаБезНомера = ИмяЭлементаПредварительногоИзображения(); 
		
	// Снять "рамку" предыдущему выделенному элементу
	ИмяВыделенногоЭлемента = СтрШаблон("%1%2", ИмяЭлементаБезНомера, ИндексТекущегоИзображения + 1);
	Для каждого ЭлементНастроек Из НастройкиОформления.ТекущийВыделенныйЭлемент Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, ИмяВыделенногоЭлемента, ЭлементНастроек.Ключ, ЭлементНастроек.Значение);
	КонецЦикла;
	
	// Установить "рамку" новому выделенному элементу 
	ИмяСледующегоЭлемента = СтрШаблон("%1%2", ИмяЭлементаБезНомера, ИндексСледующегоИзображения + 1);
	Для каждого ЭлементНастроек Из НастройкиОформления.НовыйВыделенныйЭлемент Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, ИмяСледующегоЭлемента, ЭлементНастроек.Ключ, ЭлементНастроек.Значение);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьИзображение(Направление)
	
	НомераВидимыхПредварительныхИзображений = Новый Массив;
	Для каждого Элемент Из Элементы.ГруппаПредварительныеИзображения.ПодчиненныеЭлементы Цикл
		Если Элемент.Видимость Тогда
			НомераВидимыхПредварительныхИзображений.Добавить(ПорядковыйНомерПредварительногоИзображения(Элемент));
		КонецЕсли;
	КонецЦикла;
	
	Если Направление > 0 Тогда 
		
		НомерЭлементаДляСнятияВидимости = НомераВидимыхПредварительныхИзображений[0];
		НомерЭлементаДляУстановкиВидимости = 
			НомераВидимыхПредварительныхИзображений[НомераВидимыхПредварительныхИзображений.ВГраница()] + 1;	
		ИмяКнопкиДляУстановкиДоступности = "ПредыдущаяКартинка";

		// Снимаем доступность кнопки СледующаяКартинка, если достигли конца коллекции
		Если НомерЭлементаДляУстановкиВидимости = КэшИзображений.Количество() Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "СледующаяКартинка", "Доступность", Ложь);
		КонецЕсли;
		
	Иначе
		
		НомерЭлементаДляСнятияВидимости = 
			НомераВидимыхПредварительныхИзображений[НомераВидимыхПредварительныхИзображений.ВГраница()];
		НомерЭлементаДляУстановкиВидимости = НомераВидимыхПредварительныхИзображений[0] - 1;	
        ИмяКнопкиДляУстановкиДоступности = "СледующаяКартинка";

		// Снимаем доступность кнопки ПредыдущаяКартинка, если достигли конца коллекции
		Если НомерЭлементаДляУстановкиВидимости = 1 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ПредыдущаяКартинка", "Доступность", Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	// Получаем имя элемента для снятия видимости
	ИмяЭлементаДляСнятияВидимости = СтрШаблон("%1%2", 
		ИмяЭлементаПредварительногоИзображения(), 
		НомерЭлементаДляСнятияВидимости);

	// Снимаем видимость элемента
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, ИмяЭлементаДляСнятияВидимости, "Видимость", Ложь);		

	// Получаем имя элемента для показа
	ИмяЭлементаДляУстановкиВидимости = СтрШаблон("%1%2", 
		ИмяЭлементаПредварительногоИзображения(), 
		НомерЭлементаДляУстановкиВидимости);
			
	// Устанавливаем видимость следующего элемента
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, ИмяЭлементаДляУстановкиВидимости, "Видимость", Истина); 

	// Устанавливаем доступность кнопки
	Если Не ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(
				Элементы, ИмяКнопкиДляУстановкиДоступности, "Доступность") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, ИмяКнопкиДляУстановкиДоступности, "Доступность", Истина);
	КонецЕсли;
		
КонецПроцедуры 

#КонецОбласти

#Область ОформлениеФормы

&НаСервере
Процедура УстановитьНастройкиОформленияФормы()
	УстановитьОтображениеПримечания();
	УстановитьНастройкиОформленияПредварительныхИзображений();
	УстановитьДоступностьКарточкиКорзины();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеПримечания()

	Если Не ЧитатьДанныеИзКорзины Тогда
		ДобавитьПримечание();
		ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиОформленияПредварительныхИзображений()

	НастройкиОформленияПредварительныхИзображений = Новый Структура;
	
	НастройкиДляТекущегоВыделенногоЭлемента = Новый Структура;
	НастройкиДляТекущегоВыделенногоЭлемента.Вставить(
		"ОтображениеФона", ОтображениеФонаКартинки.НеОтображать);
	НастройкиОформленияПредварительныхИзображений.Вставить(
		"ТекущийВыделенныйЭлемент", НастройкиДляТекущегоВыделенногоЭлемента);
	
	НастройкиДляНовогоВыделенногоЭлемента = Новый Структура;
	НастройкиДляНовогоВыделенногоЭлемента.Вставить(
		"ОтображениеФона", ОтображениеФонаКартинки.ОтображатьИНеУвеличиватьРазмер);
	НастройкиОформленияПредварительныхИзображений.Вставить(
		"НовыйВыделенныйЭлемент", НастройкиДляНовогоВыделенногоЭлемента);

КонецПроцедуры 

&НаСервере
Процедура УстановитьДоступностьКарточкиКорзины()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаКорзина", "Доступность", ЧитатьДанныеИзКорзины);
КонецПроцедуры

&НаСервере 
Процедура ДобавитьПримечание()
	
	КраткоеПредставление = НСтр("ru = 'Примечание'", ОбщегоНазначения.КодОсновногоЯзыка());
		
	Сообщение =
		НСтр("ru = 'Карточка торгового предложения отображается идентично тому, как она отображается покупателю'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.ТипСообщения = "Информация";
	ПараметрыСообщения.Идентификатор = ИдентификаторПримечания();
	ПараметрыСообщения.КраткоеПредставление = КраткоеПредставление;
	ПараметрыСообщения.Сообщение = Сообщение;
	ПараметрыСообщения.Скрываемый = Истина;
	ПараметрыСообщения.ОбработчикЗакрытия = "Подключаемый_УдалитьПримечание";
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(
		ЭтотОбъект,
		ПараметрыСообщения);
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьПримечание()
	ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(ЭтотОбъект, ИдентификаторПримечания());
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторПримечания()
	Возврат "ПримечаниеПубликуемогоТорговогоПредложения";
КонецФункции

#КонецОбласти

#Область РаботаСОшибкамиИПредупреждениями

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьСкрытьКнопкуПредупреждений(Элементы, Показывать)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ФормаПоказатьПредупреждения", "Видимость", Показывать);
КонецПроцедуры

&НаСервере
Функция ПозицияТорговогоПредложенияДляДиагностики()
	
	Результат = ТорговыеПредложенияСлужебный.НовыеДанныеПозицииТорговогоПредложенияИзБазы();
	Результат.ПрайсЛист = ПрайсЛист;
	Результат.Номенклатура = Номенклатура;
	Результат.Характеристика = Характеристика;
	Результат.Упаковка = Упаковка;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПроверитьНаличиеОшибокПредупрежденийНаСервере(Знач ПозицияТорговогоПредложения, ЕстьПредупреждения)
	ЕстьПредупреждения = 
		ТорговыеПредложенияСлужебный.ЕстьПредупрежденияПубликуемогоПредложения(ПозицияТорговогоПредложения);
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Функция ПараметрыОткрытияФормыПоиска()

	ПараметрыОткрытия = ТорговыеПредложенияКлиент.НовыеПараметрыОткрытияФормыПоиска();
	ПараметрыОткрытия.Валюта = Валюта;
	
	Возврат ПараметрыОткрытия;

КонецФункции

&НаСервере
Процедура ОтобразитьСтраницуДлительнойОперации()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Страницы", "ТекущаяСтраница", Элементы.СтраницаДлительнаяОперация);
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСтраницуЗаполненнойКарточки()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Страницы", "ТекущаяСтраница", Элементы.СтраницаСформированнаяКарточка);
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьСтраницуОшибки(Элементы)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Страницы", "ТекущаяСтраница", Элементы.СтраницаОшибка);
КонецПроцедуры 

&НаСервере
Процедура ОтобразитьСтраницуДлительнойОперацииКорзины()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницыУправлениеКорзиной",
		"ТекущаяСтраница", 
		Элементы.СтраницаУправленияКорзинойДлительнаяОперация);
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСтраницуРезультатаКорзины()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницыУправлениеКорзиной",
		"ТекущаяСтраница", 
		Элементы.СтраницаУправленияКорзинойРезультат);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКарточкуТорговогоПредложенияВФоне()

	ОтобразитьСтраницуДлительнойОперации();

	Если ФоновоеЗаданиеЗагрузкиКарточки <> Неопределено Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ФоновоеЗаданиеЗагрузкиКарточки.ИдентификаторЗадания);
		ФоновоеЗаданиеЗагрузкиКарточки.ИдентификаторЗадания = Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = 
		НСтр("ru = '1С:Бизнес-сеть. Чтение торгового предложения.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Организация", Организация);
	ПараметрыПроцедуры.Вставить("Идентификатор", Идентификатор);
	ПараметрыПроцедуры.Вставить("Валюта", Валюта);
	ПараметрыПроцедуры.Вставить("Номенклатура", Номенклатура);
	ПараметрыПроцедуры.Вставить("Характеристика", Характеристика);
	ПараметрыПроцедуры.Вставить("ИсточникДанных", ИсточникДанных);
	ПараметрыПроцедуры.Вставить("ПрайсЛист", ПрайсЛист);
	ПараметрыПроцедуры.Вставить("Упаковка", Упаковка);
	
	НаименованиеФоновогоЗаданияПолучениеДанных = ПараметрыВыполнения.НаименованиеФоновогоЗадания;
	
	ФоновоеЗаданиеЗагрузкиКарточки = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ТорговыеПредложенияСлужебный.ДанныеТорговогоПредложенияДляВыводаВКарточку",
		ПараметрыПроцедуры);

КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершенияФоновогоЗаданияЗагрузкиКарточки()

	Если ФоновоеЗаданиеЗагрузкиКарточки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ФоновоеЗаданиеЗагрузкиКарточки.Статус = "Выполнено" Тогда
		ОбновитьКарточкуТорговогоПредложения(ФоновоеЗаданиеЗагрузкиКарточки, Неопределено);
	ИначеЕсли ФоновоеЗаданиеЗагрузкиКарточки.Статус = "Выполняется" Тогда
		// Инициализация обработчик ожидания завершения.
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Чтение торгового предложения.'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.Вставить("ИдентификаторЗадания", ФоновоеЗаданиеЗагрузкиКарточки.ИдентификаторЗадания);
		
		ОповещениеЗавершенияЗагрузки = Новый ОписаниеОповещения("ОбновитьКарточкуТорговогоПредложения",
			ЭтотОбъект, ФоновоеЗаданиеЗагрузкиКарточки);
			
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ФоновоеЗаданиеЗагрузкиКарточки, ОповещениеЗавершенияЗагрузки, ПараметрыОжидания);
			
	ИначеЕсли ФоновоеЗаданиеЗагрузкиКарточки.Статус = "Ошибка" Тогда
		ОтобразитьСтраницуОшибки(Элементы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарточкуТорговогоПредложения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ОтобразитьСтраницуОшибки(Элементы);	
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьКарточкуТорговогоПредложенияНаСервере(Результат.АдресРезультата);
	
	Если ЭтоВзрослаяКатегория
		И КэшИзображений.Количество() > 0 Тогда
		
		ИмяПроцедуры = "ВопросПоказатьИзображениеВзрослойКатегории";
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения(ИмяПроцедуры, ЭтотОбъект);
		ТорговыеПредложенияСлужебныйКлиент.ПользователюБольше18Лет(ЭтотОбъект, ОписаниеОповещенияОЗавершении);
		
	КонецЕсли;		

КонецПроцедуры 

&НаСервере
Процедура ОбновитьКарточкуТорговогоПредложенияНаСервере(АдресРезультата)
	
	ПараметрыВывода = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если Не ЗначениеЗаполнено(ПараметрыВывода) Тогда
		ОтобразитьСтраницуОшибки(Элементы);	
		Возврат;
	КонецЕсли;
	
	ИсключаяСвойства = "Свойства, РегионыДоставки, АдресаСамовывоза, Штрихкоды, ДополнительноеОписание";
	
	// Заполнить данные
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыВывода, , ИсключаяСвойства);
	ЗаполнитьЗаголовок(ПараметрыВывода);
	ЗаполнитьНаименование(ПараметрыВывода);
	ЗаполнитьКатегорию(ПараметрыВывода);
	ЗаполнитьОписание(ПараметрыВывода);
	ЗаполнитьПредставлениеЦен(ПараметрыВывода);
	ЗаполнитьМатрицуЦен(ПараметрыВывода);
	ЗаполнитьСвойстваТорговогоПредложения(ПараметрыВывода);
	ЗаполнитьРегионыДоставки(ПараметрыВывода);
    ЗаполнитьАдресаСамовывоза(ПараметрыВывода);
	ЗаполнитьШтрихкоды(ПараметрыВывода); 
	ЗаполнитьКратностьУпаковки(ПараметрыВывода);
	ВычислитьМинимальноеКоличествоДляЗаказа(); 
	ЗаполнитьПредставлениеНДСКорзина(ПараметрыВывода);
	
	ИндексТекущегоИзображения = 0;
	ИндексСледующегоИзображения = 0;
	ЭтоВзрослаяКатегория = Ложь;
	
	ЗагрузитьИзображения(ПараметрыВывода.ДанныеИзображений);
	УстановитьКоличествоВидимыхПредварительныхИзображений();
	
	Если ЗначениеЗаполнено(ПараметрыВывода.РодительскиеКатегории)
		И ТорговыеПредложенияСлужебный.ЕстьВзрослаяКатегорияСредиРодительских(
			ПараметрыВывода.РодительскиеКатегории) Тогда 
		ЭтоВзрослаяКатегория = Истина;
	Иначе
		СформироватьЭлементыИзображений();
	КонецЕсли;
	
	НастроитьВидимостьЭлементов();
	ОтобразитьСтраницуЗаполненнойКарточки();

КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьЭлементов()
			
	// Команды управления изображением
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, 
		"ПредыдущаяКартинка", 
		"Видимость", 
		КэшИзображений.Количество() > КоличествоВидимыхПредварительныхИзображений);
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, 
		"СледующаяКартинка", 
		"Видимость", 
		КэшИзображений.Количество() > КоличествоВидимыхПредварительныхИзображений);
				
	// Артикул
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "Артикул", "Видимость", Не ПустаяСтрока(Артикул));
	
	// Категория
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "Категория", "Видимость", Не ПустаяСтрока(Категория));
	
	// 1С:Номенклатура
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "ПредставлениеНоменклатурыСервиса", "Видимость", Не ПустаяСтрока(ПредставлениеНоменклатурыСервиса));
		
	// Цена до скидки
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "ЦенаДоСкидки", "Видимость", Не ПустаяСтрока(ЦенаДоСкидкиПредставление));
	
	// Описание
	ЕстьОписаниеТовара = Не ПустаяСтрока(ОписаниеТовара);
	ЕстьДополнительноеОписание = Не ПустаяСтрока(ДополнительноеОписание);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "СтраницаОписание", "Видимость", ЕстьОписаниеТовара Или ЕстьДополнительноеОписание);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "ГруппаОписание", "Видимость", ЕстьОписаниеТовара);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "ГруппаДополнительноеОписание", "Видимость", ЕстьДополнительноеОписание);
		
	// Матрица цен
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "СтраницаМатрицаЦен", "Видимость", Цены.Количество() > 1);
		
	// Информация о поставщике
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "ТелефонКонтрагента", "Видимость", Не ПустаяСтрока(ТелефонКонтрагента));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "СайтКонтрагента", "Видимость", Не ПустаяСтрока(СайтКонтрагента));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "ЭлектроннаяПочтаКонтрагента", "Видимость", Не ПустаяСтрока(ЭлектроннаяПочтаКонтрагента));
	
	// Контактная информация
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "ГруппаКонтактнаяИнформацияИмя", "Видимость", Не ПустаяСтрока(ПредставлениеКонтакта));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "ГруппаКонтактнаяИнформацияТелефон", "Видимость", Не ПустаяСтрока(Телефон));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "ГруппаКонтактнаяИнформацияЭлектроннаяПочта", "Видимость", Не ПустаяСтрока(ЭлектроннаяПочта));
	
	// Свойства
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "СтраницаСвойства", "Видимость", Свойства.Количество() > 0);
		
	// Доставка
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "СтраницаДоставка", "Видимость", РегионыДоставки.Количество() > 0);
		
	// Самовывоз
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "СтраницаСамовывоз", "Видимость", АдресаСамовывоза.Количество() > 0);
		
	// Штрихкоды
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	 	Элементы, "СтраницаШтрихкоды", "Видимость", Штрихкоды.Количество() > 0);
		
	// Элементы управления корзиной
	НастроитьВидимостьЭлементовИКомандУправленияКорзиной(Элементы, КоличествоВКорзине);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьЭлементовИКомандУправленияКорзиной(Элементы, КоличествоВКорзине)
	
	ЕстьТоварВКорзине = КоличествоВКорзине > 0;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДобавитьВКорзину", "Видимость", Не ЕстьТоварВКорзине);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "КоличествоВКорзине", "Видимость", ЕстьТоварВКорзине); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "УдалитьИзКорзины", "Видимость", ЕстьТоварВКорзине); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ВопросПоказатьИзображениеВзрослойКатегории(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Значение = КодВозвратаДиалога.Да Тогда
		СформироватьЭлементыИзображений();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовок(ПараметрыВывода)
	
	Заголовок = СтрЗаменить(ПараметрыВывода.Заголовок, Символы.ПС, " ");
	Если ПустаяСтрока(Заголовок) Тогда 
		ПараметрыВывода.Заголовок = СтрШаблон(
			НСтр("ru = '%1, %2 (Торговое предложение)'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ПараметрыВывода.Наименование,
			ПараметрыВывода.НаименованиеКонтрагента);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьНаименование(ПараметрыВывода)

	Если ЗначениеЗаполнено(ПараметрыВывода.Наименование) Тогда
		Наименование = ПараметрыВывода.Наименование;
	ИначеЕсли ЗначениеЗаполнено(ПараметрыВывода.Заголовок) Тогда
		Наименование = ПараметрыВывода.Заголовок;
	ИначеЕсли ЗначениеЗаполнено(ПараметрыВывода.ПредставлениеНоменклатурыСервиса) Тогда
		Наименование = СтрШаблон("%1%2", 
			ПараметрыВывода.ПредставлениеНоменклатурыСервиса, 
			?(ЗначениеЗаполнено(ПараметрыВывода.ПредставлениеХарактеристикиСервиса), 
				СтрШаблон(", %1", ПараметрыВывода.ПредставлениеХарактеристикиСервиса), 
				""));
	Иначе
		Наименование = НСтр("ru = 'не заполнено'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзображения(ДанныеИзображений)
	
	КэшИзображений.Очистить();
	
	Если Не ЗначениеЗаполнено(ДанныеИзображений) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеИзображения Из ДанныеИзображений Цикл
		
		АдресВХранилище = ПоместитьВоВременноеХранилище(ДанныеИзображения.Значение, УникальныйИдентификатор);
		
		НоваяСтрокаКэшаИзображений = КэшИзображений.Добавить();
		НоваяСтрокаКэшаИзображений.АдресВХранилище = АдресВХранилище;
		НоваяСтрокаКэшаИзображений.РасширениеФайла = 
			ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ДанныеИзображения.Представление);
			
	КонецЦикла;
				
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКатегорию(ПараметрыВывода)
	
	Если ЗначениеЗаполнено(ПараметрыВывода.ПредставлениеКатегории)
		И ЕстьПодсистемаРаботаСНоменклатурой Тогда
		Категория = ПараметрыВывода.ПредставлениеКатегории; 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписание(ПараметрыВывода)

	// Если есть описания номенклатуры из сервиса 1С:Номенклатура - используется оно, 
	// в обратном случае выводится описание номенклатуры поставщика.
	Если ЗначениеЗаполнено(ПараметрыВывода.ОписаниеНоменклатурыСервиса)
		И ЕстьПодсистемаРаботаСНоменклатурой Тогда
		ОписаниеТовара = ПараметрыВывода.ОписаниеНоменклатурыСервиса
	Иначе
		ОписаниеТовара = ПараметрыВывода.Описание;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияОписаниеТовара", "Заголовок", ОписаниеТовара);
	
	Если Не ПустаяСтрока(ПараметрыВывода.ДополнительноеОписание)
		И ПараметрыВывода.ДополнительноеОписание <> ПараметрыВывода.Описание Тогда
		ДополнительноеОписание = ПараметрыВывода.ДополнительноеОписание;	
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияДополнительноеОписание", "Заголовок", ДополнительноеОписание);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеЦен(ПараметрыВывода)

	ЦенаПредставление = ПараметрыВывода.ЦенаПубликацииСтрокой;
	Если ПустаяСтрока(ЦенаПредставление) Тогда
		ЦенаПредставление = НСтр("ru = 'По запросу'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	// Цена до скидки.
	Если ПараметрыВывода.МатрицаЦен <> Неопределено 
		И ПараметрыВывода.МатрицаЦен.Количество() > 0 Тогда
		
		ЦенаДоСкидки = ПараметрыВывода.МатрицаЦен[0].ЦенаДоСкидки;
		Если ЗначениеЗаполнено(ЦенаДоСкидки) Тогда
			ЦенаДоСкидкиПредставление = СтрШаблон(
					"%1 %2", 
					ЦенаДоСкидки, 
					ПараметрыВывода.ВалютаПубликации);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатрицуЦен(ПараметрыВывода)
	
	Цены.Очистить();
	
	Если ПараметрыВывода.МатрицаЦен = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЦеныДляОтображения = Новый Массив;
	Для каждого ЭлементКоллекции Из ПараметрыВывода.МатрицаЦен Цикл
		
		Если ЭлементКоллекции.Цена = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЦеныДляОтображения.Добавить(ЭлементКоллекции);
		
	КонецЦикла;
	
	Если ЦеныДляОтображения.Количество() < 1  Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементКоллекции Из ЦеныДляОтображения Цикл 
		
		НоваяСтрокаЦен = Цены.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрокаЦен, ЭлементКоллекции);
				
		ПредставлениеКоличества = СтрШаблон(НСтр("ru = 'От %1 %2.'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			ЭлементКоллекции.Количество, ПараметрыВывода.КраткоеПредставлениеЕдиницыИзмерения);
		
		ПредставлениеЦены = СтрШаблон(НСтр("ru = '%1 %2'"), 
			ЭлементКоллекции.Цена, ПараметрыВывода.ВалютаПубликации);
		
		НоваяСтрокаЦен.КоличествоПредставление   = ПредставлениеКоличества;
		НоваяСтрокаЦен.ЦенаПредставление         = ПредставлениеЦены;
		
		Если ЗначениеЗаполнено(ЭлементКоллекции.ЦенаДоСкидки) Тогда
			
			ПредставлениеЦеныДоСкидки = СтрШаблон(НСтр("ru = '%1 %2'"), 
				ЭлементКоллекции.ЦенаДоСкидки, ПараметрыВывода.ВалютаПубликации);
			
			НоваяСтрокаЦен.ЦенаДоСкидкиПредставление = ПредставлениеЦеныДоСкидки;
			
		КонецЕсли;
					
	КонецЦикла;	
		
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСвойстваТорговогоПредложения(ПараметрыВывода)
	
	Свойства.Очистить();
	
	Если ПараметрыВывода.Свойства = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементКоллекции Из ПараметрыВывода.Свойства Цикл
		ЗаполнитьЗначенияСвойств(Свойства.Добавить(), ЭлементКоллекции);
	КонецЦикла;
		
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьРегионыДоставки(ПараметрыВывода) 
	
	РегионыДоставки.Очистить();
	
	Если ПараметрыВывода.РегионыДоставки = Неопределено
		Или Не ЗначениеЗаполнено(ПараметрыВывода.РегионыДоставки) Тогда
		Возврат;
	КонецЕсли;
		
	Для каждого ЭлементКоллекции Из ПараметрыВывода.РегионыДоставки Цикл 
		НоваяСтрокаРегионыДоставки = РегионыДоставки.Добавить();
		НоваяСтрокаРегионыДоставки.АдресДоставки = ЭлементКоллекции.Представление;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьАдресаСамовывоза(ПараметрыВывода) 
	
	АдресаСамовывоза.Очистить();
	
	Если ПараметрыВывода.АдресаСамовывоза = Неопределено
		Или Не ЗначениеЗаполнено(ПараметрыВывода.АдресаСамовывоза) Тогда
		Возврат;
	КонецЕсли;
		
	Для каждого ЭлементКоллекции Из ПараметрыВывода.АдресаСамовывоза Цикл 
		НоваяСтрокаАдресСамовывоза = АдресаСамовывоза.Добавить();
		НоваяСтрокаАдресСамовывоза.АдресСамовывоза = ЭлементКоллекции.Представление;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШтрихкоды(ПараметрыВывода)
	
	Штрихкоды.Очистить();
	
	Если Не ЗначениеЗаполнено(ПараметрыВывода.Штрихкоды) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементКоллекции Из ПараметрыВывода.Штрихкоды Цикл
		НоваяСтрокаШтрихкода = Штрихкоды.Добавить();
		НоваяСтрокаШтрихкода.Штрихкод = СокрЛП(ЭлементКоллекции); 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКратностьУпаковки(ПараметрыВывода)

	КратностьУпаковкиЧислом = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ПараметрыВывода.КратностьУпаковки);
	Если КратностьУпаковкиЧислом = 0 Тогда
		КратностьУпаковкиЧислом = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьМинимальноеКоличествоДляЗаказа()
	
	МинимальноеКоличество = Макс(1, КратностьУпаковкиЧислом); 
	
	Если МинимальнаяСуммаЗаказаЧислом = 0 
		Или ЦенаПубликации = 0 Тогда
		Возврат;	
	КонецЕсли;

	МинимальноеКоличество = Цел(МинимальнаяСуммаЗаказаЧислом/ЦенаПубликации); 
	Пока МинимальноеКоличество % КратностьУпаковкиЧислом <> 0 Цикл
		МинимальноеКоличество = МинимальноеКоличество + 1;	
	КонецЦикла;
			
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПредставлениеНДСКорзина(ПараметрыВывода)
	
	ПредставлениеНДСКорзина = СтрШаблон(
		НСтр("ru = 'НДС %1'", ОбщегоНазначения.КодОсновногоЯзыка()), 
		ПараметрыВывода.ИнформацияНДС);
	МассивСтрок = СтрРазделить(ПредставлениеНДСКорзина, ",", Ложь);
	ПредставлениеНДСКорзина = СтрСоединить(МассивСтрок, Символы.ПС);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НадписьНДСКорзина", "Заголовок", ПредставлениеНДСКорзина); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИсточникДанныхПоУмолчанию()
	ИсточникДанных = ТорговыеПредложенияСлужебныйКлиентСервер.ИсточникиДанныхТорговогоПредложения().Сервис;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПараметрыФормы()
	
	Идентификатор = Параметры.Идентификатор;
	Параметры.Свойство("ИдентификаторЗаказа", ИдентификаторЗаказа);
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Валюта", Валюта);
	Параметры.Свойство("ИсточникДанных", ИсточникДанных);
	Параметры.Свойство("ПрайсЛист", ПрайсЛист);
	Параметры.Свойство("Упаковка", Упаковка);
	Параметры.Свойство("Номенклатура", Номенклатура);
	Параметры.Свойство("Характеристика", Характеристика);
	
КонецПроцедуры

&НаСервере
Функция ПозицияТорговогоПредложенияЕстьВПараметрахОповещения(ПараметрыОповещения)
	
	Результат = Ложь;
	
	КонтрольнаяСуммаТекущейПозицииТорговогоПредложения = 
		ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ПозицияТорговогоПредложенияДляДиагностики);
	
	ОбновленныеПозицииТорговыхПредложений = 
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОповещения, "ПозицииТорговыхПредложений");
	Если ОбновленныеПозицииТорговыхПредложений <> Неопределено Тогда
		Для Каждого ОбновленнаяПозиция Из ОбновленныеПозицииТорговыхПредложений Цикл
			КонтрольнаяСуммаОбновленнойПозиции = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ОбновленнаяПозиция);
			Если КонтрольнаяСуммаОбновленнойПозиции = КонтрольнаяСуммаТекущейПозицииТорговогоПредложения Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не Результат Тогда
		ОбновленныйПрайсЛист = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОповещения, "ПрайсЛист");
		Если ОбновленныйПрайсЛист = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		Если ОбновленныйПрайсЛист = ПозицияТорговогоПредложенияДляДиагностики.ПрайсЛист Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ТребуетсяОбновитьДанныеКарточкиПослеДиагностики(ПараметрыОповещения)
	
	Результат = Ложь;
	
	Если ПараметрыОповещения = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВыполненаПроверкаДанных = 
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОповещения, "ВыполненаПроверкаДанных", Ложь);
		
	Если Не ВыполненаПроверкаДанных Тогда
		Возврат Результат;
	КонецЕсли;

	Если Не ПозицияТорговогоПредложенияЕстьВПараметрахОповещения(ПараметрыОповещения) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти