Функция МенюСтраницПараметрыНовый() Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить( "ГруппаРодительИмя", "ГруппаМенюСтраниц" );
	Результат.Вставить( "ЭлементМенюСтраницИмя", "МенюСтраниц" );
	
	Результат.Вставить( "РеквизитТекущаяСтрокаДоПереключенияИмя", "МенюСтраницТекущаяСтрокаДоПереключения" );
	
	Результат.Вставить( "КартинкаСтрок", "ИнтеграцияСИнтернетМагазинамиКоллекцияИконок" );
	Результат.Вставить( "ВтораяКартинкаСтрок", "КаналыПродажСостоянияОбменаДанными" );
	
	Результат.Вставить( "СтрокиОтмечатьКорректноЗаполненные", Ложь );
	
	Результат.Вставить( "Ширина", 20 );
	Результат.Вставить( "ВысотаВСтрокахТаблицы", 12 );
	Результат.Вставить( "КолонкаНаименованиеШирина", 11 );
	Результат.Вставить( "КолонкаВтораяКартинкаСтрокиШирина", 2 );
	
	Результат.Вставить( "КнопкаНазадИспользование", Истина );
	Результат.Вставить( "КнопкаНазадИмя", "МенюСтраницНазад" );
	Результат.Вставить( "КнопкаНазадЗаголовок", "Назад" );
	Результат.Вставить( "КнопкаНазадДействие", "МенюСтраницНазад" );
	Результат.Вставить( "КнопкаНазадВидимость", Ложь );
	
	Результат.Вставить( "КнопкаВпередИспользование", Истина );
	Результат.Вставить( "КнопкаВпередИмя", "МенюСтраницВперед" );
	Результат.Вставить( "КнопкаВпередЗаголовок", "Далее" );
	Результат.Вставить( "КнопкаВпередДействие", "МенюСтраницВперед" );
	Результат.Вставить( "КнопкаВпередВидимость", Ложь );

	Результат.Вставить( "МенюСтраницВидимость", Истина );

	Результат.Вставить( "ДействиеПриАктивизацииСтроки", "МенюСтраницПриАктивизацииСтроки" );
	
	Возврат Результат;
	
КонецФункции

Функция МенюСтраницВтораяКартинкаНомерПустая() Экспорт
	Возврат -1;
КонецФункции

Функция МенюСтраницВтораяКартинкаНомерСтраницаЗаполненаКорректно() Экспорт
	Возврат 0;
КонецФункции

Функция МенюСтраницВтораяКартинкаНомерСтраницаЗаполненаНеКорректно() Экспорт
	Возврат 1;
КонецФункции

Процедура МенюСтраницПунктВтораяКартинкаСтрокиУстановить( Форма, ИмяСтраницы, НомерКартинки ) Экспорт

	МенюСтраницРеквизит = КаналыПродажКлиентСервер.МенюСтраницРеквизитПолучить( Форма );

    МенюСтраницСтроки = МенюСтраницРеквизит.НайтиСтроки( Новый Структура( "ИмяСтраницы", ИмяСтраницы ) );
    Для Каждого МенюСтраницСтрока Из МенюСтраницСтроки Цикл
		МенюСтраницСтрока.ВтораяКартинкаСтроки = НомерКартинки;
	КонецЦикла;
	
КонецПроцедуры

Процедура МенюСтраницТекущаяСтрокаУстановить( Форма, ИмяСтраницы ) Экспорт

	МенюСтраницРеквизит = КаналыПродажКлиентСервер.МенюСтраницРеквизитПолучить( Форма );
	МенюСтраницЭлемент = КаналыПродажКлиентСервер.МенюСтраницЭлементПолучить( Форма );
                                                            
    МенюСтраницСтроки = МенюСтраницРеквизит.НайтиСтроки( Новый Структура( "ИмяСтраницы", ИмяСтраницы ) );
    Для Каждого МенюСтраницСтрока Из МенюСтраницСтроки Цикл
		МенюСтраницЭлемент.ТекущаяСтрока = МенюСтраницРеквизит.Индекс( МенюСтраницСтрока );
		Прервать;
	КонецЦикла;
	
КонецПроцедуры

Процедура МенюСтраницПунктДоступностьУстановить( Форма, ИмяСтраницы, ДоступностьСтраницы ) Экспорт

	МенюСтраницРеквизит = КаналыПродажКлиентСервер.МенюСтраницРеквизитПолучить( Форма );
                                                            
    МенюСтраницСтроки = МенюСтраницРеквизит.НайтиСтроки( Новый Структура( "ИмяСтраницы", ИмяСтраницы ) );
    Для Каждого МенюСтраницСтрока Из МенюСтраницСтроки Цикл
		МенюСтраницСтрока.ДоступностьСтраницы = ДоступностьСтраницы;
		Форма.Элементы[ МенюСтраницСтрока.ИмяСтраницы ].Доступность = ДоступностьСтраницы;
		
		Если ДоступностьСтраницы = Ложь Тогда
			МенюСтраницСтрока.ВтораяКартинкаСтроки = МенюСтраницВтораяКартинкаНомерПустая(); 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура МенюСтраницДоступностьСтраницыДляПереключенияУстановить( Форма, ИмяСтраницы, Значение ) Экспорт

	МенюСтраницРеквизит = КаналыПродажКлиентСервер.МенюСтраницРеквизитПолучить( Форма );
                                                            
    МенюСтраницСтроки = МенюСтраницРеквизит.НайтиСтроки( Новый Структура( "ИмяСтраницы", ИмяСтраницы ) );
    Для Каждого МенюСтраницСтрока Из МенюСтраницСтроки Цикл
		МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Значение;
		
		Если Значение = Ложь Тогда
			МенюСтраницСтрока.ВтораяКартинкаСтроки = МенюСтраницВтораяКартинкаНомерПустая(); 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция МенюСтраницПараметрЗначениеПолучить( Форма, ПараметрИмя ) Экспорт
	Возврат Форма.МенюСтраницПараметры[ ПараметрИмя ];
КонецФункции

Функция МенюСтраницПараметрЗначениеУстановить( Форма, ПараметрИмя, Значение ) Экспорт
	Возврат Форма.МенюСтраницПараметры[ ПараметрИмя ] = Значение;
КонецФункции

Процедура ФормаКоманднаяПанельВидимостьУстановить( Форма, Значение ) Экспорт
	Форма.КоманднаяПанель.Видимость = Значение;
	Для Каждого КоманднаяПанельПодчиненныйЭлемент Из Форма.КоманднаяПанель.ПодчиненныеЭлементы Цикл
		КоманднаяПанельПодчиненныйЭлемент.Видимость = Значение;
	КонецЦикла;
КонецПроцедуры

Функция МенюСтраницЭлементПолучить( Форма ) Экспорт
	Результат = Форма.Элементы[ МенюСтраницПараметрЗначениеПолучить( Форма, "ЭлементМенюСтраницИмя" ) ];
	Возврат Результат;
КонецФункции

Функция МенюСтраницРеквизитПолучить( Форма ) Экспорт
 	Результат = Форма[ МенюСтраницПараметрЗначениеПолучить( Форма, "ЭлементМенюСтраницИмя" ) ];
 	Возврат Результат;
КонецФункции
