#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСкидкиТорговыхПредложений(Параметры) Экспорт
	
	Если Параметры.ТорговоеПредложение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТорговоеПредложение = Параметры.ТорговоеПредложение;
	Опт = Параметры.Опт;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкидкиТорговыхПредложений.ТорговоеПредложение КАК ТорговоеПредложение,
	|	СкидкиТорговыхПредложений.Количество КАК Количество,
	|	СкидкиТорговыхПредложений.ВидСкидки КАК ВидСкидки
	|ИЗ
	|	РегистрСведений.СкидкиТорговыхПредложений КАК СкидкиТорговыхПредложений
	|ГДЕ
	|	СкидкиТорговыхПредложений.ТорговоеПредложение = &ТорговоеПредложение
	|	И СкидкиТорговыхПредложений.Количество = 1";
	Запрос.УстановитьПараметр("ТорговоеПредложение", ТорговоеПредложение);
	
	Если Опт Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"И СкидкиТорговыхПредложений.Количество = 1", 
			"И СкидкиТорговыхПредложений.Количество <> 1");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Добавляет скидку торгового предложения. Ни в коем случае не использовать внутри явно открытой транзакции!
// 
// Параметры:
//  ТорговоеПредложение - ОпределяемыйТип.ТорговоеПредложение
//  ВидСкидки - ОпределяемыйТип.ВидыСкидок
//  Отказ - Булево
Процедура ДобавитьСкидкуТорговогоПредложения(ТорговоеПредложение, ВидСкидки, Отказ) Экспорт
	
	ТаблицаСкидкиТорговыхПредложений = НоваяТаблицаСкидкиТорговыхПредложенийДляСохранения();
	
	НоваяСтрокаТаблицыСкидок = ТаблицаСкидкиТорговыхПредложений.Добавить();
	НоваяСтрокаТаблицыСкидок.ТорговоеПредложение = ТорговоеПредложение;
	НоваяСтрокаТаблицыСкидок.ВидСкидки = ВидСкидки;
	НоваяСтрокаТаблицыСкидок.Количество = 1;
	
	Попытка 
		
		ДобавитьНовыеЗаписи(ТаблицаСкидкиТорговыхПредложений);
		
	Исключение
		
		Отказ = Истина;
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Добавление скидки торгового предложения'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.СкидкиТорговыхПредложений, 
			"СкидкиТорговыхПредложений.ДобавитьСкидкуТорговогоПредложения", 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
	КонецПопытки;
	
КонецПроцедуры

// Удаляет скидку торгового предложения. Ни в коем случае не использовать внутри явно открытой транзакции!
// 
// Параметры:
//  ТорговоеПредложение - ОпределяемыйТип.ТорговоеПредложение
//  ВидСкидки - ОпределяемыйТип.ВидыСкидок
//  Отказ - Булево
Процедура УдалитьСкидкуТорговогоПредложения(ТорговоеПредложение, ВидСкидки, Отказ) Экспорт
	
	ТаблицаСкидкиТорговыхПредложенийДляУдаления = НоваяТаблицаСкидкиТорговыхПредложенийДляУдаления();
	
	НоваяСтрокаТаблицыСкидокДляУдаления = ТаблицаСкидкиТорговыхПредложенийДляУдаления.Добавить();
	НоваяСтрокаТаблицыСкидокДляУдаления.ТорговоеПредложение = ТорговоеПредложение;
	НоваяСтрокаТаблицыСкидокДляУдаления.ВидСкидки = ВидСкидки;

	Попытка 

		УдалитьЗаписи(ТаблицаСкидкиТорговыхПредложенийДляУдаления);

	Исключение
		
		Отказ = Истина;
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Удаление скидки торгового предложения'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.СкидкиТорговыхПредложений, 
			"СкидкиТорговыхПредложений.УдалитьСкидкуТорговогоПредложения", 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Конструкторы

// Конструктор. Новая таблица скидки торговых предложений для сохранения.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. НоваяТаблицаСкидкиТорговыхПредложенийДляУдаления:
// * Количество - Число
Функция НоваяТаблицаСкидкиТорговыхПредложенийДляСохранения()
	
	ОписаниеТиповЧисло10 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10));

	Результат = НоваяТаблицаСкидкиТорговыхПредложенийДляУдаления();
	Результат.Колонки.Добавить("Количество", ОписаниеТиповЧисло10);
	
	Возврат Результат;
	
КонецФункции

// Конструктор. Новая таблица скидки торговых предложений для удаления.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
// * ТорговоеПредложение - ОпределяемыйТип.ТорговоеПредложение
// * ВидСкидки - ОпределяемыйТип.ВидыСкидок
Функция НоваяТаблицаСкидкиТорговыхПредложенийДляУдаления()
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("ТорговоеПредложение", Метаданные.ОпределяемыеТипы.ТорговоеПредложение.Тип);
	Результат.Колонки.Добавить("ВидСкидки", Метаданные.ОпределяемыеТипы.ВидыСкидок.Тип);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Добавляет новые записи в регистр в режиме замещения Добавление. Если записи из набора уже присутствуют в регистре,
// будет вызвано исключение.
// 
// Параметры:
//  ТаблицаСкидкиТорговыхПредложений - см. НоваяТаблицаСкидкиТорговыхПредложенийДляСохранения
Процедура ДобавитьНовыеЗаписи(ТаблицаСкидкиТорговыхПредложений)
	
	ИмяСобытия = НСтр("ru = 'Добавить новые записи скидок торговых предложений'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписатьНаборы(ТаблицаСкидкиТорговыхПредложений, РежимЗамещения.Добавление, ИмяСобытия);
	
КонецПроцедуры

// Удаляет переданные записи из регистра.
// 
// Параметры:
//  ТаблицаСкидкиТорговыхПредложенийДляУдаления - см. НоваяТаблицаСкидкиТорговыхПредложенийДляУдаления
Процедура УдалитьЗаписи(ТаблицаСкидкиТорговыхПредложенийДляУдаления) Экспорт
	
	ИмяСобытия = НСтр("ru = 'Удалить записи скидок торговых предложений'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписатьНаборы(ТаблицаСкидкиТорговыхПредложенийДляУдаления, РежимЗамещения.Удаление, ИмяСобытия);
		
КонецПроцедуры

// Записывает наборы из переданной таблицы с переданным режимом замещения
// 
// Параметры:
//  ТаблицаСкидкиТорговыхПредложений - см. НоваяТаблицаСкидкиТорговыхПредложенийДляСохранения,
//                                     см. НоваяТаблицаСкидкиТорговыхПредложенийДляУдаления
//  РежимЗамещенияЗаписей - ПеречислениеРежимЗамещения
//  ИмяСобытия - Строка
Процедура ЗаписатьНаборы(ТаблицаСкидкиТорговыхПредложений, РежимЗамещенияЗаписей, ИмяСобытия)
	
	ТорговыеПредложенияСлужебный.ЗаписатьНаборыРегистраСведений(
		РегистрыСведений.СкидкиТорговыхПредложений,
		ТаблицаСкидкиТорговыхПредложений,
		РежимЗамещенияЗаписей, 
		ИмяСобытия);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли