#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

// Инициализирует форму для работы с обратной связью
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, для которой необходимо инициализировать обратную связь
//
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	Если ОтправкаОбратнойСвязиОтключена() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормы = Форма.ИмяФормы;
	ПолноеИмяФормы = ИмяФормы;
	
	НастройкаОпроса = НастройкаОбратнойсвязиПоИмениФормы(ИмяФормы);
	Если НастройкаОпроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НастройкаОпроса.ВсеФормы Тогда
		ИмяФормы = "ВсеФормы";
	КонецЕсли;

	ОтправкаРазрешена = ОтправкаОбратнойСвязиРазрешена(ИмяФормы, НастройкаОпроса.Событие);
	Если Не ОтправкаРазрешена Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьПанельОпроса = Ложь;
	
	ЭтоОпросНачалоРаботы = НастройкаОпроса.ИдентификаторОпроса = "90ab5b6f-a1e9-46c4-a2e2-27574038a441";
	
	Если ЭтоОпросНачалоРаботы Тогда
		ОпытНачалоРаботы = ЗагрузитьНастройкуОпросаНачалоРаботы();
		Если ОпытНачалоРаботы = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если Не ОпытНачалоРаботы.УсловияДляПоказаОпросаВыполнены Тогда
			Возврат;
		КонецЕсли;
		
		// Не показываем опрос в "горячее" время
		ТекущийЧас = Час(ТекущаяДатаСеанса());
		Если ТекущийЧас >= 10 И ТекущийЧас < 12
			ИЛИ ТекущийЧас >= 14 И ТекущийЧас < 16 Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ОпытНачалоРаботы.ИмяОткрытойФормыСОпросом)
			И ОпытНачалоРаботы.ИмяОткрытойФормыСОпросом <> ПолноеИмяФормы Тогда
			Возврат;
		КонецЕсли;
		
		ОпытНачалоРаботы.ИмяОткрытойФормыСОпросом = ПолноеИмяФормы;
		СохранитьНастройкуОпросаНачалоРаботы(ОпытНачалоРаботы);
	
	КонецЕсли;
	
	ДобавитьРеквизитыФормы(Форма, НастройкаОпроса);
	ДобавитьКомандыФормы(Форма, НастройкаОпроса);
	ДобавитьЭлементыФормы(Форма, НастройкаОпроса);
	
	Форма.ОбратнаяСвязь_ИдентификаторОпроса = НастройкаОпроса.ИдентификаторОпроса;
	Форма.ОбратнаяСвязь_ПоказыватьОпрос = Ложь;
	
	Если ЭтоОпросНачалоРаботы Тогда
		
		Форма.ОбратнаяСвязь_ПоказыватьОпрос = Истина;
		ОбратнаяСвязьКлиентСервер.УстановитьВидимостьПанелиОбратнойСвязи(Форма);
		Возврат;
		
	КонецЕсли;
	
	Событие = "ВидимостьПанелиОпросаПриЗакрытииФормы";
	ПоказатьПанельОпроса = ЗагрузитьНастройкуОпроса(ИмяФормы, Событие, НастройкаОпроса.ИдентификаторОпроса);
	
	Если ПоказатьПанельОпроса <> Неопределено И ПоказатьПанельОпроса Тогда
		Событие = "ОбратнаяСвязь_Оценка";
		Форма.ОбратнаяСвязь_Оценка = ЗагрузитьНастройкуОпроса(ИмяФормы, Событие, НастройкаОпроса.ИдентификаторОпроса);
		
		Событие = "ОбратнаяСвязь_Пояснение";
		Форма.ОбратнаяСвязь_Пояснение = ЗагрузитьНастройкуОпроса(ИмяФормы, Событие, НастройкаОпроса.ИдентификаторОпроса);
		
		Форма.ОбратнаяСвязь_ПоказыватьОпрос = Истина;
		
		Элементы = Форма.Элементы;
		ОтправитьДоступность = Форма.ОбратнаяСвязь_Оценка <> 0 Или Не ПустаяСтрока(Форма.ОбратнаяСвязь_Пояснение);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбратнаяСвязь_Отправить", "Доступность",
			ОтправитьДоступность);
			
		ОбратнаяСвязьКлиентСервер.УстановитьВидимостьПанелиОбратнойСвязи(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Инициализирует форму объекта для работы с обратной связью
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, для которой необходимо инициализировать обратную связь
//  Ключ - ЛюбаяСсылка
//
Процедура ПриСозданииНаСервереФормаОбъекта(Форма, Ключ) Экспорт
	
	Если ОтправкаОбратнойСвязиОтключена() Тогда
		Возврат;
	КонецЕсли;

	ИмяФормы = Форма.ИмяФормы;

	НастройкаОпроса = НастройкаОбратнойсвязиПоИмениФормы(ИмяФормы);
	
	Если НастройкаОпроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормыОпроса = НастройкаОпроса.ПолноеИмяФормы;
	ОтправкаРазрешена = ОтправкаОбратнойСвязиРазрешена(ИмяФормыОпроса, НастройкаОпроса.Событие);
	Если Не ОтправкаРазрешена Тогда
		Возврат;
	КонецЕсли;

	ДобавитьРеквизитыФормыОбъекта(Форма);
	
	Форма.ОбратнаяСвязь_ЭтоНовыйОбъект = Ключ.Пустая();
	ПроведеноДокументовПользователем = ЗагрузитьНастройкуОпроса(Форма.ИмяФормы, "КоличествоПроведенныхДокументов",
		НастройкаОпроса.ИдентификаторОпроса);
	
	Если ПроведеноДокументовПользователем = Неопределено Тогда
		ПроведеноДокументовПользователем = 0;
	КонецЕсли;
	
	Форма.ОбратнаяСвязь_ПроведеноДокументовПользователем = ПроведеноДокументовПользователем;
	Форма.ОбратнаяСвязь_ПроведенийНовыхДляОпроса = НастройкаОпроса.ПроведенийНовыхДляОпроса;
	
КонецПроцедуры

// Сохраняет количество проведенных пользователем документов
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, для которой необходимо инициализировать обратную связь
//  РежимЗаписи - РежимЗаписиДокумента
//
Процедура ПослеЗаписиНаСервереФормаОбъекта(Форма, РежимЗаписи) Экспорт
	
	Если ОтправкаОбратнойСвязиОтключена() Тогда
		Возврат;
	КонецЕсли;

	ИспользуетсяОбратнаяСвязь = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,
		"ОбратнаяСвязь_ЭтоНовыйОбъект");
		
	Если Не ИспользуетсяОбратнаяСвязь Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормы = Форма.ИмяФормы;
	
	НастройкаОпроса = НастройкаОбратнойсвязиПоИмениФормы(ИмяФормы);
	
	Если НастройкаОпроса = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПроведеноДокументовПользователем = Форма.ОбратнаяСвязь_ПроведеноДокументовПользователем;
	МаксимальноеЗначениеСчетчика = 6;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Форма.ОбратнаяСвязь_ЭтоНовыйОбъект
		И ПроведеноДокументовПользователем < МаксимальноеЗначениеСчетчика Тогда
		СохранитьНастройкуОпроса(ИмяФормы, "КоличествоПроведенныхДокументов", ПроведеноДокументовПользователем + 1,
			НастройкаОпроса.ИдентификаторОпроса);
		Форма.ОбратнаяСвязь_ПроведеноДокументовПользователем = ПроведеноДокументовПользователем + 1;
	КонецЕсли;

КонецПроцедуры

// Вызывается из обработчика ПередЗаписьюНаСервере в формах документов.
// Увеличивает счетчик новых проведенных документов для пользователей без опыта работы
//
// Параметры:
//  Отказ - Булево - Признак отказа от записи документа.
//  Источник - ДокументОбъект - Документ, который записывается.
//  РежимЗаписи - РежимЗаписиДокумента - Режим записи документа.
//
Процедура ПередЗаписьюДокумента(Отказ, Источник, РежимЗаписи) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Источник.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ОпытНачалоРаботы = ЗагрузитьНастройкуОпросаНачалоРаботы();
	
	Если ОпытНачалоРаботы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ОпытНачалоРаботы) = Тип("Структура") И ОпытНачалоРаботы.Свойство("ЭтоПользовательБезОпыта") Тогда
		УвеличитьСчетчикПроведенныхДокументов(ОпытНачалоРаботы);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// Возвращает ключи настроек хранения обратной связи.
//
// Параметры:
//  ИмяФормы - Строка
//  ИмяСобытия - Строка
//
// Возвращаемое значение:
//  Структура - ключи настроек хранения обратной связи:
//   * КлючОбъекта - Строка
//   * ФормаОбъекта - Строка
//   * КлючНастроек - Строка
//
Функция КлючиНастроекХраненияОбратнойСвязи(ИмяФормы, ИмяСобытия) Экспорт
	
	Результат = Новый Структура;
	
	КомпонентыИмениФормы = СтрРазделить(ИмяФормы, ".");
	КоличествоКомпонентовФормы = КомпонентыИмениФормы.Количество();
	
	Если КоличествоКомпонентовФормы > 1 Тогда
		КлючОбъекта = СтрШаблон("%1.%2", КомпонентыИмениФормы[0], КомпонентыИмениФормы[1]);
		ФормаОбъекта = КомпонентыИмениФормы[КоличествоКомпонентовФормы - 1];
	Иначе
		КлючОбъекта = Строка(ИмяФормы);
		ФормаОбъекта = НСтр("ru = 'Форма'");
	КонецЕсли; 
	
	КомпонентыНастройки = Новый Массив;
	КомпонентыНастройки.Добавить(ФормаОбъекта);
	КомпонентыНастройки.Добавить(ИмяСобытия);
	КлючНастроек = СтрСоединить(КомпонентыНастройки, "/");
	
	Результат.Вставить("КлючОбъекта", КлючОбъекта);
	Результат.Вставить("ФормаОбъекта", ФормаОбъекта);
	Результат.Вставить("КлючНастроек", КлючНастроек);
	
	Возврат Результат;
	
КонецФункции

// Сохраняет пользовательские настройки опроса
//
// Параметры:
//  ИмяФормы - Строка - имя формы, для которой сохраняется настройка
//  ИмяСобытия - Строка - имя события, для которого сохраняется настройка
//  ЗначениеНастройки - Структура - настройка опроса
//  ИдентификаторОпроса - Строка - идентификатор опроса
//
Процедура СохранитьНастройкуОпроса(ИмяФормы, ИмяСобытия, ЗначениеНастройки, ИдентификаторОпроса) Экспорт
	
	Префикс = НСтр("ru = 'Опрос_'") + ИдентификаторОпроса;
	КлючиНастроек = КлючиНастроекХраненияОбратнойСвязи(ИмяФормы, ИмяСобытия);
	Настройки = ЗначениеНастройки;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючиНастроек.КлючОбъекта, Префикс + КлючиНастроек.КлючНастроек,
		Настройки);
	
КонецПроцедуры

// Сохраняет данные для опроса пользователей без опыта работы
// 
// Параметры:
//  Настройка - Структура
//  ИмяПользователя - Строка
//  ЗаголовокДляОтправки - Строка
//
Процедура СохранитьНастройкуОпросаНачалоРаботы(Настройка, ИмяПользователя = "", ЗаголовокДляОтправки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ПустаяСтрока(ЗаголовокДляОтправки) Тогда
		Если ПустаяСтрока(Настройка.ХэшИдентификатораПользователя) И Не ПустаяСтрока(ИмяПользователя) Тогда
			Пользователь = Пользователи.НайтиПоИмени(ИмяПользователя);
			Если Пользователь <> Неопределено И Не Пользователь.Пустая() Тогда
				ИДПользователя = Строка(Пользователь.УникальныйИдентификатор());
				Хэш = ХэшИдентификатораПользователя(ИДПользователя);
				Настройка.ХэшИдентификатораПользователя = Хэш;
			КонецЕсли;
		КонецЕсли;
		ОтправитьДанные(Настройка, ЗаголовокДляОтправки, Ложь);
	КонецЕсли;

	Если Не ПустаяСтрока(ИмяПользователя) Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ОбратнаяСвязь/ОпытРаботыС1С", "НачалоРаботы", Настройка, , ИмяПользователя);
	Иначе
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ОбратнаяСвязь/ОпытРаботыС1С", "НачалоРаботы", Настройка);
	КонецЕсли;
	
КонецПроцедуры

// Загружает данные для опроса пользователей без опыта работы
// 
// Параметры:
//  ИмяПользователя - Строка
//  
// Возвращаемое значение:
//  - Неопределено
//  - Структура - см. ОбратнаяСвязьКлиентСервер.НастройкиОпросаПользователейБезОпыта
//
Функция ЗагрузитьНастройкуОпросаНачалоРаботы(ИмяПользователя = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ОбратнаяСвязь/ОпытРаботыС1С", "НачалоРаботы", , , ИмяПользователя);
	Возврат Результат;
	
КонецФункции

// Загружает пользовательские настройки опроса
//
// Параметры:
//  ИмяФормы - Строка - имя формы, для которой загружается настройка
//  ИмяСобытия - Строка - имя события, для которого загружается настройка
//  ИдентификаторОпроса - Строка - идентификатор опроса
//
// Возвращаемое значение:
//  Произвольный - восстановленные значения настроек опроса
//  Неопределено - если настройка ранее не сохранялась
//
Функция ЗагрузитьНастройкуОпроса(ИмяФормы, ИмяСобытия, ИдентификаторОпроса) Экспорт
	
	Префикс = НСтр("ru = 'Опрос_'") + ИдентификаторОпроса;
	КлючиНастроек = КлючиНастроекХраненияОбратнойСвязи(ИмяФормы, ИмяСобытия);
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючиНастроек.КлючОбъекта, Префикс
		+ КлючиНастроек.КлючНастроек);
	
	Возврат Настройки;
	
КонецФункции

// Сохраняет настройки панели опроса
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой загружается настройка
//
Процедура СохранитьНастройкиПанелиОпроса(Знач Форма) Экспорт
	
	Элементы = Форма.Элементы;
	ИмяФормы = Форма.ИмяФормы;
	ИмяГруппыОбратнойСвязи = ОбратнаяСвязьКлиентСервер.ИмяГруппыОбратнойСвязи();
	
	НастройкаОпроса = НастройкаОбратнойсвязиПоИмениФормы(ИмяФормы);
	
	Если НастройкаОпроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИдентификаторОпроса = НастройкаОпроса.ИдентификаторОпроса;
	
	Настройка = "ВидимостьПанелиОпросаПриЗакрытииФормы";
	Значение = Элементы[ИмяГруппыОбратнойСвязи].Видимость;
	СохранитьНастройкуОпроса(ИмяФормы, Настройка, Значение, ИдентификаторОпроса);
	
	Настройка = "ОбратнаяСвязь_Оценка";
	Значение = Форма.ОбратнаяСвязь_Оценка;
	СохранитьНастройкуОпроса(ИмяФормы, Настройка, Значение, ИдентификаторОпроса);
	
	Настройка = "ОбратнаяСвязь_Пояснение";
	Значение = Форма.ОбратнаяСвязь_Пояснение;
	СохранитьНастройкуОпроса(ИмяФормы, Настройка, Значение, ИдентификаторОпроса);
	
КонецПроцедуры

// Сохраняет в настройках пользователя имя формы с открытым опросом. При закрытии формы имя формы в настройках 
// очищается, чтобы не препятствовать открытию панели опросов в других формах 
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ЗакрытиеФормы - Булево
//
Процедура СохранитьФормуОпросаОпытНачалоРаботы(Знач Форма, ЗакрытиеФормы = Истина) Экспорт
	
	Элементы = Форма.Элементы;
	Если ЗакрытиеФормы Тогда
		ИмяФормы = "";
	Иначе
		ИмяФормы = Форма.ИмяФормы;
	КонецЕсли;
	
	ИмяГруппыОбратнойСвязи = ОбратнаяСвязьКлиентСервер.ИмяГруппыОбратнойСвязи();
	ПанельОбратнойСвязи = Элементы.Найти(ИмяГруппыОбратнойСвязи);
	Если ПанельОбратнойСвязи <> Неопределено И ПанельОбратнойСвязи.Видимость Тогда
		ОпытНачалоРаботы = ЗагрузитьНастройкуОпросаНачалоРаботы();
		Если ОпытНачалоРаботы <> Неопределено Тогда
			ОпытНачалоРаботы.ИмяОткрытойФормыСОпросом = ИмяФормы;
			СохранитьНастройкуОпросаНачалоРаботы(ОпытНачалоРаботы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
// Возвращает дату начала работы пользователя в приложении
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь, дату начала работы которого необходимо получить
//
// Возвращаемое значение:
//  Дата - дата начала работы пользователя в приложении
//
Функция НачалоРаботыПользователя(Пользователь) Экспорт
	
	ДатаНачалаРаботы = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	СведенияОПользователях.ДатаРазрешенияВходаВПрограмму КАК ДатаРазрешенияВходаВПрограмму
	|ИЗ
	|	РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
	|ГДЕ
	|	СведенияОПользователях.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	СведенияОПользователе = Запрос.Выполнить().Выбрать();
	
	Пока СведенияОПользователе.Следующий() Цикл
		ДатаНачалаРаботы = СведенияОПользователе.ДатаРазрешенияВходаВПрограмму;
	КонецЦикла;
	
	Возврат ДатаНачалаРаботы;
	
КонецФункции

// Возвращает признак того, что пользователь ранее не работал в приложении
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//
// Возвращаемое значение:
//  Булево - Истина, если пользователь ранее не входил в приложение
//
Функция ЭтоНовыйПользователь(Пользователь) Экспорт
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	СведенияОПользователях.ДатаРазрешенияВходаВПрограмму КАК ДатаРазрешенияВходаВПрограмму,
	|	СведенияОПользователях.ДатаПоследнейАктивности КАК ДатаПоследнейАктивности
	|ИЗ
	|	РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
	|ГДЕ
	|	СведенияОПользователях.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	СведенияОПользователе = Запрос.Выполнить().Выбрать();
	
	Пока СведенияОПользователе.Следующий() Цикл
		ДатаПоследнейАктивности = СведенияОПользователе.ДатаПоследнейАктивности;
	КонецЦикла;
	
	Если ДатаПоследнейАктивности = '00010101' Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, разрешена ли отправка обратной связи
// 
// Параметры:
//  ИмяФормы - Строка - имя формы, из которой отправляется обратная связь
//  ИмяСобытия - Строка - имя события, которое отправляется обратной связи
//  ПолучатьРазрешениеОтСервиса - Булево - обращаться в сервис за разрешением на вывод опроса
//  ПроверятьВыполнениеОпросаПользователем - Булево
// 
// Возвращаемое значение:
//  Булево - Истина, если отправка обратной связи разрешена
//
Функция ОтправкаОбратнойСвязиРазрешена(ИмяФормы, ИмяСобытия, ПолучатьРазрешениеОтСервиса = Ложь,
	ПроверятьВыполнениеОпросаПользователем = Истина) Экспорт
	
	ОтправкаЗапрещена = ОтправкаОбратнойСвязиОтключена();
	
	Если ОтправкаЗапрещена Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НастройкаОбратнойсвязи = НастройкаОбратнойсвязиПоИмениФормы(ИмяФормы);
	
	Если НастройкаОбратнойсвязи = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТолькоВРежимеРазделенияДанных = НастройкаОбратнойсвязи.ТолькоВРежимеРазделяемыхДанных;
	
	ДоступВИнтернетРазрешен = ОбщегоНазначения.РазрешенДоступКИнтернетСервисам();
	РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	Если ТолькоВРежимеРазделенияДанных Тогда
		РежимСоответствует = РазделениеВключено;
	Иначе
		РежимСоответствует = Истина;
	КонецЕсли;
	
	Если Не РежимСоответствует Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПроверятьВыполнениеОпросаПользователем Тогда
		ВывестиОпрос = ОпросЗавершенПользователем(ИмяФормы, ИмяСобытия, НастройкаОбратнойсвязи.ИдентификаторОпроса);
	Иначе
		ВывестиОпрос = Истина;
	КонецЕсли;
	
	Если Не ВывестиОпрос Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПолучатьРазрешениеОтСервиса Тогда
		ВывестиОпрос = ПолучитьРазрешениеОтСервиса(НастройкаОбратнойсвязи.ИдентификаторОпроса,
			НастройкаОбратнойСвязи.ПроцентПользователейДляОпроса, ИмяФормы, ИмяСобытия);
	КонецЕсли;
	
	Возврат ДоступВИнтернетРазрешен И ВывестиОпрос;
	
КонецФункции

// Отправляет обратную связь
// 
// Параметры:
//  ДанныеДляОтправки - см. ОбратнаяСвязьКлиент.ДанныеДляОтправки
//
Процедура ОпросОтправить(ДанныеДляОтправки) Экспорт
	
	ИмяФормы = ДанныеДляОтправки.ПолноеИмяФормы;
	Событие = ДанныеДляОтправки.Событие;
	
	КлючиНастроек = КлючиНастроекХраненияОбратнойСвязи(ИмяФормы, Событие);
	
	ПараметрыОтзыва = ПараметрыОбратнойСвязи();
	ЗаполнитьЗначенияСвойств(ПараметрыОтзыва, ДанныеДляОтправки);
	
	ИдентификаторОпроса = ДанныеДляОтправки.ИдентификаторОпроса;
	Если Не ПустаяСтрока(ИдентификаторОпроса) Тогда
		ПроцентПользователейДляОпроса = ОбратнаяСвязьКлиентСервер.ЗначениеСвойстваНастройкиОпроса(ИдентификаторОпроса,
			"ПроцентПользователейДляОпроса");
		Если ПроцентПользователейДляОпроса <> Неопределено Тогда
			ПараметрыОтзыва.ПроцентПользователейДляОпроса = ПроцентПользователейДляОпроса;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыОтзыва.ВидОбъекта = КлючиНастроек.КлючОбъекта;
	ПараметрыОтзыва.ФормаОбъекта = КлючиНастроек.ФормаОбъекта;
	
	ОтправитьДанные(ПараметрыОтзыва, "UXActions");
	
КонецПроцедуры

// Возвращает настройки обратной связи по имени формы
// 
// Параметры:
//  ИмяФормы - Строка - полное имя формы
// 
// Возвращаемое значение:
//  Произвольный - если настройки не найдены, то возвращается Неопределено.
//                 Если найдены, то возвращается структура со свойствами: 
//                   см. ОбратнаяСвязьКлиентСервер.НастройкиОбратнойСвязи
//
Функция НастройкаОбратнойсвязиПоИмениФормы(ИмяФормы) Экспорт
	
	НастройкиПоФормам = ОбратнаяСвязьКлиентСервер.НастройкиОпросовПоФормамИСобытиям();
	Если НастройкиПоФормам.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяМетаданных = Лев(ИмяФормы, СтрНайти(ИмяФормы, ".", , ,2)-1);
	НастройкаОпроса = Неопределено;
	
	Для каждого НастройкаФорм Из НастройкиПоФормам Цикл
		Если СтрНайти(НастройкаФорм.Ключ, ИмяМетаданных) <> 0 Тогда
			НастройкаОпроса = НастройкаФорм.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НастройкаОпроса;
	
КонецФункции

// Получает разрешение от сервиса на опрос
// 
// Параметры:
//  ИдентификаторОпроса - Строка - идентификатор опроса
//  ПроцентПользователейДляОпроса - Число - процент пользователей, для которых будет показан опрос
//  ИмяФормы - Строка - имя формы, для которой выполняется опрос
//  ИмяСобытия - Строка - имя события, для которого выполняется опрос
//  ИмяПользователя - Строка - имя пользователя, для которого выполняется опрос
// 
// Возвращаемое значение:
//  Булево - разрешение на опрос
//
Функция ПолучитьРазрешениеОтСервиса(ИдентификаторОпроса, ПроцентПользователейДляОпроса, ИмяФормы, ИмяСобытия,
	ИмяПользователя = "") Экспорт
	
	НастройкаОпроса = НастройкаОбратнойсвязиПоИмениФормы(ИмяФормы);
	Если НастройкаОпроса = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	ДанныеДляОтправки = ПараметрыЗапросаРазрешения(ИдентификаторОпроса, ПроцентПользователейДляОпроса, ИмяПользователя);
	
	ПараметрыСоединения = ПараметрыСервераОбратнойСвязи("request_permission");
	ИмяХоста = ПараметрыСоединения.Сайт;
	АдресРесурса = ПараметрыСоединения.АдресРесурса;
	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
	ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	
	Разрешение = Ложь;
	
	Попытка
		Соединение = Новый HTTPСоединение(ИмяХоста, , , , Прокси, 10, ЗащищенноеСоединение);
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		HTTPЗапрос.Заголовки.Вставить("X-1C-Request-UID", ИдентификаторЗапроса);
		HTTPЗапрос.Заголовки.Вставить("X-1C-FeedbackType", "request_permission");
		HTTPЗапрос.УстановитьТелоИзСтроки(ДанныеДляОтправки);
		
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			ДанныеОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(ДанныеОтвета);
			ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON);
			Разрешение = ДанныеЗапроса.ОпросРазрешен;
			// Если пришел отказ, то более не опрашивать пользователя
			Если Не Разрешение Тогда
				СохранитьНастройкуОпроса(ИмяФормы, ИмяСобытия, Истина, НастройкаОпроса.ИдентификаторОпроса);
			КонецЕсли;
		Иначе
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка запроса разрешения в сервисе. %1'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		КонецЕсли;
	Исключение
		Разрешение = Ложь;
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка запроса разрешения в сервисе. %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
	КонецПопытки;
	
	Возврат Разрешение;

КонецФункции

// Снимает флаг выполнения условий опроса. Флаг будет взведен снова при следующем выполнении регламентного задания
// Параметры:
//  ИмяПользователя - строка
//
Процедура ОпросНачалоРаботыОтложить(ИмяПользователя = "") Экспорт
	
	ОпытНачалоРаботы = ЗагрузитьНастройкуОпросаНачалоРаботы(ИмяПользователя);
	Если ОпытНачалоРаботы = Неопределено Или Не ОпытНачалоРаботы.ЭтоПользовательБезОпыта Тогда
		Возврат;
	КонецЕсли;
	
	ОпытНачалоРаботы.УсловияДляПоказаОпросаВыполнены = Ложь;
	СохранитьНастройкуОпросаНачалоРаботы(ОпытНачалоРаботы, ИмяПользователя);
	
КонецПроцедуры

// Отправляет обратную связь от начинающих пользователей
// Параметры:
//  ДанныеДляОтправки - Структура
//
Процедура ОпросНачалоРаботыОтправитьДанные(ДанныеДляОтправки) Экспорт
	
	ДополнитьДанныеНачалоРаботы(ДанныеДляОтправки);
	ОтправитьДанные(ДанныеДляОтправки, "UXBeginnersResults");
	
КонецПроцедуры

// Отправляет данные для связи от начинающих пользователей
// Параметры:
//  ДанныеДляОтправки - Структура:
//   * Имя - Строка
//   * Телефон - Строка
//   * ЭлектроннаяПочта - Строка
//
Процедура ОпросНачалоРаботыОтправитьКонтактнуюИнформацию(ДанныеДляОтправки) Экспорт
	
	ДополнитьДанныеНачалоРаботы(ДанныеДляОтправки);
	ОтправитьДанные(ДанныеДляОтправки, "UXBeginnersContactInfo", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПроверкаУсловийОбратнойСвязи() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.УстановкаПериодаРассчитанныхИтогов);
	УстановитьПривилегированныйРежим(Истина);
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого Пользователь Из ПользователиИБ Цикл
		
		ИмяПользователя = Пользователь.Имя;
		
		ОпытНачалоРаботы = ЗагрузитьНастройкуОпросаНачалоРаботы(ИмяПользователя);
			
		Если ОпытНачалоРаботы = Неопределено Или Не ОпытНачалоРаботы.ЭтоПользовательБезОпыта Тогда
			Продолжить;
		КонецЕсли;
		
		ОбработатьВыполнениеУсловийОбратнойСвязи(ОпытНачалоРаботы, ИмяПользователя);
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкаФорм

Процедура ДобавитьРеквизитыФормыОбъекта(Форма)
	
	МассивРеквизитов = Новый Массив;
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
	
	РеквизитНовыйОбъект = Новый РеквизитФормы("ОбратнаяСвязь_ЭтоНовыйОбъект",
		ОписаниеТиповБулево);
	МассивРеквизитов.Добавить(РеквизитНовыйОбъект);
	
	РеквизитОповещать = Новый РеквизитФормы("ОбратнаяСвязь_ОповещатьОПроведенииДокумента",
		ОписаниеТиповБулево);
	МассивРеквизитов.Добавить(РеквизитОповещать);

	РеквизитПроведеноДокументовПользователем = Новый РеквизитФормы("ОбратнаяСвязь_ПроведеноДокументовПользователем",
		ОписаниеТиповЧисло);
	МассивРеквизитов.Добавить(РеквизитПроведеноДокументовПользователем);
	
	РеквизитПроведенийНовыхДляОпроса = Новый РеквизитФормы("ОбратнаяСвязь_ПроведенийНовыхДляОпроса",
		ОписаниеТиповЧисло);
	МассивРеквизитов.Добавить(РеквизитПроведенийНовыхДляОпроса);
		
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
	
КонецПроцедуры

Процедура ДобавитьРеквизитыФормы(Форма, НастройкаОпроса)
	
	МассивРеквизитов = Новый Массив;
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
	
	РеквизитНачальноеСостояниеПравойПанели = Новый РеквизитФормы("ОбратнаяСвязь_НачальноеСостояниеПравойПанели",
		ОписаниеТиповБулево);
	МассивРеквизитов.Добавить(РеквизитНачальноеСостояниеПравойПанели);
	
	РеквизитТекстВопроса = Новый РеквизитФормы("ОбратнаяСвязь_ТекстВопроса", ОписаниеТиповСтрока);
	МассивРеквизитов.Добавить(РеквизитТекстВопроса);
	
	РеквизитИдентификаторОпроса = Новый РеквизитФормы("ОбратнаяСвязь_ИдентификаторОпроса", ОписаниеТиповСтрока);
	МассивРеквизитов.Добавить(РеквизитИдентификаторОпроса);
	
	РеквизитПоказыватьОпрос = Новый РеквизитФормы("ОбратнаяСвязь_ПоказыватьОпрос", ОписаниеТиповБулево);
	МассивРеквизитов.Добавить(РеквизитПоказыватьОпрос);

	Если НастройкаОпроса.МаксимальнаяОценка <> 0 Тогда
		РеквизитОценка = Новый РеквизитФормы("ОбратнаяСвязь_Оценка", ОписаниеТиповЧисло);
		МассивРеквизитов.Добавить(РеквизитОценка);
	КонецЕсли;
	
	Если НастройкаОпроса.ПоказыватьПояснение Тогда
		РеквизитПояснение = Новый РеквизитФормы("ОбратнаяСвязь_Пояснение", ОписаниеТиповСтрока);
		МассивРеквизитов.Добавить(РеквизитПояснение);
	КонецЕсли;
	
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
	
КонецПроцедуры

Процедура ДобавитьКомандыФормы(Форма, НастройкаОпроса)
	
	Для каждого КомандаНастроек Из НастройкаОпроса.КомандыОбратнойСвязи Цикл
		Если КомандаНастроек.ЭтоКоманда Тогда
			Команда = Форма.Команды.Добавить(КомандаНастроек.Имя);
			ЗаполнитьЗначенияСвойств(Команда, КомандаНастроек);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЭлементыФормы(Форма, НастройкаОпроса)
	
	Элементы = Форма.Элементы;
	ИмяГруппы = НастройкаОпроса.ИмяГруппыОбратнойСвязи;
	ЭтоИнтерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Родитель = Элементы.Найти(НастройкаОпроса.Родитель);
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.Найти(НастройкаОпроса.Элемент);
	ЗаголовокВопроса = НастройкаОпроса.Вопрос;
	Форма.ОбратнаяСвязь_ТекстВопроса = ЗаголовокВопроса;
	МаксимальнаяОценка = НастройкаОпроса.МаксимальнаяОценка;
	ПоказыватьПояснение = НастройкаОпроса.ПоказыватьПояснение;
	
	СписокЗначенийОценки = Новый СписокЗначений;
	Если МаксимальнаяОценка > 0 Тогда
		Для СчетчикОценки = 1 По МаксимальнаяОценка Цикл
			СписокЗначенийОценки.Добавить(СчетчикОценки);
		КонецЦикла;
	КонецЕсли;
	
	Если Элемент <> Неопределено Тогда
		ГруппаОбратнаяСвязь = Элементы.Вставить(ИмяГруппы, Тип("ГруппаФормы"), Родитель, Элемент);
	Иначе
		ГруппаОбратнаяСвязь = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Родитель);
	КонецЕсли;
	
	ГруппаОбратнаяСвязь.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОбратнаяСвязь.ОтображатьЗаголовок = Ложь;
	
	Если НастройкаОпроса.ПоложениеГруппыТерминальныхКоманд = "Право" Тогда
		ГруппаОбратнаяСвязь.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Иначе
		ГруппаОбратнаяСвязь.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
		
	ГруппаОбратнаяСвязь.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	ГруппаОбратнаяСвязь.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОбратнаяСвязь.РастягиватьПоГоризонтали = Истина;
	ГруппаОбратнаяСвязь.РастягиватьПоВертикали = Ложь;
	ГруппаОбратнаяСвязь.ОтображатьКакКарточку = Истина;
	ГруппаОбратнаяСвязь.ЦветФона = ЦветаПалитры.Серый20УНФ;
	ГруппаОбратнаяСвязь.Видимость = Ложь;
	ГруппаОбратнаяСвязь.Ширина = 35;
	
	ОбратнаяСвязьЭлементыОпроса = Элементы.Добавить("ОбратнаяСвязьЛево", Тип("ГруппаФормы"), ГруппаОбратнаяСвязь);
	ОбратнаяСвязьЭлементыОпроса.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ОбратнаяСвязьЭлементыОпроса.ОтображатьЗаголовок = Ложь;
	ОбратнаяСвязьЭлементыОпроса.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ОбратнаяСвязьЭлементыОпроса.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	ОбратнаяСвязьЭлементыОпроса.Отображение = ОтображениеОбычнойГруппы.Нет;
	ОбратнаяСвязьЭлементыОпроса.Объединенная = Ложь;
	ОбратнаяСвязьЭлементыОпроса.РастягиватьПоГоризонтали = Истина;

	ОбратнаяСвязьТерминальныеКоманды = Элементы.Добавить("ОбратнаяСвязьПраво", Тип("ГруппаФормы"), ГруппаОбратнаяСвязь);
	ОбратнаяСвязьТерминальныеКоманды.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ОбратнаяСвязьТерминальныеКоманды.ОтображатьЗаголовок = Ложь;
	Если НастройкаОпроса.ПоложениеГруппыТерминальныхКоманд = "Право" Тогда
		ОбратнаяСвязьТерминальныеКоманды.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ОбратнаяСвязьТерминальныеКоманды.Объединенная = Ложь;
	Иначе
		ОбратнаяСвязьТерминальныеКоманды.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	КонецЕсли;
	
	ОбратнаяСвязьТерминальныеКоманды.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	ОбратнаяСвязьТерминальныеКоманды.Отображение = ОтображениеОбычнойГруппы.Нет;
	ОбратнаяСвязьТерминальныеКоманды.РастягиватьПоГоризонтали = Ложь;
	
	ГруппаОценкаОбщая = Элементы.Добавить("ОбратнаяСвязьОценкаОбщая", Тип("ГруппаФормы"), ОбратнаяСвязьЭлементыОпроса);
	ГруппаОценкаОбщая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОценкаОбщая.ОтображатьЗаголовок = Ложь;
	ГруппаОценкаОбщая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаОценкаОбщая.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	ГруппаОценкаОбщая.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	ДекорацияДаша = Элементы.Добавить("ДекорацияДаша", Тип("ДекорацияФормы"), ГруппаОценкаОбщая);
	ДекорацияДаша.Вид = ВидДекорацииФормы.Картинка;
	ДекорацияДаша.Картинка = БиблиотекаКартинок.АссистентУправленияОбратнаяСвязь;
	ДекорацияДаша.Ширина = 6;
	ДекорацияДаша.Высота = 2;
	ДекорацияДаша.РазмерКартинки = РазмерКартинки.Пропорционально;
	
	ГруппаОценкаВертикальная = Элементы.Добавить("ОбратнаяСвязьОценкаВертикальная", Тип("ГруппаФормы"),
		ГруппаОценкаОбщая);
	ГруппаОценкаВертикальная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОценкаВертикальная.ОтображатьЗаголовок = Ложь;
	ГруппаОценкаВертикальная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаОценкаВертикальная.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	ГруппаОценкаВертикальная.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОценкаВертикальная.РастягиватьПоГоризонтали = Ложь;

	ДекорацияЗаголовокВопроса = Элементы.Добавить("ДекорацияЗаголовокВопроса", Тип("ДекорацияФормы"),
		ГруппаОценкаВертикальная);
	ДекорацияЗаголовокВопроса.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияЗаголовокВопроса.Заголовок = ЗаголовокВопроса;
	ДекорацияЗаголовокВопроса.Ширина = 32;
	Если ЭтоИнтерфейс85 Тогда
		ДекорацияЗаголовокВопроса.Шрифт = ШрифтыСтиля.ЗаголовокТретьегоУровня;
	Иначе
		ДекорацияЗаголовокВопроса.Шрифт = ШрифтыСтиля.ЗаголовокЧетвертогоУровня;
	КонецЕсли;
	
	Если МаксимальнаяОценка > 0 Тогда
		ГруппаОценка = Элементы.Добавить("ОбратнаяСвязьГруппаОценка", Тип("ГруппаФормы"), ГруппаОценкаВертикальная);
		ГруппаОценка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаОценка.ОтображатьЗаголовок = Ложь;
		ГруппаОценка.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		ГруппаОценка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаОценка.Отображение = ОтображениеОбычнойГруппы.Нет;
		Это85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
		Если Это85 Тогда
			ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Полуторный;
		Иначе
			ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Двойной;
			ДекорацияЗаголовокВопроса.АвтомаксимальнаяШирина = Ложь;
			ДекорацияЗаголовокВопроса.МаксимальнаяШирина = 32;
			ДекорацияЗаголовокВопроса.Шрифт = ШрифтыСтиля.ТекстВторогоУровня;
		КонецЕсли;
		ГруппаОценка.ГоризонтальныйИнтервал = ГоризонтальныйИнтервал;
		
		// Группа для радиокнопок
		ГруппаОценкаКнопки = Элементы.Добавить("ОбратнаяСвязьГруппаОценкаРадиокнопки", Тип("ГруппаФормы"), ГруппаОценка);
		ГруппаОценкаКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаОценкаКнопки.ОтображатьЗаголовок = Ложь;
		ГруппаОценкаКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаОценкаКнопки.Высота = 1;
		ГруппаОценкаКнопки.РастягиватьПоВертикали = Ложь;
		ГруппаОценкаКнопки.Отображение = ОтображениеОбычнойГруппы.Нет;
		
		ПолеОценка = Элементы.Добавить("ОбратнаяСвязь_Оценка", Тип("ПолеФормы"), ГруппаОценкаКнопки);
		ПолеОценка.Вид = ВидПоляФормы.ПолеПереключателя;
		ПолеОценка.ВидПереключателя = ВидПереключателя.Переключатель;
		ПолеОценка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеОценка.ПутьКДанным = "ОбратнаяСвязь_Оценка";
		ПолеОценка.СписокВыбора.ЗагрузитьЗначения(СписокЗначенийОценки.ВыгрузитьЗначения());
		ПолеОценка.Ориентация = ОриентацияЭлементаФормы.ГоризонтальноЕслиВозможно;
		ПолеОценка.КоличествоКолонок = МаксимальнаяОценка;
		ПолеОценка.УстановитьДействие("ПриИзменении", "Подключаемый_ОбратнаяСвязьОценкаПриИзменении");
		
		ГруппаРасшифровкаОценки = Элементы.Добавить("ОбратнаяСвязьОценкаРасшифровка", Тип("ГруппаФормы"), ГруппаОценка);
		ГруппаРасшифровкаОценки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаРасшифровкаОценки.ОтображатьЗаголовок = Ложь;
		ГруппаРасшифровкаОценки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаРасшифровкаОценки.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаРасшифровкаОценки.РастягиватьПоГоризонтали = Истина;
		
		ДекорацияРасшифровкаЛево = Элементы.Добавить("ДекорацияРасшифровкаЛево", Тип("ДекорацияФормы"),
			ГруппаРасшифровкаОценки);
		ДекорацияРасшифровкаЛево.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияРасшифровкаЛево.Заголовок = НСтр("ru = 'Очень сложно'");
		ДекорацияРасшифровкаЛево.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		ДекорацияРасшифровкаЛево.Шрифт = ШрифтыСтиля.ПодзаголовокПервогоУровня;
	
		ДекорацияРасшифровкаПраво = Элементы.Добавить("ДекорацияРасшифровкаПраво", Тип("ДекорацияФормы"),
			ГруппаРасшифровкаОценки);
		ДекорацияРасшифровкаПраво.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияРасшифровкаПраво.Заголовок = НСтр("ru = 'Очень легко'");
		ДекорацияРасшифровкаПраво.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		ДекорацияРасшифровкаПраво.Шрифт = ШрифтыСтиля.ПодзаголовокПервогоУровня;
	КонецЕсли;
	
	Если ПоказыватьПояснение Тогда
		ПолеПояснение = Элементы.Добавить("ОбратнаяСвязь_Пояснение", Тип("ПолеФормы"), ОбратнаяСвязьЭлементыОпроса);
		ПолеПояснение.Вид = ВидПоляФормы.ПолеВвода;
		ПолеПояснение.ПутьКДанным = "ОбратнаяСвязь_Пояснение";
		ПолеПояснение.ПодсказкаВвода = НСтр("ru = 'Расскажите, что повлияло на оценку?'");
		ПолеПояснение.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеПояснение.МногострочныйРежим = Истина;
		ПолеПояснение.Высота = 2;
		ПолеПояснение.Ширина = 30;
		ПолеПояснение.УстановитьДействие("ИзменениеТекстаРедактирования",
			"Подключаемый_ОбратнаяСвязьИзменениеТекстаРедактирования");
	КонецЕсли;
	
	Если Не ПустаяСтрока(НастройкаОпроса.РазвернутыйВопрос) Тогда
		ДекорацияРазвернутыйВопрос = Элементы.Добавить("ДекорацияРазвернутыйВопрос", Тип("ДекорацияФормы"),
			ГруппаОценкаВертикальная);
		ДекорацияРазвернутыйВопрос.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияРазвернутыйВопрос.Заголовок = НастройкаОпроса.РазвернутыйВопрос;
		ДекорацияРазвернутыйВопрос.Шрифт = ШрифтыСтиля.ТекстТретьегоУровня;
	КонецЕсли;
	
	Для каждого Команда Из НастройкаОпроса.КомандыОбратнойСвязи Цикл
		
		Если Команда.ЭтоКоманда Тогда
			ТипЭлементаКоманды = Тип("КнопкаФормы");
			ИсключаемыеСвойства = "Вид";
			Если Не ЭтоИнтерфейс85 Тогда
				ИсключаемыеСвойства = "Вид,Важность";
			КонецЕсли;
		Иначе
			ТипЭлементаКоманды = Тип("ДекорацияФормы");
			ИсключаемыеСвойства = "";
		КонецЕсли;
		
		ЭлементКоманды = Элементы.Добавить(Команда.Имя, ТипЭлементаКоманды,
			ОбратнаяСвязьТерминальныеКоманды);
			
		ЗаполнитьЗначенияСвойств(ЭлементКоманды, Команда, , ИсключаемыеСвойства);
		Если Команда.ЭтоКоманда И Команда.Важность = ВажностьКнопки.Дополнительная Тогда
			ЭлементКоманды.Вид = ВидКнопкиФормы.Гиперссылка;
		КонецЕсли;
		
		Если Не ПустаяСтрока(Команда.ИмяКартинки) Тогда
			ЭлементКоманды.Картинка = БиблиотекаКартинок[Команда.ИмяКартинки];
		КонецЕсли;
		
		Если Не Команда.ЭтоКоманда И Не ПустаяСтрока(Команда.Событие) Тогда
			ЭлементКоманды.УстановитьДействие(Команда.Событие, Команда.Действие);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Возвращает состояние завершение опроса пользователем
// 
// Параметры:
//   ИмяФормы - Строка
//   ИмяСобытия - Строка
//   ИдентификаторОпроса - Строка
// 
// Возвращаемое значение:
//  Булево
//
Функция ОпросЗавершенПользователем(ИмяФормы, ИмяСобытия, ИдентификаторОпроса)
	
	ОпросЗавершен = ЗагрузитьНастройкуОпроса(ИмяФормы, ИмяСобытия, ИдентификаторОпроса);
	ВывестиОпрос = Не (ОпросЗавершен <> Неопределено И ОпросЗавершен);
	
	Возврат ВывестиОпрос;
	
КонецФункции

Процедура ОбработатьВыполнениеУсловийОбратнойСвязи(ОпытНачалоРаботы, ИмяПользователя)
	
	ПредельноеКоличествоПроведенныхДокументов = ОпытНачалоРаботы.ПредельноеКоличествоПроведенныхДокументов;
	МинимальноеКоличествоДнейРаботы = ОпытНачалоРаботы.МинимальноеКоличествоДнейРаботы;
	ПредельноеКоличествоДнейРаботы = ОпытНачалоРаботы.ПредельноеКоличествоДнейРаботы;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ОпытВДнях = Цел((ТекущаяДата - ОпытНачалоРаботы.ДатаНачалаРаботы) / 86400);
	Если ОпытНачалоРаботы.ОбщееКоличествоПроведенныхДокументов >= ПредельноеКоличествоПроведенныхДокументов
		И ОпытВДнях > МинимальноеКоличествоДнейРаботы 
		Или ОпытВДнях > ПредельноеКоличествоДнейРаботы И ОпытНачалоРаботы.ОбщееКоличествоПроведенныхДокументов > 0 Тогда
		
		Если ОпытНачалоРаботы.РазрешеноВключениеИнтерфейса85 Тогда
			ОпытНачалоРаботы.УсловияДляПоказаОпросаВыполнены = Истина;
		Иначе
			ОпытНачалоРаботы.УсловияДляПоказаОпросаВыполнены = ПоказыватьОпросПользователюТакси(ИмяПользователя);
		КонецЕсли;
		
		Если Не ОпытНачалоРаботы.ОтправленоОповещениеОПоказеОпроса 
			И ОпытНачалоРаботы.УсловияДляПоказаОпросаВыполнены Тогда
			ЗаголовокСообщения = "UXBeginnersSurveyShowed";
			ОпытНачалоРаботы.ОтправленоОповещениеОПоказеОпроса = Истина;
			СохранитьНастройкуОпросаНачалоРаботы(ОпытНачалоРаботы, ИмяПользователя, ЗаголовокСообщения);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьДанныеНачалоРаботы(ДанныеДляОтправки)
	
	ОпытНачалоРаботы = ЗагрузитьНастройкуОпросаНачалоРаботы();
	
	Если ОпытНачалоРаботы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополняемыеСвойства = Новый Структура();
	ДополняемыеСвойства.Вставить("ОпытПриложения1С");
	ДополняемыеСвойства.Вставить("ОпытДругиеСистемыУчета");
	ДополняемыеСвойства.Вставить("ОпытПеречислениеСистемУчета");
	ДополняемыеСвойства.Вставить("РазрешеноВключениеИнтерфейса85");
	ДополняемыеСвойства.Вставить("ИнтерфейсТаксиПередНачаломРаботы");
	ДополняемыеСвойства.Вставить("ДатаНачалаРаботы");
	ДополняемыеСвойства.Вставить("ОбщееКоличествоПроведенныхДокументов");
	ДополняемыеСвойства.Вставить("ХэшИдентификатораПользователя");
	
	ЗаполнитьЗначенияСвойств(ДополняемыеСвойства, ОпытНачалоРаботы);
	ДанныеДляОтправки.Вставить("ОпытНачалоРаботы", ДополняемыеСвойства);
	 
КонецПроцедуры

Функция ПоказыватьОпросПользователюТакси(ИмяПользователя)

	Результат = ПолучитьРазрешениеОтСервиса("90ab5b6f-a1e9-46c4-a2e2-27574038a441", 10, "ВсеФормы", "НачалоРаботы");
	Возврат Результат;
	
КонецФункции

Функция ОтправкаОбратнойСвязиОтключена()
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ЗапретитьОтправкуОбратнойСвязи.Получить();

КонецФункции

Функция ПараметрыЗапросаРазрешения(ИдентификаторОпроса, ПроцентПользователейДляОпроса, ИмяПользователя = "")
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторОпроса", ИдентификаторОпроса);
	Результат.Вставить("ХэшПользователя", ХэшПользователяИОпроса(ИдентификаторОпроса, ИмяПользователя));
	Результат.Вставить("ПроцентПользователейДляОпроса", ПроцентПользователейДляОпроса);
	
	РезультатJSON = СтруктураВСтрокуJSON(Результат);
	
	Возврат РезультатJSON;
	
КонецФункции

// Возвращает контрольную сумму идентификаторов пользователя и опроса
// Параметры:
//  ИдентификаторОпроса - Строка - идентификатор опроса
//  ИмяПользователя - Строка - имя пользователя, для которого рассчитывается контрольная сумма
// Возвращаемое значение:
//  Число - контрольная сумма идентификаторов
//
Функция ХэшПользователяИОпроса(ИдентификаторОпроса, ИмяПользователя = "")
	
	Если ПустаяСтрока(ИмяПользователя) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	Иначе
		Пользователь = Пользователи.НайтиПоИмени(ИмяПользователя);
		Если Пользователь = Неопределено Или Пользователь.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ИДПользователя = Строка(Пользователь.УникальныйИдентификатор());
	
	ХешПакета = "";
	Хеш = Новый ХешированиеДанных(ХешФункция.CRC32);
	Хеш.Добавить(ИДПользователя + ИдентификаторОпроса);
	ХешПакета = Хеш.ХешСумма;
	
	Возврат ХешПакета;
	
КонецФункции

Функция ХэшИдентификатораПользователя(ИДПользователя)
	
	Результат = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ИДПользователя);
	Возврат Результат;
	
КонецФункции

// Отправляет обратную связь от пользователя
// Параметры:
//  СоставОбратнойСвязи - см. ПараметрыОбратнойСвязи
//  ТипОбратнойСвязи - Строка - заполняется в заголовок запроса
//  СохранятьНастройкуОпроса - Булево
//
Процедура ОтправитьДанные(СоставОбратнойСвязи, ТипОбратнойСвязи = "UXActions", СохранятьНастройкуОпроса = Истина)
	
	ПараметрыСоединения = ПараметрыСервераОбратнойСвязи("feedback");
	ИмяХоста = ПараметрыСоединения.Сайт;
	АдресРесурса = ПараметрыСоединения.АдресРесурса;
	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
	ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	
	ДанныеДляОтправки = СформироватьПакетДляОтправки(СоставОбратнойСвязи);
	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	
	Попытка
		Соединение = Новый HTTPСоединение(ИмяХоста, , , , Прокси, 10, ЗащищенноеСоединение);
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		HTTPЗапрос.Заголовки.Вставить("X-1C-Request-UID", ИдентификаторЗапроса);
		HTTPЗапрос.Заголовки.Вставить("X-1C-FeedbackType", ТипОбратнойСвязи);
		HTTPЗапрос.УстановитьТелоИзСтроки(ДанныеДляОтправки);
		
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка отправки обратной связи. Код состояния: %1'"),
				HTTPОтвет.КодСостояния);
			ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		КонецЕсли;
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка отправки обратной связи. %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
	КонецПопытки;
	
	Если СохранятьНастройкуОпроса Тогда
		СохранитьНастройкуОпроса(СоставОбратнойСвязи.ПолноеИмяФормы, СоставОбратнойСвязи.Событие, Истина,
			СоставОбратнойСвязи.ИдентификаторОпроса);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру принимаемых параметров обратной связи
//
// Возвращаемое значение:
//  Структура:
//   * ВидОбъекта - Строка
//   * ФормаОбъекта - Строка
//   * ПолноеИмяФормы - Строка
//   * ИдентификаторОпроса - Строка
//   * ПроцентПользователейДляОпроса - Число
//   * Вопрос - Строка
//   * Событие - Строка
//   * Оценка - Число
//   * Пояснение - Строка
//   * ПроизвольныйКомментарий - Строка
//   * EMail - Строка
//   * СогласиеНаОбратнуюСвязь - Булево
//
Функция ПараметрыОбратнойСвязи()
	
	Результат = Новый Структура;
	Результат.Вставить("ВидОбъекта", "");
	Результат.Вставить("ФормаОбъекта", "");
	Результат.Вставить("ПолноеИмяФормы", "");
	Результат.Вставить("ИдентификаторОпроса", "");
	Результат.Вставить("ПроцентПользователейДляОпроса", 100);
	Результат.Вставить("Вопрос", "");
	Результат.Вставить("Событие", "");
	Результат.Вставить("Оценка", 0);
	Результат.Вставить("Пояснение", "");
	Результат.Вставить("ПроизвольныйКомментарий", "");
	Результат.Вставить("EMail", "");
	Результат.Вставить("СогласиеНаОбратнуюСвязь", Ложь);
	Результат.Вставить("ИдентификаторОпроса", "");
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыСервераОбратнойСвязи(ШаблонURL)
	
	Результат = Новый Структура();
	Результат.Вставить("Сайт", "1cfresh.com");
	Результат.Вставить("АдресРесурса", "a/paas/3937344/hs/services/" + ШаблонURL);

	Возврат Результат;
	
КонецФункции

Функция СформироватьПакетДляОтправки(СоставОбратнойСвязи)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеОбратнойСвязи = СоставОбратнойСвязи;
	Окружение = ПолучитьДанныеОкружения();
	ПараметрыПользователя = ПолучитьПараметрыПользователя();
	
	Результат = Новый Структура;
	Результат.Вставить("ОбратнаяСвязь", ДанныеОбратнойСвязи);
	Результат.Вставить("Окружение", Окружение);
	Результат.Вставить("ПараметрыПользователя", ПараметрыПользователя);
	
	РезультатJSON = СтруктураВСтрокуJSON(Результат);
	
	Возврат РезультатJSON;
	
КонецФункции

Функция ПолучитьДанныеОкружения()
	
	Настройки = ХранилищеСистемныхНастроек.Загрузить(
		"Общее/НастройкиКлиентскогоПриложения", "");
	Если Настройки.ВариантИнтерфейсаКлиентскогоПриложения
		= ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5 Тогда
		ВариантИнтерфейса = "Версия8_5";
	Иначе
		ВариантИнтерфейса = "Такси";
	КонецЕсли;
	
	ПараметрыЭкранов = ПолучитьИнформациюЭкрановКлиента();
	Если ПараметрыЭкранов <> Неопределено Тогда
		ПервыйЭкран = ПараметрыЭкранов[0];
		ШаблонРазрешениеПервогоЭкрана = "%1x%2x%3";
		РазрешениеПервогоЭкрана = СтрШаблон(ШаблонРазрешениеПервогоЭкрана, ПервыйЭкран.Ширина, ПервыйЭкран.Высота,
			ПервыйЭкран.DPI);
		РазрешениеПервогоЭкрана = СтрЗаменить(РазрешениеПервогоЭкрана, Символы.НПП, "");
		РазрешениеПервогоЭкрана = СтрЗаменить(РазрешениеПервогоЭкрана, ",", "");
	Иначе
		РазрешениеПервогоЭкрана = "0x0x0";
	КонецЕсли;

	ПТемаКлиентскогоПриложения = Настройки.ТемаКлиентскогоПриложения;
	ПВариантОтображенияОсновногоОкнаКлиентскогоПриложения = Настройки.ВариантОтображенияОсновногоОкнаКлиентскогоПриложения;
	ПВариантОткрытияОконКлиентскогоПриложения = Настройки.ВариантОткрытияОконКлиентскогоПриложения;
	ПВариантМасштабаКлиентскогоПриложения = Настройки.ВариантМасштабаКлиентскогоПриложения;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВариантИнтерфейса", Строка(ВариантИнтерфейса));
	Результат.Вставить("ТемаКлиентскогоПриложения", Строка(ПТемаКлиентскогоПриложения));
	Результат.Вставить("ВариантОтображенияОсновногоОкнаКлиентскогоПриложения",
		Строка(ПВариантОтображенияОсновногоОкнаКлиентскогоПриложения));
	Результат.Вставить("ВариантОткрытияОконКлиентскогоПриложения", Строка(ПВариантОткрытияОконКлиентскогоПриложения));
	Результат.Вставить("ВариантМасштабаКлиентскогоПриложения", Строка(ПВариантМасштабаКлиентскогоПриложения));
	Результат.Вставить("РазрешениеЭкрана", РазрешениеПервогоЭкрана);
	Результат.Вставить("ТипКлиентскогоПриложения", Строка(КлиентскоеПриложение.ТипПриложения()));
	Результат.Вставить("Приложение", Метаданные.Имя);
	ОСистеме = Новый СистемнаяИнформация;
	Результат.Вставить("ВерсияПлатформы", ОСистеме.ВерсияПриложения);
	Результат.Вставить("ВерсияПриложения", Метаданные.Версия);
	
	МодельСервиса = ОбщегоНазначения.РазделениеВключено();
	Результат.Вставить("ЭтоМодельСервиса", МодельСервиса);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПараметрыПользователя()
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	ИДПользователя = Строка(Пользователь.УникальныйИдентификатор());
	
	Результат = Новый Структура;
	Результат.Вставить("НачалоРаботы", НачалоРаботыПользователя(Пользователь));
	Результат.Вставить("ДоступныеПрофили", ПрофилиПользователя(Пользователь));
	Результат.Вставить("ХэшИдентификатораПользователя", ХэшИдентификатораПользователя(ИДПользователя));
	
	Возврат Результат;
	
КонецФункции

Функция ПрофилиПользователя(Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГруппыДоступа.Профиль КАК Профиль
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ПО ГруппыДоступаПользователи.Ссылка = ГруппыДоступа.Ссылка
	|ГДЕ
	|	ГруппыДоступаПользователи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Результат = Запрос.Выполнить().Выбрать();
	
	ДоступныеПрофили = Новый Массив;
	Пока Результат.Следующий() Цикл
		ИмяРеквизитаНаименование = "Наименование";
		НаименованиеПрофиля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.Профиль, ИмяРеквизитаНаименование);
		ДоступныеПрофили.Добавить(НаименованиеПрофиля);
	КонецЦикла;
	
	СписокДоступныхПрофилей = СтрСоединить(ДоступныеПрофили, ";");
	
	Возврат СписокДоступныхПрофилей;
	
КонецФункции

Функция СтруктураВСтрокуJSON(Значение)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, Значение);

	Возврат ЗаписьJSON.Закрыть();

КонецФункции

Процедура ЗаписатьОшибкуВЖурналРегистрации(Комментарий)
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Обратная связь'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
	
КонецПроцедуры

Процедура УвеличитьСчетчикПроведенныхДокументов(ОпытНачалоРаботы)
	
	ОбщееКоличествоПроведенныхДокументов = 0;

	Если Не ОпытНачалоРаботы.Свойство("ОбщееКоличествоПроведенныхДокументов", ОбщееКоличествоПроведенныхДокументов) Тогда
		ОбщееКоличествоПроведенныхДокументов = 0;
		ОпытНачалоРаботы.Вставить("ОбщееКоличествоПроведенныхДокументов", ОбщееКоличествоПроведенныхДокументов);
	КонецЕсли;

	МаксимальноеЗначениеСчетчика = 999;
	Если ОбщееКоличествоПроведенныхДокументов = МаксимальноеЗначениеСчетчика Тогда
		Возврат;
	КонецЕсли;

	ОбщееКоличествоПроведенныхДокументов = Мин(ОбщееКоличествоПроведенныхДокументов + 1, МаксимальноеЗначениеСчетчика);
	ОпытНачалоРаботы.ОбщееКоличествоПроведенныхДокументов = ОбщееКоличествоПроведенныхДокументов;
	
	СохранитьНастройкуОпросаНачалоРаботы(ОпытНачалоРаботы);
	
КонецПроцедуры

#КонецОбласти

