
// Описание механизма работы изменения значений ФО:
// В момент подключения приложения будут изменены функциональные опции, относящиеся к следующим категориям:
// - функциональные опции Булевского типа, имеющие значение по умолчанию = Истина
// - функциональные опции, для которых установлен параметр Принудительное включение
// Остальные ФО остаются в том же состоянии, что и были.
// В момент отключения приложения происходит следующее:
// - функциональные опции, для которых установлен параметр ЗначениеПриОтключении принимают это значенин
// - функциональные опции Булевского типа, имеющие значение по умолчанию = Истина становятся равны Ложь
// - остальные ФО принимают значение, указанное в поле ЗначениеПоУмолчанию
// Ниже будут приведены основные сценарии добавления новых ФО в кубик с описанием действий, которые необходимо
// предпринять для того или иного результата:
// - Если необходимо просто задеклалировать наличие ФО в кубике, достаточно использовать следующую конструкцию:
//
//	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения", Ложь);
//
// В момент подключения приложения указанная ФО просто станет доступной, в момент отключения приложения примет значение Ложь
//	
// - Если необходимо, чтобы в момент включения ФО приняла указанное значение:
//
//	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеКодовВПечатныхФормах", Перечисления.КодыНоменклатурыВДокументах.Код, , Истина);
//
// В момент подключения приложения указанная ФО примет значение Перечисления.КодыНоменклатурыВДокументах.Код,
// в момент отключения ФО так же станет Перечисления.КодыНоменклатурыВДокументах.Код
//
// - Если необходимо, чтобы в момент подключения ФО приняла одно значение, а в момент отключения - другое:
//
//	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеКодовВПечатныхФормах", 
//		Перечисления.КодыНоменклатурыВДокументах.Код, Перечисления.КодыНоменклатурыВДокументах.Артикул, Истина);
//
// Важно уточнить, что для максимально корректной работы, в особенности в вопросе сохранения значений ФО,
// рекомендуется использовать оба параметра, как на примере выше - и принудительное включение, и значение при отключении.
// В случае использования только одного параметра рекомендуется вносить такую ФО в список Игнорируемых ФО (ТарификацияБизнес.ТаблицаИгнорируемыхФО),
// так как для таких случаев не гарантируется корректное сохранение значений измененных ФО

#Область ПрограммныйИнтерфейс

Процедура ВключитьВозможностиПриложения() Экспорт
	
	ВозможностиПодключаемогоПриложения = ФункциональныеВозможностиПриложения();
	
	Отбор = Новый Структура("ЗначениеПоУмолчанию", Истина);
	ВозможностиПриложенияВключенныеПоУмолчанию = ВозможностиПодключаемогоПриложения.НайтиСтроки(Отбор);
	
	Для каждого ВозможностьПриложения Из ВозможностиПриложенияВключенныеПоУмолчанию Цикл
		
		Попытка
			ИмяКонстанты = ВозможностьПриложения.Имя;
			Константы[ИмяКонстанты].Установить(Истина);
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Отбор = Новый Структура("ПринудительноеВключение", Истина);
	ВозможностиПриложенияВключенныеПоУмолчанию = ВозможностиПодключаемогоПриложения.НайтиСтроки(Отбор);
	
	Для каждого ВозможностьПриложения Из ВозможностиПриложенияВключенныеПоУмолчанию Цикл
		
		Попытка
			ИмяКонстанты = ВозможностьПриложения.Имя;
			Константы[ИмяКонстанты].Установить(ВозможностьПриложения.ЗначениеПоУмолчанию);
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;

	ПроизвестиНестандартнуюОбработкуПриВключении();	
	
КонецПроцедуры

Процедура ОтключитьВозможностиПриложения(ИсключаяВозможностиПриложений) Экспорт
	
	ОтключаемыеВозможности = ФункциональныеВозможностиПриложения();
	
	Для Каждого ОтключаемаяВозможность Из ОтключаемыеВозможности Цикл
		
		Если ИсключаяВозможностиПриложений.Найти(ОтключаемаяВозможность.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			ИмяКонстанты = ОтключаемаяВозможность.Имя;
			
			Если ОтключаемаяВозможность.ЗначениеПриОтключении <> Неопределено Тогда
				Константы[ИмяКонстанты].Установить(ОтключаемаяВозможность.ЗначениеПриОтключении);
			ИначеЕсли ОтключаемаяВозможность.ЗначениеПоУмолчанию = Истина Тогда
				// Отключить служебные константы включенные по умолчанию
				Константы[ИмяКонстанты].Установить(Ложь);
			Иначе
				// Сброс констант из ЕБВ
				Константы[ИмяКонстанты].Установить(ОтключаемаяВозможность.ЗначениеПоУмолчанию);
			КонецЕсли;
							
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
	
		КонецПопытки;
		
	КонецЦикла;


	ПроизвестиНестандартнуюОбработкуПриОтключении();	
	
КонецПроцедуры

Функция ФункциональныеВозможностиПриложения() Экспорт
	
	ТаблицаВозможностей = ТарификацияБизнес.НоваяТаблицаВозможностей();
	
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьДокументыПоПродажам", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьБанкИКассу", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьПереходКСпискуПокупателей", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьПереходКСпискуНоменклатурыВГлавном", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьВсеСправочникиОсновнойРаздел", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьПереходКПанелиОтчетовОсновнойРаздел", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьДокументыПоБанку", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьПереходКПанелиОтчетовОсновнойРаздел", Истина);

	// Раздел CRM
	// CRM.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуCRM", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьЛиды", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьДоговорыКонтрагентов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьАссистентаУправления", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьИсточникиПривлечения", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьШаблоныСообщений", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьШаблоныПечатиОфисныхДокументов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьНапоминанияПользователя", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьЗадачиСотрудников", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьКалендариСотрудников", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьИсточникиПривлечения", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьЗагрузкуЭлектроннойПочты", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьОбменСGoogleCalendar", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПрисоединенныеФайлы", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСобытия", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьИнтеграцииСистемыВзаимодействия", Истина);
	
	// Раздел Продажи
	// Продажи.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуПродажи", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьВидыЦен", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьАналогиНоменклатуры", Истина); 
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСчетаФактуры", Истина);

	// Раздел Деньги
	// Раздел Деньги.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуДеньги", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьБанкИКассу", Истина);
	
	// Раздел Компания
	// Раздел Компания.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуКомпания", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСправочникСотрудники", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПолныеВозможностиБанковскихСчетов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьДополнительныеРеквизитыИСведения", Истина);
	
	// Раздел Компания.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьПульсБизнеса", Истина);
	
	// Раздел Настройки
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияСовместноеИспользованиеСВнешнейУчетнойСистемой", Истина);
	
	// Раздел Настройки.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуНастройки", Истина);
		
	// Служебные возможности
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьГоловнуюОрганизацию", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьДоставкуВЗаказеПокупателя", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьИсториюРеквизитов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьКассы", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьКатегорииНоменклатуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьКонтактыКонтрагентов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьНастройкуФильтровПравойПанели", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьНастройкуФормы", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПроизводственныйКалендарь", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСвязанныеДокументы", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСегментыКонтрагентов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСопутствующиеТовары", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСправочникПользователи", Истина, Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСправочникСотрудники", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьТегиКонтрагентов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьТипыНоменклатуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьЧастичныеОтгрузки", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьЧастичныеОплаты", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьШтрихкоды", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьВводНаОсновании", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьВзаиморасчеты", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьВсеСправочникиОсновнойРаздел", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьДополнительныеНаименованияВСправочниках", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьКартинкиНоменклатуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьОтчетыВФормеНоменклатуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьРеквизитыЗакупкиПроизводстваВНоменклатуре", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьРеквизитыНалогообложения", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьСодержаниеДокументаВСписке", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПроцессыСостояний", Истина);

	ЕБВФункциональныеВозможностиПриложения(ТаблицаВозможностей);	
	
	Возврат ТаблицаВозможностей;
	
КонецФункции

Функция ЕБВФункциональныеВозможностиПриложения(ТаблицаВозможностей = Неопределено) Экспорт 
	
	Если ТаблицаВозможностей = Неопределено Тогда
		ТаблицаВозможностей = ТарификацияБизнес.НоваяТаблицаВозможностей();
	КонецЕсли;	
		
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьХарактеристики", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьПартии", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСегментыНоменклатуры", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСерииНоменклатуры", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"КонтрольОстатковСерийНоменклатуры", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьНеуникальныеШтрихКоды", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПрефиксВнутреннегоШтрихкодаШтучногоТовара", 0);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьНаборы", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ВестиУчетСредствИндивидуальнойЗащиты", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьМассовыеРассылкиИнтеграция", Ложь);
	
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияКонтрольДоговоров", 
		Перечисления.ВидыКонтроляДоговоровПриПроведении.НеКонтролировать);
		
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеКодовВПечатныхФормах", Перечисления.КодыНоменклатурыВДокументах.Код);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеСкидкиВПечатнойФорме", Перечисления.СпособОтображенияСкидок.Сумма);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ВыводитьСуммуБезСкидки", Перечисления.ВариантыВыводаСуммыБезСкидки.Печатать);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"КонтактнаяИнформацияТоварногоЧека", Перечисления.КонтактнаяИнформацияТоварногоЧека.ОрганизацияИСтруктурнаяЕдиница);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПечатьПользовательскихЕдиницИзмерения", Перечисления.ПечатьПользовательскихЕдиницИзмерения.ПересчитыватьВБазовуюЕдиницуИзмеренияНоменклатуры);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ВариантПечатиДоставки", Перечисления.ВариантыПечатиДоставки.ПустаяСсылка());
	
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьШтрихкодированиеПечатныхФормОбъектов", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеНомераДокументаБезПрефиксаИнформационнойБазы", Истина, Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеНомераДокументаБезПрефиксаОрганизации", Истина, Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеНомераДокументаБезПрефиксаПользователя", Истина, Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеНомераДокументаСЛидирующимиНулями", Ложь);
	
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ВидНаименованияОрганизацииДляПечатиДокументов", 
		Перечисления.ВидыНаименованийДляПечатиДокументов.Сокращенное);
		
	// Раздел CRM.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьНесколькоВариантовКП", Ложь);
	
	// Раздел Продажи.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьСборкуЗаказов", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьВидыЗаказовПокупателей", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьПланПродаж", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"СрокОплатыПокупателя", 0);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьСверкиВзаиморасчетов", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"КонтролироватьОстаткиПриПроведении", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетЦенПродажи", Истина);

	// Раздел Деньги.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ЗачитыватьАвансыДолгиАвтоматически", Перечисления.ДаНет.Нет);
	
	// Раздел Компания.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьНесколькоОрганизаций", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"УчетПоКомпании", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"Компания", Справочники.Организации.ПустаяСсылка());
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПолувыставлятор", Ложь, Ложь);
	
	Возврат ТаблицаВозможностей;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс     

Процедура ПриСозданииНаСервереЗаказПокупателяПолувыставлятор(Форма, Объект) Экспорт
	                                                             
	Элементы = Форма.Элементы;
	
	ИспользоватьПолувыставлятор = ПолучитьФункциональнуюОпцию("ИспользоватьПолувыставлятор");
	Если ИспользоватьПолувыставлятор = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	БылЗавершенВВыставленииСчетов =	Объект.ОтгруженВВыставленииСчетов И Объект.ОплаченВВыставленииСчетов 
		И Объект.СостояниеЗаказа = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен")
		И Объект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Успешно;
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();

	// Проверяем на даты запрета	
	ОбъектНеПроходитПоДатеЗапрета = Ложь;   
	ОбъектНеПроходитПоДатеЗапрета = ДатыЗапретаИзменения.ИзменениеЗапрещено(Форма.РеквизитФормыВЗначение("Объект"));
	Форма.ЗаблокированДатойЗапрета = ОбъектНеПроходитПоДатеЗапрета;
	Если ОбъектНеПроходитПоДатеЗапрета = Истина Тогда
		Если Объект.Ссылка.Пустая() Тогда
			ОбъектНеПроходитПоДатеЗапрета = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектНеПроходитПоДатеЗапрета = Истина Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанель", "ТолькоПросмотр", Истина);	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалВыставлениеСчетов", "ТолькоПросмотр", Истина);	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Банк", "ТолькоПросмотр", Истина);	
	КонецЕсли;
		
	// Включаем правую панель
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанель", "Видимость", Истина);	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанельСвернуто", "Видимость", Ложь);
	
	//Подключаем шапку и подвал от Выставления счетов
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ШапкаВыставлениеСчетов", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Шапка", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалВыставлениеСчетовОбъединение", "Видимость", Истина);	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалВыставлениеСчетов", "Видимость", Истина);	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалВыставлениеСчетовСвернуто", "Видимость", Истина);	
	
	// Прячем кнопку печатных форм от Выставления счетов
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОформитьАктНакладнуюВыставлениеСчетов", "Видимость", Ложь);	
	
	// Прячем элементы от Выставления счетов
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтрагентВыставлениеСчетов", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СкидкиВыставлениеСчетов", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИтогиВыставлениеСчетовТакси", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтгруженВВыставленииСчетов", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОплаченВВыставленииСчетов", "Видимость", Ложь);  
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияОтгружен", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияОплачен", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияЗавершен", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетЗавершен", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетЗавершен", "ТолькоПросмотр", Истина); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИтогиВыставлениеСчетовКолонка1", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИтогиВыставлениеСчетовКолонка2", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаглушкаСтатусаЗавершен", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИтогиПредоплата", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПечатьОтправить", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ШапкаВыставлениеСчетовПраваяКолонка", "Видимость", Ложь);

	// Видимость элементов, зависящих от завершенности в выставлении счетов
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗакрывающийДокумент", "Видимость", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидЗакрывающегоДокументаБизнесПриложение", "Видимость", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НомерЗакрывающегоДокумента", "Видимость", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаЗакрывающегоДокумента", "Видимость", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКнопкиАктаНакладной", "Видимость", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НапечататьАктНакладную", "Видимость", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДополнительныеРеквизитыБизнесПриложение", "Видимость", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТекстУсловийСчетаЗаказаВыставлениеСчетов", "Видимость", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Комментарий", "Видимость", НЕ БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидИСостояние", "ТолькоПросмотр", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВариантЗавершения", "ТолькоПросмотр", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВариантЗавершенияПраваяПанель", "ТолькоПросмотр", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СостояниеЗаказа", "ТолькоПросмотр", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыВставитьСтроки", "Видимость", НЕ БылЗавершенВВыставленииСчетов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыПодбор", "Доступность", НЕ БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗагрузкаДанныхИзВнешнегоИсточника", "Доступность", НЕ БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыКомандыИзменитьРезерв", "Доступность", НЕ БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПланируемыеДатыПраваяПанель", "ТолькоПросмотр", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыУстановитьФлажки", "Доступность", НЕ БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыГруппаОтменаТоваров", "ТолькоПросмотр", БылЗавершенВВыставленииСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыПоискПоШтрихкоду", "Доступность", НЕ БылЗавершенВВыставленииСчетов);

	// Включаем видимость наших элементов 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтгрузкаПолувыставлятор", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОплатаПолувыставлятор", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗавершенПолувыставлятор", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтгруженПолувыставлятор", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОплаченПолувыставлятор", "Видимость", Истина);  
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыНастроитьНДС", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыПоказатьСтраницы", "Видимость", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтгруженПолувыставлятор", "ТолькоПросмотр", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОплаченПолувыставлятор", "ТолькоПросмотр", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтгруженПолувыставлятор", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьРасходнаяНакладная", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОплаченПолувыставлятор", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьОплата", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодсказкаПолувыставлятор", "Видимость", Истина);
	
	
	// Убираем кнопку Записать, переименовываем кнопки проведения
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаЗаписать", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПровестиИЗакрыть", "Заголовок", "Записать и закрыть");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПровести", "Заголовок", "Записать");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтатусСчетаПраваяПанель", "Заголовок", "Статус");
	
	// Прячем стандартные элементы
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Подвал", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Организация", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыПоказатьСтраницы", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИтогВсегоВыставлениеСчетовСвернуто", "Видимость", Ложь);
	
	// Меняем параметры элементов
	Элементы.ОтгруженВВыставленииСчетов.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	Элементы.ОплаченВВыставленииСчетов.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	Элементы.СчетЗавершен.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	Элементы.ОтгруженВВыставленииСчетов.Подсказка = "Рассчитывается автоматически";
	Элементы.ОплаченВВыставленииСчетов.Подсказка = "Рассчитывается автоматически";
	Элементы.СчетЗавершен.Подсказка = "Рассчитывается автоматически";	
	Элементы.НомерВыставлениеСчетов.Заголовок = "Заказ №";
	Элементы.ПредоплатаИтогСуммаРасчетов.Ширина = 10;
	Элементы.ВидЗаказа.Заголовок = "Вид заказа";
	Элементы.СостояниеЗаказа.Заголовок = "Состояние";
	Элементы.СостояниеЗаказа.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	Элементы.ВидЗаказа.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	Элементы.ПодменюПечать.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Элементы.ПодменюОтправить.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Элементы.ВариантЗавершенияПраваяПанель.ШиринаЭлемента = 10;
	Элементы.ДатаВыставлениеСчетов.Заголовок = "от";
	Элементы.ИтогСуммаНДСВыставлениеСчетов.Заголовок = "НДС";
	Элементы.ИтогВсегоВыставлениеСчетов.Заголовок = "Всего";
	Элементы.СкидкаСуммаВыставлениеСчетов1.Заголовок = "Скидка руч., Σ";
	Элементы.ИтогВес.Заголовок = "Вес брутто, кг";
	Элементы.ИтогОбъем.Заголовок = "Объем, м³";
	Элементы.ИтогоВыставлениеСчетовСвернуто.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Двойной;
	Элементы.Комментарий.КнопкаВыбора = Ложь;
	Элементы.Комментарий.ПодсказкаВвода = "";
	Элементы.КомментарийКонтекстноеМенюКомментарийИзменить.Видимость = Ложь;
	Элементы.Комментарий.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	Элементы.ГруппаСтатусСчетаПраваяПанель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	// Перемещаем элементы
	Элементы.Переместить(Элементы.КолонкаСсылки, Элементы.ШапкаВыставлениеСчетовСсылки);
	Элементы.Переместить(Элементы.ВидИСостояние, Элементы.РеквизитыШапкиВыставлениеСчетов);
	Элементы.Переместить(Элементы.ПодвалПраво, Элементы.ГруппаИтогиВыставлениеСчетов);
	Элементы.Переместить(Элементы.ОстатокВзаиморасчетов, Элементы.КолонкаСсылки);
	Элементы.Переместить(Элементы.ФормаПровести, Элементы.КомандыУправленияДокументомОсновные);
	Элементы.Переместить(Элементы.ВидЗаказа, Элементы.ГруппаВидСостояние);
	Элементы.Переместить(Элементы.СостояниеЗаказа, Элементы.ГруппаВидСостояние);
	Элементы.Переместить(Элементы.ПредоплатаИтогСуммаРасчетов, Элементы.ДополнительноПраво);			
	Элементы.Переместить(Элементы.НомерВыставлениеСчетов, Элементы.КолонкаШапкаЛево);
	Элементы.Переместить(Элементы.КонтрагентИнформация, Элементы.КолонкаШапкаЛево);
	Элементы.Переместить(Элементы.ДатаВыставлениеСчетов, Элементы.КолонкаШапкаПраво);
	Элементы.Переместить(Элементы.ДоговорИнформация, Элементы.КолонкаШапкаПраво);
	Элементы.Переместить(Элементы.СкидкаСуммаВыставлениеСчетов1, Элементы.ИтогоВыставлениеСчетовСвернуто, Элементы.ИтогСуммаВыставлениеСчетовСвернуто);
	Элементы.Переместить(Элементы.ИтогВсегоСвернуто, Элементы.ИтогоВыставлениеСчетовСвернуто);
	Элементы.Переместить(Элементы.Комментарий, Элементы.ГруппаПечатьКомментарий);

	Если ЭтоМобильныйКлиент <> Истина Тогда
		Элементы.Переместить(Элементы.ПодменюПечать, Элементы.ГруппаКнопкиОтправить);
		Элементы.Переместить(Элементы.ПодменюОтправить, Элементы.ГруппаКнопкиОтправить);
	КонецЕсли;
	
	ЭтоТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ЭтоТакси Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалВыставлениеСчетовСвернуто", "Видимость", Ложь);	
		Если БылЗавершенВВыставленииСчетов = Истина Тогда
			Элементы.ВидЗакрывающегоДокументаБизнесПриложение.Ширина = 15;
			Элементы.НомерЗакрывающегоДокумента.Ширина = 17;
			Элементы.ДатаЗакрывающегоДокумента.Ширина = 15;
			Элементы.ДатаДоговораБизнесПриложение.Ширина = 10;
			Элементы.ДатаПлатежноРасчетногоДокументаБизнесПриложение.Ширина = 10;
			Элементы.ДатаСчетаФактурыНаАвансБизнесПриложение.Ширина = 10;
			Элементы.ВидЗакрывающегоДокументаБизнесПриложение.РастягиватьПоГоризонтали = Ложь;
			Элементы.ПраваяПанельКонтент.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Двойной;
		КонецЕсли;   
		
		Элементы.СостояниеЗаказа.РастягиватьПоГоризонтали = Истина;
		Элементы.СостояниеЗаказа.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		
		Элементы.ВидЗаказа.РастягиватьПоГоризонтали = Истина;
		Элементы.ВидЗаказа.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		
		Элементы.ПраваяПанель.Ширина = 25;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияВсегоНаименований", "Шрифт", ШрифтыСтиля.ОбычныйШрифтТекста);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияСуммаПрописью", "Шрифт", ШрифтыСтиля.ГруппаВариантовОтчетовВажнаяШрифт);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НомерВыставлениеСчетов", "ШрифтЗаголовка", ШрифтыСтиля.ГруппаВариантовОтчетовВажнаяШрифт);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаВыставлениеСчетов", "ШрифтЗаголовка", ШрифтыСтиля.ГруппаВариантовОтчетовВажнаяШрифт);
		Элементы.Переместить(Элементы.ТекстУсловийСчетаЗаказаВыставлениеСчетов, Элементы.ГруппаПодписиВыставлениеСчетов, Элементы.ГруппаПечатьВыставлениеСчетов);
		
	Иначе  
		// Подгонка и декораций
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПечатьВыставлениеСчетов", "Ширина", 10);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПечатьВыставлениеСчетов", "Высота", 3);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЛоготипВыставлениеСчетов", "Ширина", 10);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЛоготипВыставлениеСчетов", "Высота", 3);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОплатаПолувыставлятор", "Высота", 0);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтгрузкаПолувыставлятор", "Высота", 0);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СкидкиВыставлениеСчетовСвернуто", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаОтменаПроведения", "Видимость", Ложь);
		
		
		Элементы.ДоставкаКолонки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
		// Меняем положение заголовков
		Элементы.ТекстУсловийСчетаЗаказаВыставлениеСчетов.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		Элементы.ПодписьРуководителяПодвал.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.ПодписьБухгалтераПодвал.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.РекламныйБлокПечтаныхФорм.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.ПраваяПанель.Ширина = 33;
		Элементы.ДоставкаПраваяКолонка.Ширина = 68;
		Элементы.ПраваяПанель.ВертикальнаяПрокруткаПриСжатии = Истина;
		
		Элементы.НадписьРасходнаяНакладная.Ширина = 0;
		Элементы.НадписьОплата.Ширина = 0;
		Элементы.КолонкаШапкаЛево.Ширина = 30;
		
		Элементы.ОткрытьМенюОплаты.Высота = 0;
		Элементы.ОткрытьМенюОтгрузки.Высота = 0;
 
		Элементы.ВариантЗавершенияПраваяПанель.РастягиватьПоГоризонтали = Истина;
		
		// Перемещаем кномки в соответствующие группы
		Элементы.Переместить(Элементы.ТекстУсловийСчетаЗаказаВыставлениеСчетов, Элементы.ГруппаПодписиВыставлениеСчетов, Элементы.ГруппаПечатьВыставлениеСчетов);
		Элементы.Переместить(Элементы.ЗапасыНастроитьНДС, Элементы.ЗапасыГруппаНастроитьНДС);
	КонецЕсли;                        
	
	
	Если БылЗавершенВВыставленииСчетов = Истина ИЛИ ОбъектНеПроходитПоДатеЗапрета = Истина Тогда
		
		ПараметрыБаннера = ОбщегоНазначения.ПараметрыВажногоСообщения(); 
		Сообщение = "";
		Если БылЗавершенВВыставленииСчетов = Истина	Тогда	
			Сообщение = Сообщение + "Документ завершен в приложении ""Выставление счетов"". Для данного документа доступны команды печати этого приложения. ";
		КонецЕсли;      
		Если ОбъектНеПроходитПоДатеЗапрета = Истина	Тогда	
			Сообщение = Сообщение + "Изменение документа запрещено в связи с установленной датой запрета редактирования.";
		КонецЕсли;  
		ПараметрыБаннера.Сообщение = Сообщение;
		ПараметрыБаннера.ТипСообщения = "Предупреждение";
		ПараметрыБаннера.Скрываемый = Истина;
		ПараметрыБаннера.КраткоеПредставление = "Информационная база не зарегистрирована";
		ПараметрыБаннера.Идентификатор = "ИБНеЗарегистрирована";
		Если БылЗавершенВВыставленииСчетов = Истина	Тогда	
			ПараметрыБаннера.Скрываемый = Ложь;
		КонецЕсли;  
		
		ПараметрыБаннера.Родитель = "ГруппаСсылкиПанель";   
			
		ОбщегоНазначения.ДобавитьВажноеСообщение(Форма,ПараметрыБаннера);
		ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(Форма);
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		Элементы.ГруппаВсегоСуммаПрописью.Видимость = Ложь;
		Элементы.ГруппаИтогиВыставлениеСчетов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.СкидкиВыставлениеСчетов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		Элементы.ГруппаПодписиВыставлениеСчетов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ГруппаПодписиГоризонтально.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.КолонкаШапкаЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.КолонкаШапкаПраво.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
		Элементы.ГруппаКонтрагентДоговорПолувыставление.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
		Элементы.ШапкаВыставлениеСчетов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
		Элементы.ГруппаСтатусСчетаПраваяПанель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
		Элементы.ИтогиВесИОбъем.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно; 
		
		Элементы.Переместить(Элементы.НомерВыставлениеСчетов, Элементы.КолонкаШапкаЛево);
		Элементы.Переместить(Элементы.ДатаВыставлениеСчетов, Элементы.КолонкаШапкаЛево);
		Элементы.Переместить(Элементы.КонтрагентИнформация, Элементы.КолонкаШапкаЛево);
		Элементы.Переместить(Элементы.ДоговорИнформация, Элементы.КолонкаШапкаЛево);

		Элементы.ОтображениеПодписиРуководитель.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.ОтображениеПодписиБухгалтер.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.ГруппаПечатьВыставлениеСчетов.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.ПечатьВыставлениеСчетов.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.СкидкаСуммаВыставлениеСчетов.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.СкидкаПроцентВыставлениеСчетов.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.СкидкиВыставлениеСчетов.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента .Авто;
		Элементы.СкидкаПроцентВыставлениеСчетов.РастягиватьПоГоризонтали = Неопределено;
		Элементы.СкидкиВыставлениеСчетов.РастягиватьПоГоризонтали = Неопределено;
		
		Элементы.ГруппаЗаказИПраваяПанель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ПраваяПанель.Ширина = 0;
		Элементы.ГруппаОтступ.Видимость = Ложь;
		
		Элементы.ГруппаПодписиРеклама.Ширина = 0;
		Элементы.ГруппаПодписиРеклама.РастягиватьПоГоризонтали = Неопределено;
		Элементы.ТекстУсловийСчетаЗаказаВыставлениеСчетов.Ширина = 0;
		Элементы.ТекстУсловийСчетаЗаказаВыставлениеСчетов.РастягиватьПоГоризонтали = Неопределено;
		Элементы.РекламныйБлокПечтаныхФорм.АвтоМаксимальнаяШирина = Истина;
		Элементы.КолонкаШапкаЛево.РастягиватьПоГоризонтали = Истина;
		
		Элементы.ПодвалВыставлениеСчетов.Поведение = ПоведениеОбычнойГруппы.Авто;
		Элементы.ПодвалВыставлениеСчетовСвернуто.Видимость = Ложь;
		Элементы.ГруппаИтогиВыставлениеСчетов.Ширина = 0;
		Элементы.ГруппаИтогиВыставлениеСчетов.РастягиватьПоГоризонтали = Неопределено;
		
		Элементы.Переместить(Элементы.ШапкаВыставлениеСчетовПраваяКолонка, Элементы.ГруппаДляЛого);
		Элементы.ГруппаДляЛого.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ГруппаДляЛого.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы .Нет;
		Элементы.ЛоготипВыставлениеСчетов.Высота = 3;
		Элементы.ДекорацияQR.Высота = 2;
		Элементы.ДекорацияQRСБП.Высота = 2;
		Элементы.ИтогОбъем.Ширина = 10;
		Элементы.ИтогВес.Ширина = 13;
		
		Если ЭтоТакси Тогда
			Элементы.НомерВыставлениеСчетов.ШрифтЗаголовка = Новый Шрифт;
			Элементы.ДатаВыставлениеСчетов.ШрифтЗаголовка = Новый Шрифт;
			Элементы.ОтгрузкаДо.Заголовок = НСтр("ru = 'Отгрузка'");
			Элементы.ОтгрузкаДо.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы .Авто;
			Элементы.ОплатаДо.Заголовок = НСтр("ru = 'Оплата'");
			Элементы.ОплатаДо.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы .Авто;
			Элементы.ДекорацияQR.Ширина = 6;
			Элементы.ДекорацияQRСБП.Ширина = 6;
			Элементы.Переместить(Элементы.НомерВыставлениеСчетов, Элементы.РеквизитыШапкиВыставлениеСчетов);
			Элементы.Переместить(Элементы.ДатаВыставлениеСчетов, Элементы.РеквизитыШапкиВыставлениеСчетов);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

Функция ПолучитьОплатуОтгрузкуЗаказа(Заказ) Экспорт
	
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("ОтгрузкаПолувыставлятор", 2);
	СтруктураОтвет.Вставить("ОплатаПолувыставлятор", 2);
	
	ЗапросЗаказ = Новый Запрос;
	ЗапросЗаказ.Текст = "ВЫБРАТЬ
	                    |	ВЫБОР
	                    |		КОГДА ДокументЗаказПокупателя.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
	                    |				ИЛИ НЕ ДокументЗаказПокупателя.Проведен
	                    |				ИЛИ ДокументЗаказПокупателя.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаявкаНаПродажу), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаявкаЗаказНаряд))
	                    |				ИЛИ ДокументЗаказПокупателя.НетСтрокВДокументе
	                    |			ТОГДА -1
	                    |		КОГДА ДокументЗаказПокупателя.ОжидаетсяВыборВариантаКП
	                    |			ТОГДА 2
	                    |		КОГДА ГрафикВыполнения.Заказ ЕСТЬ NULL
	                    |				И ГрафикВыполненияПлан.Заказ ЕСТЬ NULL
	                    |			ТОГДА 0
	                    |		КОГДА ЕСТЬNULL(ГрафикВыполнения.Выполнено, 0) = 0
	                    |				И ЕСТЬNULL(ГрафикВыполненияПлан.Выполнено, 0) = 0
	                    |			ТОГДА ВЫБОР
	                    |					КОГДА ГрафикВыполнения.Заказ ЕСТЬ NULL
	                    |						ТОГДА 2
	                    |					КОГДА ГрафикВыполнения.Период < &АктуальнаяДатаСеанса
	                    |						ТОГДА 6
	                    |					КОГДА ГрафикВыполнения.Период = &АктуальнаяДатаСеанса
	                    |						ТОГДА 4
	                    |					ИНАЧЕ 2
	                    |				КОНЕЦ
	                    |		ИНАЧЕ ВЫБОР
	                    |				КОГДА ГрафикВыполнения.Заказ ЕСТЬ NULL
	                    |					ТОГДА 1
	                    |				КОГДА ГрафикВыполнения.Период < &АктуальнаяДатаСеанса
	                    |					ТОГДА 5
	                    |				КОГДА ГрафикВыполнения.Период = &АктуальнаяДатаСеанса
	                    |					ТОГДА 3
	                    |				ИНАЧЕ 1
	                    |			КОНЕЦ
	                    |	КОНЕЦ КАК НомерКартинкиОтгрузки,
	                    |	ВЫБОР
	                    |		КОГДА НЕ ДокументЗаказПокупателя.Контрагент.ВестиРасчетыПоЗаказам
	                    |			ТОГДА -1
	                    |		КОГДА ЕСТЬNULL(ФактОплаты.СуммаОплаты, 0) + ЕСТЬNULL(ФактОплаты.СуммаАванса, 0) = 0
	                    |			ТОГДА ВЫБОР
	                    |					КОГДА ДокументЗаказПокупателя.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
	                    |							ИЛИ НЕ ДокументЗаказПокупателя.Проведен
	                    |							ИЛИ ДокументЗаказПокупателя.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаявкаНаПродажу), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаявкаЗаказНаряд))
	                    |						ТОГДА -1
	                    |					КОГДА (ДокументЗаказПокупателя.ЗапланироватьОплату
	                    |							ИЛИ ДокументЗаказПокупателя.ОплатаДо <> ДАТАВРЕМЯ(1, 1, 1))
	                    |							И НЕ ГрафикОплаты.СчетНаОплату ЕСТЬ NULL
	                    |							И НЕ ДокументЗаказПокупателя.СостояниеЗаказа = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
	                    |						ТОГДА ВЫБОР
	                    |								КОГДА ГрафикОплаты.Период < &АктуальнаяДатаСеанса
	                    |									ТОГДА 6
	                    |								КОГДА ГрафикОплаты.Период = &АктуальнаяДатаСеанса
	                    |									ТОГДА 4
	                    |								ИНАЧЕ 2
	                    |							КОНЕЦ
	                    |					КОГДА ЕСТЬNULL(ФактОплаты.Сумма, 0) = 0
	                    |						ТОГДА -1
	                    |					ИНАЧЕ 2
	                    |				КОНЕЦ
	                    |		КОГДА ЕСТЬNULL(ФактОплаты.СуммаОплаты, 0) + ЕСТЬNULL(ФактОплаты.СуммаАванса, 0) = ДокументЗаказПокупателя.СуммаДокумента
	                    |			ТОГДА 0
	                    |		КОГДА ЕСТЬNULL(ФактОплаты.СуммаОплаты, 0) + ЕСТЬNULL(ФактОплаты.СуммаАванса, 0) > ДокументЗаказПокупателя.СуммаДокумента
	                    |			ТОГДА 7
	                    |		ИНАЧЕ ВЫБОР
	                    |				КОГДА ДокументЗаказПокупателя.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
	                    |						ИЛИ НЕ ДокументЗаказПокупателя.Проведен
	                    |						ИЛИ ДокументЗаказПокупателя.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаявкаНаПродажу), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаявкаЗаказНаряд))
	                    |					ТОГДА 1
	                    |				КОГДА (ДокументЗаказПокупателя.ЗапланироватьОплату
	                    |						ИЛИ ДокументЗаказПокупателя.ОплатаДо <> ДАТАВРЕМЯ(1, 1, 1))
	                    |						И НЕ ГрафикОплаты.СчетНаОплату ЕСТЬ NULL
	                    |						И НЕ ДокументЗаказПокупателя.СостояниеЗаказа = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
	                    |					ТОГДА ВЫБОР
	                    |							КОГДА ГрафикОплаты.Период < &АктуальнаяДатаСеанса
	                    |								ТОГДА 5
	                    |							КОГДА ГрафикОплаты.Период = &АктуальнаяДатаСеанса
	                    |								ТОГДА 3
	                    |							ИНАЧЕ 1
	                    |						КОНЕЦ
	                    |				ИНАЧЕ 1
	                    |			КОНЕЦ
	                    |	КОНЕЦ КАК НомерКартинкиОплаты
	                    |ИЗ
	                    |	Документ.ЗаказПокупателя КАК ДокументЗаказПокупателя
	                    |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикВыполненияЗаказов КАК ГрафикВыполнения
	                    |		ПО ДокументЗаказПокупателя.Ссылка = ГрафикВыполнения.Заказ
	                    |			И (ГрафикВыполнения.Период <= &АктуальнаяДатаСеанса)}
	                    |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикВыполненияЗаказов КАК ГрафикВыполненияПлан
	                    |		ПО ДокументЗаказПокупателя.Ссылка = ГрафикВыполненияПлан.Заказ
	                    |			И (ГрафикВыполненияПлан.Период > &АктуальнаяДатаСеанса)}
	                    |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикОплатыЗаказов КАК ГрафикОплаты
	                    |		ПО ДокументЗаказПокупателя.Ссылка = ГрафикОплаты.СчетНаОплату
	                    |			И (ГрафикОплаты.Период <= &АктуальнаяДатаСеанса)}
	                    |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФактОплатыЗаказов КАК ФактОплаты
	                    |		ПО ДокументЗаказПокупателя.Ссылка = ФактОплаты.СчетНаОплату}
	                    |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
	                    |		ПО (СостоянияЭД.СсылкаНаОбъект = ДокументЗаказПокупателя.Ссылка)}
	                    |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаказыПокупателейССайта КАК ЗаказыПокупателейССайта
	                    |		ПО ДокументЗаказПокупателя.Ссылка = ЗаказыПокупателейССайта.ЗаказПокупателя}
	                    |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	                    |		ПО ДокументЗаказПокупателя.Ссылка = НаличиеФайлов.ОбъектСФайлами}
	                    |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОригиналовПервичныхДокументов КАК СостоянияОригиналовПервичныхДокументов
	                    |		ПО ДокументЗаказПокупателя.Ссылка = СостоянияОригиналовПервичныхДокументов.Владелец
	                    |			И (СостоянияОригиналовПервичныхДокументов.ОбщееСостояние = ИСТИНА)}
	                    |ГДЕ
	                    |	ДокументЗаказПокупателя.Ссылка = &Ссылка";
	ЗапросЗаказ.УстановитьПараметр("Ссылка", Заказ);
	ЗапросЗаказ.УстановитьПараметр("АктуальнаяДатаСеанса", НачалоДня(ТекущаяДатаСеанса()));
	ЛидыДоступны = РаботаСЛидами.ЛидыДоступны();
	ЗапросЗаказ.УстановитьПараметр("ЛидыДоступны", ЛидыДоступны);
	ЗапросЗаказ.УстановитьПараметр("НеУчитывается", НСтр("ru = 'Не учитывается'"));
	ЗапросЗаказ.УстановитьПараметр("ОплаченПолностью", НСтр("ru = 'Оплачен полностью'"));
	ЗапросЗаказ.УстановитьПараметр("ОплаченЧастично", НСтр("ru = 'Оплачен частично'"));
	ЗапросЗаказ.УстановитьПараметр("БезОплаты", НСтр("ru = 'Без оплаты'")); 
	
	Выборка = ЗапросЗаказ.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда                                 
		СтруктураОтвет.ОтгрузкаПолувыставлятор = Выборка.НомерКартинкиОтгрузки;	
		СтруктураОтвет.ОплатаПолувыставлятор = Выборка.НомерКартинкиОплаты;	
	КонецЕсли;
	
	Возврат СтруктураОтвет;
	
КонецФункции

Процедура ОчиститьОплатуОтгрузкуВНеудачноЗавершенныхДокументах() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.СостояниеЗаказа = &СостояниеЗаказа
		|	И ЗаказПокупателя.ВариантЗавершения = &ВариантЗавершения
		|	И (ЗаказПокупателя.ОтгруженВВыставленииСчетов = ИСТИНА
		|			ИЛИ ЗаказПокупателя.ОплаченВВыставленииСчетов = ИСТИНА)";
	Запрос.УстановитьПараметр("СостояниеЗаказа", Справочники.СостоянияЗаказовПокупателей.Завершен);
	Запрос.УстановитьПараметр("ВариантЗавершения", Перечисления.ВариантыЗавершенияЗаказа.Отменен);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Попытка
			ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ДокументОбъект.ОтгруженВВыставленииСчетов = Ложь;
			ДокументОбъект.ОплаченВВыставленииСчетов = Ложь;
			ДокументОбъект.ВидЗакрывающегоДокументаВыставлениеСчетов = Перечисления.ДоступныеПечатныеФормыВыставлениеСчетов.ПустаяСсылка();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ИнформацияОшибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("ОшибкаИзмененияДокументаПриПереходеИзВыставленияСчетов",
				УровеньЖурналаРегистрации.Ошибка,,, ИнформацияОшибка);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры	

Процедура УстановитьОплатуОтгрузкуВУдачноЗавершенныхДокументах() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.СостояниеЗаказа = &СостояниеЗаказа
		|	И ЗаказПокупателя.ВариантЗавершения = &ВариантЗавершения
		|	И ((ЗаказПокупателя.ОтгруженВВыставленииСчетов = ИСТИНА
		|				И ЗаказПокупателя.ОплаченВВыставленииСчетов <> ИСТИНА)
		|			ИЛИ (ЗаказПокупателя.ОтгруженВВыставленииСчетов <> ИСТИНА
		|				И ЗаказПокупателя.ОплаченВВыставленииСчетов = ИСТИНА))";
	Запрос.УстановитьПараметр("СостояниеЗаказа", Справочники.СостоянияЗаказовПокупателей.Завершен);
	Запрос.УстановитьПараметр("ВариантЗавершения", Перечисления.ВариантыЗавершенияЗаказа.Успешно);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Попытка
			ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ДокументОбъект.ОтгруженВВыставленииСчетов = Истина;
			ДокументОбъект.ОплаченВВыставленииСчетов = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ИнформацияОшибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("ОшибкаИзмененияДокументаПриПереходеИзВыставленияСчетов",
				УровеньЖурналаРегистрации.Ошибка,,, ИнформацияОшибка);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ОбработатьПодключениеПолувыставлятора() Экспорт
	
	Константы.ВыставлениеСчетовБылоОтключено.Установить(Ложь);
	Константы.ИспользоватьПолувыставлятор.Установить(Истина);
	БизнесПриложениеCRM.ОчиститьОплатуОтгрузкуВНеудачноЗавершенныхДокументах();
	БизнесПриложениеCRM.УстановитьОплатуОтгрузкуВУдачноЗавершенныхДокументах(); 
	
КонецПроцедуры 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ПроизвестиНестандартнуюОбработкуПриВключении()

	Если НЕ ВозможностиПриложения.КонстантаДоступнаВПриложении("ИспользоватьРаспознаваниеДокументов") Тогда
		Константы.ИспользоватьРаспознаваниеДокументов.Установить(Ложь);
	КонецЕсли;
	
	Константы.ИспользоватьРаботуСПоискомКонтрагентовВСписке.Установить(Ложь);
	УправлениеКонтактнойИнформациейУНФ.ОбновитьВидыКИ();
	
	Если Константы.ВыставлениеСчетовБылоОтключено.Получить() = Истина Тогда
		БизнесПриложениеCRM.ОбработатьПодключениеПолувыставлятора();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроизвестиНестандартнуюОбработкуПриОтключении()

	УправлениеКонтактнойИнформациейУНФ.ОбновитьВидыКИ();
	
КонецПроцедуры

#КонецОбласти
