
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИсточникПривлечения", ИсточникПривлеченияВладелец) Тогда
		Запись.ИсточникПривлечения = ИсточникПривлеченияВладелец;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Ответственный) И Параметры.Ключ.Пустой() Тогда
		Запись.Ответственный = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойОтветственный");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Период.ДатаНачала = ТекущийОбъект.ДатаНачала;
	Период.ДатаОкончания = ТекущийОбъект.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Период) Тогда
		
		Если Не ЗначениеЗаполнено(Запись.ДатаНачала) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Заполните дату начала действия расхода'"), , "Период", , Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.ДатаОкончания) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Заполните дату окончания действия расхода'"), , "Период", , Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.ДатаНачала) И ЗначениеЗаполнено(Запись.ДатаОкончания) Тогда
			
			Если Запись.ДатаОкончания < Запись.ДатаНачала Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Дата окончания не может быть меньше даты начала'"), , "Период", , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Запись.ДатаНачала = Период.ДатаНачала;
	Запись.ДатаОкончания = Период.ДатаОкончания;
	
КонецПроцедуры

#КонецОбласти