
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ЗначениеЗаполнено(ПричинаНеуспешногоЗавершенияРаботы) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поле ""Причина"" не заполнено'"));
		Возврат;
	КонецЕсли;
	
	ДанныеНекачественногоЛида = Новый Структура;
	ДанныеНекачественногоЛида.Вставить("ПричинаНеуспешногоЗавершенияРаботы",ПричинаНеуспешногоЗавершенияРаботы);
	ДанныеНекачественногоЛида.Вставить("Комментарий",Комментарий);
	
	Закрыть(ДанныеНекачественногоЛида);
	
КонецПроцедуры

#КонецОбласти
