
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		
		ПараметрыСообщения.ТипСообщения = "Информация";
		ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Маршрут без участников'");
		ПараметрыСообщения.Сообщение = НСтр("ru = 'Данный маршрут позволяет автоматически утверждать заявки на расход денег и не содержит участников'");
		ПараметрыСообщения.Скрываемый = Ложь;
		
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
		ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
	КонецЕсли;
		
	ОбработатьТаблицуУчастникиМаршрута();
	        
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьТаблицуУчастникиМаршрута()
	
	ТекущийСогласующий = РегистрыСведений.СогласованиеЗаявок.ПолучитьТекущегоСогласующего(Параметры.ЗаявкаСсылка);
	
	ТаблицаУчастники = Объект.УчастникиМаршрута;
	
	СтрокаАвтор = ТаблицаУчастники.Вставить(0);
	СтрокаАвтор.Пользователь = Параметры.АвторЗаявки;
	СтрокаАвтор.СтатусСогласования = НСтр("ru='Автор'");
	СтрокаАвтор.ЕстьПравоУтвержденияВнеСогласования = Пользователи.РолиДоступны("УтверждениеЗаявокНаРасходДенегВОбходСогласования",
																				СтрокаАвтор.Пользователь);
	Если Параметры.ЗаявкаПроведена Тогда
		
		Если ЗначениеЗаполнено(ТекущийСогласующий) Тогда
			
			Отбор = Новый Структура("Пользователь", ТекущийСогласующий);   
			НайденныеСтроки = ТаблицаУчастники.НайтиСтроки(Отбор);
			СтрокаТекущийСогласующий = НайденныеСтроки[НайденныеСтроки.Количество() - 1];
			СтрокаТекущийСогласующий.СтатусСогласования = НСтр("ru='Текущий согласующий'");
			ИндексТекущийСогласующий = ТаблицаУчастники.Индекс(СтрокаТекущийСогласующий);
		
		Иначе
			
			ИндексТекущийСогласующий = ТаблицаУчастники.Количество();
	
		КонецЕсли;
		
	Иначе
		ИндексТекущийСогласующий = 0;
	КонецЕсли;
	
	Для ИндексСтроки = 1 По ТаблицаУчастники.Количество() - 1 Цикл
		
		Если ИндексСтроки < ИндексТекущийСогласующий Тогда
			
			ТаблицаУчастники[ИндексСтроки].СтатусСогласования = НСтр("ru='Согласовал'");
			
		ИначеЕсли ИндексСтроки > ИндексТекущийСогласующий Тогда 
			
			ТаблицаУчастники[ИндексСтроки].СтатусСогласования = НСтр("ru='К согласованию'");
			
		КонецЕсли;
		
		ТаблицаУчастники[ИндексСтроки].ЕстьПравоУтвержденияВнеСогласования = Пользователи.РолиДоступны("УтверждениеЗаявокНаРасходДенегВОбходСогласования",
																									   ТаблицаУчастники[ИндексСтроки].Пользователь);
		
	КонецЦикла;
	
	УстановитьУсловноеОформление(ИндексТекущийСогласующий)
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьУсловноеОформление(ИндексТекущийСогласующий)
		
	УсловноеОформление.Элементы.Очистить();
        
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Использование = Истина;
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЗаголовокЧетвертогоУровня);
    
    ЭлементУсловия                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.УчастникиМаршрута.НомерСтроки");
    ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = ИндексТекущийСогласующий + 1;
    ЭлементУсловия.Использование  = Истина;
    
    ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("УчастникиМаршрута");
    
КонецПроцедуры

#КонецОбласти
