#Область СлужебныеПроцедурыИФункции

Процедура КонстантаИспользоватьОбменБизнесСетьПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ТорговыеПредложения") Тогда

		Если ВозможностиПриложения.КонстантаДоступнаВПриложении( "ИспользоватьПодсистемуТорговыеПредложения" ) Тогда
			Константы.ИспользоватьПодсистемуТорговыеПредложения.Установить(Источник.Значение);
		Иначе
			Константы.ИспользоватьПодсистемуТорговыеПредложения.Установить(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти