
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ДетализацияСтруктурыХранения = Параметры.ДетализацияСтруктурыХранения;
	
	УстановитьВидимостьЭлементовДляИнтерфейса85();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ДетализацияСтруктурыХранения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовДляИнтерфейса85()
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85();
	
	Элементы.ФормаОтмена.Видимость = Не ЭтоИнтерфейс85;
	
	ОформляемыеГруппыФормы = ОбщегоНазначенияИС.НоваяСтруктураОформляемыхГруппФормы();
	ОформляемыеГруппыФормы.Информация = "ГруппаОбщаяИнформация";
	
	ОбщегоНазначенияИС.УстановитьОформлениеГруппФормы(ЭтотОбъект, ОформляемыеГруппыФормы);
	
КонецПроцедуры

#КонецОбласти