#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ОчиститьСообщения();
	
	УчетнаяЗапись = Неопределено;
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Обработка.МаркетплейсOzon.Форма.СоставЗаказа" Тогда
		УчетнаяЗапись = ПараметрыВыполненияКоманды.Источник.УчетнаяЗапись;
	Иначе
		УчетнаяЗапись = ПараметрыВыполненияКоманды.Источник.Объект.Ссылка;
	КонецЕсли;
	
	Если ТипЗнч( УчетнаяЗапись ) <> Тип( "СправочникСсылка.УчетныеЗаписиМаркетплейсов") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не предусмотрена загрузка заказов из этого источника.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыЗадания.Вставить("Форма", ПараметрыВыполненияКоманды.Источник);
	
	ИнтеграцияСМаркетплейсомOzonКлиент.ЗапуститьЗагрузкуЗаказов(ПараметрыЗадания);

КонецПроцедуры

#КонецОбласти
