#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Если Не НачальноеЗаполнениеЭлементовВыполнено() Тогда
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = НСтр("ru='В работе'");
		Элемент.РеквизитДопУпорядочивания = 1;
		Элемент.Цвет = Новый ХранилищеЗначения(ЦветаПалитры.Оранжевый);
		
	КонецЕсли;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Завершен";
	Элемент.Наименование = НСтр("ru='Завершен'");
	Элемент.Цвет = Новый ХранилищеЗначения(ЦветаПалитры.Серый);
	Элемент.РеквизитДопУпорядочивания = 99999;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.УстановитьНовыйКод();
	
КонецПроцедуры

// Осветлить цвета и перенести в новый реквизит
// Версия 3.0.13
//
Процедура ОсветлитьЦветаПриОбновлении() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	СостоянияЗаказовНаПеремещение.Ссылка КАК Ссылка,
		|	СостоянияЗаказовНаПеремещение.Представление КАК Представление,
		|	СостоянияЗаказовНаПеремещение.Цвет КАК Цвет
		|ИЗ
		|	Справочник.СостоянияЗаказовНаПеремещение КАК СостоянияЗаказовНаПеремещение";
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			СостояниеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если СостояниеОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ЦветСостояния = СостояниеОбъект.Цвет.Получить();
			Если ТипЗнч(ЦветСостояния) <> Тип("Цвет") Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			НовыйЦвет = РаботаСЦветомСервер.ОсветленныйЦвет(ЦветСостояния.ПолучитьАбсолютный());
			НовыйЦвет = РаботаСЦветомСервер.ЯркийЦвет(НовыйЦвет);
			
			СостояниеОбъект.Заблокировать();
			СостояниеОбъект.Цвет = Новый ХранилищеЗначения(НовыйЦвет);
			СостояниеОбъект.УдалитьЦветСтарый = Новый ХранилищеЗначения(ЦветСостояния);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СостояниеОбъект);
			
			ЗафиксироватьТранзакцию();
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения = НСтр("ru='Не удалось обработать объект ""%1"" по причине:
			|%2'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Представление, ТекстОшибки);
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.СостоянияЗаказовНаПеремещение,
			Выборка.Ссылка,
			ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	ТекстСообщения = НСтр(
	"ru='Процедура ОсветлитьЦветаПриОбновлении успешно обработала объектов - %1, проблемных объектов - %2'",
	ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектовОбработано, ПроблемныхОбъектов);
	
	ЗаписьЖурналаРегистрации(
	ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.Справочники.СостоянияЗаказовНаПеремещение, ,
	ТекстСообщения);
	
КонецПроцедуры

// Вернуть старые оттенки цветов
// Версия 3.0.13
//
Процедура ВернутьСтарыеЦветаТекста() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	СостоянияЗаказовНаПеремещение.Ссылка КАК Ссылка,
		|	СостоянияЗаказовНаПеремещение.Представление КАК Представление
		|ИЗ
		|	Справочник.СостоянияЗаказовНаПеремещение КАК СостоянияЗаказовНаПеремещение";
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			СостояниеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если СостояниеОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ЦветСостояния = СостояниеОбъект.Цвет.Получить();
			ЦветСтарый = СостояниеОбъект.УдалитьЦветСтарый.Получить();
			Если ТипЗнч(ЦветСостояния) <> Тип("Цвет") Или ТипЗнч(ЦветСтарый) <> Тип("Цвет") Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			СостояниеОбъект.Заблокировать();
			СостояниеОбъект.Цвет = Новый ХранилищеЗначения(ЦветСтарый);
			СостояниеОбъект.УдалитьЦветСтарый = Новый ХранилищеЗначения(ЦветСостояния);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СостояниеОбъект);
			
			ЗафиксироватьТранзакцию();
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения = НСтр("ru='Не удалось обработать объект ""%1"" по причине:
			|%2'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Представление, ТекстОшибки);
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.СостоянияЗаказовНаПеремещение,
			Выборка.Ссылка,
			ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	ТекстСообщения = НСтр(
	"ru='Процедура ВернутьСтарыеЦветаТекста успешно обработала объектов - %1, проблемных объектов - %2'",
	ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектовОбработано, ПроблемныхОбъектов);
	
	ЗаписьЖурналаРегистрации(
	ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.Справочники.СостоянияЗаказовНаПеремещение, ,
	ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	КоличествоЭлементовБыстрогоВыбора = 15;
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 15
		|	СостоянияЗаказовНаПеремещение.Ссылка КАК Состояние,
		|	СостоянияЗаказовНаПеремещение.Наименование КАК Наименование,
		|	СостоянияЗаказовНаПеремещение.Цвет КАК Цвет,
		|	ВЫБОР
		|		КОГДА СостоянияЗаказовНаПеремещение.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовНаПеремещение.Завершен)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗавершенПоследним
		|ИЗ
		|	Справочник.СостоянияЗаказовНаПеремещение КАК СостоянияЗаказовНаПеремещение
		|ГДЕ
		|	СостоянияЗаказовНаПеремещение.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗавершенПоследним,
		|	СостоянияЗаказовНаПеремещение.РеквизитДопУпорядочивания";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "15", КоличествоЭлементовБыстрогоВыбора);
	Выборка = Запрос.Выполнить().Выбрать();
	НомерПоПорядку = 0;
	ЖирныйШрифт = Новый Шрифт(, , Истина);
	
	Пока Выборка.Следующий() Цикл
		
		НомерПоПорядку = НомерПоПорядку + 1;
		
		КомпонентыФС = Новый Массив;
		КомпонентыФС.Добавить(Строка(НомерПоПорядку) + ". ");
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(Выборка.Наименование,
			?(Выборка.Состояние = Справочники.СостоянияЗаказовНаПеремещение.Завершен, ЖирныйШрифт, Неопределено),));
			
		ДанныеВыбора.Добавить(Выборка.Состояние, Новый ФорматированнаяСтрока(КомпонентыФС));	// АПК:1356 Используются локализованные имена состояний
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НачальноеЗаполнениеЭлементовВыполнено()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияЗаказовНаПеремещение.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СостоянияЗаказовНаПеремещение КАК СостоянияЗаказовНаПеремещение
	|ГДЕ
	|	СостоянияЗаказовНаПеремещение.Предопределенный = ЛОЖЬ";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли