#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создаёт 2 чека коррекции: сторно и корректный чек
//
// Параметры:
//  Контекст - данные обработки Создание чеков коррекции 
// 
// Возвращаемое значение:
//   Структура - cодержит свойства:
//     * ЧекКоррекцииСторно - ОпределяемыйТип.ЧекКоррекцииРМК - чек коррекции сторно.
//     * ЧекКоррекции - ОпределяемыйТип.ЧекКоррекцииРМК - чек коррекции.
//
Функция СоздатьЧекиКоррекции(Контекст) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ЧекКоррекцииСторно");
	Результат.Вставить("ЧекСкорректированный");
	
	ТипКоррекцииКарантин = 2;
	ФормироватьЧекСторно = ЗначениеЗаполнено(Контекст.ДокументРасчетов)
							И Контекст.ТипКоррекции <> ТипКоррекцииКарантин; // Если попал в карантин "Самостоятельно, чек не принят ФНС" - сторно не делается.
	
	Если Не ЗначениеЗаполнено(Контекст.ЧекСторно) И ФормироватьЧекСторно Тогда
		РезультатЧекСторно = Неопределено;
		ОбщегоНазначенияРМКПереопределяемый.ЧекКоррекцииСторно(Контекст, РезультатЧекСторно);
		Если РезультатЧекСторно <> Неопределено Тогда
			Результат.ЧекКоррекцииСторно = РезультатЧекСторно;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Контекст.ЧекСкорректированный) Тогда
		РезультатЧек = Неопределено;
		ОбщегоНазначенияРМКПереопределяемый.ЧекКоррекции(Контекст, РезультатЧек);
		Если РезультатЧек <> Неопределено Тогда
			Результат.ЧекСкорректированный = РезультатЧек;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли