#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ЗначениеЗаполнено(КассаККМ)  Тогда
		
		ДанныеКассовойСмены = ОбщегоНазначенияРМК.ПолучитьДанныеКассовойСмены(, КассаККМ);
		
		Если НЕ ДанныеКассовойСмены.СменаОткрыта Тогда
			ТекстОшибки = НСтр("ru = 'Кассовая смена не открыта'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "КассаККМ",, Отказ);
		КонецЕсли;
		
		Если Не ОбщегоНазначенияРМК.ПроверитьТипПодключаемогоОборудованияКассыККМДляЧекаКоррекции(КассаККМ) Тогда
			ТекстОшибки = НСтр("ru = 'Тип оборудования выбранной Кассы ККМ не доступен для коррекции чеков.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "КассаККМ",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Оплата.Итог("Сумма") <> ПозицииЧека.Итог("СуммаСоСкидками") Тогда
		ТекстОшибки = НСтр("ru = 'Сумма оплат не совпадает с итоговой суммой по позициям чека.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "Оплата",, Отказ);
	КонецЕсли;
	
	Если РасчетВИнтернете Или ТипКассыККМОблачнаяККТ(КассаККМ) Тогда
		
		ТипОплатыНаличные = ОбщегоНазначенияРМК.ТипОплатыККТНаличные();
		Если ТипОплатыНаличные <> Неопределено Тогда
			ОтборНаличные = Новый Структура("ТипОплаты", ТипОплатыНаличные);
			Если Оплата.НайтиСтроки(ОтборНаличные).Количество() > 0 Тогда
				ОснованиеОшибки = ?(РасчетВИнтернете,
									НСтр("ru = 'При расчете в интернете'"),
									НСтр("ru = 'При работе с облачной кассой'"));
				ТекстОшибки = СтрШаблон(НСтр("ru = '%1 недопустимо указание наличных видов оплат.'"), ОснованиеОшибки);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "Оплата",, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПокупательEmail) И Не ЗначениеЗаполнено(ПокупательНомер) Тогда
			ОснованиеОшибки = ?(РасчетВИнтернете,
									НСтр("ru = 'При расчете в интернете'"),
									НСтр("ru = 'При работе с облачной кассой'"));
			ТекстОшибки = СтрШаблон(НСтр("ru = '%1 необходимо указание телефона или адреса электронной почты покупателя.'"), ОснованиеОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "ПокупательEmail",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НеприменениеККТ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДополнительныйРеквизит");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьНаОсновании(Отказ) Экспорт
	
	ФискальнаяОперация = НоваяСтруктураФискальнаяОперация();
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьДанныеФискальнойОперацииЧекаКоррекцииНаОсновании(
		ФискальнаяОперация,
		ЭтотОбъект.ДокументОснование);
	
	Если ФискальнаяОперация.ЕстьКорректирующийДокумент Тогда
		
		ШаблонОшибки = НСтр("ru = 'По данному документу ранее была создана корректировка документом %1.
									|Создание повторной корректировки невозможно.'");
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ФискальнаяОперация.ПредставлениеКорректирующегоДокумента);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФискальнаяОперация.ДокументРасчетов)
		И ЗначениеЗаполнено(ФискальнаяОперация.ДанныеXML) Тогда
		ЭтотОбъект.ДанныеXMLКорректируемогоЧека = ФискальнаяОперация.ДанныеXML.Получить();
	КонецЕсли;
	
	ЭтотОбъект.ДатаКоррекции               = ФискальнаяОперация.ДатаКоррекции;
	ЭтотОбъект.Организация                 = ФискальнаяОперация.Организация;
	ЭтотОбъект.СтруктурнаяЕдиница          = ФискальнаяОперация.СтруктурнаяЕдиница;
	ЭтотОбъект.ДокументРасчетов            = ФискальнаяОперация.ДокументРасчетов;
	ЭтотОбъект.ДополнительныйРеквизит      = ФискальнаяОперация.ФискальныйПризнак;
	
	ОбщиеПараметры = ФискальнаяОперация.ОбщиеПараметры;
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьОбщиеПараметрыЧекаКоррекцииПоДаннымФискальнойОперации(
		ОбщиеПараметры, ФискальнаяОперация);
	
	Если Не ЗначениеЗаполнено(ОбщиеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипКассыККМОблачнаяККТ(ОбщиеПараметры.КассаККМ)
		И Не ЗначениеЗаполнено(ФискальнаяОперация.ДокументРасчетов) Тогда
		
		ТекстОшибки = НСтр("ru = 'По данному документу не найдена фискальная операция.
									|Для чеков пробитых на облачной ККТ, наличие фискальной операции обязательно.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		Возврат;
		
	КонецЕсли;
	
	ЭтотОбъект.СистемаНалогообложения      = ОбщиеПараметры.СистемаНалогообложения;
	ЭтотОбъект.ТипРасчета                  = ОбщиеПараметры.ТипРасчета;
	ЭтотОбъект.КассаККМ                    = ОбщиеПараметры.КассаККМ;
	ЭтотОбъект.Кассир                      = ОбщиеПараметры.Кассир;
	ЭтотОбъект.КассирИНН                   = ОбщиеПараметры.КассирИНН;
	ЭтотОбъект.ПризнакАгента               = ОбщиеПараметры.ПризнакАгента;
	ЭтотОбъект.ЧасоваяЗона                 = ОбщиеПараметры.ЧасоваяЗона;
	
	Если ЗначениеЗаполнено(ФискальнаяОперация.ДокументРасчетов) Тогда
		ЭтотОбъект.СНОКорректируемогоДокумента = ОбщиеПараметры.СистемаНалогообложения;
	КонецЕсли;
	
	Если ОбщиеПараметры.Интернет Тогда
		ЭтотОбъект.РасчетВИнтернете = Истина;
		ЭтотОбъект.АдресСайта = ОбщиеПараметры.МестоРасчетов;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбщиеПараметры.ПокупательEmail) Тогда
		ЭтотОбъект.ПокупательEmail = ОбщиеПараметры.ПокупательEmail;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбщиеПараметры.ПокупательНомер) Тогда
		ЭтотОбъект.ПокупательНомер = СтрЗаменить(ОбщиеПараметры.ПокупательНомер, "+7", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбщиеПараметры.Получатель) Тогда
		ЭтотОбъект.Контрагент = ОбщиеПараметры.Получатель;
	Иначе
		ЭтотОбъект.Контрагент = ОбщиеПараметры.СведенияОПокупателе.Покупатель;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбщиеПараметры.ПолучательИНН) Тогда
		ЭтотОбъект.КонтрагентИНН = ОбщиеПараметры.ПолучательИНН;
	Иначе
		ЭтотОбъект.КонтрагентИНН = ОбщиеПараметры.СведенияОПокупателе.ПокупательИНН;
	КонецЕсли;
	
	// Позиции чека
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьПозицииЧекаКоррекцииНаОсновании(ФискальнаяОперация.ДокументОснование, ОбщиеПараметры, ЭтотОбъект.ПозицииЧека);
	
	// Оплаты
	Для Каждого СтрокаОплаты Из ОбщиеПараметры.ТаблицаОплат Цикл
		
		НоваяСтрока = ЭтотОбъект.Оплата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплаты);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяСтруктураФискальнаяОперация()
	
	ФискальнаяОперация = Новый Структура;
	ФискальнаяОперация.Вставить("ДатаКоррекции");     // Дата корректируемого расчета.
	ФискальнаяОперация.Вставить("ДокументОснование"); // Документ на основании которого заполняется обработка.
	ФискальнаяОперация.Вставить("ДокументРасчетов");  // Документ основание фискальной операции, в случае отсутствия фискальной операции, должен быть пустым.
	ФискальнаяОперация.Вставить("ФискальныйПризнак");
	ФискальнаяОперация.Вставить("Организация");
	ФискальнаяОперация.Вставить("СтруктурнаяЕдиница");
	ФискальнаяОперация.Вставить("ТипРасчета");
	ФискальнаяОперация.Вставить("ДанныеXML");
	ФискальнаяОперация.Вставить("ОбщиеПараметры");
	ФискальнаяОперация.Вставить("ЕстьКорректирующийДокумент", Ложь);
	ФискальнаяОперация.Вставить("ПредставлениеКорректирующегоДокумента");
	
	Возврат ФискальнаяОперация;
	
КонецФункции

Функция ТипКассыККМОблачнаяККТ(Знач КассаККМ)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		ПодключаемоеОборудование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КассаККМ, "ПодключаемоеОборудование");
		ОбщегоНазначенияРМКПереопределяемый.ПодключаемоеОборудованиеОблачнаяККТ(Результат, ПодключаемоеОборудование);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли