
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДоступныхАбонентов();
	ПрочитатьНастройкиСвязей();
	
	НастроитьВидимостьЭлементов();
	
	Настройки = ОплатаСервисаУНФ.НастройкиОплатыСервиса();
	
	ГруппаНоменклатурыТарифовСервиса = Настройки.ГруппаНоменклатурыТарифовСервиса;
	ОформляемыйДокумент = Настройки.ОформляемыйДокумент;
	ВидЗаказа = Настройки.ВидЗаказа;
	СостояниеЗаказа = Настройки.СостояниеЗаказа;

	Элементы.ГруппаНастройкиЗаказа.Доступность = (ОформляемыйДокумент = "ЗаказПокупателя");
	ЗаполнитьКомандыПечати();
	ОтправляемаяПечатнаяФорма = Настройки.ОтправляемаяПечатнаяФорма;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;

	ПроверитьЗаполнениеПередСохранением(Отказ);
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиСвязей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьОплатуСервисаПриИзменении(Элемент)
	
	ПриИзмененииРеквизита(Элемент);
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаНоменклатурыТарифовСервисаПриИзменении(Элемент)
	
	СохранитьНастройкиОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОформляемыйДокументЗаказПриИзменении(Элемент)
	
	ПриИзмененииОформляемогоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаПриИзменении(Элемент)
	
	СохранитьНастройкиОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаказаПриИзменении(Элемент)
	
	СохранитьНастройкиОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОформляемыйДокументСчетПриИзменении(Элемент)
	
	ПриИзмененииОформляемогоДокумента();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтправляемаяПечатнаяФормаПриИзменении(Элемент)

	СохранитьНастройкиОплаты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкиОплатыСервиса(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму(
		"Обработка.ПанельАдминистрированияБТС.Форма.НастройкиОплатыСервиса", ПараметрыФормы, ЭтотОбъект, , , , ,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТарифыСервиса(Команда)
	
	ДлительнаяОперация = НачатьЗагрузкуТарифовСервиса();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииЗагрузкиТарифов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимостьЭлементов()
	
	Элементы.НастройкиОплатыСервиса.Видимость = НаборКонстант.ИспользоватьОплатуСервиса;
	Элементы.ГруппаАвтоматическоеВыставлениеСчетов.Видимость = НаборКонстант.ИспользоватьОплатуСервиса;
	Элементы.ГруппаНастройкиЗагрузкиТарифов.Видимость = НаборКонстант.ИспользоватьОплатуСервиса;
	Элементы.ГруппаПодготовкаСчетаНаОплату.Видимость = НаборКонстант.ИспользоватьОплатуСервиса;
	
	МассивОрганизации = Новый Массив;
	Для Каждого Строка Из СвязьКодаАбонентаСправочникОрганизации Цикл
		Если МассивОрганизации.Найти(Строка.Организация) = Неопределено Тогда
			МассивОрганизации.Добавить(Строка.Организация);		
		КонецЕсли;	
	КонецЦикла;
	
	СообщениеОбОшибках = "";
	Для Каждого Организация Из МассивОрганизации Цикл
	 	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ИНН, ПодписьРуководителя");	
		ОшибкаИНН = Ложь;
		ОшибкаПодпись = Ложь;
		Если РеквизитыОрганизации.ИНН = "" Тогда
			ОшибкаИНН = Истина;		
		КонецЕсли;             
		Если Не ЗначениеЗаполнено(РеквизитыОрганизации.ПодписьРуководителя) Тогда
			ОшибкаПодпись = Истина;		
		КонецЕсли;             
		
		Если ОшибкаИНН = Истина И ОшибкаПодпись = Истина Тогда
			СообщениеОбОшибках = СообщениеОбОшибках + НСтр("ru = 'У организации '") + Организация 
				+ НСтр("ru = ' не заполнены ИНН и подпись руководителя. Возможны ошибки при обмене документами.'") + Символы.ПС;	
		ИначеЕсли ОшибкаИНН = Истина Тогда
			СообщениеОбОшибках = СообщениеОбОшибках + НСтр("ru = 'У организации '") 
				+ Организация + НСтр("ru = ' не заполнен ИНН. Возможны ошибки при обмене документами.'") + Символы.ПС;	
		ИначеЕсли ОшибкаПодпись = Истина Тогда
			СообщениеОбОшибках = СообщениеОбОшибках + НСтр("ru = 'У организации '") 
				+ Организация + НСтр("ru = ' не заполнена подпись руководителя. Возможны ошибки при обмене документами.'") + Символы.ПС;	
		КонецЕсли;
	КонецЦикла;
	
	Если СообщениеОбОшибках <> "" Тогда
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		ПараметрыСообщения.ТипСообщения = "Ошибка";
		ПараметрыСообщения.Скрываемый = Ложь;
		ПараметрыСообщения.Родитель = "ГруппаСообщения";  
		ПараметрыСообщения.Сообщение = СообщениеОбОшибках;
		ПараметрыСообщения.Идентификатор = "СообщениеОбОшибкахНастройки";
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
		ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьЗагрузкуТарифовСервиса()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "ОплатаСервиса.ЗагрузитьТарифыСервиса");
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииЗагрузкиТарифов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Загрузка выполнена'"), , 
		НСтр("ru = 'Загрузка тарифов сервиса выполнена.'"), БиблиотекаКартинок.Информация);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОплаты()
	
	Настройки = ОплатаСервисаУНФ.НастройкиОплатыСервиса();
	Настройки.ГруппаНоменклатурыТарифовСервиса = ГруппаНоменклатурыТарифовСервиса; 
	Настройки.ОтправляемаяПечатнаяФорма = ОтправляемаяПечатнаяФорма;
	Настройки.ОформляемыйДокумент = ОформляемыйДокумент;
	Настройки.ВидЗаказа = ВидЗаказа;
	Настройки.СостояниеЗаказа = СостояниеЗаказа;
	
	ОплатаСервисаУНФ.СохранитьНастройкиОплатыСервиса(Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизита(Элемент)
	
	ИменаКонстант = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	ОбновитьПовторноИспользуемыеЗначения();
	
	Для Каждого ИмяКонстанты Из ИменаКонстант Цикл
		Если ИмяКонстанты <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, ИмяКонстанты);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	ИменаКонстант = Новый Массив;
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	НачатьТранзакцию();

	Попытка
		ИмяКонстанты = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
		ИменаКонстант.Добавить(ИмяКонстанты);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	НастроитьВидимостьЭлементов();
	
	Возврат ИменаКонстант;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	ЧастиИмени = СтрРазделить(РеквизитПутьКДанным, ".");
	Если ЧастиИмени.Количество() <> 2 Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяКонстанты = ЧастиИмени[1];
	КонстантаМенеджер = Константы[ИмяКонстанты];
	КонстантаЗначение = НаборКонстант[ИмяКонстанты];
	ТекущееЗначение  = КонстантаМенеджер.Получить();
	Если ТекущееЗначение <> КонстантаЗначение Тогда
		Попытка
			КонстантаМенеджер.Установить(КонстантаЗначение);
		Исключение
			НаборКонстант[ИмяКонстанты] = ТекущееЗначение;
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
	Возврат ИмяКонстанты;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииОформляемогоДокумента()
	
	Элементы.ГруппаНастройкиЗаказа.Доступность = (ОформляемыйДокумент = "ЗаказПокупателя");
	ЗаполнитьКомандыПечати();
	СохранитьНастройкиОплаты();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомандыПечати()
	
	СписокВыбораФормы = Элементы.ОтправляемаяПечатнаяФорма.СписокВыбора;
	ИмяФормыСписка = СтрШаблон("Документ.%1.Форма.ФормаСписка", ОформляемыйДокумент);
	КомандыПечатиЗаказа = УправлениеПечатью.КомандыПечатиФормы(ИмяФормыСписка);
	
	СписокВыбораФормы.Очистить();
	Для Каждого Строка Из КомандыПечатиЗаказа Цикл 
		
		// Нужно исключить из списка формы офисных документов. 
		Если Строка.Идентификатор = "Конверт"
			Или СтрНайти(Строка.Идентификатор, "ПечатьПоШаблонуОфисногоДокумента") = 1 Тогда
			Продолжить;
		КонецЕсли;
		СписокВыбораФормы.Добавить(Строка.Идентификатор, Строка.Представление,, Строка.Картинка);
	КонецЦикла;
		
	Если СписокВыбораФормы.НайтиПоЗначению(ОтправляемаяПечатнаяФорма) = Неопределено Тогда
		ОтправляемаяПечатнаяФорма = Неопределено;
		Если СписокВыбораФормы.Количество() > 0 Тогда
			ОтправляемаяПечатнаяФорма = Элементы.ОтправляемаяПечатнаяФорма.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныхАбонентов()
	
	ДоступныеАбоненты = ПрограммныйИнтерфейсСервиса.Абоненты();
	Для каждого Абонент Из ДоступныеАбоненты Цикл
		НоваяСтрока = СвязьКодаАбонентаСправочникОрганизации.Добавить();
		НоваяСтрока.КодАбонента = Абонент.Код;
		НоваяСтрока.ПредставлениеАбонента = Абонент.Наименование;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиСвязей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьАбонентСервисаОрганизация.КодАбонента КАК КодАбонента,
	|	СвязьАбонентСервисаОрганизация.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.СвязьАбонентСервисаОрганизация КАК СвязьАбонентСервисаОрганизация";
	СвязьОрганизацияАбонент = Запрос.Выполнить().Выбрать();
	Пока СвязьОрганизацияАбонент.Следующий() Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("КодАбонента", СвязьОрганизацияАбонент.КодАбонента);
		Строки = СвязьКодаАбонентаСправочникОрганизации.НайтиСтроки(ПараметрыОтбора);
		Для каждого Строка Из Строки Цикл
			Строка.Организация = СвязьОрганизацияАбонент.Организация;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСвязей()
	
	СвязьОрганизацияАбонент = РегистрыСведений.СвязьАбонентСервисаОрганизация.СоздатьНаборЗаписей();
	Для каждого Связь Из СвязьКодаАбонентаСправочникОрганизации Цикл
		Если ЗначениеЗаполнено(Связь.Организация) Тогда
			НоваяСтрока = СвязьОрганизацияАбонент.Добавить();
			НоваяСтрока.КодАбонента = Связь.КодАбонента;
			НоваяСтрока.Организация = Связь.Организация;
		КонецЕсли;
	КонецЦикла;
	СвязьОрганизацияАбонент.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПередСохранением(Отказ) 
	
	Если ОформляемыйДокумент = "ЗаказПокупателя" И Не ЗначениеЗаполнено(СостояниеЗаказа) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не указано состояние заказа для оформляемого документа'"));
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
