#Область СлужебныйПрограммныйИнтерфейс

// Получает данные для печати и открывает форму обработки печати этикеток и ценников.
//
// Параметры:
//  ОбъектыПечати        - Структура        - структура с описанием штрихкода.
//  Форма                - ФормаКлиентскогоПриложения - форма-владелец из которой выполняется печать
//  СтандартнаяОбработка - Булево           - признак что требуется печатать из вызывающей функции
Процедура ПечатьШтрихкодовУпаковок(ОбъектыПечати, Форма, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеДляПечати = ИнтеграцияИСМПУНФВызовСервера.ДанныеДляПечатиШтрихкодовУпаковок(ОбъектыПечати);
	
	ОткрытьФорму(
		"Справочник.ХранилищеШаблонов.Форма.ФормаШтрихкодыЭтикетокИСМП",
		Новый Структура("АдресВХранилище, ИмяМакета", ДанныеДляПечати, "ЭтикеткаШтрихкодыУпаковки"),
		Форма,
		Новый УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
