////////////////////////////////////////////////////////////////////////////////
// Подсистема "Индивидуальный предприниматель"
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает дату начала действия прогрессивной шкалы НДФЛ
//
// Возвращаемое значение:
//   Дата
//
Функция ДатаНачалаПрогрессивнойШкалы() Экспорт
	
	Возврат Дата(2021, 1, 1);
	
КонецФункции

// Возвращает дату начала действия прогрессивной шкалы НДФЛ
//
// Возвращаемое значение:
//   Дата
//
Функция ДатаНачалаПрогрессивнойШкалы2025() Экспорт
	
	Возврат Дата(2025, 1, 1);
	
КонецФункции

// Возвращает сумму налоговой базы налогоплательщика для применения повышенной ставки НДФЛ
//
// Возвращаемое значение:
//   Число
//
Функция ГраницаНалоговойБазыДляПримененияПовышеннойСтавки() Экспорт
	
	Возврат 5000000; // п. 1 ст. 224 НК РФ
	
КонецФункции

// Возвращает сумму налоговой базы налогоплательщика для применения повышенной ставки НДФЛ
//
// Возвращаемое значение:
//   Структура:
//    * Предел1 - Число - первый предел доходов
//    * Предел2 - Число - первый предел доходов
//    * Предел3 - Число - первый предел доходов
//    * Предел4 - Число - первый предел доходов
//
Функция ГраницыНалоговойБазыДляПримененияПовышеннойСтавки(Период = Неопределено) Экспорт
	
	ГраницыБазы = Новый Структура;
	ГраницыБазы.Вставить("Предел1", 0);
	ГраницыБазы.Вставить("Предел2", 0);
	ГраницыБазы.Вставить("Предел3", 0);
	ГраницыБазы.Вставить("Предел4", 0);

	Если ЗначениеЗаполнено(Период) И Период >= ДатаНачалаПрогрессивнойШкалы() Тогда
		ГраницыБазы.Предел1 = 5000000;
	КонецЕсли;
	
	Если Период = Неопределено ИЛИ Период >= ДатаНачалаПрогрессивнойШкалы2025() Тогда
		ГраницыБазы.Предел1 = 2400000;
		ГраницыБазы.Предел2 = 5000000;
		ГраницыБазы.Предел3 = 20000000;
		ГраницыБазы.Предел4 = 50000000;
	КонецЕсли;
		
	Возврат ГраницыБазы;
	
КонецФункции

// Возвращает ставки налога НДФЛ, указанные в НК РФ
//
// Параметры:
//   Период - Дата - Дата, для которой определяются ставки налога
//
// Возвращаемое значение:
//   Структура - ставки налогов:
//    * СтавкаНДФЛ           - Число - абзац 2 п. 1 ст. 224 НК РФ
//    * СтавкаНДФЛПовышенная1 - Неопределено, Число - абзац 3 п. 1 ст. 224 НК РФ
//    * СтавкаНДФЛПовышенная2 - Неопределено, Число - абзац 4 п. 1 ст. 224 НК РФ
//    * СтавкаНДФЛПовышенная3 - Неопределено, Число - абзац 5 п. 1 ст. 224 НК РФ
//    * СтавкаНДФЛПовышенная4 - Неопределено, Число - абзац 6 п. 1 ст. 224 НК РФ
//
Функция НалоговыеСтавкиПоУмолчанию(Период = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СтавкаНДФЛ", 13);
	Результат.Вставить("СтавкаНДФЛПовышенная1", Неопределено);
	Результат.Вставить("СтавкаНДФЛПовышенная2", Неопределено);
	Результат.Вставить("СтавкаНДФЛПовышенная3", Неопределено);
	Результат.Вставить("СтавкаНДФЛПовышенная4", Неопределено);
	
	Если Период = Неопределено ИЛИ Период >= ДатаНачалаПрогрессивнойШкалы() Тогда
		Результат.СтавкаНДФЛПовышенная1 = 15;
	КонецЕсли;
		
	Если Период = Неопределено ИЛИ Период >= ДатаНачалаПрогрессивнойШкалы2025() Тогда
		Результат.СтавкаНДФЛПовышенная2 = 18;
		Результат.СтавкаНДФЛПовышенная3 = 20;
		Результат.СтавкаНДФЛПовышенная4 = 22;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает сумму налога на доходы физических лиц
//
// Параметры:
//   НалоговаяБаза - Число - сумма налоговой базы
//   Период        - Дата - Дата, для которой рассчитывается сумма налога
//
// Возвращаемое значение:
//   Число
//
Функция СуммаНалога(НалоговаяБаза, Период = Неопределено) Экспорт
	
	НалоговыеСтавки = НалоговыеСтавкиПоУмолчанию(Период);
	ПредельнаяСуммаНалоговойБазы = ГраницаНалоговойБазыДляПримененияПовышеннойСтавки();
	
	НалоговаяБазаСвышеПредела = НалоговаяБаза - ПредельнаяСуммаНалоговойБазы;
	
	Если НалоговыеСтавки.СтавкаНДФЛПовышенная1 <> Неопределено И НалоговаяБазаСвышеПредела > 0 Тогда
		
		Результат = ПредельнаяСуммаНалоговойБазы * НалоговыеСтавки.СтавкаНДФЛ / 100
			+ НалоговаяБазаСвышеПредела * НалоговыеСтавки.СтавкаНДФЛПовышенная1 / 100;
	Иначе
		Результат = НалоговаяБаза * НалоговыеСтавки.СтавкаНДФЛ / 100;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
