
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

// Добавляет записи с адресами подключения в РегистрСведений.НастройкиПодключенияКРаспределенномуРееструМЧД
//
// Параметры:
// Параметры - Структура - параметры обработчика обновления.
//                          См. документацию по подсистеме СтандартныеПодсистемы.ОбновлениеВерсииИБ.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбработкаЗавершена = Ложь;
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.НастройкиПодключенияКРаспределенномуРееструМЧД;
	
	НачатьТранзакцию();
	
	Попытка
		
		ДвоичныеДанные = ПолучитьМакет("НастройкиПодключенияРРМЧД");
		НастройкиПодключения = ОбщегоНазначенияБЭД.JSONЗначение(ДвоичныеДанные);
		
		ОбновитьНастройки(НастройкиПодключения); 
		
		ОбработкаЗавершена = Истина;
		
		ЗафиксироватьТранзакцию();
			
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения =
			НСтр("ru = 'Не удалось обработать регистр сведений ""Настройки подключения к распределенному реестру МЧД"" по причине:'")
			+ Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение, МетаданныеОбъекта,, ТекстСообщения);
		
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьНастройки(НастройкиПодключения) Экспорт 
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		НаборЗаписей = СоздатьНаборЗаписей();
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(НаборЗаписей);
		
		Для каждого Элемент Из НастройкиПодключения.ДоступныеАдресаДляПодключения Цикл
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		КонецЦикла;
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВидОперации = НСтр("ru = 'Обновление настроек подключения к распределенному реестру МЧД'");
		ЭлектронноеВзаимодействие.ОбработатьОшибку(ВидОперации, ТекстОшибки);
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновляет дату ошибки подключения при недоступности сервера распределенного реестра МЧД
// 
// Параметры:
//  НастройкиПодключения - см. МашиночитаемыеДоверенности.НовыйНастройкиПодключенияКСерверуМЧД
// 
// Возвращаемое значение:
//  Булево
Функция ОбновитьДатуВремяОшибкиПодключения(НастройкиПодключения) Экспорт
	
	Успех = Ложь;
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Адрес.Установить(НастройкиПодключения.АдресСервера);
		НаборЗаписей.Отбор.Ресурс.Установить(НастройкиПодключения.РесурсКорняAPI);
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(НаборЗаписей);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда 
			Данные = НаборЗаписей[0];
			Данные.ДатаВремяОшибкиПодключения = УниверсальноеВремя(НастройкиПодключения.ДатаВремяОшибкиПодключения);
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
		Успех = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВидОперации = НСтр("ru = 'Обновление даты и времени ошибки подключения к распределенному реестру МЧД в настройках подключения.'");
		ЭлектронноеВзаимодействие.ОбработатьОшибку(ВидОперации, ТекстОшибки);
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Успех;
	
КонецФункции

#КонецОбласти

#КонецЕсли
