
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдаптацияФормыТакси();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущаяСтрокаДоступна = Элементы.Список.ТекущаяСтрока <> Неопределено;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗагрузкаВнешнихДанных",
		"Доступность", ТекущаяСтрокаДоступна);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ИнтерфейсТакси = НЕ ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	Элементы.Переместить(Элементы.ЗагрузкаВнешнихДанных, Элементы.Список.КоманднаяПанель);
	
КонецПроцедуры

#КонецОбласти
