#Область ОписаниеПеременных

#Область ПеременныеФормы

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;	// Параметры опроса завершения фонового задания. См. общий модуль ДлительныеОперацииКлиент

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Инициализация();
	ЗагрузитьНастройкиПериоды();
	ЗагрузитьНастройки();
	ЗагрузитьНастройкиВиджетов();
	СоздатьЭлементыПоказатели();
	СоздатьЭлементыДиаграммы();
	
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	
	// Признак размещения формы. Если Ложь (значение по умолчанию) то форма открыта средствами платформы на начальной странице.
	Параметры.Свойство("ОткрытаНеНаНачальнойСтранице", ОткрытаНеНаНачальнойСтранице);
	
	Если ОткрытаНеНаНачальнойСтранице ИЛИ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Заголовок = НСтр("ru = 'Пульс бизнеса'");
		ОтображатьНовости = Ложь;
		ОтображатьТекущиеДела = Ложь;
		Элементы.ГруппаВиджеты.Видимость = Ложь;
	Иначе
		НовостиПриСозданииНаСервере();
		ОбновитьТаблицуТекущихДел();
		УстановитьУсловноеОформлениеТекущихДел();
	КонецЕсли;
	
	АдресНастроекПоказателей = ПоместитьВоВременноеХранилище(НастройкиПоказателей.Выгрузить(), УникальныйИдентификатор);
	АдресНастроекДиаграмм = ПоместитьВоВременноеХранилище(НастройкиДиаграмм.Выгрузить(), УникальныйИдентификатор);
	
	АдаптацияТакси();
	РезультатФоновогоЗадания = ЗапуститьФоновоеЗаданиеНаСервере();
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ГруппаПоказатели.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОбновитьИнтерфейс Тогда
		ПодключитьОбработчикОжидания("ОбновлениеИнтерфейсаСЗадержкой", 0.1, Истина);
		Возврат;
	КонецЕсли; 
	
	НовостиПриОткрытии();
	
	НачатьОжиданиеФоновогоЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если НЕ ТипЗнч(ВыбранноеЗначение)=Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение.Событие="НастройкаПоказателя" Тогда
		
		Если ВыбранноеЗначение.Свойство("ИдентификаторСтроки") Тогда
			Стр = ДобавленныеПоказатели.НайтиПоИдентификатору(ВыбранноеЗначение.ИдентификаторСтроки);
		Иначе
			Стр = ДобавленныеПоказатели.Добавить();
		КонецЕсли; 
		ЗаполнитьЗначенияСвойств(Стр, ВыбранноеЗначение);
		
		// Связь по идентификатору с таблицей вариантов показателей
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Показатель", ВыбранноеЗначение.Показатель);
		СтруктураОтбора.Вставить("Ресурс", ВыбранноеЗначение.Ресурс);
		Строки = НастройкиПоказателей.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество()>0 Тогда
			Стр.ИдентификаторСтрокиНастроек = Строки[0].ПолучитьИдентификатор();
			Стр.Остаток = Строки[0].Остаток;
		КонецЕсли;
		Стр.Налоги = Стр.Показатель = "Налоги";
		
		Элементы.СтраницыДанныеОжидание.ТекущаяСтраница = Элементы.СтраницаОжидание;
		СохранитьНастройкуПоказателяСервер();
		ЗапуститьФоновоеЗадание();
		
	ИначеЕсли ВыбранноеЗначение.Событие="НастройкаДиаграммы" Тогда
		
		// Связь по идентификатору с таблицей вариантов показателей
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Диаграмма", ВыбранноеЗначение.Диаграмма);
		Строки = НастройкиДиаграмм.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		СтрНастроек = Строки[0];
		ОписаниеСерий = СтрНастроек.Серии[ВыбранноеЗначение.Серия];
		ОписаниеТочек = СтрНастроек.Точки[ВыбранноеЗначение.Точка];
		
		Если ВыбранноеЗначение.Свойство("ИдентификаторСтроки") Тогда
			Стр = ДобавленныеДиаграммы.НайтиПоИдентификатору(ВыбранноеЗначение.ИдентификаторСтроки);
		Иначе
			Стр = ДобавленныеДиаграммы.Добавить(); 
		КонецЕсли; 
		ЗаполнитьЗначенияСвойств(Стр, ВыбранноеЗначение);
		
		Стр.ИдентификаторСтрокиНастроек = СтрНастроек.ПолучитьИдентификатор();
		Стр.ПредставленияТочек = ОписаниеТочек.Представления;
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение.ПериодСравнения) И НЕ ВыбранноеЗначение.РежимОстатка Тогда
			МассивПредставлений = Новый Массив;
			МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(ВыбранноеЗначение.Период));
			МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(ВыбранноеЗначение.ПериодСравнения, ВыбранноеЗначение.Период));
			Стр.ПредставленияСерий = Новый ФиксированныйМассив(МассивПредставлений);
		ИначеЕсли ЗначениеЗаполнено(ВыбранноеЗначение.ПериодСравнения) И ВыбранноеЗначение.РежимОстатка Тогда
			МассивПредставлений = Новый Массив;
			МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(ВыбранноеЗначение.Период));
			МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(ВыбранноеЗначение.ПериодСравнения, ВыбранноеЗначение.Период));
			Стр.ПредставленияСерий = Новый ФиксированныйМассив(МассивПредставлений);
		Иначе
			Стр.ПредставленияСерий = ОписаниеСерий.Представления;
		КонецЕсли; 
		
		Элементы.СтраницыДанныеОжидание.ТекущаяСтраница = Элементы.СтраницаОжидание;
		СохранитьНастройкуДиаграммыСервер();
		ЗапуститьФоновоеЗадание();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВводОстатков" Тогда
		ОбновитьФорму();
		ЗапуститьФоновоеЗадание();
	ИначеЕсли ИмяСобытия = "ЗакрытиеМесяца" Тогда 
		ОбновитьФорму();
		ЗапуститьФоновоеЗадание();
	КонецЕсли;
	
	НовостиОбработкаОповещения(ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КнопкаПоказатьТекущиеДелаНажатие(Элемент)
	ОтображатьТекущиеДела = Не ОтображатьТекущиеДела;
	ОбновитьОтображениеТекущихДел();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСкрытьТекущиеДелаНажатие(Элемент)
	ОтображатьТекущиеДела = Не ОтображатьТекущиеДела;
	ОбновитьОтображениеТекущихДел();
КонецПроцедуры

&НаКлиенте
Процедура ПериодСравненияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ДатаСравнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Направление = 1 Тогда
		ДатаСравнения = СледующаяДата(ДатаСравнения, ТипДатыСравнения);
	Иначе
		ДатаСравнения = ПредыдущаяДата(ДатаСравнения, ТипДатыСравнения);
	КонецЕсли;
	
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОстатки());
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатакиИспользоватьСравнениеПриИзменении(Элемент)
	
	Если ДатаСравнения = Неопределено Тогда
		ДатаСравнения = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтойНедели);
	Иначе
		ДатаСравнения = Неопределено;
	КонецЕсли;
	
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОстатки(), "ДатаСравнения");
	
КонецПроцедуры

&НаКлиенте
Процедура ОборотыИспользоватьСравнениеПриИзменении(Элемент)
	
	Если ПериодСравнения = Неопределено Тогда
		ПериодСравнения = ПериодСравненияПоПериоду(Период);
		ТипПериодаСравнения = ТипПериода(ПериодСравнения);
	Иначе
		ПериодСравнения = Неопределено;
		ТипПериодаСравнения = "";
	КонецЕсли;
	
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОбороты(), "ПериодСравнения");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПредставлениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Направление = 1 Тогда
		Период = СледующийПериод(Период, ТипПериода);
	Иначе
		Период = ПредыдущийПериод(Период, ТипПериода);
	КонецЕсли;
	
	Если ПериодСравнения <> Неопределено Тогда
		ПериодСравнения = ПериодСравненияПоПериоду(Период);
		ТипПериодаСравнения = ТипПериода(ПериодСравнения);
	КонецЕсли; 
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОбороты());
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭлементСписка = Элементы.ПериодПредставление.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	Если ЭлементСписка <> Неопределено Тогда
		ПериодПредставление = ЭлементСписка.Представление;
		ПериодВыборЗавершение(ЭлементСписка, ДополнительныеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСравненияПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭлементСписка = Элементы.ПериодСравненияПредставление.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	Если ЭлементСписка <> Неопределено Тогда
		ПериодСравненияПредставление = ЭлементСписка.Представление;
		ПериодСравненияВыборЗавершение(ЭлементСписка, ДополнительныеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСравненияПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭлементСписка = Элементы.ДатаСравненияПредставление.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	Если ЭлементСписка <> Неопределено Тогда
		ДатаСравненияПредставление = ЭлементСписка.Представление;
		ДатаСравненияВыборЗавершение(ЭлементСписка, ДополнительныеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСравненияПредставлениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПериодСравнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Направление = 1 Тогда
		ПериодСравнения = СледующийПериод(ПериодСравнения, ТипПериодаСравнения);
	Иначе
		ПериодСравнения = ПредыдущийПериод(ПериодСравнения, ТипПериодаСравнения);
	КонецЕсли;
	
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОбороты());
	
КонецПроцедуры

&НаКлиенте
Процедура Новость1Нажатие(Элемент)
	ПриНажатииНаПереключательНовости(0);
КонецПроцедуры

&НаКлиенте
Процедура Новость2Нажатие(Элемент)
	ПриНажатииНаПереключательНовости(1);
КонецПроцедуры

&НаКлиенте
Процедура Новость3Нажатие(Элемент)
	ПриНажатииНаПереключательНовости(2);
КонецПроцедуры

&НаКлиенте
Процедура Новость4Нажатие(Элемент)
	ПриНажатииНаПереключательНовости(3);
КонецПроцедуры

&НаКлиенте
Процедура Новость5Нажатие(Элемент)
	ПриНажатииНаПереключательНовости(4);
КонецПроцедуры

&НаКлиенте
Процедура Новость6Нажатие(Элемент)
	ПриНажатииНаПереключательНовости(5);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДобавитьДиаграммуНажатие(Элемент)
	
	ОткрытьФормуДобавленияДиаграммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексТекущейНовостиПриИзменении(Элемент)
	
	// Если пользователь явно нажал на кнопку выбора новости, то остановить автолистание.
	// Оно автоматически включится после обновления списка новостей.
	// Отключить автолистание.
	ОтключитьОбработчикОжидания("Подключаемый_ВыполнитьАвтолистание");
	
	// Вывести текст текущей новости.
	ТекстТекущейНовостиХТМЛ = Новости.Получить(ИндексТекущейНовости).ТекстНовостиХТМЛ;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстТекущейНовостиХТМЛПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если Новости.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ДанныеСобытия.Href, "UNF_BannerNewsInformCenter") <> 0 Тогда
		ОткрытьФорму("Обработка.ИнформационныйЦентр.Форма.ИнформационныйЦентр");
		Возврат;
	КонецЕсли;

	ТекущаяНовость = Новости[ИндексТекущейНовости].Ссылка;

	Если Не ЗначениеЗаполнено(ТекущаяНовость) Тогда
		Возврат;
	КонецЕсли;

	ОткрытьФорму("Справочник.Новости.Форма.ФормаНовости", Новый Структура("Ключ", ТекущаяНовость));

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПоказательЗначениеНажатие(Элемент)
	
	КонтекстРасшифроватьПоказатель(Элемент);
	//@skip-check module-unused-local-variable
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДиаграммаВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	
	ИмяГруппы = Лев(Элемент.Имя, СтрНайти(Элемент.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	РасшифроватьДиаграмму(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПеремещениеСписокНажатие(Элемент)
	
	СписокДействий = Новый СписокЗначений;
	СписокДействий.Добавить("Вверх", НСтр("ru = 'Переместить вверх'"),, БиблиотекаКартинок.ПереместитьВверх);
	СписокДействий.Добавить("Вниз", НСтр("ru = 'Переместить вниз'"),, БиблиотекаКартинок.ПереместитьВниз);
	СписокДействий.Добавить("Влево", НСтр("ru = 'Переместить влево'"),, БиблиотекаКартинок.ПереместитьВлево);
	СписокДействий.Добавить("Вправо", НСтр("ru = 'Переместить вправо'"),, БиблиотекаКартинок.ПереместитьВправо);
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ВыборПеремещенияПоказателя", ЭтотОбъект, Элемент);
	ПоказатьВыборИзМеню(Оповещение, СписокДействий, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПеремещениеДиаграммыНажатие(Элемент)
	
	СписокДействий = Новый СписокЗначений;
	СписокДействий.Добавить("Вверх", НСтр("ru = 'Переместить вверх'"),, БиблиотекаКартинок.ПереместитьВверх);
	СписокДействий.Добавить("Вниз", НСтр("ru = 'Переместить вниз'"),, БиблиотекаКартинок.ПереместитьВниз);
	СписокДействий.Добавить("Влево", НСтр("ru = 'Переместить влево'"),, БиблиотекаКартинок.ПереместитьВлево);
	СписокДействий.Добавить("Вправо", НСтр("ru = 'Переместить вправо'"),, БиблиотекаКартинок.ПереместитьВправо);
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ВыборПеремещенияДиаграммы", ЭтотОбъект, Элемент);
	ПоказатьВыборИзМеню(Оповещение, СписокДействий, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыборПеремещенияПоказателя(ВыбранноеЗначение, Элемент) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение.Значение = "Вверх" Тогда
		КонтекстСместитьВверхПоказатель(Элемент);
	ИначеЕсли ВыбранноеЗначение.Значение = "Вниз" Тогда
		КонтекстСместитьВнизПоказатель(Элемент);
	Иначе
		КонтекстИзменитьКолонкуПоказатель(Элемент, ВыбранноеЗначение.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыборПеремещенияДиаграммы(ВыбранноеЗначение, Элемент) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение.Значение = "Вверх" Тогда
		КонтекстСместитьВверхДиаграмму(Элемент);
	ИначеЕсли ВыбранноеЗначение.Значение = "Вниз" Тогда
		КонтекстСместитьВнизДиаграмму(Элемент);
	Иначе
		КонтекстИзменитьКолонкуДиаграмма(Элемент, ВыбранноеЗначение.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаПредупреждение(Элемент)
	
	ТекстСообщения = НСтр("ru = 'Значение может не соответствовать выбранной организации, поскольку установлены собственные фильтры'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТекущиеДела

&НаКлиенте
Процедура ТекущиеДелаПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ОповещениеОЗакрытииФормыТекущихДел = Новый ОписаниеОповещения("ОбновитьТаблицуТекущихДелОповещение", ЭтотОбъект);
	РежимБлокировки = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	ТекущиеДелаКлиент.ОткрытьСписокТекущихДел(РежимБлокировки, ОповещениеОЗакрытииФормыТекущихДел);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуТекущихДел(Команда)
	
	ОповещениеОЗакрытииФормыТекущихДел = Новый ОписаниеОповещения("ОбновитьТаблицуТекущихДелОповещение", ЭтотОбъект);
	РежимБлокировки = РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать;
	ТекущиеДелаКлиент.ОткрытьСписокТекущихДел(РежимБлокировки, ОповещениеОЗакрытииФормыТекущихДел);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗапуститьФоновоеЗадание();
	ОбновитьТаблицуТекущихДел();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРежимРедактирования(Команда)
	
	ПереключитьРежимРедактирования();
	
КонецПроцедуры

#Область Периоды

&НаКлиенте
Процедура ДатаВыбор(Команда)
	
	Меню = Новый СписокЗначений;
	Если ДатаСравнения<>Неопределено Тогда
		Меню.Добавить("ВСравнении", НСтр("ru = 'Отключить сравнение'"));
	Иначе
		Меню.Добавить("ВСравнении", НСтр("ru = 'В сравнении'"));
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения("ДатаВыборЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, Меню, Элементы.ДатаВыбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСравненияВыбор(Команда)
	
	МассивДат = Новый Массив;
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоПрошлогоДня));
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтойНедели));
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца));
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоКвартала));
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоПолугодия));
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоГода));
	
	Меню = Новый СписокЗначений;
	Для каждого ЭлементДата Из МассивДат Цикл
		Меню.Добавить(ЭлементДата, ПредставлениеСтандартнойДатыНачала(ЭлементДата, Дата));
	КонецЦикла;
	
	Меню.Добавить(Новый СтандартнаяДатаНачала, НСтр("ru = 'Произвольная дата'"));
	
	Оповещение = Новый ОписаниеОповещения("ДатаСравненияВыборЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, Меню, Элементы.ДатаСравненияВыбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСравненияНазад(Команда)
	
	ДатаСравнения = ПредыдущаяДата(ДатаСравнения, ТипДатыСравнения);
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОстатки());
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСравненияВперед(Команда)
	
	ДатаСравнения = СледующаяДата(ДатаСравнения, ТипДатыСравнения);
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОстатки());
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВыбор(Команда)
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтаНеделя));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотКвартал));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтоПолугодие));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотГод));
	
	ПрошлыйГод = Новый Структура;
	ПрошлыйГод.Вставить("Вариант", "Последние7ДнейНеСчитаяТекущего");
	ПредыдущийПериод = УправлениеНебольшойФирмойКлиентСервер.Последние7ДнейНеСчитаяТекущего();
	ПрошлыйГод.Вставить("ДатаНачала", ПредыдущийПериод.ДатаНачала);
	ПрошлыйГод.Вставить("ДатаОкончания", ПредыдущийПериод.ДатаОкончания);
	МассивПериодов.Добавить(ПрошлыйГод);
	
	Меню = Новый СписокЗначений;
	Для каждого ЭлементПериод Из МассивПериодов Цикл
		Меню.Добавить(ЭлементПериод, ПредставлениеСтандартногоПериода(ЭлементПериод));
	КонецЦикла;
	
	Меню.Добавить(Новый СтандартныйПериод, НСтр("ru = 'Произвольный период'"));
	
	Если ПериодСравнения<>Неопределено Тогда
		Меню.Добавить("ВСравнении", НСтр("ru = 'Отключить сравнение'"));
	Иначе
		Меню.Добавить("ВСравнении", НСтр("ru = 'В сравнении'"));
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения("ПериодВыборЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, Меню, Элементы.ПериодВыбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНазад(Команда)
	
	Период = ПредыдущийПериод(Период, ТипПериода);
	Если ПериодСравнения <> Неопределено Тогда
		ПериодСравнения = ПериодСравненияПоПериоду(Период);
		ТипПериодаСравнения = ТипПериода(ПериодСравнения);
	КонецЕсли; 
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОбороты());
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВперед(Команда)
	
	Период = СледующийПериод(Период, ТипПериода);
	Если ПериодСравнения <> Неопределено Тогда
		ПериодСравнения = ПериодСравненияПоПериоду(Период);
		ТипПериодаСравнения = ТипПериода(ПериодСравнения);
	КонецЕсли; 
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОбороты());
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСравненияВыбор(Команда)
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлаяНеделя));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйМесяц));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйКвартал));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлоеПолугодие));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйГод));
	СкользящийПериод = Новый Структура;
	СкользящийПериод.Вставить("Вариант", "ПредыдущийПлавающийПериод");
	ПредыдущийПериод = УправлениеНебольшойФирмойКлиентСервер.ПредыдущийПлавающийПериод(Период);
	СкользящийПериод.Вставить("ДатаНачала", ПредыдущийПериод.ДатаНачала);
	СкользящийПериод.Вставить("ДатаОкончания", ПредыдущийПериод.ДатаОкончания);
	МассивПериодов.Добавить(СкользящийПериод);
	ПрошлыйГод = Новый Структура;
	ПрошлыйГод.Вставить("Вариант", "ЗаПрошлыйГод");
	ПредыдущийПериод = УправлениеНебольшойФирмойКлиентСервер.АналогичныйПериодПрошлогоГода(Период);
	ПрошлыйГод.Вставить("ДатаНачала", ПредыдущийПериод.ДатаНачала);
	ПрошлыйГод.Вставить("ДатаОкончания", ПредыдущийПериод.ДатаОкончания);
	МассивПериодов.Добавить(ПрошлыйГод);
	
	Меню = Новый СписокЗначений;
	Для каждого ЭлементПериод Из МассивПериодов Цикл
		Меню.Добавить(ЭлементПериод, ПредставлениеСтандартногоПериода(ЭлементПериод, Период));
	КонецЦикла;
		
	Меню.Добавить(Новый СтандартныйПериод, НСтр("ru = 'Произвольный период'"));
	
	Оповещение = Новый ОписаниеОповещения("ПериодСравненияВыборЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, Меню, Элементы.ПериодСравненияВыбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСравненияНазад(Команда)
	
	ПериодСравнения = ПредыдущийПериод(ПериодСравнения, ТипПериодаСравнения);
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОбороты());
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСравненияВперед(Команда)
	
	ПериодСравнения = СледующийПериод(ПериодСравнения, ТипПериодаСравнения);
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОбороты());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьТаблицуТекущихДелОповещение(Параметр, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбновитьТаблицуТекущихДел();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДобавитьПоказатель(Команда)
	
	Если СтрНайти(Команда.Имя, "Остатки") <> 0 Тогда
		ЭтоОстаток = Истина;
	ИначеЕсли СтрНайти(Команда.Имя, "Обороты") <> 0 Тогда
		ЭтоОстаток = Ложь;
	Иначе
		ЭтоОстаток = Неопределено;
	КонецЕсли;
	
	ОткрытьФормуДобавленияПоказателя(ЭтоОстаток);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеИнтерфейсаСЗадержкой()

	ОбновитьИнтерфейс();

КонецПроцедуры

#Область ФоновоеЗаданиеПолучениеДанных

&НаКлиенте
Процедура ЗапуститьФоновоеЗадание(Секция="", СохраняемыеПериоды = "")
	
	РезультатФоновогоЗадания = ЗапуститьФоновоеЗаданиеНаСервере(Секция, СохраняемыеПериоды);
	
	НачатьОжиданиеФоновогоЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОжиданиеФоновогоЗадания()
	
	Если РезультатФоновогоЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если РезультатФоновогоЗадания.Статус = "Выполняется" Тогда
		Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеВыполнено", ЭтотОбъект, Истина);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Обработчик, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗаданиеНаСервере(Секция = "", СохраняемыеПериоды = "")
	
	Если МонопольныйРежим() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СохраняемыеПериоды) Тогда
		СохранитьНастройкиПериоды(СохраняемыеПериоды);
	КонецЕсли; 
	
	Если ФоновоеЗаданиеЗапущено Тогда
		ФоновоеЗаданиеОтменить(ФоновоеЗаданиеИдентификатор);
	КонецЕсли;
		
	// Параметры обернем в структуру для их передачи через механизм ДлительныеОперации.
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Дата", Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня));
	ПараметрыПроцедуры.Вставить("ДатаСравнения", ДатаСравнения);
	ПараметрыПроцедуры.Вставить("Период", Период);
	ПараметрыПроцедуры.Вставить("ПериодСравнения", ПериодСравнения);
	ПараметрыПроцедуры.Вставить("Показатели", ДобавленныеПоказатели.Выгрузить());
	ПараметрыПроцедуры.Вставить("Диаграммы", ДобавленныеДиаграммы.Выгрузить());
	Если ЗначениеЗаполнено(ФильтрПоОрганизации) Тогда
		ПараметрыПроцедуры.Вставить("ФильтрПоОрганизации", ФильтрПоОрганизации);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Секция) Тогда
		ПараметрыПроцедуры.Вставить("Секция", Секция);
	КонецЕсли; 
	ПараметрыПроцедуры.Вставить("НеАнализироватьСебестоимость", НеАнализироватьСебестоимость);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		
	РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ПульсБизнеса.ПолучитьДанные",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
		
	ФоновоеЗаданиеАдресРезультата = РезультатФоновогоЗадания.АдресРезультата;
	ФоновоеЗаданиеИдентификатор   = РезультатФоновогоЗадания.ИдентификаторЗадания;
	
	// Если фоновое задание завершилось за время вызова, то данные уже получены
	Если РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда
		ОбновитьДанные();
		Элементы.СтраницыДанныеОжидание.ТекущаяСтраница = Элементы.СтраницаДанные;
		Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
			//@skip-check bsl-legacy-check-expression-type
			ТекущийЭлемент = Элементы.Обновить;
		КонецЕсли;
	Иначе
		// иначе начнем ожидания завершения фонового задания
		ФоновоеЗаданиеЗапущено = Истина;
		Если ПустаяСтрока(Секция) Тогда
			Элементы.СтраницыДанныеОжидание.ТекущаяСтраница = Элементы.СтраницаОжидание;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаданиеВыполнено(Результат, ЗагрузитьРезультат) Экспорт
	
	ФоновоеЗаданиеЗапущено = Ложь;
	Элементы.СтраницыДанныеОжидание.ТекущаяСтраница = Элементы.СтраницаДанные;
	#Если НЕ МобильныйКлиент Тогда
		//@skip-check bsl-legacy-check-expression-type
		ТекущийЭлемент = Элементы.Обновить;
	#КонецЕсли
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус = "Выполнено" Тогда 
		ОбновитьДанные();
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьОшибкиВыполнения(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ФоновоеЗаданиеОтменить(ФоновоеЗаданиеИдентификатор)
	
	Если ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор) Тогда
		Возврат;
	КонецЕсли; 
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ФоновоеЗаданиеИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОшибкиВыполнения(ИнформацияОбОшибке)
	
	Если ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
		ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ПодробноеПредставлениеОшибки = НСтр("ru = 'Ошибка при выполнении:'") + Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Если ПустаяСтрока(ОписаниеОшибки) Тогда
			ОписаниеОшибки = ПодробноеПредставлениеОшибки;
			ПодробноеПредставлениеОшибки = "";
		КонецЕсли;
	Иначе
		ОписаниеОшибки = ИнформацияОбОшибке;
		ПодробноеПредставлениеОшибки = "";
	КонецЕсли;
	ТекстСообщения = ОписаниеОшибки + ?(ПустаяСтрока(ПодробноеПредставлениеОшибки), "", ": " + ПодробноеПредставлениеОшибки);
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область Показатели

//@skip-check method-too-many-params
// Особенности реализации, упаковка метода затруднительна из-за существующей архитектуры
&НаСервере
Процедура ДобавитьПоказатель(
	Показатель, 
	Ресурс = "", 
	Представление = "", 
	ПредставлениеРесурса = "", 
	Остаток = Ложь, 
	Валютный = Ложь, 
	Формат = "", 
	ИмяМакета = "", 
	ИмяОтчета = "", 
	КлючВарианта = "", 
	КолонкиОтчета = "", 
	РазделУчета = "",
	Порядок = 0,
	СсылкаСвязи = Неопределено,
	ПредставлениеСсылкиСвязи = "")
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Показатель", Показатель);
	СтруктураПоиска.Вставить("Ресурс", Ресурс);
	Если НастройкиПоказателей.НайтиСтроки(СтруктураПоиска).Количество()>0 Тогда
		Возврат;
	КонецЕсли; 
	
	Стр = НастройкиПоказателей.Добавить();
	Стр.Показатель = Показатель;
	Стр.Ресурс = Ресурс;
	Стр.Представление = ?(ПустаяСтрока(Представление), Показатель, Представление);
	Стр.ПредставлениеРесурса = ?(ПустаяСтрока(ПредставлениеРесурса), Ресурс, ПредставлениеРесурса);
	Стр.Остаток = Остаток;
	Стр.Валютный = Валютный;
	Стр.Формат = Формат;
	Стр.ИмяМакета = ИмяМакета;
	Стр.ИмяОтчета = ИмяОтчета;
	Стр.КлючВарианта = КлючВарианта;
	Если ЗначениеЗаполнено(ИмяОтчета) И ЗначениеЗаполнено(КлючВарианта) Тогда
		Стр.Вариант = ИмяОтчета + "." + КлючВарианта;
	КонецЕсли; 
	Стр.КолонкиОтчета = КолонкиОтчета;
	Стр.РазделУчета = РазделУчета;
	Стр.Порядок = Порядок;
	Стр.СсылкаСвязи = СсылкаСвязи;
	Стр.ПредставлениеСсылкиСвязи = ПредставлениеСсылкиСвязи;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Возвращает ссылку на вариант отчета.
//
// Параметры:
//  ПолноеИмя - полное имя отчета, включающее имя варианта, отделенное точкой. Пример: Отчеты.Продажи.Основной
//
// Возвращаемое значение:
//  СправочникСсылка.ВариантыОтчетов, Неопределено - вариант отчета, 
//          либо Неопределено, если отчет отсутствует или недоступен по правам.
//
Функция ВариантОтчетаПоПолномуИмени(ПолноеИмя)
	
	Если ПустаяСтрока(ПолноеИмя) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмя, ".");
	Если ЧастиИмени.Количество()<>3 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Возврат ВариантыОтчетов.ВариантОтчета(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.НайтиПоПолномуИмени(ЧастиИмени[0] + "." + ЧастиИмени[1])), ЧастиИмени[2]);
	
КонецФункции

&НаСервере
Процедура ОтобразитьПоказатель(Показатель, Ресурс, Представление = "", Цвет = "")
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Показатель", Показатель);
	СтруктураОтбора.Вставить("Ресурс", Ресурс);
	Строки = НастройкиПоказателей.НайтиСтроки(СтруктураОтбора);
	Для каждого Стр Из Строки Цикл
		СтрДанных = ДобавленныеПоказатели.Добавить();
		ЗаполнитьЗначенияСвойств(СтрДанных, Стр, "Показатель, Ресурс");
		СтрДанных.Представление = ?(ПустаяСтрока(Представление), Стр.ПредставлениеРесурса, Представление);
		СтрДанных.ИдентификаторСтрокиНастроек = Стр.ПолучитьИдентификатор();
		СтрДанных.Остаток = Стр.Остаток;
		Если НЕ ПустаяСтрока(Стр.РазделУчета) Тогда
			СтрДанных.ВводОстатков = РежимыВводаОстатков[Стр.РазделУчета];
		КонецЕсли; 
		СтрДанных.Налоги = (Стр.Показатель = "Налоги");
		Если НЕ ПустаяСтрока(Цвет) Тогда
			СтрДанных.Цвет = Цвет;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДобавленияПоказателя(Остаток = Неопределено)
	
	Если ФоновоеЗаданиеЗапущено Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Показатель", Неопределено);
	СтруктураОткрытия.Вставить("Ресурс", Неопределено);
	СтруктураОткрытия.Вставить("Представление", "");
	СтруктураОткрытия.Вставить("Фильтры", Новый ФиксированныйМассив(Новый Массив));
	СтруктураОткрытия.Вставить("Настройки", Новый ФиксированныйМассив(Новый Массив));
	
	Если Остаток <> Неопределено Тогда
		СтруктураОткрытия.Вставить("Остаток", Остаток);
	КонецЕсли;
	
	СтруктураОткрытия.Вставить("АдресНастроекПоказателей", АдресНастроекПоказателей);
	
	ОткрытьФорму("Обработка.ПульсБизнеса.Форма.ФормаНастройкиПоказателя", СтруктураОткрытия, ЭтотОбъект,,,,, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиПоказателя(Идентификатор)
	
	Если ФоновоеЗаданиеЗапущено Тогда
		Возврат;
	КонецЕсли;
	
	Стр = ДобавленныеПоказатели.НайтиПоИдентификатору(Идентификатор);
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Показатель", Стр.Показатель);
	СтруктураОткрытия.Вставить("Ресурс", Стр.Ресурс);
	СтруктураОткрытия.Вставить("Представление", Стр.Представление);
	СтруктураОткрытия.Вставить("Цвет", Стр.Цвет);
	СтруктураОткрытия.Вставить("Фильтры", Стр.Фильтры);
	СтруктураОткрытия.Вставить("Настройки", Стр.Настройки);
	СтруктураОткрытия.Вставить("ИдентификаторСтроки", Идентификатор);
	СтруктураОткрытия.Вставить("Остаток", Стр.Остаток);
	СтруктураОткрытия.Вставить("СсылкаСвязи", Стр.СсылкаСвязи);
	СтруктураОткрытия.Вставить("ПредставлениеСсылкиСвязи", Стр.ПредставлениеСсылкиСвязи);
	СтруктураОткрытия.Вставить("АдресНастроекПоказателей", АдресНастроекПоказателей);
	
	ОткрытьФорму("Обработка.ПульсБизнеса.Форма.ФормаНастройкиПоказателя", СтруктураОткрытия, ЭтотОбъект,,,,, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияПоказателей(Данные)
	
	Для каждого Стр Из ДобавленныеПоказатели Цикл
		Если Данные.Свойство("Секция") И НЕ ПустаяСтрока(Данные.Секция)
			И ((Данные.Секция = ИмяСекцииОстатки() И НЕ Стр.Остаток) 
			ИЛИ (Данные.Секция = ИмяСекцииОбороты() И Стр.Остаток))Тогда
			Продолжить;
		КонецЕсли; 
		Стр.Значение = 0;
		Стр.Изменение = 0;
		Стр.Подсказка = "";
	КонецЦикла;
	
	Для каждого Стр Из ДобавленныеДиаграммы Цикл
		ОбъектДиаграмма = ЭтотОбъект[Стр.ИмяРеквизита];
		ОбъектДиаграмма.Обновление = Ложь;
	КонецЦикла;
	
	Для каждого Элемент Из Данные.Показатели Цикл
		СтруктураЗначения = Элемент.Значение;     
		Если НЕ ЗначениеЗаполнено(СтруктураЗначения.Значение) И НЕ ЗначениеЗаполнено(СтруктураЗначения.ЗначениеСравнения) Тогда 
			Стр = ДобавленныеПоказатели[Элемент.Ключ]; 
			Стр.АдресРезультата = "";
			Продолжить;
		КонецЕсли; 
		Стр = ДобавленныеПоказатели[Элемент.Ключ];
		СтрокаНастроек = НастройкиПоказателей.НайтиПоИдентификатору(Стр.ИдентификаторСтрокиНастроек);
		Если ЗначениеЗаполнено(СтруктураЗначения.Значение) Тогда
			Стр.Значение = ОтформатироватьЗначение(СтруктураЗначения.Значение, Стр);
		КонецЕсли;     
		
		Если СтруктураЗначения.Свойство("МассивСсылок") Тогда
			Стр.АдресРезультата = ПоместитьВоВременноеХранилище(СтруктураЗначения.МассивСсылок,УникальныйИдентификатор);
		КонецЕсли;     

		Если (ПериодСравнения <> Неопределено И НЕ Стр.Остаток) 
			ИЛИ (ДатаСравнения <> Неопределено И Стр.Остаток) Тогда
			Если ТипЗнч(СтруктураЗначения.Значение) = Тип("Соответствие") Тогда
				Продолжить;
			КонецЕсли; 
			Если СтруктураЗначения.ЗначениеСравнения < СтруктураЗначения.Значение Тогда
				Стр.Изменение = 1;
			ИначеЕсли СтруктураЗначения.ЗначениеСравнения > СтруктураЗначения.Значение Тогда
				Стр.Изменение = 2;
			Иначе
				Стр.Изменение = 0;
			КонецЕсли;
			Если СтрокаНастроек.Остаток Тогда
				Стр.Подсказка = СтрШаблон(НСтр("ru = 'На %1: %2'"), 
					НРег(ПредставлениеСтандартнойДатыНачала(ДатаСравнения, Дата)), 
					ОтформатироватьЗначение(СтруктураЗначения.ЗначениеСравнения, Стр));
			Иначе
				Стр.Подсказка = СтрШаблон(НСтр("ru = 'За %1: %2'"), 
					НРег(ПредставлениеСтандартногоПериода(ПериодСравнения, Период)), 
					ОтформатироватьЗначение(СтруктураЗначения.ЗначениеСравнения, Стр));
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	ТаблицаАльтернативныеСтрелочки = ПолучитьТаблицуЗначенийАльтернативнаяКартинкаСравнения();
	
	Для каждого Стр Из ДобавленныеПоказатели Цикл
		
		Если ПустаяСтрока(Стр.Ресурс) Тогда
			Продолжить;
		КонецЕсли;
		
		АльтернативнаяКартинка = (ТаблицаАльтернативныеСтрелочки.НайтиСтроки(Новый Структура("Показатель, Ресурс", Стр.Показатель, Стр.Ресурс)).Количество() = 1);
		
		ЭлементИконка = Элементы[СтрШаблон("%1_Иконка", Стр.ИмяГруппы)];
		ЭлементИконка.Картинка = ПолучитьИконкуПоказателя(Стр.Показатель, Стр.Цвет,Стр.Ресурс);
		СоответствиеЦветов = Новый Соответствие;
		СоответствиеЦветов.Вставить("", ЦветаПалитры.Желтый);
		СоответствиеЦветов.Вставить("Цвет1", ЦветаПалитры.Желтый);
		СоответствиеЦветов.Вставить("Цвет2", ЦветаПалитры.Зеленый);
		СоответствиеЦветов.Вставить("Цвет3", ЦветаПалитры.Оранжевый);
		СоответствиеЦветов.Вставить("Цвет4", ЦветаПалитры.Фиолетовый);
		СоответствиеЦветов.Вставить("Цвет5", ЦветаПалитры.Синий);
		СоответствиеЦветов.Вставить("Цвет6", ЦветаПалитры.Красный);
		
		ЭлементИконка.ЦветКартинки = СоответствиеЦветов.Получить(Стр.Цвет);
		
		НезаполненноеЗначение = Ложь;
		Если НЕ ЗначениеЗаполнено(Стр.Значение) Тогда
			НезаполненноеЗначение = Истина;
			Стр.Значение = 0;
			Стр.Значение = ОтформатироватьЗначение(Стр.Значение, Стр);
		КонецЕсли;
		
		ЭлементЗначение = Элементы[СтрШаблон("%1_Значение", Стр.ИмяГруппы)];
		ЭлементЗначение.Заголовок = Стр.Значение;
		Если НезаполненноеЗначение = Истина И Стр.ВводОстатков Тогда
			ИмяЭлементаВводаОстатков = СтрШаблон("%1_ЗначениеВводОстатков", Стр.ИмяГруппы);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяЭлементаВводаОстатков, 
				"Видимость", Истина);
		КонецЕсли;
		
		ЭлементСравнение = Элементы[СтрШаблон("%1_Сравнение", Стр.ИмяГруппы)];
		Если Стр.Изменение = 0 Тогда
			ЭлементСравнение.Картинка = БиблиотекаКартинок.ПустаяКомандаБезФигуры;
		ИначеЕсли Стр.Изменение = 1 Тогда
			Если АльтернативнаяКартинка <> Истина Тогда
				ЭлементСравнение.Картинка = БиблиотекаКартинок.ЗначениеУвеличилось;
			Иначе
				ЭлементСравнение.Картинка = БиблиотекаКартинок.ЗначениеУвеличилосьКрасная;
			КонецЕсли;
		ИначеЕсли Стр.Изменение = 2 Тогда
			Если АльтернативнаяКартинка <> Истина Тогда
				ЭлементСравнение.Картинка = БиблиотекаКартинок.ЗначениеУменьшилось;
			Иначе
				ЭлементСравнение.Картинка = БиблиотекаКартинок.ЗначениеУменьшилосьЗеленая;
			КонецЕсли;
		КонецЕсли;
		ЭлементСравнение.Подсказка = Стр.Подсказка;
		
	КонецЦикла;
	
	Для каждого Стр Из ДобавленныеДиаграммы Цикл
		ОбъектДиаграмма = ЭтотОбъект[Стр.ИмяРеквизита];
		ОбъектДиаграмма.Обновление = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыПоказатели()
	
	Если НЕ ЭтоИнтерфейс85 Тогда
		СоздатьЭлементыПоказателиТакси();
		Возврат;
	КонецЕсли;
	
	ДекорацияДобавитьПоказательОстатки = Элементы.Найти("ГруппаДобавитьПоказательОстатки");
	ДекорацияДобавитьПоказательОбороты = Элементы.Найти("ГруппаДобавитьПоказательОбороты");
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	Если ЭтоМобильныйКлиент Тогда
		Элементы.ГруппаДанные.Ширина = 0;
		Элементы.ГруппаДанные.РастягиватьПоГоризонтали = Истина;
		Элементы.ГруппаПоказатели.Ширина = 0;
		Элементы.ГруппаПоказатели.РастягиватьПоГоризонтали = Истина;
		Элементы.ГруппаПоказателиОстаткиЛево.Ширина = 0;
		Элементы.ГруппаПоказателиОстаткиЛево.РастягиватьПоГоризонтали = Истина;
		Элементы.ГруппаПоказателиОборотыЛево.Ширина = 0;
		Элементы.ГруппаПоказателиОборотыЛево.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
	Для каждого Стр Из ДобавленныеПоказатели Цикл
		
		Если ПустаяСтрока(Стр.Ресурс) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(Стр.ИмяГруппы) Тогда
			
			Стр.ИмяГруппы = "Показатель" + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
			
			Если ЗначениеЗаполнено(Стр.ИмяРодительскойГруппы) Тогда
				
				ГруппыЗаполнены = Истина;
				
				РодительскаяГруппа = Элементы[Стр.ИмяРодительскойГруппы];
				
				// Новое распределение по колонкам
				Если Стр.НомерКолонки <> 0 Тогда
					Если Стр.НомерКолонки = 3 Тогда
						РодительскаяГруппа = ?(Стр.Остаток, Элементы.ГруппаПоказателиОстаткиПраво, Элементы.ГруппаПоказателиОборотыПраво);
					ИначеЕсли Стр.НомерКолонки = 2 Тогда
						РодительскаяГруппа = ?(Стр.Остаток, Элементы.ГруппаПоказателиОстаткиЦентр, Элементы.ГруппаПоказателиОборотыЦентр);
					Иначе
						РодительскаяГруппа = ?(Стр.Остаток, Элементы.ГруппаПоказателиОстаткиЛево, Элементы.ГруппаПоказателиОборотыЛево);
					КонецЕсли;
				КонецЕсли;
				
				Если ЭтоМобильныйКлиент Тогда
					Если Стр.Остаток Тогда
						РодительскаяГруппа = Элементы.ГруппаПоказателиОстаткиЛево;
					Иначе
						РодительскаяГруппа = Элементы.ГруппаПоказателиОборотыЛево;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				ГруппыЗаполнены = Ложь;
				
				Если Стр.Остаток Тогда
					
					Если РежимРедактированияВключен И ДекорацияДобавитьПоказательОстатки <> Неопределено Тогда
						РодительскаяГруппа = ДекорацияДобавитьПоказательОстатки.Родитель;
					Иначе
						Если Элементы.ГруппаПоказателиОстаткиЛево.ПодчиненныеЭлементы.Количество() <= Элементы.ГруппаПоказателиОстаткиПраво.ПодчиненныеЭлементы.Количество() Тогда
							РодительскаяГруппа = Элементы.ГруппаПоказателиОстаткиЛево;
						Иначе
							РодительскаяГруппа = Элементы.ГруппаПоказателиОстаткиПраво;
						КонецЕсли;
					КонецЕсли;
					
					// Новое распределение по колонкам
					Если Стр.НомерКолонки <> 0 Тогда
						Если Стр.НомерКолонки = 3 Тогда
							РодительскаяГруппа = Элементы.ГруппаПоказателиОстаткиПраво;
						ИначеЕсли Стр.НомерКолонки = 2 Тогда
							РодительскаяГруппа = Элементы.ГруппаПоказателиОстаткиЦентр;
						Иначе
							РодительскаяГруппа = Элементы.ГруппаПоказателиОстаткиЛево;
						КонецЕсли;
					КонецЕсли;
					
					Стр.ИмяРодительскойГруппы = РодительскаяГруппа.Имя;
					
					Если ЭтоМобильныйКлиент Тогда
						РодительскаяГруппа = Элементы.ГруппаПоказателиОстаткиЛево;
					КонецЕсли;
					
				Иначе
					
					Если РежимРедактированияВключен И ДекорацияДобавитьПоказательОбороты <> Неопределено Тогда
						РодительскаяГруппа = ДекорацияДобавитьПоказательОбороты.Родитель;
					Иначе
						Если Элементы.ГруппаПоказателиОборотыЛево.ПодчиненныеЭлементы.Количество() <= Элементы.ГруппаПоказателиОборотыПраво.ПодчиненныеЭлементы.Количество() Тогда
							РодительскаяГруппа = Элементы.ГруппаПоказателиОборотыЛево;
						Иначе
							РодительскаяГруппа = Элементы.ГруппаПоказателиОборотыПраво;
						КонецЕсли;
					КонецЕсли;
					
					// Новое распределение по колонкам
					Если Стр.НомерКолонки <> 0 Тогда
						Если Стр.НомерКолонки = 3 Тогда
							РодительскаяГруппа = Элементы.ГруппаПоказателиОборотыПраво;
						ИначеЕсли Стр.НомерКолонки = 2 Тогда
							РодительскаяГруппа = Элементы.ГруппаПоказателиОборотыЦентр;
						Иначе
							РодительскаяГруппа = Элементы.ГруппаПоказателиОборотыЛево;
						КонецЕсли;
					КонецЕсли;
					
					Стр.ИмяРодительскойГруппы = РодительскаяГруппа.Имя;
					
					Если ЭтоМобильныйКлиент Тогда
						РодительскаяГруппа = Элементы.ГруппаПоказателиОборотыЛево;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ГруппыЗаполнены Тогда
				СохранитьНастройки("Показатели");
			КонецЕсли;
			
			Группа = Элементы.Добавить(Стр.ИмяГруппы, Тип("ГруппаФормы"), РодительскаяГруппа);
			
			// Верхняя группа
			Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			Группа.ОтображатьЗаголовок = Ложь;
			Группа.ОтображатьКакКарточку = Истина;
			Группа.Гиперссылка = Истина;
			Группа.РастягиватьПоВертикали = Ложь;
			Группа.РастягиватьПоГоризонтали = Истина;
			Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			Группа.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
			Группа.УстановитьДействие("Нажатие", "Подключаемый_ПоказательЗначениеНажатие");
			
			// Содержимое показателя
			ГруппаЗаголовок = Элементы.Добавить(Стр.ИмяГруппы + "_Содержимое", Тип("ГруппаФормы"), Группа);
			ГруппаЗаголовок.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаЗаголовок.ОтображатьЗаголовок = Ложь;
			ГруппаЗаголовок.РастягиватьПоВертикали = Ложь;
			ГруппаЗаголовок.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
			ГруппаЗаголовок.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаЗаголовок.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаЗаголовок.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
			
			// Иконка
			ЭлементДекорацияИконка = Элементы.Добавить(Стр.ИмяГруппы + "_Иконка", Тип("ДекорацияФормы"), ГруппаЗаголовок);
			ЭлементДекорацияИконка.Вид = ВидДекорацииФормы.Картинка;
			ЭлементДекорацияИконка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
			ЭлементДекорацияИконка.Картинка = ПолучитьИконкуПоказателя(Стр.Показатель, Стр.Цвет, Стр.Ресурс);
			
			СоответствиеЦветов = Новый Соответствие;
			СоответствиеЦветов.Вставить("", ЦветаПалитры.Желтый);
			СоответствиеЦветов.Вставить("Цвет1", ЦветаПалитры.Желтый);
			СоответствиеЦветов.Вставить("Цвет2", ЦветаПалитры.Зеленый);
			СоответствиеЦветов.Вставить("Цвет3", ЦветаПалитры.Оранжевый);
			СоответствиеЦветов.Вставить("Цвет4", ЦветаПалитры.Фиолетовый);
			СоответствиеЦветов.Вставить("Цвет5", ЦветаПалитры.Синий);
			СоответствиеЦветов.Вставить("Цвет6", ЦветаПалитры.Красный);
			
			ЭлементДекорацияИконка.ЦветКартинки = СоответствиеЦветов.Получить(Стр.Цвет);
			
			ЭлементЗаголовок = Элементы.Добавить(Стр.ИмяГруппы+"_Заголовок", Тип("ДекорацияФормы"), ГруппаЗаголовок);
			ЭлементЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			ЭлементЗаголовок.РастягиватьПоГоризонтали = Истина;
			ЭлементЗаголовок.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
			ЭлементЗаголовок.Шрифт = ШрифтыСтиля.ТекстВторогоУровня;
			
			ГруппаСумма = Элементы.Добавить(Стр.ИмяГруппы + "_ГруппаСумма", Тип("ГруппаФормы"), Группа);
			ГруппаСумма.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСумма.ОтображатьЗаголовок = Ложь;
			ГруппаСумма.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСумма.РастягиватьПоГоризонтали = Истина;
			ГруппаСумма.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаСумма.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
			
			ИмяКоманды = Стр.ИмяГруппы + "_КонтекстРасшифроватьПоказатель";
			Команда = Команды.Найти(ИмяКоманды);
			Если Команда = Неопределено Тогда
				Команда = Команды.Добавить(ИмяКоманды);
				Команда.Действие = "КонтекстРасшифроватьПоказатель";
			КонецЕсли;
			
			ЭлементЗначение = Элементы.Добавить(Стр.ИмяГруппы+"_Значение",  Тип("ДекорацияФормы"), ГруппаСумма);
			ЭлементЗначение.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
			ЭлементЗначение.Шрифт = ШрифтыСтиля.ЗаголовокПервогоУровня;
			ЭлементВводОстатков = Элементы.Добавить(Стр.ИмяГруппы+"_ЗначениеВводОстатков", Тип("ДекорацияФормы"), ГруппаЗаголовок);
			ЭлементВводОстатков.Гиперссылка = Истина;
			ЭлементВводОстатков.Заголовок = НСтр("ru='Заполнить'");
			ЭлементВводОстатков.Видимость = Ложь;
			ЭлементВводОстатков.УстановитьДействие("Нажатие", "Подключаемый_ПоказательЗначениеНажатие");
			
			Если НЕ ПустаяСтрока(Стр.Ресурс) Тогда
				ЭлементСравнение = Элементы.Добавить(Стр.ИмяГруппы+"_Сравнение", Тип("ДекорацияФормы"), ГруппаСумма);
				ЭлементСравнение.Вид = ВидДекорацииФормы.Картинка;
				ЭлементСравнение.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
				ЭлементСравнение.РастягиватьПоГоризонтали = Ложь;
				ЭлементСравнение.РастягиватьПоВертикали = Ложь;
				ЭлементСравнение.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
			Иначе
				ЭлементЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
				ЭлементЗаголовок.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Низ;
				ЭлементЗаголовок.Высота = ?(ДобавленныеПоказатели.Индекс(Стр)=0, 1, 2);
			КонецЕсли;
			
			ДобавитьКомандыПоказателя(Стр);
			ОбновитьПоложениеДекорацийДобавитьПоказатель(Стр);
			
		Иначе
			ЭлементЗаголовок = Элементы[Стр.ИмяГруппы+"_Заголовок"];
		КонецЕсли;
		Если ПустаяСтрока(Стр.Ресурс) Тогда
			//@skip-check new-font
			ЭлементЗаголовок.Заголовок = Новый ФорматированнаяСтрока(Стр.Представление, Новый Шрифт(Новый Шрифт(),,, Истина));
		Иначе
			ЭлементЗаголовок.Заголовок = Стр.Представление;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьПоказатель(Идентификатор)
	
	ТекСтр = ДобавленныеПоказатели.НайтиПоИдентификатору(Идентификатор);
	СтрНастроек = НастройкиПоказателей.НайтиПоИдентификатору(ТекСтр.ИдентификаторСтрокиНастроек);

	Если ТекСтр.Налоги Тогда
		// Вместо расшифровки открываем записи календаря подготовки отчетности
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Показатель", ТекСтр.Ресурс);
		ОткрытьФорму("Справочник.ЗаписиКалендаряПодготовкиОтчетности.Форма.КалендарьНалоговИОтчетности", ПараметрыОткрытия, ЭтотОбъект);
		Возврат;                                  
	КонецЕсли;    
	
	НестандартнаяРасшифровкаПоказателя = НестандартнаяРасшифровкаПоказателя(ТекСтр);
	Если НестандартнаяРасшифровкаПоказателя = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрНастроек.Вариант) Тогда
		Возврат;
	КонецЕсли;
	ВариантОтчета = ВариантОтчетаПоПолномуИмени(СтрНастроек.Вариант);
	Если ВариантОтчета=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекСтр.ВводОстатков Тогда
		// Вместо расшифровки открываем помощник ввода начальных остатков
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("РазделУчета", СтрНастроек.РазделУчета);
		ОткрытьФорму("Обработка.ПомощникВводаНачальныхОстатков.Форма", ПараметрыОткрытия, ЭтотОбъект);
		Возврат;
	КонецЕсли; 
	
	ОтборРасшифровки = Новый Структура;
	Если НЕ СтрНастроек.Остаток Тогда
		Если ТипЗнч(Период) = Тип("СтандартныйПериод") Тогда
			ДатаНачалаРасшифровки = НачалоДня(Период.ДатаНачала);
			ДатаКонцаРасшифровки = ?(ЗначениеЗаполнено(Период.ДатаОкончания), 
				КонецДня(Период.ДатаОкончания), '0001-01-01');
		ИначеЕсли ТипЗнч(Период) = Тип("Структура") Тогда
			ОбновитьДатыНачалаИКонцаПериода(Период);
			ДатаНачалаРасшифровки = НачалоДня(Период.ДатаНачала);
			ДатаКонцаРасшифровки = ?(ЗначениеЗаполнено(Период.ДатаОкончания), 
				КонецДня(Период.ДатаОкончания), '0001-01-01');
		Иначе
			ДатаНачалаРасшифровки = '0001-01-01';
			ДатаКонцаРасшифровки = '0001-01-01';
		КонецЕсли; 
		ПериодОтчета = Новый СтандартныйПериод(ДатаНачалаРасшифровки, ДатаКонцаРасшифровки);
		ОтборРасшифровки.Вставить("ПериодРасшифровки", ПериодОтчета);
	КонецЕсли;
	
	ДополнитьОтборПоКонверсионнымПоказателям(ТекСтр, ОтборРасшифровки);
	
	ОписаниеФильтраПоОрганизации = Новый Структура;
	ОписаниеФильтраПоОрганизации.Вставить("Поле", "Организация"); // Не локализуется
	ОписаниеФильтраПоОрганизации.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
	ОписаниеФильтраПоОрганизации.Вставить("Значение", ФильтрПоОрганизации);
	ЕстьФильтрПоОрганизации = Ложь;
	
	Если ТипЗнч(ТекСтр.Фильтры) = Тип("ФиксированныйМассив") Тогда
		Для каждого Фильтр Из ТекСтр.Фильтры Цикл
			Если СтрНайти(Фильтр.Поле, ".") > 0 Тогда
				Продолжить;
			КонецЕсли;
			СтруктураЗначения = Новый Структура;
			СтруктураЗначения.Вставить("ВидСравнения", Фильтр.ВидСравнения);
			СтруктураЗначения.Вставить("ПравоеЗначение", Фильтр.Значение);
			ОтборРасшифровки.Вставить(Фильтр.Поле, СтруктураЗначения);
			Если Фильтр.Поле = ОписаниеФильтраПоОрганизации.Поле Тогда
				ЕстьФильтрПоОрганизации = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФильтрПоОрганизации) И НЕ ЕстьФильтрПоОрганизации И СтрНайти(ТекСтр.Показатель,"CRM") = 0 Тогда
		СтруктураЗначения = Новый Структура;
		СтруктураЗначения.Вставить("ВидСравнения", ОписаниеФильтраПоОрганизации.ВидСравнения);
		СтруктураЗначения.Вставить("ПравоеЗначение", ОписаниеФильтраПоОрганизации.Значение);
		ОтборРасшифровки.Вставить(ОписаниеФильтраПоОрганизации.Поле, СтруктураЗначения);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	Если НЕ ПустаяСтрока(СтрНастроек.КолонкиОтчета) Тогда
		ПараметрыФормы.Вставить("Колонки", СтрНастроек.КолонкиОтчета);
	КонецЕсли; 
	ПараметрыФормы.Вставить("Отбор", ОтборРасшифровки);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", Новый ПользовательскиеНастройкиКомпоновкиДанных);
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, ВариантОтчета, ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуПоказателяСервер()
	
	СохранитьНастройки("Показатели");
	СоздатьЭлементыПоказатели();
	
КонецПроцедуры

&НаСервере
Процедура СортироватьПоказатели()
	
	Для каждого СтрокаПоказателя Из ДобавленныеПоказатели Цикл
		
		СтрокаПоказателя.ПорядокСортировки = 0;
		
		Если НЕ ЗначениеЗаполнено(СтрокаПоказателя.ИмяРодительскойГруппы) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяГруппаПоказателя = Элементы[СтрокаПоказателя.ИмяРодительскойГруппы];
		ТекущийПоказатель = Элементы[СтрокаПоказателя.ИмяГруппы];
		СтрокаПоказателя.ПорядокСортировки = ТекущаяГруппаПоказателя.ПодчиненныеЭлементы.Индекс(ТекущийПоказатель);
	КонецЦикла;
	
	ДобавленныеПоказатели.Сортировать("ПорядокСортировки");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСсылок(АдресРезультата)
	
	Возврат ПолучитьИзВременногоХранилища(АдресРезультата);
	
КонецФункции  

&НаКлиенте
Функция НестандартнаяРасшифровкаПоказателя(ТекСтр)
	
	Если СтрНайти(ТекСтр.Ресурс,"Задач") <> 0 Тогда
		ОткрытьФорму("Обработка.КонтактЦентр.Форма.Форма");
		Возврат Истина;                                 
	ИначеЕсли СтрНайти(ТекСтр.Ресурс,"КоличествоВСегменте") <> 0  Тогда 
		ПараметрыФормы = Новый Структура("Ключ", ТекСтр.СсылкаСвязи);
		ОткрытьФорму("Справочник.СегментыКонтрагентов.ФормаОбъекта", ПараметрыФормы);
		Возврат Истина;                             
	ИначеЕсли ЗначениеЗаполнено(ТекСтр.АдресРезультата) Тогда    
		МассивСсылок = ПолучитьМассивСсылок(ТекСтр.АдресРезультата);   
		ОткрытьФормуНаОснованииМассиваСсылок(ТекСтр.Ресурс, МассивСсылок);
		Возврат Истина;     
	Иначе                
		Ресурс = ТекСтр.Ресурс;	  
		ПараметрыФормы = Новый Структура; 
		Отбор = Новый Структура("Ссылка", Новый Массив);
		Если СтрНайти(Ресурс,"КоличествоЛидов") <> 0 ИЛИ СтрНайти(Ресурс,"КоличествоНекачественныхЛидов") <> 0 Тогда 
            Если ОтсутствуютЛиды() <> Истина Тогда
				ПараметрыФормы = Новый Структура("Отбор,ПульсБизнеса", Отбор, Истина);
			КонецЕсли;            
			ОткрытьФорму("Справочник.Лиды.ФормаСписка", ПараметрыФормы, ЭтотОбъект);   
			Возврат Истина;     
		ИначеЕсли СтрНайти(Ресурс,"КоличествоКонтрагентов") <> 0 Тогда 
            Если ОтсутствуютКонтрагенты() <> Истина Тогда
				ПараметрыФормы = Новый Структура("Отбор,ПульсБизнеса", Отбор, Истина);
			КонецЕсли;            
			ОткрытьФорму("Справочник.Контрагенты.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
			Возврат Истина;     
		ИначеЕсли СтрНайти(Ресурс,"КоличествоСобытий") <> 0 Тогда
            Если ОтсутствуютСобытия() <> Истина Тогда
				ПараметрыФормы = Новый Структура("Отбор,ПульсБизнеса", Отбор, Истина);
			КонецЕсли;            			
			ОткрытьФорму("Документ.Событие.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
			Возврат Истина; 
		Иначе                
			Возврат Ложь;     
		КонецЕсли;            
	КонецЕсли;    
	
КонецФункции   

&НаКлиенте
Процедура ОткрытьФормуНаОснованииМассиваСсылок(Ресурс, МассивСсылок)
	
	Отбор = Новый Структура("Ссылка", МассивСсылок);
	ПараметрыФормы = Новый Структура("Отбор,ПульсБизнеса", Отбор, Истина);

	Если СтрНайти(Ресурс,"КоличествоЛидов") <> 0 ИЛИ СтрНайти(Ресурс,"КоличествоНекачественныхЛидов") <> 0 Тогда
		ОткрытьФорму("Справочник.Лиды.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	ИначеЕсли СтрНайти(Ресурс,"КоличествоКонтрагентов") <> 0 Тогда
		ОткрытьФорму("Справочник.Контрагенты.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	ИначеЕсли СтрНайти(Ресурс,"КоличествоСобытий") <> 0 Тогда
		ОткрытьФорму("Документ.Событие.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;            
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьОтборПоКонверсионнымПоказателям(ТекСтр, ОтборРасшифровки)

	Если СтрНайти(ТекСтр.Ресурс,"Конверсия") И ЗначениеЗаполнено(ТекСтр.СсылкаСвязи) Тогда
		СтруктураЗначения = Новый Структура;
		СтруктураЗначения.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
		СтруктураЗначения.Вставить("ПравоеЗначение", ТекСтр.СсылкаСвязи);
		ОтборРасшифровки.Вставить("ИсточникПривлечения", СтруктураЗначения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Диаграммы

//@skip-check method-too-many-params
&НаСервере
Процедура ДобавитьОписаниеСерииТочки(СтруктураСерийТочек, Имя, Представления, Заголовок = "", ТипДиаграммы = Неопределено, Валютная = Ложь, Формат = "", ДоступныеТочкиСерии = "", ОбязательныеФильтры = Неопределено)
	
	ОписаниеСерииТочки = Новый Структура;
	Если ТипЗнч(Представления)=Тип("Строка") Тогда
		МассивПредставлений = Новый Массив;
		МассивПредставлений.Добавить(Представления);
	Иначе
		МассивПредставлений = Представления;
	КонецЕсли; 
	ОписаниеСерииТочки.Вставить("Представления", Новый ФиксированныйМассив(МассивПредставлений));
	ОписаниеСерииТочки.Вставить("Заголовок", Заголовок);
	ОписаниеСерииТочки.Вставить("ТипДиаграммы", ТипДиаграммы);
	ОписаниеСерииТочки.Вставить("Валютная", Валютная);
	ОписаниеСерииТочки.Вставить("Формат", Формат);
	ОписаниеСерииТочки.Вставить("ДоступныеТочкиСерии", ДоступныеТочкиСерии);
	ОписаниеСерииТочки.Вставить("ОбязательныеФильтры", ОбязательныеФильтры);
	СтруктураСерийТочек.Вставить(Имя, ОписаниеСерииТочки);
	
КонецПроцедуры

// АПК:134-выкл
// АПК:141-выкл
// АПК:142-выкл Сложное легаси, оставляем без изменений
//@skip-check method-too-many-params
&НаСервере
Процедура ДобавитьДиаграмму(Диаграмма, Представление = "", Серии, Точки, Остаток, ИмяМакета = "", ИмяОтчета = "", КлючВарианта = "", ЗапретитьСравнение = Ложь, ЭтоГруппа = Ложь, ВходитВГруппу = "")
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Диаграмма", Диаграмма);
	Если НастройкиДиаграмм.НайтиСтроки(СтруктураПоиска).Количество()>0 Тогда
		Возврат;
	КонецЕсли; 
	
	Стр = НастройкиДиаграмм.Добавить();
	Стр.Диаграмма = Диаграмма;
	Стр.Представление = ?(ПустаяСтрока(Представление), Диаграмма, Представление);
	Стр.Серии = Серии;
	Стр.Точки = Точки;
	Стр.Остаток = Остаток;
	Стр.ИмяМакета = ИмяМакета;
	Стр.ИмяОтчета = ИмяОтчета;
	Стр.КлючВарианта = КлючВарианта;
	Стр.ЗапретитьСравнение = ЗапретитьСравнение;
	Если ЗначениеЗаполнено(ИмяОтчета) И ЗначениеЗаполнено(КлючВарианта) Тогда
		Стр.Вариант = ИмяОтчета + "." + КлючВарианта;
	КонецЕсли; 
	Стр.ЭтоГруппа = ЭтоГруппа;
	Стр.ВходитВГруппу = ВходитВГруппу;
	
КонецПроцедуры
// АПК:134-вкл
// АПК:141-вкл
// АПК:142-вкл

//@skip-check method-too-many-params
&НаСервере
Процедура ОтобразитьДиаграмму(Диаграмма, Серия, Точка, Период = Неопределено, ПериодСравнения = Неопределено, Представление = "", Фильтры = Неопределено)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Диаграмма", Диаграмма);
	Строки = НастройкиДиаграмм.НайтиСтроки(СтруктураОтбора);
	Для каждого Стр Из Строки Цикл
		НастройкиСерии = Стр.Серии[Серия];
		НастройкиТочки = Стр.Точки[Точка];
		СтрДанных = ДобавленныеДиаграммы.Добавить();
		СтрДанных.Диаграмма = Диаграмма;
		СтрДанных.Серия = Серия;
		СтрДанных.Точка = Точка;
		СтрДанных.Представление = ?(ПустаяСтрока(Представление), Стр.Представление, Представление);
		СтрДанных.ПредставленияСерий = НастройкиСерии.Представления;
		СтрДанных.ПредставленияТочек = НастройкиТочки.Представления;
		СтрДанных.ИдентификаторСтрокиНастроек = Стр.ПолучитьИдентификатор();
		Если ЗначениеЗаполнено(Период) Тогда
			СтрДанных.Период = Период;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ПериодСравнения) Тогда
			СтрДанных.ПериодСравнения = ПериодСравнения;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Фильтры) Тогда
			СтрДанных.Фильтры = Новый ФиксированныйМассив(Фильтры);
		КонецЕсли;
		СтрДанных.ВходитВГруппу = Стр.ВходитВГруппу;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДобавленияДиаграммы()
	
	Если ФоновоеЗаданиеЗапущено Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Диаграмма", Неопределено);
	СтруктураОткрытия.Вставить("Серия", Неопределено);
	СтруктураОткрытия.Вставить("Точка", Неопределено);
	СтруктураОткрытия.Вставить("Представление", "");
	СтруктураОткрытия.Вставить("Период", Новый СтандартныйПериод);
	СтруктураОткрытия.Вставить("ПериодСравнения", Новый СтандартныйПериод);
	СтруктураОткрытия.Вставить("Фильтры", Новый ФиксированныйМассив(Новый Массив));
	СтруктураОткрытия.Вставить("Настройки", Новый ФиксированныйМассив(Новый Массив));
	
	СтруктураОткрытия.Вставить("АдресНастроекДиаграмм", АдресНастроекДиаграмм);
	
	ОткрытьФорму("Обработка.ПульсБизнеса.Форма.ФормаНастройкиДиаграммы", СтруктураОткрытия, ЭтотОбъект,,,,, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиДиаграммы(Идентификатор)
	
	Если ФоновоеЗаданиеЗапущено Тогда
		Возврат;
	КонецЕсли; 
	
	Стр = ДобавленныеДиаграммы.НайтиПоИдентификатору(Идентификатор);
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Диаграмма", Стр.Диаграмма);
	СтруктураОткрытия.Вставить("Серия", Стр.Серия);
	СтруктураОткрытия.Вставить("Точка", Стр.Точка);
	СтруктураОткрытия.Вставить("Представление", Стр.Представление);
	СтруктураОткрытия.Вставить("Период", Стр.Период);
	СтруктураОткрытия.Вставить("ПериодСравнения", Стр.ПериодСравнения);
	СтруктураОткрытия.Вставить("ВходитВГруппу", Стр.ВходитВГруппу);
	СтруктураОткрытия.Вставить("ПредставлениеГруппыДиаграмм", ПредставлениеГруппыДиаграмм(Стр.ВходитВГруппу));
	
	Если ТипЗнч(Стр.Фильтры)=Тип("ФиксированныйМассив") Тогда
		СтруктураОткрытия.Вставить("Фильтры", Стр.Фильтры);
	Иначе
		СтруктураОткрытия.Вставить("Фильтры", Новый ФиксированныйМассив(Новый Массив));
	КонецЕсли;
	Если ТипЗнч(Стр.Настройки)=Тип("ФиксированныйМассив") Тогда
		СтруктураОткрытия.Вставить("Настройки", Стр.Настройки);
	Иначе
		СтруктураОткрытия.Вставить("Настройки", Новый ФиксированныйМассив(Новый Массив));
	КонецЕсли;
	СтруктураОткрытия.Вставить("ИдентификаторСтроки", Идентификатор);
	
	СтруктураОткрытия.Вставить("АдресНастроекДиаграмм", АдресНастроекДиаграмм);
	
	ОткрытьФорму("Обработка.ПульсБизнеса.Форма.ФормаНастройкиДиаграммы", СтруктураОткрытия, ЭтотОбъект,,,,, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияДиаграмм(Данные)
	
	Если НЕ ПустаяСтрока(Данные.Секция) Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого Стр Из ДобавленныеДиаграммы Цикл
		
		ОбъектДиаграмма = ЭтотОбъект[Стр.ИмяРеквизита];
		ОбъектДиаграмма.Обновление = Ложь;
		ОбъектДиаграмма.Очистить();
		
	КонецЦикла; 
	
	Для каждого Элемент Из Данные.Диаграммы Цикл
		
		МассивДанных = Элемент.Значение;
		Стр = ДобавленныеДиаграммы[Элемент.Ключ];
		СтрокаНастройки = НастройкиДиаграмм.НайтиПоИдентификатору(Число(Стр.ИдентификаторСтрокиНастроек));
		ОписаниеТочки = СтрокаНастройки.Точки[Стр.Точка];
		ОписаниеСерии = СтрокаНастройки.Серии[Стр.Серия];
		ОбъектДиаграмма = ЭтотОбъект[Стр.ИмяРеквизита];
		ПриведенныйФорматТочек = ОптимизироватьФормат(Стр, Стр.Точка);
		
		Попытка
			
			ТаблицаЗначений = Новый ТаблицаЗначений;
			ТаблицаЗначений.Колонки.Добавить("Точка");
			ТаблицаЗначений.Колонки.Добавить("ДляСравнения");
			ТаблицаЗначений.Колонки.Добавить("Порядок");
			ТаблицаЗначений.Колонки.Добавить("КоличествоСерий");
			ТаблицаЗначений.Колонки.Добавить("БазовоеЗначение");
			ТекущееКоличествоСерий = 0;
			Для каждого СтруктураЗначения Из МассивДанных Цикл
				Если СтруктураЗначения.КоличествоСерий>ТекущееКоличествоСерий Тогда
					Для ии = ТекущееКоличествоСерий По СтруктураЗначения.КоличествоСерий Цикл
						ТаблицаЗначений.Колонки.Добавить("Серия"+(ии+1));
					КонецЦикла;
					ТекущееКоличествоСерий = СтруктураЗначения.КоличествоСерий;
				КонецЕсли; 
				ЗаполнитьЗначенияСвойств(ТаблицаЗначений.Добавить(), СтруктураЗначения);
			КонецЦикла; 
			ТаблицаЗначений.Сортировать("Порядок, ДляСравнения");
			
			ЕстьДанныеДляОтображения = НЕ ПустаяДиаграмма(ТаблицаЗначений);
			Если НЕ ЕстьДанныеДляОтображения Тогда
				НаполнитьСлучайнымиДанными(ОбъектДиаграмма, МассивДанных, ОписаниеТочки, ОписаниеСерии);
			Иначе
				ОбъектДиаграмма.ОтображатьЗаголовок = Ложь;
				Для каждого СтруктураЗначения Из ТаблицаЗначений Цикл
					Если ЭтоКруговаяДиаграмма(ОписаниеСерии.ТипДиаграммы) Тогда
						Если НЕ ЗначениеЗаполнено(СтруктураЗначения.Точка) Тогда
							Продолжить;
						КонецЕсли; 
						Точка = ОбъектДиаграмма.УстановитьТочку(Стр.ПредставленияСерий[0]);
						Серия = ОбъектДиаграмма.УстановитьСерию(?(НЕ ЗначениеЗаполнено(СтруктураЗначения.Серия1), 
						НСтр("ru = '<не заполнено>'"), 
						СтруктураЗначения.Серия1));
						ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, СтруктураЗначения.Точка);
					ИначеЕсли ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.ГрафикСОбластямиИНакоплением Тогда
						Если Не ПустаяСтрока(ОписаниеТочки.Формат) Тогда
							Точка = ОбъектДиаграмма.УстановитьТочку(Формат(СтруктураЗначения.Точка, ОписаниеТочки.Формат));
						Иначе
							Точка = ОбъектДиаграмма.УстановитьТочку(
							?(НЕ ЗначениеЗаполнено(СтруктураЗначения.Точка), 
							НСтр("ru = '<не заполнено>'"), 
							Строка(СтруктураЗначения.Точка)));
						КонецЕсли;
						Для ии = 1 По СтруктураЗначения.КоличествоСерий Цикл
							Если НЕ ЗначениеЗаполнено(СтруктураЗначения["Серия"+ии]) Тогда
								Продолжить;
							КонецЕсли; 
							Серия = ОбъектДиаграмма.УстановитьСерию(Стр.ПредставленияСерий[ии-1]);
							ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, СтруктураЗначения["Серия"+ии]);
						КонецЦикла;  
					Иначе
						Если НЕ ПустаяСтрока(ПриведенныйФорматТочек) Тогда
							Точка = ОбъектДиаграмма.УстановитьТочку(Формат(СтруктураЗначения.Точка, ПриведенныйФорматТочек));
						ИначеЕсли Не ПустаяСтрока(ОписаниеТочки.Формат) Тогда
							Точка = ОбъектДиаграмма.УстановитьТочку(Формат(СтруктураЗначения.Точка, ОписаниеТочки.Формат));
						Иначе
							Точка = ОбъектДиаграмма.УстановитьТочку(
							?(НЕ ЗначениеЗаполнено(СтруктураЗначения.Точка), 
							НСтр("ru = '<не заполнено>'"), 
							Строка(СтруктураЗначения.Точка)));
						КонецЕсли;
						Если ЗначениеЗаполнено(СтруктураЗначения.Серия1) И СтруктураЗначения.ДляСравнения Тогда
							Серия = ОбъектДиаграмма.УстановитьСерию(Стр.ПредставленияСерий[1]);
							ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, СтруктураЗначения.Серия1);
						Иначе
							Для ии = 1 По СтруктураЗначения.КоличествоСерий Цикл
								Если НЕ ЗначениеЗаполнено(СтруктураЗначения["Серия"+ии]) Тогда
									Продолжить;
								КонецЕсли; 
								Серия = ОбъектДиаграмма.УстановитьСерию(Стр.ПредставленияСерий[ии-1]);
								ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, СтруктураЗначения["Серия"+ии]);
							КонецЦикла;  
						КонецЕсли; 
					КонецЕсли; 
				КонецЦикла;
			КонецЕсли; 
			
			Если НЕ ЭтоКруговаяДиаграмма(ОписаниеСерии.ТипДиаграммы)
				И ОбъектДиаграмма.Серии.Количество()<=1 Тогда
				ОбъектДиаграмма.ОтображатьЛегенду = Ложь;
				ОбъектДиаграмма.ОбластьПостроения.Право = 0.99;
			ИначеЕсли ЭтоКруговаяДиаграмма(ОписаниеСерии.ТипДиаграммы) Тогда
				ОбъектДиаграмма.ОтображатьЛегенду = Истина;
				ОбъектДиаграмма.ОбластьПостроения.Право = 0.55;
				ОбъектДиаграмма.ОбластьЛегенды.Лево = 0.58;
			Иначе
				ОбъектДиаграмма.ОтображатьЛегенду = Истина;
				ОбъектДиаграмма.ОбластьПостроения.Право = 0.75;
				ОбъектДиаграмма.ОбластьЛегенды.Лево = 0.78;
			КонецЕсли; 
			
			УстановитьОтображениеДиаграммы(ОбъектДиаграмма, ЕстьДанныеДляОтображения);
			ОбъектДиаграмма.Обновление = Истина;
			
		Исключение
			
			ОбъектДиаграмма.Очистить();
			ОбъектДиаграмма.Обновление = Истина;
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ВывестиОшибкуДиаграммы(ОбъектДиаграмма, ИнформацияОбОшибке);
		    
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОптимизироватьФормат(ДобавленнаяДиаграмма, ИмяТочки)
	
	Если ИмяТочки <> "Месяц" И ИмяТочки <> "День" Тогда
		Возврат "";
	КонецЕсли; 
	ПериодВПределахГода = ТипЗнч(ДобавленнаяДиаграмма.Период) <> Тип("СтандартныйПериод") 
		ИЛИ НачалоГода(ДобавленнаяДиаграмма.Период.ДатаНачала) = НачалоГода(ДобавленнаяДиаграмма.Период.ДатаОкончания);
	ПериодСравненияВПределахГода = ТипЗнч(ДобавленнаяДиаграмма.ПериодСравнения) <> Тип("СтандартныйПериод") 
		ИЛИ НачалоГода(ДобавленнаяДиаграмма.ПериодСравнения.ДатаНачала) = НачалоГода(ДобавленнаяДиаграмма.ПериодСравнения.ДатаОкончания);
	ПериодВПределахМесяца = ТипЗнч(ДобавленнаяДиаграмма.Период) <> Тип("СтандартныйПериод") 
		ИЛИ НачалоМесяца(ДобавленнаяДиаграмма.Период.ДатаНачала) = НачалоМесяца(ДобавленнаяДиаграмма.Период.ДатаОкончания);
	ПериодСравненияВПределахМесяца = ТипЗнч(ДобавленнаяДиаграмма.ПериодСравнения) <> Тип("СтандартныйПериод") 
		ИЛИ НачалоМесяца(ДобавленнаяДиаграмма.ПериодСравнения.ДатаНачала) = НачалоМесяца(ДобавленнаяДиаграмма.ПериодСравнения.ДатаОкончания);
	Если ИмяТочки = "Месяц" Тогда
		Если ПериодВПределахГода И ПериодСравненияВПределахГода Тогда
			Возврат "ДФ=МММ";
		КонецЕсли;
	ИначеЕсли ИмяТочки = "День" Тогда
		Если ПериодВПределахМесяца И ПериодСравненияВПределахМесяца Тогда
			Возврат "ДФ=д";
		ИначеЕсли ПериодВПределахГода И ПериодСравненияВПределахГода Тогда
			Возврат "ДФ='д МММ'";
		КонецЕсли;
	КонецЕсли; 
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ВывестиОшибкуДиаграммы(ОбъектДиаграмма, ИнформацияОбОшибке)
	
	ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	ПодробноеПредставлениеОшибки = НСтр("ru = 'Ошибка при формировании:'") + Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	Если ПустаяСтрока(ОписаниеОшибки) Тогда
		ОписаниеОшибки = ПодробноеПредставлениеОшибки;
	КонецЕсли;
	
	ОбъектДиаграмма.ОтображатьЗаголовок = Истина;
	ОбъектДиаграмма.ОбластьЗаголовка.Текст = ОписаниеОшибки;
	ОбъектДиаграмма.ОбластьЗаголовка.ЦветТекста = ЦветаПалитры.Красный;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыДиаграммы()
	
	// Создание реквизитов формы
	МассивРеквизитов = Новый Массив;
	Для каждого Стр Из ДобавленныеДиаграммы Цикл
		Если НЕ ПустаяСтрока(Стр.ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		Стр.ИмяРеквизита = "Диаграмма"+СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Стр.ИмяРеквизита, Новый ОписаниеТипов("Диаграмма")));
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	Для каждого Стр Из ДобавленныеДиаграммы Цикл
		СтрокаНастройки = НастройкиДиаграмм.НайтиПоИдентификатору(Число(Стр.ИдентификаторСтрокиНастроек));
		//@skip-check module-unused-local-variable
		ОписаниеТочки = СтрокаНастройки.Точки[Стр.Точка];
		ОписаниеСерии = СтрокаНастройки.Серии[Стр.Серия];
		Если ПустаяСтрока(Стр.ИмяГруппы) Тогда
			
			// Новое распределение по колонкам
			Если Стр.НомерКолонки = 1 Тогда
				РодительскаяГруппа = Элементы.ГруппаДиаграммыЛево;
				Стр.ИмяРодительскойГруппы = Элементы.ГруппаДиаграммыЛево.Имя;
			Иначе
				РодительскаяГруппа = Элементы.ГруппаДиаграммыПраво;
				Стр.ИмяРодительскойГруппы = Элементы.ГруппаДиаграммыПраво.Имя;
			КонецЕсли;
			
			Если ЭтоМобильныйКлиент Тогда
				РодительскаяГруппа = Элементы.ГруппаДиаграммыЛево;
			КонецЕсли;
			
			Стр.ИмяГруппы = "Диаграмма"+СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
			Группа = Элементы.Добавить(Стр.ИмяГруппы, Тип("ГруппаФормы"), РодительскаяГруппа);
			Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			Группа.ОтображатьЗаголовок = Ложь;
			Группа.ОтображатьКакКарточку = Истина;
			Группа.РастягиватьПоВертикали = Ложь;
			Группа.Высота = 20;
			Группа.РастягиватьПоГоризонтали = Истина;
			Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаЗаголовка = Элементы.Добавить(Стр.ИмяГруппы+"_ГруппаЗаголовка", Тип("ГруппаФормы"), Группа);
			ГруппаЗаголовка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаЗаголовка.ОтображатьЗаголовок = Ложь;
			ГруппаЗаголовка.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаЗаголовка.РастягиватьПоВертикали = Ложь;
			ГруппаЗаголовка.РастягиватьПоГоризонтали = Истина;
			ГруппаЗаголовка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ЭлементЗаголовок = Элементы.Добавить(Стр.ИмяГруппы+"_Заголовок", Тип("ДекорацияФормы"), ГруппаЗаголовка);
			ЭлементЗаголовок.Вид = ВидДекорацииФормы.Надпись;
			ЭлементЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
			ЭлементЗаголовок.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Низ;
			ЭлементЗаголовок.Шрифт = ШрифтыСтиля.ЗаголовокВторогоУровня;
			ЭлементДиаграмма = Элементы.Добавить(Стр.ИмяГруппы+"_Диаграмма", Тип("ПолеФормы"), Группа);
			ЭлементДиаграмма.Вид = ВидПоляФормы.ПолеДиаграммы;
			ЭлементДиаграмма.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ЭлементДиаграмма.ПутьКДанным = Стр.ИмяРеквизита;
			ЭлементДиаграмма.Высота = 7;
			ЭлементДиаграмма.УстановитьДействие("Выбор", "Подключаемый_ДиаграммаВыбор");
			// Контекстное меню
			ДобавитьКоманду(Стр.ИмяГруппы, "_Настроить", ЭлементДиаграмма, "КонтекстНастроитьДиаграмму", НСтр("ru = 'Настроить график'"), БиблиотекаКартинок.ПульсБизнесаНастройкаПоказателя);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Удалить", ЭлементДиаграмма, "КонтекстУдалитьДиаграмму", НСтр("ru = 'Удалить график'"), БиблиотекаКартинок.ПульсБизнесаУдалитьПоказатель);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вверх", ЭлементДиаграмма, "КонтекстСместитьВверхДиаграмму", НСтр("ru = 'Сместить вверх'"), БиблиотекаКартинок.ПульсБизнесаСместитьВверх);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вниз", ЭлементДиаграмма, "КонтекстСместитьВнизДиаграмму", НСтр("ru = 'Сместить вниз'"), БиблиотекаКартинок.ПульсБизнесаСместитьВниз);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Расшифровать", ЭлементДиаграмма, "КонтекстРасшифроватьДиаграмму", НСтр("ru = 'Расшифровать'"), БиблиотекаКартинок.ЛупаГлобальногоПоиска);
			// Контекстное меню заголовка
			ДобавитьКоманду(Стр.ИмяГруппы, "_Настроить", ЭлементЗаголовок, "КонтекстНастроитьДиаграмму", НСтр("ru = 'Настроить график'"), БиблиотекаКартинок.ПульсБизнесаНастройкаПоказателя);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Удалить", ЭлементЗаголовок, "КонтекстУдалитьДиаграмму", НСтр("ru = 'Удалить график'"), БиблиотекаКартинок.ПульсБизнесаУдалитьПоказатель);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вверх", ЭлементЗаголовок, "КонтекстСместитьВверхДиаграмму", НСтр("ru = 'Сместить вверх'"), БиблиотекаКартинок.ПульсБизнесаСместитьВверх);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вниз", ЭлементЗаголовок, "КонтекстСместитьВнизДиаграмму", НСтр("ru = 'Сместить вниз'"), БиблиотекаКартинок.ПульсБизнесаСместитьВниз);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Расшифровать", ЭлементЗаголовок, "КонтекстРасшифроватьДиаграмму", НСтр("ru = 'Расшифровать'"), БиблиотекаКартинок.ЛупаГлобальногоПоиска);
			
			ДобавитьКомандыДиаграммы(Стр);
			
		Иначе
			Группа = Элементы[Стр.ИмяГруппы];
			ЭлементДиаграмма = Элементы[Стр.ИмяГруппы+"_Диаграмма"];
			ЭлементЗаголовок = Элементы[Стр.ИмяГруппы+"_Заголовок"];
		КонецЕсли;
		
		ЭлементЗаголовок.Заголовок = Стр.Представление;
		ОбъектДиаграмма = ЭтотОбъект[Стр.ИмяРеквизита];
		ОбъектДиаграмма.Обновление = Ложь;
		ОбъектДиаграмма.ТипДиаграммы = ОписаниеСерии.ТипДиаграммы;
		ОбъектДиаграмма.ОтображатьЗаголовок = Ложь;
		
		ШрифтДиаграммы = ШрифтыСтиля.ПодзаголовокПервогоУровня;
		ОбъектДиаграмма.ОбластьЛегенды.Шрифт = ШрифтДиаграммы;
		ОбъектДиаграмма.ОбластьПостроения.Шрифт = ШрифтДиаграммы;
		ОбъектДиаграмма.ОбластьПостроения.Низ = 0.99;
		
		Если ЭтоКруговаяДиаграмма(ОписаниеСерии.ТипДиаграммы) Тогда
			ОбъектДиаграмма.ОбластьПостроения.Право = 0.55;
			ОбъектДиаграмма.ОбластьЛегенды.Лево = 0.58;
			//@skip-check bsl-legacy-check-dynamic-feature-access
			ОбъектДиаграмма.МаксимумСерий = МаксимумСерий.Ограничено;
			ОбъектДиаграмма.МаксимумСерийКоличество = 10;
		ИначеЕсли ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.ГрафикСОбластямиИНакоплением Тогда
			ОбъектДиаграмма.ОбластьПостроения.Право = 0.75;
			ОбъектДиаграмма.ОбластьЛегенды.Лево = 0.78;
			ОбъектДиаграмма.АвтоУстановкаТекстаСерий = Ложь;
			ОбъектДиаграмма.ОбластьПостроения.ОтображатьПодписиШкалыТочек = Ложь;
			ОбъектДиаграмма.ОбластьПостроения.ОтображатьЛинииЗначенийШкалы = Ложь;
			ОбъектДиаграмма.РежимСглаживания = РежимСглаживанияДиаграммы.ГладкаяКривая;
		Иначе
			Если НЕ ЭтоГистограммаСНакоплением(ОписаниеСерии.ТипДиаграммы) Тогда
				//@skip-check bsl-legacy-check-dynamic-feature-access
				ОбъектДиаграмма.РежимПробелов = РежимПробеловДиаграммы.Нет;
			КонецЕсли; 
			ОбъектДиаграмма.ОбластьПостроения.ОтображатьЛинииЗначенийШкалы = Ложь;
		КонецЕсли;
		
		ОбъектДиаграмма.Анимация = АнимацияДиаграммы.НеИспользовать;
		
		ОбъектДиаграмма.Обновление = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоКруговаяДиаграмма(Тип)
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Возврат (Тип=ТипДиаграммы.Круговая ИЛИ Тип=ТипДиаграммы.КруговаяОбъемная);	
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоГистограммаСНакоплением(Тип)
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Возврат (Тип=ТипДиаграммы.ГистограммаСНакоплением ИЛИ Тип=ТипДиаграммы.ГистограммаСНакоплениемОбъемная);	
	
КонецФункции 

&НаСервере
Процедура НаполнитьСлучайнымиДанными(ОбъектДиаграмма, ТаблицаЗначений, ОписаниеТочки, ОписаниеСерии)
	
	Генератор = Новый ГенераторСлучайныхЧисел;
	СуммаБазовая = 100;
	Если ТаблицаЗначений.Количество()>0 Тогда
		Для каждого СтруктураЗначения Из ТаблицаЗначений Цикл
			СуффиксСравнения = ?(СтруктураЗначения.ДляСравнения, НСтр("ru = ' (сравнение)'"), "");
			Если Не ПустаяСтрока(ОписаниеТочки.Формат) Тогда
				Точка = ОбъектДиаграмма.УстановитьТочку(Формат(СтруктураЗначения.Точка, ОписаниеТочки.Формат)+СуффиксСравнения);
			Иначе
				Точка = ОбъектДиаграмма.УстановитьТочку(
				?(НЕ ЗначениеЗаполнено(СтруктураЗначения.Точка), 
				НСтр("ru = '<не заполнено>'")+СуффиксСравнения, 
				Строка(СтруктураЗначения.Точка)+СуффиксСравнения));
			КонецЕсли; 
			Серия = ОбъектДиаграмма.УстановитьСерию(НСтр("ru = 'Пример 1'"));
			ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, Генератор.СлучайноеЧисло(0, 100));
			Если ЭтоГистограммаСНакоплением(ОписаниеСерии.ТипДиаграммы) Тогда
				Серия = ОбъектДиаграмма.УстановитьСерию(НСтр("ru = 'Пример 2'"));
				ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, Генератор.СлучайноеЧисло(0, 30));
			КонецЕсли; 
		КонецЦикла; 
	Иначе
		Для ии = 1 По 8 Цикл
			Если ЭтоКруговаяДиаграмма(ОписаниеСерии.ТипДиаграммы) Тогда
				СуммаБазовая = Окр(СуммаБазовая*(100-Генератор.СлучайноеЧисло(0, 30))/100, 2);
				Точка = ОбъектДиаграмма.УстановитьТочку(НСтр("ru = 'Пример 1'"));
				//@skip-check bsl-nstr-string-literal-format
				Серия = ОбъектДиаграмма.УстановитьСерию(НСтр("ru = 'Пример '")+ии);
				ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, СуммаБазовая);
			Иначе
				//@skip-check bsl-nstr-string-literal-format
				Точка = ОбъектДиаграмма.УстановитьТочку(НСтр("ru = 'Пример '")+ии);
				Серия = ОбъектДиаграмма.УстановитьСерию(НСтр("ru = 'Пример 1'"));
				ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, Генератор.СлучайноеЧисло(0, 100));
				Если ЭтоГистограммаСНакоплением(ОписаниеСерии.ТипДиаграммы) Тогда
					Серия = ОбъектДиаграмма.УстановитьСерию(НСтр("ru = 'Пример 2'"));
					ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, Генератор.СлучайноеЧисло(0, 30));
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
	ОбъектДиаграмма.ОтображатьЗаголовок = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПустаяДиаграмма(Данные)
	
	Для каждого Стр Из Данные Цикл
		Если ТипЗнч(Стр.Точка)=Тип("Число") И ЗначениеЗаполнено(Стр.Точка) Тогда
			Возврат Ложь;
		КонецЕсли; 
		Для ии = 1 По Стр.КоличествоСерий Цикл
			Если ТипЗнч(Стр["Серия"+ии])=Тип("Число") И ЗначениеЗаполнено(Стр["Серия"+ии]) Тогда
				Возврат Ложь;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 
	Возврат Истина;
	
КонецФункции

// Процедура постобработки диаграмм. Устанавливает цвета серий и толщину линий
//
// Параметры:
//  Диаграмма				 - диаграмма - обрабатываемая диаграмма
//  ЕстьДанныеДляОтображения - булево	 - признак наличия/отсутствия данных
//  ЦветаСерий				 - массив	 - массив цветов в соответствии с которым назначаются цвета. Если не задан, то назначаются по умолчанию
//@skip-check doc-comment-collection-item-type
&НаСервереБезКонтекста
Процедура УстановитьОтображениеДиаграммы(Диаграмма, ЕстьДанныеДляОтображения, ЦветаСерий = Неопределено)
	
	Диаграмма.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, 0);
	Диаграмма.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
	Диаграмма.ОбластьЗаголовка.ПрозрачныйФон = Истина;
	Диаграмма.ОбластьПостроения.ПрозрачныйФон = Истина;
	Диаграмма.ОбластьЛегенды.ПрозрачныйФон = Истина;
	
	Диаграмма.ОбластьПостроения.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
	Диаграмма.ОбластьЛегенды.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
	Диаграмма.ОбластьЗаголовка.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
		
	Если ЦветаСерий = Неопределено Тогда
		ЦветаСерий = РаботаСЦветомСервер.ЦветаСерийДиаграмм();
	КонецЕсли;
	ЦветаСерийНетДанных = РаботаСЦветомКлиентСервер.ЦветаСерийДиаграмм();
	
	Диаграмма.СводнаяСерия.Цвет = ЦветаСтиля.ЦветДиаграммыОтсутствующиеДанные;
	Диаграмма.СводнаяСерия.Текст = НСтр("ru = 'Прочее'");
	
	// Если точек на диаграмме меньше, то серии рисуем толстой линией, если больше - то тонкой
	МаксТочекДиаграммыСТолстойЛинией = 10;
	
	ТонкаяЛиния = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
	ТолстаяЛиния = Новый Линия(ТипЛинииДиаграммы.Сплошная, 2);
	
	Для ИндексСерии = 0 По Диаграмма.Серии.Количество() - 1 Цикл
		
		Серия = Диаграмма.Серии[ИндексСерии];
		
		Если Серия.Цвет=ЦветаСтиля.ЦветДиаграммыОтсутствующиеДанные Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ЕстьДанныеДляОтображения И ИндексСерии<ЦветаСерий.Количество() Тогда
			Серия.Цвет = ЦветаСерий[ИндексСерии];
		ИначеЕсли НЕ ЕстьДанныеДляОтображения И ИндексСерии<ЦветаСерий.Количество() Тогда
			ЦветБазовый = ЦветаСерийНетДанных[ИндексСерии];
			//@skip-check new-color
			ЦветСерии = Новый Цвет(
			ЦветБазовый.Красный+(255-ЦветБазовый.Красный)/2,
			ЦветБазовый.Зеленый+(255-ЦветБазовый.Зеленый)/2,
			ЦветБазовый.Синий+(255-ЦветБазовый.Синий)/2);
			Серия.Цвет = ЦветСерии;
		Иначе
			Серия.Цвет = ЦветаСтиля.ЦветДиаграммыОтсутствующиеДанные;
		КонецЕсли;
		
		Если Диаграмма.Точки.Количество() > МаксТочекДиаграммыСТолстойЛинией Тогда
			Серия.Линия = ТонкаяЛиния;
		Иначе
			Серия.Линия = ТолстаяЛиния;
		КонецЕсли;
		
	КонецЦикла;
	
	Диаграмма.ОбластьЗаголовка.Лево = 0;
	Диаграмма.ОбластьЗаголовка.Право = 1;
	Диаграмма.ОбластьЗаголовка.Верх = 0;
	Диаграмма.ОбластьЗаголовка.Низ = 1;
	Диаграмма.ОбластьПостроения.Верх = 0.01;
	Диаграмма.ОбластьЛегенды.Верх = 0.01;
	Диаграмма.ОбластьЛегенды.Прокрутка = (Диаграмма.Серии.Количество()>5);
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Диаграмма.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Низ;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьДиаграмму(Идентификатор)
	
	ТекСтр = ДобавленныеДиаграммы.НайтиПоИдентификатору(Идентификатор);
	СтрНастроек = НастройкиДиаграмм.НайтиПоИдентификатору(Число(ТекСтр.ИдентификаторСтрокиНастроек));
	
	НестандартнаяРасшифровкаДиаграмм = НестандартнаяРасшифровкаДиаграмм(ТекСтр);	
	Если НестандартнаяРасшифровкаДиаграмм = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрНастроек.Вариант) Тогда
		Возврат;
	КонецЕсли;
	ВариантОтчета = ВариантОтчетаПоПолномуИмени(СтрНастроек.Вариант);
	Если ВариантОтчета = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ОтборРасшифровки = Новый Структура;
	Если СтрНастроек.Остаток Тогда
		Если ТипЗнч(ТекСтр.Период) = Тип("СтандартнаяДатаНачала") Тогда
			ПериодРасшифровки = НачалоДня(ТекСтр.Период.Дата) - 1;
		ИначеЕсли ТипЗнч(ТекСтр.Период) = Тип("Структура") Тогда
			ОбновитьДату(ТекСтр.Период);
			ПериодРасшифровки = НачалоДня(ТекСтр.Период.Дата) - 1;
		Иначе
			ПериодРасшифровки = '0001-01-01';
		КонецЕсли;                                     
		ЗаполнитьПериодРасшифровки(ТекСтр, ОтборРасшифровки, ПериодРасшифровки)
	Иначе
		Если ТипЗнч(ТекСтр.Период)=Тип("СтандартныйПериод") Тогда
			ДатаНачалаРасшифровки = НачалоДня(ТекСтр.Период.ДатаНачала);
			ДатаКонцаРасшифровки = ?(ЗначениеЗаполнено(ТекСтр.Период.ДатаОкончания), 
				КонецДня(ТекСтр.Период.ДатаОкончания), '0001-01-01');
		ИначеЕсли ТипЗнч(ТекСтр.Период)=Тип("Структура") Тогда
			ОбновитьДатыНачалаИКонцаПериода(ТекСтр.Период);
			ДатаНачалаРасшифровки = НачалоДня(ТекСтр.Период.ДатаНачала);
			ДатаКонцаРасшифровки = ?(ЗначениеЗаполнено(ТекСтр.Период.ДатаОкончания), 
				КонецДня(ТекСтр.Период.ДатаОкончания), '0001-01-01');
		Иначе
			ДатаНачалаРасшифровки = '0001-01-01';
			ДатаКонцаРасшифровки = '0001-01-01';
		КонецЕсли; 
		ПериодОтчета = Новый СтандартныйПериод(ДатаНачалаРасшифровки, ДатаКонцаРасшифровки);
		ОтборРасшифровки.Вставить("ПериодРасшифровки", ПериодОтчета);
	КонецЕсли;
	Если ТипЗнч(ТекСтр.Фильтры) = Тип("ФиксированныйМассив") Тогда
		Для каждого Фильтр Из ТекСтр.Фильтры Цикл
			Если СтрНайти(Фильтр.Поле, ".") > 0 Тогда 
				ПреобразоватьОтборЧерезТочку(ТекСтр,Фильтр,ОтборРасшифровки);
				Продолжить;
			КонецЕсли;
			СтруктураЗначения = Новый Структура;
			СтруктураЗначения.Вставить("ВидСравнения", Фильтр.ВидСравнения);
			СтруктураЗначения.Вставить("ПравоеЗначение", Фильтр.Значение);
			ОтборРасшифровки.Вставить(Фильтр.Поле, СтруктураЗначения);
		КонецЦикла; 
	КонецЕсли; 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("Отбор", ОтборРасшифровки);
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, ВариантОтчета, ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуДиаграммыСервер()
	
	СохранитьНастройки("Диаграммы");
	СоздатьЭлементыДиаграммы();
	
КонецПроцедуры

&НаКлиенте
Функция НестандартнаяРасшифровкаДиаграмм(ТекСтр)
	
	Если СтрНайти(ТекСтр.Диаграмма, "Задач") <> 0  Тогда
		ОткрытьФорму("Обработка.КонтактЦентр.Форма.Форма");
		Возврат Истина;
	Иначе
		Возврат Ложь;     
	КонецЕсли;    
	
КонецФункции  

&НаКлиенте
Процедура ЗаполнитьПериодРасшифровки(ТекСтр,ОтборРасшифровки,ПериодРасшифровки)
	
	Если СтрНайти(ТекСтр.ВходитВГруппу, "CRM") <> 0 Тогда       
		ПериодОтчета = Новый СтандартныйПериод('0001-01-01', ПериодРасшифровки);
		ОтборРасшифровки.Вставить("ПериодРасшифровки", ПериодОтчета);
	Иначе	
		ОтборРасшифровки.Вставить("ДатаРасшифровки", НачалоДня(ПериодРасшифровки));  
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеГруппыДиаграмм(Диаграмма)
	
	Если Не ЗначениеЗаполнено(Диаграмма) Тогда
		Возврат "";
	КонецЕсли;
	
	Строки = НастройкиДиаграмм.НайтиСтроки(Новый Структура("Диаграмма", Диаграмма));
	Если Строки.Количество() <> 1 Тогда
		Возврат "";
	Иначе
		Возврат Строки[0].Представление;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПреобразоватьОтборЧерезТочку(ТекСтр,Фильтр,ОтборРасшифровки)
	
	Если СтрНайти(ТекСтр.Диаграмма, "ЗаказыПокупателя") <> 0 Тогда 
		Если СтрНайти(Фильтр.Поле, "РегистрОплатаСчетовИЗаказов") = 0 Тогда
			Возврат;
		КонецЕсли;
		СтруктураЗначения = Новый Структура;
		СтруктураЗначения.Вставить("ВидСравнения", Фильтр.ВидСравнения);
		СтруктураЗначения.Вставить("ПравоеЗначение", Фильтр.Значение);
		ОтборРасшифровки.Вставить(Сред(Фильтр.Поле, СтрНайти(Фильтр.Поле, ".") + 1), СтруктураЗначения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Периоды

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеСтандартногоПериода(Период, ПериодОснование = Неопределено)
	
	Если ТипЗнч(Период)=Тип("Структура") Тогда
		ОбновитьДатыНачалаИКонцаПериода(Период, ПериодОснование);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Возврат НСтр("ru = 'Не сравнивать'");
	ИначеЕсли Период.Вариант=ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) Тогда
			//@skip-check bsl-nstr-string-literal-format
			Возврат НСтр("ru = 'до '")+Формат(Период.ДатаОкончания, "ДЛФ=D");
		ИначеЕсли НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			//@skip-check bsl-nstr-string-literal-format
			Возврат НСтр("ru = 'от '")+Формат(Период.ДатаНачала, "ДЛФ=D");
		Иначе
			Возврат ПредставлениеПериода(НачалоДня(Период.ДатаНачала), ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), Период.ДатаОкончания));
		КонецЕсли; 
	ИначеЕсли Период.Вариант="ПредыдущийПлавающийПериод" Тогда
		Возврат НСтр("ru = 'Предыдущий период ('")+ПредставлениеПериода(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания))+")";
	ИначеЕсли Период.Вариант="ЗаПрошлыйГод" Тогда
		Возврат НСтр("ru = 'За прошлый год ('")+ПредставлениеПериода(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания))+")";
	ИначеЕсли Период.Вариант="Последние7ДнейНеСчитаяТекущего" Тогда
		Возврат НСтр("ru = 'Последние 7 дней, не считая текущего'");
	Иначе
		Возврат Строка(Период);
	КонецЕсли; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеСтандартнойДатыНачала(Дата, ДатаСравнения = Неопределено)
	
	Если ТипЗнч(Дата)=Тип("Структура") Тогда
		ОбновитьДату(Дата, ДатаСравнения);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат НСтр("ru = 'Не сравнивать'");
	ИначеЕсли Дата.Вариант=ВариантСтандартнойДатыНачала.ПроизвольнаяДата Тогда
		Возврат Формат(Дата.Дата, "ДФ=dd.MM.yyyy");
	ИначеЕсли Дата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоДня Тогда
		Возврат НСтр("ru = 'Сегодня, на начало дня'");
	ИначеЕсли Дата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоДня Тогда
		Возврат НСтр("ru = 'Всегда актуально'");
	ИначеЕсли Дата.Вариант="ТакойЖеДеньНаПрошлойНеделе" Тогда
		Возврат НСтр("ru = 'Такой же день на прошлой неделе ('")+Формат(Дата.Дата, "ДФ='dd.MM.yyyy, ддд'")+")";
	ИначеЕсли Дата.Вариант="ТакойЖеДеньВПрошломМесяце" Тогда
		Возврат НСтр("ru = 'Такой же день прошлого месяца ('")+Формат(Дата.Дата, "ДФ='dd.MM.yyyy, ддд'")+")";
	ИначеЕсли Дата.Вариант="ТакойЖеДеньВПрошломГоду" Тогда
		Возврат НСтр("ru = 'Такой же день в прошлом году ('")+Формат(Дата.Дата, "ДФ='dd.MM.yyyy'")+")";
	Иначе
		Возврат Строка(Дата);
	КонецЕсли; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредыдущаяДата(Знач СтандартнаяДата, ТипДаты)
	
	Если ПустаяСтрока(ТипДаты) ИЛИ ТипДаты="День" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата-3600*24;
	ИначеЕсли ТипДаты="Неделя" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата-3600*24*7;
	ИначеЕсли ТипДаты="Декада" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата-3600*24*10;
	ИначеЕсли ТипДаты="Месяц" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, -1);
	ИначеЕсли ТипДаты="Квартал" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, -3);
	ИначеЕсли ТипДаты="Полугодие" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, -6);
	ИначеЕсли ТипДаты="Год" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, -12);
	КонецЕсли; 	
	
	Возврат СтандартнаяДата;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция СледующаяДата(Знач СтандартнаяДата, ТипДаты)
	
	Если ПустаяСтрока(ТипДаты) ИЛИ ТипДаты="День" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата+3600*24;
	ИначеЕсли ТипДаты="Неделя" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата+3600*24*7;
	ИначеЕсли ТипДаты="Декада" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата+3600*24*10;
	ИначеЕсли ТипДаты="Месяц" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, 1);
	ИначеЕсли ТипДаты="Квартал" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, 3);
	ИначеЕсли ТипДаты="Полугодие" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, 6);
	ИначеЕсли ТипДаты="Год" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, 12);
	КонецЕсли; 	
	
	Возврат СтандартнаяДата;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ПредыдущийПериод(Знач СтандартныйПериод, ТипПериода)
	
	Если ТипЗнч(СтандартныйПериод)=Тип("Структура") Тогда
		ОбновитьДатыНачалаИКонцаПериода(СтандартныйПериод);
	КонецЕсли; 
	
	Если ПустаяСтрока(ТипПериода) Тогда
		КоличествоДней = (НачалоДня(СтандартныйПериод.ДатаОкончания)-НачалоДня(СтандартныйПериод.ДатаНачала))/86400+1;
		Результат = Новый СтандартныйПериод(
		НачалоДня(СтандартныйПериод.ДатаНачала)-КоличествоДней*86400,
		НачалоДня(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="День" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоДня(СтандартныйПериод.ДатаНачала)-86400,
		НачалоДня(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="Неделя" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоНедели(НачалоНедели(СтандартныйПериод.ДатаНачала)-1),
		НачалоНедели(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="Декада" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоДекады(СтандартныйПериод.ДатаНачала-10*86400),
		НачалоДекады(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="Месяц" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоМесяца(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -1)),
		КонецМесяца(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -1)));
	ИначеЕсли ТипПериода="Квартал" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоКвартала(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -3)),
		КонецКвартала(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -3)));
	ИначеЕсли ТипПериода="Полугодие" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоПолугодия(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -6)),
		КонецПолугодия(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -6)));
	ИначеЕсли ТипПериода="Год" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоГода(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -12)),
		КонецГода(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -12)));
	ИначеЕсли ТипПериода="ДоКонцаНедели" Тогда 
		Результат = Новый СтандартныйПериод(
		СтандартныйПериод.ДатаНачала-7*86400,
		НачалоНедели(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="СНачалаНедели" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоНедели(НачалоНедели(СтандартныйПериод.ДатаНачала)-1),
		СтандартныйПериод.ДатаОкончания-7*86400);
	ИначеЕсли ТипПериода="ДоКонцаДекады" Тогда
		ДеньДекады = ДеньДекады(СтандартныйПериод.ДатаНачала);
		НачалоДекады = НачалоДекады(НачалоДекады(СтандартныйПериод.ДатаНачала)-1);
		ДатаНачала = НачалоДекады+(ДеньДекады-1)*86400;
		Если НачалоДекады(ДатаНачала)<>НачалоДекады Тогда
			ДатаНачала = НачалоДня(КонецДекады(НачалоДекады));
		КонецЕсли; 
		Результат = Новый СтандартныйПериод(
		ДатаНачала,
		НачалоДекады(НачалоДекады));
	ИначеЕсли ТипПериода="СНачалаДекады" Тогда 
		ДеньДекады = ДеньДекады(СтандартныйПериод.ДатаОкончания);
		НачалоДекады = НачалоДекады(НачалоДекады(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = КонецДня(НачалоДекады+(ДеньДекады-1)*86400);
		Если НачалоДекады(ДатаОкончания)<>НачалоДекады Тогда
			ДатаОкончания = КонецДекады(НачалоДекады);
		КонецЕсли; 
		Результат = Новый СтандартныйПериод(
		НачалоДекады,
		ДатаОкончания);
	ИначеЕсли ТипПериода="ДоКонцаМесяца" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -1),
		НачалоМесяца(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="СНачалаМесяца" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоМесяца(НачалоМесяца(СтандартныйПериод.ДатаНачала)-1),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, -1));
	ИначеЕсли ТипПериода="ДоКонцаКвартала" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -3),
		НачалоКвартала(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="СНачалаКвартала" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоКвартала(НачалоКвартала(СтандартныйПериод.ДатаНачала)-1),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, -3));
	ИначеЕсли ТипПериода="ДоКонцаПолугодия" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -6),
		НачалоПолугодия(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="СНачалаПолугодия" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоПолугодия(НачалоПолугодия(СтандартныйПериод.ДатаНачала)-1),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, -6));
	ИначеЕсли ТипПериода="ДоКонцаГода" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -12),
		НачалоГода(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="СНачалаГода" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоГода(НачалоГода(СтандартныйПериод.ДатаНачала)-1),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, -12));
	ИначеЕсли ТипПериода="ЗаПрошлыйГод" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -12),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, -12));
	КонецЕсли; 	 	
	
	Возврат Результат;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция СледующийПериод(Знач СтандартныйПериод, ТипПериода)
	
	Если ТипЗнч(СтандартныйПериод)=Тип("Структура") Тогда
		ОбновитьДатыНачалаИКонцаПериода(СтандартныйПериод);
	КонецЕсли; 
	
	Если ПустаяСтрока(ТипПериода) Тогда
		КоличествоДней = (НачалоДня(СтандартныйПериод.ДатаОкончания)-НачалоДня(СтандартныйПериод.ДатаНачала))/86400+1;
		Результат = Новый СтандартныйПериод(
		КонецДня(СтандартныйПериод.ДатаОкончания)+1,
		КонецДня(СтандартныйПериод.ДатаОкончания)+КоличествоДней*86400);
	ИначеЕсли ТипПериода="День" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецДня(СтандартныйПериод.ДатаОкончания)+1,
		КонецДня(СтандартныйПериод.ДатаОкончания)+86400);
	ИначеЕсли ТипПериода="Неделя" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецНедели(СтандартныйПериод.ДатаОкончания)+1,
		КонецНедели(КонецНедели(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="Декада" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецДекады(СтандартныйПериод.ДатаОкончания)+1,
		КонецДекады(КонецДекады(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="Месяц" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоМесяца(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 1)),
		КонецМесяца(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 1)));
	ИначеЕсли ТипПериода="Квартал" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоКвартала(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 3)),
		КонецКвартала(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 3)));
	ИначеЕсли ТипПериода="Полугодие" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоПолугодия(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 6)),
		КонецПолугодия(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 6)));
	ИначеЕсли ТипПериода="Год" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоГода(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 12)),
		КонецГода(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 12)));
	ИначеЕсли ТипПериода="ДоКонцаНедели" Тогда 
		Результат = Новый СтандартныйПериод(
		СтандартныйПериод.ДатаНачала+7*86400,
		КонецНедели(КонецНедели(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="СНачалаНедели" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецНедели(СтандартныйПериод.ДатаОкончания)+1,
		СтандартныйПериод.ДатаОкончания+7*86400);
	ИначеЕсли ТипПериода="ДоКонцаДекады" Тогда
		ДеньДекады = ДеньДекады(СтандартныйПериод.ДатаНачала);
		НачалоДекады = КонецДекады(СтандартныйПериод.ДатаОкончания)+1;
		ДатаНачала = НачалоДекады+(ДеньДекады-1)*86400;
		Если НачалоДекады(ДатаНачала)<>НачалоДекады(НачалоДекады) Тогда
			ДатаНачала = НачалоДня(КонецДекады(НачалоДекады));
		КонецЕсли; 
		Результат = Новый СтандартныйПериод(
		ДатаНачала,
		КонецДекады(НачалоДекады));
	ИначеЕсли ТипПериода="СНачалаДекады" Тогда 
		ДеньДекады = ДеньДекады(СтандартныйПериод.ДатаОкончания);
		НачалоДекады = КонецДекады(СтандартныйПериод.ДатаОкончания)+1;
		ДатаОкончания = КонецДня(НачалоДекады+(ДеньДекады-1)*86400);
		Если НачалоДекады(ДатаОкончания)<>НачалоДекады(НачалоДекады) Тогда
			ДатаОкончания = КонецДекады(НачалоДекады);
		КонецЕсли; 
		Результат = Новый СтандартныйПериод(
		НачалоДекады,
		ДатаОкончания);
	ИначеЕсли ТипПериода="ДоКонцаМесяца" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, 1),
		КонецМесяца(КонецМесяца(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="СНачалаМесяца" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецМесяца(СтандартныйПериод.ДатаНачала)+1,
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 1));
	ИначеЕсли ТипПериода="ДоКонцаКвартала" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, 3),
		КонецКвартала(КонецКвартала(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="СНачалаКвартала" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецКвартала(СтандартныйПериод.ДатаОкончания)+1,
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 3));
	ИначеЕсли ТипПериода="ДоКонцаПолугодия" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, 6),
		КонецПолугодия(КонецПолугодия(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="СНачалаПолугодия" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецПолугодия(СтандартныйПериод.ДатаОкончания)+1,
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 6));
	ИначеЕсли ТипПериода="ДоКонцаГода" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, 12),
		КонецГода(КонецГода(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="СНачалаГода" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецГода(СтандартныйПериод.ДатаОкончания)+1,
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 12));
	ИначеЕсли ТипПериода="ЗаПрошлыйГод" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, 12),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 12));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДатыНачалаИКонцаПериода(СтандартныйПериод, ПериодОснование = Неопределено)

	Если НЕ ТипЗнч(СтандартныйПериод)=Тип("Структура") Тогда
		Возврат;
	КонецЕсли; 
	ТекДатаСеанса = ТекДатаСеанса();
	Если СтандартныйПериод.Вариант="Последние7ДнейНеСчитаяТекущего" Тогда
		СтандартныйПериод.Вставить("ДатаНачала", НачалоДня(ТекДатаСеанса)-86400*7);
		СтандартныйПериод.Вставить("ДатаОкончания", НачалоДня(ТекДатаСеанса)-1);
	ИначеЕсли СтандартныйПериод.Вариант="ЗаПрошлыйГод" И ПериодОснование<>Неопределено Тогда
		Период = УправлениеНебольшойФирмойКлиентСервер.АналогичныйПериодПрошлогоГода(ПериодОснование);
		СтандартныйПериод.Вставить("ДатаНачала", Период.ДатаНачала);
		СтандартныйПериод.Вставить("ДатаОкончания", Период.ДатаОкончания);
	ИначеЕсли СтандартныйПериод.Вариант="ПредыдущийПлавающийПериод" И ПериодОснование<>Неопределено Тогда
		Период = УправлениеНебольшойФирмойКлиентСервер.ПредыдущийПлавающийПериод(ПериодОснование);
		СтандартныйПериод.Вставить("ДатаНачала", Период.ДатаНачала);
		СтандартныйПериод.Вставить("ДатаОкончания", Период.ДатаОкончания);
	КонецЕсли; 	
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДату(СтандартнаяДата, ДатаСравнения = Неопределено)

	Если НЕ ТипЗнч(СтандартнаяДата)=Тип("Структура") Тогда
		Возврат;
	КонецЕсли; 
	ТекДатаСеанса = ТекДатаСеанса();	
	Если СтандартнаяДата.Вариант="ТакойЖеДеньНаПрошлойНеделе" Тогда
		СтандартнаяДата.Вставить("Дата", НачалоДня(ТекДатаСеанса)-86400*7);
	ИначеЕсли СтандартнаяДата.Вариант="ТакойЖеДеньВПрошломМесяце" Тогда
		СтандартнаяДата.Вставить("Дата", ДобавитьМесяц(НачалоДня(ТекДатаСеанса), -1));
	ИначеЕсли СтандартнаяДата.Вариант="ТакойЖеДеньВПрошломГоду" Тогда
		СтандартнаяДата.Вставить("Дата", ДобавитьМесяц(НачалоДня(ТекДатаСеанса), -12));
	КонецЕсли; 	
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ТекДатаСеанса()

	Возврат ТекущаяДатаСеанса();

КонецФункции

// Возвращает начало декады для заданной даты
//
// Параметры:
//    ПараметрДата - Дата - Дата определения начала декады
//
// Возвращаемое значение: 
//    Дата, Неопределено - Дата начала декады
//
&НаСервереБезКонтекста
Функция НачалоДекады(ПараметрДата)
	
	Если ТипЗнч(ПараметрДата)<>Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если День(ПараметрДата) < 11 Тогда
		Возврат Дата(Год(ПараметрДата), Месяц(ПараметрДата), 1);
	КонецЕсли;
	
	Если День(ПараметрДата) < 21 Тогда
		Возврат Дата(Год(ПараметрДата), Месяц(ПараметрДата), 11);
	КонецЕсли;
	
	Возврат Дата(Год(ПараметрДата), Месяц(ПараметрДата), 21);
	
КонецФункции

// Возвращает конец декады для заданной даты
//
// Параметры:
//    ПараметрДата - Дата - Дата определения конца декады
//
// Возвращаемое значение: 
//    Дата, Неопределено - Дата конца декады
//
&НаСервереБезКонтекста
Функция КонецДекады(ПараметрДата)
	
	Если ТипЗнч(ПараметрДата)<>Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если День(ПараметрДата) >= 21 Тогда
		Возврат КонецМесяца(ПараметрДата);
	КонецЕсли;
	
	Если День(ПараметрДата) >= 11 Тогда
		Возврат КонецДня(Дата(Год(ПараметрДата), Месяц(ПараметрДата), 20));
	КонецЕсли;
	
	Возврат КонецДня(Дата(Год(ПараметрДата), Месяц(ПараметрДата), 10));
	
КонецФункции

// Возвращает номер дня декады для заданной даты
//
// Параметры:
//    ПараметрДата - Дата - Дата определения начала декады
//
// Возвращаемое значение: 
//    Число, Неопределено - Номер дня декады
//
&НаСервереБезКонтекста
Функция ДеньДекады(ПараметрДата)
	
	Если ТипЗнч(ПараметрДата)<>Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	День = День(ПараметрДата);
	Если День=31 Тогда
		Возврат 11;
	КонецЕсли; 
	ДеньДекады = День % 10;
	Если ДеньДекады=0 Тогда
		ДеньДекады = 10;
	КонецЕсли; 
	
	Возврат ДеньДекады;
	
КонецФункции

// Возвращает полугодия декады для заданной даты
//
// Параметры:
//    ПараметрДата - Дата - Дата определения начала полугодия
//
// Возвращаемое значение: 
//    Дата, Неопределено - Дата начала полугодия
//
&НаСервереБезКонтекста
Функция НачалоПолугодия(ПараметрДата)
	
	Если ТипЗнч(ПараметрДата)<>Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Месяц(ПараметрДата) < 7 Тогда
		Возврат НачалоГода(ПараметрДата);
	Иначе
		Возврат ДобавитьМесяц(НачалоГода(ПараметрДата), 7);
	КонецЕсли;
	
КонецФункции

// Возвращает конец полугодия для заданной даты
//
// Параметры:
//    ПараметрДата - Дата - Дата определения конца полугодия
//
// Возвращаемое значение: 
//    Дата, Неопределено - Дата конца полугодия
//
&НаСервереБезКонтекста
Функция КонецПолугодия(ПараметрДата)
	
	Если ТипЗнч(ПараметрДата)<>Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Месяц(ПараметрДата) < 7 Тогда
		Возврат КонецМесяца(ДобавитьМесяц(НачалоГода(ПараметрДата), 6));
	Иначе
		Возврат КонецГода(ПараметрДата);
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипДаты(Знач СтандартнаяДата)
	
	Если СтандартнаяДата=Неопределено 
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.ПроизвольнаяДата Тогда
		Возврат "";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоДня
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлогоДня
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоДня Тогда
		Возврат "День";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтойНедели
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлойНедели
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоДня
		ИЛИ СтандартнаяДата.Вариант="ТакойЖеДеньНаПрошлойНеделе" Тогда
		Возврат "Неделя";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтойДекады
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлойДекады
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующейДекады Тогда
		Возврат "Декада";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлогоМесяца
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоМесяца
		ИЛИ СтандартнаяДата.Вариант="ТакойЖеДеньВПрошломМесяце" Тогда
		Возврат "Месяц";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоКвартала
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлогоКвартала
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоКвартала Тогда
		Возврат "Квартал";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоПолугодия
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлогоПолугодия
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоПолугодия Тогда
		Возврат "Полугодие";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоГода
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлогоГода
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоГода
		ИЛИ СтандартнаяДата.Вариант="ТакойЖеДеньВПрошломГоду" Тогда
		Возврат "Год";
	КонецЕсли; 	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипПериода(СтандартныйПериод)
	
	Если СтандартныйПериод=Неопределено
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Последние7Дней
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Следующие7Дней
		ИЛИ СтандартныйПериод.Вариант="Последние7ДнейНеСчитаяТекущего"
		ИЛИ СтандартныйПериод.Вариант="ПредыдущийПлавающийПериод" Тогда
		Возврат "";
	ИначеЕсли СтандартныйПериод.Вариант="ЗаПрошлыйГод" Тогда
		Возврат "ЗаПрошлыйГод";
	ИначеЕсли НачалоНедели(СтандартныйПериод.ДатаНачала)=НачалоНедели(СтандартныйПериод.ДатаОкончания) И
		НачалоНедели(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецНедели(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбрана произвольная неделя целиком
		Возврат "Неделя";
	ИначеЕсли НачалоМесяца(СтандартныйПериод.ДатаНачала)=НачалоМесяца(СтандартныйПериод.ДатаОкончания) И
		НачалоМесяца(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецМесяца(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный месяц целиком
		Возврат "Месяц";
	ИначеЕсли НачалоКвартала(СтандартныйПериод.ДатаНачала)=НачалоКвартала(СтандартныйПериод.ДатаОкончания) И
		НачалоКвартала(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецКвартала(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный квартал целиком
		Возврат "Квартал";
	ИначеЕсли НачалоПолугодия(СтандартныйПериод.ДатаНачала)=НачалоПолугодия(СтандартныйПериод.ДатаОкончания) И
		НачалоПолугодия(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецПолугодия(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбрано произвольное полугодие целиком
		Возврат "Полугодие";
	ИначеЕсли НачалоГода(СтандартныйПериод.ДатаНачала)=НачалоГода(СтандартныйПериод.ДатаОкончания) И
		НачалоГода(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецГода(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный год целиком
		Возврат "Год";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		Возврат "";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Вчера
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Сегодня
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Завтра Тогда
		Возврат "День";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлаяНеделя
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующаяНеделя
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтаНеделя Тогда
		Возврат "Неделя";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтойНедели Тогда
		Возврат "ДоКонцаНедели";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтойНедели
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлаяНеделяДоТакогоЖеДняНедели
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующаяНеделяДоТакогоЖеДняНедели Тогда
		Возврат "СНачалаНедели";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлаяДекада
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующаяДекада
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтаДекада Тогда
		Возврат "Декада";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтойДекады Тогда
		Возврат "ДоКонцаДекады";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтойДекады
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлаяДекадаДоТакогоЖеНомераДня
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующаяДекадаДоТакогоЖеНомераДня Тогда
		Возврат "СНачалаДекады";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйМесяц
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийМесяц
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотМесяц Тогда
		Возврат "Месяц";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтогоМесяца Тогда
		Возврат "ДоКонцаМесяца";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтогоМесяца
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйМесяцДоТакойЖеДаты
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийМесяцДоТакойЖеДаты Тогда
		Возврат "СНачалаМесяца";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйКвартал
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийКвартал
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотКвартал Тогда
		Возврат "Квартал";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтогоКвартала Тогда
		Возврат "ДоКонцаКвартала";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтогоКвартала
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйКварталДоТакойЖеДаты
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийКварталДоТакойЖеДаты Тогда
		Возврат "СНачалаКвартала";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлоеПолугодие
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующееПолугодие
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтоПолугодие Тогда
		Возврат "Полугодие";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтогоПолугодия Тогда
		Возврат "ДоКонцаПолугодия";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтогоПолугодия
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлоеПолугодиеДоТакойЖеДаты
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующееПолугодиеДоТакойЖеДаты Тогда
		Возврат "СНачалаПолугодия";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйГод
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийГод
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотГод Тогда
		Возврат "Год";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтогоГода Тогда
		Возврат "ДоКонцаГода";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтогоГода
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйГодДоТакойЖеДаты
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийГодДоТакойЖеДаты Тогда
		Возврат "СНачалаГода";
	КонецЕсли; 	
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ПериодСравненияПоПериоду(СтандартныйПериод)
	
	Если ТипЗнч(СтандартныйПериод)=Тип("Структура") Тогда
		ОбновитьДатыНачалаИКонцаПериода(СтандартныйПериод);
	КонецЕсли; 
	
	Если ТипЗнч(СтандартныйПериод)=Тип("Структура") И СтандартныйПериод.Вариант="Последние7ДнейНеСчитаяТекущего" Тогда
		Результат = Новый Структура;
		Результат.Вставить("Вариант", "ПредыдущийПлавающийПериод");
		ПредыдущийПериод = УправлениеНебольшойФирмойКлиентСервер.ПредыдущийПлавающийПериод(СтандартныйПериод);
		Результат.Вставить("ДатаНачала", ПредыдущийПериод.ДатаНачала);
		Результат.Вставить("ДатаОкончания", ПредыдущийПериод.ДатаОкончания);
		Возврат Результат;
	ИначеЕсли НЕ ТипЗнч(СтандартныйПериод)=Тип("СтандартныйПериод") Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйМесяц);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Сегодня Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтаНеделя Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлаяНеделяДоТакогоЖеДняНедели);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтаДекада Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлаяДекадаДоТакогоЖеНомераДня);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотМесяц Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйМесяцДоТакойЖеДаты);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотКвартал Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйКварталДоТакойЖеДаты);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтоПолугодие Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлоеПолугодиеДоТакойЖеДаты);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотГод Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйГодДоТакойЖеДаты);
	ИначеЕсли НачалоНедели(СтандартныйПериод.ДатаНачала)=НачалоНедели(СтандартныйПериод.ДатаОкончания) И
		НачалоНедели(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецНедели(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбрана произвольная неделя целиком
		ДатаНачала = НачалоНедели(НачалоНедели(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = НачалоНедели(СтандартныйПериод.ДатаНачала)-1;
		Возврат Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
	ИначеЕсли НачалоМесяца(СтандартныйПериод.ДатаНачала)=НачалоМесяца(СтандартныйПериод.ДатаОкончания) И
		НачалоМесяца(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецМесяца(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный месяц целиком
		ДатаНачала = НачалоМесяца(НачалоМесяца(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = НачалоМесяца(СтандартныйПериод.ДатаНачала)-1;
		Возврат Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
	ИначеЕсли НачалоКвартала(СтандартныйПериод.ДатаНачала)=НачалоКвартала(СтандартныйПериод.ДатаОкончания) И
		НачалоКвартала(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецКвартала(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный квартал целиком
		ДатаНачала = НачалоКвартала(НачалоКвартала(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = НачалоКвартала(СтандартныйПериод.ДатаНачала)-1;
		Возврат Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
	ИначеЕсли НачалоПолугодия(СтандартныйПериод.ДатаНачала)=НачалоПолугодия(СтандартныйПериод.ДатаОкончания) И
		НачалоПолугодия(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецПолугодия(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбрано произвольное полугодие целиком
		ДатаНачала = НачалоКвартала(НачалоКвартала(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = НачалоКвартала(СтандартныйПериод.ДатаНачала)-1;
		Возврат Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
	ИначеЕсли НачалоГода(СтандартныйПериод.ДатаНачала)=НачалоГода(СтандартныйПериод.ДатаОкончания) И
		НачалоГода(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецГода(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный год целиком
		ДатаНачала = НачалоГода(НачалоГода(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = НачалоГода(СтандартныйПериод.ДатаНачала)-1;
		Возврат Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
	ИначеЕсли ЗначениеЗаполнено(СтандартныйПериод.ДатаНачала) И НачалоГода(СтандартныйПериод.ДатаНачала)=НачалоГода(СтандартныйПериод.ДатаОкончания) Тогда
		Результат = Новый Структура;
		Результат.Вставить("Вариант", "ЗаПрошлыйГод");
		Период = УправлениеНебольшойФирмойКлиентСервер.АналогичныйПериодПрошлогоГода(СтандартныйПериод);
		Если Период<>Неопределено Тогда
			Результат.Вставить("ДатаНачала", Период.ДатаНачала);
			Результат.Вставить("ДатаОкончания", Период.ДатаОкончания);
			Возврат Результат;
		Иначе
			Возврат Неопределено;
		КонецЕсли; 
	Иначе
		Результат = Новый Структура;
		Результат.Вставить("Вариант", "ПредыдущийПлавающийПериод");
		Период = УправлениеНебольшойФирмойКлиентСервер.ПредыдущийПлавающийПериод(СтандартныйПериод);
		Если Период<>Неопределено Тогда
			Результат.Вставить("ДатаНачала", Период.ДатаНачала);
			Результат.Вставить("ДатаОкончания", Период.ДатаОкончания);
			Возврат Результат;
		Иначе
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли; 	
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция МожноСместитьПериод(СтандартныйПериод)
	
	Если СтандартныйПериод=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтандартныйПериод.Вариант="" Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПроизвольныйПериод 
		И (НЕ ЗначениеЗаполнено(СтандартныйПериод.ДатаНачала)
		ИЛИ НЕ ЗначениеЗаполнено(СтандартныйПериод.ДатаОкончания)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставленияПериодов(Форма)
	
	// Видимость групп выбора параметров сравнения
	ВидимостьДатыСравнения = (Форма.ДатаСравнения<>Неопределено);
	Если Форма.Элементы.ГруппаПоказателиОстаткиДатаСравнения.Видимость<>ВидимостьДатыСравнения Тогда
		Форма.Элементы.ГруппаПоказателиОстаткиДатаСравнения.Видимость = ВидимостьДатыСравнения;
	КонецЕсли; 
	ВидимостьПериодаСравнения = (Форма.ПериодСравнения<>Неопределено);
	Если Форма.Элементы.ГруппаПоказателиОборотыПериодСравнения.Видимость<>ВидимостьПериодаСравнения Тогда
		Форма.Элементы.ГруппаПоказателиОборотыПериодСравнения.Видимость = ВидимостьПериодаСравнения;
	КонецЕсли;
	
	// Доступность кнопок смещения периода
	ДоступностьКнопокПериод = МожноСместитьПериод(Форма.Период);
	Если Форма.Элементы.ПериодНазад.Доступность<>ДоступностьКнопокПериод Тогда
		Форма.Элементы.ПериодНазад.Доступность = ДоступностьКнопокПериод;
		Форма.Элементы.ПериодВперед.Доступность = ДоступностьКнопокПериод;
	КонецЕсли; 
	ДоступностьКнопокПериодСравнения = МожноСместитьПериод(Форма.ПериодСравнения);
	Если Форма.Элементы.ПериодСравненияНазад.Доступность<>ДоступностьКнопокПериодСравнения Тогда
		Форма.Элементы.ПериодСравненияНазад.Доступность = ДоступностьКнопокПериодСравнения;
		Форма.Элементы.ПериодСравненияВперед.Доступность = ДоступностьКнопокПериодСравнения;
	КонецЕсли; 
	
	// Представления периодов
	Форма.Элементы.ДатаВыбор.Заголовок = ВРег(НСтр("ru = 'На сегодня'"));
	Форма.Элементы.ДатаВыбор.РасширеннаяПодсказка.Заголовок = Форма.Элементы.ДатаВыбор.Заголовок;
	
	Форма.ДатаСравненияПредставление = ПредставлениеСтандартнойДатыНачала(Форма.ДатаСравнения, Форма.Дата);
	//@skip-check bsl-nstr-string-literal-format
	Форма.Элементы.ДатаСравненияВыбор.Заголовок = НСтр("ru = 'Сравнить с: '") + Форма.ДатаСравненияПредставление;
	Форма.Элементы.ДатаСравненияВыбор.РасширеннаяПодсказка.Заголовок = Форма.ДатаСравненияПредставление;
	
	Форма.ПериодПредставление = ПредставлениеСтандартногоПериода(Форма.Период);
	Форма.Элементы.ГруппаНастройкаПериода.Заголовок = НРег(Форма.ПериодПредставление);
	Форма.Элементы.ПериодВыбор.Заголовок = ВРег(ПредставлениеСтандартногоПериода(Форма.Период));
	Форма.Элементы.ПериодВыбор.РасширеннаяПодсказка.Заголовок = Форма.Элементы.ПериодВыбор.Заголовок;
	
	Форма.ПериодСравненияПредставление = ПредставлениеСтандартногоПериода(Форма.ПериодСравнения, Форма.Период);
	//@skip-check bsl-nstr-string-literal-format
	Форма.Элементы.ПериодСравненияВыбор.Заголовок = НСтр("ru = 'Сравнить с: '")+Форма.ПериодСравненияПредставление;
	Форма.Элементы.ПериодСравненияВыбор.РасширеннаяПодсказка.Заголовок = Форма.ПериодСравненияПредставление;
	
	Если Форма.ЭтоИнтерфейс85 Тогда
		
		Форма.ОстатакиИспользоватьСравнение = ВидимостьДатыСравнения;
			
		Форма.ОборотыИспользоватьСравнение = ВидимостьПериодаСравнения;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДатаВыборЗавершение(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ВыбранноеЗначение.Значение = "ВСравнении" Тогда
		Если ДатаСравнения = Неопределено Тогда
			ДатаСравнения = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтойНедели);
		Иначе
			ДатаСравнения = Неопределено;
		КонецЕсли; 
		ОбновитьПредставленияПериодов(ЭтотОбъект);
		ОбновитьЧастично(ИмяСекцииОстатки(), "ДатаСравнения");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСравненияВыборЗавершение(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ВыбранноеЗначение.Значение = Новый СтандартнаяДатаНачала Тогда
		Оповещение = Новый ОписаниеОповещения("ДатаСравненияВыборПроизвольнаяДата", ЭтотОбъект);
		ПоказатьВводДаты(Оповещение, ДатаСравнения, НСтр("ru = 'Укажите дату'"), ЧастиДаты.Дата);
	Иначе
		ДатаСравнения = ВыбранноеЗначение.Значение;
		ТипДатыСравнения = ТипДаты(ДатаСравнения);
		ОбновитьПредставленияПериодов(ЭтотОбъект);
		ОбновитьЧастично(ИмяСекцииОстатки(), "ДатаСравнения");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСравненияВыборПроизвольнаяДата(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	ДатаСравнения = Новый СтандартнаяДатаНачала(ВыбранноеЗначение);
	ТипДатыСравнения = ТипДаты(ДатаСравнения);
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОстатки(), "ДатаСравнения");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСравненияВыборЗавершение(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ВыбранноеЗначение.Значение = Новый СтандартныйПериод Тогда
		Оповещение = Новый ОписаниеОповещения("ПериодСравненияВыборПроизвольныйПериод", ЭтотОбъект);
		Диалог = Новый ДиалогРедактированияСтандартногоПериода;
		Диалог.Период = ?(ТипЗнч(ПериодСравнения) = Тип("СтандартныйПериод"), ПериодСравнения, Новый СтандартныйПериод);
		Диалог.Показать(Оповещение);
	Иначе
		ПериодСравнения = ВыбранноеЗначение.Значение;
		ТипПериодаСравнения = ТипПериода(ПериодСравнения);
		ОбновитьПредставленияПериодов(ЭтотОбъект);
		ОбновитьЧастично(ИмяСекцииОбороты(), "ПериодСравнения");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСравненияВыборПроизвольныйПериод(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	ПериодСравнения = ВыбранноеЗначение;
	ТипПериодаСравнения = ТипПериода(ПериодСравнения);
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОбороты(), "ПериодСравнения");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВыборЗавершение(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ВыбранноеЗначение.Значение = "ВСравнении" Тогда
		Если ПериодСравнения = Неопределено Тогда
			ПериодСравнения = ПериодСравненияПоПериоду(Период);
			ТипПериодаСравнения = ТипПериода(ПериодСравнения);
		Иначе
			ПериодСравнения = Неопределено;
			ТипПериодаСравнения = "";
		КонецЕсли; 
		ОбновитьПредставленияПериодов(ЭтотОбъект);
		ОбновитьЧастично(ИмяСекцииОбороты(), "ПериодСравнения");
	ИначеЕсли ВыбранноеЗначение.Значение = Новый СтандартныйПериод Тогда
		Оповещение = Новый ОписаниеОповещения("ПериодВыборПроизвольныйПериод", ЭтотОбъект);
		Диалог = Новый ДиалогРедактированияСтандартногоПериода;
		Диалог.Период = ?(ТипЗнч(Период) = Тип("СтандартныйПериод"), Период, Новый СтандартныйПериод);
		Диалог.Показать(Оповещение);
	Иначе
		Период = ВыбранноеЗначение.Значение;
		ТипПериода = ТипПериода(Период);
		Если ПериодСравнения <> Неопределено Тогда
			ПериодСравнения = ПериодСравненияПоПериоду(Период);
			ТипПериодаСравнения = ТипПериода(ПериодСравнения);
		КонецЕсли; 
		ОбновитьПредставленияПериодов(ЭтотОбъект);
		ОбновитьЧастично(ИмяСекцииОбороты(), "Период" + ?(ПериодСравнения<>Неопределено, ",ПериодСравнения", ""));
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВыборПроизвольныйПериод(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Период = ВыбранноеЗначение;
	ТипПериода = ТипПериода(Период);
	Если ПериодСравнения <> Неопределено Тогда
		ПериодСравнения = ПериодСравненияПоПериоду(Период);
		ТипПериодаСравнения = ТипПериода(ПериодСравнения);
	КонецЕсли; 
	ОбновитьПредставленияПериодов(ЭтотОбъект);
	ОбновитьЧастично(ИмяСекцииОбороты(), "Период" + ?(ПериодСравнения <> Неопределено, ",ПериодСравнения", ""));
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьЧастично(Секция, СохраняемыеПериоды = "")
	
	Если ПустаяСтрока(Секция) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗадание(Секция, СохраняемыеПериоды);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму()
	
	УдалитьЭлементыРекурсивно(Элементы.ГруппаПоказателиОстаткиЛево);
	УдалитьЭлементыРекурсивно(Элементы.ГруппаПоказателиОстаткиЦентр);
	УдалитьЭлементыРекурсивно(Элементы.ГруппаПоказателиОстаткиПраво);
	УдалитьЭлементыРекурсивно(Элементы.ГруппаПоказателиОборотыЛево);
	УдалитьЭлементыРекурсивно(Элементы.ГруппаПоказателиОборотыЦентр);
	УдалитьЭлементыРекурсивно(Элементы.ГруппаПоказателиОборотыПраво);
	ДобавленныеПоказатели.Очистить();
	УдалитьЭлементыРекурсивно(Элементы.ГруппаДиаграммыЛево);
	УдалитьЭлементыРекурсивно(Элементы.ГруппаДиаграммыПраво);
	
	ДобавленныеДиаграммы.Очистить();
	ЗагрузитьНастройки();
	СоздатьЭлементыПоказатели();
	СоздатьЭлементыДиаграммы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные()
	
	Если НЕ ЭтоАдресВременногоХранилища(ФоновоеЗаданиеАдресРезультата) Тогда
		Возврат;
	КонецЕсли; 
	
	Данные = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресРезультата);

	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		ОбновитьЗначенияПоказателей(Данные);
		ОбновитьЗначенияДиаграмм(Данные);
		ДобавитьУдалитьИндикторУстановленныхФильтров();
		Если Данные.Свойство("Актуальность") Тогда
			Если Данные.Актуальность = Неопределено Тогда
				ПервыйНеактуальныйМесяц = '0001-01-01';
				ПерваяНеактуальнаяОрганизация = Справочники.Организации.ПустаяСсылка();
				ОбновитьВажноеСообщениеЗакрытьМесяц(Ложь);
			Иначе
				ПервыйНеактуальныйМесяц = Данные.Актуальность.Месяц;
				ПерваяНеактуальнаяОрганизация = Данные.Актуальность.Организация;
				ОбновитьВажноеСообщениеЗакрытьМесяц(ПолучитьФункциональнуюОпцию("ОтображатьСчетаУчета"));
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(ФоновоеЗаданиеАдресРезультата);
	ФоновоеЗаданиеАдресРезультата = Неопределено;
	ФоновоеЗаданиеИдентификатор = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура Инициализация()
	
	// Заполнение таблицы показателей

	// Продажи
	ДобавитьПоказатель("Продажи", "Выручка", НСтр("ru = 'Продажи'"), НСтр("ru = 'Выручка'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_Продажи", "Отчет.Продажи", "Основной", "Сумма");
	ДобавитьПоказатель("Продажи", "Количество", НСтр("ru = 'Продажи'"), НСтр("ru = 'Кол-во проданных товаров'"),,, "ЧН=—", "СКД_РН_Продажи", "Отчет.Продажи", "Основной", "Количество");
	ДобавитьПоказатель("Продажи", "КоличествоДокументов", НСтр("ru = 'Продажи'"), НСтр("ru = 'Кол-во продаж (документов)'"),,, "ЧДЦ=; ЧН=—", "СКД_РН_Продажи", "Отчет.Продажи", "ВаловаяПрибыльПоМенеджерам", "КоличествоДокументов");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") Тогда
		ДобавитьПоказатель("Продажи", "Себестоимость", НСтр("ru = 'Продажи'"), НСтр("ru = 'Себестоимость'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_Продажи", "Отчет.Продажи", "ВаловаяПрибыль", "Себестоимость");
		ДобавитьПоказатель("Продажи", "Прибыль", НСтр("ru = 'Продажи'"), НСтр("ru = 'Прибыль'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_Продажи", "Отчет.Продажи", "ВаловаяПрибыль", "ВаловаяПрибыль");
		ДобавитьПоказатель("Продажи", "Наценка", НСтр("ru = 'Продажи'"), НСтр("ru = 'Прибыль/Себестоимость'"),,, "ЧН=—", "СКД_РН_Продажи", "Отчет.Продажи", "ВаловаяПрибыль", "Наценка");
		ДобавитьПоказатель("Продажи", "Рентабельность", НСтр("ru = 'Продажи'"), НСтр("ru = 'Прибыль/выручка'"),,, "ЧН=—", "СКД_РН_Продажи", "Отчет.Продажи", "ВаловаяПрибыль", "Рентабельность");
	КонецЕсли;
	ДобавитьПоказатель("Продажи", "ВозвратыСумма", НСтр("ru = 'Продажи'"), НСтр("ru = 'Сумма возвратов'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_Продажи", "Отчет.Продажи", "Возвраты", "Сумма");
	ДобавитьПоказатель("Продажи", "ВозвратыКоличество", НСтр("ru = 'Продажи'"), НСтр("ru = 'Кол-во возвратов'"),,, "ЧН=—", "СКД_РН_Продажи", "Отчет.Продажи", "Возвраты", "Количество");
	
	// Розница
	Если ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж") Тогда
		ДобавитьПоказатель("Розница", "РозничныеПродажи", НСтр("ru = 'Розница'"), НСтр("ru = 'Розничные продажи'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_Продажи", "Отчет.РозничныеПродажи", "РозничныеПродажиКонтекст", "Сумма");
		ДобавитьПоказатель("Розница", "КоличествоЧеков", НСтр("ru = 'Розница'"), НСтр("ru = 'Количество чеков'"),,, "ЧН=—", "СКД_Розница", "Отчет.РозничныеПродажи", "РозничныеПродажиПоТочкамКонтекст", "КоличествоЧеков");
		ДобавитьПоказатель("Розница", "СреднийЧек", НСтр("ru = 'Розница'"), НСтр("ru = 'Средний чек'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_Розница", "Отчет.РозничныеПродажи", "РозничныеПродажиПоТочкамКонтекст", "СреднийЧек");
		ДобавитьПоказатель("Розница", "ПолученоНаличными", НСтр("ru = 'Розница'"), НСтр("ru = 'Получено наличными'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_Розница", "Отчет.РозничныеПродажи", "РозничныеПродажиПоТочкамКонтекст", "ПолученоНаличными");
		ДобавитьПоказатель("Розница", "ПолученоКартами", НСтр("ru = 'Розница'"), НСтр("ru = 'Получено картами'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_Розница", "Отчет.РозничныеПродажи", "РозничныеПродажиПоТочкамКонтекст", "ПолученоКартами");
		ДобавитьПоказатель("Розница", "СуммаОстаток", НСтр("ru = 'Розница'"), НСтр("ru = 'Остаток в кассах ККМ'"), Истина, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ДенежныеСредстваВКассахККМ", "Отчет.ДенежныеСредстваВКассахККМ", "Остатки", "СуммаКонечныйОстаток");
	КонецЕсли;
	
	// Товары
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуСклад") Тогда
		ДобавитьПоказатель("Товары", "КоличествоОстаток", НСтр("ru = 'Товары'"), НСтр("ru = 'Остаток (кол-во)'"), Истина,, "ЧН=—", "СКД_РН_Запасы", "Отчет.Запасы", "Остатки",, "Запасы");
		ДобавитьПоказатель("Товары", "СуммаОстаток", НСтр("ru = 'Товары'"), НСтр("ru = 'Остаток (сумма)'"), Истина, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_Запасы", "Отчет.Запасы", "Остатки",, "Запасы");
		ДобавитьПоказатель("Товары", "КоличествоПриход", НСтр("ru = 'Товары'"), НСтр("ru = 'Приход (кол-во)'"),,, "ЧН=—", "СКД_РН_Запасы", "Отчет.Запасы", "Ведомость");
		ДобавитьПоказатель("Товары", "СуммаПриход", НСтр("ru = 'Товары'"), НСтр("ru = 'Приход (сумма)'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_Запасы", "Отчет.Запасы", "Ведомость");
		ДобавитьПоказатель("Товары", "КоличествоРасход", НСтр("ru = 'Товары'"), НСтр("ru = 'Расход (кол-во)'"),,, "ЧН=—", "СКД_РН_Запасы", "Отчет.Запасы", "Ведомость");
		ДобавитьПоказатель("Товары", "СуммаРасход", НСтр("ru = 'Товары'"), НСтр("ru = 'Расход (сумма)'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_Запасы", "Отчет.Запасы", "Ведомость");
	КонецЕсли;
	
	// Деньги
	ДобавитьПоказатель("Деньги", "СуммаОстаток", НСтр("ru = 'Деньги'"), НСтр("ru = 'Остаток денег'"), Истина, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ДенежныеСредства", "Отчет.ДенежныеСредства", "Остатки",, "Деньги");
	ДобавитьПоказатель("Деньги", "ДенежныйПоток", НСтр("ru = 'Деньги'"), НСтр("ru = 'Чистый денежный поток'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ДенежныеСредства", "Отчет.ДенежныеСредства", "Ведомость");
	ДобавитьПоказатель("Деньги", "Поступления", НСтр("ru = 'Деньги'"), НСтр("ru = 'Поступления'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ДенежныеСредства", "Отчет.ДенежныеСредства", "Ведомость");
	ДобавитьПоказатель("Деньги", "Платежи", НСтр("ru = 'Деньги'"), НСтр("ru = 'Платежи'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ДенежныеСредства", "Отчет.ДенежныеСредства", "Ведомость");
	Если ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") Тогда
		ДобавитьПоказатель("Деньги", "ПоступленияПлан", НСтр("ru = 'Деньги'"), НСтр("ru = 'Поступления (план)'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ПлатежныйКалендарь", "Отчет.ПлановыеДвиженияДенежныхСредств", "Ведомость", "Поступления");
		ДобавитьПоказатель("Деньги", "ПлатежиПлан", НСтр("ru = 'Деньги'"), НСтр("ru = 'Платежи (план)'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ПлатежныйКалендарь", "Отчет.ПлановыеДвиженияДенежныхСредств", "Ведомость", "Платежи");
	КонецЕсли;
	
	// Счета-заказы
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСчетаНаОплату") Тогда
		ДобавитьПоказатель("СчетаЗаказы", "КоличествоСчетов", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Выставлено счетов (штук)'"),,, "ЧДЦ=; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "СчетаНаОплатуКонтекст", "КоличествоДокументов", , 1);
		ДобавитьПоказатель("СчетаЗаказы", "СуммаСчетов", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Выставлено счетов на сумму'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "СчетаНаОплатуКонтекст", "Сумма", , 2);
		ДобавитьПоказатель("СчетаЗаказы", "ОплаченоСчетов", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Получено оплат по счетам на сумму'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "СчетаНаОплатуКонтекст", "СуммаОплаты", , 3);
		ДобавитьПоказатель("СчетаЗаказы", "ОплаченоСчетовКоличество", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Оплачено счетов (штук)'"),,, "ЧДЦ=; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "СчетаНаОплатуКонтекст", "КоличествоОплачено", , 4);
	КонецЕсли;
	ДобавитьПоказатель("СчетаЗаказы", "КоличествоЗаказов", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Получено заказов (штук)'"),,, "ЧДЦ=; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПокупателейКонтекст", "КоличествоДокументов", , 5);
	ДобавитьПоказатель("СчетаЗаказы", "СуммаЗаказов", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Получено заказов на сумму'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПокупателейКонтекст", "Сумма", , 6);
	ДобавитьПоказатель("СчетаЗаказы", "ОплаченоЗаказов", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Получено оплат по заказам на сумму'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПокупателейКонтекст", "СуммаОплаты", , 7);
	ДобавитьПоказатель("СчетаЗаказы", "ОплаченоЗаказовКоличество", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Оплачено заказов (штук)'"),,, "ЧДЦ=; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПокупателейКонтекст", "КоличествоОплачено", , 8);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") Тогда
		ДобавитьПоказатель("СчетаЗаказы", "КоличествоЗаказовПоставщику", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Отправлено заказов (штук)'"),,, "ЧДЦ=; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПоставщикамКонтекст", "КоличествоДокументов", , 9);
		ДобавитьПоказатель("СчетаЗаказы", "СуммаЗаказовПоставщику", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Отправлено заказов на сумму'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПоставщикамКонтекст", "Сумма", , 10);
		ДобавитьПоказатель("СчетаЗаказы", "ОплаченоЗаказовПоставщику", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Выполнено оплат по заказам на сумму'"),, Истина, "ЧДЦ=2; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПоставщикамКонтекст", "СуммаОплаты", , 11);
		ДобавитьПоказатель("СчетаЗаказы", "ОплаченоЗаказовПоставщикуКоличество", НСтр("ru = 'Счета - заказы'"), НСтр("ru = 'Оплачено заказов поставщику (штук)'"),,, "ЧДЦ=; ЧН=—", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПоставщикамКонтекст", "КоличествоОплачено", , 12);
	КонецЕсли;
	
	// Долги
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") И ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуПродажи") Тогда
		ДобавитьПоказатель("Долги", "ДолгиОбщие", НСтр("ru = 'Долги'"), НСтр("ru = 'Общий долг'"), Истина, Истина, "ЧДЦ=2; ЧН=—", "СКД_Расчеты", "Отчет.Взаиморасчеты", "Остатки",, "Покупатели");
	КонецЕсли;
	ДобавитьПоказатель("Долги", "ДолгиНам", НСтр("ru = 'Долги'"), НСтр("ru = 'Долги нам'"), Истина, Истина, "ЧДЦ=2; ЧН=—", "СКД_Расчеты", "Отчет.Взаиморасчеты", "Остатки",, "Покупатели");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") Тогда
		ДобавитьПоказатель("Долги", "ДолгиНаши", НСтр("ru = 'Долги'"), НСтр("ru = 'Долги наши'"), Истина, Истина, "ЧДЦ=2; ЧН=—", "СКД_Расчеты", "Отчет.Взаиморасчеты", "Остатки",, "Поставщики");
	КонецЕсли;
	
	// Фин. анализ
	Если ПолучитьФункциональнуюОпцию("ОтображатьСчетаУчета") Тогда
		ДобавитьПоказатель("ФинАнализ", "ЧистыеАктивы", НСтр("ru = 'Фин. анализ'"), НСтр("ru = 'Чистые активы'"), Истина, Истина, "ЧДЦ=2; ЧН=—", "СКД_РБ_Управленческий", "Отчет.ЧистыеАктивы", "ЧистыеАктивы");
	КонецЕсли;
	
	// Налоги
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОтчетность") Тогда
		ДобавитьПоказатель("Налоги", "ТекущиеПлатежи", НСтр("ru = 'Налоги'"), НСтр("ru = 'Налоги к оплате'"), Истина, Ложь, "ЧДЦ=2; ЧН=—", "СКД_Налоги", "Справочник.ЗаписиКалендаряПодготовкиОтчетности", "ТекущиеПлатежи");
		ДобавитьПоказатель("Налоги", "КоличествоТекущихПлатежей", НСтр("ru = 'Налоги'"), НСтр("ru = 'Задач по оплате налогов'"), Истина, Ложь, "ЧДЦ=0; ЧН=—", "СКД_Налоги", "Справочник.ЗаписиКалендаряПодготовкиОтчетности", "КоличествоТекущихПлатежей");
		ДобавитьПоказатель("Налоги", "КоличествоТекущихДокументов", НСтр("ru = 'Налоги'"), НСтр("ru = 'Задач по сдаче отчетности'"), Истина, Ложь, "ЧДЦ=0; ЧН=—", "СКД_Налоги", "Справочник.ЗаписиКалендаряПодготовкиОтчетности", "КоличествоТекущихДокументов");
	КонецЕсли;      
	
	// Раздел CRM    
	// АПК:515-выкл
	// Показатели завязаны не на конкретные роли, а на право доступа к подсистеме
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуCRM") И Пользователи.РолиДоступны("ПодсистемаCRM") Тогда
	// АПК:515-вкл
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЛиды") Тогда
			ДобавитьПоказатель("CRM", "КоличествоЛидовВсего", НСтр("ru = 'CRM'"), НСтр("ru = 'Лиды'"), Истина,, "ЧДЦ=0; ЧН=0", "СКД_Лиды",,, "КоличествоЛидовВсего",, 0);
			ДобавитьПоказатель("CRM", "КоличествоЛидовЗаПериод", НСтр("ru = 'CRM'"), НСтр("ru = 'Новых лидов'"),,, "ЧДЦ=0; ЧН=0", "СКД_Лиды",,,,, 0);
			ДобавитьПоказатель("CRM", "КонверсияЛидовПоИсточникамПривлеченияРасчет", НСтр("ru = 'CRM'"), НСтр("ru = 'Конверсия лидов'"),,, "ЧДЦ=0; ЧН=0; ЧФ=Ч%", "СКД_КонверсияЛиды","Отчет.ВоронкаПродаж","ВоронкаПродажПоЛидам",,, 7, Справочники.ИсточникиПривлеченияПокупателей.ПустаяСсылка(),  НСтр("ru = 'Источник привлечения'"));		
		КонецЕсли;
		
		ДобавитьПоказатель("CRM", "КонверсияПокупателейПоИсточникамПривлеченияРасчет", НСтр("ru = 'CRM'"), НСтр("ru = 'Конверсия покупателей'"),,, "ЧДЦ=0; ЧН=0; ЧФ=Ч%", "СКД_КонверсияКонтрагенты", "Отчет.ВоронкаПродаж", "ВоронкаПродажПоПокупателям",,, 8, Справочники.ИсточникиПривлеченияПокупателей.ПустаяСсылка(), НСтр("ru = 'Источник привлечения'"));
		ДобавитьПоказатель("CRM", "КонверсияЗаказовПоИсточникамПривлеченияРасчет", НСтр("ru = 'CRM'"), НСтр("ru = 'Конверсия заказов покупателей'"),,, "ЧДЦ=0; ЧН=0; ЧФ=Ч%", "СКД_КонверсияЗаказы", "Отчет.ВоронкаПродаж", "ВоронкаПродаж",,, 9, Справочники.ИсточникиПривлеченияПокупателей.ПустаяСсылка(), НСтр("ru = 'Источник привлечения'"));
		ДобавитьПоказатель("CRM", "СреднееВремяЗаказаРасчет", НСтр("ru = 'CRM'"), НСтр("ru = 'Среднее время заказа'"),,, "ЧДЦ=2; ЧН=0;", "СКД_КонверсияЗаказы", "Отчет.ВоронкаПродаж", "ВоронкаПродаж",,, 10);
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСобытия") Тогда
			ДобавитьПоказатель("CRM", "КоличествоСобытийВсего", НСтр("ru = 'CRM'"), НСтр("ru = 'События'"), Истина,, "ЧДЦ=0; ЧН=0", "СКД_События",,,,, 4);
			ДобавитьПоказатель("CRM", "КоличествоСобытийЗаПериод", НСтр("ru = 'CRM'"), НСтр("ru = 'Новых событий'"),,, "ЧДЦ=0; ЧН=0", "СКД_События",,,,, 4);
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЗадачиСотрудников") Тогда		
			ДобавитьПоказатель("CRM", "КоличествоЗадачВсего", НСтр("ru = 'CRM'"), НСтр("ru = 'Задачи'"), Истина,, "ЧДЦ=0; ЧН=0", "СКД_Задачи",,,,, 5);
			ДобавитьПоказатель("CRM", "КоличествоЗадачЗаПериод", НСтр("ru = 'CRM'"), НСтр("ru = 'Новых задач'"),,, "ЧДЦ=0; ЧН=0", "СКД_ЗадачиОбороты",,,,, 5);
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСегментыКонтрагентов") Тогда
			ДобавитьПоказатель("CRM", "КоличествоВСегменте", НСтр("ru = 'CRM'"), НСтр("ru = 'Сегмент'"), Истина,, "ЧДЦ=0; ЧН=0", "СКД_Заглушка",,,,, 7, Справочники.СегментыКонтрагентов.ПустаяСсылка(), НСтр("ru = 'Сегмент контрагента'"));
		КонецЕсли;
		
		ДобавитьПоказатель("CRM", "КоличествоКонтрагентовВсего", НСтр("ru = 'CRM'"), НСтр("ru = 'Контрагенты'"), Истина,, "ЧДЦ=0; ЧН=0", "СКД_Контрагенты",,,,, 2);
		ДобавитьПоказатель("CRM", "КоличествоКонтрагентовЗаПериод", НСтр("ru = 'CRM'"), НСтр("ru = 'Новых контрагентов'"),,, "ЧДЦ=0; ЧН=0","СКД_Контрагенты",,,,, 2);
		
	КонецЕсли;
	
	НастройкиПоказателей.Сортировать("Представление, Порядок, ПредставлениеРесурса");

	// Заполнение таблицы диаграмм
	
	//ИспользуютсяОбщиеДопРеквизиты = ПолучитьФункциональнуюОпцию("ИспользоватьОбщиеДополнительныеРеквизитыИСведения");
	ИспользуютсяОбщиеДопРеквизиты = Истина;
	НаборСвойств_Справочник_Номенклатура = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура");
	НаборыСвойствНоменклатура = НаборыРеквизитов(НаборСвойств_Справочник_Номенклатура, ИспользуютсяОбщиеДопРеквизиты);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	ТипГистограмма = ТипДиаграммы.Гистограмма;
	//@skip-check bsl-legacy-check-dynamic-feature-access
	ТипКруговая = ТипДиаграммы.Круговая;
	//@skip-check bsl-legacy-check-dynamic-feature-access
	ТипГистограммаСНакоплением = ТипДиаграммы.ГистограммаСНакоплением;
	// Диаграмма "Динамика продаж"
	СтруктураСерий = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Сумма", НСтр("ru = 'Сумма продаж'"), НСтр("ru = 'Продажи'"), ТипГистограмма, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Количество", НСтр("ru = 'Количество проданных товаров'"),, ТипГистограмма);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "КоличествоДокументов", НСтр("ru = 'Количество продаж (чеков)'"),, ТипГистограмма);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") Тогда
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Прибыль", НСтр("ru = 'Прибыль'"),, ТипГистограмма, Истина);
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") Тогда
		МассивПредставлений = Новый Массив;
		МассивПредставлений.Добавить(НСтр("ru = 'Себестоимость'"));
		МассивПредставлений.Добавить(НСтр("ru = 'Прибыль'"));
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "ПрибыльИСебестоимость", МассивПредставлений, НСтр("ru = 'Себестоимость и прибыль'"), ТипГистограммаСНакоплением, Истина);
	КонецЕсли;
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "ВозвратыСумма", НСтр("ru = 'Возвраты (сумма)'"),, ТипГистограмма, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "ВозвратыКоличество", НСтр("ru = 'Возвраты (количество)'"),, ТипГистограмма);
	СтруктураТочек = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "День", НСтр("ru = 'Дни'"),,,, "ДЛФ=D");
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Неделя", НСтр("ru = 'Недели'"),,,, "ДЛФ=D");
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Месяц", НСтр("ru = 'Месяцы'"),,,, "ДФ='МММ гггг'");
	ДобавитьДиаграмму("ДинамикаПродаж", НСтр("ru = 'Динамика продаж'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_РН_Продажи", "Отчет.Продажи", "Основной");  
	
	// Диаграмма "Структура продаж"
	СтруктураСерий = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "НоменклатураРодитель", НСтр("ru = 'Группы товаров'"),, ТипКруговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "КатегорияНоменклатуры", НСтр("ru = 'Категории номенклатуры'"),, ТипКруговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Склад", НСтр("ru = 'Склады'"),, ТипКруговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Номенклатура", НСтр("ru = 'Товары'"),, ТипКруговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Контрагент", НСтр("ru = 'Покупатели'"),, ТипКруговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Организация", НСтр("ru = 'Организации'"),, ТипКруговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Подразделение", НСтр("ru = 'Подразделения'"),, ТипКруговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Ответственный", НСтр("ru = 'Менеджеры'"),, ТипКруговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Валюта", НСтр("ru = 'Валюта'"),, ТипКруговая);
	СтруктураОтбора = Новый Соответствие;
	СтруктураОтбора.Вставить("Отбор.НаборСвойств", НаборыСвойствНоменклатура);
	НаборСвойств_Справочник_Номенклатура_Общие = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура_Общие");
	СтруктураОтбора.Вставить("НаборСвойств", НаборСвойств_Справочник_Номенклатура_Общие);
	СтруктураОтбора.Вставить("ТекущийНаборСвойств", НаборСвойств_Справочник_Номенклатура_Общие);
	СтруктураОтбора.Вставить("ЭтоДополнительноеСведение", Ложь);
	СтруктураОтбора.Вставить("ТолькоПросмотр", Истина);
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("СвойствоНоменклатуры", СтруктураОтбора);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "СвойствоНоменклатуры", НСтр("ru = 'Доп. реквизиты номенклатуры'"),, ТипКруговая,,,, СтруктураНастроек);
	СтруктураОтбора = Новый Соответствие;
	НаборСвойств_Справочник_Контрагенты = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Контрагенты");
	СтруктураОтбора.Вставить("Отбор.НаборСвойств", НаборСвойств_Справочник_Контрагенты);
	СтруктураОтбора.Вставить("НаборСвойств", НаборСвойств_Справочник_Контрагенты);
	СтруктураОтбора.Вставить("ТекущийНаборСвойств", НаборСвойств_Справочник_Контрагенты);
	СтруктураОтбора.Вставить("ЭтоДополнительноеСведение", Ложь);
	СтруктураОтбора.Вставить("ТолькоПросмотр", Истина);
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("СвойствоПокупателя", СтруктураОтбора);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "СвойствоПокупателя", НСтр("ru = 'Доп. реквизиты покупателей'"),, ТипКруговая,,,, СтруктураНастроек);
	СтруктураТочек = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Сумма", НСтр("ru = 'Сумма продаж'"), НСтр("ru = 'Продажи'"),, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Количество", НСтр("ru = 'Количество проданных товаров'"));
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "КоличествоДокументов", НСтр("ru = 'Количество продаж (чеков)'"));
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") Тогда
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "Прибыль", НСтр("ru = 'Прибыль'"),,, Истина);
	КонецЕсли;
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "ВозвратыСумма", НСтр("ru = 'Возвраты (сумма)'"),,, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "ВозвратыКоличество", НСтр("ru = 'Возвраты (количество)'"));
	ДобавитьДиаграмму("СтруктураПродаж", НСтр("ru = 'Структура продаж'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_РН_Продажи", "Отчет.Продажи", "Основной");  
	
	// Диаграмма "Структура розничных продаж"
	Если ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж") Тогда
		СтруктураСерий = Новый Структура;
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "НоменклатураРодитель", НСтр("ru = 'Группы товаров'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "КатегорияНоменклатуры", НСтр("ru = 'Категории номенклатуры'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Склад", НСтр("ru = 'Склады'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Номенклатура", НСтр("ru = 'Товары'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Организация", НСтр("ru = 'Организации'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Подразделение", НСтр("ru = 'Подразделения'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "КассаККМ", НСтр("ru = 'Касса ККМ'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Ответственный", НСтр("ru = 'Менеджеры'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Валюта", НСтр("ru = 'Валюта'"),, ТипКруговая);
		СтруктураОтбора = Новый Соответствие;
		СтруктураОтбора.Вставить("Отбор.НаборСвойств", НаборыСвойствНоменклатура);
		СтруктураОтбора.Вставить("НаборСвойств", НаборСвойств_Справочник_Номенклатура_Общие);
		СтруктураОтбора.Вставить("ТекущийНаборСвойств", НаборСвойств_Справочник_Номенклатура_Общие);
		СтруктураОтбора.Вставить("ЭтоДополнительноеСведение", Ложь);
		СтруктураОтбора.Вставить("ТолькоПросмотр", Истина);
		СтруктураНастроек = Новый Структура;
		СтруктураНастроек.Вставить("СвойствоНоменклатуры", СтруктураОтбора);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "СвойствоНоменклатуры", НСтр("ru = 'Доп. реквизиты номенклатуры'"),, ТипКруговая,,,, СтруктураНастроек);
		СтруктураТочек = Новый Структура;
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "Сумма", НСтр("ru = 'Сумма продаж'"), НСтр("ru = 'Продажи'"),, Истина);
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "Количество", НСтр("ru = 'Количество проданных товаров'"));
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "КоличествоДокументов", НСтр("ru = 'Количество продаж (чеков)'"));
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "Прибыль", НСтр("ru = 'Прибыль'"),,, Истина);
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "ВозвратыСумма", НСтр("ru = 'Возвраты (сумма)'"),,, Истина);
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "ВозвратыКоличество", НСтр("ru = 'Возвраты (количество)'"));
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "КоличествоЧеков", НСтр("ru = 'Количество чеков'"));
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "СреднийЧек", НСтр("ru = 'Средний чек'"));
		ДобавитьДиаграмму("СтруктураРозничныхПродаж", НСтр("ru = 'Структура розничных продаж'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_Розница", "Отчет.РозничныеПродажи", "РозничныеПродажиКонтекст");  
	КонецЕсли;
	
	// Диаграмма "Динамика денег"
	СтруктураСерий = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "СуммаОстаток", НСтр("ru = 'Остаток'"), НСтр("ru = 'Остаток денег'"), ТипГистограмма, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "СуммаПриход", НСтр("ru = 'Поступления'"), НСтр("ru = 'Поступления денег'"), ТипГистограмма, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "СуммаРасход", НСтр("ru = 'Списания'"), НСтр("ru = 'Списания денег'"), ТипГистограмма, Истина);
	СтруктураТочек = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "День", НСтр("ru = 'Дни'"),,,, "ДЛФ=D");
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Неделя", НСтр("ru = 'Недели'"),,,, "ДЛФ=D");
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Месяц", НСтр("ru = 'Месяцы'"),,,, "ДФ='МММ гггг'");
	ДобавитьДиаграмму("ДинамикаДенег", НСтр("ru = 'Деньги (динамика)'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_РН_ДенежныеСредства", "Отчет.ДенежныеСредства", "Ведомость");  
	
	// Диаграмма "Структура денег"
	СтруктураСерий = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "БанковскийСчетКасса", НСтр("ru = 'Банковский счет / касса'"),, ТипКруговая);
	Если ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Валюта", НСтр("ru = 'Валюта'"),, ТипКруговая);
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Организация", НСтр("ru = 'Организация'"),, ТипКруговая);
	КонецЕсли;
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "ТипДенежныхСредств", НСтр("ru = 'Тип денежных средств'"),, ТипКруговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "ХозяйственнаяОперация", НСтр("ru = 'Хоз. операция'"),, ТипКруговая,,, "СуммаПриход,СуммаРасход");
	СтруктураОтбора = Новый Соответствие;
	МассивХозОпераций = ХозоперацииДС();
	СтруктураОтбора.Вставить("Отбор.Ссылка", МассивХозОпераций);
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ХозяйственнаяОперация", СтруктураОтбора);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Аналитика", НСтр("ru = 'Аналитика'"),, ТипКруговая,,, "СуммаПриход,СуммаРасход", СтруктураНастроек);
	СтруктураТочек = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "СуммаОстаток", НСтр("ru = 'Остаток'"), НСтр("ru = 'Остаток денег'"),, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "СуммаПриход", НСтр("ru = 'Поступления'"), НСтр("ru = 'Поступления денег'"),, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "СуммаРасход", НСтр("ru = 'Списания'"), НСтр("ru = 'Списания денег'"),, Истина);
	ДобавитьДиаграмму("СтруктураДенег", НСтр("ru = 'Структура денег'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_РН_ДенежныеСредстваДвижения", "Отчет.ДенежныеСредства", "Ведомость");  
	
	Если ПолучитьФункциональнуюОпцию("ОтображатьСчетаУчета") Тогда
		// Диаграмма "Динамика активов"
		СтруктураСерий = Новый Структура;
		МассивПредставлений = Новый Массив;
		МассивПредставлений.Добавить(НСтр("ru = 'Долги нам'"));
		МассивПредставлений.Добавить(НСтр("ru = 'Деньги'"));
		МассивПредставлений.Добавить(НСтр("ru = 'Товары'"));
		МассивПредставлений.Добавить(НСтр("ru = 'Имущество'"));
		//@skip-check bsl-legacy-check-dynamic-feature-access
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Сумма", МассивПредставлений, НСтр("ru = 'Активы'"), ТипДиаграммы.ГрафикСОбластямиИНакоплением, Истина);
		СтруктураТочек = Новый Структура;
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "Время", НСтр("ru = 'Время'"),,,, "ДЛФ=D");
		ДобавитьДиаграмму("ДинамикаАктивов", НСтр("ru = 'Активы (динамика)'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_РБ_Управленческий", "Отчет.ЧистыеАктивы", "Активы", Истина);  

		// Диаграмма "Динамика пассивов"
		СтруктураСерий = Новый Структура;
		МассивПредставлений = Новый Массив;
		МассивПредставлений.Добавить(НСтр("ru = 'Наши долги'"));
		МассивПредставлений.Добавить(НСтр("ru = 'Кредиты и займы'"));
		МассивПредставлений.Добавить(НСтр("ru = 'Налоги'"));
		//@skip-check bsl-legacy-check-dynamic-feature-access
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Сумма", МассивПредставлений, НСтр("ru = 'Пассивы'"), ТипДиаграммы.ГрафикСОбластямиИНакоплением, Истина);
		СтруктураТочек = Новый Структура;
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "Время", НСтр("ru = 'Время'"),,,, "ДЛФ=D");
		ДобавитьДиаграмму("ДинамикаПассивов", НСтр("ru = 'Пассивы (динамика)'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_РБ_Управленческий", "Отчет.ЧистыеАктивы", "Пассивы", Истина);  
	КонецЕсли;
	
	// Раздел CRM  
	// АПК:515-выкл
	// Показатели завязаны не на конкретные роли, а на право доступа к подсистеме
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуCRM") И Пользователи.РолиДоступны("ПодсистемаCRM") Тогда  
	// АПК:515-вкл
		
		// Диаграммы по Лидам 
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЛиды") Тогда
			
			СтруктураСерий = Новый Структура;  
			
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Тег", НСтр("ru = 'Тег'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "ИсточникПривлечения", НСтр("ru = 'Источник привлечения'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Ответственный", НСтр("ru = 'Ответственный'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "ПервичноеПовторное", НСтр("ru = 'Первичное/повторное'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Результат", НСтр("ru = 'Результат'"),, ТипКруговая);
			
			СтруктураТочек = Новый Структура;    
			ДобавитьОписаниеСерииТочки(СтруктураТочек, "Количество", НСтр("ru = 'Количество'"), НСтр("ru = 'Количество'")); 
			ДобавитьДиаграмму("ЛидыОбороты", НСтр("ru = 'Лиды'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_Лиды","Отчет.АнализБазыЛидов","Основной",,,"CRMОбороты");  
			
			СтруктураСерий = Новый Структура;  
			
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Тег", НСтр("ru = 'Тег'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "ИсточникПривлечения", НСтр("ru = 'Источник привлечения'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Ответственный", НСтр("ru = 'Ответственный'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "ПервичноеПовторное", НСтр("ru = 'Первичное/повторное'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Результат", НСтр("ru = 'Результат'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Состояние", НСтр("ru = 'Состояние'"),, ТипКруговая);
			
			ДобавитьДиаграмму("Лиды", НСтр("ru = 'Лиды'"), СтруктураСерий, СтруктураТочек, Истина, "СКД_Лиды","Отчет.АнализБазыЛидов","Основной",,,"CRM");  
			
		КонецЕсли;
		
		// Диаграмма Покупатели по состояниям
		СтруктураСерий = Новый Структура;
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Состояние", НСтр("ru = 'Состояние'"),, ТипКруговая);
		
		СтруктураТочек = Новый Структура;    
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "Количество", НСтр("ru = 'Количество'"), НСтр("ru = 'Количество'")); 
		
		ДобавитьДиаграмму("ПокупателиПоСостояниямОбороты", НСтр("ru = 'Конверсия покупателей'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_Конверсия", "Отчет.ВоронкаПродаж", "ВоронкаПродажПоПокупателям",,, "CRMОбороты");  
		
		//  Диаграммы по Событиям    
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСобытия") Тогда
			
			СтруктураСерий = Новый Структура;
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "ТипСобытия", НСтр("ru = 'Тип события'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Состояние", НСтр("ru = 'Состояние события'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Важность", НСтр("ru = 'Важность события'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Ответственный", НСтр("ru = 'Ответственный'"),, ТипКруговая);
			
			СтруктураТочек = Новый Структура;    
			ДобавитьОписаниеСерииТочки(СтруктураТочек, "Количество", НСтр("ru = 'Количество'"), НСтр("ru = 'Количество'")); 
			
			ДобавитьДиаграмму("События", НСтр("ru = 'События'"), СтруктураСерий, СтруктураТочек, Истина, "СКД_События", "Отчет.КалендарьСобытий", "КалендарьСобытий",,, "CRM");  
			ДобавитьДиаграмму("СобытияОбороты", НСтр("ru = 'События'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_События", "Отчет.КалендарьСобытий", "КалендарьСобытий",,, "CRMОбороты");  
			
		КонецЕсли;
		
		// Диаграммы по Задачам   
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЗадачиСотрудников") Тогда	
			
			СтруктураСерий = Новый Структура;
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Ответственный", НСтр("ru = 'Ответственный'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Выполнена", НСтр("ru = 'Выполнена'"),, ТипКруговая);
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "Тег", НСтр("ru = 'Тег'"),, ТипКруговая);
			
			СтруктураТочек = Новый Структура;    
			ДобавитьОписаниеСерииТочки(СтруктураТочек, "Количество", НСтр("ru = 'Количество'"), НСтр("ru = 'Количество'")); 
			
			ДобавитьДиаграмму("Задачи", НСтр("ru = 'Задачи'"), СтруктураСерий, СтруктураТочек, Истина, "СКД_Задачи",,,,, "CRM");  
			ДобавитьДиаграмму("ЗадачиОбороты", НСтр("ru = 'Задачи'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_Задачи",,,,, "CRMОбороты");  
			
		КонецЕсли;
		
		
		// Диаграммы по Контрагентам
		СтруктураСерий = Новый Структура; 
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуCRM") Тогда
			ДобавитьОписаниеСерииТочки(СтруктураСерий, "ИсточникПривлечения", НСтр("ru = 'Источник привлечения'"),, ТипКруговая);
		КонецЕсли; 
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Тег", НСтр("ru = 'Тег'"),, ТипКруговая);   
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Ответственный", НСтр("ru = 'Ответственный'"),, ТипКруговая);
		
		СтруктураТочек = Новый Структура;    
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "Количество", НСтр("ru = 'Количество'"), НСтр("ru = 'Количество'")); 
		
		ДобавитьДиаграмму("Контрагенты", НСтр("ru = 'Контрагенты'"), СтруктураСерий, СтруктураТочек, Истина, "СКД_Контрагенты", "Отчет.АнализБазыКонтрагентов", "Основной",,, "CRM");  
		ДобавитьДиаграмму("КонтрагентыОбороты", НСтр("ru = 'Контрагенты'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_Контрагенты", "Отчет.АнализБазыКонтрагентов", "Основной",,, "CRMОбороты");  
		
		// Диаграммы по Заказам покупателя  
		СтруктураСерий = Новый Структура;
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "ВидЗаказа", НСтр("ru = 'Вид заказа'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "ВариантЗавершения", НСтр("ru = 'Вариант завершения'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Ответственный", НСтр("ru = 'Ответственный'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Организация", НСтр("ru = 'Организация'"),, ТипКруговая); 
		
		СтруктураТочек = Новый Структура;    
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "Количество", НСтр("ru = 'Количество'"), НСтр("ru = 'Количество'")); 
		ДобавитьОписаниеСерииТочки(СтруктураТочек, "Сумма", НСтр("ru = 'Сумма'"), НСтр("ru = 'Сумма'")); 
		ДобавитьДиаграмму("ЗаказыПокупателяОбороты", НСтр("ru = 'Заказы покупателя'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_Заказы", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПокупателейКонтекст",,, "CRMОбороты");  
		
		СтруктураСерий = Новый Структура;
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "ВидЗаказа", НСтр("ru = 'Вид заказа'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "ВариантЗавершения", НСтр("ru = 'Вариант завершения'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Ответственный", НСтр("ru = 'Ответственный'"),, ТипКруговая);
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Организация", НСтр("ru = 'Организация'"),, ТипКруговая); 	
		ДобавитьОписаниеСерииТочки(СтруктураСерий, "Состояние", НСтр("ru = 'Состояние'"),, ТипКруговая);
		
		ДобавитьДиаграмму("ЗаказыПокупателя", НСтр("ru = 'Заказы покупателей'"), СтруктураСерий, СтруктураТочек, Истина, "СКД_Заказы", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПокупателейКонтекст",,, "CRM");  
		
		// Группировочные диаграммы  
		
		ДобавитьДиаграмму("CRM", НСтр("ru = 'CRM'"), Новый Структура, Новый Структура, Ложь,,,,, Истина);  
		ДобавитьДиаграмму("CRMОбороты", НСтр("ru = 'CRM (динамика)'"), Новый Структура, Новый Структура, Ложь,,,,, Истина);  
	КонецЕсли; 

	НастройкиДиаграмм.Сортировать("Представление");

	// Прочие операции инициализации
	
	ЗаполнитьСписокОрганизаций();
	
	СимволРеглВалюты = УправлениеНебольшойФирмойПовтИсп.ПолучитьСимвольноеПредставлениеВалюты(
	УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	
	ОпределитьРежимыВводаОстатков();
	
	Если ЭтоИнтерфейс85 Тогда
		
		МассивДат = Новый Массив;
		МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтойНедели));
		МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца));
		МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоКвартала));
		МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоПолугодия));
		МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоГода));
		
		Элементы.ДатаСравненияПредставление.СписокВыбора.Добавить(Неопределено, НСтр("ru = 'Не сравнивать'"));
		
		Для каждого ЭлементДата Из МассивДат Цикл
			Элементы.ДатаСравненияПредставление.СписокВыбора.Добавить(ЭлементДата, ПредставлениеСтандартнойДатыНачала(ЭлементДата, Дата));
		КонецЦикла;
		
		Элементы.ДатаСравненияПредставление.СписокВыбора.Добавить(Новый СтандартнаяДатаНачала, НСтр("ru = 'Произвольная дата'"));
		
		МассивПериодов = Новый Массив;
		МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня));
		МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтаНеделя));
		МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц));
		МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотКвартал));
		МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтоПолугодие));
		МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотГод));
	
		ПрошлыйГод = Новый Структура;
		ПрошлыйГод.Вставить("Вариант", "Последние7ДнейНеСчитаяТекущего");
		ПредыдущийПериод = УправлениеНебольшойФирмойКлиентСервер.Последние7ДнейНеСчитаяТекущего();
		ПрошлыйГод.Вставить("ДатаНачала", ПредыдущийПериод.ДатаНачала);
		ПрошлыйГод.Вставить("ДатаОкончания", ПредыдущийПериод.ДатаОкончания);
		МассивПериодов.Добавить(ПрошлыйГод);
		
		Элементы.ПериодСравненияПредставление.СписокВыбора.Добавить(Неопределено, НСтр("ru = 'Не сравнивать'"));
		
		Для каждого ЭлементПериод Из МассивПериодов Цикл
			Элементы.ПериодСравненияПредставление.СписокВыбора.Добавить(ЭлементПериод, ПредставлениеСтандартногоПериода(ЭлементПериод));
			Элементы.ПериодПредставление.СписокВыбора.Добавить(ЭлементПериод, ПредставлениеСтандартногоПериода(ЭлементПериод));
		КонецЦикла;
		
		Элементы.ПериодСравненияПредставление.СписокВыбора.Добавить(Новый СтандартныйПериод, НСтр("ru = 'Произвольный период'"));
		Элементы.ПериодПредставление.СписокВыбора.Добавить(Новый СтандартныйПериод, НСтр("ru = 'Произвольный период'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьРежимыВводаОстатков()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДенежныеСредства.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	|ГДЕ
	|	НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЗапасыНаСкладах.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах КАК ЗапасыНаСкладах
	|ГДЕ
	|	НЕ ЗапасыНаСкладах.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РасчетыСПокупателями.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями КАК РасчетыСПокупателями
	|ГДЕ
	|	НЕ РасчетыСПокупателями.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасчетыСПоставщиками.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|ГДЕ
	|	НЕ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков";
	
	Результат = Запрос.ВыполнитьПакет();
	Режимы = Новый Структура;
	Режимы.Вставить("Деньги", Результат.Получить(0).Пустой());
	Режимы.Вставить("Запасы", Результат.Получить(1).Пустой());
	Режимы.Вставить("Покупатели", Результат.Получить(2).Пустой());
	Режимы.Вставить("Поставщики", Результат.Получить(2).Пустой());
	РежимыВводаОстатков = Новый ФиксированнаяСтруктура(Режимы);
	
	ЕстьВводыОстатков = Ложь;
	Для каждого Режим Из РежимыВводаОстатков Цикл
		Если НЕ Режим.Значение Тогда
			ЕстьВводыОстатков = Истина;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиПериоды(СохраняемыеПериоды)
	
	Имена = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СохраняемыеПериоды);
	Для каждого Имя Из Имена Цикл
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПульсБизнеса", Имя, ЭтотОбъект[Имя]);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки(ВидНастроек = "")
	
	Если ПустаяСтрока(ВидНастроек) ИЛИ ВидНастроек="Показатели" Тогда     
		Таб = ДобавленныеПоказатели.Выгрузить(, "Показатель,Ресурс,Представление,Цвет,ИмяРодительскойГруппы,НомерКолонки,Фильтры,Настройки,СсылкаСвязи");
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПульсБизнеса", "Показатели", Таб);
	КонецЕсли;
	
	Если ПустаяСтрока(ВидНастроек) ИЛИ ВидНастроек="Диаграммы" Тогда  
		Таб = ДобавленныеДиаграммы.Выгрузить(, "Диаграмма,Серия,Точка,Представление,Период,ПериодСравнения,НомерКолонки,Фильтры,Настройки,ВходитВГруппу");
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПульсБизнеса", "Диаграммы", Таб);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиВиджетов()
	
	Если НЕ ЭтоИнтерфейс85 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПульсБизнеса", "ОтображатьТекущиеДела", ОтображатьТекущиеДела);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиВиджетов()
	
	Если НЕ ЭтоИнтерфейс85 Тогда
		Возврат;
	КонецЕсли;
	
	ОтображатьТекущиеДелаИзНастройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "ОтображатьТекущиеДела");
	
	Если ТипЗнч(ОтображатьТекущиеДелаИзНастройки) = Тип("Булево") Тогда
		ОтображатьТекущиеДела = ОтображатьТекущиеДелаИзНастройки;
	Иначе
		ОтображатьТекущиеДела = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиПериоды()
	
	Дата = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня);
	
	ТекДатаСравнения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "ДатаСравнения");
	Если ТипЗнч(ТекДатаСравнения)<>Тип("СтандартнаяДатаНачала") И ТипЗнч(ТекДатаСравнения)<>Тип("Структура") И ТекДатаСравнения<>Неопределено Тогда
		ТекДатаСравнения = Неопределено;
	КонецЕсли;
	ДатаСравнения = ТекДатаСравнения;
	
	ТекТипДатыСравнения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "ТипДатыСравнения");
	Если ТипЗнч(ТекТипДатыСравнения)<>Тип("Строка") Тогда
		ТекТипДатыСравнения = ТипДаты(ДатаСравнения);
	КонецЕсли; 
	ТипДатыСравнения = ТекТипДатыСравнения;
	
	ТекПериод = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "Период");
	Если ТипЗнч(ТекПериод)<>Тип("СтандартныйПериод") И ТипЗнч(ТекПериод)<>Тип("Структура") Тогда
		ТекПериод = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);
	КонецЕсли; 
	Период = ТекПериод;
	
	ТекТипПериода = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "ТипПериода");
	Если ТипЗнч(ТекТипПериода)<>Тип("Строка") Тогда
		ТекТипПериода = ТипПериода(Период);
	КонецЕсли; 
	ТипПериода = ТекТипПериода;
	
	ТекПериодСравнения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "ПериодСравнения");
	Если ТипЗнч(ТекПериодСравнения)<>Тип("СтандартныйПериод") И ТипЗнч(ТекПериодСравнения)<>Тип("Структура") И ТекПериодСравнения<>Неопределено Тогда
		ТекПериодСравнения = Неопределено;
	КонецЕсли; 
	ПериодСравнения = ТекПериодСравнения;
	
	ТекТипПериодаСравнения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "ТипПериодаСравнения");
	Если ТипЗнч(ТекТипПериодаСравнения)<>Тип("Строка") Тогда
		ТекТипПериодаСравнения = ТипПериода(ПериодСравнения);
	КонецЕсли; 
	ТипПериодаСравнения = ТекТипПериодаСравнения;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки()
	
	ТаблицаПоказателей = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "Показатели");
	ТаблицаДиаграмм = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "Диаграммы");
		
	Если ТаблицаПоказателей = Неопределено Тогда
		ПоказателиПоУмолчанию();
	Иначе
		ДобавленныеПоказатели.Очистить();
		ПорядковыйНомер = 0;
		Для каждого Стр Из ТаблицаПоказателей Цикл
			Если НЕ ПустаяСтрока(Стр.Ресурс) Тогда
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Показатель", Стр.Показатель);
				СтруктураОтбора.Вставить("Ресурс", Стр.Ресурс);
				Строки = НастройкиПоказателей.НайтиСтроки(СтруктураОтбора);
				Если Строки.Количество()=0 Тогда
					// Устаревший показатель
					Продолжить;
				КонецЕсли; 
			КонецЕсли;
			
			НоваяСтрока = ДобавленныеПоказатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			
			// Распределение показателей по новым колонкам
			ПорядковыйНомер = ПорядковыйНомер + 1;
			Если НоваяСтрока.НомерКолонки = 0 Тогда
				Если ПорядковыйНомер % 3 = 1 Тогда
					НоваяСтрока.НомерКолонки = 1;
				ИначеЕсли ПорядковыйНомер % 3 = 2 Тогда
					НоваяСтрока.НомерКолонки = 2;
				Иначе
					НоваяСтрока.НомерКолонки = 3;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(Стр.Ресурс) Тогда
				СтрНастроек = Строки[0];
				НоваяСтрока.ИдентификаторСтрокиНастроек = СтрНастроек.ПолучитьИдентификатор();
				НоваяСтрока.Остаток = СтрНастроек.Остаток;
				Если НЕ ПустаяСтрока(СтрНастроек.РазделУчета) Тогда
					НоваяСтрока.ВводОстатков = РежимыВводаОстатков[СтрНастроек.РазделУчета];
				КонецЕсли; 
				НоваяСтрока.Налоги = Стр.Показатель = "Налоги";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТаблицаДиаграмм = Неопределено Тогда
		ДиаграммыПоУмолчанию();
	Иначе
		ДобавленныеДиаграммы.Очистить();
		ПорядковыйНомер = 0;
		Для каждого Стр Из ТаблицаДиаграмм Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Диаграмма", ?(ТаблицаДиаграмм.Колонки.Найти("Показатель")=Неопределено, Стр.Диаграмма, Стр.Показатель));
			Строки = НастройкиДиаграмм.НайтиСтроки(СтруктураОтбора);
			Если Строки.Количество()=0 Тогда
				// Устаревшая диаграмма
				Продолжить;
			КонецЕсли;
			СтрокаНастройки = Строки[0];
			Если НЕ СтрокаНастройки.Серии.Свойство(Стр.Серия) ИЛИ НЕ СтрокаНастройки.Точки.Свойство(Стр.Точка) Тогда
				// Устаревшая диаграмма
				Продолжить;
			КонецЕсли; 
			НоваяСтрока = ДобавленныеДиаграммы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			
			// Распределение диаграмм по новым колонкам
			ПорядковыйНомер = ПорядковыйНомер + 1;
			Если НоваяСтрока.НомерКолонки = 0 Тогда
				Если ПорядковыйНомер % 2 <> 0 Тогда
					НоваяСтрока.НомерКолонки = 1;
				Иначе
					НоваяСтрока.НомерКолонки = 2;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ТаблицаДиаграмм.Колонки.Найти("Показатель")=Неопределено Тогда
				НоваяСтрока.Диаграмма = Стр.Показатель;
			КонецЕсли; 
			НоваяСтрока.ИдентификаторСтрокиНастроек = Строки[0].ПолучитьИдентификатор();
			Если ЗначениеЗаполнено(НоваяСтрока.ПериодСравнения) И ТипЗнч(НоваяСтрока.ПериодСравнения)=Тип("СтандартныйПериод") Тогда
				МассивПредставлений = Новый Массив;
				МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(НоваяСтрока.Период));
				МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(НоваяСтрока.ПериодСравнения, НоваяСтрока.Период));
				НоваяСтрока.ПредставленияСерий = Новый ФиксированныйМассив(МассивПредставлений);
			ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.ПериодСравнения) И ТипЗнч(НоваяСтрока.ПериодСравнения)=Тип("СтандартнаяДатаНачала") Тогда
				МассивПредставлений = Новый Массив;
				МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(НоваяСтрока.Период));
				МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(НоваяСтрока.ПериодСравнения, НоваяСтрока.Период));
				НоваяСтрока.ПредставленияСерий = Новый ФиксированныйМассив(МассивПредставлений);
			ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.ПериодСравнения) И ТипЗнч(НоваяСтрока.ПериодСравнения)=Тип("Структура") Тогда
				МассивПредставлений = Новый Массив;
				Если НоваяСтрока.ПериодСравнения.Вариант="ТакойЖеДеньНаПрошлойНеделе" 
					ИЛИ НоваяСтрока.ПериодСравнения.Вариант="ТакойЖеДеньВПрошломМесяце" 
					ИЛИ НоваяСтрока.ПериодСравнения.Вариант="ТакойЖеДеньВПрошломГоду" Тогда
					МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(НоваяСтрока.Период));
					МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(НоваяСтрока.ПериодСравнения, НоваяСтрока.Период));
				Иначе
					МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(НоваяСтрока.Период));
					МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(НоваяСтрока.ПериодСравнения, НоваяСтрока.Период));
				КонецЕсли; 
				НоваяСтрока.ПредставленияСерий = Новый ФиксированныйМассив(МассивПредставлений);
			Иначе
				НоваяСтрока.ПредставленияСерий = СтрокаНастройки.Серии[Стр.Серия].Представления;
			КонецЕсли; 
			НоваяСтрока.ПредставленияТочек = СтрокаНастройки.Точки[Стр.Точка].Представления;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказателиПоУмолчанию()
	
	Если ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж") И ЕстьРозничныеПродажиЗаПоследнююНеделю() Тогда
		
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня);
		ПериодСравнения = Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
		ДатаСравнения = Неопределено;
		ОбновитьПредставленияПериодов(ЭтотОбъект);
		
		ДобавленныеПоказатели.Очистить();
		ОтобразитьПоказатель("Деньги", "СуммаОстаток",, "Цвет5");
		ОтобразитьПоказатель("Розница", "СуммаОстаток", НСтр("ru = 'В кассах ККМ'"));
		ОтобразитьПоказатель("Долги", "ДолгиНам",, "Цвет2");
		ОтобразитьПоказатель("Долги", "ДолгиНаши",, "Цвет6");
		ОтобразитьПоказатель("Розница", "РозничныеПродажи");
		ОтобразитьПоказатель("Розница", "КоличествоЧеков"); 
		ОтобразитьПоказатель("Розница", "СреднийЧек"); 
		ОтобразитьПоказатель("Розница", "ПолученоНаличными"); 
		ОтобразитьПоказатель("Розница", "ПолученоКартами"); 
		ОтобразитьПоказатель("Деньги", "Платежи", НСтр("ru = 'Потрачено денег'")); 
		
	Иначе
		
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.СНачалаЭтогоГода);
		ПериодСравнения = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйГодДоТакойЖеДаты);
		ДатаСравнения = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтойНедели);
		ОбновитьПредставленияПериодов(ЭтотОбъект);
		
		ДобавленныеПоказатели.Очистить();
		ОтобразитьПоказатель("Деньги", "СуммаОстаток",, "Цвет5");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуСклад") Тогда
			ОтобразитьПоказатель("Товары", "СуммаОстаток", НСтр("ru = 'Товары'"));
		КонецЕсли;
		ОтобразитьПоказатель("Долги", "ДолгиНам",, "Цвет2");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") Тогда
			ОтобразитьПоказатель("Долги", "ДолгиНаши",, "Цвет6");
		КонецЕсли;
		Если ПолучитьФункциональнуюОпцию("ОтображатьСчетаУчета") Тогда
			ОтобразитьПоказатель("ФинАнализ", "ЧистыеАктивы", НСтр("ru = 'Чистые активы'"));
		КонецЕсли;
		ОтобразитьПоказатель("Продажи", "Выручка", НСтр("ru = 'Продажи'"));
		ОтобразитьПоказатель("Деньги", "Поступления", НСтр("ru = 'Поступления'"));
		ОтобразитьПоказатель("Деньги", "Платежи", НСтр("ru = 'Платежи'"));
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОтчетность") Тогда
		ОтобразитьПоказатель("Налоги", "ТекущиеПлатежи",, "Цвет3"); 
		ОтобразитьПоказатель("Налоги", "КоличествоТекущихПлатежей",, "Цвет3"); 
		ОтобразитьПоказатель("Налоги", "КоличествоТекущихДокументов",, "Цвет3"); 
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуCRM") Тогда
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЛиды") Тогда
			ОтобразитьПоказатель("CRM", "КоличествоЛидовВсего");
		КонецЕсли;
		
		ОтобразитьПоказатель("CRM", "КонверсияЗаказовПоИсточникамПривлеченияРасчет", НСтр("ru = 'Конверсия заказов'"));
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") Тогда // Дополнительный показатель для CRM без закупок
			ОтобразитьПоказатель("CRM", "КоличествоСобытийВсего", НСтр("ru = 'Количество событий'"));
		КонецЕсли;
		
	КонецЕсли;
	
	СохранитьНастройки("Показатели");
	СохранитьНастройкиПериоды("ДатаСравнения,Период,ПериодСравнения");
	
КонецПроцедуры

&НаСервере
Процедура ДиаграммыПоУмолчанию()
	
	Если ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж") И ЕстьРозничныеПродажиЗаПоследнююНеделю() Тогда
		
		ПериодДиаграмм = Новый Структура;
		ПериодДиаграмм.Вставить("Вариант", "Последние7ДнейНеСчитаяТекущего");
		
		Структура = СтруктураФильтра("РозничныеПродажи",, ИСТИНА);
		МассивФильтров = Новый Массив;
		МассивФильтров.Добавить(Структура);
		ОтобразитьДиаграмму(
		"ДинамикаПродаж", 
		"ПрибыльИСебестоимость", 
		"День", 
		ПериодДиаграмм,, 
		НСтр("ru = 'Динамика продаж'"),
		МассивФильтров);
		
		Структура = СтруктураФильтра("ХозяйственнаяОперация",, Справочники.ХозяйственныеОперации.НаРасходы);
		МассивФильтров = Новый Массив;
		МассивФильтров.Добавить(Структура);
		ОтобразитьДиаграмму(
		"СтруктураДенег", 
		"Аналитика", 
		"СуммаРасход", 
		ПериодДиаграмм,, 
		НСтр("ru = 'Структура списания денег'"), 
		МассивФильтров);
		
		ОтобразитьДиаграмму(
		"СтруктураРозничныхПродаж", 
		"КатегорияНоменклатуры", 
		"Сумма", 
		ПериодДиаграмм,, 
		НСтр("ru = 'Продажи по категориям'"));
		
		ОтобразитьДиаграмму(
		"СтруктураРозничныхПродаж", 
		"Склад", 
		"Сумма", 
		ПериодДиаграмм,, 
		НСтр("ru = 'Продажи по точкам'"));
		
		ОтобразитьДиаграмму(
		"СтруктураРозничныхПродаж", 
		"Склад", 
		"СреднийЧек", 
		ПериодДиаграмм,, 
		НСтр("ru = 'Средний чек по точкам'"));
		
	Иначе
		
		ПериодДиаграмм = Новый СтандартныйПериод(ВариантСтандартногоПериода.СНачалаЭтогоГода);
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") Тогда
			
			ОтобразитьДиаграмму(
			"ДинамикаПродаж", 
			"ПрибыльИСебестоимость", 
			"Месяц", 
			ПериодДиаграмм,, 
			НСтр("ru = 'Динамика продаж'"));
			
		Иначе
			
			ОтобразитьДиаграмму(
			"ДинамикаПродаж", 
			"Сумма", 
			"Месяц", 
			ПериодДиаграмм,, 
			НСтр("ru = 'Динамика продаж'"));
			
		КонецЕсли;
		
		Структура = СтруктураФильтра("ХозяйственнаяОперация",, Справочники.ХозяйственныеОперации.НаРасходы);
		МассивФильтров = Новый Массив;
		МассивФильтров.Добавить(Структура);
		ОтобразитьДиаграмму(
		"СтруктураДенег", 
		"Аналитика", 
		"СуммаРасход", 
		ПериодДиаграмм,, 
		НСтр("ru = 'Структура списания денег'"), 
		МассивФильтров);
		
	КонецЕсли; 
	
	СохранитьНастройки("Диаграммы");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьРозничныеПродажиЗаПоследнююНеделю()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПроверки", НачалоДня(ТекущаяДатаСеанса())-7*24*3600);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Продажи.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	(Продажи.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|			ИЛИ Продажи.Регистратор ССЫЛКА Документ.ЧекККМ
	|			ИЛИ Продажи.Регистратор ССЫЛКА Документ.ЧекККМВозврат)
	|	И Продажи.Период >= &ДатаПроверки";
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#Область ОбщиеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьИконкуПоказателя(Знач Показатель, Цвет,Ресурс = "")
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат ПолучитьИконкуПоказателяТакси(Показатель, Цвет, Ресурс);
	КонецЕсли;
	
	ИмяИконки = "ПульсБизнеса%1";
	
	Если Показатель = "CRM" Тогда 
		
		ИмяКартинки = ПолучитьИмяКартинкиДляПоказателейCRM(Показатель,Ресурс);
		ИмяИконки = СтрШаблон(ИмяИконки, ИмяКартинки);
		
	Иначе
		ИмяИконки = СтрШаблон(ИмяИконки, Показатель);
	КонецЕсли;
	
	Возврат БиблиотекаКартинок[ИмяИконки];
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИмяКартинкиДляПоказателейCRM(Показатель,Ресурс) 
	
	ИмяКартинки = "";
	Если СтрНайти(Ресурс,"Расчет") <> 0 Тогда
		ИмяКартинки	= "Конверсия"; 
	ИначеЕсли СтрНайти(Ресурс,"Лид") <> 0 Тогда
		ИмяКартинки	= "Лиды";
	ИначеЕсли СтрНайти(Ресурс,"Контрагент") <> 0 Тогда
		ИмяКартинки	= "Контрагенты"; 
	ИначеЕсли СтрНайти(Ресурс,"Событий") <> 0 Тогда
		ИмяКартинки	= "События"; 
	ИначеЕсли СтрНайти(Ресурс,"Задач") <> 0 Тогда
		ИмяКартинки	=  "Задачи"; 
	ИначеЕсли СтрНайти(Ресурс,"Сегмент") <> 0 Тогда
		ИмяКартинки	=  "Сегменты"; 
	КонецЕсли;
	
	Возврат Показатель + ИмяКартинки;
	
КонецФункции	

&НаСервереБезКонтекста
Функция СтруктураФильтра(Поле, ВидСравнения = Неопределено, Значение = Неопределено)
	
	СтруктураФильтра = Новый Структура;
	СтруктураФильтра.Вставить("Поле", Поле);
	СтруктураФильтра.Вставить("ВидСравнения", ?(ВидСравнения=Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения));
	СтруктураФильтра.Вставить("Значение", Значение);
	Возврат СтруктураФильтра;
	
КонецФункции 

&НаСервере
Функция ДобавитьКоманду(ИмяГруппы, Суффикс, Элемент, Действие, Заголовок, Картинка)
	
	ИмяКоманды = ИмяГруппы+Суффикс;
	Команда = Команды.Найти(ИмяКоманды);
	Если Команда=Неопределено Тогда
		Команда = Команды.Добавить(ИмяКоманды);
		Команда.Действие = Действие;
		Команда.Картинка = Картинка;
		Команда.Заголовок = Заголовок;
	КонецЕсли; 
	Кнопка = Элементы.Добавить(Команда.Имя+СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", ""), Тип("КнопкаФормы"), Элементы[Элемент.Имя+"КонтекстноеМеню"]);
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Кнопка.ИмяКоманды = Команда.Имя;
	Кнопка.Картинка = Картинка;
	Кнопка.Заголовок = Заголовок;
	Возврат Кнопка;
	
КонецФункции

&НаСервере
Функция ОтформатироватьЗначение(Значение, Стр)
	
	Если ТипЗнч(Значение)=Тип("ФорматированнаяСтрока") Тогда
		Возврат Значение;
	КонецЕсли; 
	
	Если ТипЗнч(Значение)=Тип("Строка") Тогда
		Возврат ВФорматированнуюСтроку(Значение);
	КонецЕсли; 
	
	СтрНастроек = НастройкиПоказателей.НайтиПоИдентификатору(Стр.ИдентификаторСтрокиНастроек);
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Если ПустаяСтрока(СтрНастроек.Формат) Тогда
			Результат = Строка(Значение);
		Иначе
			Результат = Формат(Значение, СтрНастроек.Формат);
		КонецЕсли;
	Иначе
		Если ЭтоИнтерфейс85 Тогда
			Результат = ?(СтрНастроек.Валютный И ЗначениеЗаполнено(Значение), Строка(Значение) + " " + СимволРеглВалюты, Строка(Значение));
		Иначе
			Если ПустаяСтрока(СтрНастроек.Формат) Тогда
				Результат = ВФорматированнуюСтроку(Строка(Значение));
			Иначе
				Результат = ВФорматированнуюСтроку(Формат(Значение, СтрНастроек.Формат));
			КонецЕсли;
			//@skip-check new-font
			Результат = Новый ФорматированнаяСтрока(
			Результат, 
			?(СтрНастроек.Валютный И ЗначениеЗаполнено(Значение), Новый ФорматированнаяСтрока(" "+СимволРеглВалюты, Новый Шрифт(Новый Шрифт,,8), ЦветаСтиля.ЦветТекстаФормы), ""));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВФорматированнуюСтроку(Строка, Ссылка = "")
	
	РазделительДробнойЧасти = Сред(Формат(0.1), 2,1);
	Если СтрЧислоВхождений(Строка, РазделительДробнойЧасти)>1 Тогда
		Возврат Новый ФорматированнаяСтрока(Строка,,,, Ссылка);
	КонецЕсли; 
	Позиция = СтрНайти(Строка, РазделительДробнойЧасти);
	Если Позиция=0 Тогда
		//@skip-check new-font
		Возврат Новый ФорматированнаяСтрока(Строка, Новый Шрифт(,,,,,Ложь), ЦветаСтиля.ЦветТекстаФормы,, Ссылка);
	Иначе
		ТекстДо = Лев(Строка, Позиция-1);
		ТекстПосле = Сред(Строка, Позиция);
		//@skip-check new-font
		Возврат Новый ФорматированнаяСтрока(Новый ФорматированнаяСтрока(ТекстДо, Новый Шрифт(,,,,,Ложь), ЦветаСтиля.ЦветТекстаФормы,, Ссылка),
		Новый ФорматированнаяСтрока(ТекстПосле, Новый Шрифт(,,,,,Ложь), ЦветаСтиля.ЦветТекстаФормы,, Ссылка));
	КонецЕсли; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ХозоперацииДС()
	
	МассивХозОпераций = Новый Массив;
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Аванс);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ВозвратЗаймаСотрудником);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ВозвратОплатыНаПлатежныеКарты);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ВозвратОплатыПокупателю);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ВыдачаЗаймаСотруднику);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Зарплата);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.КредитПолученный);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.НаРасходы);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Оплата);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПеремещениеВКассуККМ);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПеремещениеДС);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПеречислениеНалога);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Подотчетнику);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Покупателю);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПокупкаВалюты);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Поставщику);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПоступлениеОплатыОтПокупателя);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПоступлениеОплатыПоКартам);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.СписаниеНаРасходы);
	Возврат МассивХозОпераций;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредыдущийЭлемент(Элемент)
	
	Результат = Неопределено;
	Для каждого ТекЭлемент Из Элемент.Родитель.ПодчиненныеЭлементы Цикл
		Если Элемент=ТекЭлемент Тогда
			Прервать;
		КонецЕсли; 
		Результат = ТекЭлемент;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция СледующийЭлемент(Элемент)
	
	Результат = Неопределено;
	НайденТекущий = Ложь;
	НайденСледующий = Ложь;
	Для каждого ТекЭлемент Из Элемент.Родитель.ПодчиненныеЭлементы Цикл
		Если НайденСледующий Тогда
			Результат = ТекЭлемент;
			Прервать;
		КонецЕсли; 
		Если НайденТекущий И НЕ НайденСледующий Тогда
			НайденСледующий = Истина;
		КонецЕсли; 
		Если Элемент=ТекЭлемент Тогда
			НайденТекущий = Истина;
		КонецЕсли; 
	КонецЦикла;
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция НаборыРеквизитов(Группа, ИспользуютсяОбщиеДопРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ИспользуютсяОбщиеДопРеквизиты", ИспользуютсяОбщиеДопРеквизиты);
	НаборСвойств_Справочник_Номенклатура_Общие = УправлениеСвойствами.НаборСвойствПоИмени(
		"Справочник_Номенклатура_Общие");
	Запрос.УстановитьПараметр("НаборСвойств_Справочник_Номенклатура_Общие", НаборСвойств_Справочник_Номенклатура_Общие);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаборыДополнительныхРеквизитовИСведений.Ссылка
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|ГДЕ
	|	НаборыДополнительныхРеквизитовИСведений.Ссылка В ИЕРАРХИИ(&Группа)
	|	И НЕ НаборыДополнительныхРеквизитовИСведений.ЭтоГруппа
	|	И (НаборыДополнительныхРеквизитовИСведений.Ссылка <> &НаборСвойств_Справочник_Номенклатура_Общие
	|			ИЛИ &ИспользуютсяОбщиеДопРеквизиты)";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура УдалитьЭлементыРекурсивно(Группа)
	
	Пока Группа.ПодчиненныеЭлементы.Количество()>0 Цикл
		Элемент = Группа.ПодчиненныеЭлементы[0];
		Если ТипЗнч(Элемент)=Тип("КнопкаФормы") Тогда
			УдаляемаяКоманда = Команды.Найти(Элемент.ИмяКоманды);
			Если УдаляемаяКоманда <> Неопределено Тогда
				Команды.Удалить(УдаляемаяКоманда);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Элемент)=Тип("ГруппаФормы") Тогда
			УдалитьЭлементыРекурсивно(Элемент);
		КонецЕсли; 
		Элементы.Удалить(Элемент);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОрганизаций()
	
	Элементы.ФормаГруппаФильтрПоОрганизациям.Видимость = Ложь;
	
	Если Константы.УчетПоКомпании.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Организации КАК Организации";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОрганизаций = РезультатЗапроса.Выбрать();
	
	Если ВыборкаОрганизаций.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	СписокОрганизаций.Добавить(Неопределено, НСтр("ru = 'По всем организациям'"));
	
	Пока ВыборкаОрганизаций.Следующий() Цикл
		СписокОрганизаций.Добавить(ВыборкаОрганизаций.Ссылка, ВыборкаОрганизаций.Наименование);
	КонецЦикла;
	
	Для каждого Организация Из СписокОрганизаций Цикл
	
		КомандаФильтра = Команды.Добавить("ФильтрОрганизация_" + СписокОрганизаций.Индекс(Организация));
		КомандаФильтра.Действие = "Подключаемый_ОбработкаНажатияФильтраПоОрганизации";
		КомандаФильтра.Заголовок = ?(ЗначениеЗаполнено(Организация.Представление), Организация.Представление, Строка(Организация.Значение));
		Кнопка = Элементы.Добавить("Кнопка"+КомандаФильтра.Имя, Тип("КнопкаФормы"), Элементы.ФормаГруппаФильтрПоОрганизациям);
		Кнопка.ИмяКоманды = КомандаФильтра.Имя;
		Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		
		// Фильтр по всем организациям включен по умолчанию, поэтому кнопку нужно скрыть при иницализации
		Если Организация.Значение = Неопределено Тогда
			Кнопка.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ФормаГруппаФильтрПоОрганизациям.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьУдалитьКомандыПоказателей()
	
	Для каждого СтрокаПоказателя Из ДобавленныеПоказатели Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаПоказателя.ИмяГруппы) Тогда
			Продолжить;
		КонецЕсли;
		
		Если РежимРедактированияВключен Тогда
			ДобавитьКомандыПоказателя(СтрокаПоказателя);
		Иначе
			ГруппаКнопки = Элементы.Найти(СтрокаПоказателя.ИмяГруппы + "_Кнопки");
			Если ГруппаКнопки <> Неопределено Тогда
				Элементы.Удалить(ГруппаКнопки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьУдалитьКомандыДиаграмм()
	
	Для каждого СтрокаДиаграммы Из ДобавленныеДиаграммы Цикл
		
		Если РежимРедактированияВключен Тогда
			ДобавитьКомандыДиаграммы(СтрокаДиаграммы);
		Иначе
			ГруппаКнопки = Элементы.Найти(СтрокаДиаграммы.ИмяГруппы + "_Кнопки");
			Если ГруппаКнопки <> Неопределено Тогда
				Элементы.Удалить(ГруппаКнопки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьКолонкуДляДобавления(ЛеваяКолонка, ЦентральнаяКолонка, ПраваяКолонка, КолонкаСКнопкойДобавления = "")
	
	КоличествоВКолонке1 = ЛеваяКолонка.ПодчиненныеЭлементы.Количество() + ?(КолонкаСКнопкойДобавления = "Лево", -1, 0);
	КоличествоВКолонке2 = ЦентральнаяКолонка.ПодчиненныеЭлементы.Количество() + ?(КолонкаСКнопкойДобавления = "Центр", -1, 0);
	КоличествоВКолонке3 = ПраваяКолонка.ПодчиненныеЭлементы.Количество() + ?(КолонкаСКнопкойДобавления = "Право", -1, 0);
	
	МинимальноеКоличество = Мин(КоличествоВКолонке1, КоличествоВКолонке2, КоличествоВКолонке3);
	
	// Возвращаем первую колонку с минимальным количеством элементов
	Если КоличествоВКолонке1 = МинимальноеКоличество Тогда
		Возврат ЛеваяКолонка;
	ИначеЕсли КоличествоВКолонке2 = МинимальноеКоличество Тогда
		Возврат ЦентральнаяКолонка;
	Иначе
		Возврат ПраваяКолонка;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СоздатьУдалитьДекорацииДобавления()
	
	Если РежимРедактированияВключен Тогда
		
		РодительскаяГруппаОстатки = ОпределитьКолонкуДляДобавления(Элементы.ГруппаПоказателиОстаткиЛево, Элементы.ГруппаПоказателиОстаткиЦентр, Элементы.ГруппаПоказателиОстаткиПраво);
		РодительскаяГруппаОбороты = ОпределитьКолонкуДляДобавления(Элементы.ГруппаПоказателиОборотыЛево, Элементы.ГруппаПоказателиОборотыЦентр, Элементы.ГруппаПоказателиОборотыПраво);
		
		Если Элементы.ГруппаДиаграммыЛево.ПодчиненныеЭлементы.Количество() <= Элементы.ГруппаДиаграммыПраво.ПодчиненныеЭлементы.Количество() Тогда
			РодительскаяГруппаДиаграммы = Элементы.ГруппаДиаграммыЛево;
		Иначе
			РодительскаяГруппаДиаграммы = Элементы.ГруппаДиаграммыПраво;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
			РодительскаяГруппаОстатки = Элементы.ГруппаПоказателиОстаткиЛево;
			РодительскаяГруппаОбороты = Элементы.ГруппаПоказателиОборотыЛево;
		КонецЕсли;
		
		Если НЕ ЭтоИнтерфейс85 Тогда
			
			ДекорацияДобавитьПоказательОстатки = Элементы.Добавить("ДекорацияДобавитьПоказательОстатки", Тип("ДекорацияФормы"), РодительскаяГруппаОстатки);
			ДекорацияДобавитьПоказательОстатки.Вид = ВидДекорацииФормы.Картинка;
			ДекорацияДобавитьПоказательОстатки.Картинка = БиблиотекаКартинок.ПульсБизнесаДобавитьПоказатель;
			ДекорацияДобавитьПоказательОстатки.Гиперссылка = Истина;
			ДекорацияДобавитьПоказательОстатки.Высота = 3;
			ДекорацияДобавитьПоказательОстатки.Ширина = 35;
			ДекорацияДобавитьПоказательОстатки.РазмерКартинки = РазмерКартинки.Пропорционально;
			ДекорацияДобавитьПоказательОстатки.УстановитьДействие("Нажатие", "Подключаемый_ДобавитьПоказатель");
			
			ДекорацияДобавитьПоказательОбороты = Элементы.Добавить("ДекорацияДобавитьПоказательОбороты", Тип("ДекорацияФормы"), РодительскаяГруппаОбороты);
			ДекорацияДобавитьПоказательОбороты.Вид = ВидДекорацииФормы.Картинка;
			ДекорацияДобавитьПоказательОбороты.Картинка = БиблиотекаКартинок.ПульсБизнесаДобавитьПоказатель;
			ДекорацияДобавитьПоказательОбороты.Гиперссылка = Истина;
			ДекорацияДобавитьПоказательОбороты.Высота = 3;
			ДекорацияДобавитьПоказательОбороты.Ширина = 35;
			ДекорацияДобавитьПоказательОбороты.РазмерКартинки = РазмерКартинки.Пропорционально;
			ДекорацияДобавитьПоказательОбороты.УстановитьДействие("Нажатие", "Подключаемый_ДобавитьПоказатель");
			
			ДекорацияДобавитьДиаграмму = Элементы.Добавить("ДекорацияДобавитьДиаграмму", Тип("ДекорацияФормы"), РодительскаяГруппаДиаграммы);
			ДекорацияДобавитьДиаграмму.Вид = ВидДекорацииФормы.Картинка;
			ДекорацияДобавитьДиаграмму.Картинка = БиблиотекаКартинок.ПульсБизнесаДобавитьДиаграмму;
			ДекорацияДобавитьДиаграмму.Гиперссылка = Истина;
			ДекорацияДобавитьДиаграмму.РазмерКартинки = РазмерКартинки.Пропорционально;
			ДекорацияДобавитьДиаграмму.Ширина = 52;
			ДекорацияДобавитьДиаграмму.РастягиватьПоГоризонтали = Ложь;
			Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
				ДекорацияДобавитьДиаграмму.Высота = 3;
				ДекорацияДобавитьДиаграмму.Ширина = 35;
			КонецЕсли;
			
			ДекорацияДобавитьДиаграмму.УстановитьДействие("Нажатие", "Подключаемый_ДобавитьДиаграммуНажатие");
			
		Иначе
			
			ГруппаДобавитьПоказательОстатки = Элементы.Добавить("ГруппаДобавитьПоказательОстатки", Тип("ГруппаФормы"), РодительскаяГруппаОстатки);
			ГруппаДобавитьПоказательОстатки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДобавитьПоказательОстатки.ОтображатьЗаголовок = Ложь;
			ГруппаДобавитьПоказательОстатки.ОтображатьКакКарточку = Истина;
			ГруппаДобавитьПоказательОстатки.Гиперссылка = Истина;
			ГруппаДобавитьПоказательОстатки.РастягиватьПоВертикали = Ложь;
			ГруппаДобавитьПоказательОстатки.РастягиватьПоГоризонтали = Истина;
			ГруппаДобавитьПоказательОстатки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаДобавитьПоказательОстатки.УстановитьДействие("Нажатие", "Подключаемый_ДобавитьПоказатель");
			ГруппаДобавитьПоказательОстатки.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
			ГруппаДобавитьПоказательОстатки.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
			
			ИконкаДобавитьОстатки = Элементы.Добавить(ГруппаДобавитьПоказательОстатки.Имя + "_Иконка", Тип("ДекорацияФормы"), ГруппаДобавитьПоказательОстатки);
			ИконкаДобавитьОстатки.Вид = ВидДекорацииФормы.Картинка;
			ИконкаДобавитьОстатки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
			ИконкаДобавитьОстатки.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
			
			ЗаголовокДобавитьОстатки = Элементы.Добавить(ГруппаДобавитьПоказательОстатки.Имя +"_Заголовок", Тип("ДекорацияФормы"), ГруппаДобавитьПоказательОстатки);
			ЗаголовокДобавитьОстатки.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			ЗаголовокДобавитьОстатки.РастягиватьПоГоризонтали = Истина;
			ЗаголовокДобавитьОстатки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
			ЗаголовокДобавитьОстатки.Шрифт = ШрифтыСтиля.ТекстВторогоУровня;
			ЗаголовокДобавитьОстатки.Высота = 2;
			ЗаголовокДобавитьОстатки.Заголовок = НСтр("ru = 'Добавить показатель'");
			ЗаголовокДобавитьОстатки.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
			
			// Обороты
			
			ГруппаДобавитьПоказательОбороты = Элементы.Добавить("ГруппаДобавитьПоказательОбороты", Тип("ГруппаФормы"), РодительскаяГруппаОбороты);
			ГруппаДобавитьПоказательОбороты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДобавитьПоказательОбороты.ОтображатьЗаголовок = Ложь;
			ГруппаДобавитьПоказательОбороты.ОтображатьКакКарточку = Истина;
			ГруппаДобавитьПоказательОбороты.Гиперссылка = Истина;
			ГруппаДобавитьПоказательОбороты.РастягиватьПоВертикали = Ложь;
			ГруппаДобавитьПоказательОбороты.РастягиватьПоГоризонтали = Истина;
			ГруппаДобавитьПоказательОбороты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаДобавитьПоказательОбороты.УстановитьДействие("Нажатие", "Подключаемый_ДобавитьПоказатель");
			ГруппаДобавитьПоказательОбороты.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
			ГруппаДобавитьПоказательОбороты.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
			ГруппаДобавитьПоказательОбороты.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
			ИконкаДобавитьОбороты = Элементы.Добавить(ГруппаДобавитьПоказательОбороты.Имя + "_Иконка", Тип("ДекорацияФормы"), ГруппаДобавитьПоказательОбороты);
			ИконкаДобавитьОбороты.Вид = ВидДекорацииФормы.Картинка;
			ИконкаДобавитьОбороты.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
			ИконкаДобавитьОбороты.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
			
			ЗаголовокДобавитьОбороты = Элементы.Добавить(ГруппаДобавитьПоказательОбороты.Имя +"_Заголовок", Тип("ДекорацияФормы"), ГруппаДобавитьПоказательОбороты);
			ЗаголовокДобавитьОбороты.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			ЗаголовокДобавитьОбороты.РастягиватьПоГоризонтали = Истина;
			ЗаголовокДобавитьОбороты.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
			ЗаголовокДобавитьОбороты.Шрифт = ШрифтыСтиля.ТекстВторогоУровня;
			ЗаголовокДобавитьОбороты.Высота = 2;
			ЗаголовокДобавитьОбороты.Заголовок = НСтр("ru = 'Добавить показатель'");
			ЗаголовокДобавитьОбороты.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
			
			// Диаграмма
			ГруппаДобавитьДиаграмму = Элементы.Добавить("ГруппаДобавитьДиаграмму", Тип("ГруппаФормы"), РодительскаяГруппаДиаграммы);
			ГруппаДобавитьДиаграмму.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДобавитьДиаграмму.ОтображатьЗаголовок = Ложь;
			ГруппаДобавитьДиаграмму.ОтображатьКакКарточку = Истина;
			ГруппаДобавитьДиаграмму.Гиперссылка = Истина;
			ГруппаДобавитьДиаграмму.РастягиватьПоВертикали = Ложь;
			ГруппаДобавитьДиаграмму.РастягиватьПоГоризонтали = Истина;
			ГруппаДобавитьДиаграмму.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаДобавитьДиаграмму.УстановитьДействие("Нажатие", "Подключаемый_ДобавитьПоказатель");
			ГруппаДобавитьДиаграмму.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
			
			ИконкаДобавитьДиаграмму = Элементы.Добавить(ГруппаДобавитьДиаграмму.Имя + "_Иконка", Тип("ДекорацияФормы"), ГруппаДобавитьДиаграмму);
			ИконкаДобавитьДиаграмму.Вид = ВидДекорацииФормы.Картинка;
			ИконкаДобавитьДиаграмму.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
			ИконкаДобавитьДиаграмму.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
			
			ЗаголовокДобавитьДиаграмму = Элементы.Добавить(ГруппаДобавитьДиаграмму.Имя +"_Заголовок", Тип("ДекорацияФормы"), ГруппаДобавитьДиаграмму);
			ЗаголовокДобавитьДиаграмму.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			ЗаголовокДобавитьДиаграмму.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
			ЗаголовокДобавитьДиаграмму.Шрифт = ШрифтыСтиля.ТекстВторогоУровня;
			ЗаголовокДобавитьДиаграмму.Высота = 3;
			ЗаголовокДобавитьДиаграмму.Заголовок = НСтр("ru = 'Добавить диаграмму'");
			ЗаголовокДобавитьДиаграмму.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
			
			ГруппаДобавитьДиаграмму.УстановитьДействие("Нажатие", "Подключаемый_ДобавитьДиаграммуНажатие");
			
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЭтоИнтерфейс85 Тогда
			
			ДекорацияДобавитьДиаграмму = Элементы.Найти("ДекорацияДобавитьДиаграмму");
			Если ДекорацияДобавитьДиаграмму <> Неопределено Тогда
				Элементы.Удалить(ДекорацияДобавитьДиаграмму);
			КонецЕсли;
			
			ДекорацияДобавитьПоказательОбороты = Элементы.Найти("ДекорацияДобавитьПоказательОбороты");
			Если ДекорацияДобавитьПоказательОбороты <> Неопределено Тогда
				Элементы.Удалить(ДекорацияДобавитьПоказательОбороты);
			КонецЕсли;
			
			ДекорацияДобавитьПоказательОстатки = Элементы.Найти("ДекорацияДобавитьПоказательОстатки");
			Если ДекорацияДобавитьПоказательОстатки <> Неопределено Тогда
				Элементы.Удалить(ДекорацияДобавитьПоказательОстатки);
			КонецЕсли;
			
		Иначе
			
			ДекорацияДобавитьДиаграмму = Элементы.Найти("ГруппаДобавитьДиаграмму");
			Если ДекорацияДобавитьДиаграмму <> Неопределено Тогда
				Элементы.Удалить(ДекорацияДобавитьДиаграмму);
			КонецЕсли;
			
			ДекорацияДобавитьПоказательОбороты = Элементы.Найти("ГруппаДобавитьПоказательОстатки");
			Если ДекорацияДобавитьПоказательОбороты <> Неопределено Тогда
				Элементы.Удалить(ДекорацияДобавитьПоказательОбороты);
			КонецЕсли;
			
			ДекорацияДобавитьПоказательОстатки = Элементы.Найти("ГруппаДобавитьПоказательОбороты");
			Если ДекорацияДобавитьПоказательОстатки <> Неопределено Тогда
				Элементы.Удалить(ДекорацияДобавитьПоказательОстатки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоложениеДекорацийДобавитьПоказатель(СтрокаПоказателя)
	
	Если НЕ РежимРедактированияВключен Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаПоказателя.Остаток Тогда
		Если ЭтоИнтерфейс85 Тогда
			ДекорацияДобавитьПоказательОстатки = Элементы.Найти("ГруппаДобавитьПоказательОстатки");
		Иначе
			ДекорацияДобавитьПоказательОстатки = Элементы.Найти("ДекорацияДобавитьПоказательОстатки");
		КонецЕсли;
		
		Если ДекорацияДобавитьПоказательОстатки <> Неопределено Тогда
			
			Если ДекорацияДобавитьПоказательОстатки.Родитель = Элементы.ГруппаПоказателиОстаткиЛево Тогда
				РодительКнопкиДобавления = "Лево";
			ИначеЕсли ДекорацияДобавитьПоказательОстатки.Родитель = Элементы.ГруппаПоказателиОстаткиЦентр Тогда
				РодительКнопкиДобавления = "Центр";
			Иначе
				РодительКнопкиДобавления = "Право";
			КонецЕсли;
			
			РодительскаяГруппаОстатки = ОпределитьКолонкуДляДобавления(Элементы.ГруппаПоказателиОстаткиЛево, Элементы.ГруппаПоказателиОстаткиЦентр, Элементы.ГруппаПоказателиОстаткиПраво, РодительКнопкиДобавления);
			
			Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
				РодительскаяГруппаОстатки = Элементы.ГруппаПоказателиОстаткиЛево;
			КонецЕсли;
			
			Элементы.Переместить(ДекорацияДобавитьПоказательОстатки, РодительскаяГруппаОстатки);
			
		КонецЕсли;
	Иначе
		Если ЭтоИнтерфейс85 Тогда
			ДекорацияДобавитьПоказательОбороты = Элементы.Найти("ГруппаДобавитьПоказательОбороты");
		Иначе
			ДекорацияДобавитьПоказательОбороты = Элементы.Найти("ДекорацияДобавитьПоказательОбороты");
		КонецЕсли;
		Если ДекорацияДобавитьПоказательОбороты <> Неопределено Тогда
			
			Если ДекорацияДобавитьПоказательОбороты.Родитель = Элементы.ГруппаПоказателиОборотыЛево Тогда
				РодительКнопкиДобавления = "Лево";
			ИначеЕсли ДекорацияДобавитьПоказательОбороты.Родитель = Элементы.ГруппаПоказателиОборотыЦентр Тогда
				РодительКнопкиДобавления = "Центр";
			Иначе
				РодительКнопкиДобавления = "Право";
			КонецЕсли;
			
			РодительскаяГруппаОбороты = ОпределитьКолонкуДляДобавления(Элементы.ГруппаПоказателиОборотыЛево, Элементы.ГруппаПоказателиОборотыЦентр, Элементы.ГруппаПоказателиОборотыПраво, РодительКнопкиДобавления);
			
			Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
				РодительскаяГруппаОбороты = Элементы.ГруппаПоказателиОборотыЛево;
			КонецЕсли;
			
			Элементы.Переместить(ДекорацияДобавитьПоказательОбороты, РодительскаяГруппаОбороты);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоложениеДекорацийДобавитьДиаграмму(СтрокаДиаграммы)
	
	Если НЕ РежимРедактированияВключен Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоИнтерфейс85 Тогда
		ДекорацияДобавитьДиаграмму = Элементы.Найти("ГруппаДобавитьДиаграмму");
	Иначе
		ДекорацияДобавитьДиаграмму = Элементы.Найти("ДекорацияДобавитьДиаграмму");
	КонецЕсли;
	Если ДекорацияДобавитьДиаграмму <> Неопределено Тогда
		
		КоличествоВЛевойКолонке = Элементы.ГруппаДиаграммыЛево.ПодчиненныеЭлементы.Количество();
		КоличествоВПравойКолонке = Элементы.ГруппаДиаграммыПраво.ПодчиненныеЭлементы.Количество();
		
		Если ДекорацияДобавитьДиаграмму.Родитель = Элементы.ГруппаДиаграммыЛево Тогда
			КоличествоВЛевойКолонке = КоличествоВЛевойКолонке - 1;
		Иначе
			КоличествоВПравойКолонке = КоличествоВПравойКолонке - 1;
		КонецЕсли;
		
		Если КоличествоВЛевойКолонке <= КоличествоВПравойКолонке Тогда
			РодительскаяГруппа = Элементы.ГруппаДиаграммыЛево;
		Иначе
			РодительскаяГруппа = Элементы.ГруппаДиаграммыПраво;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
			РодительскаяГруппа = Элементы.ГруппаДиаграммыЛево;
		КонецЕсли;
		
		Элементы.Переместить(ДекорацияДобавитьДиаграмму, РодительскаяГруппа);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандыПоказателя(СтрокаПоказателя)
	
	Если НЕ ЭтоИнтерфейс85 Тогда
		ДобавитьКомандыПоказателяТакси(СтрокаПоказателя);
		Возврат;
	КонецЕсли;
	
	Если НЕ РежимРедактированияВключен Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаЦентр = Элементы[СтрокаПоказателя.ИмяГруппы+"_Содержимое"];
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ГруппаКнопки = Элементы.Вставить(СтрокаПоказателя.ИмяГруппы + "_Кнопки", Тип("ГруппаФормы"), ГруппаЦентр);
		ГруппаКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаКнопки.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	Иначе
		ГруппаКнопки = Элементы.Вставить(СтрокаПоказателя.ИмяГруппы + "_Кнопки", Тип("ГруппаФормы"), ГруппаЦентр);
		ГруппаКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	КонецЕсли;
	
	ГруппаКнопки.ОтображатьЗаголовок = Ложь;
	//@skip-check bsl-legacy-check-expression-type
	ГруппаКнопки.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	ГруппаКнопки.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	ГруппаКнопки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ГруппаКнопки.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	
	КнопкаНастройкаПоказателя = Элементы.Добавить(СтрокаПоказателя.ИмяГруппы + "_Настройка", Тип("ДекорацияФормы"), ГруппаКнопки);
	КнопкаНастройкаПоказателя.Вид = ВидДекорацииФормы.Картинка;
	КнопкаНастройкаПоказателя.Картинка = БиблиотекаКартинок.ПульсБизнесаНастройкаПоказателя;
	КнопкаНастройкаПоказателя.ЦветКартинки = ЦветаПалитры.Серый90УНФ;
	КнопкаНастройкаПоказателя.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
	КнопкаНастройкаПоказателя.Гиперссылка = Истина;
	КнопкаНастройкаПоказателя.УстановитьДействие("Нажатие", "КонтекстНастроитьПоказатель");
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		КнопкаСместитьВверхПоказатель = Элементы.Добавить(СтрокаПоказателя.ИмяГруппы + "_СместитьВверх", Тип("ДекорацияФормы"), ГруппаКнопки);
		КнопкаСместитьВверхПоказатель.Вид = ВидДекорацииФормы.Картинка;
		КнопкаСместитьВверхПоказатель.Картинка = БиблиотекаКартинок.ПульсБизнесаСместитьВверх;
		КнопкаСместитьВверхПоказатель.ЦветКартинки = ЦветаПалитры.Серый90УНФ;
		КнопкаСместитьВверхПоказатель.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		КнопкаСместитьВверхПоказатель.Гиперссылка = Истина;
		КнопкаСместитьВверхПоказатель.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		КнопкаСместитьВверхПоказатель.УстановитьДействие("Нажатие", "КонтекстСместитьВверхПоказатель");
		
		КнопкаСместитьВнизПоказатель = Элементы.Добавить(СтрокаПоказателя.ИмяГруппы + "_СместитьВниз", Тип("ДекорацияФормы"), ГруппаКнопки);
		КнопкаСместитьВнизПоказатель.Вид = ВидДекорацииФормы.Картинка;
		КнопкаСместитьВнизПоказатель.ЦветКартинки = ЦветаПалитры.Серый90УНФ;
		КнопкаСместитьВнизПоказатель.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		КнопкаСместитьВнизПоказатель.Картинка = БиблиотекаКартинок.ПульсБизнесаСместитьВниз;
		КнопкаСместитьВнизПоказатель.Гиперссылка = Истина;
		КнопкаСместитьВнизПоказатель.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		КнопкаСместитьВнизПоказатель.УстановитьДействие("Нажатие", "КонтекстСместитьВнизПоказатель");
	Иначе
		КнопкаСписокПеремещенияПоказателей = Элементы.Добавить(СтрокаПоказателя.ИмяГруппы + "_ГруппаПеремещение", Тип("ДекорацияФормы"), ГруппаКнопки);
		КнопкаСписокПеремещенияПоказателей.Вид = ВидДекорацииФормы.Картинка;
		КнопкаСписокПеремещенияПоказателей.Картинка = БиблиотекаКартинок.ПульсБизнесаГруппаПеремещение;
		КнопкаСписокПеремещенияПоказателей.ЦветКартинки = ЦветаПалитры.Серый90УНФ;
		КнопкаСписокПеремещенияПоказателей.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		КнопкаСписокПеремещенияПоказателей.Гиперссылка = Истина;
		КнопкаСписокПеремещенияПоказателей.УстановитьДействие("Нажатие", "Подключаемый_ПеремещениеСписокНажатие");
	КонецЕсли;
	
	КнопкаУдаленияПоказателя = Элементы.Добавить(СтрокаПоказателя.ИмяГруппы + "_Удаление", Тип("ДекорацияФормы"), ГруппаКнопки);
	КнопкаУдаленияПоказателя.Вид = ВидДекорацииФормы.Картинка;
	КнопкаУдаленияПоказателя.Картинка = БиблиотекаКартинок.ПульсБизнесаУдалитьПоказатель;
	КнопкаУдаленияПоказателя.ЦветКартинки = ЦветаПалитры.Серый90УНФ;
	КнопкаУдаленияПоказателя.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
	КнопкаУдаленияПоказателя.Гиперссылка = Истина;
	КнопкаУдаленияПоказателя.УстановитьДействие("Нажатие", "КонтекстУдалитьПоказатель");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандыДиаграммы(СтрокаДиаграммы)
	
	Если НЕ РежимРедактированияВключен Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаЗаголовка = Элементы[СтрокаДиаграммы.ИмяГруппы+"_ГруппаЗаголовка"];
	ГруппаКнопки = Элементы.Добавить(СтрокаДиаграммы.ИмяГруппы + "_Кнопки", Тип("ГруппаФормы"), ГруппаЗаголовка);
	ГруппаКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКнопки.ОтображатьЗаголовок = Ложь;
	ГруппаКнопки.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаКнопки.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	ГруппаКнопки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	ГруппаКнопки.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	ГруппаКнопки.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	
	КнопкаНастройкаДиаграммы = Элементы.Добавить(СтрокаДиаграммы.ИмяГруппы + "_Настройка", Тип("ДекорацияФормы"), ГруппаКнопки);
	КнопкаНастройкаДиаграммы.Вид = ВидДекорацииФормы.Картинка;
	КнопкаНастройкаДиаграммы.Картинка = БиблиотекаКартинок.ПульсБизнесаНастройкаПоказателя;
	КнопкаНастройкаДиаграммы.ЦветКартинки = ЦветаПалитры.Серый90УНФ;
	КнопкаНастройкаДиаграммы.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
	КнопкаНастройкаДиаграммы.Гиперссылка = Истина;
	КнопкаНастройкаДиаграммы.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	КнопкаНастройкаДиаграммы.УстановитьДействие("Нажатие", "КонтекстНастроитьДиаграмму");
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		КнопкаСместитьВверхДиаграмму = Элементы.Добавить(СтрокаДиаграммы.ИмяГруппы + "_СместитьВверх", Тип("ДекорацияФормы"), ГруппаКнопки);
		КнопкаСместитьВверхДиаграмму.Вид = ВидДекорацииФормы.Картинка;
		КнопкаСместитьВверхДиаграмму.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		КнопкаСместитьВверхДиаграмму.ЦветКартинки = ЦветаПалитры.Серый90УНФ;
		КнопкаСместитьВверхДиаграмму.Картинка = БиблиотекаКартинок.ПульсБизнесаСместитьВверх;
		КнопкаСместитьВверхДиаграмму.Гиперссылка = Истина;
		КнопкаСместитьВверхДиаграмму.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		КнопкаСместитьВверхДиаграмму.УстановитьДействие("Нажатие", "КонтекстСместитьВверхДиаграмму");
		
		КнопкаСместитьВнизДиаграмму = Элементы.Добавить(СтрокаДиаграммы.ИмяГруппы + "_СместитьВниз", Тип("ДекорацияФормы"), ГруппаКнопки);
		КнопкаСместитьВнизДиаграмму.Вид = ВидДекорацииФормы.Картинка;
		КнопкаСместитьВнизДиаграмму.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		КнопкаСместитьВнизДиаграмму.ЦветКартинки = ЦветаПалитры.Серый90УНФ;
		КнопкаСместитьВнизДиаграмму.Картинка = БиблиотекаКартинок.ПульсБизнесаСместитьВниз;
		КнопкаСместитьВнизДиаграмму.Гиперссылка = Истина;
		КнопкаСместитьВнизДиаграмму.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		КнопкаСместитьВнизДиаграмму.УстановитьДействие("Нажатие", "КонтекстСместитьВнизДиаграмму");
	Иначе
		КнопкаСписокПеремещенияДиаграммы = Элементы.Добавить(СтрокаДиаграммы.ИмяГруппы + "_ГруппаПеремещение", Тип("ДекорацияФормы"), ГруппаКнопки);
		КнопкаСписокПеремещенияДиаграммы.Вид = ВидДекорацииФормы.Картинка;
		КнопкаСписокПеремещенияДиаграммы.Картинка = БиблиотекаКартинок.ПульсБизнесаГруппаПеремещение;
		КнопкаСписокПеремещенияДиаграммы.ЦветКартинки = ЦветаПалитры.Серый90УНФ;
		КнопкаСписокПеремещенияДиаграммы.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		КнопкаСписокПеремещенияДиаграммы.Гиперссылка = Истина;
		КнопкаСписокПеремещенияДиаграммы.УстановитьДействие("Нажатие", "Подключаемый_ПеремещениеДиаграммыНажатие");
	КонецЕсли;
	
	КнопкаУдаленияДиаграммы = Элементы.Добавить(СтрокаДиаграммы.ИмяГруппы + "_Удаление", Тип("ДекорацияФормы"), ГруппаКнопки);
	КнопкаУдаленияДиаграммы.Вид = ВидДекорацииФормы.Картинка;
	КнопкаУдаленияДиаграммы.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
	КнопкаУдаленияДиаграммы.ЦветКартинки = ЦветаПалитры.Серый90УНФ;
	КнопкаУдаленияДиаграммы.Картинка = БиблиотекаКартинок.ПульсБизнесаУдалитьПоказатель;
	КнопкаУдаленияДиаграммы.Гиперссылка = Истина;
	КнопкаУдаленияДиаграммы.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	КнопкаУдаленияДиаграммы.УстановитьДействие("Нажатие", "КонтекстУдалитьДиаграмму");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУдалитьИндикторУстановленныхФильтров()
	
	Если НЕ ЭтоИнтерфейс85 Тогда
		ДобавитьУдалитьИндикторУстановленныхФильтровТакси();
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаПоказателя Из ДобавленныеПоказатели Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаПоказателя.ИмяГруппы) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементПредупреждение = Элементы.Найти(СтрокаПоказателя.ИмяГруппы + "_Предупреждение");
		Если ЭлементПредупреждение <> Неопределено Тогда
			Элементы.Удалить(ЭлементПредупреждение);
		КонецЕсли;
		
		ГруппаЦентр = Элементы[СтрокаПоказателя.ИмяГруппы];
		СоседнийЭлемент = Элементы[СтрокаПоказателя.ИмяГруппы + "_Содержимое"];
		ДобавитьУдалитьПредупреждение(СтрокаПоказателя, ГруппаЦентр, СоседнийЭлемент, ВертикальноеПоложениеЭлемента.Авто);
		
	КонецЦикла;
	
	Для каждого СтрокаДиаграммы Из ДобавленныеДиаграммы Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДиаграммы.ИмяГруппы) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементПредупреждение = Элементы.Найти(СтрокаДиаграммы.ИмяГруппы + "_Предупреждение");
		Если ЭлементПредупреждение <> Неопределено Тогда
			Элементы.Удалить(ЭлементПредупреждение);
		КонецЕсли;
		
		ГруппаЗаголовка = Элементы[СтрокаДиаграммы.ИмяГруппы + "_ГруппаЗаголовка"];
		СоседнийЭлемент = Элементы[СтрокаДиаграммы.ИмяГруппы + "_Заголовок"];
		
		ДобавитьУдалитьПредупреждение(СтрокаДиаграммы, ГруппаЗаголовка, СоседнийЭлемент, ВертикальноеПоложениеЭлемента.Низ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУдалитьПредупреждение(СтрокаЭлемента, ГруппаДляПредупреждения, СоседнийЭлемент, ВертикальноеПоложение)
	
	Если НЕ ЗначениеЗаполнено(ФильтрПоОрганизации) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаЭлемента.Фильтры) = Тип("ФиксированныйМассив") Тогда
		
		Для каждого Фильтр Из СтрокаЭлемента.Фильтры Цикл
			
			Если Фильтр.Поле = "Организация" Тогда // Не локализуется
				
				ОрганизацииСовпадают = Фильтр.Значение = ФильтрПоОрганизации;
				Если (НЕ ОрганизацииСовпадают И Фильтр.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно)
					ИЛИ (ОрганизацииСовпадают И Фильтр.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно)
					ИЛИ Фильтр.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке 
					ИЛИ Фильтр.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
					
					ЭлементПредупреждение = Элементы.Вставить(СтрокаЭлемента.ИмяГруппы + "_Предупреждение", Тип("ДекорацияФормы"), ГруппаДляПредупреждения, СоседнийЭлемент);
					ЭлементПредупреждение.Вид = ВидДекорацииФормы.Картинка;
					ЭлементПредупреждение.Картинка = БиблиотекаКартинок.ПульсБизнесаПредупреждение;
					ЭлементПредупреждение.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
					ЭлементПредупреждение.Гиперссылка = Истина;
					ЭлементПредупреждение.Подсказка = НСтр("ru = 'Значение может не соответствовать выбранной организации, поскольку установлены собственные фильтры'");
					ЭлементПредупреждение.УстановитьДействие("Нажатие", "Подключаемый_НажатиеНаПредупреждение");
					ЭлементПредупреждение.ВертикальноеПоложениеВГруппе = ВертикальноеПоложение;
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ОтсутствуютЛиды()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лиды.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|ГДЕ
		|	Лиды.ЭтоГруппа = ЛОЖЬ
		|	И Лиды.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
    	Возврат Ложь;
	Иначе
    	Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтсутствуютКонтрагенты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ЛОЖЬ
		|	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
    	Возврат Ложь;
	Иначе
    	Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтсутствуютСобытия()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Событие.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
    	Возврат Ложь;
	Иначе
    	Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТаблицуЗначенийАльтернативнаяКартинкаСравнения()
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ТаблицаАльтернативныеСтрелочки = Новый ТаблицаЗначений;
	ТаблицаАльтернативныеСтрелочки.Колонки.Добавить("Показатель",  ОписаниеТиповСтрока);
	ТаблицаАльтернативныеСтрелочки.Колонки.Добавить("Ресурс",  ОписаниеТиповСтрока);
	
	СтрокаТаблицаАльтернативныеСтрелочки = ТаблицаАльтернативныеСтрелочки.Добавить();
	СтрокаТаблицаАльтернативныеСтрелочки.Показатель = "CRM";	
	СтрокаТаблицаАльтернативныеСтрелочки.Ресурс = "СреднееВремяЗаказаРасчет";
	
	Возврат ТаблицаАльтернативныеСтрелочки;
	
КонецФункции

#КонецОбласти

#Область ФиксированныеСтроки

&НаКлиентеНаСервереБезКонтекста
Функция ИмяСекцииОстатки()

	Возврат "Остатки";
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ИмяСекцииОбороты()

	Возврат "Оборот";
	
КонецФункции 

#КонецОбласти

#Область Показатели

&НаКлиенте
Процедура КонтекстНастроитьДиаграмму(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли; 
	ОткрытьФормуНастройкиДиаграммы(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстУдалитьДиаграмму(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	Оповещение = Новый ОписаниеОповещения("КонтекстУдалитьДиаграммуЗавершение", ЭтотОбъект, ИмяГруппы);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Удалить диаграмму?'"), РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстУдалитьДиаграммуЗавершение(Результат, ИмяГруппы) Экспорт
	
	Если Результат<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 	
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстУдалитьДиаграммуСервер(Строки[0].ПолучитьИдентификатор());
	#Если НЕ МобильныйКлиент Тогда
		//@skip-check bsl-legacy-check-expression-type
		ТекущийЭлемент = Элементы.Обновить;
	#КонецЕсли 
	
КонецПроцедуры

&НаСервере
Процедура КонтекстУдалитьДиаграммуСервер(Идентификатор)
	
	Стр = ДобавленныеДиаграммы.НайтиПоИдентификатору(Идентификатор);
	УдалитьЭлементыРекурсивно(Элементы[Стр.ИмяГруппы]);
	Элементы.Удалить(Элементы[Стр.ИмяГруппы]);
	ДобавленныеДиаграммы.Удалить(Стр);
	СохранитьНастройки("Диаграммы");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстСместитьВверхДиаграмму(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстСместитьВверхДиаграммуСервер(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура КонтекстСместитьВверхДиаграммуСервер(Идентификатор)
	
	Стр = ДобавленныеДиаграммы.НайтиПоИдентификатору(Идентификатор);
	Индекс = ДобавленныеДиаграммы.Индекс(Стр);
	Если Индекс=0 Тогда
		Возврат;
	КонецЕсли;
	Группа = Элементы[Стр.ИмяГруппы];
	ПредыдущаяГруппа = ПредыдущийЭлемент(Группа);
	Если ПредыдущаяГруппа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(Группа, Группа.Родитель, ПредыдущаяГруппа);
	
	Если Индекс >= 1 Тогда
		ДобавленныеДиаграммы.Сдвинуть(Индекс, -1);
	КонецЕсли;
	
	СохранитьНастройки("Диаграммы");
	ОбновитьПоложениеДекорацийДобавитьДиаграмму(Стр);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстСместитьВнизДиаграмму(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстСместитьВнизДиаграммуСервер(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура КонтекстСместитьВнизДиаграммуСервер(Идентификатор)
	
	Стр = ДобавленныеДиаграммы.НайтиПоИдентификатору(Идентификатор);
	Индекс = ДобавленныеДиаграммы.Индекс(Стр);
	
	Если Индекс=ДобавленныеДиаграммы.Количество()-1 Тогда
		Возврат;
	КонецЕсли;
	
	Группа = Элементы[Стр.ИмяГруппы];
	СледующаяГруппа = СледующийЭлемент(Группа);
	
	Если СледующаяГруппа=Неопределено Тогда
		Элементы.Переместить(Группа, Группа.Родитель);
	Иначе
		Элементы.Переместить(Группа, Группа.Родитель, СледующаяГруппа);
	КонецЕсли;
	
	ДобавленныеДиаграммы.Сдвинуть(Индекс, 1);
	СохранитьНастройки("Диаграммы");
	ОбновитьПоложениеДекорацийДобавитьДиаграмму(Стр);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура КонтекстРасшифроватьДиаграмму(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	РасшифроватьДиаграмму(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстНастроитьПоказатель(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли; 
	ОткрытьФормуНастройкиПоказателя(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстУдалитьПоказатель(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	Оповещение = Новый ОписаниеОповещения("КонтекстУдалитьПоказательЗавершение", ЭтотОбъект, ИмяГруппы);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Удалить показатель?'"), РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстУдалитьПоказательЗавершение(Результат, ИмяГруппы) Экспорт
	
	Если Результат<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 	
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	Индекс = ДобавленныеПоказатели.Индекс(Строки[0]);
	Индекс = ?(Индекс=0, 0, Индекс-1);
	КонтекстУдалитьПоказательСервер(Строки[0].ПолучитьИдентификатор());
	Если ДобавленныеПоказатели.Количество()>0 И НЕ ПустаяСтрока(ДобавленныеПоказатели[Индекс].ИмяГруппы) Тогда
		ТекущийЭлемент = Элементы[ДобавленныеПоказатели[Индекс].ИмяГруппы+"_Заголовок"];
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура КонтекстУдалитьПоказательСервер(Идентификатор)
	
	Стр = ДобавленныеПоказатели.НайтиПоИдентификатору(Идентификатор);
	УдалитьЭлементыРекурсивно(Элементы[Стр.ИмяГруппы]);
	Элементы.Удалить(Элементы[Стр.ИмяГруппы]);
	ОбновитьПоложениеДекорацийДобавитьПоказатель(Стр);
	ДобавленныеПоказатели.Удалить(Стр);
	СортироватьПоказатели();
	
	СохранитьНастройки("Показатели");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстСместитьВверхПоказатель(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстСместитьВверхПоказательСервер(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура КонтекстСместитьВверхПоказательСервер(Идентификатор)
	
	Стр = ДобавленныеПоказатели.НайтиПоИдентификатору(Идентификатор);
	Индекс = ДобавленныеПоказатели.Индекс(Стр);
	Группа = Элементы[Стр.ИмяГруппы];
	ПредыдущаяГруппа = ПредыдущийЭлемент(Группа);
	Если ПредыдущаяГруппа=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Элементы.Переместить(Группа, Группа.Родитель, ПредыдущаяГруппа);
	
	Если Индекс >= 1 Тогда
		ДобавленныеПоказатели.Сдвинуть(Индекс, -1);
	КонецЕсли;
	
	СортироватьПоказатели();
	СохранитьНастройки("Показатели");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстСместитьВнизПоказатель(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстСместитьВнизПоказательСервер(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура КонтекстСместитьВнизПоказательСервер(Идентификатор)
	
	Стр = ДобавленныеПоказатели.НайтиПоИдентификатору(Идентификатор);
	Индекс = ДобавленныеПоказатели.Индекс(Стр);
	Если Индекс=ДобавленныеПоказатели.Количество()-1 Тогда
		Возврат;
	КонецЕсли;
	Группа = Элементы[Стр.ИмяГруппы];
	СледующаяГруппа = СледующийЭлемент(Группа);
	Если СледующаяГруппа=Неопределено Тогда
		Элементы.Переместить(Группа, Группа.Родитель);
	Иначе
		Элементы.Переместить(Группа, Группа.Родитель, СледующаяГруппа);
	КонецЕсли; 
	ДобавленныеПоказатели.Сдвинуть(Индекс, 1);
	СортироватьПоказатели();
	СохранитьНастройки("Показатели");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстРасшифроватьПоказатель(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()= 0 Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИмяГруппы", Команда.Имя);
		Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество()= 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	РасшифроватьПоказатель(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстИзменитьКолонкуПоказатель(Команда, Направление)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстИзменитьКолонкуПоказательСервер(Строки[0].ПолучитьИдентификатор(), Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстИзменитьКолонкуДиаграмма(Команда, Направление)
	
	ИмяГруппы = Лев(Команда.Имя, СтрНайти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстИзменитьКолонкуДиаграммыСервер(Строки[0].ПолучитьИдентификатор(), Направление);
	
КонецПроцедуры

&НаСервере
Процедура КонтекстИзменитьКолонкуДиаграммыСервер(Идентификатор, Направление)
	
	ПостфиксЛево = "Лево"; // Не локализуется
	ПостфиксПраво = "Право"; // Не локализуется
	
	Стр = ДобавленныеДиаграммы.НайтиПоИдентификатору(Идентификатор);
	
	Группа = Элементы[Стр.ИмяГруппы];
	ИндексЭлемента = Группа.Родитель.ПодчиненныеЭлементы.Индекс(Группа);
	
	// Определяем колонку
	Если СтрНайти(Стр.ИмяРодительскойГруппы, ПостфиксЛево) <> 0 Тогда
		ИмяНовойГруппы = СтрЗаменить(Стр.ИмяРодительскойГруппы, ПостфиксЛево, ПостфиксПраво);
	Иначе
		ИмяНовойГруппы = СтрЗаменить(Стр.ИмяРодительскойГруппы, ПостфиксПраво, ПостфиксЛево);
	КонецЕсли;
	
	НоваяГруппа = Элементы[ИмяНовойГруппы];
	
	Если ИндексЭлемента <= НоваяГруппа.ПодчиненныеЭлементы.Количество() Тогда
		ТекущийЭлементНовойГруппы = НоваяГруппа.ПодчиненныеЭлементы.Получить(ИндексЭлемента);
		Элементы.Переместить(Группа, НоваяГруппа, ТекущийЭлементНовойГруппы);
	Иначе
		Элементы.Переместить(Группа, НоваяГруппа);
	КонецЕсли;
	
	Стр.ИмяРодительскойГруппы = ИмяНовойГруппы;
	
	СохранитьНастройки("Диаграммы");
	
	ОбновитьПоложениеДекорацийДобавитьДиаграмму(Стр);
	
КонецПроцедуры

&НаСервере
Процедура КонтекстИзменитьКолонкуПоказательСервер(Идентификатор, Направление)
	
	ПостфиксЛево = "Лево"; // Не локализуется
	ПостфиксЦентр = "Центр"; // Не локализуется
	ПостфиксПраво = "Право"; // Не локализуется
	
	СоответствиеПостфиксов = Новый Соответствие;
	СоответствиеПостфиксов.Вставить(1, ПостфиксЛево);
	СоответствиеПостфиксов.Вставить(2, ПостфиксЦентр);
	СоответствиеПостфиксов.Вставить(3, ПостфиксПраво);
	
	Стр = ДобавленныеПоказатели.НайтиПоИдентификатору(Идентификатор);
	
	Группа = Элементы[Стр.ИмяГруппы];
	ИндексЭлемента = Группа.Родитель.ПодчиненныеЭлементы.Индекс(Группа);
	
	Если Стр.НомерКолонки = 1 Тогда
		Если Направление = "Влево" Тогда
			Стр.НомерКолонки = 3;
		Иначе
			Стр.НомерКолонки = 2;
		КонецЕсли;
	ИначеЕсли Стр.НомерКолонки = 2 Тогда
		Если Направление = "Влево" Тогда
			Стр.НомерКолонки = 1;
		Иначе
			Стр.НомерКолонки = 3;
		КонецЕсли;
	Иначе // Правая колонка
		Если Направление = "Влево" Тогда
			Стр.НомерКолонки = 2;
		Иначе
			Стр.НомерКолонки = 1;
		КонецЕсли;
	КонецЕсли;
	
	ИмяНовойГруппы = СтрЗаменить(Стр.ИмяРодительскойГруппы, ПостфиксЛево, "");
	ИмяНовойГруппы = СтрЗаменить(ИмяНовойГруппы, ПостфиксЦентр, "");
	ИмяНовойГруппы = СтрЗаменить(ИмяНовойГруппы, ПостфиксПраво, "");
	
	ИмяНовойГруппы = ИмяНовойГруппы + СоответствиеПостфиксов.Получить(Стр.НомерКолонки);
	
	НоваяГруппа = Элементы[ИмяНовойГруппы];
	
	Если ИндексЭлемента <= НоваяГруппа.ПодчиненныеЭлементы.Количество() Тогда
		ТекущийЭлементНовойГруппы = НоваяГруппа.ПодчиненныеЭлементы.Получить(ИндексЭлемента);
		Элементы.Переместить(Группа, НоваяГруппа, ТекущийЭлементНовойГруппы);
	Иначе
		Элементы.Переместить(Группа, НоваяГруппа);
	КонецЕсли;
	
	Стр.ИмяРодительскойГруппы = ИмяНовойГруппы;
	
	СортироватьПоказатели();
	СохранитьНастройки("Показатели");
	
	ОбновитьПоложениеДекорацийДобавитьПоказатель(Стр);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыПоказателиТакси()
	
	// Кэшируем картинки
	ПульсБизнесаПоказательЛевыйВерхнийУгол = БиблиотекаКартинок.ПульсБизнесаПоказательЛевыйВерхнийУгол;
	ПульсБизнесаПоказательВерх = БиблиотекаКартинок.ПульсБизнесаПоказательВерх;
	ПульсБизнесаПоказательПравыйВерхнийУгол = БиблиотекаКартинок.ПульсБизнесаПоказательПравыйВерхнийУгол;
	ПульсБизнесаПоказательЛево = БиблиотекаКартинок.ПульсБизнесаПоказательЛево;
	ПульсБизнесаПоказательПраво = БиблиотекаКартинок.ПульсБизнесаПоказательПраво;
	ПульсБизнесаПоказательЛевыйНижнийУгол = БиблиотекаКартинок.ПульсБизнесаПоказательЛевыйНижнийУгол;
	ПульсБизнесаПоказательНиз = БиблиотекаКартинок.ПульсБизнесаПоказательНиз;
	ПульсБизнесаПоказательПравыйНижнийУгол = БиблиотекаКартинок.ПульсБизнесаПоказательПравыйНижнийУгол;
	
	ДекорацияДобавитьПоказательОстатки = Элементы.Найти("ДекорацияДобавитьПоказательОстатки");
	ДекорацияДобавитьПоказательОбороты = Элементы.Найти("ДекорацияДобавитьПоказательОбороты");
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	Для каждого Стр Из ДобавленныеПоказатели Цикл
		
		Если ПустаяСтрока(Стр.Ресурс) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(Стр.ИмяГруппы) Тогда
			
			Стр.ИмяГруппы = "Показатель" + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
			
			Если ЗначениеЗаполнено(Стр.ИмяРодительскойГруппы) Тогда
				
				ГруппыЗаполнены = Истина;
				
				РодительскаяГруппа = Элементы[Стр.ИмяРодительскойГруппы];
				
				// Новое распределение по колонкам
				Если Стр.НомерКолонки <> 0 Тогда
					Если Стр.НомерКолонки = 3 Тогда
						РодительскаяГруппа = ?(Стр.Остаток, Элементы.ГруппаПоказателиОстаткиПраво, Элементы.ГруппаПоказателиОборотыПраво);
					ИначеЕсли Стр.НомерКолонки = 2 Тогда
						РодительскаяГруппа = ?(Стр.Остаток, Элементы.ГруппаПоказателиОстаткиЦентр, Элементы.ГруппаПоказателиОборотыЦентр);
					Иначе
						РодительскаяГруппа = ?(Стр.Остаток, Элементы.ГруппаПоказателиОстаткиЛево, Элементы.ГруппаПоказателиОборотыЛево);
					КонецЕсли;
				КонецЕсли;
				
				Если ЭтоМобильныйКлиент Тогда
					Если Стр.Остаток Тогда
						РодительскаяГруппа = Элементы.ГруппаПоказателиОстаткиЛево;
					Иначе
						РодительскаяГруппа = Элементы.ГруппаПоказателиОборотыЛево;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				ГруппыЗаполнены = Ложь;
				
				Если Стр.Остаток Тогда
					
					Если РежимРедактированияВключен И ДекорацияДобавитьПоказательОстатки <> Неопределено Тогда
						РодительскаяГруппа = ДекорацияДобавитьПоказательОстатки.Родитель;
					Иначе
						Если Элементы.ГруппаПоказателиОстаткиЛево.ПодчиненныеЭлементы.Количество() <= Элементы.ГруппаПоказателиОстаткиПраво.ПодчиненныеЭлементы.Количество() Тогда
							РодительскаяГруппа = Элементы.ГруппаПоказателиОстаткиЛево;
						Иначе
							РодительскаяГруппа = Элементы.ГруппаПоказателиОстаткиПраво;
						КонецЕсли;
					КонецЕсли;
					
					Стр.ИмяРодительскойГруппы = РодительскаяГруппа.Имя;
					
					Если ЭтоМобильныйКлиент Тогда
						РодительскаяГруппа = Элементы.ГруппаПоказателиОстаткиЛево;
					КонецЕсли;
					
				Иначе
					
					Если РежимРедактированияВключен И ДекорацияДобавитьПоказательОбороты <> Неопределено Тогда
						РодительскаяГруппа = ДекорацияДобавитьПоказательОбороты.Родитель;
					Иначе
						Если Элементы.ГруппаПоказателиОборотыЛево.ПодчиненныеЭлементы.Количество() <= Элементы.ГруппаПоказателиОборотыПраво.ПодчиненныеЭлементы.Количество() Тогда
							РодительскаяГруппа = Элементы.ГруппаПоказателиОборотыЛево;
						Иначе
							РодительскаяГруппа = Элементы.ГруппаПоказателиОборотыПраво;
						КонецЕсли;
					КонецЕсли;
					
					Стр.ИмяРодительскойГруппы = РодительскаяГруппа.Имя;
					
					Если ЭтоМобильныйКлиент Тогда
						РодительскаяГруппа = Элементы.ГруппаПоказателиОборотыЛево;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ГруппыЗаполнены Тогда
				СохранитьНастройки("Показатели");
			КонецЕсли;
			
			Группа = Элементы.Добавить(Стр.ИмяГруппы, Тип("ГруппаФормы"), РодительскаяГруппа);
			
			// Верхняя группа
			Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			Группа.ОтображатьЗаголовок = Ложь;
			Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
			Группа.РастягиватьПоВертикали = Ложь;
			Группа.РастягиватьПоГоризонтали = Истина;
			Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			Группа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			Группа.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
			Группа.Высота = 3;
			
			// Декорация сверху
			ГруппаВерх = Элементы.Добавить(Стр.ИмяГруппы + "_Верх", Тип("ГруппаФормы"), Группа);
			ГруппаВерх.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаВерх.ОтображатьЗаголовок = Ложь;
			ГруппаВерх.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаВерх.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаВерх.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
			
			ЭлементДекорацияЛевыйВерхнийУгол = Элементы.Добавить(Стр.ИмяГруппы + "_ДекорацияЛевыйВерхнийУгол", Тип("ДекорацияФормы"), ГруппаВерх);
			ЭлементДекорацияЛевыйВерхнийУгол.Вид = ВидДекорацииФормы.Картинка;
			ЭлементДекорацияЛевыйВерхнийУгол.Картинка = ПульсБизнесаПоказательЛевыйВерхнийУгол;
			
			ЭлементДекорацияВерх = Элементы.Добавить(Стр.ИмяГруппы + "_ДекорацияВерх", Тип("ДекорацияФормы"), ГруппаВерх);
			ЭлементДекорацияВерх.Вид = ВидДекорацииФормы.Картинка;
			ЭлементДекорацияВерх.Картинка = ПульсБизнесаПоказательВерх;
			ЭлементДекорацияВерх.РастягиватьПоГоризонтали = Истина;
			ЭлементДекорацияВерх.РазмерКартинки = РазмерКартинки.Черепица;
			
			ЭлементДекорацияПравыйВерхнийУгол = Элементы.Добавить(Стр.ИмяГруппы + "_ДекорацияПравыйВерхнийУгол", Тип("ДекорацияФормы"), ГруппаВерх);
			ЭлементДекорацияПравыйВерхнийУгол.Вид = ВидДекорацииФормы.Картинка;
			ЭлементДекорацияПравыйВерхнийУгол.Картинка = ПульсБизнесаПоказательПравыйВерхнийУгол;
			
			ГруппаЦентр = Элементы.Добавить(Стр.ИмяГруппы + "_Центр", Тип("ГруппаФормы"), Группа);
			ГруппаЦентр.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаЦентр.ОтображатьЗаголовок = Ложь;
			ГруппаЦентр.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаЦентр.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаЦентр.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			
			// Декорация слева
			ЭлементДекорацияЛево = Элементы.Добавить(Стр.ИмяГруппы + "_ДекорацияЛево", Тип("ДекорацияФормы"), ГруппаЦентр);
			ЭлементДекорацияЛево.Вид = ВидДекорацииФормы.Картинка;
			ЭлементДекорацияЛево.Картинка = ПульсБизнесаПоказательЛево;
			ЭлементДекорацияЛево.РастягиватьПоВертикали = Истина;
			ЭлементДекорацияЛево.РазмерКартинки = РазмерКартинки.Черепица;
			
			// Иконка
			ЭлементДекорацияИконка = Элементы.Добавить(Стр.ИмяГруппы + "_Иконка", Тип("ДекорацияФормы"), ГруппаЦентр);
			ЭлементДекорацияИконка.Вид = ВидДекорацииФормы.Картинка;
			ЭлементДекорацияИконка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
			ЭлементДекорацияИконка.Картинка = ПолучитьИконкуПоказателя(Стр.Показатель,Стр.Цвет,Стр.Ресурс);
			ЭлементДекорацияИконка.Гиперссылка = Истина;
			ЭлементДекорацияИконка.УстановитьДействие("Нажатие", "Подключаемый_ПоказательЗначениеНажатие");
			
			// Содержимое показателя
			ГруппаСодержимое = Элементы.Добавить(Стр.ИмяГруппы + "_Содержимое", Тип("ГруппаФормы"), ГруппаЦентр);
			ГруппаСодержимое.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСодержимое.ОтображатьЗаголовок = Ложь;
			ГруппаСодержимое.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСодержимое.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаСодержимое.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			ГруппаСодержимое.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
			ГруппаСодержимое.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
			
			ЭлементЗаголовок = Элементы.Добавить(Стр.ИмяГруппы+"_Заголовок", Тип("ДекорацияФормы"), ГруппаСодержимое);
			ЭлементЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			ЭлементЗаголовок.РастягиватьПоГоризонтали = Истина;
			ЭлементЗаголовок.ПропускатьПриВводе = Ложь;
			//@skip-check new-font
			ЭлементЗаголовок.Шрифт = Новый Шрифт("Arial", 10, Истина);
			
			ГруппаСумма = Элементы.Добавить(Стр.ИмяГруппы + "_ГруппаСумма", Тип("ГруппаФормы"), ГруппаСодержимое);
			ГруппаСумма.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСумма.ОтображатьЗаголовок = Ложь;
			ГруппаСумма.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСумма.РастягиватьПоГоризонтали = Истина;
			ГруппаСумма.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаСумма.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			
			ИмяКоманды = Стр.ИмяГруппы + "_КонтекстРасшифроватьПоказатель";
			Команда = Команды.Найти(ИмяКоманды);
			Если Команда = Неопределено Тогда
				Команда = Команды.Добавить(ИмяКоманды);
				Команда.Действие = "КонтекстРасшифроватьПоказатель";
			КонецЕсли;
			
			ЭлементЗначение = Элементы.Добавить(Стр.ИмяГруппы+"_Значение", Тип("КнопкаФормы"), ГруппаСумма);
			ЭлементЗначение.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
			ЭлементЗначение.ИмяКоманды = Команда.Имя;
			ЭлементЗначение.ПропускатьПриВводе = Ложь;
			
			ЭлементВводОстатков = Элементы.Добавить(Стр.ИмяГруппы+"_ЗначениеВводОстатков", Тип("КнопкаФормы"), 
				ГруппаСумма);
			ЭлементВводОстатков.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
			ЭлементВводОстатков.ИмяКоманды = Команда.Имя;
			ЭлементВводОстатков.ПропускатьПриВводе = Ложь;
			ЭлементВводОстатков.Заголовок = НСтр("ru='ввести остатки'");
			ЭлементВводОстатков.Видимость = Ложь;			
			
			Если НЕ ПустаяСтрока(Стр.Ресурс) Тогда
				ЭлементСравнение = Элементы.Добавить(Стр.ИмяГруппы+"_Сравнение", Тип("ДекорацияФормы"), ГруппаСумма);
				ЭлементСравнение.Вид = ВидДекорацииФормы.Картинка;
				ЭлементСравнение.РастягиватьПоГоризонтали = Ложь;
				ЭлементСравнение.РастягиватьПоВертикали = Ложь;
				ЭлементСравнение.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
				ЭлементСравнение.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
			Иначе
				ЭлементЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
				ЭлементЗаголовок.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Низ;
				ЭлементЗаголовок.Высота = ?(ДобавленныеПоказатели.Индекс(Стр)=0, 1, 2);
			КонецЕсли;
			
			// Декорация справа
			ЭлементДекорацияПраво = Элементы.Добавить(Стр.ИмяГруппы + "_ДекорацияПраво", Тип("ДекорацияФормы"), ГруппаЦентр);
			ЭлементДекорацияПраво.Вид = ВидДекорацииФормы.Картинка;
			ЭлементДекорацияПраво.Картинка = ПульсБизнесаПоказательПраво;
			ЭлементДекорацияПраво.РастягиватьПоВертикали = Истина;
			ЭлементДекорацияПраво.РазмерКартинки = РазмерКартинки.Черепица;
			
			// Декорация снизу
			
			ГруппаНиз = Элементы.Добавить(Стр.ИмяГруппы + "_Низ", Тип("ГруппаФормы"), Группа);
			ГруппаНиз.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаНиз.ОтображатьЗаголовок = Ложь;
			ГруппаНиз.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаНиз.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаНиз.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
			
			ЭлементДекорацияЛевыйНижнийУгол = Элементы.Добавить(Стр.ИмяГруппы + "_ДекорацияЛевыйНижнийУгол", Тип("ДекорацияФормы"), ГруппаНиз);
			ЭлементДекорацияЛевыйНижнийУгол.Вид = ВидДекорацииФормы.Картинка;
			ЭлементДекорацияЛевыйНижнийУгол.Картинка = ПульсБизнесаПоказательЛевыйНижнийУгол;
			
			ЭлементДекорацияНиз = Элементы.Добавить(Стр.ИмяГруппы + "_ДекорацияНиз", Тип("ДекорацияФормы"), ГруппаНиз);
			ЭлементДекорацияНиз.Вид = ВидДекорацииФормы.Картинка;
			ЭлементДекорацияНиз.Картинка = ПульсБизнесаПоказательНиз;
			ЭлементДекорацияНиз.РастягиватьПоГоризонтали = Истина;
			ЭлементДекорацияНиз.РазмерКартинки = РазмерКартинки.Черепица;
			
			ЭлементДекорацияПравыйНижнийУгол = Элементы.Добавить(Стр.ИмяГруппы + "_ДекорацияПравыйНижнийУгол", Тип("ДекорацияФормы"), ГруппаНиз);
			ЭлементДекорацияПравыйНижнийУгол.Вид = ВидДекорацииФормы.Картинка;
			ЭлементДекорацияПравыйНижнийУгол.Картинка = ПульсБизнесаПоказательПравыйНижнийУгол;
			
			// Контекстное меню
			ДобавитьКоманду(Стр.ИмяГруппы, "_Настроить", ЭлементЗаголовок, "КонтекстНастроитьПоказатель", НСтр("ru = 'Настроить показатель'"), БиблиотекаКартинок.ПульсБизнесаНастройкаПоказателя);
			Кнопка = ДобавитьКоманду(Стр.ИмяГруппы, "_Удалить", ЭлементЗаголовок, "КонтекстУдалитьПоказатель", НСтр("ru = 'Удалить показатель'"), БиблиотекаКартинок.ПульсБизнесаУдалитьПоказатель);
			Если ПустаяСтрока(Стр.Ресурс) Тогда
				Кнопка.Заголовок = НСтр("ru = 'Удалить заголовок'");
			КонецЕсли; 
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вверх", ЭлементЗаголовок, "КонтекстСместитьВверхПоказатель", НСтр("ru = 'Сместить вверх'"), БиблиотекаКартинок.ПульсБизнесаСместитьВверх);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вниз", ЭлементЗаголовок, "КонтекстСместитьВнизПоказатель", НСтр("ru = 'Сместить вниз'"), БиблиотекаКартинок.ПульсБизнесаСместитьВниз);
			Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
				ДобавитьКоманду(Стр.ИмяГруппы, "_Колонка", ЭлементЗаголовок, "КонтекстИзменитьКолонкуПоказатель", НСтр("ru = 'Изменить колонку'"), БиблиотекаКартинок.ПульсБизнесаИзменитьКолонку);
			КонецЕсли;
			
			// Контекстное меню иконки
			ДобавитьКоманду(Стр.ИмяГруппы, "_Настроить", ЭлементДекорацияИконка, "КонтекстНастроитьПоказатель", НСтр("ru = 'Настроить показатель'"), БиблиотекаКартинок.ПульсБизнесаНастройкаПоказателя);
			Кнопка = ДобавитьКоманду(Стр.ИмяГруппы, "_Удалить", ЭлементДекорацияИконка, "КонтекстУдалитьПоказатель", НСтр("ru = 'Удалить показатель'"), БиблиотекаКартинок.ПульсБизнесаУдалитьПоказатель);
			Если ПустаяСтрока(Стр.Ресурс) Тогда
				Кнопка.Заголовок = НСтр("ru = 'Удалить заголовок'");
			КонецЕсли; 
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вверх", ЭлементДекорацияИконка, "КонтекстСместитьВверхПоказатель", НСтр("ru = 'Сместить вверх'"), БиблиотекаКартинок.ПульсБизнесаСместитьВверх);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вниз", ЭлементДекорацияИконка, "КонтекстСместитьВнизПоказатель", НСтр("ru = 'Сместить вниз'"), БиблиотекаКартинок.ПульсБизнесаСместитьВниз);
			Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
				ДобавитьКоманду(Стр.ИмяГруппы, "_Колонка", ЭлементДекорацияИконка, "КонтекстИзменитьКолонкуПоказатель", НСтр("ru = 'Изменить колонку'"), БиблиотекаКартинок.ПульсБизнесаИзменитьКолонку);
			КонецЕсли;
			
			ДобавитьКомандыПоказателя(Стр);
			ОбновитьПоложениеДекорацийДобавитьПоказатель(Стр);
			
		Иначе
			ЭлементЗаголовок = Элементы[Стр.ИмяГруппы+"_Заголовок"];
		КонецЕсли;
		Если ПустаяСтрока(Стр.Ресурс) Тогда
			//@skip-check new-font
			ЭлементЗаголовок.Заголовок = Новый ФорматированнаяСтрока(ВРег(Стр.Представление), Новый Шрифт(Новый Шрифт(),,, Истина));
		Иначе
			ЭлементЗаголовок.Заголовок = ВРег(Стр.Представление);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУдалитьИндикторУстановленныхФильтровТакси()
	
	Для каждого СтрокаПоказателя Из ДобавленныеПоказатели Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаПоказателя.ИмяГруппы) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементПредупреждение = Элементы.Найти(СтрокаПоказателя.ИмяГруппы + "_Предупреждение");
		Если ЭлементПредупреждение <> Неопределено Тогда
			Элементы.Удалить(ЭлементПредупреждение);
		КонецЕсли;
		
		ГруппаЦентр = Элементы[СтрокаПоказателя.ИмяГруппы + "_Центр"];
		
		Если РежимРедактированияВключен Тогда
			СоседнийЭлемент = Элементы[СтрокаПоказателя.ИмяГруппы + "_Кнопки"];
		Иначе
			СоседнийЭлемент = Элементы[СтрокаПоказателя.ИмяГруппы + "_ДекорацияПраво"];
		КонецЕсли;
		
		ДобавитьУдалитьПредупреждение(СтрокаПоказателя, ГруппаЦентр, СоседнийЭлемент, ВертикальноеПоложениеЭлемента.Авто);
		
	КонецЦикла;
	
	Для каждого СтрокаДиаграммы Из ДобавленныеДиаграммы Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДиаграммы.ИмяГруппы) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементПредупреждение = Элементы.Найти(СтрокаДиаграммы.ИмяГруппы + "_Предупреждение");
		Если ЭлементПредупреждение <> Неопределено Тогда
			Элементы.Удалить(ЭлементПредупреждение);
		КонецЕсли;
		
		ГруппаЗаголовка = Элементы[СтрокаДиаграммы.ИмяГруппы + "_ГруппаЗаголовка"];
		СоседнийЭлемент = Элементы[СтрокаДиаграммы.ИмяГруппы + "_Заголовок"];
		
		ДобавитьУдалитьПредупреждение(СтрокаДиаграммы, ГруппаЗаголовка, СоседнийЭлемент, ВертикальноеПоложениеЭлемента.Низ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандыПоказателяТакси(СтрокаПоказателя)
	
	Если НЕ РежимРедактированияВключен Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаЦентр = Элементы[СтрокаПоказателя.ИмяГруппы + "_Центр"];
	ДекорацияПраво = Элементы[СтрокаПоказателя.ИмяГруппы + "_ДекорацияПраво"];
	
	ГруппаКнопки = Элементы.Вставить(СтрокаПоказателя.ИмяГруппы + "_Кнопки", Тип("ГруппаФормы"), ГруппаЦентр, ДекорацияПраво);
	ГруппаКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКнопки.ОтображатьЗаголовок = Ложь;
	//@skip-check bsl-legacy-check-expression-type
	ГруппаКнопки.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаКнопки.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	ГруппаКнопки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ГруппаКнопки.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	
	КнопкаНастройкаПоказателя = Элементы.Добавить(СтрокаПоказателя.ИмяГруппы + "_Настройка", Тип("ДекорацияФормы"), ГруппаКнопки);
	КнопкаНастройкаПоказателя.Вид = ВидДекорацииФормы.Картинка;
	КнопкаНастройкаПоказателя.Картинка = БиблиотекаКартинок.ПульсБизнесаНастройкаПоказателя;
	КнопкаНастройкаПоказателя.Гиперссылка = Истина;
	КнопкаНастройкаПоказателя.УстановитьДействие("Нажатие", "КонтекстНастроитьПоказатель");
	
	КнопкаСписокПеремещенияПоказателей = Элементы.Добавить(СтрокаПоказателя.ИмяГруппы + "_ГруппаПеремещение", Тип("ДекорацияФормы"), ГруппаКнопки);
	КнопкаСписокПеремещенияПоказателей.Вид = ВидДекорацииФормы.Картинка;
	КнопкаСписокПеремещенияПоказателей.Картинка = БиблиотекаКартинок.ПульсБизнесаГруппаПеремещение;
	КнопкаСписокПеремещенияПоказателей.Гиперссылка = Истина;
	КнопкаСписокПеремещенияПоказателей.УстановитьДействие("Нажатие", "Подключаемый_ПеремещениеСписокНажатие");
	
	КнопкаУдаленияПоказателя = Элементы.Добавить(СтрокаПоказателя.ИмяГруппы + "_Удаление", Тип("ДекорацияФормы"), ГруппаКнопки);
	КнопкаУдаленияПоказателя.Вид = ВидДекорацииФормы.Картинка;
	КнопкаУдаленияПоказателя.Картинка = БиблиотекаКартинок.ПульсБизнесаУдалитьПоказатель;
	КнопкаУдаленияПоказателя.Гиперссылка = Истина;
	КнопкаУдаленияПоказателя.УстановитьДействие("Нажатие", "КонтекстУдалитьПоказатель");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИконкуПоказателяТакси(Знач Показатель, Цвет,Ресурс = "")
	
	ИмяИконки = "ПульсБизнеса%1%2";
	Если ЗначениеЗаполнено(Цвет) Тогда
		ЦветИконки = Цвет;
	Иначе
		ЦветИконки = "Цвет1" // Не локализуется
	КонецЕсли;
	
	Если Показатель = "CRM" Тогда 

		ИмяКартинки = ПолучитьИмяКартинкиДляПоказателейCRM(Показатель,Ресурс);
		ИмяИконки = СтрШаблон(ИмяИконки, ИмяКартинки, ЦветИконки);
		
	Иначе
		ИмяИконки = СтрШаблон(ИмяИконки, Показатель, ЦветИконки);
	КонецЕсли;
	
	Возврат БиблиотекаКартинок[ИмяИконки];
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОбработкаНажатияФильтраПоОрганизации(Команда)
	
	Индекс = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СтрЗаменить(Команда.Имя, "ФильтрОрганизация_", ""));
	
	ВыбранноеЗначение = СписокОрганизаций.Получить(Индекс);
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение.Значение = Неопределено Тогда
		Элементы.ФормаГруппаФильтрПоОрганизациям.Заголовок = ВыбранноеЗначение.Представление;
	Иначе
		Элементы.ФормаГруппаФильтрПоОрганизациям.Заголовок = Строка(ВыбранноеЗначение.Значение);
	КонецЕсли;
	
	ФильтрПоОрганизации = ВыбранноеЗначение.Значение;
	
	ЗапуститьФоновоеЗадание();
	ДобавитьУдалитьИндикторУстановленныхФильтров();
	
	Для каждого Элемент Из Элементы.ФормаГруппаФильтрПоОрганизациям.ПодчиненныеЭлементы Цикл
		Элемент.Видимость = Элемент.ИмяКоманды <> Команда.Имя;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область НовостиОбработчикиСобытийФормы

&НаСервере
Процедура НовостиПриСозданииНаСервере()
	
	Если НЕ ЭтоИнтерфейс85 Тогда
		Элементы.ГруппаНовости.Видимость = Ложь;
		ОтображатьНовости = Ложь;
		Возврат;
	КонецЕсли;
	
	ОтображатьНовости = Истина;
	
	РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	
	ИспользоватьРазделениеПоОбластямДанных = РазделениеВключено
		И РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных();

	РазрешенаРаботаСНовостями = ОбработкаНовостей.РазрешенаРаботаСНовостямиТекущемуПользователю();
	ИспользоватьРаботуСНовостями = ПолучитьФункциональнуюОпцию("ИспользоватьРаботуСНовостями");
	
	// если не разрешена работа с новостями в коробке форма не отображается
	Если (Не РазделениеВключено И Не РазрешенаРаботаСНовостями) Или Не ИспользоватьРаботуСНовостями Тогда
		Элементы.ГруппаНовости.Видимость = Ложь;
		ОтображатьНовости = Ложь;
		Возврат;
	КонецЕсли;

	ОбработатьСобытиеПриСозданииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура НовостиПриОткрытии()
	
	Если НЕ ОтображатьНовости Тогда
		Возврат;
	КонецЕсли;
	
	Если КоличествоНовостейДляЛистания > 1 Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьАвтолистание", ЧастотаАвтолистания, Ложь);
	КонецЕсли;

	Если РазрешенаРаботаСНовостями Тогда
		ПодключитьОбработчикОжидания("Подключаемый_АвтообновлениеСпискаНовостей", СписокНовостей_ИнтервалАвтообновления
			* 60, Ложь);
	КонецЕсли;

	Если РазрешенаРаботаСНовостями Или Не РазделениеВключено Тогда
		ЗаполнитьДанныеНовостейВФоне();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НовостиОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если НЕ ОтображатьНовости Тогда
		Возврат;
	КонецЕсли;
	
	НовостьПрочтена = "Новости. Новость прочтена";
	НовостиЗагружены = "Новости. Загружены новости";
	НовостиОбновлены = "Новости. Обновлены настройки чтения новостей";

	Если ИмяСобытия = НовостьПрочтена Тогда
		// Не обновлять список новостей.

	ИначеЕсли ИмяСобытия = НовостиЗагружены Тогда
		Если Источник <> УникальныйИдентификатор Тогда
			ОбновитьСписокНовостейСервер();
		КонецЕсли;

	ИначеЕсли ИмяСобытия = НовостиОбновлены Тогда
		ОбработатьСобытиеПриСозданииНаСервере();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПолучениеНовостейВФоне

&НаСервере
Процедура НачатьПолучениеДанныхНовостейВФоне()

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;

	ДлительнаяОперацияПолученияДанныхНовостей = ДлительныеОперации.ВыполнитьФункцию(
	ПараметрыВыполнения, "ОбработкаНовостейУНФ.ПолучитьДанныеНовостей");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеНовостейВФоне()

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьДанныеНовостейВФонеЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияПолученияДанныхНовостей, ОписаниеОповещения,
		ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеНовостейВФонеЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ЗаполнитьДанныеНовостейВФонеЗавершениеНаСервере(Результат);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНовостейВФонеЗавершениеНаСервере(Результат)

	ЗавершеноЗаданиеПолученияДанныхНовостей = Истина;

	Если Результат = Неопределено Или Результат.Статус <> "Выполнено" Тогда
		ОбновитьСписокНовостейСервер();
		Возврат;
	КонецЕсли;

	ДанныеНовостей = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если ДанныеНовостей = Неопределено Или ДанныеНовостей.ТаблицаНовостей = Неопределено Тогда
		ОбновитьСписокНовостейСервер();
		Возврат;
	КонецЕсли;

	ОбновитьСписокНовостейСервер(ДанныеНовостей.ТаблицаНовостей);

КонецПроцедуры

#КонецОбласти

#Область НастройкаФормыНовостей

&НаСервере
Процедура ОбработатьСобытиеПриСозданииНаСервере()
	
	// В конфигурации есть общие реквизиты с разделением и включена ФО РаботаВМоделиСервиса.
	Если РазделениеВключено Тогда
		// Если включено разделение данных, и мы зашли в неразделенном сеансе,
		//  то нельзя устанавливать пользовательские свойства новости.
		// Зашли в конфигурацию под пользователем без разделения (и не вошли в область данных).
		Если ИнтернетПоддержкаПользователей.СеансЗапущенБезРазделителей() Тогда
			ПолучитьТекущегоПользователя = Ложь;
		Иначе
			ПолучитьТекущегоПользователя = Истина;
		КонецЕсли;
	Иначе
		ПолучитьТекущегоПользователя = Истина;
	КонецЕсли;

	Если ПолучитьТекущегоПользователя = Истина Тогда
		ПараметрыСеанса_ТекущийПользователь = Пользователи.ТекущийПользователь();
	Иначе
		ПараметрыСеанса_ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;

	ЧастотаАвтолистания = 50; // Секунд
	КоличествоНовостейДляЛистанияМаксимум = 6;
	КоличествоНовостейДляЛистания = 6;
	ПятьЧасовВМинутах = 300;
	СписокНовостей_ИнтервалАвтообновления = ПятьЧасовВМинутах;

	Новости.Очистить();
	Если Не РазрешенаРаботаСНовостями И РазделениеВключено Тогда
		ЗавершеноЗаданиеПолученияДанныхНовостей = Истина;
		ДобавитьТолькоБаннер();
	Иначе
		НачатьПолучениеДанныхНовостейВФоне();
		УправлениеФормой();
	КонецЕсли;

	Если ИспользоватьРазделениеПоОбластямДанных Тогда
		СформироватьСписокНовостейСервиса();
	КонецЕсли;

	Элементы.ГруппаНовостиСервиса.Видимость = ТаблицаСообщенийСервиса.Количество() > 0;

	Если (ОбработкаНовостейПовтИсп.ЕстьРолиЧтенияНовостей()) Тогда
		Элементы.ГруппаНавигация.Видимость = Истина;
	Иначе
		Элементы.ГруппаНавигация.Видимость = Ложь;
	КонецЕсли;

	НастроитьФормуМобильныйКлиент();

КонецПроцедуры

&НаСервере
Процедура ДобавитьТолькоБаннер()

	ДобавитьБаннерИнформацияИПоддержка();
	КоличествоНовостейДляЛистания = Новости.Количество();
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура СформироватьСписокНовостейСервиса()

	ИнформационныйЦентрСервер.СформироватьСписокНовостейНаРабочийСтол(ТаблицаСообщенийСервиса, 1);

	Если ТаблицаСообщенийСервиса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Сообщение = ТаблицаСообщенийСервиса[0];
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Сообщение.СсылкаНаДанные);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбщиеДанныеИнформационногоЦентра.Наименование КАК Наименование,
	|	ОбщиеДанныеИнформационногоЦентра.Критичность КАК Критичность,
	|	ОбщиеДанныеИнформационногоЦентра.ТипИнформации КАК ТипИнформации,
	|	ОбщиеДанныеИнформационногоЦентра.ТипИнформации.Наименование КАК ТипИнформацииНаименование,
	|	ОбщиеДанныеИнформационногоЦентра.Идентификатор КАК Идентификатор,
	|	ОбщиеДанныеИнформационногоЦентра.ВнешняяСсылка КАК ВнешняяСсылка
	|ИЗ
	|	Справочник.ОбщиеДанныеИнформационногоЦентра КАК ОбщиеДанныеИнформационногоЦентра
	|ГДЕ
	|	ОбщиеДанныеИнформационногоЦентра.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	СвойстваСообщения = РезультатЗапроса.Выбрать();
	СвойстваСообщения.Следующий();
	НаименованиеБезПробелов = СтрокаБезПереносов(СвойстваСообщения.Наименование);

	Элементы.ИмяНовости_0.Заголовок = НаименованиеБезПробелов;

	Сообщение.ИмяЭлементаФормы = Элементы.ИмяНовости_0.Имя;
	Сообщение.ТипИнформации    = СвойстваСообщения.ТипИнформацииНаименование;
	Сообщение.Идентификатор    = СвойстваСообщения.Идентификатор;
	Сообщение.ВнешняяСсылка    = СвойстваСообщения.ВнешняяСсылка;

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()

	Элементы.КартинкаДлительнаяОперация.Видимость = Не ЗавершеноЗаданиеПолученияДанныхНовостей;
	Элементы.ГруппаБаннеры.Видимость = ЗавершеноЗаданиеПолученияДанныхНовостей;
	Если Не ЗавершеноЗаданиеПолученияДанныхНовостей Тогда
		Возврат;
	КонецЕсли;

	Элементы.ГруппаНовостиСервиса.Видимость = РазделениеВключено;
	Если РазделениеВключено Тогда
		Элементы.ГруппаБаннеры.Высота = 17;
	Иначе
		Элементы.ГруппаБаннеры.Высота = 14;
	КонецЕсли;

	КоличествоНовостейДляЛистания = Мин(Новости.Количество(), КоличествоНовостейДляЛистанияМаксимум);
	
	// Если количество новостей для листания = 1, то скрыть поле переключателей.
	Если КоличествоНовостейДляЛистания <= 1 Тогда
		Элементы.ГруппаПереключательНовостей.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПереключательНовостей.Видимость = Истина;
	КонецЕсли;
	// Сбросить счетчик текущей новости.
	Если РазделениеВключено Тогда
		ИндексТекущейНовости = 1;
	Иначе
		ИндексТекущейНовости = 0;
	КонецЕсли;

	Если Новости.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если РазделениеВключено И Новости.Количество() = 1 Тогда
		ИндексТекущейНовости = 0;
	КонецЕсли;
	
	// Вывести текст текущей новости.
	ТекстТекущейНовостиХТМЛ = Новости.Получить(ИндексТекущейНовости).ТекстНовостиХТМЛ;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНовостейСервер(Знач ТаблицаНовостей = Неопределено)

	Если ТаблицаНовостей = Неопределено Тогда

		Новости.Очистить();

		Если Не РазрешенаРаботаСНовостями И РазделениеВключено Тогда

			ДобавитьТолькоБаннер();
			Возврат;

		КонецЕсли;

		ДанныеНовостей = ОбработкаНовостейУНФ.ПолучитьДанныеНовостей();
		ТаблицаНовостей = ДанныеНовостей.ТаблицаНовостей;
		Если ТаблицаНовостей = Неопределено Тогда

			ДобавитьТолькоБаннер();
			Возврат;

		КонецЕсли;

	КонецЕсли;

	Для Каждого ДанныеНовости Из ТаблицаНовостей Цикл

		НовыйБаннер = Новости.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйБаннер, ДанныеНовости, , "Действия");
		НовыйБаннер.ТекстНовостиХТМЛ = ДанныеНовости.КороткийТекстДляБаннера;

	КонецЦикла;

	Новости.Сортировать("ДатаПубликации УБЫВ");

	Если РазделениеВключено Тогда
		ДобавитьБаннерИнформацияИПоддержка();
	КонецЕсли;

	СтруктураНастроекПоказаНовостей = ХранилищаНастроек.НастройкиНовостей.Загрузить("НастройкиПоказаНовостей", "");
	Если ТипЗнч(СтруктураНастроекПоказаНовостей) = Тип("Структура") И СтруктураНастроекПоказаНовостей.Свойство(
		"ОтображаемыеНовости_Вариант") И СтруктураНастроекПоказаНовостей.ОтображаемыеНовости_Вариант = "Количество" Тогда

		СтруктураНастроекПоказаНовостей.ОтображаемыеНовости_Вариант = "Все";
		ХранилищаНастроек.НастройкиНовостей.Сохранить("НастройкиПоказаНовостей", "", СтруктураНастроекПоказаНовостей);

	КонецЕсли;

	КоличествоНовостейДляЛистания = Новости.Количество();
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура ДобавитьБаннерИнформацияИПоддержка()

	ИнформацияИПоддержка = Новости.Вставить(0);
	ИнформацияИПоддержка.Наименование = НСтр("ru = 'Информация и поддержка'");

	ИнформацияИПоддержка.ТекстНовости = СтрШаблон(
	"<div style = ""margin: 0;padding: 0;"" id=""newsText"">
	|<img src = ""data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAVIAAACoCAYAAACyq2YkAAAACXBIWXMAAAsTAAALEwEAmpwYAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAABP1SURBVHgB7d0LcBz1fQfw393ZOr1Oj8qpHzoSZzpMJKcOzBS/yNCYsRwmbYoNTpvJBJDczjTDK4FJJwFiGrsYiOm0oYbW03ZSJBN3MhQ/odNkbMBMmCa26QRSwCaU4hBLSPgl3Um6kyzpst+//D9WpzvpTrt7t7v3/cwsJ61Wd2shfe/3f+z+A5KHVCrVMDg4ePX8+fM3GJ+unZiYWBoIBBqEiMhHjKzrN7LtNWzj4+Mv19TUHMjn+wKzPGlDMpn8hvF4D4OTiMrQaWPrNLauqqqq07kOyhmkCFCj8tzKACUiUoG6zQjTzmxfzBqkRoh+H1WoEBFRmpGLj1dXV9+buX9akCYSiaeMhw4hIqJsOo3KdLN5R9D8CSpRYYgSEc2kY3h4+PvmHemK1BiV7wiFQk8JERHNymjm32s08x/HxypIjeb8UuPhJWNbKkRENCtjIL4/HA5/Eo+qaR8MBtuFIUpElDdMDzWa+GpQXlek7wmDlIioILoqDQ4NDW0UhigRUcH0VZ9BI1HXChERzYkxSL8RQXqVEBHRXH0uYHSWXuRloEREc4N+0oAx0JQSIiKas6AQEZElDFIiIosYpEREFjFIiYgsYpASEVnEICUisohBSkRkEYOUiMgiBikRkUUMUiIiixikREQWMUiJiCxikBIRWcQgJSKyiEFKRGQRg5SIyCIGKRGRRQxSIiKL5gmRD8Ticel6/oR0j9SJGyQvdktktFu+dssGiTY3C/kb12wiX/jSX+2S6jV3iZuMGGEaPvaw7P7XJ4T8jRUped7hIy/KpUUr058vjgSkIiQlF6+OyqvjUYkb1XIkEhHyLwYped5bJ08a/12tPo7WB+RjNQFxg9+pFulpqpeBWIxB6nMcbCJfcUuIaiH+hZUF/m8mIrKIQUpEZBH7SIlMFtYGZEU0IL/uT8n/9nJCy9jYmIyPj6tNf55NMBhUWygUUo/z58+XcsIgJTLZtDwo9ZUiyxcHpL5qQl55rzzCdGJiQi5duqS20dFRteUKzXxVVFRIIBCQcDisPp43b57a/IhBSnQZAhSb9omGgLwi/gxSHZyJRCIdnHbTzzkyMpLepwO1pqZGBaxfMEiJLhtIirxvNOk/3jA58n/iN/4KUYQnQg3hmUwm1efFpkN7eHhYdQFUVlZKdXW1evQyBimRyZ5fTKgg/XAwJUlrLVvX0OGJ8CpFeOaCc8E5YUOVimq1rq7Ok81/BilRBlSlXoeQGhwcVAGKJrzboT8WG0IVTX4Eqpea/gxSIhOM2GOg6cNBkZ8aA00DSW+Fqg5QbG6qPguBCvrs2bOqMkWgounvdgxSIpMVVxij9ZUBWVgr0hdPyYkz4gmo5mKxmKro/AL/pgsXLqh/l9sDlUFKlEPYA38dfgzQTDpQh4aGpLGx0ZV9qAxSIg9Cs72/v9/XAZoJTf7e3l5VmbptUIpBSuQhfugDtQpvHphC5abmPoOUyCMQIKhCyzVAzXRzH/Nh3VCdMkiJXA5NWvSDmq8Qokm6Om1qairp9f0MUiKXQuWJAEUznnJDddrX1ycNDQ1SW1srpcAgJXLY9ke+J5FI4YvyJRMJmUjxDlRmV1+1XL5ww+ezfk13e6CpX2wMUiKHbd/2XYlGo0LWPfPsXnlw60Py0NYHs34dFTwUO0x5Y2ci8ow/+9ImWbRwofT29uU8BmGqA7VYGKRE5Dm9fb0zfr3YYcogJcoBt9Uj94lGm42qdNGsxyFIcTVUMbCPlDxPL4NhB9xGb/migIyMiW1Ljfz4J4elrr74AyB+geb8XA0MDKjb8zk9NYpBSp6GUVpVddh0xzVUoa+ctnekfM2a1dK8ZLGQSE/PBwUdf/c935RrV6+aMlhXSJMdvx/nz5+XhUa/KpY9cQqDlDwNV7aQdywp8A0lEqk1RuDrp+yLxeJSCMwzRWWKeaZOYR8peVo53bSjXNXVRcQqXNTg5JVhDFLyNCcWbSN/unjxoqQcusCBQUqehQqDN/CgfKGJH48X1i2QLwYpeZZuqi1atFDGEpN/IOMuu6KyuWWlHDh4SMgd0MR3oiplkJJn6SC97rPXSvz1Z9XHgyPuStLmllXy4v+8K90FjlaTM9CCcaIq5ag9eZZeHRN3/Pn7+zbLv+1/TM5Fr5VL1SEZT8ZlZCj3NBlUJg2NjVP2qWk1RrVSG7F2B6FwdZ2c7x+UyIJm9fF1m3fIlu3fkp07/toYhbY+cELW4P89/j/YOR2KQUqehEEmc/8omvcP3P7lvL//qa6n5YvXfUbWrF6V3ocbYgwPDcvGDTeIHVD5nHr7V/L/7/9Czi5ZLAcOPS+3fvUrQqWl5x7becs9Bil5kp1XMzkFVc+Ka/5AbV++WchFEomErUHKPlLyJN2sJ5oL9K/bOa+UQUqexPmjZBWqUrswSMmTUrxzPFlk51VxDFLyJC/0kZK7YdDJri4iWwabjh07Lk888eSsx23Z8oC0tLQIkVW4SoXIKvST2nGLPVuCtLu7W4Xp+vXrsi7ydeZMtxw/flwGBop7+3/yJ14WSnZBkNoxem/r9Kf29nZZtWrltP379u1XQUpkBwYp2cWukfuSziPFfQX37dsnJ0+eUp8jhG+++aZpxx0+/IJxzMlp+3F8ZnCjMsaWadmyFmlra5t27JEjL6grWrDqYHv7bWoZA62zs0t93twcVW8G2Y7DuR8+fGTa8+/c+WTWffD1r9+Vfn48n/nfjOodr4XnN+/HuWI/ZDtXKq2R8YC8fX6+nEsEJT7KoQetqWpcFlRNSEuTO6er4U0Z3UTz5lmLwpIFKQLjlltuU+Gkw/Db375fhc0Pf7h7SkgcOXIkHSJT3TUtSBFqXV27px2JUDKHGvp08Vr4fkycngyqfcZrPy2trZP9uHgeDA7jHJcta1X7cB447uDBA5dDdona19UVk6NHV6UvAcTzm18Tn2O7++670ueA529unhqY+mfy3HMH0vvuu+9+2bt3/5RzRQjj55StBeB3bhtoQnAefKfaeHTuDuxe1TMYUo+v9lbIn7YMSzjkvtkWdgRpyd46H374kXRg7Nr1j2o7dOiA2ofgyOadd06p7ejRF3I+r74hgT4WWyaEOEIUAYYwmnzt/ap/F+dlhv7fPXueVsfpDZW0PkdUhzt2PKr27dz5RNZz0q+H0NPVaK6fCV7vscceVQELqMYRot/5zv0Z5xrJa4CPnNcTDzFEZ4E3m7fPu/NCSjsGLksSpAgWNKnXr29LBwagEkS4oeIy36EF4WLHXbI1VHNgDjUEYkfHbeq1cX4awk9XqPpzbOZzxOdoand27s7arYCARPAhcHNBKOL7UbGaK+fVq1fKSy+9IJs23TzlXFEhm8+TSifGEM0Luj/cyI6LO0ryFqH7RDHKn0k3oY8dOzYlULLNBsgmn9A9deqUOkb3WWo6mPAcM/U/rlw5GaSYhaCb8ghlvDmge0I3t3HM7bffqfajojS/aZhfE+eBIO3oaJ9WseL50b2wd+8+NWCn16t5662TKlDLkZOLmNlhoTEIfOUCd57jh4MivzrHixnM7Li4oyRBGo8XNg1qYCCe98AKjs0WWJkQSAhMM/x9IgRnCygd1ObA1d+Drgk9QwEf6wo11/njOT5qok//H2ruS0ZV2tbWkt5froJBdw/m9A1iY1h5hR197iUJ0paWyaozWxjopVZ1BYpjTp06mXU0P1O+x+K5EYboc5wLfd7mwEYYIhTRfMfrX3lli+q6QCV64403qUr14MHWaYGK4MZ54Oto2uPrmEamYSALz4t+YfPrYT+b9kTW2TGdriRv7dHoEtVkRZM3E8IEgaGbx/v3T47W5xOk+R6LPk9UpNn6MzPDKdsa2jhvnKMORfNgUuZrmwejcg2iAQK3tbVVtm9/NN31AbpqzqySWZESuUdJfiMRCugLRJChEtNzP9GfiODA1xBgqLoQUAg+7J+cerRfTXECzC3F9810rJ42hX2YRgUYVEIQ3nHHnerrCC48D5rQ2MwDXfharnPU8D2QazBJD0bh+7u6unL+THbtelKdF15DB+VHU8Puuzzv9Yh6PZxDoV0kfsEgJTvZMWpfsvkIGFgBVKA67FClojJDVYegQICBDrNMqAwRegiw2Y7Vo/EYwEJo7dmzWwWv+ViEFvabl4PQI/Y6LAEj67ry1E167Jupb1YPRuE1161ry9pniu/H9KYbb9yoQh7TrvA6OG+8DqZCQVvbOrUfPzf8+8tx+QrM++P19uQWgUQiUfJecV19mcMF4bR27ToVULnmXl5//ToVPgjS2Y5FEOJ1MuegIoj0PQAyw00/P/ow9XH19XUlCa5Sv77b9PX1Wbpzj1pq5I//KMdSI38ihTjxQYW82hsWmtk1i0ZkxeLCphp1/MVfyoG9z0zZd+83vyWbbtqglpexSzQaFStcMUO2lJc6IpTyCaZ8j3NKqV/fbUKhEO+ST67h6jWb0NSeKWQx+q+/ns+x+UyLIm+wekmfkyrnBSRcpquhjRi9Lckxb039suN3ybX/u3WTeiYYnNFmO3bLlvulUOhPZRXoTm4O0sn5wOV5tZPXQtQuXEV0Bhj4Iney42a8Tkl6sCorZ+gmsorzSMiT3Byk5C12TKdjkJIn4Zef80nJDqxIqaxVVFQIkVV29LczSMmzKisrhcgqO7qJGKTkWewnJTuwj5TKGoOUrEKIumY5ZqJSwB9BOBy2bSVIu2BC/u/WitSXYc/DQFLk/X7vTP2y682YQUqe5sYgxRzS9/uFPMCuIGXTnjwNQUo0V3YNWDJIydMQpJxPSnNl1xsxfwPJ86qrq6WUmiPW1/zxu0jFhLQ0uev+sQhRuxZSZJCS51VVVUkpLakdl898zPqSvn4UDqXUz2fDlQkVpm5iZ7cQB5vI83Tz3o5FzObqs9ERtcVHg8bGde4hUpFyXXia2fkGzCAlX0DzfnBwUEoNwRHhlauuh8tC7ZyHzKY9+UKpm/fkLXZfXswgJV9A855ToShftbW1YicGKfkGq1LKB95w7V5hgUFKvoF+Us4ppdnU1NSI3fhbR76BELW7yUb+gkrUiXnHDFLyFQQpq1LKxamLN/gbR76CEGVfKeXCICXKE5fQpmzQN+rUMt4MUvId/LE4MaBA3ubkGyyDlHypvr6efaWUVldX51g1CvxNI1/iCD5pTo3UmzFIybcKHcEfGIgJ+Y/T1SjwpiXkWwjRhoYGuXDhQl7Hf/yKqPz0lf+Wf//RM1LHAauii8Vj6s3simg0vW/58t8XK4pRjarXESIfwx/R0NBQXus63fD59Woj/1iwYIEUA5v25HuNjY0ceCpDxWjSa4FEIuGdtVOJcjjT3S3P7t2fMzBRkY6Pf7QkyP+9+65UVIRVM7Kuzn3N+HgsLhOplEQixR8w6+npkaipee02P/v5cVn6iStmHUxEaySVQrwF5Bt33yFOYpCSLxw+8qL84KlO2fcfP/JF9fmznx+THX/7d/LwQ9ukecliKZZuI0Qf/O7fqJ+jHySTSfm9T31a3n37TXES+0jJF1BV9vR8IKOjo7bftLcU1qxeZYToVvmvH/9kSiXtJCwE19jYIJ0/+BfxizfefFNaWz8lTmOQki+sWrlC4oOD8vovfykrrrnGF1Xpp5ctUxvNDarRN954S1avXClOYw88+cbm226RJ//pn9XaTahMqTyhX9TospSzZ8/Kweeel472W8Vp7CMlX/nixk1y/ef+UO68/WuqKsWobSgUsm39cnIvrCKL7dKlSypMH3hwq3zhhvWyvm2dOI1BSr4SM0a7tz/yPdWveOtXvyItLc73j5G7HD/xqhx67j/lzze3y7LWFikGBin5EqZDYSS/+0y3DMRyX/o5Nj6mtnJRMb9CggFnevSSo0kptlAglF5WGQOOuMMTBurQZ15MDFIqa2NjY3Lu3Dn16Gfo5sAEdSdv5FLsnyW6bXDlUrEm3c+EQUplz+9hiqBpampKV25OixktgFjM2RvAYCVQ/JvcMjuDQUok/g1TBA4ukS121YafYzweV/c5sBsqa2xuwiAlusxvYYpmPO5+VUq4NBfVaT43jZkN3hQQoHh0GwYpkQlC9Pz582oKjVehuYsVAty03AqCdHh4eE4VqpsDVGOQEmXR39+vJvZ7Tama8vnCGxUulsCEeXyc7Q0LbwToz8W/RW9uxyAlygFBikD1Cjf2HeYjsyvFrW8CM2GQEs3AC/2mbq9CywGDlCgPxZjSUygEJwLUC01fv2OQEuXJySk9hUBwYiCpGGsRUX4YpEQFKkWg6gEYt49elysGKdEc6UDFCDTuOmQ3hCdCs6qqSt2smutOuReDlMgihChuIoxAxXzJuYQqQhK3+0PVWVFRoQK0WJd0knUMUiKboVLVy4PMtEwIghMbQpTVprdxvgSRzTCazqlI5YVvg0REFjFIiYgsYpASEVnEICUisohBSkRkEYOUiMgiBikRkUUMUiIiixikREQWMUiJiCwKplIp76ylQETkMoFAoB8V6WkhIqI5MYrR1xCkLwsREc2JEaSvB42y9IAQEdGcGEF6NHDx4sWGcDj8nhGoDUJERIU4XVVV9clgY2NjvxGi/yBERFSQiYmJLjyq6U/JZPJxjt4TERXkdDAY7MQHKkhRlRo7tgkREeVrm9GsP40P0hPyKysrUZWyiU9ENAtkpRGinfrzQOYBQ0NDnUZ12i5ERDQN+kVramo6zPumXSKKA1iZEhFNh2zMDFHIeq19dXX1PcbDZuFVT0RECNB+Y7v3cjZOE5jpmxOJxFLjocPY0NRfKkREZQQBiumhGEPCNfW5jgtInoy+043GE601tquMJ7+aE/iJyG8uTwM9bWwv46pPI0BfmylAtd8CQUDB/ijUQLUAAAAASUVORK5CYII="" />
	|<br/> %1 <a style = ""color:rgb(25, 85, 174)"" href=""UNF_BannerNewsInformCenter"">%2</a>
	|</div>", НСтр(
		"ru = 'Вопросы по приложению, служба поддержки, центр идей, все сообщения'"), НСтр("ru = 'по ссылке'"));

	ТекстНовостиИнформация = Справочники.Новости.ПолучитьХТМЛТекстНовостей(ИнформацияИПоддержка.Ссылка,
		Новый Структура("ОтображатьЗаголовок", Ложь));
	НачалоТекста = СтрНайти(ТекстНовостиИнформация, "<div id=""newsText"">");
	КонецТекста = СтрНайти(ТекстНовостиИнформация, "</div>", , НачалоТекста);
	СтрокаДляЗамены = Сред(ТекстНовостиИнформация, НачалоТекста, КонецТекста - НачалоТекста);

	ИнформацияИПоддержка.ТекстНовостиХТМЛ = СтрЗаменить(ТекстНовостиИнформация, СтрокаДляЗамены,
		ИнформацияИПоддержка.ТекстНовости);

	ТекстЗаголовка  = "";

	СтрокаЗаголовок = СтрШаблон("<h1 id=""newsHeader""> %1 </h1>", ТекстЗаголовка);
	НачалоЗаголовка = СтрНайти(ТекстНовостиИнформация, "<h1 id=""newsHeader"">");
	КонецЗаголовка  = СтрНайти(ТекстНовостиИнформация, "</h1>", , НачалоЗаголовка);
	СтрокаДляЗамены = Сред(ТекстНовостиИнформация, НачалоЗаголовка, КонецЗаголовка - НачалоЗаголовка);

	ИнформацияИПоддержка.ТекстНовостиХТМЛ = СтрЗаменить(ИнформацияИПоддержка.ТекстНовостиХТМЛ, СтрокаДляЗамены,
		СтрокаЗаголовок);

	НачалоДаты = СтрНайти(ТекстНовостиИнформация, "<div id=""importanceData"">");
	КонецДаты  = СтрНайти(ТекстНовостиИнформация, "</div>", , НачалоДаты);
	СтрокаДляЗамены = Сред(ТекстНовостиИнформация, НачалоДаты, КонецДаты + 6 - НачалоДаты);

	ИнформацияИПоддержка.ТекстНовостиХТМЛ = СтрЗаменить(ИнформацияИПоддержка.ТекстНовостиХТМЛ, СтрокаДляЗамены, "");

	НачалоЛинк = СтрНайти(ИнформацияИПоддержка.ТекстНовостиХТМЛ, "<div id=""newsHyperlink"">");
	КонецЛинк  = СтрНайти(ИнформацияИПоддержка.ТекстНовостиХТМЛ, "</div>", , НачалоЛинк);
	СтрокаДляЗамены = Сред(ИнформацияИПоддержка.ТекстНовостиХТМЛ, НачалоЛинк, КонецЛинк + 6 - НачалоЛинк);

	ИнформацияИПоддержка.ТекстНовостиХТМЛ = СтрЗаменить(ИнформацияИПоддержка.ТекстНовостиХТМЛ, СтрокаДляЗамены, "");

	НачалоСтили = СтрНайти(ИнформацияИПоддержка.ТекстНовостиХТМЛ, "/* Здесь можно вставить свои стили");
	КонецСтили = СтрНайти(ИнформацияИПоддержка.ТекстНовостиХТМЛ, "*/", , НачалоСтили);
	СтрокаДляЗамены = Сред(ИнформацияИПоддержка.ТекстНовостиХТМЛ, НачалоСтили, КонецСтили + 2 - НачалоСтили);

	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ТекстНовости = СтрЗаменить(ИнформацияИПоддержка.ТекстНовостиХТМЛ, СтрокаДляЗамены, "body {
																						   |padding: 0;
																						   |margin: 0;
																						   |}");
	Иначе
		ТекстНовости = СтрЗаменить(ИнформацияИПоддержка.ТекстНовостиХТМЛ, СтрокаДляЗамены, "body {
																						   |padding-left: 45px;
																						   |margin-right: 30px;
																						   |text-align:centr;
																						   |width: 200px;}");
	КонецЕсли;

	ИнформацияИПоддержка.ТекстНовостиХТМЛ = ТекстНовости;

КонецПроцедуры

&НаСервере
Функция СтрокаБезПереносов(ИсходнаяСтрока)
	
	// Для того чтобы строка правильно переносилась в веб-клиенте,
	// вместо запятой используем символ - U+201A:Single Low-9 Quotation Mark (Keystroke: Alt+0130)
	ПромежуточныйРезультат = СтрЗаменить(ИсходнаяСтрока, ",", "‚");
	Результат = СтрЗаменить(ПромежуточныйРезультат, " ", Символы.НПП);
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьАвтолистание()

	Если Новости.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Увеличить счетчик текущей новости.
	ИндексТекущейНовости = ИндексТекущейНовости + 1;
	Если ИндексТекущейНовости > (КоличествоНовостейДляЛистания - 1) Тогда
		ИндексТекущейНовости = 0;
	КонецЕсли;
	
	ЦветаПереключателяНовостей = ЦветаПереключателяНовостей();
	Для Итератор = 1 По 6 Цикл
		ИмяЭлемента = СтрШаблон("Новость%1", Итератор);
		Если Итератор = ИндексТекущейНовости + 1 Тогда
			Элементы[ИмяЭлемента].ЦветКартинки = ЦветаПереключателяНовостей.ЦветАктивнойНовости;
		Иначе
			Элементы[ИмяЭлемента].ЦветКартинки = ЦветаПереключателяНовостей.ЦветНеактивнойНовости;
		КонецЕсли;
	КонецЦикла;
	
	// Вывести текст текущей новости.
	ТекстТекущейНовостиХТМЛ = Новости.Получить(ИндексТекущейНовости).ТекстНовостиХТМЛ;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АвтообновлениеСпискаНовостей()

	ОбновитьСписокНовостейСервер();

	// Исправить количество новостей для листания.
	КоличествоНовостейДляЛистания = Мин(Новости.Количество(), КоличествоНовостейДляЛистанияМаксимум);

	// Подключить автолистание.
	ОтключитьОбработчикОжидания("Подключаемый_ВыполнитьАвтолистание");
	Если КоличествоНовостейДляЛистания > 1 Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьАвтолистание", ЧастотаАвтолистания, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаНовость(Элемент)

	Фильтр = Новый Структура;
	Фильтр.Вставить("ИмяЭлементаФормы", Элемент.Имя);

	МассивСтрок = ТаблицаСообщенийСервиса.НайтиСтроки(Фильтр);
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТекущееСообщение = МассивСтрок.Получить(0); // ДанныеФормыЭлементКоллекции
	ИдентификаторСообщения = ТекущееСообщение.Идентификатор;

	Если ТекущееСообщение.ТипИнформации = "Недоступность" Тогда

		ВнешняяСсылка = ТекущееСообщение.ВнешняяСсылка;

		Если Не ПустаяСтрока(ВнешняяСсылка) Тогда
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ВнешняяСсылка);
			Возврат;
		КонецЕсли;

		ИнформационныйЦентрКлиент.ПоказатьНовость(ИдентификаторСообщения);

	ИначеЕсли ТекущееСообщение.ТипИнформации = "УведомлениеОПожелании" Тогда

		ИдентификаторИдеи = Строка(ИдентификаторСообщения);

		ИнформационныйЦентрКлиент.ПоказатьИдею(ИдентификаторИдеи);

	ИначеЕсли ТекущееСообщение.ТипИнформации = "Новость" Тогда

		ИнформационныйЦентрКлиент.ПоказатьНовость(ИдентификаторСообщения);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НастроитьФормуМобильныйКлиент()

	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;

	Элементы.ТекстТекущейНовостиХТМЛ.РастягиватьПоГоризонтали = Истина;
	Элементы.ТекстТекущейНовостиХТМЛ.Ширина = 50;
	Элементы.ТекстТекущейНовостиХТМЛ.МаксимальнаяШирина = 50;
	Элементы.СтраницыРабочегоСтола.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;

КонецПроцедуры

&НаКлиенте
Процедура ПриНажатииНаПереключательНовости(Индекс)
	
	ИндексТекущейНовости = Индекс;
	ЦветаПереключателяНовостей = ЦветаПереключателяНовостей();
	Для Итератор = 1 По 6 Цикл
		ИмяЭлемента = СтрШаблон("Новость%1", Итератор);
		Если Итератор = Индекс + 1 Тогда
			Элементы[ИмяЭлемента].ЦветКартинки = ЦветаПереключателяНовостей.ЦветАктивнойНовости;
		Иначе
			Элементы[ИмяЭлемента].ЦветКартинки = ЦветаПереключателяНовостей.ЦветНеактивнойНовости;
		КонецЕсли;
	КонецЦикла;
	
	// Если пользователь явно нажал на кнопку выбора новости, то остановить автолистание.
	// Оно автоматически включится после обновления списка новостей.
	// Отключить автолистание.
	ОтключитьОбработчикОжидания("Подключаемый_ВыполнитьАвтолистание");
	
	// Вывести текст текущей новости.
	ТекстТекущейНовостиХТМЛ = Новости.Получить(ИндексТекущейНовости).ТекстНовостиХТМЛ;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦветаПереключателяНовостей()
	
	СтруктураЦветов = Новый Структура;
	СтруктураЦветов.Вставить("ЦветАктивнойНовости", ЦветаПалитры.Синий);
	СтруктураЦветов.Вставить("ЦветНеактивнойНовости", ЦветаПалитры.Серый);
	
	Возврат СтруктураЦветов
	
КонецФункции

&НаСервере
Процедура ОбновитьТаблицуТекущихДел()
	
	Если НЕ ЭтоИнтерфейс85 Тогда
		ОтображатьТекущиеДела = Ложь;
		Элементы.ГруппаТекущиеДела.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаТекущиеДела.Видимость = ОтображатьТекущиеДела;
	
	ТекущиеДела.Очистить();
	СводкаПоТекущимДелам = ТекущиеДелаСервер.СводкаПоТекущимДелам();
	
	НоваяСтрока = ТекущиеДела.Добавить();
	НоваяСтрока.НомерКартинки = 0;
	НоваяСтрока.Представление = НСтр("ru = 'Всего дел'");
	НоваяСтрока.Количество = СводкаПоТекущимДелам.ВсегоДел;
	
	НоваяСтрока = ТекущиеДела.Добавить();
	НоваяСтрока.НомерКартинки = 1;
	НоваяСтрока.Представление = НСтр("ru = 'Важные дела'");
	НоваяСтрока.Количество = СводкаПоТекущимДелам.КоличествоВажныхДел;
	
	НоваяСтрока = ТекущиеДела.Добавить();
	НоваяСтрока.НомерКартинки = 2;
	НоваяСтрока.Представление = НСтр("ru = 'Обычные дела'");
	НоваяСтрока.Количество = СводкаПоТекущимДелам.ВсегоДел - СводкаПоТекущимДелам.КоличествоВажныхДел;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если ЭтоИнтерфейс85 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаКнопкиОстатков.Видимость = Истина;
	Элементы.ГруппаШапкаОстатки.Видимость = Ложь;
	Элементы.ГруппаКнопкиОборотов.Видимость = Истина;
	Элементы.ГруппаШапкаОбороты.Видимость = Ложь;
	Элементы.ГруппаДляВажныхСообщенийПоказателей.Ширина = 105;
	Элементы.ГруппаДляВажныхСообщенийПоказателей.РастягиватьПоГоризонтали = Ложь;
	Элементы.ГруппаДобавленныеДиаграммы.РастягиватьПоГоризонтали = Ложь;
	Элементы.ГруппаДиаграммыЛево.Ширина = 52;
	Элементы.ГруппаДиаграммыПраво.Ширина = 52;
	Элементы.ГруппаДобавленныеДиаграммы.Ширина = 105;
	Элементы.ГруппаДиаграммы.Ширина = 100;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПодсказкиРедактирования()
	
	ИдентификаторСообщения = "ПодсказкаРедактирования";
	
	Если РежимРедактированияВключен Тогда
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		ПараметрыСообщения.Родитель = Элементы.ГруппаДляВажныхСообщенийПоказателей.Имя;
		ПараметрыСообщения.Идентификатор = ИдентификаторСообщения;
		ПараметрыСообщения.ТипСообщения = "Информация";
		ПараметрыСообщения.Скрываемый = Ложь;
		ПараметрыСообщения.Обработчик = "Подключаемый_ОбработатьИзменениеРежимаРедактирования";
		ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Режим редактирования'");
		
		ТекстСообщения = СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru = 'Вы находитесь в режиме редактирования начальной страницы. Для сохранения изменений и перехода в режим просмотра нажмите <a href=""%1"">Сохранить настройки</a> здесь или в командной панели.'"),
				"ВыключитьРежимРедактирования");
					
		ПараметрыСообщения.Сообщение = ТекстСообщения;
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
		ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(ЭтотОбъект, ИдентификаторСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьИзменениеРежимаРедактирования(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ВыключитьРежимРедактирования" Тогда
		ПереключитьРежимРедактирования();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРежимРедактирования()
	
	РежимРедактированияВключен = НЕ РежимРедактированияВключен;
	Если РежимРедактированияВключен Тогда
		Элементы.ФормаВключитьРежимРедактирования.Пометка = Истина;
		Элементы.ФормаВключитьРежимРедактирования.Заголовок = НСтр("ru = 'Сохранить настройки'");
	Иначе
		Элементы.ФормаВключитьРежимРедактирования.Пометка = Ложь;
		Элементы.ФормаВключитьРежимРедактирования.Заголовок = НСтр("ru = 'Настроить'");
		Элементы.Обновить.Видимость = Истина;
		СохранитьНастройкиВиджетов();
	КонецЕсли;
	
	ОбновитьОтображениеТекущихДел();
	ОбновитьОтображениеПодсказкиРедактирования();
	СоздатьУдалитьКомандыПоказателей();
	СоздатьУдалитьКомандыДиаграмм();
	СоздатьУдалитьДекорацииДобавления();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВажноеСообщениеЗакрытьМесяц(ВыводитьСообщение)
	
	ИдентификаторСообщения = "ЗакрытьМесяц";
	
	Если ВыводитьСообщение Тогда
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		ПараметрыСообщения.Идентификатор = ИдентификаторСообщения;
		ПараметрыСообщения.Родитель = Элементы.ГруппаДляВажныхСообщений.Имя;
		ПараметрыСообщения.ТипСообщения = "Информация";
		ПараметрыСообщения.ПараметрыДействия = Новый Массив;
		ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Требуется выполнить закрытие месяца'");
		ТекстСообщения = НСтр("ru = 'Некоторые показатели рассчитаны по месяцам, в которых расчёт фактической себестоимости не актуален. Следует выполнить закрытие месяца для отображения точных данных.'");
		ПараметрыСообщения.Сообщение = ТекстСообщения;
		
		ПараметрыДействияСообщения = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
		ПараметрыДействияСообщения.ИмяКоманды = "ПерейтиКЗакрытиюМесяца";
		ПараметрыДействияСообщения.Обработчик = "Подключаемый_ПерейтиКЗакрытиюМесяца";
		ПараметрыДействияСообщения.Заголовок = НСтр("ru = 'Закрыть месяц'");
		
		ПараметрыСообщения.ПараметрыДействия.Добавить(ПараметрыДействияСообщения);
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
		ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(ЭтотОбъект, ИдентификаторСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКЗакрытиюМесяца(Команда)
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Месяц", ПервыйНеактуальныйМесяц);
	СтруктураОткрытия.Вставить("Организация", ПерваяНеактуальнаяОрганизация);
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма", СтруктураОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	НеАнализироватьСебестоимость = Истина;
	ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(ЭтотОбъект, "ЗакрытьМесяц");
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеТекущихДел()
	
	Если РежимРедактированияВключен Тогда
		Элементы.КнопкаСкрытьТекущиеДела.Видимость = ОтображатьТекущиеДела;
		Элементы.КнопкаПоказатьТекущиеДела.Видимость = НЕ ОтображатьТекущиеДела;
		Элементы.ГруппаТекущиеДела.Видимость = ЭтоИнтерфейс85;
	Иначе
		Элементы.КнопкаСкрытьТекущиеДела.Видимость = Ложь;
		Элементы.КнопкаПоказатьТекущиеДела.Видимость = Ложь;
		Элементы.ГруппаТекущиеДела.Видимость = ОтображатьТекущиеДела;
	КонецЕсли;
	
	Элементы.ЗаголовокТекущиеДела.Доступность = ОтображатьТекущиеДела;
	Элементы.ТекущиеДела.Доступность = ОтображатьТекущиеДела;
	Элементы.ОткрытьФормуТекущихДел.Доступность = ОтображатьТекущиеДела;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеТекущихДел()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ТекущиеДела.НомерКартинки", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ОтображатьТекущиеДела", Истина, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ТекущиеДелаКоличество");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТипОтметки", ТипОтметкиЯчейкиТаблицы.ФигураПодТекстомОвальная);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветОтметки", ЦветаПалитры.Оранжевый);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ТекущиеДела.НомерКартинки", 1, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ОтображатьТекущиеДела", Истина, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ТекущиеДелаКоличество");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТипОтметки", ТипОтметкиЯчейкиТаблицы.ФигураПодТекстомОвальная);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветОтметки", ЦветаПалитры.Красный);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ТекущиеДела.НомерКартинки", 2, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ОтображатьТекущиеДела", Истина, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ТекущиеДелаКоличество");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТипОтметки", ТипОтметкиЯчейкиТаблицы.ФигураПодТекстомОвальная);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветОтметки", ЦветаПалитры.Зеленый);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ОтображатьТекущиеДела", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ТекущиеДелаПредставление");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Серый);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ОтображатьТекущиеДела", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ТекущиеДелаКоличество");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТипОтметки", ТипОтметкиЯчейкиТаблицы.ФигураПодТекстомОвальная);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветОтметки", ЦветаПалитры.Серый);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Серый90УНФ);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

