#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.МаксимальноеКоличествоУпаковок <> 0 Тогда
		МаксимальноеКоличествоУпаковок = Параметры.МаксимальноеКоличествоУпаковок;
	Иначе
		МаксимальноеКоличествоУпаковок = 1;
	КонецЕсли;
	
	Количество = 1;
	
	Элементы.НомерСтраницы.ФорматРедактирования = СтрШаблон("ЧФ='Ч из %1'", МаксимальноеКоличествоУпаковок);
	Элементы.НомерСтраницы.МаксимальноеЗначение = МаксимальноеКоличествоУпаковок;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Закрыть(Количество);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти



