#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает Истина, если есть включенные задачи по напоминаниям о показателях
//
// Возвращаемое значение:
//  Булево - Истина, если есть задачи по заданному виду оповещения.
//
Функция ЕстьЗадачиВРаботе() Экспорт
	
	Используется = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗадачаПоСогласованиюЗаявокОсновная, "Используется");
	Возврат Используется;
	
КонецФункции

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
// 
// Параметры:
//  Настройки - Структура - настройки заполнения:
// * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//               вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПередНачаломВыполненияЗадач(НовыеЗадачиКВыполнению) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ПередЗаписьюПредметаЗадачи(ПредметОбъект) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ПриЗаписиПредметаЗадачи(ПредметОбъект) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ОбработкаПроведенияПредметаЗадачи(ПредметОбъект) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведенияПредметаЗадачи(ПредметОбъект) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ЗапланироватьЗадачиКВыполнению(НовыеЗадачиКВыполнению, ВыбранныеЗадачиАссистента) Экспорт
	
	ВремяОтправленияЗадач = ВремяОтправленияНовыхЗадач();
	
	Для каждого ЗадачаАссистента Из ВыбранныеЗадачиАссистента Цикл
		НоваяЗадача = НовыеЗадачиКВыполнению.Добавить();
		НоваяЗадача.Дата = ВремяОтправленияЗадач;
		НоваяЗадача.Задача = ЗадачаАссистента;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПоприветствоватьПользователяПриЗаписиПервыхЗадач(ЗадачиАссистента) Экспорт
	
	АссистентПодключен = АссистентУправления.Подключен();
	Если Не АссистентПодключен Тогда
		АссистентУправления.Подключить();
	КонецЕсли;
	
	Для каждого ЗадачаАссистента Из ЗадачиАссистента Цикл
		ЗадачаОбъект = ЗадачаАссистента.ПолучитьОбъект();
		ЗадачаОбъект.ПоприветствоватьПользователяПередПервымВыполнением();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВремяОтправленияНовыхЗадач()
	
	СекундВЧасе = 3600;
	СекундВСутках = 86400;
	ВремяСледующегоОповещения = 0;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	СекундПрошлоСНачалаДня = ТекущаяДата - НачалоДня(ТекущаяДата);
	
	МассивИнтервалов = Новый Массив;
	МассивИнтервалов.Добавить(8 * СекундВЧасе);
	МассивИнтервалов.Добавить(12 * СекундВЧасе);
	МассивИнтервалов.Добавить(16 * СекундВЧасе);
	
	Для Каждого Интервал Из МассивИнтервалов Цикл
		Если СекундПрошлоСНачалаДня <= Интервал Тогда
			ВремяСледующегоОповещения = Интервал;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ВремяСледующегоОповещения = 0 Тогда
		ВремяСледующегоОповещения = СекундВСутках + МассивИнтервалов[0];
	КонецЕсли;
	
	Возврат НачалоДня(ТекущаяДата) + ВремяСледующегоОповещения + 1;

КонецФункции

#КонецОбласти

#КонецЕсли