#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗапись();
	Элементы.ГруппаДанныеВычета.Доступность = запись.Применяется;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрименяетсяПриИзменении(Элемент)
	
	Элементы.ГруппаДанныеВычета.Доступность = запись.Применяется;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьЗапись();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьЗапись();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗапись()
	
	ЗапросПоИмущественномуВычету = Новый Запрос;
	ЗапросПоИмущественномуВычету.Текст =
	"ВЫБРАТЬ
	|	НДФЛИмущественныйВычетСрезПоследних.Период КАК Период,
	|	НДФЛИмущественныйВычетСрезПоследних.Сотрудник КАК Сотрудник,
	|	НДФЛИмущественныйВычетСрезПоследних.Применяется КАК Применяется,
	|	НДФЛИмущественныйВычетСрезПоследних.СуммаРасходов КАК СуммаРасходов,
	|	НДФЛИмущественныйВычетСрезПоследних.ПроцентыПоКредиту КАК ПроцентыПоКредиту,
	|	НДФЛИмущественныйВычетСрезПоследних.КодИФНС КАК КодИФНС,
	|	НДФЛИмущественныйВычетСрезПоследних.НомерУведомления КАК НомерУведомления,
	|	НДФЛИмущественныйВычетСрезПоследних.ДатаУведомления КАК ДатаУведомления,
	|	НДФЛИмущественныйВычетСрезПоследних.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.НДФЛИмущественныйВычет.СрезПоследних КАК НДФЛИмущественныйВычетСрезПоследних
	|ГДЕ
	|	НДФЛИмущественныйВычетСрезПоследних.Сотрудник = &Сотрудник";
	ЗапросПоИмущественномуВычету.УстановитьПараметр("Сотрудник", Параметры.Сотрудник);
	Выборка = ЗапросПоИмущественномуВычету.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	Иначе
		Запись.Сотрудник = Параметры.Сотрудник;
	КонецЕсли;
	
КонецПроцедуры

// Процедура сохраняет запись в регистр сведений ДокументыФизическихЛиц
&НаСервере
Процедура СохранитьЗапись()
	
	МенеджерЗаписи = РегистрыСведений.НДФЛИмущественныйВычет.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
	МенеджерЗаписи.Записать();
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти
