#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	Параметры.Свойство("Контакт", ВладелецКонтакт);
	
	Если ЗначениеЗаполнено(ВладелецКонтакт) Тогда
		
		УстановитьОтборыСвязей(Справочники.Контрагенты.ПустаяСсылка());
		
		Элементы.Контакт.Видимость = Ложь;
	
		Список.Параметры.УстановитьЗначениеПараметра("Контакт", ВладелецКонтакт);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КонтрагентНедействителен",
			Ложь, , , Не Элементы.ПоказыватьНедействительных.Пометка);
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_Контрагент" ИЛИ ИмяСобытия = "Запись_Контакт" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчик", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтоМобильныйКлиент Тогда
		ОбновитьОтображениеЭлементовДляВыбораКонтрагента(Ложь);
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Элемент.ТекущиеДанные.Контрагент);
	ПараметрыФормы.Вставить("ТекущийКонтакт", ВладелецКонтакт);
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта",ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСвязиКонтактКонтрагент

&НаКлиенте
Процедура СвязьКонтактКонтрагентПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязьКонтактКонтрагентПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязьКонтактКонтрагентПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязьКонтактКонтрагентВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Изменить(Команда)
	
	Если ТипЗнч(Элементы.Список.ТекущиеДанные) = ТипЗнч(Неопределено) 
		ИЛИ ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",Элементы.Список.ТекущиеДанные.Контрагент);
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта",ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНедействительных(Команда)
	
	Элементы.ПоказыватьНедействительных.Пометка = Не Элементы.ПоказыватьНедействительных.Пометка;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,"КонтрагентНедействителен", Ложь, , , Не Элементы.ПоказыватьНедействительных.Пометка);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтрагента(Команда)
	ВыбратьКонтрагентаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область МобильныйКлиент

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Список.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	
	ОбновитьОтображениеЭлементовДляВыбораКонтрагента(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьКонтрагентаНаСервере()
	
	ОбновитьОтображениеЭлементовДляВыбораКонтрагента(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеЭлементовДляВыбораКонтрагента(ПоказатьВыбор)
	
	Элементы.Список.Видимость = ПоказатьВыбор;
	Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки.Видимость = ПоказатьВыбор;
	
	Элементы.ВыбратьКонрагентаМК.Видимость = Не ПоказатьВыбор;
	Элементы.ИсторияСвязей.Видимость = Не ПоказатьВыбор;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчик()
	
	Если Элементы.Список.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборыСвязей(Элементы.Список.ТекущиеДанные.Контрагент);
	Элементы.ИсторияСвязей.Заголовок = СтрШаблон(
	НСтр("ru = 'История связей с контрагентом ""%1""'"), Элементы.Список.ТекущиеДанные.Контрагент);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	НовоеУсловноеОформлениеСписок = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформлениеСписок.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение = ЦветаПалитры.Серый;
	Оформление.Использование = Истина;
	
	Отбор = НовоеУсловноеОформлениеСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтрагентНедействителен");
	Отбор.ПравоеЗначение = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыСвязей(Контрагент)
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить(ВладелецКонтакт);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СвязьКонтактКонтрагент, "Контакт",
		МассивОтбора, ВидСравненияКомпоновкиДанных.ВСписке);
	
	МассивОтбораКонтрагент = Новый Массив;
	МассивОтбораКонтрагент.Добавить(Контрагент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СвязьКонтактКонтрагент, "Контрагент",
		МассивОтбораКонтрагент, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

#КонецОбласти
