#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	УстановитьПодменюПодсистемыПечати();
	
	// Установка способа выбора структурной единицы в зависимости от ФО.
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить()
		И НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам.Получить() Тогда
		
		Элементы.ОтборСклад.РежимВыбораИзСписка = Истина;
		Элементы.ОтборСклад.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
		Элементы.ОтборСклад.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
		
	КонецЕсли;
	
	//УНФ.ОтборыСписка
	УстановитьВидимостьОтборов();
	ОпределитьПорядокПредопределенныхОтборовНаСервере();
	ВосстановитьОтборыСписковПриСозданииНаСервере();
	//Конец УНФ.ОтборыСписка
	
	УстановитьФорматДатыСписковПриСозданииНаСервере();
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(СписокПриходныйОрдер);
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(СписокРасходныйОрдер);
	
	ТекущаяСтраница = ИмяТекущейСтраницы();
	
	Если Не ТекущаяСтраница = Неопределено Тогда
		
		СтраницаПоИмени = Элементы.Найти(ТекущаяСтраница);
		
		Если Не СтраницаПоИмени = Неопределено Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = СтраницаПоИмени;
		КонецЕсли;
	
	КонецЕсли;
	
	ИспользуемыеВидыУчетаОрдерныхСкладов = СкладскойУчетСервер.ИспользуемыеВидыУчетаОрдерныхСкладов();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаДокументыКПоступлению", "Видимость", ИспользуемыеВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаДокументыКОтгрузке", "Видимость", ИспользуемыеВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам);
	
	ВремяЗадержкиОбработчиковОжидания = 0.3;
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ОформитьПриходныйОрдер.КнопкаПоУмолчанию = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаДокументыКПоступлению";
	Элементы.СписокДокументыКОтгрузкеСоздатьРасходныйОрдер.КнопкаПоУмолчанию = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаДокументыКОтгрузке";
	
	ВремяЗадержкиОбработчиковОжидания = ДокументыУНФКлиент.ВремяЗадержкиОбработчиковОжидания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		//УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		//Конец УНФ.ОтборыСписка
		
		СохранитьИмяТекущейСтраницы(); 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокФинДокументовКПоступлению" Тогда
		Элементы.СписокДокументыКПоступлению.Обновить();
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьСписокДокументовКОтгрузке" Тогда
		Элементы.СписокДокументыКОтгрузке.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборСкладОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("СтруктурнаяЕдиница", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	СтруктураПараметров = Новый Структура();
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМеток, СтруктураПараметров, "СтруктурнаяЕдиница");
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМеток, СтруктураПараметров, "Организация");
		
	ИмяФормыСтрока = РаботаСФормойДокументаКлиент.ИмяДокументаПоТипу(Параметр);
	ОткрытьФорму("Документ."+ИмяФормыСтрока+".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения",СтруктураПараметров));

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументыКПоступлениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.СписокДокументыКПоступлению.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат 
	КонецЕсли;

	ПоказатьЗначение(,ТекущиеДанные.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладПриходныйОрдерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("СтруктурнаяЕдиница", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриходныйОрдерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладРасходныйОрдерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("СтруктурнаяЕдиница", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияРасходныйОрдерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Элементы.ОформитьПриходныйОрдер.КнопкаПоУмолчанию = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаДокументыКПоступлению";
	Элементы.СписокДокументыКОтгрузкеСоздатьРасходныйОрдер.КнопкаПоУмолчанию = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаДокументыКОтгрузке";
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументыКОтгрузкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	ТекущиеДанные = Элементы.СписокДокументыКОтгрузке.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаТаксиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, ИмяСписка(), "Дата", СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, ИмяСписка(), "Дата", СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект);
	ТекущаяСтраница = Элементы[СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо];
	Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СвернутьРазвернутьПанельОтборов();
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект);
	ТекущаяСтраница = Элементы[СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо];
	Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПоШаблону(Команда)
	
	ЗаполнениеОбъектовУНФКлиент.ПоказатьВыборШаблонаДляСозданияДокументаИзСписка(
	"Документ.ПриходныйОрдер",
	СписокПриходныйОрдер.КомпоновщикНастроек.Настройки.Отбор.Элементы,
	Элементы.СписокПриходныйОрдер.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоШаблонуРасходныйОрдер(Команда)
	
	ЗаполнениеОбъектовУНФКлиент.ПоказатьВыборШаблонаДляСозданияДокументаИзСписка(
	"Документ.РасходныйОрдер",
	СписокРасходныйОрдер.КомпоновщикНастроек.Настройки.Отбор.Элементы,
	Элементы.СписокРасходныйОрдер.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриходныйОрдер(Команда)
	
	СоздатьДокумент("ПриходныйОрдер");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРасходныйОрдер(Команда)
	
	СоздатьДокумент("РасходныйОрдер");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	
	ИмяМетки = СтрЗаменить(ЭтаФорма.ТекущийЭлемент.Имя, "НастроитьОтборы", "");
	
	ИмяРеквизитаСписка = "Список" + ИмяМетки;
	ИмяТЧДанныеМеток = "ДанныеМеток" + ИмяМетки;
	ИмяТЧДанныеОтборов = "ДанныеОтборов" + ИмяМетки;
	ИмяГруппыОтборов = "ГруппаОтборы" + ИмяМетки;
	ИмяПредопределенныеОтборыПоУмолчанию = "ПредопределенныеОтборыПоУмолчанию" + ИмяМетки;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизитаСписка", ИмяРеквизитаСписка);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеОтборов", ИмяТЧДанныеОтборов);
	ДополнительныеПараметры.Вставить("ИмяГруппыОтборов", ИмяГруппыОтборов);
	ДополнительныеПараметры.Вставить("ИмяПредопределенныеОтборыПоУмолчанию", ИмяПредопределенныеОтборыПоУмолчанию);
	
	РаботаСОтборамиКлиент.НастроитьОтборыНажатие(ЭтотОбъект, ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры), ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеОтборы(Команда) 
	
	ИмяМетки = СтрЗаменить(ЭтаФорма.ТекущийЭлемент.Имя, "СброситьВсеОтборы", "");
	
	ИмяРеквизитаСписка = "Список" + ИмяМетки;
	ИмяТЧДанныеМеток = "ДанныеМеток" + ИмяМетки;
	ИмяТЧДанныеОтборов = "ДанныеОтборов" + ИмяМетки;
	
	СтруктураИменЭлементовПанелиОтборов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект);
	
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, ИмяРеквизитаСписка, "Дата", СтруктураИменЭлементовПанелиОтборов);
	СброситьВсеМеткиОтбораНаСервере(ИмяРеквизитаСписка, ИмяТЧДанныеМеток, СтруктураИменЭлементовПанелиОтборов, ИмяТЧДанныеОтборов);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	СвернутьРазвернутьПанельОтборов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ИмяТекущегоСписка = ИмяСписка();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы[ИмяТекущегоСписка]);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ИмяТекущегоСписка = ИмяСпискаСервер();
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы[ИмяТекущегоСписка], Результат);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ИмяТекущегоСписка = ИмяСписка();
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы[ИмяТекущегоСписка]);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область МеткиОтборов

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ПредставлениеЗначения= "" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	ИмяСписка = ИмяСпискаСервер();
	ИмяТчМеток = ИмяТчДанныхМетокСервер();
	
	Если ИмяТчМеток = "ДанныеМетокПриходныйОрдер" Тогда
		ИмяТЧДанныеОтборов = "ДанныеОтборовПриходныйОрдер";
	ИначеЕсли ИмяТчМеток = "ДанныеМетокРасходныйОрдер" Тогда
		ИмяТЧДанныеОтборов = "ДанныеОтборовРасходныйОрдер";
	Иначе
		ИмяТЧДанныеОтборов = "ДанныеОтборов";
	КонецЕсли;
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение
											, ПредставлениеЗначения,,,ИмяТчМеток,,,, ИмяТЧДанныеОтборов);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, ЭтотОбъект[ИмяСписка], ИмяПоляОтбораСписка,,,ИмяТчМеток,, ИмяТЧДанныеОтборов);
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СмещениеНаименованияМетки = ?(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "Страница", 1, 3);
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + СмещениеНаименованияМетки);
	
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	ИмяСписка = ИмяСпискаСервер();
	ИмяПравойПанели = ИмяПанелиМетокОтбора();
	
	ПоискМетки = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	Если СтрЗаканчиваетсяНа(ПоискМетки, "ПриходныйОрдер") Тогда
		ИмяТЧДанныеМеток = "ДанныеМетокПриходныйОрдер";
		ИмяТЧДанныеОтборов = "ДанныеОтборовПриходныйОрдер";
	ИначеЕсли СтрЗаканчиваетсяНа(ПоискМетки, "РасходныйОрдер") Тогда
		ИмяТЧДанныеМеток = "ДанныеМетокРасходныйОрдер";
		ИмяТЧДанныеОтборов = "ДанныеОтборовРасходныйОрдер";
	Иначе
		ИмяТЧДанныеМеток = "ДанныеМеток";
		ИмяТЧДанныеОтборов = "ДанныеОтборов";
	КонецЕсли;
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, ЭтотОбъект[ИмяСписка], МеткаИД, ИмяСписка, ИмяТЧДанныеМеток,,ИмяПравойПанели,,ИмяТЧДанныеОтборов);

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов() 
	
	// Журнал
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "Страница");
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "Список", СтруктураИменЭлементов,,, "ДанныеМеток", "ДанныеОтборов", "ГруппаОтборы");
	
	// ПриходныйОрдер
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "ПриходныйОрдер");
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "СписокПриходныйОрдер", СтруктураИменЭлементов,,, "ДанныеМетокПриходныйОрдер", "ДанныеОтборовПриходныйОрдер", "ГруппаОтборыПриходныйОрдер");
	
	// РасходныйОрдер
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "РасходныйОрдер");
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "СписокРасходныйОрдер", СтруктураИменЭлементов,,, "ДанныеМетокРасходныйОрдер", "ДанныеОтборовРасходныйОрдер", "ГруппаОтборыРасходныйОрдер");
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры)
	
	Возврат РаботаСОтборами.ПараметрыДляОткрытияФормыСНастройкамиОтборов(ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Процедура НастройкаОтборовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтборовЗавершениеНаСервере(Результат.АдресВыбранныеОтборы, Результат.АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаОтборовЗавершениеНаСервере(АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ИмяРеквизитаСписка = "Список";
		ИмяТЧДанныеМеток = "ДанныеМеток";
		ИмяТЧДанныеОтборов = "ДанныеОтборов";
	Иначе
		ИмяРеквизитаСписка = ДополнительныеПараметры.ИмяРеквизитаСписка;
		ИмяТЧДанныеМеток = ДополнительныеПараметры.ИмяТЧДанныеМеток;
		ИмяТЧДанныеОтборов = ДополнительныеПараметры.ИмяТЧДанныеОтборов;
	КонецЕсли;
	
	РаботаСОтборами.НастройкаОтборовЗавершение(ЭтотОбъект, АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ОтборПриИзменении(Элемент)
	
	Подключаемый_ОтборПриИзмененииНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборПриИзмененииНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	ПоискМетки = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	Если СтрЗаканчиваетсяНа(ПоискМетки, "ПриходныйОрдер") Тогда
		ИмяРеквизитаСписка = "СписокПриходныйОрдер";
		ИмяТЧДанныеМеток = "ДанныеМетокПриходныйОрдер";
		ИмяТЧДанныеОтборов = "ДанныеОтборовПриходныйОрдер";
	ИначеЕсли СтрЗаканчиваетсяНа(ПоискМетки, "РасходныйОрдер") Тогда
		ИмяРеквизитаСписка = "СписокРасходныйОрдер";
		ИмяТЧДанныеМеток = "ДанныеМетокРасходныйОрдер";
		ИмяТЧДанныеОтборов = "ДанныеОтборовРасходныйОрдер";
	Иначе
		ИмяРеквизитаСписка = "Список";
		ИмяТЧДанныеМеток = "ДанныеМеток";
		ИмяТЧДанныеОтборов = "ДанныеОтборов";
	КонецЕсли;
	
	РаботаСОтборами.Подключаемый_ОтборПриИзменении(ЭтотОбъект, ЭлементИмя, ЭлементРодительИмя, ИмяРеквизитаСписка, ИмяТЧДанныеМеток, ИмяТЧДанныеОтборов);
	
КонецПроцедуры

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ОтборОчистка(Элемент)
	
	Подключаемый_ОтборОчисткаНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборОчисткаНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборОчистка(ЭтотОбъект, ЭлементИмя);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтборов()
	
	Если НЕ ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам") Тогда
		Элементы.ОтборСклад.Видимость = Ложь;
		Элементы.ГруппаОтборСклад.Видимость = Ложь;
		
		Элементы.ГруппаОтборСкладПриходныйОрдер.Видимость = Ложь;
		Элементы.ГруппаОтборСкладРасходныйОрдер.Видимость = Ложь;
		
		Элементы.ГруппаОтборСкладПриходныйОрдер.Видимость = Ложь;
		Элементы.ГруппаОтборСкладРасходныйОрдер.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере(ИмяРеквизитаСписка, ИмяТЧДанныеМеток, СтруктураИменПредставленияПериода, ИмяТЧДанныеОтборов) 
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, ЭтаФорма[ИмяРеквизитаСписка],,ИмяРеквизитаСписка, ИмяТЧДанныеМеток, СтруктураИменПредставленияПериода, ИмяТЧДанныеОтборов);
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Функция СтруктураИменЭлементовПанелиОтборов(Форма, ИмяОбъекта = Неопределено)
	
	Если Не ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ИмяОбъекта = Форма.Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	КонецЕсли;
	
	ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "Страница", "");
	СтруктураИменЭлементов = РаботаСОтборамиКлиентСервер.ИменаЭлементовПравойПанели(ИмяОбъекта);
	
	Возврат СтруктураИменЭлементов;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокумент(ТипДокумента = "ПриходныйОрдер")
	
	ИмяСписка = ?(ТипДокумента = "ПриходныйОрдер", "СписокДокументыКПоступлению", "СписокДокументыКОтгрузке");
	
	Если Элементы[ИмяСписка].ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'");
		ПоказатьПредупреждение(Неопределено,ТекстПредупреждения);
		Возврат;
		
	КонецЕсли;
	
	МассивСтрок = Элементы[ИмяСписка].ВыделенныеСтроки;
	
	МассивДокументов = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из МассивСтрок Цикл
		МассивДокументов.Добавить(Элементы[ИмяСписка].ДанныеСтроки(ВыделеннаяСтрока).Ссылка);
	КонецЦикла;
	
	ИмяФормыДокумента = СтрШаблон(НСтр("ru = 'Документ.%1.ФормаОбъекта'"), ТипДокумента);
	
	Если МассивДокументов.Количество() > 0 Тогда
	
		ТипДокументаПроверки = ?(ТипДокумента = "ПриходныйОрдер", "Приход", "Расход");
		ДанныеФормирирования = ПроверитьКлючевыеРеквизитыДокументов(МассивДокументов, ТипДокументаПроверки);
		
		Если ДанныеФормирирования.СформироватьНесколькоДокументов Тогда

			ТекстСообщения = СтрШаблон(НСтр(
				"ru = 'Выбранные документы содержат различные данные (%1). Сформировать несколько %2 ордеров?'"),
				ДанныеФормирирования.ПредставлениеДанных, ?(ТипДокумента = "ПриходныйОрдер", НСтр("ru = 'Приходных'"), НСтр("ru = 'Расходных'")));
				
			СтруктураПараметровОповещения = Новый Структура();
			СтруктураПараметровОповещения.Вставить("МассивДокументов", МассивДокументов);
			СтруктураПараметровОповещения.Вставить("ИмяСписка", ИмяСписка);
			СтруктураПараметровОповещения.Вставить("ТипДокумента", ТипДокумента);
			СтруктураПараметровОповещения.Вставить("ДанныеФормирирования", ДанныеФормирирования);
			
			ОповещениеПослеВопроса = Новый ОписаниеОповещения("СоздатьДокументЗавершение", ЭтотОбъект, СтруктураПараметровОповещения);
			
			ПоказатьВопрос(ОповещениеПослеВопроса, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 0);

		Иначе
			
			Если МассивДокументов.Количество() Тогда
				
				Если МассивДокументов.Количество() = 1 Тогда
					ОснованиеЗаполнения = Новый Структура("ДанныеЗаполнения, ОткрытеИзАРМ", МассивДокументов[0], Истина);
				Иначе
					ОснованиеЗаполнения = Новый Структура("ДанныеЗаполнения, ОткрытеИзАРМ", МассивДокументов, Истина);
				КонецЕсли;
				
				ПараметрыФормы = Новый Структура("Основание", ОснованиеЗаполнения);
				ОткрытьФорму("Документ." + ТипДокумента + ".Форма.ФормаДокумента", ПараметрыФормы);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	МассивДокументов = ДополнительныеПараметры.МассивДокументов;
	ИмяСписка = ДополнительныеПараметры.ИмяСписка;
	ТипДокумента = ДополнительныеПараметры.ТипДокумента;
	ДанныеФормирирования = ДополнительныеПараметры.ДанныеФормирирования;
	
	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		МассивДокументов = СформироватьОрдераИЗаписать(МассивДокументов, ИмяСписка, ТипДокумента);
		Текст = НСтр("ru='Создание:'");
		Для Каждого СтрокаДокумент Из МассивДокументов Цикл
			
			ПоказатьОповещениеПользователя(Текст, ПолучитьНавигационнуюСсылку(СтрокаДокумент),
				СтрокаДокумент, БиблиотекаКартинок.Информация32);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы[ИмяСписка].Обновить();
	
КонецПроцедуры

&НаСервере
Функция СформироватьОрдераИЗаписать(МассивДокументов, ИмяСписка, ТипДокумента)
	Возврат СкладскойУчетСервер.СформироватьОрдераИЗаписать(МассивДокументов, ТипДокумента);
КонецФункции

&НаСервере
Функция ПроверитьКлючевыеРеквизитыДокументов(МассивДокументов, ТипДокументаПроверки = "Приход")
	
	Возврат СкладскойУчетСервер.ПроверитьКлючевыеРеквизитыДокументов(МассивДокументов, ТипДокументаПроверки);
	
КонецФункции

&НаКлиенте
Функция ИмяСписка()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "СтраницаПриходныйОрдер" Тогда Возврат "СписокПриходныйОрдер"
	ИначеЕсли ИмяСтраницы = "СтраницаРасходныйОрдер" Тогда Возврат "СписокРасходныйОрдер"
	ИначеЕсли ИмяСтраницы = "Страница" Тогда Возврат "Список"
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ИмяСпискаСервер()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "СтраницаПриходныйОрдер" Тогда Возврат "СписокПриходныйОрдер"
	ИначеЕсли ИмяСтраницы = "СтраницаРасходныйОрдер" Тогда Возврат "СписокРасходныйОрдер"
	ИначеЕсли ИмяСтраницы = "Страница" Тогда Возврат "Список"
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ИмяТчДанныхМетокСервер()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "СтраницаПриходныйОрдер" Тогда Возврат "ДанныеМетокПриходныйОрдер"
	ИначеЕсли ИмяСтраницы = "СтраницаРасходныйОрдер" Тогда Возврат "ДанныеМетокРасходныйОрдер"
	ИначеЕсли ИмяСтраницы = "Страница" Тогда Возврат "ДанныеМеток"
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ИмяПанелиМетокОтбора()
	
	ИмяСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "СтраницаПриходныйОрдер" Тогда Возврат "СтраницаПриходныйОрдерПраваяПанель"
	ИначеЕсли ИмяСтраницы = "СтраницаРасходныйОрдер" Тогда Возврат "СтраницаРасходныйОрдерПраваяПанель"
	ИначеЕсли ИмяСтраницы = "Страница" Тогда Возврат "ПраваяПанель"
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура УстановитьПодменюПодсистемыПечати()
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.ПриходныйОрдер"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКомандыПриходныйОрдер;
	ПараметрыРазмещения.ПрефиксГрупп = "СписокПриходныйОрдер";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.СписокПриходныйОрдерПодменюПечать);
	
	Массив.Очистить();
	Массив.Добавить(Тип("ДокументСсылка.РасходныйОрдер"));
	
	ТипИсточника = Новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = ТипИсточника;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКомандыРасходныйОрдер;
	ПараметрыРазмещения.ПрефиксГрупп = "СписокРасходныйОрдер";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.СписокРасходныйОрдерПодменюПечать);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматДатыСписковПриСозданииНаСервере()
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(СписокПриходныйОрдер);
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(СписокРасходныйОрдер);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьОтборыСписковПриСозданииНаСервере()
	
	// Обход проблемы: Ширина панели
	Интерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ШиринаПанели = ?(Интерфейс85, 37, 35);
	
	// ПриходныйОрдер
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "ПриходныйОрдер");
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокПриходныйОрдер, "СписокПриходныйОрдер", СтруктураИменЭлементов,,,, "ДанныеМетокПриходныйОрдер",, "ДанныеОтборовПриходныйОрдер", "ГруппаОтборыПриходныйОрдер");
	
	// Обход проблемы: Картинка фильтры
	Элементы[СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо].Картинка = БиблиотекаКартинок.ФильтрПустой;
	// Обход проблемы: Ширина панели
	Элементы[СтруктураИменЭлементов.ПраваяПанель].Ширина = 0;
	Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Ширина = ШиринаПанели;
	// Обход проблемы: Свернутая панель
	Если Не Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Видимость Тогда
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].Отображение = ОтображениеКнопки.Картинка;
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Развернуть правую панель'");
	Иначе
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].Отображение = ОтображениеКнопки.КартинкаИТекст;
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Свернуть правую панель'")
	КонецЕсли;
	
	// РасходныйОрдер
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект, "РасходныйОрдер");
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокРасходныйОрдер, "СписокРасходныйОрдер", СтруктураИменЭлементов,,,, "ДанныеМетокРасходныйОрдер",, "ДанныеОтборовРасходныйОрдер", "ГруппаОтборыРасходныйОрдер");
	
	// Обход проблемы: Картинка фильтры
	Элементы[СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо].Картинка = БиблиотекаКартинок.ФильтрПустой;
	// Обход проблемы: Ширина панели
	Элементы[СтруктураИменЭлементов.ПраваяПанель].Ширина = 0;
	Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Ширина = ШиринаПанели;
	// Обход проблемы: Свернутая панель
	Если Не Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Видимость Тогда
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].Отображение = ОтображениеКнопки.Картинка;
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Развернуть правую панель'");
	Иначе
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].Отображение = ОтображениеКнопки.КартинкаИТекст;
		Элементы[СтруктураИменЭлементов.СвернутьПравуюПанель].РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Свернуть правую панель'")
	КонецЕсли;
	
	// Обход проблемы: Свернутая панель
	Элементы.СвернутьПравуюПанель.Отображение = ОтображениеКнопки.Авто;
	Элементы.СвернутьПравуюПанель.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Свернуть правую панель'");
	
	// Журнал
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список, "Список");
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПорядокПредопределенныхОтборовНаСервере()
	
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект, "ГруппаОтборыПриходныйОрдер", "ПредопределенныеОтборыПоУмолчаниюПриходныйОрдер");
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект, "ГруппаОтборыРасходныйОрдер", "ПредопределенныеОтборыПоУмолчаниюРасходныйОрдер");
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	СтруктураИменЭлементов = СтруктураИменЭлементовПанелиОтборов(ЭтотОбъект);
	НовоеЗначениеВидимость = НЕ Элементы[СтруктураИменЭлементов.ПраваяПанельСтраницы].Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость, СтруктураИменЭлементов);
	
	//Обход проблемы: Количество фильтров индекс
	ЗначениеКоличествоФильтров = ЭтотОбъект[СтруктураИменЭлементов.ИмяРеквизитаКоличествоФильтров];
	ТекстовыйЗаголовокИндексаФильтров = СтрШаблон("(%1)", ЗначениеКоличествоФильтров);
	Элементы[СтруктураИменЭлементов.ИндексФильтрыТакси].Заголовок = ТекстовыйЗаголовокИндексаФильтров;
	ВидимостьЗначков = Не НовоеЗначениеВидимость И ЗначениеКоличествоФильтров <> 0;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СтруктураИменЭлементов.ИндексыФильтры, "Видимость", ВидимостьЗначков);
	//Обход проблемы: Количество фильтров индекс
	ЭтотОбъект[СтруктураИменЭлементов.ИмяРеквизитаКоличествоФильтровИндекс] = Мин(ЗначениеКоличествоФильтров, 10);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИмяТекущейСтраницы()
	ХранилищеСистемныхНастроек.Сохранить("ЖурналСкладскиеОрдера", "ИмяТекущейСтраницы", Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя);
КонецПроцедуры

&НаСервере
Функция ИмяТекущейСтраницы()
	Возврат ХранилищеСистемныхНастроек.Загрузить("ЖурналСкладскиеОрдера", "ИмяТекущейСтраницы");
КонецФункции

&НаСервере
Процедура АдаптацияТакси()
	
	Если Не ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПредставлениеПериода.Видимость = Ложь;
	Элементы.ПредставлениеПериодаПриходныйОрдер.Видимость = Ложь;
	Элементы.ПредставлениеПериодаРасходныйОрдер.Видимость = Ложь;
	
	Элементы.ПредставлениеПериодаТакси.Видимость = Истина;
	Элементы.ПредставлениеПериодаТаксиПриходныйОрдер.Видимость = Истина;
	Элементы.ПредставлениеПериодаТаксиРасходныйОрдер.Видимость = Истина;
	
	Элементы.ИндексФильтры.Видимость = Ложь;
	Элементы.ИндексФильтрыПриходныйОрдер.Видимость = Ложь;
	Элементы.ИндексФильтрыРасходныйОрдер.Видимость = Ложь;
	
	Элементы.ИндексФильтрыТакси.Видимость = Истина;
	Элементы.ИндексФильтрыТаксиПриходныйОрдер.Видимость = Истина;
	Элементы.ИндексФильтрыТаксиРасходныйОрдер.Видимость = Истина;
	
	Элементы.ГруппаСтандартныеКомандыПриходныйОрдер.Видимость = Истина;
	Элементы.ГруппаСтандартныеКомандыРасходныйОрдер.Видимость = Истина;
	Элементы.ГруппаСтандартныеКоманды.Видимость = Истина;
	ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
	
КонецПроцедуры

#КонецОбласти