
#Область ОбработчикиСобытийФормы

//@skip-check unknown-form-parameter-access
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяДоска = Параметры.ТекущаяДоска;
	ВидКонтактЦентра = Параметры.ВидКонтактЦентра;
	КолонкиТекущейДоски.Параметры.УстановитьЗначениеПараметра("Владелец", ТекущаяДоска);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.НастройкиОтображенияКалендаря);
	НачалоРабочегоДня		= Дата(1, 1, 1, Параметры.НастройкиОтображенияКалендаря.НачалоРабочегоДня, 0, 0);
	ОкончаниеРабочегоДня	= Дата(1, 1, 1, Параметры.НастройкиОтображенияКалендаря.ОкончаниеРабочегоДня, 0, 0);
	
	СобытияУНФКлиентСервер.ЗаполнитьСписокВыбораВремени(Элементы.НачалоРабочегоДня,
		3600, 
		'00010101000000',
		'00010101230000');
	СобытияУНФКлиентСервер.ЗаполнитьСписокВыбораВремени(Элементы.ОкончаниеРабочегоДня,
		3600,
		'00010101000000',
		'00010101230000');
	
	// Нулевое время обозначает конец дня, поэтому поставим его последним элементом
	Элементы.ОкончаниеРабочегоДня.СписокВыбора.Сдвинуть(0, 
		Элементы.ОкончаниеРабочегоДня.СписокВыбора.Количество() - 1);
		
	УстановитьУсловноеОформлениеСписка();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("НачалоРабочегоДня",		Час(НачалоРабочегоДня));
		Результат.Вставить("ОкончаниеРабочегоДня",	Час(ОкончаниеРабочегоДня));
		Результат.Вставить("ОтображатьТекущуюДату",	ОтображатьТекущуюДату);
		
		Закрыть(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КартинкаТелефонияНажатие(Элемент)
	
	НастроитьТелефонию();
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаПочтаНажатие(Элемент)

	НастроитьПочту();
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТелеграмНажатие(Элемент)

	НастроитьТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаВКонтактеНажатие(Элемент)
	
	НастроитьВКонтакте();
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаКабинетКлиентаНажатие(Элемент)
	
	НастроитьКабинетКлиента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКолонкиТекущейДоски

&НаКлиенте
Процедура КолонкиТекущейДоскиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КолонкиТекущейДоскиПриАктивизацииЯчейки(Элемент)
	
	ВыделеннаяКолонка = Элемент.ТекущиеДанные.Ссылка;
	ПерваяКолонкаКалендаря = ПерваяКолонка();
	
	Элементы.КолонкиТекущейДоскиПереместитьВверх.Доступность =  ПерваяКолонкаКалендаря <> ВыделеннаяКолонка;
	Элементы.КолонкиТекущейДоскиПереместитьВниз.Доступность =  ПерваяКолонкаКалендаря <> ВыделеннаяКолонка;
	Элементы.КолонкиТекущейДоскиКонтекстноеМенюИзменить.Доступность =  ПерваяКолонкаКалендаря <> ВыделеннаяКолонка;
	Элементы.КолонкиТекущейДоскиКонтекстноеМенюУстановитьПометкуУдаления.Доступность 
		=  ПерваяКолонкаКалендаря <> ВыделеннаяКолонка;
	Элементы.КолонкиТекущейДоскиУстановитьПометкуУдаления.Доступность 
		=  ПерваяКолонкаКалендаря <> ВыделеннаяКолонка;
	
КонецПроцедуры

&НаКлиенте
Процедура КолонкиТекущейДоскиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
 
	ВыделеннаяКолонка = ВыбраннаяСтрока;
	ПерваяКолонкаКалендаря = ПерваяКолонка();
	
	Если ПерваяКолонкаКалендаря = ВыделеннаяКолонка Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьКолонкуДоски(Команда)
	ПараметрыКолонки = Новый Структура;
	ПараметрыКолонки.Вставить("Владелец", ТекущаяДоска);
	ОткрытьФорму("Справочник.КолонкиКалендарейСотрудников.Форма.ФормаЭлемента", ПараметрыКолонки);
КонецПроцедуры

&НаКлиенте
Процедура Телефония(Команда)
	
	НастроитьТелефонию();
	
КонецПроцедуры

&НаКлиенте
Процедура Почта(Команда)

	НастроитьПочту();
	
КонецПроцедуры

&НаКлиенте
Процедура Телеграм(Команда)

	НастроитьТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ВКонтакте(Команда)

	НастроитьВКонтакте();
	
КонецПроцедуры

&НаКлиенте
Процедура КабинетКлиента(Команда)

	НастроитьКабинетКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	Если Элементы.КолонкиТекущейДоски.ТекущиеДанные = Неопределено
		ИЛИ Элементы.КолонкиТекущейДоски.ТекущаяСтрока = Неопределено Тогда
		//ИЛИ Элементы.КолонкиТекущейДоски.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Порядок = Элементы.КолонкиТекущейДоски.ТекущиеДанные.Порядок;
	Если Порядок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДоСмещения = Элементы.КолонкиТекущейДоски.ТекущаяСтрока;
	
	ПорядокЭлементовИзменен = ИзменитьПорядокЗаписей(Элементы.КолонкиТекущейДоски.ТекущиеДанные.Ссылка, Порядок, -1);
	
	Если НЕ ПорядокЭлементовИзменен Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КолонкиТекущейДоски.Обновить();
	Элементы.КолонкиТекущейДоски.ТекущаяСтрока = СтрокаДоСмещения;
	Оповестить("ИзменениеПорядка_КолонкиКалендаряСотрудника");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	Если Элементы.КолонкиТекущейДоски.ТекущиеДанные = Неопределено
		ИЛИ Элементы.КолонкиТекущейДоски.ТекущаяСтрока = Неопределено Тогда
		//ИЛИ Элементы.КолонкиТекущейДоски.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Порядок = Элементы.КолонкиТекущейДоски.ТекущиеДанные.Порядок;
	Если Порядок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДоСмещения = Элементы.КолонкиТекущейДоски.ТекущаяСтрока;
	
	ПорядокЭлементовИзменен = ИзменитьПорядокЗаписей(Элементы.КолонкиТекущейДоски.ТекущиеДанные.Ссылка, Порядок, 1);
	
	Если НЕ ПорядокЭлементовИзменен Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КолонкиТекущейДоски.Обновить();
	Элементы.КолонкиТекущейДоски.ТекущаяСтрока = СтрокаДоСмещения;
	Оповестить("ИзменениеПорядка_КолонкиКалендаряСотрудника");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьТелефонию()
	
	ПараметрыНастроек = Новый Структура("СтрокаПоиска", НСтр("ru = 'Телефония'"));
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаКаналовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы", ПараметрыНастроек, , , , ,
		ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПочту()
	
	ПараметрыНастроек = Новый Структура("СтрокаПоиска", НСтр("ru = 'Учетные записи почты'"));
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаКаналовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы", ПараметрыНастроек, , , , ,
		ОповещениеОЗакрытии);	

КонецПроцедуры

&НаКлиенте
Процедура НастроитьТелеграм()
	
	ПараметрыНастроек = Новый Структура("СтрокаПоиска", НСтр("ru = 'Интеграция с мессенджерами'"));
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаКаналовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы", ПараметрыНастроек, , , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВКонтакте()
	
	ПараметрыНастроек = Новый Структура("СтрокаПоиска", НСтр("ru = 'Интеграция с мессенджерами'"));
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаКаналовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы", ПараметрыНастроек, , , , , ОповещениеОЗакрытии);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКабинетКлиента()
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаКаналовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.НастройкиПубликацииМЛК.Форма.КонструкторМобильногоПриложения", , , , , ОповещениеОЗакрытии);
КонецПроцедуры

&НаСервере
Функция ИзменитьПорядокЗаписей(Запись, Порядок, НаправлениеИзменения)
	
	ТекущаяКолонка = Запись;
	ПредыдущаяКолонка = ПредыдущаяКолонка(Порядок + НаправлениеИзменения);
	
	Если НЕ ЗначениеЗаполнено(ПредыдущаяКолонка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПорядокПредыдущейКолонки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредыдущаяКолонка, "Порядок");
	Если ПорядокПредыдущейКолонки = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		
		ТекущаяКолонкаОбъект    = ТекущаяКолонка.ПолучитьОбъект();
		ТекущаяКолонкаОбъект.Заблокировать();
		ПредыдущаяКолонкаОбъект = ПредыдущаяКолонка.ПолучитьОбъект();
		ПредыдущаяКолонкаОбъект.Заблокировать();
		ПредыдущаяКолонкаОбъект.Порядок = ТекущаяКолонкаОбъект.Порядок;
		ТекущаяКолонкаОбъект.Порядок = ТекущаяКолонкаОбъект.Порядок + НаправлениеИзменения;
		
		ТекущаяКолонкаОбъект.Записать();
		ТекущаяКолонкаОбъект.Разблокировать();
		ПредыдущаяКолонкаОбъект.Записать();
		ПредыдущаяКолонкаОбъект.Разблокировать();
		
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПредыдущаяКолонка(Порядок)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КолонкиКалендарейСотрудников.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КолонкиКалендарейСотрудников КАК КолонкиКалендарейСотрудников
	|ГДЕ
	|	КолонкиКалендарейСотрудников.Порядок = &Порядок И КолонкиКалендарейСотрудников.Владелец = &ТекущаяДоска";
	
	Запрос.УстановитьПараметр("Порядок", Порядок);
	Запрос.УстановитьПараметр("ТекущаяДоска", ТекущаяДоска);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.КолонкиКалендарейСотрудников.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура НастройкаКаналовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	ВидСписок    = 0;
	ВидКанбан    = 1;
	ВидКалендарь = 2;
	
	Если ВидКонтактЦентра = ВидСписок ИЛИ ВидКонтактЦентра = ВидКанбан Тогда
		Элементы.ГруппаСтраницыНастроек.ТекущаяСтраница = Элементы.ГруппаВходящее;
	ИначеЕсли ВидКонтактЦентра = ВидКалендарь Тогда
		Элементы.ГруппаСтраницыНастроек.ТекущаяСтраница = Элементы.ГруппаКалендарь;
	Иначе
		Элементы.ГруппаСтраницыНастроек.ТекущаяСтраница = Элементы.ГруппаДоски;
	КонецЕсли;
	
	РазрешеноПодключатьКаналы = Пользователи.ЭтоПолноправныйПользователь();
	
	УстановитьПривилегированныйРежим(Истина);
	Подключено_Телефония = КонтактЦентр.ПодключенаТелефония();
	Подключено_Почта     = КонтактЦентр.ПодключенаПочта();
	Подключено_КабинетКлиента = КонтактЦентр.ПодключенКабинетКлиента();
	Подключено_Телеграм = КонтактЦентр.ПодключенТелеграм();
	Подключено_ВКонтакте = КонтактЦентр.ПодключенВКонтакте();
	УстановитьПривилегированныйРежим(Ложь);

	УстановитьПризнакиПодключенияКаналов();

	МассивГрупп = Новый Массив;
	МассивГрупп.Добавить("Телефония");
	МассивГрупп.Добавить("Почта");
	МассивГрупп.Добавить("Телеграм");
	МассивГрупп.Добавить("ВКонтакте");
	МассивГрупп.Добавить("КабинетКлиента");
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() <> Истина Тогда
		Для Каждого ГруппаОбертка Из МассивГрупп Цикл
			Элементы[ГруппаОбертка].ЦветФона = ЦветаПалитры.Серый;
			Элементы["Группа" + ГруппаОбертка].ЦветФона = ЦветаПалитры.БелыйУНФ;
			Элементы["Команда" + ГруппаОбертка].Видимость = Истина;
			Элементы["Декорация" + ГруппаОбертка].Видимость = Ложь;
		КонецЦикла;
	Иначе
		Для Каждого ГруппаОбертка Из МассивГрупп Цикл
			Элементы["Команда" + ГруппаОбертка].Видимость = Ложь;
			Элементы["Декорация" + ГруппаОбертка].Видимость = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакиПодключенияКаналов()
	
	Реквизиты = ПолучитьРеквизиты();
	Для Каждого Реквизит Из Реквизиты Цикл
		Если СтрНайти(Реквизит.Имя, "Подключено") = 0 Тогда
			Продолжить;
		КонецЕсли;
		Канал = Прав(Реквизит.Имя, СтрДлина(Реквизит.Имя) - СтрНайти(Реквизит.Имя, "_"));
		//Элементы["ВРаботе_" + Канал].Видимость = ЭтотОбъект[Реквизит.Имя];
		Если Канал = "Телефония" Тогда
			Если ЭтотОбъект[Реквизит.Имя] = Истина Тогда
				Элементы.КартинкаТелефония.Картинка = БиблиотекаКартинок.КонтактЦентрТелефония85Цвет;
			Иначе
				Элементы.КартинкаТелефония.Картинка = БиблиотекаКартинок.КонтактЦентрТелефония85ЧБ;
			КонецЕсли;   
			Продолжить;
		КонецЕсли;
		Если Канал = "Почта" Тогда
			Если ЭтотОбъект[Реквизит.Имя] = Истина Тогда
				Элементы.КартинкаПочта.Картинка = БиблиотекаКартинок.КонтактЦентрПочта85Цвет;
			Иначе
				Элементы.КартинкаПочта.Картинка = БиблиотекаКартинок.КонтактЦентрПочта85ЧБ;
			КонецЕсли;   
			Продолжить;
		КонецЕсли;
		Если Канал = "Телеграм" Тогда
			Если ЭтотОбъект[Реквизит.Имя] = Истина Тогда
				Элементы.КартинкаТелеграм.Картинка = БиблиотекаКартинок.КонтактЦентрТелеграм85Цвет;
			Иначе
				Элементы.КартинкаТелеграм.Картинка = БиблиотекаКартинок.КонтактЦентрТелеграм85ЧБ;
			КонецЕсли;   
			Продолжить;
		КонецЕсли;
		Если Канал = "ВКонтакте" Тогда
			Если ЭтотОбъект[Реквизит.Имя] = Истина Тогда
				Элементы.КартинкаВКонтакте.Картинка = БиблиотекаКартинок.КонтактЦентрВконтакте85Цвет;
			Иначе
				Элементы.КартинкаВКонтакте.Картинка = БиблиотекаКартинок.КонтактЦентрВКонтакте85ЧБ;
			КонецЕсли;   
			Продолжить;
		КонецЕсли;
		Если Канал = "КабинетКлиента" Тогда
			Если ЭтотОбъект[Реквизит.Имя] = Истина Тогда
				Элементы.КартинкаКабинетКлиента.Картинка = БиблиотекаКартинок.КабинетКлиентаИконка;
			Иначе
				Элементы.КартинкаКабинетКлиента.Картинка = БиблиотекаКартинок.КабинетКлиентаИконка85ЧБ;
			КонецЕсли;   
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПерваяКолонка()
	Возврат Справочники.КолонкиКалендарейСотрудников.КолонкаНеобработанное(ТекущаяДоска);
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеСписка()
	
	ПерваяКолонкаКалендаря = ПерваяКолонка();
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
		"КолонкиТекущейДоски.Ссылка", 
		ПерваяКолонкаКалендаря, 
		ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, Элементы["КолонкиТекущейДоскиНаименование"].Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Шрифт", ШрифтыСтиля.ЗаголовокЧетвертогоУровня);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
		"КолонкиТекущейДоски.Ссылка", 
		ПерваяКолонкаКалендаря, 
		ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, Элементы["КолонкиТекущейДоскиНаименование"].Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Серый);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаТелефонияНажатие(Элемент)
	НастроитьТелефонию();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПочтаНажатие(Элемент)
	НастроитьПочту();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаТелеграмНажатие(Элемент)
	НастроитьТелеграм();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаВКонтактеНажатие(Элемент)
	НастроитьВКонтакте();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаКабинетКлиентаНажатие(Элемент)
	НастроитьКабинетКлиента();
КонецПроцедуры

&НаКлиенте
Процедура КолонкиТекущейДоскиПриНаведении(Элемент, Строка, Поле)
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыделеннаяКолонка = Строка;
	ПерваяКолонкаКалендаря = ПерваяКолонка();
	
	Элементы.КолонкиТекущейДоскиКонтекстноеМенюУстановитьПометкуУдаления.Доступность 
		=  ПерваяКолонкаКалендаря <> ВыделеннаяКолонка;  
	Элементы.КолонкиТекущейДоскиУстановитьПометкуУдаления.Доступность 
		=  ПерваяКолонкаКалендаря <> ВыделеннаяКолонка;  

КонецПроцедуры

#КонецОбласти
