
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НавигационнаяСсылка = "e1cib/app/" + ЭтотОбъект.ИмяФормы;
	
	Если Не БизнесСеть.ПравоНастройкиОбменаДокументами(Истина) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОдиночнаяРегистрация = ЗначениеЗаполнено(Параметры.Ссылка);
	ИспользуетсяНесколькоОрганизаций = ОбщегоНазначенияБЭД.ИспользуетсяНесколькоОрганизаций();
	
	Если Не ОдиночнаяРегистрация И Не ИспользуетсяНесколькоОрганизаций Тогда
		Параметры.Ссылка = ОбщегоНазначенияБЭД.ОрганизацияПоУмолчанию();
		Если ЗначениеЗаполнено(Параметры.Ссылка) Тогда
			ОдиночнаяРегистрация = Истина;
		КонецЕсли;
	КонецЕсли;
	
	НастроитьФормуПриСоздании();

	Если ОдиночнаяРегистрация Тогда
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ЗаполнитьРеквизитыПоСсылке(Параметры.Ссылка);
	КонецЕсли;
	
	ОбновитьСписок();
	
	ДанныеКонтекста = Неопределено;
	Если Параметры.Свойство("ДанныеКонтекста") И ТипЗнч(Параметры.ДанныеКонтекста) = Тип("Структура") Тогда
		ДанныеКонтекста = Новый Структура;
		ДанныеКонтекста.Вставить("РежимПоставщика", Ложь);
		ДанныеКонтекста.Вставить("РежимПокупателя", Ложь);
		ЗаполнитьЗначенияСвойств(ДанныеКонтекста, Параметры.ДанныеКонтекста);
	КонецЕсли;
	
	УстановкаВидимостиЭлементовПодсистемыТорговыеПредложения();
	
	АдаптироватьФормуПодТекущийВариантИнтерфейсаКлиентскогоПриложения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИнтернетПоддержкаОтключена" Тогда
		Логин = "";
	ИначеЕсли ИмяСобытия = "БизнесСеть_РегистрацияОрганизаций" И Источник <> ЭтотОбъект Тогда
		
		Если ОдиночнаяРегистрация Тогда
			
			ЗаполнитьРеквизитыПоСсылке(Параметры.Ссылка);
			
		Иначе
			
			ОбновитьСписок();
			ПриАктивацииСтрокиОрганизации();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПрофильОрганизацииНажатие(Элемент)
	
	БизнесСетьСлужебныйКлиент.ОткрытьПрофильОрганизацииНаСайтеБизнесСети(ОрганизацияИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПриАктивацииСтрокиОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключенаПриИзменении(Элемент)
	
	ВыделенныеСтроки = Элементы.Список.ПолучитьСтрокиДляОбработки();
	Если ВыделенныеСтроки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	ТекущиеДанные = Элементы.Список.ДанныеСтроки(ВыделенныеСтроки[0]);
	
	ТекущиеДанные.Подключена = Не ТекущиеДанные.Подключена;
	
	Если ТекущиеДанные.Подключена Тогда
		ОтключитьОрганизации();
	Иначе
		ПодключитьОрганизацию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗарегистрироватьОрганизации(Команда)
		
	ПодключитьОрганизацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОрганизации()
	
	Если ОдиночнаяРегистрация Тогда
		ТекстВопроса =
			НСтр("ru = 'Будет произведено отключение организации от сервиса 1С:БизнесСеть в программе (информационной базе).
			|При этом, для других участников сервиса организация будет отображаться как зарегистрированные.'");
	Иначе
		ТекстВопроса =
			НСтр("ru = 'Организации будут отключены от сервиса 1С:БизнесСеть в программе (информационной базе).
			|При этом, для других участников сервиса организации будут отображаться как зарегистрированные.'");
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтключитьОрганизацииПродолжение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрофильОрганизацииНаСайтеБизнесСети(Команда)

	Если ОдиночнаяРегистрация Тогда
		БизнесСетьСлужебныйКлиент.ОткрытьПрофильОрганизацииНаСайтеБизнесСети(ОрганизацияИдентификатор);
	Иначе
		ВыделенныеСтроки = Элементы.Список.ПолучитьСтрокиДляОбработки();
		Если ВыделенныеСтроки.Количество() = 0 Тогда 
			Возврат;
		КонецЕсли;
		ВыбраннаяСтрока = ВыделенныеСтроки[0];
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
		Если Не ДанныеСтроки.Подключена 
			И Не ДанныеСтроки.ТребуетсяПовторноеПодключение Тогда
			Возврат;
		КонецЕсли;
		БизнесСетьСлужебныйКлиент.ОткрытьПрофильОрганизацииНаСайтеБизнесСети(ДанныеСтроки.ИдентификаторОрганизации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьТребуетсяПодключениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПодключитьОрганизацию();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокОрганизаций(Команда)
	
	ОбновитьСписок();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключениеОрганизацииКСервису

&НаКлиенте
Процедура ПодключитьОрганизациюКСервису(Организация)
	
	НастроитьФормуПриДлительнойОперации(Истина);
	
	ДлительнаяОперация = ПодключитьОрганизациюКСервисуНаСервере(Организация);
	
	ПараметрыОжидания                                 = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания            = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения               = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ПодключитьОрганизациюКСервисуЗавершение", 
		ЭтотОбъект, Новый Структура("Организация", Организация));
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПодключитьОрганизациюКСервисуНаСервере(Организация)
	
	ПараметрыПоиска = Новый Структура;
	
	ПараметрыПоиска.Вставить("Организация", Организация);
	
	ПараметрыВыполнения                             = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Подключение организации к сервису Бизнес-сеть'");
	ПараметрыВыполнения.ОжидатьЗавершение           = 0;
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"БизнесСеть.ПодключитьОрганизациюПоТикетуИТСВФоне", ПараметрыПоиска, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ПодключитьОрганизациюКСервисуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НастроитьФормуПриДлительнойОперации(Ложь);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	БизнесСетьСлужебныйКлиент.ВывестиСообщенияФоновогоЗадания(Результат);
	
	РезультатПодключения = БизнесСетьВызовСервера.ПолучитьУдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если РезультатПодключения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьСтатусПодключенияОрганизации(
		РезультатПодключения.СтатусПодключения, 
		ДополнительныеПараметры.Организация, 
		Ложь);

	КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПриАктивацииСтрокиОрганизации()
	
	ВыделенныеСтроки = Элементы.Список.ПолучитьСтрокиДляОбработки();
	Если ВыделенныеСтроки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	ТекущиеДанные = Элементы.Список.ДанныеСтроки(ВыделенныеСтроки[0]);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекущиеДанные.ТребуетсяПовторноеПодключение Тогда
		ПоказатьПредупреждениеОПовторномПодключении(ТекущиеДанные.Ссылка);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаТребуетсяПодключение", "Видимость", Ложь);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПриДлительнойОперации(ЭтоНачалоДлительнойОперации)
	
	Если ЭтоНачалоДлительнойОперации Тогда
		Элементы.Основная.ТекущаяСтраница =  Элементы.ГруппаДлительноеОжидание;
	ИначеЕсли ОдиночнаяРегистрация Тогда
		Элементы.Основная.ТекущаяСтраница =  Элементы.ГруппаОдиночное;
	Иначе
		Элементы.Основная.ТекущаяСтраница =  Элементы.ГруппаСписок;
	КонецЕсли;
	
	Элементы.Подключить.Доступность               = Не ЭтоНачалоДлительнойОперации;
	Элементы.Список.Доступность                   = Не ЭтоНачалоДлительнойОперации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОрганизацию()
	
	Если ОдиночнаяРегистрация Тогда
		Организация = ОрганизацияСсылка;
	Иначе
		ВыделенныеСтроки = Элементы.Список.ПолучитьСтрокиДляОбработки();
		Если ВыделенныеСтроки.Количество() = 0 Тогда 
			Возврат;
		КонецЕсли;
		ВыбраннаяСтрока = ВыделенныеСтроки[0];
		ТекущиеДанные = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		
		Организация = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	СтатусПодключениеОрганизации = СтатусПодключениеОрганизацииКСервису(Организация);
	
	ОбработатьСтатусПодключенияОрганизации(СтатусПодключениеОрганизации, Организация, Истина);
		
КонецПроцедуры

&НаСервере
Функция СтатусПодключениеОрганизацииКСервису(Организация)
	
	Возврат БизнесСеть.СтатусПодключениеОрганизацииКСервису(Организация);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьСтатусПодключенияОрганизации(СтатусПодключениеОрганизации, Организация, ВыполнятьПодключениеВФоне)
	
	Если СтатусПодключениеОрганизации = "ТребуетсяИнтерактивноеПодключение" 
		ИЛИ СтатусПодключениеОрганизации = "ТребуетсяПовторноеПодключение" Тогда
		
		Если ДанныеОрганизацииЗаполнены(Организация) Тогда
			
			Оповещение = Новый ОписаниеОповещения("ПодключитьОрганизациюПродолжение", ЭтотОбъект, Новый Структура("Организация", Организация));
			
			БизнесСетьСлужебныйКлиент.ОткрытьФормуПодключенияОрганизации(Организация, ЭтотОбъект, Оповещение);
			
		КонецЕсли;

	ИначеЕсли СтатусПодключениеОрганизации = "Подключена" Тогда
		
		БизнесСетьСлужебныйКлиент.ПоказатьУведомлениеОПодключенииОрганизацииКСервису();
		
	ИначеЕсли СтатусПодключениеОрганизации = "ТребуетсяОбращениеКСервису" Тогда	
		
		Если ВыполнятьПодключениеВФоне Тогда
			ПодключитьОрганизациюКСервису(Организация);
		КонецЕсли;
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестный статус подключения организации'")	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОрганизациюПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	БизнесСетьСлужебныйКлиент.ПоказатьУведомлениеОПодключенииОрганизацииКСервису();
	
	Если ОдиночнаяРегистрация Тогда
		ОрганизацияЗарегистрирована = Истина;
		ОрганизацияИдентификатор = Результат.Идентификатор;
		ОбновитьВидимостьДоступностьЭлементов();
	Иначе
		ОбновитьСписок();
		ПриАктивацииСтрокиОрганизации();
	КонецЕсли;
	
	Если ЭтотОбъект.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца Тогда
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеОрганизацииЗаполнены(Организация)
	
	РеквизитИНН = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННОрганизации");
	
	ЗначениеИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, РеквизитИНН);
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(ЗначениеИНН) Тогда

		ТекстОшибки = НСтр("ru = 'Не заполнено свойство ""ИНН""'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтключитьОрганизацииПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если ОдиночнаяРегистрация Тогда
		ВыполнитьОтключениеОрганизацииОдиночное();
	Иначе
		ВыполнитьОтключениеОрганизаций();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоСсылке(Ссылка)
	
	СокращенноеНаименованиеОрганизации = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("СокращенноеНаименованиеОрганизации");
	ИННОрганизации = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННОрганизации");
	КППОрганизации = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППОрганизации");
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Наименование КАК Наименование,
		|	Организации.ИНН КАК ИНН,
		|	Организации.КПП КАК КПП,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОрганизацииБизнесСеть.Идентификатор, """") = """"
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОрганизацияЗарегистрирована,
		|	ОрганизацииБизнесСеть.Идентификатор КАК Идентификатор,
		|	ОрганизацииБизнесСеть.ТребуетсяПовторноеПодключение КАК ТребуетсяПовторноеПодключение
		|ИЗ
		|	&Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
		|		ПО Организации.Ссылка = ОрганизацииБизнесСеть.Организация
		|ГДЕ
		|	Организации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Параметры.Ссылка);
	ИмяСправочникаОрганизации = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника("Организации");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Организации", "Справочник." + ИмяСправочникаОрганизации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организации.Наименование", "Организации." + СокращенноеНаименованиеОрганизации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организации.ИНН", "Организации." + ИННОрганизации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организации.КПП", "Организации." + КППОрганизации);
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОрганизацияЗарегистрирована = Ложь;
	ОрганизацияНаименование = "";
	ОрганизацияИНН = "";
	ОрганизацияКПП = "";
	ОрганизацияТребуетсяПовторноеПодключение = Ложь;
	
	Если Выборка.Следующий() Тогда
		ОрганизацияНаименование     = Выборка.Наименование;
		ОрганизацияИНН              = Выборка.ИНН;
		ОрганизацияКПП              = Выборка.КПП;
		ОрганизацияЗарегистрирована = Выборка.ОрганизацияЗарегистрирована;
		ОрганизацияСсылка           = Параметры.Ссылка;
		ОрганизацияИдентификатор    = Выборка.Идентификатор;
		ОрганизацияТребуетсяПовторноеПодключение = Выборка.ТребуетсяПовторноеПодключение; 
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьФормуПодТекущийВариантИнтерфейсаКлиентскогоПриложения()

	Если Не КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5 Тогда
		Элементы.НадписьТребуетсяПодключение.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элементы.ГруппаТребуетсяПодключение.ЦветФона = Новый Цвет;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьЭлементов()
	
	Если ОдиночнаяРегистрация Тогда 
		Элементы.ГруппаСписок.Видимость = Ложь;
		Элементы.Основная.ТекущаяСтраница =  Элементы.ГруппаОдиночное;
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Низ;
		
		Если ОрганизацияЗарегистрирована И Не ОрганизацияТребуетсяПовторноеПодключение Тогда 
			Элементы.ГруппаОдиночноеЭтапы.ТекущаяСтраница = Элементы.ГруппаОрганизацияЗарегистрирована;
		Иначе
			Элементы.ГруппаОдиночноеЭтапы.ТекущаяСтраница = Элементы.ГруппаОдиночноеРегистрация;
			Элементы.ОрганизацияКПП.Видимость = ЗначениеЗаполнено(ОрганизацияКПП);
		КонецЕсли;
	Иначе
		Элементы.ПодключитьКонтекстная.КнопкаПоУмолчанию = Истина;
		Элементы.ГруппаОдиночное.Видимость = Ложь;
		Элементы.Подключить.Видимость = Ложь;
		Элементы.ФормаГруппаКомандБизнесСети.Видимость = Ложь;
		Элементы.Основная.ТекущаяСтраница =  Элементы.ГруппаСписок;
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Верх;
	КонецЕсли;
	
	Если ОрганизацияТребуетсяПовторноеПодключение Тогда
		ПоказатьПредупреждениеОПовторномПодключении(ОрганизацияСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()
	
	Если ОдиночнаяРегистрация Тогда 
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапросаСписка());
	Список.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаСписка()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОрганизацииБизнесСеть.ТребуетсяПовторноеПодключение КАК ТребуетсяПовторноеПодключение,
	|	Организации.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ОрганизацииБизнесСеть.Организация ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НЕ ОрганизацииБизнесСеть.ТребуетсяПовторноеПодключение 
	|	КОНЕЦ КАК Подключена,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	ОрганизацииБизнесСеть.Идентификатор КАК ИдентификаторОрганизации
	|ИЗ
	|	&Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	|		ПО Организации.Ссылка = ОрганизацииБизнесСеть.Организация
	|			И (ОрганизацииБизнесСеть.Идентификатор <> """")
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления";
	
	ИмяСправочникаОрганизации = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника("Организации");
	ИННОрганизации = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННОрганизации");
	КППОрганизации = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППОрганизации");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Организации", "Справочник." + ИмяСправочникаОрганизации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".ИНН", "." + ИННОрганизации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".КПП", "." + КППОрганизации);
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОтключениеОрганизаций()
	
	ОчиститьСообщения();
	
	Если ОдиночнаяРегистрация Тогда
		Возврат;
	КонецЕсли;
	СтрокиДляОбработк = Элементы.Список.ПолучитьСтрокиДляОбработки();
	
	СписокОрганизаций = Новый Массив;
	ВсеЗарегистрированы = Истина;
	Для Каждого СтрокаСписка Из СтрокиДляОбработк Цикл
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(СтрокаСписка);
		СписокОрганизаций.Добавить(ДанныеСтроки.Ссылка);
		ВсеЗарегистрированы = Мин(ВсеЗарегистрированы, ДанныеСтроки.Подключена);
	КонецЦикла;
	
	Если Не ВсеЗарегистрированы Тогда
		ТекстСообщения = НСтр("ru = 'Отключение организаций в программе не выполнено. Выбрана незарегистрированная организация.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	БизнесСетьВызовСервера.ОтключитьОрганизации(СписокОрганизаций, Отказ);

	Если Не Отказ Тогда
		
 		ТекстОповещения = НСтр("ru = 'Отключение организаций в программе успешно выполнено.'");
		ПоказатьОповещениеПользователя(НСтр("ru = '1С:Бизнес-сеть'"),, ТекстОповещения, БиблиотекаКартинок.БизнесСеть);
		Оповестить("БизнесСеть_РегистрацияОрганизаций",, ЭтотОбъект);
		
		ОбновитьСписок();
		ПриАктивацииСтрокиОрганизации();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтключениеОрганизацииОдиночное()
	
	ОчиститьСообщения();
	
	Если Не ОрганизацияЗарегистрирована Тогда
		ТекстСообщения = НСтр("ru = 'Отключение организаций в программе не выполнено. Организация не зарегистрирована.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СписокОрганизаций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры.Ссылка);
	
	Отказ = Ложь;
	
	БизнесСетьВызовСервера.ОтключитьОрганизации(СписокОрганизаций, Отказ);
	
	Если Не Отказ Тогда
		
		ТекстОповещения = НСтр("ru = 'Отключение организации в программе успешно выполнено.'");
		ПоказатьОповещениеПользователя(НСтр("ru = '1С:Бизнес-сеть'"),, ТекстОповещения, БиблиотекаКартинок.БизнесСеть);
		Оповестить("БизнесСеть_РегистрацияОрганизаций",, ЭтотОбъект);
		
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура УстановкаВидимостиЭлементовПодсистемыТорговыеПредложения()
	
	// Проверка видимости торговых предложений.
	ОбщийМодульТорговыеПредложения = Неопределено;
	ПравоНастройки = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ТорговыеПредложения") Тогда
		ОбщийМодульТорговыеПредложения = ОбщегоНазначения.ОбщийМодуль("ТорговыеПредложения");
		ПравоНастройки = ОбщийМодульТорговыеПредложения.ПравоНастройкиТорговыхПредложений();
	КонецЕсли;
	
	Если ОбщийМодульТорговыеПредложения = Неопределено Или ПравоНастройки = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	МассивПодстрок = Новый Массив;
	МассивПодстрок.Добавить(Элементы.КраткоеОписание.Заголовок);
	МассивПодстрок.Добавить(Символы.ПС + "• ");
	МассивПодстрок.Добавить(СтрШаблон(НСтр("ru = '<a href=""%1"">Торговая площадка</a>'"), БизнесСетьКлиентСервер.ГиперссылкаНаПромоСайтТорговаяПлощадка()));
	МассивПодстрок.Добавить(" - " 
		+ НСтр("ru = 'сервис в программах 1С:Предприятие для поставщиков и покупателей (закупщиков).
		|Поставщикам - сервис помогает упростить процессы обработки заказов и получить новых клиентов;
		|Покупателям - найти выгодных поставщиков и сократить время оформления заказов.'"));
	ФорматированнаяСтрокаЗаголовка = СтроковыеФункции.ФорматированнаяСтрока(СтрСоединить(МассивПодстрок));
	Элементы.КраткоеОписание.Заголовок = ФорматированнаяСтрокаЗаголовка;
		
КонецПроцедуры

&НаСервере
Процедура ПоказатьПредупреждениеОПовторномПодключении(Организация)
	
	ШаблонЗаголовка = 
		НСтр("ru = 'Для организации %1 доступ к сервису 1С:Бизнес-сеть был приостановлен.'");

	Если ОдиночнаяРегистрация Тогда
		Разделитель = Символы.ПС;
	Иначе
		Разделитель = " ";
	КонецЕсли;
	
	МассивПодстрок = Новый Массив;
	МассивПодстрок.Добавить(СтрШаблон(ШаблонЗаголовка, Организация));
	МассивПодстрок.Добавить(СтрШаблон(НСтр("ru = 'Необходимо <a href=""КомандаПодключения"">%1</a>'"), НСтр("ru = 'повторное подключение организации.'")));
	
	ФорматированнаяСтрокаЗаголовка = СтроковыеФункции.ФорматированнаяСтрока(СтрСоединить(МассивПодстрок, Разделитель));
	
	Элементы.ГруппаТребуетсяПодключение.Видимость = Истина;
	Элементы.НадписьТребуетсяПодключение.Заголовок = ФорматированнаяСтрокаЗаголовка;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПриСоздании()
	
	КлючСохраненияПоложенияОкна = СтрШаблон("%1_%2", ОдиночнаяРегистрация, ОрганизацияЗарегистрирована);
	
	Элементы.ГруппаТребуетсяПодключение.Видимость = Ложь;
	
	ОбновитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти
