#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",  НСтр("ru = 'Документы о предстоящей поставке товаров (ДОПП)'"));
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийВвозТоваровИзЕАЭС.ДОПП"));
	
	ОткрытьФорму("Документ.ЗаявлениеОВвозеТоваров.ФормаСписка", ПараметрыФормы,,"ФормаСписка_ДОПП");

КонецПроцедуры

#КонецОбласти