
#Область ПрограммныйИнтерфейс

// Переопределяет открытие формы настройка кассового qr-кода СБП
//
// Параметры:
//  КассаККМ 		- ОпределяемыйТип.КассаККМРМК - касса qr-кода;
//  Организация 	- ОпределяемыйТип.ОрганизацияРМК - организация кассового qr-кода;
//  ТорговыйОбъект 	- ОпределяемыйТип.ТорговыйОбъектРМК - торговый объект кассового qr-кода;
//
//@skip-warning
Процедура ОткрытьФормуНастройкиКассовогоQRКода(КассаККМ, Организация, ТорговыйОбъект) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФКлиент.ОткрытьФормуНастройкиКассовогоQRКода(
		КассаККМ, 
		Организация, 
		ТорговыйОбъект);
	
КонецПроцедуры

// Выполняет подтверждение прав на операцию платежной системы и передает результат в описание оповещения
//
// Параметры:
//  ОперацияПлатежнойСистемы - Строка - операция требующая подтверждения администратора, пример "Оплата" или "Возврат";
//  ОповещениеОЗавершении - ОписаниеОповещения - организация кассового qr-кода;
//
Процедура ПодтверждениеПравНаОперациюПлатежнойСистемы(ОперацияПлатежнойСистемы, ОповещениеОЗавершении) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
