
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();

	// Чтобы уменьшить количество бесконтекстных вызовов сервера.
	СпособПредоставленияПроцент = Перечисления.СпособыПредоставленияСкидокНаценок.Процент;
	СпособПредоставленияСумма = Перечисления.СпособыПредоставленияСкидокНаценок.Сумма;
	СпособПредоставленияВидЦен = Перечисления.СпособыПредоставленияСкидокНаценок.ВидЦен;
	СпособПредоставленияОкругление = Перечисления.СпособыПредоставленияСкидокНаценок.Округление;
	СпособПредоставленияКоличествоБонусами = Перечисления.СпособыПредоставленияСкидокНаценок.КоличествоБонусныхБаллов;
	СпособПредоставленияПроцентБонусами = Перечисления.СпособыПредоставленияСкидокНаценок.ПроцентОтСуммыВВидеБонусныхБаллов;
	СпособПредоставленияСообщение = Перечисления.СпособыПредоставленияСкидокНаценок.Сообщение;
	СпособПредоставленияПодарок = Перечисления.СпособыПредоставленияСкидокНаценок.Подарок;
	СпособПредоставленияПромокод = Перечисления.СпособыПредоставленияСкидокНаценок.Промокод;
	СпособПредоставленияРасширение = Перечисления.СпособыПредоставленияСкидокНаценок.Расширение;
	ВариантОграниченияПоНоменклатуре = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре;
	ВариантОграниченияПоКатегориям = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоКатегориям;
	ВариантОграниченияПоЦеновымГруппам = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоЦеновымГруппам;
	ВариантОграниченияПоСегментамНоменклатуры = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоСегменту;
	ВариантОграниченияПоКонтрагентам = Перечисления.ВариантыОграниченийСкидокПоКонтрагентам.ПоКонтрагентам;
	ВариантОграниченияПоСегментамКонтрагентов = Перечисления.ВариантыОграниченийСкидокПоКонтрагентам.ПоСегментуКонтрагентов;
	ВариантОграниченияПоКонтрагентамДоИзменения = Объект.ВариантОграниченияПоПолучателям;
	ИспользоватьПриПродаже = НЕ Объект.ИспользоватьПриВозврате;
	ЭтоРучнаяСкидка = Объект.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.РучнаяСкидка;
	Объект.ЭтоПравилоНачисленияБонусов = ЗначениеЗаполнено(Объект.БонуснаяПрограмма);

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиУНФ.ЗаполнитьДополнительныеПараметры(Объект,
		"ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	НазначениеРозница = Перечисления.НазначенияАвтоматическихСкидок.Розница;
	НазначениеОпт = Перечисления.НазначенияАвтоматическихСкидок.Опт;
	НазначениеВезде = Перечисления.НазначенияАвтоматическихСкидок.Везде;
	ОбластьВДокументе = Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе;
	
	ИспользуютсяРозничныеПродажи = ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж");
	
	Элементы.Назначение.Видимость =
		ИспользуютсяРозничныеПродажи ИЛИ Объект.Назначение = НазначениеРозница;
	
	РазрешеноРедактированиеЦенДокументов = УправлениеДоступомУНФ.РазрешеноРедактированиеЦенДокументов();
	ТолькоПросмотр = НЕ РазрешеноРедактированиеЦенДокументов;
	Если ТолькоПросмотр Тогда
		Элементы.ИспользоватьПриПродаже.ТолькоПросмотр = Истина;
		Элементы.ПромокодыДобавить.Доступность = Ложь;
		Элементы.СоздатьНовыйДопРеквизит.Доступность = Ложь;		
	КонецЕсли;

	ЗаполнитьСписокВыбораСпособПредоставления();
	
	Для каждого ВариантНаименования Из Элементы.Наименование.СписокВыбора Цикл
		Если Объект.Наименование = ВариантНаименования.Значение Тогда
			ИспользуетсяАвтоНаименование = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Родитель.Пустая() Тогда
		ВариантСовместногоПрименения = Константы.ВариантыСовместногоПримененияСкидокНаценок.Получить();
	Иначе
		ВариантСовместногоПрименения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Родитель,
			"ВариантСовместногоПрименения");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"Родитель", "Подсказка", СтрШаблон(НСтр("ru = 'Совместное применение скидок: %1'",ВариантСовместногоПрименения)));
		
	ОбновитьПризнакиЭтоГруппа();
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	ОбновитьДоступностьТочекВыдачиСообщенийКассиру();
	
	ВариантОграниченияПоНоменклатуреДоИзменения = Объект.ВариантОграниченияПоНоменклатуре;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Родитель", "Видимость",
		Не Объект.ЭтоПравилоНачисленияБонусов);
	
	ИспользуютсяСегментыНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьСегментыНоменклатуры");
	
	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);
	
	РазделитьУсловияПоОбласти();	
	УправлениеВидимостьюНаСервере();
	УстановитьУсловноеОформлениеФормы();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Промокоды, 
		"СкидкаНаценка",
		Объект.Ссылка,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		РассылкиПромокодов, 
		"ПредлагаемаяСкидка",
		?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Null),
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	Настройки = Новый Структура;
	Настройки.Вставить("НаборПодарков");
	Настройки.Вставить("НоменклатураГруппыЦеновыеГруппы");
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(
		Метаданные.Справочники.АвтоматическиеСкидки.ТабличныеЧасти.НаборПодарков, 
		Настройки.НаборПодарков, ЭтотОбъект, Ложь);
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(
		Метаданные.Справочники.АвтоматическиеСкидки.ТабличныеЧасти.НоменклатураГруппыЦеновыеГруппы, 
		Настройки.НоменклатураГруппыЦеновыеГруппы, ЭтотОбъект, Ложь);
	НастройкиЗагрузкиДанных = Новый ФиксированнаяСтруктура(Настройки);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

	ТекстПодсказкиРаспределенияСтоимостиПодарка = ТекстПодсказкиОбластиПримененияСкидки(Объект.ОбластьПредоставления);
	Элементы.ОбластьПредоставления.Подсказка = ТекстПодсказкиРаспределенияСтоимостиПодарка;
	ДобавитьПодсказки();
	ДобавитьИВывестиБаннерРаспределенияСтоимостиПодарка();
	МенюРазделовЗаполнить();
    ЭтоНовый = НЕ ОбщегоНазначения.СсылкаСуществует(Объект.Ссылка);
	Если ЭтоНовый Тогда
		Объект.Действует = Истина;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультат;
	КонецЕсли;
	Недействителен = НЕ Объект.Действует;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	МенюРазделовТекущаяСтрокаУстановить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя);
	
	Если Объект.ПодарокИзКорзиныПокупателя = Истина И Объект.УчитыватьПодарокКакПродажу = Истина Тогда
		СхемаВыдачиПодарка = "ИзКорзины";
	ИначеЕсли Объект.ПодарокИзКорзиныПокупателя = Ложь И Объект.УчитыватьПодарокКакПродажу = Истина Тогда
		СхемаВыдачиПодарка = "НаКассеВЧек";
	ИначеЕсли Объект.ПодарокИзКорзиныПокупателя = Ложь И Объект.УчитыватьПодарокКакПродажу = Ложь Тогда
		СхемаВыдачиПодарка = "НаКассеСписать";
	Иначе
		// Настройки рассогласованы, подарок из корзины не может не учитываться как продажа
		Объект.УчитыватьПодарокКакПродажу = Истина;
		СхемаВыдачиПодарка = "ИзКорзины";
	КонецЕсли;
	ПредставлениеНастроекПодарков();
	ЗаполнитьПодсказкуОбластиПредоставления();
	ОбновитьОбщееКоличествоУсловий();
	НастроитьЭлементыФормы();
	ОбновитьДоступностьРазделов();
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьПризнакиЭтоГруппа();
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект, Истина,
		"НоменклатураГруппыЦеновыеГруппы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	Если ИмяСобытия = "УсловиеПредоставления_Запись" Тогда
		ОбновитьАвтонаименование(Истина, Истина);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Дата начала больше даты окончания.'");
		Сообщение.Поле = "Объект.ДатаНачала";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Модифицированность Тогда
		ОбновитьТЧУсловий();
	КонецЕсли;
	Объект.Действует = НЕ Недействителен;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Обработчик механизма "Свойства".
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);

	КоличествоУсловийЗаПромокод = 0;
	Для каждого ТекущееУсловие Из Объект.УсловияПредоставления Цикл
		
		УсловиеПредоставленияСкидки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ТекущееУсловие.УсловиеПредоставления, "УсловиеПредоставления");
		
		Если УсловиеПредоставленияСкидки = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаПромокод Тогда
			КоличествоУсловийЗаПромокод = КоличествоУсловийЗаПромокод + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоУсловийЗаПромокод > 1 Тогда
		Отказ = Истина;			
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Возможно использование только одного условия на предъявленный промокод.'");
		Сообщение.Поле = "Объект.УсловияПредоставления";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();		
	КонецЕсли;	 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПризнакиЭтоГруппа();
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Промокоды.Отбор, 
		"СкидкаНаценка",
		,
		Объект.Ссылка, 
		ВидСравненияКомпоновкиДанных.Равно, 
		Истина);
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(РассылкиПромокодов.Отбор, 
		"ПредлагаемаяСкидка",
		,
		Объект.Ссылка, 
		ВидСравненияКомпоновкиДанных.Равно, 
		Истина);
	ЭтоНовый = Ложь;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "Инструкция" Тогда
		Если Объект.Ссылка.Пустая() Тогда
			УстановитьИдентификаторДляРасчетаВРасширенииКлиент();
		КонецЕсли;
		ОткрытьИнструкциюРасширение();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "КонвертироватьНастройкуПодарка" Тогда
		КонвертироватьПодарокИзКорзиныНаКлиенте();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БонуснаяПрограммаПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораСпособПредоставления();
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ВариантОграниченияПоНоменклатуре.
//
&НаКлиенте
Процедура ВариантОграниченияПоНоменклатуреПриИзменении(Элемент)
	
	Если Объект.НоменклатураГруппыЦеновыеГруппы.Количество() > 0 Тогда
		Описание = Новый ОписаниеОповещения("ВариантОграниченияПоНоменклатуреПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Описание, НСтр("ru = 'Таблица уточнений будет очищена. Продолжить?'"), 
			РежимДиалогаВопрос.ДаНет,
			,
			КодВозвратаДиалога.Нет,
			НСтр("ru = 'Изменение варианта уточнения'"));
	Иначе
		ВариантОграниченияПоНоменклатуреДоИзменения = Объект.ВариантОграниченияПоНоменклатуре;
		УправлениеВидимостьюНаСервере();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента СпособПредоставления.
//
&НаКлиенте
Процедура СпособПредоставленияПриИзменении(Элемент)
	
	СпособПредоставленияПриИзмененииСервер();
	Объект.ЗначениеСкидкиНаценки = 0;
	
	ПоказатьСтраницуУточнений = Ложь;
	Для каждого ТекущаяСтрока Из Объект.НоменклатураГруппыЦеновыеГруппы Цикл
	
		ТекущаяСтрока.ЗначениеСкидкиНаценки = 0;
		ПоказатьСтраницуУточнений = Истина;
		
	КонецЦикла;
	
	Если ПоказатьСтраницуУточнений Тогда
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Уточнения;
		
		СуммаВДокументе = (Объект.СпособПредоставления = СпособПредоставленияСумма 
							И Объект.ОбластьПредоставления = ОбластьВДокументе);
							
		Если Не СуммаВДокументе Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Скидки очищены.'"));
		КонецЕсли;
		
	КонецЕсли;
	ЗаполнитьПодсказкуОбластиПредоставления();
	ОбновитьАвтонаименование(Истина);
	УстановитьДоступностьКратности();
	ОбновитьДоступностьРазделов();

КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ОбластьПредоставления.
//
&НаКлиенте
Процедура ОбластьПредоставленияПриИзменении(Элемент)
	
	ПриИзмененииОбластиПредставления();
	ОбновитьДоступностьРазделов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОкругленияПриИзменении(Элемент)
	
	ОбновитьАвтонаименование(Истина);

КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента Наименование.
//
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	НаименованиеИзмененоПользователем = Истина;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ЗначениеСкидкиНаценки.
//
&НаКлиенте
Процедура ЗначениеСкидкиНаценкиПриИзменении(Элемент)
	
	Если Объект.СпособПредоставления = СпособПредоставленияПроцент Тогда
		Если Объект.ЗначениеСкидкиНаценки > 100 Тогда
			ТекстСообщения = НСтр("ru = 'Процент скидки должен быть не более 100%'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, 
																,
																"ЗначениеСкидкиНаценки",
																"Объект");
			Объект.ЗначениеСкидкиНаценки = 0;
		КонецЕсли;
	КонецЕсли;
	ОбновитьАвтонаименование(Истина);

КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента Родитель.
//
&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	РодительПриИзмененииНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента Назначение.
//
&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	
	ОбновитьОбщееКоличествоУсловий();
	ОбновитьАвтонаименование(Истина);
	ОбновитьДоступностьТочекВыдачиСообщенийКассиру();
	ОбновитьДоступностьСкидокВозврат();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОграниченияПоКонтрагентамПриИзменении(Элемент)
	
	Если (Объект.ПолучателиСкидкиКонтрагенты.Количество() > 0 
		И Объект.ВариантОграниченияПоПолучателям = ВариантОграниченияПоСегментамКонтрагентов)
		ИЛИ (Объект.ПолучателиСкидкиСегменты.Количество()> 0 
		И Объект.ВариантОграниченияПоПолучателям = ВариантОграниченияПоКонтрагентам) Тогда
		
		Описание = Новый ОписаниеОповещения("ВариантПредоставленияСкидкиПоПолучателямПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Описание, НСтр("ru = 'Таблица уточнений будет очищена. Продолжить?'"), 
			РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,НСтр("ru = 'Изменение варианта уточнения'"));
	Иначе
		ВариантОграниченияПоКонтрагентамДоИзменения = Объект.ВариантОграниченияПоПолучателям;
		УправлениеВидимостьюНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	
	ОбновитьВалютуПредоставления();
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаВыдачиПодаркаПриИзменении(Элемент)
	
	ПриИзмененииСхемыВыдачиПодарка();
		
КонецПроцедуры

&НаКлиенте
Процедура КратноКоличествуПриИзменении(Элемент)
	//Если Объект.КратноКоличествуУсловий Тогда
		
	УстановитьДоступностьКратности();
КонецПроцедуры

&НаКлиенте
Процедура КомплектПодарковПриИзменении(Элемент)
	ПредставлениеНастроекПодарков();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПриПродажеПриИзменении(Элемент)
	Объект.ИспользоватьПриВозврате = Не ИспользоватьПриПродаже;
	Если Объект.ИспользоватьПриВозврате Тогда
		Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияАвтоматическихСкидок.Розница");
	КонецЕсли;
	Модифицированность = Истина;
	ИспользоватьПриПродажеПриИзмененииНаСервере();
	НастроитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЭтоОкруглениеОплатыПриИзменении(Элемент)
	Если НЕ Объект.ЭтоПравилоНачисленияБонусов Тогда
		Объект.БонуснаяПрограмма = ПредопределенноеЗначение("Справочник.БонусныеПрограммы.ПустаяСсылка");
	КонецЕсли;
	Элементы.БонуснаяПрограмма.Видимость = Объект.ЭтоПравилоНачисленияБонусов;
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьПодарокКакПродажуПриИзменении(Элемент)
	Элементы.СчетЗатратПодаркаСокращенный.Доступность = НЕ Объект.УчитыватьПодарокКакПродажу;
	Элементы.ОсновныеРеквизитыСкидка.Видимость = Объект.УчитыватьПодарокКакПродажу;
КонецПроцедуры

&НаКлиенте
Процедура ОбластьПредоставленияОкруглениеПриИзменении(Элемент)
	
	ПриИзмененииОбластиПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаВыдачиПодаркаНаКассеВЧекПриИзменении(Элемент)
	
	ПриИзмененииСхемыВыдачиПодарка();
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаВыдачиПодаркаНаКассеСписатьПриИзменении(Элемент)
	
	ПриИзмененииСхемыВыдачиПодарка();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетПриИзменении(Элемент)
	Объект.Действует = НЕ Недействителен;
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРежимКратностиПриИзменении(Элемент)
	УстановитьДоступностьКратности();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОбновитьОбщееКоличествоУсловий();
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ОбновитьОбщееКоличествоУсловий();
	ОбновитьАвтонаименование(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьВозможностьНажатие(Элемент)
	
	ТекстДляПисьма = НСтр("ru = 'Опишите, каких возможностей вам не хватает для ""Автоматические скидки (наценки)"":'");
	Тег = НСтр("ru = 'Автоматические скидки (наценки)'");
	
	УправлениеНебольшойФирмойКлиент.ПредложитьВозможностьНажатие(Тег, ТекстДляПисьма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКомментарий(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
	"Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");

КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	МенюРазделовТекущаяСтрокаУстановить(ТекущаяСтраница.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУсловияПредоставленияПоДокументу

// Процедура - обработчик события ПриИзменении элемента УсловияПредоставления формы.
//
&НаКлиенте
Процедура УсловияПредоставленияПоДокументуПриИзменении(Элемент)
	
	УсловияПредоставленияПриИзменении(Элемент);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУсловияПредоставленияСтрок

// Процедура - обработчик события ПриИзменении элемента УсловияПредоставления формы.
//
&НаКлиенте
Процедура УсловияПредоставленияСтрокПриИзменении(Элемент)
	
	УсловияПредоставленияПриИзменении(Элемент);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВремяПоДнямНедели

// Процедура - обработчик события ПриНачалеРедактирования ТЧ ВремяПоДнямНедели формы.
//
&НаКлиенте
Процедура ВремяПоДнямНеделиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Выбран = Истина;
		Элемент.ТекущиеДанные.ВремяНачала = '00010101000000';
		Элемент.ТекущиеДанные.ВремяОкончания = '00010101235959';
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении ТЧ ВремяПоДнямНедели формы.
//
&НаКлиенте
Процедура ВремяПоДнямНеделиПриИзменении(Элемент)
	
	ОбновитьОбщееКоличествоУсловий();
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолучателиСкидки

// Процедура - обработчик события ПриИзменении ТЧ ПолучателиСкидкиКонтрагенты формы.
//
&НаКлиенте
Процедура ПолучателиСкидкиПриИзменении(Элемент)
	
	ОбновитьОбщееКоличествоУсловий();
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолучателиСкидкиСегменты
&НаКлиенте
Процедура ПолучателиСкидкиСегментыПриИзменении(Элемент)
	ОбновитьОбщееКоличествоУсловий();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолучателиСкидкиСклады

// Процедура - обработчик события ПриИзменении ТЧ ПолучателиСкидкиСклады формы.
//
&НаКлиенте
Процедура ПолучателиСкидкиСкладыПриИзменении(Элемент)
	
	ОбновитьОбщееКоличествоУсловий();
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНоменклатураГруппыЦеновыеГруппы

// Процедура - обработчик события ПриИзменении колонки ЗначениеСкидки в ТЧ НоменклатураГруппыЦеновыеГруппы формы.
//
&НаКлиенте
Процедура НоменклатураГруппыЦеновыеГруппыЗначениеСкидкиНаценкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НоменклатураГруппыЦеновыеГруппы.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Если Объект.СпособПредоставления = СпособПредоставленияПроцент Тогда
			Если ТекущаяСтрока.ЗначениеСкидкиНаценки > 100 Тогда
				ТекстСообщения = НСтр("ru = 'Процент скидки должен быть не более 100%'");
				//@skip-check bsl-legacy-check-dynamic-feature-access
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,
					"НоменклатураГруппыЦеновыеГруппы["+(ТекущаяСтрока.НомерСтроки-1)+"].ЗначениеСкидкиНаценки",
					"Объект");
				ТекущаяСтрока.ЗначениеСкидкиНаценки = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураГруппыЦеновыеГруппыПриИзменении(Элемент)
	
	ОбновитьОбщееКоличествоУсловий();
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНаборПодарков

&НаКлиенте
Процедура НаборПодарковПослеУдаления(Элемент)
	
	Если Объект.НаборПодарков.Количество() <= 1 Тогда
		Объект.ЛюбойПодарокИзСписка = Ложь;
	КонецЕсли;
	ПредставлениеНастроекПодарков();
	
КонецПроцедуры

&НаКлиенте
Процедура НаборПодарковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования) 
	
	ПредставлениеНастроекПодарков(); 
	
КонецПроцедуры

&НаКлиенте
Процедура НаборПодарковПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТабличнойЧасти = Элемент.ТекущиеДанные;	
	Если НоваяСтрока И НЕ Копирование Тогда
		СтрокаТабличнойЧасти.Количество = НовоеКоличествоПриИзмененииНоменклатуры;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборПодарковНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.НаборПодарков.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьСбросКоличества И СбрасыватьКоличество
		И СтрокаТабличнойЧасти.Количество <> НовоеКоличествоПриИзмененииНоменклатуры Тогда
		
		ДопПараметр = Новый Структура();
		ДопПараметр.Вставить("Элемент", Элемент);
		ДопПараметр.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		Оповещение = Новый ОписаниеОповещения("НаборПодарковПодтверждениеСбросаКоличестваЗавершение",
			ЭтотОбъект, ДопПараметр);
		ОткрытьФорму("ОбщаяФорма.ПодтверждениеСбросаКоличества", , , , , , Оповещение);
		
	Иначе
		
		Если СбрасыватьКоличество Тогда
			НовоеКоличество = НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		НаборПодарковНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМенюРазделов

&НаКлиенте
Процедура МенюРазделовПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания( "МенюРазделовПриАктивизацииСтрокиСтраницаПереключить", 0.1, Истина );
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Открывает форму создания доп. реквизита.
//
&НаКлиенте
Процедура СоздатьНовыйДопРеквизит(Команда)
	
	ПараметрыФормы = ПараметрыСозданияДопРеквизита();
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта",
		ПараметрыФормы, , , , , , РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПромокоды(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Для добавления промокодов, скидку (наценку) требуется записать.'");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	Иначе
		ОткрытьФормуГенерацииПромокодов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобавитьГруппуНоменклатурыКатегорийЗавершение", ЭтотОбъект);
	Если Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоНоменклатуре Тогда
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы", , ЭтотОбъект, , , , ОповещениеОЗакрытии);
	ИначеЕсли Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоКатегориям Тогда
		ПараметрыОткрытия = Новый Структура("");
		ОткрытьФорму("Справочник.КатегорииНоменклатуры.ФормаВыбораГруппы", ПараметрыОткрытия, ЭтотОбъект, , , ,
			ОповещениеОЗакрытии);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуКонтрагентов(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобавитьГруппуКонтрагентовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбораГруппы", , ЭтотОбъект, , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПодарков(Команда)
	
	ИмяТабличнойЧасти = "НаборПодарков";
	ПараметрыПодбора = Новый Структура("ТолькоНоменклатураИКоличество", Истина);
	ДополнительныеПараметры = Новый Структура("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ОбработчикПодбора = Новый ОписаниеОповещения("ОбработкаПодбораНоменклатуры", ЭтотОбъект,
		ДополнительныеПараметры);
	ПодборНоменклатурыВДокументахКлиент.ОткрытьФормуПодбораНоменклатуры(ЭтотОбъект, ИмяТабличнойЧасти,
		ПараметрыПодбора, ОбработчикПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборУточнений(Команда)
	
	ИмяТабличнойЧасти = "НоменклатураГруппыЦеновыеГруппы";
	ПараметрыПодбора = Новый Структура("ТолькоНоменклатура", Истина);
	ДополнительныеПараметры = Новый Структура("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ОбработчикПодбора = Новый ОписаниеОповещения("ОбработкаПодбораНоменклатуры",
		ЭтотОбъект, ДополнительныеПараметры);
	ПодборНоменклатурыВДокументахКлиент.ОткрытьФормуПодбораНоменклатуры(ЭтотОбъект, ИмяТабличнойЧасти,
		ПараметрыПодбора, ОбработчикПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСбросаКоличества(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтрокаПоиска", НСтр("ru='Сбрасывать количество при изменении номенклатуры'"));
	Оповещение = Новый ОписаниеОповещения("НастройкаСбросаКоличестваЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПерсональныеНастройки.Форма.ФормаНастройкиПользователя", СтруктураПараметров, , , , ,
		Оповещение);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, 
		Элементы.ЗапасыКонтекстноеМенюНастройкаСбросаКоличества, "Нажатие");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРассылку(Команда)
	СоздатьМассовуюРассылку();
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьРассылкуСервиса(Команда)
	СоздатьМассовуюРассылку(Истина);
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьРассылкуВыделенныхПромокодов(Команда)
	СоздатьМассовуюРассылкуВыделенныхПромокодов();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРассылкуВыделенныхПромокодовСервис(Команда)
	СоздатьМассовуюРассылкуВыделенныхПромокодов(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзВнешнегоИсточникаНаборПодарков(Команда)
	
	ТекущаяНастройкаЗагрузкиДанных = НастройкиЗагрузкиДанных.НаборПодарков;
	ТекущаяНастройкаЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения =
		"Справочник.АвтоматическиеСкидки.ТабличнаяЧасть.НаборПодарков";
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата",
		ЭтотОбъект, ТекущаяНастройкаЗагрузкиДанных);

	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(
		ТекущаяНастройкаЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзВнешнегоИсточникаНоменклатураГруппыЦеновыеГруппы(Команда)
	
	ТекущаяНастройкаЗагрузкиДанных = НастройкиЗагрузкиДанных.НоменклатураГруппыЦеновыеГруппы;
	ТекущаяНастройкаЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения =
		"Справочник.АвтоматическиеСкидки.ТабличнаяЧасть.НоменклатураГруппыЦеновыеГруппы";
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата",
		ЭтотОбъект, ТекущаяНастройкаЗагрузкиДанных);

	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(
		ТекущаяНастройкаЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
		
КонецПроцедуры


&НаКлиенте
Процедура КонвертироватьПодарокИзКорзины(Команда)
	
	КонвертироватьПодарокИзКорзиныНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьКомментарий(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект,
	"Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПодаркам(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПодарок;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииСхемыВыдачиПодарка()
	
	Если СхемаВыдачиПодарка = "ИзКорзины" Тогда
		Объект.ПодарокИзКорзиныПокупателя = Истина;
		Объект.УчитыватьПодарокКакПродажу = Истина;
	ИначеЕсли СхемаВыдачиПодарка = "НаКассеВЧек" Тогда
		Объект.ПодарокИзКорзиныПокупателя = Ложь;
		Объект.УчитыватьПодарокКакПродажу = Истина;
	ИначеЕсли СхемаВыдачиПодарка = "НаКассеСписать" Тогда
		Объект.ПодарокИзКорзиныПокупателя = Ложь;
		Объект.УчитыватьПодарокКакПродажу = Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.СчетЗатратПодарка) Тогда
		Объект.СчетЗатратПодарка = ПредопределенноеЗначение("ПланСчетов.Управленческий.КоммерческиеРасходы");
	КонецЕсли;
	ПредставлениеНастроекПодарков();
	ОбновитьАвтонаименование(Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОбластиПредставления()
	
	УправлениеВидимостьюНаСервере();
	ЗаполнитьПодсказкуОбластиПредоставления();
	ОбновитьАвтонаименование(Истина);
	ПредставлениеНастроекПодарков();
	УстановитьДоступностьКратности();
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМассовуюРассылку(РассылкаСервиса = Ложь)

	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("СпособОтправки", ПредопределенноеЗначение("Перечисление.ВидыКаналовСвязи.Email"));
	ПараметрыРассылки.Вставить("ПредлагаемаяСкидка", Объект.Ссылка);
	ИмяФормыРассылки = "Документ.МассоваяРассылка.Форма.ФормаДокумента";
	Если РассылкаСервиса Тогда
		ИмяФормыРассылки = "Документ.МассоваяРассылка.Форма.РассылкаСервиса";
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормыРассылки, ПараметрыРассылки);
	 
КонецПроцедуры

&НаСервере
Процедура ОбновитьВалютуПредоставления()
	
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		Объект.ВалютаПредоставления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидЦен, "ВалютаЦены");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СпособПредоставленияПриИзмененииСервер()
	
	ЭтоПравилоНачисленияБонусов =
		Объект.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.КоличествоБонусныхБаллов
		ИЛИ Объект.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ПроцентОтСуммыВВидеБонусныхБаллов;
	
	Объект.ЭтоПравилоНачисленияБонусов = ЭтоПравилоНачисленияБонусов;
	Если НЕ ЭтоПравилоНачисленияБонусов Тогда
		Объект.БонуснаяПрограмма = Справочники.БонусныеПрограммы.ПустаяСсылка();
	КонецЕсли;
	
	ПроверитьНаличиеУсловийНаВидОплаты();
	УправлениеВидимостьюНаСервере();
	
	Если Объект.СпособПредоставления = СпособПредоставленияРасширение Тогда
		УстановитьИдентификаторДляРасчетаВРасширении();		
	КонецЕсли;
	
	Элементы.ИдентификаторДляРасчетаВРасширении.Видимость =
		Объект.СпособПредоставления = СпособПредоставленияРасширение;
	
	ОбновитьВалютуПредоставления();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбщееКоличествоУсловий()
	КоличествоПокупатели = 0;
	Если Объект.ВариантОграниченияПоПолучателям = ПредопределенноеЗначение("Перечисление.ВариантыОграниченийСкидокПоКонтрагентам.ПоКонтрагентам") Тогда
		КоличествоПокупатели = КоличествоПокупатели + Объект.ПолучателиСкидкиКонтрагенты.Количество();
	Иначе
		КоличествоПокупатели = КоличествоПокупатели + Объект.ПолучателиСкидкиСегменты.Количество();
	КонецЕсли;
	КоличествоУсловийПокупатели = КоличествоПокупатели;
	КоличествоУсловийСклады = Объект.ПолучателиСкидкиСклады.Количество();
	КоличествоУсловийПоДокументу = УсловияПредоставленияПоДокументу.Количество();
	КоличествоУсловийПоСтроке = УсловияПредоставленияВСтроке.Количество();
	КоличествоУсловийВсего = КоличествоУсловийПоДокументу + 
		КоличествоУсловийПоСтроке;
		
	КоличествоНастроекДат = 0;
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) ИЛИ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		КоличествоНастроекДат = КоличествоНастроекДат + 1;
	КонецЕсли;
	Если НЕ Объект.Назначение = НазначениеВезде Тогда
		КоличествоНастроекДат = КоличествоНастроекДат + 1;
	КонецЕсли;
	КоличествоНастроекДат = КоличествоНастроекДат + Объект.ВремяПоДнямНедели.Количество();
	Для Каждого СтрокаМеню Из ВсеРазделыМеню() Цикл
		Если СтрокаМеню.ИмяСтраницы = "ГруппаОписаниеДействия" Тогда
			СтрокаМеню.КоличествоНастроек = Мин(10, КоличествоНастроекДат);
		ИначеЕсли СтрокаМеню.ИмяСтраницы = "Уточнения" Тогда
			СтрокаМеню.КоличествоНастроек = Мин(10, Объект.НоменклатураГруппыЦеновыеГруппы.Количество());
		ИначеЕсли СтрокаМеню.ИмяСтраницы = "ГруппаСклады" Тогда
			СтрокаМеню.КоличествоНастроек = Мин(10, КоличествоУсловийСклады);
		ИначеЕсли СтрокаМеню.ИмяСтраницы = "ГруппаКонтрагенты" Тогда
			СтрокаМеню.КоличествоНастроек = Мин(10, КоличествоУсловийПокупатели);
		ИначеЕсли СтрокаМеню.ИмяСтраницы = "ГруппаПодарок" Тогда
			СтрокаМеню.КоличествоНастроек = Мин(10, Объект.НаборПодарков.Количество());
		ИначеЕсли СтрокаМеню.ИмяСтраницы = "ГруппаУсловияПредоставления" Тогда
			СтрокаМеню.КоличествоНастроек = Мин(10, КоличествоУсловийВсего);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ВсеРазделыМеню(СтрокаРаздела = Неопределено)
	Результат = Новый Массив;
	ИсследуемаяСтрока = МенюРазделов;
	Если НЕ СтрокаРаздела = Неопределено Тогда
		ИсследуемаяСтрока = СтрокаРаздела;
	КонецЕсли;
	Для Каждого ПодчиненнаяСтрока Из ИсследуемаяСтрока.ПолучитьЭлементы() Цикл
		Результат.Добавить(ПодчиненнаяСтрока);
		РезультатВложенный = ВсеРазделыМеню(ПодчиненнаяСтрока);
		Для Каждого Вложеннаястрока Из РезультатВложенный Цикл
			Результат.Добавить(Вложеннаястрока);
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОбновитьДоступностьСкидокВозврат()
	
	ТолькоПродажа = СкидкаДоступнаТолькоПриПродаже(Объект.Назначение, Объект.СпособПредоставления);
	
	Элементы.ИспользоватьПриПродаже.Доступность = Не ТолькоПродажа;
	
	Если Объект.ИспользоватьПриВозврате И ТолькоПродажа Тогда
		Объект.ИспользоватьПриВозврате = Ложь;
		ИспользоватьПриПродаже = НЕ Объект.ИспользоватьПриВозврате;
		ИспользоватьПриПродажеПриИзмененииНаСервере();
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура РодительПриИзмененииНаСервере()
	
	ВариантСовместногоПрименения = ПолучитьТекущийВариантСовместногоПрименения(Объект.Родитель);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"Родитель", "Подсказка", СтрШаблон(НСтр("ru = 'Совместное применение скидок: %1'",ВариантСовместногоПрименения)));
	
КонецПроцедуры

// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
// Возвращаемое значение:
//  - Структура - Значения зависимых от номенклатуры полей строки
&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	// Наборы
	Если НЕ СтруктураДанные.Свойство("ЕдиницаИзмерения") Тогда
		ЕдИзмНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанные.Номенклатура,
			"ЕдиницаИзмерения");
		СтруктураДанные.Вставить("ЕдиницаИзмерения", ЕдИзмНоменклатуры);
	КонецЕсли;
	 
	Если НЕ СтруктураДанные.Свойство("Коэффициент") Тогда
		Если ТипЗнч(СтруктураДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			ИмяРеквизита = "Коэффициент";
			КоэффициентЕдИзм = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанные.ЕдиницаИзмерения,
				ИмяРеквизита);
			СтруктураДанные.Вставить("Коэффициент", КоэффициентЕдИзм);
		Иначе
			СтруктураДанные.Вставить("Коэффициент", 1);
		КонецЕсли; 
	КонецЕсли;
	// Конец Наборы
	
	// Характеристики
	СтруктураДанные.Вставить("ИспользоватьХарактеристики", Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики", Ложь);
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанные.Номенклатура,
		"ИспользоватьХарактеристики, ПроверятьЗаполнениеХарактеристики");
		
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура)
		И РеквизитыНоменклатуры.ИспользоватьХарактеристики Тогда
			
		ЗначенияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура);
		
		Если Не ЗначенияПоУмолчанию = Неопределено
			Тогда
			ХарактеристикаПоУмолчанию = ЗначенияПоУмолчанию;
		КонецЕсли;
		
		Если НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика",ХарактеристикаПоУмолчанию);
		Иначе
			СтруктураДанные.Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика), СтруктураДанные.Характеристика, ХарактеристикаПоУмолчанию);
		КонецЕсли;
		
		СтруктураДанные.Вставить("ИспользоватьХарактеристики", Истина);
		СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",
			РеквизитыНоменклатуры.ПроверятьЗаполнениеХарактеристики);
			
	КонецЕсли;
	// Конец Характеристики
	
	Возврат СтруктураДанные;
		
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаКлиенте
Процедура НастройкаСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура")
		И Результат.Свойство("АдресКорзиныВХранилище")
		И ЗначениеЗаполнено(Результат.АдресКорзиныВХранилище) Тогда
		ИмяТабличнойЧасти = "НаборПодарков";
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
			И ДополнительныеПараметры.Свойство("ИмяТабличнойЧасти") Тогда
			ИмяТабличнойЧасти = ДополнительныеПараметры.ИмяТабличнойЧасти;
		КонецЕсли;
		ПолучитьНоменклатуруИзХранилища(Результат.АдресКорзиныВХранилище, ИмяТабличнойЧасти);		
		ПредставлениеНастроекПодарков();
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ВариантОграниченияПоНоменклатуре (завершение после ответа на вопрос об удалении строк в ТЧ).
// 
// Параметры:
//  РезультатОтвета - КодВозвратаДиалога, Неопределено -  Результат ответа
//  ДополнительныеПараметры - Структура - Дополнительные параметры
&НаКлиенте
Процедура ВариантОграниченияПоНоменклатуреПриИзмененииЗавершение(РезультатОтвета, ДополнительныеПараметры) Экспорт

	Если РезультатОтвета <> КодВозвратаДиалога.Да Тогда
		Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоНоменклатуреДоИзменения;
		Возврат;
	КонецЕсли;
	
	ВариантОграниченияПоНоменклатуреДоИзменения = Объект.ВариантОграниченияПоНоменклатуре;
	УправлениеВидимостьюНаСервере();
	Объект.НоменклатураГруппыЦеновыеГруппы.Очистить();
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Функция получает список товаров из временного хранилища
//
// Параметры:
//  АдресПодарковВХранилище - Строка - строка, содержащая электронные адреса
//  ИмяТабличнойЧасти - Строка - Имя табличной части, в которую необходимо поместить подарки
&НаСервере
Процедура ПолучитьНоменклатуруИзХранилища(АдресПодарковВХранилище, ИмяТабличнойЧасти)	
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресПодарковВХранилище);
	
	НоваяСтрока = Неопределено;
	
	Если ИмяТабличнойЧасти = "НоменклатураГруппыЦеновыеГруппы" Тогда
		ТаблицаДляЗагрузки.Колонки.Номенклатура.Имя = "ЗначениеУточнения";
	КонецЕсли;
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		
		Если ИмяТабличнойЧасти = "НаборПодарков"
			И ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда

			ОбработатьДобавлениеСтрокиЗапасов(НоваяСтрока, ИмяТабличнойЧасти);
			
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры // ПолучитьЗапасыИзХранилища()	

&НаСервере
Процедура ОбработатьДобавлениеСтрокиЗапасов(НоваяСтрока, ИмяТабличнойЧасти = "Подарки")
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.Номенклатура, 
		"ТипНоменклатуры, Вес, Объем, ЭтоНабор, СпособРасчетаЦеныНабора");
	
	СтруктураДанныеНоменклатуры = Новый Структура();
	СтруктураДанныеНоменклатуры.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
	СтруктураДанныеНоменклатуры.Вставить("Характеристика", НоваяСтрока.Характеристика);

	СтруктураДанныеНоменклатуры.Вставить("ТипНоменклатуры", ЗначенияРеквизитов.ТипНоменклатуры);
	СтруктураДанныеНоменклатуры.Вставить("ЕдиницаИзмерения", НоваяСтрока.ЕдиницаИзмерения);
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры);
		
	// Характеристики
	НоваяСтрока.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
	НоваяСтрока.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
	НоваяСтрока.ЗаполнениеХарактеристикиПроверено = Истина;
	
	Если СтруктураДанные.ИспользоватьХарактеристики
		Тогда
		НоваяСтрока.Характеристика = СтруктураДанные.Характеристика;
	КонецЕсли;
	// Конец Характеристики
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.НоменклатураГруппыЦеновыеГруппы.ЭтоГруппа", Истина, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "НоменклатураГруппыЦеновыеГруппыХарактеристика");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = '<Не используется>'"));
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр", Истина);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Серый);

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "МенюРазделов.ДоступностьРаздела", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "МенюРазделовНаименование");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "МенюРазделовВтораяКартинкаСтроки");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "МенюРазделовИмяСтраницы");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "МенюРазделов");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Серый);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "МенюРазделов.СкрытьСтроку", Истина, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "МенюРазделовНаименование");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "МенюРазделовВтораяКартинкаСтроки");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "МенюРазделовИмяСтраницы");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "МенюРазделов");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();		
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Промокоды.Конечный", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	ГруппаДат = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ГруппаДатаНачала = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(ГруппаДат, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаНачала, "Промокоды.ДействуетС", ТекущаяДата, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаНачала, "Промокоды.ДействуетС", ТекущаяДата, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ГруппаДатаОкончания = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(ГруппаДат, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаОкончания, "Промокоды.ДействуетДо", ТекущаяДата, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаОкончания, "Промокоды.ДействуетДо", ТекущаяДата, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ПромокодыДоступно");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = 'Без ограничений'"));
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();	
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Промокоды.Конечный", Истина, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Промокоды.Применений", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Промокоды.Доступно", 1, ВидСравненияКомпоновкиДанных.Равно);
	ГруппаДат = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ГруппаДатаНачала = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаНачала, "Промокоды.ДействуетС", ТекущаяДата, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаНачала, "Промокоды.ДействуетС", ТекущаяДата, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ГруппаДатаОкончания = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаОкончания, "Промокоды.ДействуетДо", ТекущаяДата, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаОкончания, "Промокоды.ДействуетДо", ТекущаяДата, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ПромокодыДоступно");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = 'Однократный'"));

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Промокоды.Конечный", Истина, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Промокоды.Применений", 0, ВидСравненияКомпоновкиДанных.Больше);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Промокоды.Доступно", 0, ВидСравненияКомпоновкиДанных.Равно);
	ГруппаДат = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ГруппаДатаНачала = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаНачала, "Промокоды.ДействуетС", ТекущаяДата, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаНачала, "Промокоды.ДействуетС", ТекущаяДата, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ГруппаДатаОкончания = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаОкончания, "Промокоды.ДействуетДо", ТекущаяДата, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаДатаОкончания, "Промокоды.ДействуетДо", ТекущаяДата, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ПромокодыДоступно");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = 'Погашен'"));

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ПромокодыДоступно");
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Промокоды.ДействуетС", ТекущаяДата, ВидСравненияКомпоновкиДанных.Больше);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Промокоды.ДействуетС", ТекущаяДата, ВидСравненияКомпоновкиДанных.Заполнено);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = 'Еще не активен'"));

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Промокоды.ДействуетДо", ТекущаяДата, ВидСравненияКомпоновкиДанных.Меньше);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Промокоды.ДействуетДо", ТекущаяДата, ВидСравненияКомпоновкиДанных.Заполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ПромокодыДоступно");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = 'Истек'"));
	
КонецПроцедуры

// Заполнить список выбора способ предоставления.
&НаСервере
Процедура ЗаполнитьСписокВыбораСпособПредоставления()
	Элементы.СпособПредоставления.СписокВыбора.Очистить();
	НовыйСписокВыбора = СписокВыбораСпособПредоставления();
	Для Каждого НовоеЗначениеСписка Из НовыйСписокВыбора Цикл
		Элементы.СпособПредоставления.СписокВыбора.Добавить(НовоеЗначениеСписка.Значение, 
			НовоеЗначениеСписка.Представление, 
			НовоеЗначениеСписка.Пометка, 
			НовоеЗначениеСписка.Картинка)
	КонецЦикла;

	Если НовыйСписокВыбора.НайтиПоЗначению(Объект.СпособПредоставления) = Неопределено Тогда
		Если ЗначениеЗаполнено(Объект.БонуснаяПрограмма) 
			И НЕ ЗначениеЗаполнено(Объект.СпособПредоставления) Тогда
			Объект.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.ПроцентОтСуммыВВидеБонусныхБаллов");
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СпособПредоставления) 
			И НЕ ЗначениеЗаполнено(Объект.БонуснаяПрограмма)
			И НовыйСписокВыбора.НайтиПоЗначению(СпособПредоставленияПроцент) <> Неопределено Тогда
			Объект.СпособПредоставления = СпособПредоставленияПроцент;
		Иначе
			Объект.СпособПредоставления = НовыйСписокВыбора[0].Значение;
		КонецЕсли;
		СпособПредоставленияПриИзмененииСервер();
	КонецЕсли;
КонецПроцедуры

// Список выбора способ предоставления.
// 
// Возвращаемое значение:
//  СписокЗначений из ПеречислениеСсылка.СпособыПредоставленияСкидокНаценок, Неопределено - Список выбора способ предоставления
&НаСервере
Функция СписокВыбораСпособПредоставления()
	Результат = Новый СписокЗначений;
	СкидкиНаценкиСерверПереопределяемый.ОбъединенныйСписокСкидокИБонусов(Результат, Объект.ИспользоватьПриВозврате, ЭтоРучнаяСкидка);
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкиИзмененияКоличества()
	
	НастройкиКоличества = ДокументыУНФКлиентСервер.ПараметрыСбросаКоличества();
	ДокументыУНФ.ЗаполнитьНастройкиКоличества(НастройкиКоличества);
	Возврат НастройкиКоличества;
	
КонецФункции

&НаСервереБезКонтекста
Функция УсловияСодержатТребованияПромокода(УсловияПредоставленияНаФорме)
	МассивУсловий = УсловияПредоставленияНаФорме.ВыгрузитьКолонку("УсловиеПредоставления");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияПредоставленияСкидокНаценок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УсловияПредоставленияСкидокНаценок КАК УсловияПредоставленияСкидокНаценок
	|ГДЕ
	|	УсловияПредоставленияСкидокНаценок.Ссылка В(&Условия)
	|	И УсловияПредоставленияСкидокНаценок.УсловиеПредоставления = Значение(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаПромокод)";
	Запрос.УстановитьПараметр("Условия", МассивУсловий);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// СтандартныеПодсистемы.Свойства
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_РедактироватьСоставСвойств()

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
		
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
		
КонецПроцедуры

&НаСервере
Функция ПараметрыСозданияДопРеквизита()
	
	ПараметрыФормы = Новый Структура;

	ТекущийНаборСвойств = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_АвтоматическиеСкидки");
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", ТекущийНаборСвойств);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	
	Возврат ПараметрыФормы;
	
КонецФункции

// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура УстановитьИдентификаторДляРасчетаВРасширенииКлиент()

	Если Не ЗначениеЗаполнено(Объект.ИдентификаторДляРасчетаВРасширении) Тогда

		АдаптированныйИдентификатор = СтрЗаменить(Новый УникальныйИдентификатор, "-", "_");
		Объект.ИдентификаторДляРасчетаВРасширении = АдаптированныйИдентификатор;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если ДополнительныеПараметры.Свойство("ПолноеИмяОбъектаЗаполнения") Тогда 
			ПолноеИмяОбъектаЗаполнения = ДополнительныеПараметры.ПолноеИмяОбъектаЗаполнения;
		Иначе    
			ПолноеИмяОбъектаЗаполнения = РезультатЗагрузки.НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
		КонецЕсли;
				
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(
				НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата",
				ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(
				НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			Если ПолноеИмяОбъектаЗаполнения = "Справочник.АвтоматическиеСкидки.ТабличнаяЧасть.НаборПодарков" Тогда
				
				ДлительнаяОперация = ОбработатьПодготовленныеДанныеНоменклатуры(РезультатЗагрузки);
				
				СтруктураПараметров = Новый Структура;
				Если РезультатЗагрузки.НастройкиЗагрузкиДанных.Свойство("ТекстОшибки") Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗагрузки.НастройкиЗагрузкиДанных.ТекстОшибки);
				КонецЕсли;
				
				ПроверитьНеобходимостьПодключенияОбработчикаОжиданияОбработкиНоменклатуры(ДлительнаяОперация, СтруктураПараметров);
			
			ИначеЕсли ПолноеИмяОбъектаЗаполнения = "Справочник.АвтоматическиеСкидки.ТабличнаяЧасть.НоменклатураГруппыЦеновыеГруппы" Тогда
				
				ДлительнаяОперация = ОбработатьПодготовленныеДанныеНоменклатуры(РезультатЗагрузки);
				
				СтруктураПараметров = Новый Структура;
				Если РезультатЗагрузки.НастройкиЗагрузкиДанных.Свойство("ТекстОшибки") Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗагрузки.НастройкиЗагрузкиДанных.ТекстОшибки);
				КонецЕсли;
				
				ПроверитьНеобходимостьПодключенияОбработчикаОжиданияОбработкиНоменклатуры(ДлительнаяОперация, СтруктураПараметров);
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНеобходимостьПодключенияОбработчикаОжиданияОбработкиНоменклатуры(ДлительнаяОперация, СтруктураПараметров = Неопределено)
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПослеВыполненияФоновогоЗаданияОбработкиНоменклатуры(ДлительнаяОперация, СтруктураПараметров);
		
	Иначе
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеВыполненияФоновогоЗаданияОбработкиНоменклатуры", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Идет загрузка данных.'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияФоновогоЗаданияОбработкиНоменклатуры(Прогресс, ДополнительныеПараметры) Экспорт
	
	Если НЕ Прогресс = Неопределено Тогда
		ОбработатьПодготовленныеДанныеОтборПродажПоНоменклатуре(Прогресс.АдресРезультата);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанныеОтборПродажПоНоменклатуре(АдресРезультатаЗагрузки)
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресРезультатаЗагрузки);
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Если РезультатЗагрузки.НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения =
			"Справочник.АвтоматическиеСкидки.ТабличнаяЧасть.НаборПодарков" Тогда
			Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
				ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
				Если ЗагрузкаВПриложениеВозможна Тогда
					НоваяСтрока = Объект.НаборПодарков.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли РезультатЗагрузки.НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения =
			"Справочник.АвтоматическиеСкидки.ТабличнаяЧасть.НоменклатураГруппыЦеновыеГруппы" Тогда
			Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
				ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
				Если ЗагрузкаВПриложениеВозможна Тогда
					НоваяСтрока = Объект.НоменклатураГруппыЦеновыеГруппы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					НоваяСтрока.ЗначениеУточнения = СтрокаТаблицы.Номенклатура;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ЗаписатьОшибкуВЖурналРегистрации(ИнформацияОбОшибке, НСтр("ru = 'Отбор продаж по номенклатуре'"));
		
	КонецПопытки;
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьПодготовленныеДанныеНоменклатуры(РезультатЗагрузки)
	
	ПараметрыВызоваСервера = Новый Структура;
	ПараметрыВызоваСервера.Вставить("НастройкиЗагрузкиДанных", РезультатЗагрузки.НастройкиЗагрузкиДанных);
	ПараметрыВызоваСервера.Вставить("ТаблицаСопоставленияДанных", ДанныеФормыВЗначение(РезультатЗагрузки.ТаблицаСопоставленияДанных, Тип("ТаблицаЗначений")));
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Подсистема ЗагрузкаДанныхИзВнешнегоИсточника: Выполнение серверного метода загрузки результата'");
	ПараметрыВыполнения.ЗапуститьНеВФоне    = Ложь;
	ПараметрыВыполнения.ЗапуститьВФоне      = Истина;	
	
	ИмяМетода = "Справочники.Номенклатура.ОбработатьПодготовленныеДанные";
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыВызоваСервера, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Процедура ЗаписатьОшибкуВЖурналРегистрации(ИнформацияОбОшибке, КонтекстОшибки)

	ИмяСобытия = НСтр("ru='Загрузка данных'", ОбщегоНазначения.КодОсновногоЯзыка());

	ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	Комментарий = СтрШаблон("%1%2%3", КонтекстОшибки, Символы.ПС, ПодробноеПредставлениеОшибки);

	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ВводНачальныхОстатков,
		, Комментарий);

КонецПроцедуры

&НаСервере
Процедура УстановитьИдентификаторДляРасчетаВРасширении()

	Если Не ЗначениеЗаполнено(Объект.ИдентификаторДляРасчетаВРасширении) Тогда

		АдаптированныйИдентификатор = СтрЗаменить(Новый УникальныйИдентификатор, "-", "_");
		Объект.ИдентификаторДляРасчетаВРасширении = АдаптированныйИдентификатор;

	КонецЕсли;

КонецПроцедуры

#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Процедура ВариантПредоставленияСкидкиПоПолучателямПриИзмененииЗавершение(РезультатОтвета, ДополнительныеПараметры) Экспорт

	Если РезультатОтвета <> КодВозвратаДиалога.Да Тогда
		Объект.ВариантОграниченияПоПолучателям = ВариантОграниченияПоКонтрагентамДоИзменения;
		Возврат;
	КонецЕсли;
	
	ВариантОграниченияПоКонтрагентамДоИзменения = Объект.ВариантОграниченияПоПолучателям;
	
	УправлениеВидимостьюНаСервере();
	
	Если ВариантОграниченияПоКонтрагентамДоИзменения = ВариантОграниченияПоКонтрагентам Тогда
		Объект.ПолучателиСкидкиСегменты.Очистить();
	Иначе
		Объект.ПолучателиСкидкиКонтрагенты.Очистить();
	КонецЕсли;
		
КонецПроцедуры

// Процедура обновляет наименование, если пользователь не менял его вручную.
//
&НаКлиенте
Процедура ОбновитьАвтонаименование(Обновить = Истина, УстановитьМодифицированность = Ложь)
	
	НаименованиеПоШаблону = СформироватьАвтоНаименованиеНаКлиенте();
	Если Не ЗначениеЗаполнено(Объект.Наименование) ИЛИ (Обновить И ИспользуетсяАвтоНаименование И Не НаименованиеИзмененоПользователем) Тогда
		Объект.Наименование = НаименованиеПоШаблону;
		ИспользуетсяАвтоНаименование = Истина;
		
		Если УстановитьМодифицированность Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает сформированное автонаименование.
//
&НаКлиенте
Функция СформироватьАвтоНаименованиеНаКлиенте()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = "";
	
	ОбновитьПредставлениеОбластьДействия(Ложь);
	ОбновитьПредставлениеПреимущества();
	ОбновитьПредставлениеУсловий();
	
	Элементы.Наименование.СписокВыбора.Добавить(ПредставлениеПреимущества());
	Элементы.Наименование.СписокВыбора.Добавить(СтрШаблон("%1: %2", ПредставлениеПреимущества(), НРег(ПредставлениеОбластиДействия(Ложь))));
	Элементы.Наименование.СписокВыбора.Добавить(СтрШаблон("%1 %2", ПредставлениеПреимущества(), НРег(ПредставлениеУсловий())));
	СтрокаНаименования = СтрШаблон("%1: %2",ПредставлениеПреимущества(), НРег(ПредставлениеОбластиДействия(Истина)));
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	Возврат СтрокаНаименования;
                                           
КонецФункции

&НаКлиенте
Процедура ОбновитьПредставлениеОбластьДействия(ВключатьУсловия = Истина)
	ПредставлениеДействия = ПредставлениеОбластиДействия(ВключатьУсловия);
КонецПроцедуры
&НаКлиенте
Функция ПредставлениеОбластиДействия(ВключатьУсловия = Истина)
	
	//ПредставлениеДействия = "";
	Описание = "";
	ДействиеНеОграничено = Ложь;
	Если Недействителен Тогда
        Описание = НСтр("ru = 'Не действует'");
		ДействиеНеОграничено = Истина;
		Возврат Описание;
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаНачала) ИЛИ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Описание = ПредставлениеПериода(Объект.ДатаНачала, Объект.ДатаОкончания);
	Иначе
		Описание = НСтр("ru = 'Постоянно'");
	КонецЕсли;
	Если Объект.Назначение = НазначениеОпт Тогда
		КаналПродаж = НСтр("ru = 'в опте'");
		Описание = СтрШаблон("%1, %2", Описание, КаналПродаж);
	ИначеЕсли Объект.Назначение = НазначениеРозница Тогда
		КаналПродаж = НСтр("ru = 'в рознице'");
		Описание = СтрШаблон("%1, %2", Описание, КаналПродаж);
	КонецЕсли;
	Если Объект.ВремяПоДнямНедели.Количество() > 0 Тогда
		Расписание = НСтр("ru = 'по расписанию'");
		Описание = СтрШаблон("%1, %2", Описание, Расписание);
	КонецЕсли;
	КоличествоСкладов = Объект.ПолучателиСкидкиСклады.Количество();
	Если КоличествоСкладов > 0 Тогда
		Фильтр = СтрШаблон(НСтр("ru = 'в определенных точках продаж (%1)'"), КоличествоСкладов);
		Описание = СтрШаблон("%1, %2", Описание, Фильтр);
	КонецЕсли;
	КоличествоПокупателей = 0;
	Если Объект.ВариантОграниченияПоПолучателям = ПредопределенноеЗначение("Перечисление.ВариантыОграниченийСкидокПоКонтрагентам.ПоКонтрагентам") Тогда
		КоличествоПокупателей = Объект.ПолучателиСкидкиКонтрагенты.Количество();
		Если КоличествоПокупателей > 0 Тогда
			Фильтр = СтрШаблон(НСтр("ru = 'определенным покупателям (%1)'"), КоличествоСкладов);
			Описание = СтрШаблон("%1, %2", Описание, Фильтр);
		КонецЕсли;
	Иначе
		КоличествоПокупателей = Объект.ПолучателиСкидкиСегменты.Количество();
		Если КоличествоПокупателей > 0 Тогда
			Фильтр = СтрШаблон(НСтр("ru = 'определенным сегментам покупателей (%1)'"), КоличествоСкладов);
			Описание = СтрШаблон("%1, %2", Описание, Фильтр);
		КонецЕсли;
	КонецЕсли;

	Если ВключатьУсловия Тогда
		Фильтр = ПредставлениеУсловий();
		Если ДействиеНеОграничено Тогда
			Описание = СтрШаблон("%1", Фильтр);
		Иначе
			Описание = СтрШаблон("%1; %2", Описание, Фильтр);
		КонецЕсли;
	КонецЕсли;
	Возврат Описание;
	
КонецФункции

&НаКлиенте
Функция ПредставлениеПреимущества()
	СтрокаНаименования = "";
	Если Объект.СпособПредоставления = СпособПредоставленияПроцент Тогда
		
		СтрокаНаименования = "" + Объект.ЗначениеСкидкиНаценки + НСтр("ru = '%'");
		
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияСумма Тогда
		
		СтрокаНаименования = "" + Объект.ЗначениеСкидкиНаценки + " " + Объект.ВалютаПредоставления;
		
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияВидЦен Тогда
		
		СтрокаНаименования = "Вид цен - " + Объект.ВидЦен;
		
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияПроцентБонусами Тогда
		
		СтрокаНаименования = "" + Объект.ЗначениеСкидкиНаценки + НСтр("ru = '% баллами'");
		Если ЗначениеЗаполнено(Объект.БонуснаяПрограмма) Тогда
			СтрокаНаименования = СтрокаНаименования + " """ + Объект.БонуснаяПрограмма + """";
		КонецЕсли;
		
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияКоличествоБонусами Тогда
		
		СтрокаНаименования = "" + Объект.ЗначениеСкидкиНаценки + " " + НСтр("ru = 'баллов'");
		Если ЗначениеЗаполнено(Объект.БонуснаяПрограмма) Тогда
			СтрокаНаименования = СтрокаНаименования + " """ + Объект.БонуснаяПрограмма + """";
		КонецЕсли;
		
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияОкругление Тогда
		
		//@skip-check bsl-nstr-string-literal-format
		СтрокаНаименования = НСтр("ru = 'Округление до '") + Объект.ПорядокОкругления;
		Если Объект.ОбластьПредоставления = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе") Тогда
			СтрокаНаименования = СтрокаНаименования + НСтр("ru = ' в документе'");
		ИначеЕсли Объект.ОбластьПредоставления = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке") Тогда
			СтрокаНаименования = СтрокаНаименования + НСтр("ru = ' в строке'");
		КонецЕсли;
		
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияСообщение Тогда
		
		СтрокаНаименования = НСтр("ru = 'Сообщение кассиру'");
		
		Если Объект.МоментВыдачиСообщения = ПредопределенноеЗначение("Перечисление.ТочкиВыдачиСообщенияКассиру.ВМоментРасчетаСкидок") Тогда
			СтрокаНаименования = СтрокаНаименования + НСтр("ru = ' при расчете'");
		ИначеЕсли Объект.МоментВыдачиСообщения = ПредопределенноеЗначение("Перечисление.ТочкиВыдачиСообщенияКассиру.ПослеОформленияЧека") Тогда
			СтрокаНаименования = СтрокаНаименования + НСтр("ru = ' при оформлении'");
		КонецЕсли;
		
		Если Объект.ОбластьПредоставления = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе") Тогда
			СтрокаНаименования = СтрокаНаименования + НСтр("ru = ' в документе'");
		ИначеЕсли Объект.ОбластьПредоставления = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке") Тогда
			СтрокаНаименования = СтрокаНаименования + НСтр("ru = ' в строке'");
		КонецЕсли;

	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияПодарок Тогда
		
		СтрокаНаименования = НСтр("ru = 'Подарок'");
		
		Если Объект.ПодарокИзКорзиныПокупателя Тогда
			СтрокаНаименования = СтрокаНаименования + НСтр("ru = ' из корзины покупателя'");
		Иначе
			СтрокаНаименования = СтрокаНаименования + НСтр("ru = ' на кассе'");
		КонецЕсли; 
		
		Если Объект.ЛюбойПодарокИзСписка Тогда
			СтрокаНаименования = СтрокаНаименования + НСтр("ru = ' на выбор'");
		КонецЕсли;
				
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияПромокод Тогда

		СтрокаНаименования = НСтр("ru = 'Промокод на следующую покупку'");
		
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияРасширение Тогда

		СтрокаНаименования = НСтр("ru = 'Произвольная скидка'");
		
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияРасширение Тогда

		СтрокаНаименования = НСтр("ru = 'Сумма или процент скидки указывается вручную при продаже'");
		
	КонецЕсли;
	
	СуммаВДокументе = (Объект.СпособПредоставления = СпособПредоставленияСумма И Объект.ОбластьПредоставления = ОбластьВДокументе);
	Если Объект.НоменклатураГруппыЦеновыеГруппы.Количество() > 0 И НЕ СуммаВДокументе Тогда
		СтрокаНаименования = СтрокаНаименования + НСтр("ru = ', с уточнением'");
	КонецЕсли;
	
	Возврат СтрокаНаименования;

КонецФункции


&НаКлиенте
Процедура ОбновитьПредставлениеПреимущества()

	ПредставлениеПреимущества = ПредставлениеПреимущества();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеУсловий()
	ПредставлениеУсловий = ПредставлениеУсловий();
КонецПроцедуры

&НаКлиенте
Функция ПредставлениеУсловий()
	СтрокаНаименования = "";
	КоличествоУсловий = Объект.УсловияПредоставления.Количество();
	Если КоличествоУсловий = 0 Тогда
		Если Объект.ИспользоватьПриВозврате Тогда
			СтрокаНаименования = НСтр("ru = 'При любом возврате'");
		Иначе
			СтрокаНаименования = НСтр("ru = 'При любой продаже'");
		КонецЕсли;
	ИначеЕсли КоличествоУсловий = 1 Тогда
		Если Объект.ИспользоватьПриВозврате Тогда
			СтрокаНаименования = СтрШаблон(НСтр("ru = 'При возврате (%1)'"), Объект.УсловияПредоставления[0].УсловиеПредоставления);
		Иначе
			СтрокаНаименования = СтрШаблон(НСтр("ru = 'При продаже (%1)'"), Объект.УсловияПредоставления[0].УсловиеПредоставления);
		КонецЕсли;
	ИначеЕсли КоличествоУсловий > 1 Тогда
		Если Объект.ИспользоватьПриВозврате Тогда
			СтрокаНаименования = СтрШаблон(НСтр("ru = 'При возврате (условия: %1)'"), КоличествоУсловий);
		Иначе
			СтрокаНаименования = СтрШаблон(НСтр("ru = 'При продаже (условия: %1)'"), КоличествоУсловий);
		КонецЕсли;
	КонецЕсли;

	Возврат СтрокаНаименования;
КонецФункции

// Функция возвращает вариант совместного применения автоматических скидок актуальный для текущей скидки.
//
&НаСервереБезКонтекста
Функция ПолучитьТекущийВариантСовместногоПрименения(Родитель)

	Если Родитель.Пустая() Тогда
		Возврат Константы.ВариантыСовместногоПримененияСкидокНаценок.Получить();
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "ВариантСовместногоПрименения");
	КонецЕсли;

КонецФункции // ПолучитьТекущийВариантСовместногоПриме()

&НаСервере
Процедура ОбновитьПризнакиЭтоГруппа()
	
	Если Объект.ВариантОграниченияПоНоменклатуре <> ПредопределенноеЗначение("Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре") Тогда
		Возврат;
	КонецЕсли;
	
	МассивНоменклатуры = Объект.НоменклатураГруппыЦеновыеГруппы.Выгрузить(, "ЗначениеУточнения").ВыгрузитьКолонку("ЗначениеУточнения");
	Если МассивНоменклатуры.Количество()>0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивНоменклатуры)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		ПараметрыНоменклатуры = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			ПараметрыНоменклатуры.Вставить(Выборка.Ссылка, Выборка.ЭтоГруппа);
		КонецЦикла; 
		
		Для каждого Стр Из Объект.НоменклатураГруппыЦеновыеГруппы Цикл
			Если НЕ ЗначениеЗаполнено(Стр.ЗначениеУточнения) ИЛИ ТипЗнч(Стр.ЗначениеУточнения) <> Тип("СправочникСсылка.Номенклатура") Тогда
				Стр.ЭтоГруппа = Ложь;
			Иначе
				Стр.ЭтоГруппа = ПараметрыНоменклатуры.Получить(Стр.ЗначениеУточнения);
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

// Процедура управляет видимостью элементов в зависимости о варианта ограничения,
// способа и области предоставления скидки.
&НаСервере
Процедура УправлениеВидимостьюНаСервере()

	Если Объект.СпособПредоставления = СпособПредоставленияОкругление Тогда
		Элементы.ОсновныеРеквизитыСкидка.Видимость = Истина;
		Элементы.ГруппаСкидки.Видимость = Ложь;
		Элементы.ВидЦен.Видимость = Ложь;
		ТекстПодсказки = НСтр("ru = 'Округление корректирует размер автоматической скидки так, чтобы ""Всего"" документа/строки было округлено до заданного порядка, с учетом всех скидок и НДС строки/документа.'");		
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияВидЦен Тогда
		Элементы.ОсновныеРеквизитыСкидка.Видимость = Истина;
		Элементы.ГруппаСкидки.Видимость = Ложь;
		Элементы.ВидЦен.Видимость = Истина;
		ТекстПодсказки = НСтр("ru = 'Автоматическая скидка установит выбранный вид цен. Скидка составит разницу к текущей цене.'");
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияСообщение Тогда
		Элементы.ОсновныеРеквизитыСкидка.Видимость = Истина;
		Элементы.ГруппаСкидки.Видимость = Ложь;
		Элементы.ВидЦен.Видимость = Ложь;
		ТекстПодсказки = НСтр("ru = 'Кассиру будет выведено сообщение.'");
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияПодарок Тогда
		Элементы.ОсновныеРеквизитыСкидка.Видимость = Объект.УчитыватьПодарокКакПродажу;
		Элементы.ГруппаСкидки.Видимость = Ложь;
		Элементы.ВидЦен.Видимость = Ложь;
		ТекстПодсказки = НСтр("ru = 'Покупателю будет предоставлен подарок.'");
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияПромокод Тогда
		Элементы.ОсновныеРеквизитыСкидка.Видимость = Ложь;
		Элементы.ГруппаСкидки.Видимость = Ложь;
		Элементы.ВидЦен.Видимость = Ложь;
		Элементы.ОсновныеРеквизитыРасширение.Видимость = Ложь;
		ТекстПодсказки = НСтр("ru = 'Покупателю будет предоставлен промокод на следующую покупку.'");
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияРасширение Тогда
		Элементы.ОсновныеРеквизитыСкидка.Видимость = Ложь;
		Элементы.ГруппаСкидки.Видимость = Ложь;
		Элементы.ВидЦен.Видимость = Ложь;
		ТекстПодсказки = НСтр("ru = 'Логика скидки будет определяться загруженным расширением.'");
	ИначеЕсли ЭтоРучнаяСкидка Тогда
		Элементы.ОсновныеРеквизитыСкидка.Видимость = Ложь;
		Элементы.ГруппаСкидки.Видимость = Ложь;
		Элементы.ВидЦен.Видимость = Ложь;
		ТекстПодсказки = НСтр("ru = 'Сумма ручной скидки вводится пользователем непосредственно в документе продажи.'");	
	Иначе	
		Элементы.ОсновныеРеквизитыСкидка.Видимость = Истина;
		Элементы.ГруппаСкидки.Видимость = Истина;
		Элементы.ВидЦен.Видимость = Ложь;
		ТекстПодсказки = "";
	КонецЕсли;
	Элементы.СпособПредоставления.Подсказка = ТекстПодсказки;
	
	ВидимостьСообщений = Объект.СпособПредоставления = СпособПредоставленияСообщение;
	Элементы.ОсновныеРеквизитыСообщение.Видимость = ВидимостьСообщений;
	Элементы.ТекстСообщения.Видимость = ВидимостьСообщений;
	
	
	ВидимостьПодарков = Объект.СпособПредоставления = СпособПредоставленияПодарок;
	Элементы.ОсновныеРеквизитыПодаркиСокращенный.Видимость = ВидимостьПодарков;
	Элементы.УчитыватьПодарокКакПродажу.Видимость = ВидимостьПодарков;
		
	ПоддержкаКратностиСкидки = СпособПоддерживаетКратность(Объект.СпособПредоставления);
	Элементы.ГруппаКратность.Видимость = ПоддержкаКратностиСкидки;

	ВидимостьПромокодов = Объект.СпособПредоставления = СпособПредоставленияПромокод;
	Элементы.ОсновныеРеквизитыПромокод.Видимость = ВидимостьПромокодов;
	
	ВидимостьРасширения = Объект.СпособПредоставления = СпособПредоставленияРасширение;
	Элементы.ОсновныеРеквизитыРасширение.Видимость = ВидимостьРасширения;
	
	ВидимостьОкруглений = Объект.СпособПредоставления = СпособПредоставленияОкругление;
	
	Элементы.ОсновныеРеквизитыОкругление.Видимость = ВидимостьОкруглений;
	Элементы.ЭтоОкруглениеБонусов.Видимость = ВидимостьОкруглений;
	
	ВидимостьБонусов = Объект.ЭтоПравилоНачисленияБонусов;
	Элементы.БонуснаяПрограмма.Видимость = ВидимостьБонусов;
	Элементы.ЗначениеСкидкиНаценки.Заголовок = ?(ВидимостьБонусов, НСтр("ru = 'Начисление'"), НСтр("ru = 'Скидка'"));
	Элементы.ГруппаСовместноеПрименение.Видимость = Не ВидимостьБонусов;
	Элементы.УменьшатьНаСуммуОплатыБаллами.Видимость = Объект.СпособПредоставления = СпособПредоставленияПроцент
		ИЛИ Объект.СпособПредоставления = СпособПредоставленияПроцентБонусами;
	
	Элементы.ОбластьПредоставления.Видимость = НЕ ВидимостьОкруглений 
		И НЕ ВидимостьСообщений 
		И Не ВидимостьБонусов 
		И НЕ ВидимостьПромокодов
		И НЕ ЭтоРучнаяСкидка;
	
	Если Объект.ВариантОграниченияПоНоменклатуре.Пустая() Тогда
		Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоНоменклатуре;
	КонецЕсли;
	
	ВидимостьПодбораНоменклатурыУточнение = Ложь;
	Если Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоНоменклатуре Тогда
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.Заголовок = НСтр("ru = 'Номенклатура'");
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		
		Элементы.ДекорацияПодсказкаУточнения.Заголовок = НСтр("ru = 'Заполните уточнения, если требуется, чтобы у определенных товаров или групп товаров значение скидки отличалось от основного значения. Если список не заполнен, то для всех позиций номенклатуры используется основное значение скидки.'");
		
		Элементы.НоменклатураГруппыЦеновыеГруппыХарактеристика.Видимость = Истина;
		Элементы.НоменклатураГруппыЦеновыеГруппыДобавитьГруппу.Видимость = Истина;
		ВидимостьПодбораНоменклатурыУточнение = Истина;		
	ИначеЕсли Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоКатегориям Тогда
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры");
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.Заголовок = НСтр("ru = 'Категория номенклатуры'");
		
		Элементы.ДекорацияПодсказкаУточнения.Заголовок = НСтр(
			"ru = 'Заполните уточнения, если требуется, чтобы у товаров определенных категорий значение скидки отличалось от основного значения. Если список не заполнен, то для всех категорий используется основное значение скидки.'");
		
		Элементы.НоменклатураГруппыЦеновыеГруппыХарактеристика.Видимость = Ложь;
		Элементы.НоменклатураГруппыЦеновыеГруппыДобавитьГруппу.Видимость = Истина;
	ИначеЕсли Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоЦеновымГруппам Тогда
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.Заголовок = НСтр("ru = 'Ценовая группа'");
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЦеновыеГруппы");
		
		Элементы.ДекорацияПодсказкаУточнения.Заголовок = НСтр("ru = 'Заполните уточнения, если требуется, чтобы у товаров определенных ценовых групп значение скидки отличалось от основного значения. Если список не заполнен, то для всех ценовых групп используется основное значение скидки.'");
		
		Элементы.НоменклатураГруппыЦеновыеГруппыХарактеристика.Видимость = Ложь;
		Элементы.НоменклатураГруппыЦеновыеГруппыДобавитьГруппу.Видимость = Ложь;
	ИначеЕсли Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоСегментамНоменклатуры Тогда
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.Заголовок = НСтр("ru = 'Сегмент номенклатуры'");
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СегментыНоменклатуры");	
		Элементы.ДекорацияПодсказкаУточнения.Заголовок =  НСтр("ru = 'Заполните уточнения, если требуется, чтобы у товаров определенных сегментов значение скидки отличалось от основного значения. Если список не заполнен, то для всех сегментов используется основное значение скидки.'");
		Элементы.НоменклатураГруппыЦеновыеГруппыХарактеристика.Видимость = Ложь;
		Элементы.НоменклатураГруппыЦеновыеГруппыДобавитьГруппу.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ВалютаПредоставления.Видимость = (Объект.СпособПредоставления = СпособПредоставленияСумма);
	Элементы.НоменклатураГруппыЦеновыеГруппыПодборУточнений.Видимость = ВидимостьПодбораНоменклатурыУточнение;
	
	Если Объект.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.Округление") Тогда
		ЭтоСкидка = Ложь;
	ИначеЕсли ЭтоРучнаяСкидка Тогда
		ЭтоСкидка = Ложь;
	Иначе
		ЭтоСкидка = Истина;
	КонецЕсли;
	
	Элементы.ГруппаВремяПоДнямНедели.Доступность = НЕ ЭтоРучнаяСкидка;
	Элементы.ГруппаПериодДействия.Доступность = НЕ ЭтоРучнаяСкидка;
	Элементы.ГруппаСовместноеПрименение.Видимость = ЭтоСкидка;	
	Элементы.ИдентификаторДляРасчетаВРасширении.Видимость = Объект.СпособПредоставления = СпособПредоставленияРасширение;
	
	Если Объект.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.Процент")
		ИЛИ Объект.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.ПроцентОтСуммыВВидеБонусныхБаллов") Тогда
		Элементы.ЗначениеСкидкиНаценки.ФорматРедактирования = "ЧФ = 'Ч %'";
	ИначеЕсли Объект.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.КоличествоБонусныхБаллов") Тогда
		Элементы.ЗначениеСкидкиНаценки.ФорматРедактирования = СтрШаблон("ЧФ = 'Ч %1'", НСтр("ru = 'баллы'"));
	ИначеЕсли Объект.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.Сумма") Тогда
		ВалютыДоступны = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		Если ВалютыДоступны Тогда
			Элементы.ЗначениеСкидкиНаценки.ФорматРедактирования = "";
		Иначе
			Элементы.ЗначениеСкидкиНаценки.ФорматРедактирования = СтрШаблон("ЧФ = 'Ч %1'", Объект.ВалютаПредоставления);
		КонецЕсли;
	Иначе
		Элементы.ЗначениеСкидкиНаценки.ФорматРедактирования = "";
	КонецЕсли;
	Если Объект.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.Подарок") 
		И Объект.ПодарокИзКорзиныПокупателя Тогда
		// Устаревший способ настройки подарка из корзины
		Элементы.ОсновныеРеквизитыПодаркиУстарело.Видимость = Истина;
		Элементы.ОсновныеРеквизитыПодаркиСокращенный.Видимость = Ложь;
	Иначе
		Элементы.ОсновныеРеквизитыПодаркиУстарело.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.Сумма")
		ИЛИ Объект.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.КоличествоБонусныхБаллов") Тогда
		Элементы.ЗначениеСкидкиНаценки.Заголовок = "Сумма";
	Иначе
		Элементы.ЗначениеСкидкиНаценки.Заголовок = "Процент";
	КонецЕсли;
	
	Если Объект.ВариантОграниченияПоПолучателям = ВариантОграниченияПоКонтрагентам
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ВариантОграниченияПоПолучателям) Тогда
		Элементы.СтраницыПолучателиСкидкиСегментыКонтрагенты.ТекущаяСтраница = 
			Элементы.ГруппаПолучателиКонтрагенты;
	ИначеЕсли Объект.ВариантОграниченияПоПолучателям = ВариантОграниченияПоСегментамКонтрагентов Тогда
		Элементы.СтраницыПолучателиСкидкиСегментыКонтрагенты.ТекущаяСтраница = 
			Элементы.ГруппаПолучателиСегменты;
	КонецЕсли;
	
	Если НЕ ИспользуютсяСегментыНоменклатуры Тогда
		СписокВыбораОграниченийПоНоменклатуре = Элементы.ВариантОграниченияПоНоменклатуре.СписокВыбора;
		ВариантПереключателя = 
			СписокВыбораОграниченийПоНоменклатуре.НайтиПоЗначению(ВариантОграниченияПоСегментамНоменклатуры);
		Если ВариантПереключателя <> Неопределено Тогда
			СписокВыбораОграниченийПоНоменклатуре.Удалить(ВариантПереключателя);
		КонецЕсли;
	КонецЕсли;
	ОбновитьВидимостьПромокодов();
	УстановитьДоступностьНазначения();

	ТолькоПродажа = СкидкаДоступнаТолькоПриПродаже(Объект.Назначение, Объект.СпособПредоставления)
		ИЛИ ЭтоРучнаяСкидка;
	Элементы.ИспользоватьПриПродаже.Доступность = НЕ ТолькоПродажа;
	Если ТолькоПродажа И Объект.ИспользоватьПриВозврате Тогда
		Объект.ИспользоватьПриВозврате = Ложь;
		ИспользоватьПриПродаже = НЕ Объект.ИспользоватьПриВозврате;
		ИспользоватьПриПродажеПриИзмененииНаСервере();
	КонецЕсли; 
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция СкидкаДоступнаТолькоПриПродаже(Назначение, СпособПредоставления)
	СпособыТолькоПриПродаже = СкидкиНаценкиСерверПереопределяемый.ПолучитьСписокЗначенийСпособовПредоставленияСкидкиТолькоПриПродаже();
	ТолькоПродажа = НЕ (СпособыТолькоПриПродаже.ВыгрузитьЗначения().Найти(СпособПредоставления) = Неопределено
		И Назначение = ПредопределенноеЗначение("Перечисление.НазначенияАвтоматическихСкидок.Розница"));
	Возврат ТолькоПродажа;
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

// Процедура управляет возможными точками выдачи сообщения кассиру для способа предоставления скидки - сообщение.
//
&НаСервере
Процедура ОбновитьДоступностьТочекВыдачиСообщенийКассиру()
	ТекстПодсказки = "";
	
	ТочкаПослеОформления = ПредопределенноеЗначение("Перечисление.ТочкиВыдачиСообщенияКассиру.ПослеОформленияЧека");
	ТочкаПриРасчете = ПредопределенноеЗначение("Перечисление.ТочкиВыдачиСообщенияКассиру.ВМоментРасчетаСкидок");
	ТочкаПоУмолчанию = ТочкаПриРасчете;	
	ДополнительныеТочки = Новый Массив;
	Если Объект.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.Сообщение") Тогда
		Если Объект.Назначение = Перечисления.НазначенияАвтоматическихСкидок.Розница Тогда
			ТочкаПоУмолчанию = ТочкаПослеОформления;
			ДополнительныеТочки.Добавить(ТочкаПриРасчете);
		Иначе         
			ТекстПодсказки = "В опте показ сообщений поддерживается только в момент расчета скидки";
		КонецЕсли;		
	ИначеЕсли Объект.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.Подарок") Тогда
		ТочкаПоУмолчанию = ТочкаПослеОформления;
		ДополнительныеТочки.Добавить(ТочкаПриРасчете);
	КонецЕсли;
	
	ДоступныеТочкиВывода = Новый массив;
	ДоступныеТочкиВывода.Добавить(ТочкаПоУмолчанию);
	
	Для каждого ДополнительнаяТочка Из ДополнительныеТочки Цикл
		ДоступныеТочкиВывода.Добавить(ДополнительнаяТочка);
	КонецЦикла;

	Элементы.МоментВыдачиСообщения.Подсказка = ТекстПодсказки;
	Элементы.МоментВыдачиСообщения.СписокВыбора.Очистить();
	Элементы.МоментВыдачиСообщения.СписокВыбора.ЗагрузитьЗначения(ДоступныеТочкиВывода); 
	Если ДоступныеТочкиВывода.Найти(Объект.МоментВыдачиСообщения) = неопределено Тогда
		Объект.МоментВыдачиСообщения = ТочкаПоУмолчанию;
	КонецЕсли;
	ДоступностьВыбораТочки = Истина;
	Если ДоступныеТочкиВывода.Количество() = 1 Тогда 
		ДоступностьВыбораТочки = Ложь;
	КонецЕсли;
	Элементы.МоментВыдачиСообщения.Доступность = ДоступностьВыбораТочки;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьПромокодов()
	ТаблицаУсловий = УсловияПредоставленияВСтроке.Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УсловияПредоставленияПоДокументу.Выгрузить(), ТаблицаУсловий);
	ТребуетсяПромокод = УсловияСодержатТребованияПромокода(ТаблицаУсловий);
	Элементы.ГруппаПромокоды.Видимость = ТребуетсяПромокод;
	
	Если ТребуетсяПромокод Тогда
 		СервисМассовойРассылки = МассовыеРассылкиИнтеграция.ПодключенныйСервис();
	   	ИспользоватьМассовыеРассылкиИнтеграция = ПолучитьФункциональнуюОпцию(
	   		"ИспользоватьМассовыеРассылкиИнтеграция")
			И ЗначениеЗаполнено(СервисМассовойРассылки);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ПромокодыОтправитьПромокодыСервис", "Видимость", ИспользоватьМассовыеРассылкиИнтеграция);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ПромокодыКонтекстноеМенюОтправитьПромокодыСервис", "Видимость",
			ИспользоватьМассовыеРассылкиИнтеграция);
		
		ПредставлениеСервиса = МассовыеРассылкиИнтеграция.ПредставлениеСервиса(СервисМассовойРассылки);
		Элементы.ПромокодыОтправитьПромокодыСервис.Заголовок = СтрШаблон(
			НСтр("ru='Отправить выделенные промокоды %1'"), ПредставлениеСервиса);
		Элементы.ПромокодыКонтекстноеМенюОтправитьПромокодыСервис.Заголовок = СтрШаблон(
			НСтр("ru='Отправить выделенные промокоды %1'"), ПредставлениеСервиса);
		
		Если НЕ ПравоДоступа("Редактирование", Метаданные.Документы.МассоваяРассылка) Тогда
			Элементы.ПромокодыОтправитьПромокоды.Видимость = Ложь;
			Элементы.ПромокодыОтправитьПромокодыСервис.Видимость = Ложь;
			Элементы.ПромокодыКонтекстноеМенюОтправитьПромокоды.Видимость = Ложь;
			Элементы.ПромокодыКонтекстноеМенюОтправитьПромокодыСервис.Видимость = Ложь;			
		КонецЕсли;
					
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеУсловийНаВидОплаты()
	
	ВыбранныеУсловия = Объект.УсловияПредоставления.Выгрузить(, "УсловиеПредоставления").ВыгрузитьКолонку("УсловиеПредоставления");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Различные
	|	УсловияПредоставленияСкидокНаценок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УсловияПредоставленияСкидокНаценок КАК УсловияПредоставленияСкидокНаценок
	|ГДЕ
	|	УсловияПредоставленияСкидокНаценок.УсловиеПредоставления = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаВидОплаты)
	|	И УсловияПредоставленияСкидокНаценок.Ссылка В(&Ссылки)";
	Запрос.УстановитьПараметр("Ссылки", ВыбранныеУсловия);
	УсловияЗаВидОплаты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	ЕстьУсловияПоВидуОплаты = УсловияЗаВидОплаты.Количество() > 0;
	Если ЕстьУсловияПоВидуОплаты
		И (НЕ Объект.СпособПредоставления = СпособПредоставленияПроцент
			И НЕ Объект.СпособПредоставления = СпособПредоставленияСумма
			И НЕ Объект.СпособПредоставления = СпособПредоставленияОкругление
				ИЛИ Объект.ИспользоватьПриВозврате) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'При использовании условий на вид оплаты, можно предоставлять только скидку процентом, фиксированной суммой, или округление при продаже.
		|Условия за вид оплаты исключены из списка.'");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();		
		МассивСтрокУсловийУдалять = Новый Массив;
		Для Каждого СтрокаУсловия Из Объект.УсловияПредоставления Цикл
			Если НЕ УсловияЗаВидОплаты.Найти(СтрокаУсловия.УсловиеПредоставления) = Неопределено Тогда
				МассивСтрокУсловийУдалять.Добавить(СтрокаУсловия);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаУсловия Из МассивСтрокУсловийУдалять Цикл
			Объект.УсловияПредоставления.Удалить(СтрокаУсловия);
		КонецЦикла;
		ЕстьУсловияПоВидуОплаты = Ложь;
	КонецЕсли;
	Если Не Объект.ЕстьУсловияПоВидуОплаты = ЕстьУсловияПоВидуОплаты Тогда
		Объект.ЕстьУсловияПоВидуОплаты = ЕстьУсловияПоВидуОплаты;
		// Обновить подсказку
		УправлениеВидимостьюНаСервере();
	КонецЕсли;
	УстановитьДоступностьНазначения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьНазначения()
	НоваяДоступность = НЕ (Объект.ЕстьУсловияПоВидуОплаты
		И Объект.СпособПредоставления = СпособПредоставленияПроцент)
		И НЕ Объект.ИспользоватьПриВозврате;
	Если ЭтоРучнаяСкидка Тогда
		НоваяДоступность = Ложь;
	ИначеЕсли НЕ Элементы.Назначение.Доступность = НоваяДоступность Тогда
		Если Не НоваяДоступность 
			И Не Объект.Назначение = НазначениеРозница Тогда
			Объект.Назначение = НазначениеРозница;
			ТекущийЭлемент = Элементы.Назначение;
		КонецЕсли;
	КонецЕсли;
	Элементы.Назначение.Доступность = НоваяДоступность;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодсказкуОбластиПредоставления()

	ТекстПодсказкиРаспределенияСтоимостиПодарка = ТекстПодсказкиОбластиПримененияСкидки(Объект.ОбластьПредоставления);
	Элементы.ОбластьПредоставления.Подсказка = ТекстПодсказкиРаспределенияСтоимостиПодарка;

КонецПроцедуры

&НаСервере
Функция ТекстПодсказкиОбластиПримененияСкидки(ОбластьПредоставления)
	Если Объект.СпособПредоставления <> СпособПредоставленияПодарок Тогда
		ТекстПодсказкиРаспределенияСтоимостиПодарка = НСтр("ru = 'Определяет, является ли скидка общей для всех строк документа или предоставляется для каждой строки, где выполнились условия.'");
	ИначеЕсли ОбластьПредоставления = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе") Тогда
		ТекстПодсказкиРаспределенияСтоимостиПодарка = НСтр("ru = 'При добавлении подарка в документ, стоимость подарка будет пропорционально разделена в документе.'");
	Иначе
		ТекстПодсказкиРаспределенияСтоимостиПодарка = НСтр("ru = 'На строку с подарком будет применена скидка 100%.'");
	КонецЕсли;
    Возврат ТекстПодсказкиРаспределенияСтоимостиПодарка;
КонецФункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура ДобавитьГруппуНоменклатурыКатегорийЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		НоваяСтрока = Объект.НоменклатураГруппыЦеновыеГруппы.Добавить();
		НоваяСтрока.ЗначениеУточнения = РезультатЗакрытия;
		Элементы.НоменклатураГруппыЦеновыеГруппы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Если Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоНоменклатуре Тогда
			НоваяСтрока.ЭтоГруппа = УправлениеНебольшойФирмойВызовСервера.ЗначениеРеквизитаОбъекта(РезультатЗакрытия, "ЭтоГруппа");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуКонтрагентовЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		НоваяСтрока = Объект.ПолучателиСкидкиКонтрагенты.Добавить();
		НоваяСтрока.Получатель = РезультатЗакрытия;
		Элементы.ПолучателиСкидки.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНастроекПодарков()
	
	Если Объект.ОбластьПредоставления = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе") Тогда
		Элементы.СхемаВыдачиПодаркаНаКассеВЧек.Подсказка = НСтр("ru = 'Выданный подарок будет добавлен в чек покупателя со 100% скидкой, равномерно распределенной по документу'");
	Иначе
		Элементы.СхемаВыдачиПодаркаНаКассеВЧек.Подсказка = НСтр("ru = 'Выданный подарок будет добавлен в чек покупателя со 100% скидкой'");
	КонецЕсли;
	Элементы.СчетЗатратПодарка.Доступность = Не Объект.УчитыватьПодарокКакПродажу И Не Объект.ПодарокИзКорзиныПокупателя; 
		
КонецПроцедуры


&НаКлиенте
Процедура НаборПодарковПодтверждениеСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗапрашиватьСбросКоличества = Результат.ЗапрашиватьСбросКоличества;
		Если НЕ ЗапрашиватьСбросКоличества Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		КонецЕсли;
		Если Результат.СбрасыватьКоличество Тогда
			НовоеКоличество = Результат.НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = ДополнительныеПараметры.Количество;
		КонецЕсли;
	Иначе
		НовоеКоличество = ДополнительныеПараметры.Количество;
	КонецЕсли;
	
	НаборПодарковНоменклатураПриИзмененииПродолжить(ДополнительныеПараметры.Элемент, НовоеКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборПодарковНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество)

	СтрокаТабличнойЧасти = Элементы.НаборПодарков.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.Характеристика = Неопределено;
	СтрокаТабличнойЧасти.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
	СтрокаТабличнойЧасти.ЗаполнениеХарактеристикиПроверено = Истина;
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = НовоеКоличество;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуГенерацииПромокодов()
	ПараметрыОткрытия = Новый Структура("СкидкаНаценка", Объект.Ссылка);
	ОткрытьФорму("Обработка.ГенерацияПромокодов.Форма.Форма", ПараметрыОткрытия, ЭтотОбъект); 
КонецПроцедуры

&НаСервере
Процедура ИспользоватьПриПродажеПриИзмененииНаСервере()
	ЗаполнитьСписокВыбораСпособПредоставления();
	ПроверитьНаличиеУсловийНаВидОплаты()
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	//Элементы.Назначение.Доступность = НЕ Объект.ИспользоватьПриВозврате;
	УстановитьДоступностьНазначения();
	ТолькоПродажа = СкидкаДоступнаТолькоПриПродаже(Объект.Назначение, Объект.СпособПредоставления);
	Элементы.ИспользоватьПриПродаже.Доступность = НЕ ТолькоПродажа;
	УстановитьДоступностьКратности();
	Элементы.СчетЗатратПодаркаСокращенный.Доступность = НЕ Объект.УчитыватьПодарокКакПродажу;
	ОбновитьДоступностьСкидокВозврат();
	
КонецПроцедуры
#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Функция СпособПоддерживаетКратность(СпособПредоставления)
	СпособПодходит = СпособПредоставления = ПредопределенноеЗначение(
		"Перечисление.СпособыПредоставленияСкидокНаценок.Сумма") 
		Или СпособПредоставления = ПредопределенноеЗначение(
			"Перечисление.СпособыПредоставленияСкидокНаценок.Процент") 
		Или СпособПредоставления = ПредопределенноеЗначение(
			"Перечисление.СпособыПредоставленияСкидокНаценок.ВидЦен")
		Или СпособПредоставления = ПредопределенноеЗначение(
			"Перечисление.СпособыПредоставленияСкидокНаценок.КоличествоБонусныхБаллов") 
		Или СпособПредоставления = ПредопределенноеЗначение(
			"Перечисление.СпособыПредоставленияСкидокНаценок.ПроцентОтСуммыВВидеБонусныхБаллов") 
		Или СпособПредоставления = ПредопределенноеЗначение(
			"Перечисление.СпособыПредоставленияСкидокНаценок.Подарок");
	Возврат СпособПодходит;
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьКратности()
	
	ПовторениеДоступно = Ложь;
	
	СпособПодходит = СпособПоддерживаетКратность(Объект.СпособПредоставления);
	
	Если Объект.ИспользоватьРежимКратности И НЕ СпособПодходит Тогда
		Объект.ИспользоватьРежимКратности = Ложь;
	КонецЕсли;
	
 	Элементы.ГруппаКратность.Видимость = СпособПодходит;
	Элементы.ГруппаСтрокаКратности.Доступность = Объект.ИспользоватьРежимКратности;
	СписокУсловий = Новый Массив;
	Если СпособПодходит Тогда
		Для Каждого СтрокаУсловия ИЗ Объект.УсловияПредоставления Цикл
			СписокУсловий.Добавить(СтрокаУсловия.УсловиеПредоставления);
		КонецЦикла;
		ОписанияУсловийСКратностью = УсловияПоддерживающиеКратность(СписокУсловий);
		ПовторениеДоступно = ОписанияУсловийСКратностью.Количество() > 0;
		Если ПовторениеДоступно И Объект.КратноКоличествуУсловий Тогда
			ТекстОписанияУсловий = СтрСоединить(ОписанияУсловийСКратностью, " и ");
		Иначе
			ТекстОписанияУсловий = "";			
		КонецЕсли;
		ТекстКратныхУсловий = ТекстОписанияУсловий;
	КонецЕсли;
	ОбновитьКратность();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УсловияПоддерживающиеКратность(Условия)
	Результат = Новый Массив;
	
	МожноВывестиУсловий = 2;
	КоличествоНеВместившихсяУсловий = 0;
	Для Каждого Условие Из Условия Цикл
		ОписаниеКратностиУсловия = СкидкиНаценкиСервер.ОписаниеКратностиУсловия(Условие, Истина);				
		Если НЕ ОписаниеКратностиУсловия = Неопределено Тогда
			Если МожноВывестиУсловий >= 1 Тогда
				Результат.Добавить(ОписаниеКратностиУсловия);				
			Иначе
				КоличествоНеВместившихсяУсловий = КоличествоНеВместившихсяУсловий + 1;
			КонецЕсли;
			МожноВывестиУсловий = МожноВывестиУсловий - 1;
		КонецЕсли;
	КонецЦикла;
	Если КоличествоНеВместившихсяУсловий > 0 Тогда
		Инд = Результат.ВГраница();
		Результат[Инд] = Результат[Инд] + СтрШаблон(" и еще %1", 
			ПолучитьСклоненияСтрокиПоЧислу("Условие",  КоличествоНеВместившихсяУсловий, "", "ЧС=Количественное", "ПД=Родительный; ПЧ=Число"));
	КонецЕсли;
	Возврат Результат;
КонецФУнкции

&НаКлиенте
Процедура КонвертироватьПодарокИзКорзиныНаКлиенте()
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Перед конвертацией, скидку необходимо записать.'"));
	ИначеЕсли Недействителен Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Конвертировать возможно только действующую скидку.'"));
	Иначе
		НоваяСкидка = КонвертироватьПодарокИзКорзиныНаСервере();
		ПоказатьЗначение(,НоваяСкидка);
		Объект.Действует = Ложь;
		Недействителен = Истина;
		Объект.Комментарий = СтрШаблон(НСтр("ru = 'Отключена в результате конвертации %1. Конвертацию выполнил %2'"), 
			ОбщегоНазначенияКлиент.ДатаСеанса(), 
			ПользователиКлиент.ТекущийПользователь());
		Записать();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КонвертироватьПодарокИзКорзиныНаСервере()
	
	Результат = Неопределено;
	СтараяСкидка = РеквизитФормыВЗначение("Объект");
	НоваяСкидка = СтараяСкидка.Скопировать();
	НачатьТранзакцию();
	Попытка
		Справочники.АвтоматическиеСкидки.ЗаполнитьСконвертированныеНастройкиПодарокИзКорзиныПокупателя(СтараяСкидка, НоваяСкидка);
		НоваяСкидка.Записать();
		Результат = НоваяСкидка.Ссылка;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьКратность()
	Элементы.ГруппаСтрокаКратности.Доступность = Объект.ИспользоватьРежимКратности;
	Элементы.ТекстОписанияКратныхУсловий.Видимость = Объект.КратноКоличествуУсловий;
КонецПроцедуры

	
&НаСервере
Процедура РазделитьУсловияПоОбласти()
	УсловияПредоставленияВСтроке.Очистить();
	УсловияПредоставленияПоДокументу.Очистить();
	ВыбранныеУсловия = Объект.УсловияПредоставления.Выгрузить(,"УсловиеПредоставления").ВыгрузитьКолонку("УсловиеПредоставления");
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УсловияПредоставленияСкидокНаценок.Ссылка КАК Ссылка,
	|	УсловияПредоставленияСкидокНаценок.ОбластьОграничения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке) КАК УсловиеНаСтроку
	|ИЗ
	|	Справочник.УсловияПредоставленияСкидокНаценок КАК УсловияПредоставленияСкидокНаценок
	|Где УсловияПредоставленияСкидокНаценок.Ссылка В (&ВыбранныеУсловия)";
	Запрос.УстановитьПараметр("ВыбранныеУсловия",ВыбранныеУсловия);
	ВыбУсловия = Запрос.Выполнить().Выбрать();
	Пока ВыбУсловия.Следующий() Цикл
		Если ВыбУсловия.УсловиеНаСтроку Тогда
			СохраненноеУсловие = УсловияПредоставленияВСтроке.Добавить();
			СохраненноеУсловие.УсловиеПредоставления = ВыбУсловия.Ссылка;
		Иначе
			СохраненноеУсловие = УсловияПредоставленияПоДокументу.Добавить();
			СохраненноеУсловие.УсловиеПредоставления = ВыбУсловия.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьИВывестиБаннерРаспределенияСтоимостиПодарка()
	Элементы.ОбластьПредоставления.Подсказка = ТекстПодсказкиРаспределенияСтоимостиПодарка;	
КонецПроцедуры  

&НаКлиенте
Процедура Подключаемый_ПодсказкаРаспределенияСтоимостиПодаркаОбработкаЗакрытия(Команда)
	
	ОтключитьОтображениеБаннераКлиент("ПодсказкаРаспределенияСтоимостиПодарка");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БаннерУсловияНаСтрокуОбработкаЗакрытия(Команда)
	
	ОтключитьОтображениеБаннераКлиент("БаннерУсловияНаСтроку");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтображениеБаннераКлиент(ИдентификаторБаннера)
	
	ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(
		ЭтотОбъект,
		ИдентификаторБаннера);
	
КонецПроцедуры

&НаСервере
Процедура МенюРазделовЗаполнить()

	МенюРазделовСтрокаДействие = МенюРазделов.ПолучитьЭлементы().Добавить();
	МенюРазделовСтрокаДействие.Наименование = "Доступность";
	МенюРазделовСтрокаДействие.ИмяСтраницы = "ГруппаОписаниеДействия";
	МенюРазделовСтрокаДействие.Картинка = БиблиотекаКартинок.Календарь;
	МенюРазделовСтрокаДействие.ДоступностьРаздела = Истина;
	МенюРазделовСтрокаДействие.КоличествоНастроек = 0;

	
	МенюРазделовСтрока = МенюРазделовСтрокаДействие.ПолучитьЭлементы().Добавить();
	МенюРазделовСтрока.Наименование = "Точки продаж";
	МенюРазделовСтрока.ИмяСтраницы = "ГруппаСклады";
	МенюРазделовСтрока.Картинка = БиблиотекаКартинок.СменитьМагазин;
	МенюРазделовСтрока.ДоступностьРаздела = Истина;
	МенюРазделовСтрока.КоличествоНастроек = 0;

	МенюРазделовСтрока = МенюРазделовСтрокаДействие.ПолучитьЭлементы().Добавить();
	МенюРазделовСтрока.Наименование = "Покупатели";
	МенюРазделовСтрока.ИмяСтраницы = "ГруппаКонтрагенты";
	МенюРазделовСтрока.Картинка = БиблиотекаКартинок.Пользователь;
	МенюРазделовСтрока.ДоступностьРаздела = Истина;
	МенюРазделовСтрока.КоличествоНастроек = 0;
	
	МенюРазделовСтрока = МенюРазделовСтрокаДействие.ПолучитьЭлементы().Добавить();
	МенюРазделовСтрока.Наименование = "Условия покупки";
	МенюРазделовСтрока.ИмяСтраницы = "ГруппаУсловияПредоставления";
	МенюРазделовСтрока.Картинка = БиблиотекаКартинок.Отборы;
	МенюРазделовСтрока.ДоступностьРаздела = Истина;
	МенюРазделовСтрока.КоличествоНастроек = 0;

	МенюРазделовСтрокаПреимущество = МенюРазделов.ПолучитьЭлементы().Добавить();
	МенюРазделовСтрокаПреимущество.Наименование = "Преимущество";
	МенюРазделовСтрокаПреимущество.ИмяСтраницы = "ГруппаОписаниеПреимущества";
	МенюРазделовСтрокаПреимущество.Картинка = БиблиотекаКартинок.SaleBlack;
	МенюРазделовСтрокаПреимущество.ДоступностьРаздела = Истина;
	МенюРазделовСтрокаПреимущество.КоличествоНастроек = 0;
	
	МенюРазделовСтрока = МенюРазделовСтрокаПреимущество.ПолучитьЭлементы().Добавить();
	МенюРазделовСтрока.Наименование = "Уточнения";
	МенюРазделовСтрока.ИмяСтраницы = "Уточнения";
	МенюРазделовСтрока.Картинка = БиблиотекаКартинок.НастроитьСписок;
	МенюРазделовСтрока.ДоступностьРаздела = Истина;
	МенюРазделовСтрока.КоличествоНастроек = 0;

	МенюРазделовСтрока = МенюРазделовСтрокаПреимущество.ПолучитьЭлементы().Добавить();
	МенюРазделовСтрока.Наименование = "Подарки";
	МенюРазделовСтрока.ИмяСтраницы = "ГруппаПодарок";
	МенюРазделовСтрока.Картинка = БиблиотекаКартинок.Подарок;
	МенюРазделовСтрока.ДоступностьРаздела = Истина;
	МенюРазделовСтрока.КоличествоНастроек = 0;

	МенюРазделовСтрока = МенюРазделов.ПолучитьЭлементы().Добавить();
	МенюРазделовСтрока.Наименование = "Дополнительно";
	МенюРазделовСтрока.ИмяСтраницы = "ГруппаДополнительно";
	МенюРазделовСтрока.Картинка = БиблиотекаКартинок.РежимПросмотраСпискаСписок;
	МенюРазделовСтрока.ДоступностьРаздела = Истина;
	МенюРазделовСтрока.КоличествоНастроек = 0;

	МенюРазделовСтрока = МенюРазделов.ПолучитьЭлементы().Добавить();
	МенюРазделовСтрока.Наименование = "Результат";
	МенюРазделовСтрока.ИмяСтраницы = "ГруппаРезультат";
	МенюРазделовСтрока.Картинка = БиблиотекаКартинок.ВыполненоУспешно;
	МенюРазделовСтрока.ДоступностьРаздела = Истина;
	МенюРазделовСтрока.КоличествоНастроек = 0;

КонецПроцедуры 

&НаКлиенте
Процедура МенюРазделовПриАктивизацииСтрокиСтраницаПереключить()

		ТекущаяСтраницаИмя = Элементы.МенюРазделов.ТекущиеДанные.ИмяСтраницы;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ ТекущаяСтраницаИмя ];

КонецПроцедуры

&НаКлиенте
Функция МенюРазделовТекущаяСтрокаУстановить(ИмяСтраницы, УзелДерева = Неопределено)
	Успех = Ложь;
	АнализируемыйУзел = МенюРазделов;
	Если НЕ УзелДерева = Неопределено Тогда
		АнализируемыйУзел = УзелДерева;
	КонецЕсли;
	СтрокиМенюРазделов = АнализируемыйУзел.ПолучитьЭлементы();
	Для Каждого Раздел Из СтрокиМенюРазделов Цикл
		Если Раздел.ИмяСтраницы = ИмяСтраницы Тогда
			Элементы.МенюРазделов.ТекущаяСтрока = Раздел.ПолучитьИдентификатор();
			Успех = Истина;
			Прервать;
		ИначеЕсли МенюРазделовТекущаяСтрокаУстановить(ИмяСтраницы, Раздел) Тогда
			Успех = Истина;
			ПРервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Успех;
КонецФункции

&НаКлиенте
Процедура ОбновитьДоступностьРазделов()
	ПодарокДоступен = Ложь;
	Если Объект.СпособПредоставления = СпособПредоставленияПодарок Тогда
		ПодарокДоступен = Истина;
	КонецЕсли;
	СтрокаРаздела = НайтиСтрокуРазделаПоИмениСтраницы("ГруппаПодарок");
	СтрокаРаздела.СкрытьСтроку = НЕ ПодарокДоступен;
	
	СуммаВДокументе = ((Объект.СпособПредоставления = СпособПредоставленияСумма Или Объект.СпособПредоставления = СпособПредоставленияКоличествоБонусами)
						И Объект.ОбластьПредоставления = ОбластьВДокументе) ИЛИ Объект.СпособПредоставления = СпособПредоставленияВидЦен;
		
	ЭтоСложнаяСкидка = Объект.СпособПредоставления = СпособПредоставленияРасширение 
						ИЛИ Объект.СпособПредоставления = СпособПредоставленияПодарок
						ИЛИ Объект.СпособПредоставления = СпособПредоставленияСообщение
						ИЛИ Объект.СпособПредоставления = СпособПредоставленияПромокод;
	ДоступностьУточнений = Не СуммаВДокументе И Не ЭтоСложнаяСкидка И НЕ ЭтоРучнаяСкидка;
	
	СтрокаРаздела = НайтиСтрокуРазделаПоИмениСтраницы("ГруппаУсловияПредоставления");
	СтрокаРаздела.ДоступностьРаздела = НЕ ЭтоРучнаяСкидка;
	
	СтрокаРаздела = НайтиСтрокуРазделаПоИмениСтраницы("ГруппаКонтрагенты");
	СтрокаРаздела.ДоступностьРаздела = НЕ ЭтоРучнаяСкидка;

	СтрокаРаздела = НайтиСтрокуРазделаПоИмениСтраницы("ГруппаСклады");
	СтрокаРаздела.ДоступностьРаздела = НЕ ЭтоРучнаяСкидка;

	СтрокаРаздела = НайтиСтрокуРазделаПоИмениСтраницы("Уточнения");
	СтрокаРаздела.ДоступностьРаздела = НЕ ЭтоРучнаяСкидка;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуРазделаПоИмениСтраницы(ИмяСтраницы, УзелДерева = Неопределено)
	
	АнализируемаяСтрокаДерева = МенюРазделов;
	Если НЕ УзелДерева = Неопределено Тогда
		АнализируемаяСтрокаДерева = УзелДерева;
	КонецЕсли;
	Для Каждого ПодчиненнаяСтрока Из АнализируемаяСтрокаДерева.ПолучитьЭлементы() Цикл
		Результат = Неопределено;
		Если ПодчиненнаяСтрока.ИмяСтраницы = ИмяСтраницы Тогда
			Результат = ПодчиненнаяСтрока;
		Иначе
			Результат = НайтиСтрокуРазделаПоИмениСтраницы(ИмяСтраницы, ПодчиненнаяСтрока);
		КонецЕсли;	
		Если НЕ Результат = Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции


&НаКлиенте
Функция СледующийРаздел(ТекущийРаздел, Вперед = Истина, АнализироватьПодчиненные = Истина)
	
	
	Назад = НЕ Вперед;
	Результат = Неопределено;
	Если ТекущийРаздел = Неопределено Тогда
		Результат = ТекущийРаздел.ПолучитьЭлементы()[0];
	ИначеЕсли АнализироватьПодчиненные И Вперед Тогда
		ПодчиненныеРазделы = ТекущийРаздел.ПолучитьЭлементы();
		Если ПодчиненныеРазделы.Количество() Тогда
			Результат = ПодчиненныеРазделы[0];
		КонецЕсли;
	КонецЕсли;
	Если Результат = Неопределено Тогда
		Родитель = ТекущийРаздел.ПолучитьРодителя();
		Если Родитель = Неопределено Тогда
			Родитель = МенюРазделов;
		КонецЕсли;
		ОдноуровневыеРазделы = Родитель.ПолучитьЭлементы();
		ИндексТекущего = ОдноуровневыеРазделы.Индекс(ТекущийРаздел);
		ПродолжатьПоиск = Истина;
		Пока ПродолжатьПоиск Цикл
			СледующийРаздел = Неопределено;
			СледующийИндекс = 0;
			Если Вперед Тогда
				СледующийИндекс = ИндексТекущего + 1;
			Иначе
				СледующийИндекс = ИндексТекущего - 1;
			КонецЕсли;
			Если СледующийИндекс < ОдноуровневыеРазделы.Количество()
				И СледующийИндекс >= 0 Тогда 
				СледующийРаздел = ОдноуровневыеРазделы.Получить(СледующийИндекс);
			КонецЕсли;
			Если СледующийРаздел = Неопределено И Назад И НЕ Родитель = МенюРазделов Тогда
				СледующийРаздел = Родитель;
				ПродолжатьПоиск = Ложь;
				Прервать;
			ИначеЕсли СледующийРаздел = Неопределено Тогда
				Прервать;
			ИначеЕсли СледующийРаздел.СкрытьСтроку ИЛИ НЕ СледующийРаздел.ДоступностьРаздела Тогда
				ИндексТекущего = СледующийИндекс;
			Иначе
				Если Назад Тогда
					ПредыдущиеПодчиненные = СледующийРаздел.ПолучитьЭлементы();
					КоличествоПодчиненных = ПредыдущиеПодчиненные.Количество(); 
					ПочиненныйРаздел = Неопределено;
					Для Счетчик = 1 ПО КоличествоПодчиненных  Цикл
						ОбратныйИндекс = КоличествоПодчиненных - Счетчик;
						ПочиненныйРаздел = ПредыдущиеПодчиненные[ОбратныйИндекс];
						Если ПочиненныйРаздел.СкрытьСтроку ИЛИ НЕ ПочиненныйРаздел.ДоступностьРаздела Тогда
							Продолжить;
						КонецЕсли;
						ПродолжатьПоиск = Ложь;
						Прервать;
					КонецЦикла;
					Если НЕ ПродолжатьПоиск Тогда
						СледующийРаздел = ПочиненныйРаздел;
					КонецЕсли;
				КонецЕсли;
				ПродолжатьПоиск = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПродолжатьПоиск И НЕ Родитель = МенюРазделов Тогда 
			Результат = СледующийРаздел(Родитель, Вперед, Ложь);
		ИначеЕсли ПродолжатьПоиск Тогда
			Результат = Неопределено;
		Иначе
			Результат = СледующийРаздел;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции


&НаСервере
Процедура ДобавитьПодсказки()

	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.КраткоеПредставление = "Подсказка расширения";
	ПараметрыВажногоСообщения.Родитель = "ОсновныеРеквизитыРасширение";
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Данный тип позволяет рассчитать скидки из любых данных вашей базы. 
		|Для этого необходимо создать расширение по шаблону. Если у вас нет опыта работы в конфигураторе, сформулируйте запрос и обратитесь в свою обслуживающую организацию.'");
	ПараметрыДействия = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	ПараметрыДействия.Вставить("ИмяКоманды", "ОткрытьИнструкциюРасширение");
	ПараметрыДействия.Вставить("Обработчик", "ОткрытьИнструкциюРасширение");
	ПараметрыДействия.Вставить("Заголовок",  "Инструкция");
	
	ПараметрыВажногоСообщения.ПараметрыДействия = ПараметрыДействия;

	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.КраткоеПредставление = "Подсказка условий на строку";
	ПараметрыВажногоСообщения.Родитель = "ГруппаБаннерУсловияНаСтроку";
	ПараметрыВажногоСообщения.Идентификатор = "БаннерУсловияНаСтроку";
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ОбработчикЗакрытия = "Подключаемый_БаннерУсловияНаСтрокуОбработкаЗакрытия";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Ограничения действия скидки на строку позволяют активировать скидку только для отдельных строк документа'");
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения);

	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.КраткоеПредставление = "Подсказка условий на документ";
	ПараметрыВажногоСообщения.Родитель = "ГруппаБаннерУсловияНаДокумент";
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Ограничения действия скидки на документ означает, что скидка сработает на весь документ, при его соответствии условиям.'");
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения);
    ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТЧУсловий()
	Объект.УсловияПредоставления.Очистить();
	Для Каждого СтрокаУсловия Из УсловияПредоставленияПоДокументу Цикл
		НовоеУсловие = Объект.УсловияПредоставления.Добавить();
		НовоеУсловие.УсловиеПредоставления = СтрокаУсловия.УсловиеПредоставления;
	КонецЦикла;
	Для Каждого СтрокаУсловия Из УсловияПредоставленияВСтроке Цикл
		НовоеУсловие = Объект.УсловияПредоставления.Добавить();
		НовоеУсловие.УсловиеПредоставления = СтрокаУсловия.УсловиеПредоставления;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМассовуюРассылкуВыделенныхПромокодов(РассылкаСервиса = Ложь)
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("СпособОтправки", ПредопределенноеЗначение("Перечисление.ВидыКаналовСвязи.Email"));
	ПараметрыРассылки.Вставить("ПредлагаемаяСкидка", Объект.Ссылка);
	
	ВыделенныеПромокоды = Новый Массив;
	Для Каждого Идентификатор Из Элементы.Промокоды.ПолучитьСтрокиДляОбработки() Цикл
		ТекущаяСтрока = Элементы.Промокоды.ДанныеСтроки(Идентификатор);
		Если Не ТекущаяСтрока.Отправлен Тогда
			ВыделенныеПромокоды.Добавить(ТекущаяСтрока.Промокод);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыРассылки.Вставить("Промокоды", ВыделенныеПромокоды);
	ИмяФормыРассылки = "Документ.МассоваяРассылка.Форма.ФормаДокумента";
	
	Если РассылкаСервиса Тогда 
		ИмяФормыРассылки = "Документ.МассоваяРассылка.Форма.РассылкаСервиса";
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормыРассылки, ПараметрыРассылки);
	 
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента УсловияПредоставления формы.
//
&НаКлиенте
Процедура УсловияПредоставленияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ОбновитьТЧУсловий();
	ОбновитьОбщееКоличествоУсловий();
	ОбновитьАвтонаименование(Истина);
	ОбновитьВидимостьПромокодов();
	ПроверитьНаличиеУсловийНаВидОплаты();
	УстановитьДоступностьКратности();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструкциюРасширение(Команда = Неопределено)
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ИдентификаторАвтоматическойСкидки", Объект.ИдентификаторДляРасчетаВРасширении);
		ОткрытьФорму("ОбщаяФорма.ПомощникПодключенияПроцедурыРасширения", ПараметрыОткрытия, , , , , ,
			РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
КонецПроцедуры
#КонецОбласти

