Функция РеквизитыПодчиненнойФормы(ИмяФормы) Экспорт
	
	// BSLLS:GetFormMethod-off
	Форма = ПолучитьФорму(ИмяФормы, Новый Структура("ФормаБезОбработки"));
	
	Возврат Форма.ОписаниеРеквизитовФормы();
	
КонецФункции

Функция ПолучитьАдресаДоставки(ИдентификаторФормы, ЗначениеОтбора) Экспорт
	
	Возврат ОбменСГИСЭПДКлиентСервер.ПолучитьАдресаДоставки(ЗначениеОтбора);
	
КонецФункции

// Возвращает цвет выделения участника ЭПД.
// 
// Возвращаемое значение:
//  Цвет - цвет выделения участника ЭПД
//
Функция ЦветВыделенияУчастникаЭПД() Экспорт
	
	Возврат ОбменСГИСЭПДВызовСервера.ЦветВыделенияУчастникаЭПД();
	
КонецФункции