
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установим настройки формы для случая открытия в режиме выбора
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Элементы.Список.МножественныйВыбор = ?(Параметры.ЗакрыватьПриВыборе = Неопределено, 
		Ложь, 
		Не Параметры.ЗакрыватьПриВыборе);
		
	Если Параметры.РежимВыбора Тогда
		КлючНазначенияИспользования = "ВыборПодбор";
		РежимБлокировкиПриОткрытииОкна = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	Иначе
		КлючНазначенияИспользования = "Список";
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
	// УНФ.ОтборыСписка
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, 
		Список, , , Новый Структура("ОтборПериод", "ДатаФормирования"));
	// Конец УНФ.ОтборыСписка
	
	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Элементы.ОтборИерархияКонтекстноеМенюИерархияВключаяВложенные.Пометка = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(
		ИмяФормы, "ВключаяВложенные", Ложь);
		
	ПрочитатьИерархию();
	
	Список.Параметры.УстановитьЗначениеПараметра("НеСформирован", НСтр("ru = 'Не сформирован'"));
	Список.Параметры.УстановитьЗначениеПараметра("УспешноСформирован", НСтр("ru = 'Сформирован успешно'")); 
	Список.Параметры.УстановитьЗначениеПараметра("КомандаСформировать", НСтр("ru = 'Сформировать'"));
	Список.Параметры.УстановитьЗначениеПараметра("КомандаСоставСегмента", НСтр("ru = 'Состав сегмента'"));
	
	ЗаполнитьСписокВыбораЭлементов();

	УстановитьУсловноеОформление();
	
	АдаптацияТакси();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СегментКонтрагентовГруппа" Тогда
		НоваяГруппа = Неопределено;
		Если ТипЗнч(Параметр) = Тип("Массив") И Параметр.Количество() <> 0 Тогда
			НоваяГруппа = Параметр[0];
		ИначеЕсли ЗначениеЗаполнено(Параметр) Тогда
			НоваяГруппа = Параметр;
		Иначе
			НоваяГруппа = Неопределено;
		КонецЕсли;
		
		ПрочитатьИерархию(НоваяГруппа);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	//УНФ.ОтборыСписка  
	СохранитьНастройкиОтборов();
	//Конец УНФ.ОтборыСписка
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСтатусФормированияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("СтатусФормирования", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаТаксиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "ДатаПоследнегоФормирования");

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "ДатаПоследнегоФормирования");
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СвернутьРазвернутьПанельОтборов();
	
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокИерархияНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Группы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КомандаФормированияСегмента" Тогда
		
		СтандартнаяОбработка = Ложь;
		СформироватьСегментНаКлиенте();
		
	ИначеЕсли Поле.Имя = "КомандаСоставСегмента" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьСоставСегментаНаКлиенте();
		
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборИерархия

&НаКлиенте
Процедура ОтборИерархияПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборПоИерархии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИерархияНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	
	СтрокаИерархии = ОтборИерархия.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
	Если СтрокаИерархии = Неопределено
		Или СтрокаИерархии.ГруппаСегментов = "Все"
		Или СтрокаИерархии.ГруппаСегментов = "БезГруппы" Тогда
		
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	
	ПараметрыПеретаскивания.Значение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаИерархии.ГруппаСегментов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИерархияПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если Строка = Неопределено Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	СтрокаИерархии = ОтборИерархия.НайтиПоИдентификатору(Строка);
	Если СтрокаИерархии = Неопределено Или СтрокаИерархии.ГруппаСегментов = "Все" Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	ПараметрыПеретаскивания.ДопустимыеДействия	= ДопустимыеДействияПеретаскивания.Перемещение;
	ПараметрыПеретаскивания.Действие			= ДействиеПеретаскивания.Перемещение;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИерархияПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Массив")
		Или ПараметрыПеретаскивания.Значение.Количество() = 0
		Или ТипЗнч(ПараметрыПеретаскивания.Значение[0]) <> Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
		
		Возврат;
	КонецЕсли;
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаИерархии = ОтборИерархия.НайтиПоИдентификатору(Строка);
	Если СтрокаИерархии = Неопределено Или СтрокаИерархии.ГруппаСегментов = "Все" Тогда
		Возврат;
	КонецЕсли;
	
	НоваяГруппа = ?(СтрокаИерархии.ГруппаСегментов = "БезГруппы", 
		ПредопределенноеЗначение("Справочник.СегментыКонтрагентов.ПустаяСсылка"), 
		СтрокаИерархии.ГруппаСегментов);
	ИерархияПеретаскиваниеСервер(ПараметрыПеретаскивания.Значение, НоваяГруппа);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИерархияПриНаведении(Элемент, Строка, Поле)
	
	РаботаСОтборамиКлиент.ИерархияПриНаведении(
	Элемент, ЭтотОбъект, Строка, Тип("СправочникСсылка.СегментыКонтрагентов"), "ГруппаСегментов");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИерархияИзменить(Команда)
	
	Если Элементы.ОтборИерархия.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов) <> Тип("СправочникСсылка.СегментыКонтрагентов")
		Или Не ЗначениеЗаполнено(Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов) Тогда
		
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(Неопределено, Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов);
	
КонецПроцедуры

&НаКлиенте
Процедура ИерархияСоздатьГруппу(Команда)
	
	Если Элементы.ОтборИерархия.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	Если ТипЗнч(Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
		ЗначенияЗаполнения.Вставить("Родитель", Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов);
	КонецЕсли;
	
	СтруктураЗначенияЗаполнения = Новый Структура("ЗначенияЗаполнения, ЭтоГруппа", ЗначенияЗаполнения, Истина);
	ОткрытьФорму("Справочник.СегментыКонтрагентов.ФормаГруппы",
		СтруктураЗначенияЗаполнения,
		Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ИерархияСкопировать(Команда)
	
	Если Элементы.ОтборИерархия.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов) <> Тип("СправочникСсылка.СегментыКонтрагентов")
		Или Не ЗначениеЗаполнено(Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов) Тогда
		
		Возврат;
	КонецЕсли;
	
	СтруктураЗначенияЗаполнения =	Новый Структура("ЗначениеКопирования, ЭтоГруппа", 
		Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов, Истина);
		
	ОткрытьФорму("Справочник.СегментыКонтрагентов.ФормаГруппы", СтруктураЗначенияЗаполнения, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ИерархияУстановитьПометкуУдаления(Команда)
	
	Если Элементы.ОтборИерархия.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов) <> Тип("СправочникСсылка.СегментыКонтрагентов")
		Или Не ЗначениеЗаполнено(Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов) Тогда
		
		Возврат;
	КонецЕсли;
	
	ПометкаУдаления = ИзменитьПометкуУдаленияГруппыСервер(Элементы.ОтборИерархия.ТекущиеДанные.ПолучитьИдентификатор());
	СтрокаУточнения = ?(ПометкаУдаления, НСтр("ru='установлена'"), НСтр("ru='снята'"));
	ТекстОповещения = СтрШаблон(НСтр("ru='Пометка удаления %1'"), СтрокаУточнения);
	НавигационнуюСсылкаСегмента = ПолучитьНавигационнуюСсылку(Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов);
	
	ПоказатьОповещениеПользователя(
		ТекстОповещения,
		НавигационнуюСсылкаСегмента,
		Элементы.ОтборИерархия.ТекущиеДанные.ГруппаСегментов,
		БиблиотекаКартинок.Информация32);
		
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ИерархияВключаяВложенные(Команда)
	
	Элементы.ОтборИерархияКонтекстноеМенюИерархияВключаяВложенные.Пометка = 
		Не Элементы.ОтборИерархияКонтекстноеМенюИерархияВключаяВложенные.Пометка;
	УстановитьОтборПоИерархии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСегмент(Команда)
	
	СформироватьСегментНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоставСегмента(Команда)
	
	ОткрытьСоставСегментаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоГруппСегментов(Команда)
	
	РазвернутьДеревоГруппСегментовКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоГруппСегментов(Команда)
	
	СвернутьДеревоГруппСегментовКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВИерархии(Команда)

	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.СписокПерейтиВИерархии,
		"Нажатие");
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не Элементы.ПраваяПанельСтраницы.Видимость Тогда
		СвернутьРазвернутьПанельОтборов();
	КонецЕсли;
	
	ПараметрыПерехода = РаботаСОтборамиКлиентСервер.ПараметрыПереходаВИерархии();
	ПараметрыПерехода.ИмяКолонкиИерархии = "ГруппаСегментов";
	ПараметрыПерехода.ИмяСтраницыИерархии = "Группы";
	ПараметрыПерехода.ЗначениеЭлементаСпискаБезРодителя = ПредопределенноеЗначение("Справочник.СегментыКонтрагентов.ПустаяСсылка");

	РаботаСОтборамиКлиент.ПерейтиВВИерархии(ЭтотОбъект, ТекущиеДанные.Родитель, ПараметрыПерехода);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Иерархия

&НаСервере
Процедура ПрочитатьИерархию(ГруппаТекущейСтроки = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА Сегменты.ПометкаУдаления
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИндексПиктограммы,
		|	Сегменты.Ссылка КАК ГруппаСегментов,
		|	ПРЕДСТАВЛЕНИЕ(Сегменты.Ссылка) КАК ПредставлениеГруппы
		|ИЗ
		|	Справочник.СегментыКонтрагентов КАК Сегменты
		|ГДЕ
		|	Сегменты.ЭтоГруппа = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сегменты.Ссылка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(Дерево, "ОтборИерархия");
	
	ИдентификаторСтроки = Неопределено;
	Если ГруппаТекущейСтроки <> Неопределено Тогда
		ИдентификаторСтроки = ИдентификаторСтрокиДереваПоЗначению(ОтборИерархия, ГруппаТекущейСтроки);
	КонецЕсли;
	
	Если ИдентификаторСтроки <> Неопределено Тогда
		Элементы.ОтборИерархия.ТекущаяСтрока = ИдентификаторСтроки;
	КонецЕсли;
	
	ЭлементыКоллекции = ОтборИерархия.ПолучитьЭлементы();
	
	СтрокаДерева = ЭлементыКоллекции.Вставить(0);
	СтрокаДерева.ИндексПиктограммы = -1;
	СтрокаДерева.ГруппаСегментов = "Все";
	СтрокаДерева.ПредставлениеГруппы = НСтр("ru='<Все группы>'");
	
	СтрокаДерева = ЭлементыКоллекции.Добавить();
	СтрокаДерева.ИндексПиктограммы = -1;
	СтрокаДерева.ГруппаСегментов = "БезГруппы";
	СтрокаДерева.ПредставлениеГруппы = НСтр("ru='<Нет группы>'");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоИерархии(Форма)
	
	РаботаСОтборамиКлиент.УстановитьОтборПоИерархии(ЭтотОбъект, Тип("СправочникСсылка.СегментыКонтрагентов"),
		ПредопределенноеЗначение("Справочник.СегментыКонтрагентов.ПустаяСсылка"), "ГруппаСегментов");	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьПометкуУдаления(Сегмент)
	
	СегментОбъект = Сегмент.ПолучитьОбъект();
	СегментОбъект.УстановитьПометкуУдаления(Не СегментОбъект.ПометкаУдаления, Истина);
	
	Возврат СегментОбъект.ПометкаУдаления;
	
КонецФункции

&НаСервере
Функция ИзменитьПометкуУдаленияГруппыСервер(ИдентификаторТекущейСтроки)
	
	ТекущаяСтрокаДерева = ОтборИерархия.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	ПометкаУдаления = ИзменитьПометкуУдаления(ТекущаяСтрокаДерева.ГруппаСегментов);
	ИзменитьПиктограммуРекурсивно(ТекущаяСтрокаДерева, ПометкаУдаления);
	
	Возврат ПометкаУдаления;
	
КонецФункции

&НаСервере
Процедура ИзменитьПиктограммуРекурсивно(СтрокаДерева, ПометкаУдаления)
	
	СтрокаДерева.ИндексПиктограммы = ?(ПометкаУдаления, 1, 0);
	
	СтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
	Для Каждого СтрокаПодчиненная Из СтрокиДерева Цикл
		ИзменитьПиктограммуРекурсивно(СтрокаПодчиненная, ПометкаУдаления);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИерархияПеретаскиваниеСервер(МассивСегментов, НоваяГруппа)
	
	УстановитьНовуюГруппуСегментов(МассивСегментов, НоваяГруппа);
	
	Если МассивСегментов[0].ЭтоГруппа Тогда
		
		ПрочитатьИерархию();
		
		ИдентификаторСтроки = 0;
		ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля(
			"ГруппаСегментов",
			ИдентификаторСтроки,
			ОтборИерархия.ПолучитьЭлементы(),
			МассивСегментов[0],
			Ложь);
		Элементы.ОтборИерархия.ТекущаяСтрока = ИдентификаторСтроки;
		
	Иначе
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьНовуюГруппуСегментов(МассивСегментов, НоваяГруппа)
	
	Для Каждого Сегмент Из МассивСегментов Цикл
		СегментОбъект = Сегмент.ПолучитьОбъект();
		СегментОбъект.Заблокировать();
		СегментОбъект.Родитель = НоваяГруппа;
		СегментОбъект.Записать();
		СегментОбъект.Разблокировать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ИдентификаторСтрокиДереваПоЗначению(Коллекция, ИскомоеЗначение)
	
	КоллекцияЭлементов = Коллекция.ПолучитьЭлементы();
	
	Для каждого Элемент Из КоллекцияЭлементов Цикл
		
		Если Элемент.ГруппаСегментов = ИскомоеЗначение Тогда
			Возврат Элемент.ПолучитьИдентификатор();
		КонецЕсли;
		
		Идентификатор = ИдентификаторСтрокиДереваПоЗначению(Элемент, ИскомоеЗначение);
		
		Если Идентификатор <> Неопределено Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура СохранитьНастройкиОтборов()

	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(ИмяФормы,
		"ВключаяВложенные", Элементы.ОтборИерархияКонтекстноеМенюИерархияВключаяВложенные.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСегментНаКлиенте()
	
	ВыделенныйСегмент = Элементы.Список.ТекущиеДанные.Ссылка;
	РезультатФоновогоЗадания = ФоновоеЗаданиеЗапустить();
	
	Если РезультатФоновогоЗадания = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		ПоказатьОшибкиФормирования(РезультатФоновогоЗадания);
	ИначеЕсли РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда 
		ОперацииПослеФормирования();
	Иначе
		Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеВыполнено", ЭтотОбъект, Истина);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Сегмент формируется...'");
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Обработчик, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоставСегментаНаКлиенте()
	
	ВыделенныйСегмент = Элементы.Список.ТекущиеДанные.Ссылка;
	ПараметрыИОтборОтчета = Новый Структура("СегментКонтрагентов", ВыделенныйСегмент);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "СоставСегментаКонтрагентов");
	ПараметрыФормы.Вставить("Отбор", ПараметрыИОтборОтчета);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ОткрытьФорму("Отчет.СоставСегмента.Форма", ПараметрыФормы, , Истина);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	ИнтерфейсТакси = Не ЭтоВариантИнтерфейса85;
	
	Элементы.ИндексФильтры.Видимость = Не ИнтерфейсТакси;
	Элементы.ИндексФильтрыТакси.Видимость = ИнтерфейсТакси;
	Элементы.ПредставлениеПериода.Видимость = Не ИнтерфейсТакси;
	Элементы.ПредставлениеПериодаТакси.Видимость = ИнтерфейсТакси;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандаФормированияСегмента", "Видимость",
		ИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандаСоставСегмента", "Видимость",
		ИнтерфейсТакси);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокСформироватьСегмент", "Видимость",
		Не ИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокОткрытьСоставСегмента", "Видимость",
		Не ИнтерфейсТакси);
		
	Если ИнтерфейсТакси Тогда
		Элементы.Переместить(Элементы.СписокГруппаПерейтиВИерархии, КоманднаяПанель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Если Не ЭтоВариантИнтерфейса85 Тогда
		
		УсловноеОформление.Элементы.Очистить();
		
		НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
		РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Список.ЭтоГруппа", Истина,
		ВидСравненияКомпоновкиДанных.Равно);
		
		РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, Элементы.КомандаФормированияСегмента.Имя);
		РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, Элементы.КомандаСоставСегмента.Имя);
		РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоказатьОшибкиФормирования(Знач ДанныеОшибки)
	
	Если ТипЗнч(ДанныеОшибки) = Тип("Структура") Тогда
		ПодробноеПредставлениеОшибки = ДанныеОшибки.ПодробноеПредставлениеОшибки;
	Иначе
		ПодробноеПредставлениеОшибки = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ПодробноеПредставлениеОшибки) Тогда
		Возврат;
	КонецЕсли;
	
	Уровень = УровеньЖурналаРегистрации.Ошибка;
	ИмяСобытия = НСтр("ru = 'Формирование сегмента контрагентов'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень,,ВыделенныйСегмент,
			ПодробноеПредставлениеОшибки);
			
	ВызватьИсключение ПодробноеПредставлениеОшибки;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораЭлементов()
	
	Элементы.ОтборСтатусФормирования.СписокВыбора.Очистить();
	Элементы.ОтборСтатусФормирования.СписокВыбора.Добавить(НСтр("ru = 'Не сформирован'"),
		НСтр("ru = 'Не сформирован'"));
	Элементы.ОтборСтатусФормирования.СписокВыбора.Добавить(НСтр("ru = 'Сформирован успешно'"),
		НСтр("ru = 'Сформирован успешно'"));
		
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеВыполнено(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
			
	ОперацииПослеФормирования();
	
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеЗапустить()
	
	Попытка
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		
		ПараметрыФормированияСегмента = Новый Структура;
		
		ПараметрыФормированияСегмента.Вставить("Сегмент", ВыделенныйСегмент);	
		
		РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
			"РаботаССегментами.СформироватьСоставСегментаВФоне", ПараметрыФормированияСегмента,
			ПараметрыВыполнения);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке(); 
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОперацииПослеФормирования()
	
	РассчитатьКоличествоКонтрагентовВСегменте();
	СтрокаШаблон = НСтр("ru = 'Сегмент успешно сформирован. Подобрано по правилам: %1, добавлено вручную: %2'");
	СтрокаСообщение = СтрШаблон(СтрокаШаблон, КоличествоКонтрагентовПоПравилам, КоличествоКонтрагентовВручную);
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщение);	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьКоличествоКонтрагентовВСегменте()
	КоличествоКонтрагентовВручную = СоставСегментаВручную().Количество();
	КоличествоКонтрагентовПоПравилам = СоставСегментаПоПравилам().Количество()
КонецПроцедуры

&НаСервере
Функция СоставСегментаПоПравилам()
	Возврат Справочники.СегментыКонтрагентов.ПолучитьСоставСегмента(ВыделенныйСегмент, 
		Перечисления.СпособыДобавленияВСегмент.ПоПравилам);
КонецФункции

&НаСервере
Функция СоставСегментаВручную()
	Возврат Справочники.СегментыКонтрагентов.ПолучитьСоставСегмента(ВыделенныйСегмент, 
		Перечисления.СпособыДобавленияВСегмент.Вручную);
КонецФункции

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ПредставлениеЗначения = "" Тогда
		ПредставлениеЗначения = Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, 
		ИмяПоляОтбораСписка, 
		ГруппаРодительМетки, 
		ВыбранноеЗначение, 
		ПредставлениеЗначения);
		
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, ИмяПоляОтбораСписка, , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, 
		СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, МеткаИД);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоГруппСегментовКлиент()
	
	ЭлементыДереваДокументов = ОтборИерархия.ПолучитьЭлементы();
	ЭлементФормы = Элементы.ОтборИерархия;
	
	Для Каждого ЭлементДерева Из ЭлементыДереваДокументов Цикл
		СвернутьВеткуДереваГруппКатегорий(ЭлементФормы, ЭлементДерева);
		ЭлементФормы.Свернуть(ЭлементДерева.ПолучитьИдентификатор());
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоГруппСегментовКлиент()
	
	ЭлементыДереваДокументов = ОтборИерархия;
	ЭлементФормы = Элементы.ОтборИерархия;
	
	РазвернутьВеткуДереваГруппКатегорий(ЭлементФормы, ЭлементыДереваДокументов);
	
КонецПроцедуры

&НаКлиенте
// Процедура рекурсивно сворачивает дерево значений.
//
Процедура СвернутьВеткуДереваГруппКатегорий(ЭлементФормы, Дерево)
	
	Для Каждого Элемент Из Дерево.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки=Элемент.ПолучитьИдентификатор();
		ЭлементФормы.Свернуть(ИдентификаторСтроки);
		СвернутьВеткуДереваГруппКатегорий(ЭлементФормы, Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура рекурсивно разворачивает дерево значений.
//
Процедура РазвернутьВеткуДереваГруппКатегорий(ЭлементФормы, Дерево)
	
	Для Каждого Элемент Из Дерево.ПолучитьЭлементы() Цикл
		
		ИдентификаторСтроки=Элемент.ПолучитьИдентификатор();
		ЭлементФормы.Развернуть(ИдентификаторСтроки);
		РазвернутьВеткуДереваГруппКатегорий(ЭлементФормы, Элемент);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
