
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаНаОбъект = Параметры.СсылкаНаОбъект;
	ТекстСообщения = Параметры.ТекстСообщения;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		Элементы.Информация.Заголовок = ТекстСообщения;
	Иначе
		Элементы.Информация.Заголовок = СтрШаблон(Элементы.Информация.Заголовок, СсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти