
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент = Параметры.Контрагент;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязиКонтрагентКонтактСрезПервых.Контакт КАК КонтаткноеЛицо,
	|	СвязиКонтрагентКонтактСрезПервых.Порядок КАК Порядок,
	|	СвязиКонтрагентКонтактСрезПоследних.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПервых(, Контрагент = &Владелец) КАК СвязиКонтрагентКонтактСрезПервых
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних КАК СвязиКонтрагентКонтактСрезПоследних
	|		ПО СвязиКонтрагентКонтактСрезПервых.Контакт = СвязиКонтрагентКонтактСрезПоследних.Контакт
	|			И СвязиКонтрагентКонтактСрезПервых.Контрагент = СвязиКонтрагентКонтактСрезПоследних.Контрагент
	|ГДЕ
	| 	СвязиКонтрагентКонтактСрезПоследних.СвязьНедействительна = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
    Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	КонтактныеЛица.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	Изменено = Истина;
	
	ТекДанные = Элементы.КонтактныеЛица.ТекущиеДанные; 
	Индекс = КонтактныеЛица.Индекс(ТекДанные);
 	ПорядокКЛ = КонтактныеЛица[Индекс].Порядок;
	Если Индекс = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КонтактныеЛица[Индекс].Порядок = 
		КонтактныеЛица[Индекс - 1].Порядок;
	КонтактныеЛица[Индекс - 1].Порядок = ПорядокКЛ;
	КонтактныеЛица.Сортировать("Порядок Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	Изменено = Истина;

	ТекДанные = Элементы.КонтактныеЛица.ТекущиеДанные; 
	Индекс = КонтактныеЛица.Индекс(ТекДанные);  
	Если Индекс + 1 = КонтактныеЛица.Количество() Тогда
		Возврат;
	КонецЕсли;
	
 	ПорядокКЛ = КонтактныеЛица[Индекс].Порядок;  
	КонтактныеЛица[Индекс].Порядок = 
		КонтактныеЛица[Индекс + 1].Порядок;
	КонтактныеЛица[Индекс + 1].Порядок = ПорядокКЛ;
	КонтактныеЛица.Сортировать("Порядок Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПорядок(Команда)
	
	Если Изменено = Истина Тогда
		УстановитьПорядокНаСервере();
	КонецЕсли;	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПорядокНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ДанныеКЛ Из КонтактныеЛица Цикл
		КонтактноеЛицоОбъект = ДанныеКЛ.КонтаткноеЛицо.ПолучитьОбъект();
		КонтактноеЛицоОбъект.ДополнительныеСвойства.Вставить("СвязьСКонтрагентом", 
			Новый Структура("Контрагент,Должность,Порядок", Контрагент, ДанныеКЛ.Должность, ДанныеКЛ.Порядок));
		КонтактноеЛицоОбъект.Записать();
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти
