
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиУНФ.ЗаполнитьДополнительныеПараметры(Объект,
		"ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	НаборСвойств_Справочник_Проекты = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Проекты");
	// Конец СтандартныеПодсистемы.Свойства
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	ВосстановитьНастройкиФормы();
	
	ДоступныДоходыИРасходы = ПравоДоступа("Просмотр", Метаданные.Отчеты.ДоходыИРасходы)
							И ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ДоходыИРасходы);
	ДоступенДенежныйПоток = ПравоДоступа("Просмотр", Метаданные.Отчеты.ДвижениеДенежныхСредствПоПроектам)
							И ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ДвиженияДенежныхСредств); 
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	Если ДоступныДоходыИРасходы ИЛИ ДоступенДенежныйПоток Тогда
		
		Если Не ДоступныДоходыИРасходы Тогда
			Элементы.СтраницаДоходыРасходы.Видимость = Ложь;
			ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток;
			СохранитьНастройкиФормы(ВидФинансовогоОтчета);
		КонецЕсли;
		
		Если Не ДоступенДенежныйПоток Тогда
			Элементы.СтраницаДенежныйПоток.Видимость = Ложь;
			ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы;
			СохранитьНастройкиФормы(ВидФинансовогоОтчета);
		КонецЕсли;
		
		Если Объект.Ссылка.Пустая() Тогда
			Элементы.СтраницыДоходыРасходы.ТекущаяСтраница = Элементы.СтраницаДоходыРасходыДанные;
			Элементы.СтраницыДенежныйПоток.ТекущаяСтраница = Элементы.СтраницаДенежныйПотокДанные;
			ЗаполнитьДиаграммыТестовымиЗначениями(Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы);
			ЗаполнитьДиаграммыТестовымиЗначениями(Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток);
		Иначе
			РезультатФоновогоЗадания = ЗапуститьФоновоеЗадание();
		КонецЕсли;
	Иначе
		Элементы.СтраницаДоходыРасходы.Видимость = Ложь;
		Элементы.СтраницаДенежныйПоток.Видимость = Ложь;
		Элементы.СтраницыФормы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	БылаПерестроенаКольцеваяДиаграммаДР = Ложь;
	БылаПерестроенаКольцеваяДиаграммаДП = Ложь;
	
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	Если ДоступныДоходыИРасходы ИЛИ ДоступенДенежныйПоток Тогда
		ПроверитьФоновоеЗадание();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("МодифицированностьВФорме",Модифицированность);
	// Конец Обсуждения
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	//Обсуждения
	ОбсужденияУНФ.ПослеЗаписиНаСервере(ТекущийОбъект);	
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПоказатьПодтверждениеЗакрытияФормыСФайлами(ЭтотОбъект, Отказ, ЗавершениеРаботы, Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоступленияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиКОтчету();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбытияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиКОтчету();
	
КонецПроцедуры

&НаКлиенте
Процедура ЧистыйДенежныйПотокНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиКОтчету();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСброситьВыборДенежныйПотокНажатие(Элемент)
	
	ОбновитьДиаграмммыНаКлиенте(ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДенежныйПоток"));
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыФормыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаДоходыРасходы Тогда
		ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы");
	Иначе
		ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДенежныйПоток");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСброситьВыборДоходыРасходыНажатие(Элемент)
	
	ОбновитьДиаграмммыНаКлиенте(ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы"));
	
КонецПроцедуры

&НаКлиенте
Процедура РасходНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиКОтчету();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрибыльНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиКОтчету();
	
КонецПроцедуры

&НаКлиенте
Процедура РентабельностьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиКОтчету();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиКОтчету();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	СтруктураДанных = ПолучитьДанныеКонтрагентПриИзменении(Объект.Контрагент);
	Объект.Договор = СтруктураДанных.Договор;
	
КонецПроцедуры

&НаКлиенте
Процедура ГистограммаДПВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	ДиаграммаВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГистограммаДРВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	ДиаграммаВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДиаграммы(Команда)
	
	РезультатФоновогоЗадания = ЗапуститьФоновоеЗадание();
	ПроверитьФоновоеЗадание();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДополнительныйРеквизит(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", НаборСвойств_Справочник_Проекты);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта", ПараметрыФормы, , , , , ,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДиаграммаВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)	
	
	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда 
		Период = СписокДатИзГистограммыДР.НайтиПоЗначению(ЗначениеДиаграммы.Точка.Значение); 
		ТипПериода = ТипПериодаДР;
	Иначе
		Период = СписокДатИзГистограммыДП.НайтиПоЗначению(ЗначениеДиаграммы.Точка.Значение); 
		ТипПериода = ТипПериодаДП;
	КонецЕсли;
	
	Если ТипПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		ПерестроитьГистограммуКМесяцам(Период.Значение, Ложь);
	ИначеЕсли ТипПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		ПерестроитьГистограммуКМесяцам(Период.Значение, Истина);
	Иначе
		ПерестроитьКольцевуюДиаграмму(Период.Значение, ЗначениеДиаграммы.Серия.Значение);
		Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда 
			СписокДатИзГистограммыДР.Добавить(Период.Значение, Период.Представление);
		Иначе
			СписокДатИзГистограммыДП.Добавить(Период.Значение, Период.Представление);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиФормы(ВидФинансовогоОтчета)
	
	НастройкиФормы = Справочники.Проекты.ИнициализироватьНастройкиФормы();
	НастройкиФормы.ВидФинансовогоОтчета = ВидФинансовогоОтчета; 
	
	Справочники.Проекты.СохранитьНастройкиФормы(НастройкиФормы);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()
	
	НастройкиФормы = Справочники.Проекты.ИнициализироватьНастройкиФормы();
	Справочники.Проекты.ВосстановитьНастройкиФормы(НастройкиФормы);
	
	ВидФинансовогоОтчета = НастройкиФормы.ВидФинансовогоОтчета;
	
КонецПроцедуры

// Функция готовит и возвращает структуру с данными контрагента
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеКонтрагентПриИзменении(Контрагент)
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Договор", Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент));
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьФоновоеЗадание()
	
	Если РезультатФоновогоЗадания <> Неопределено Тогда
		Если РезультатФоновогоЗадания.Статус = "Выполняется" Тогда
			Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеВыполнено", ЭтотОбъект);
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.Вставить("ВыводитьОкноОжидания", Ложь);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания,Обработчик,ПараметрыОжидания);
		ИначеЕсли РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
			Элементы.СтраницыДоходыРасходы.ТекущаяСтраница = Элементы.СтраницаДоходыРасходыДанные;
			Элементы.СтраницыДенежныйПоток.ТекущаяСтраница = Элементы.СтраницаДенежныйПотокДанные;
			ЗаполнитьДанныеТаблиц(РезультатФоновогоЗадания.АдресРезультата);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗадание()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ДатаНачала = НачалоМесяца(ПолучитьДатуНачала(Объект.ДатаНачала));
	ДатаОкончания = ПолучитьДатуОкончания(Объект.ДатаОкончания,ТекущаяДатаСеанса());
	
	РезультатДлительнойОперации = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,"Справочники.Проекты.ОбъединитьРезультаты",
		Объект.Ссылка,ДатаНачала,ДатаОкончания,ДоступныДоходыИРасходы, ДоступенДенежныйПоток);
	
	Возврат РезультатДлительнойОперации;
	
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаданиеВыполнено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		Элементы.СтраницыДоходыРасходы.ТекущаяСтраница = Элементы.СтраницаДоходыРасходыДанные;
		Элементы.СтраницыДенежныйПоток.ТекущаяСтраница = Элементы.СтраницаДенежныйПотокДанные;
		ЗаполнитьДанныеТаблиц(Результат.АдресРезультата);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТаблиц(АдресРезультата)
	
	ТаблицыСАналитикой = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТаблицыСАналитикой.Свойство("ДоходыИРасходы") Тогда	
		
		ДоходыИРасходы.Загрузить(ТаблицыСАналитикой.ДоходыИРасходы); 
		ОбновитьИтоги(Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы);
		Если ЗначениеЗаполнено(ДоходыИРасходы) Тогда
			ЗаполнитьДиаграммы(Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы, Истина);
		Иначе
			ЗаполнитьДиаграммыТестовымиЗначениями(Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы);
		КонецЕсли; 
	КонецЕсли;
	
	Если ТаблицыСАналитикой.Свойство("ДенежныйПоток") Тогда	
		
		ДенежныйПоток.Загрузить(ТаблицыСАналитикой.ДенежныйПоток);
		ОбновитьИтоги(Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток);
		
		Если ЗначениеЗаполнено(ДенежныйПоток) Тогда
			ЗаполнитьДиаграммы(Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток, Истина);
		Иначе
			ЗаполнитьДиаграммыТестовымиЗначениями(Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммы(ВидФинансовогоОтчета, ОбновитьГраницыЗаголовка)
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		КольцеваяДиаграмма = КольцеваяДиаграммаДР;
		Гистограмма = ГистограммаДР;
		ДанныеТаблицы = ДоходыИРасходы.Выгрузить();
		СписокДатИзГистограммы = СписокДатИзГистограммыДР;
		ЗаголовокКольцевойДиаграммы = Элементы.ДекорацияЗаголовокДоходыРасходы;
		ДекорацияСброс = Элементы.ДекорацияСброситьВыборДоходыРасходы;
	Иначе
		КольцеваяДиаграмма = КольцеваяДиаграммаДП;
		Гистограмма = ГистограммаДП;  
		ДанныеТаблицы = ДенежныйПоток.Выгрузить();
		СписокДатИзГистограммы = СписокДатИзГистограммыДП;
		ЗаголовокКольцевойДиаграммы = Элементы.ДекорацияЗаголовокДенежныйПоток;
		ДекорацияСброс = Элементы.ДекорацияСброситьВыборДенежныйПоток;
	КонецЕсли;
	
	СписокДатИзГистограммы.Очистить();
	МаксЗначениеШкалы = 0;
	СерияДоходы = Гистограмма.УстановитьСерию(ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета));
	СерияДоходы.Цвет = ЦветаСтиля.ЦветДоходаВПроекте;
	СерияРасходы = Гистограмма.УстановитьСерию(ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета));
	СерияРасходы.Цвет = ЦветаСтиля.ЦветРасходаВПроекте;
	КольцеваяДиаграмма.ОтображатьЛегенду = Ложь;
	ЗаголовокКольцевойДиаграммы.Заголовок = ПолучитьЗаголовокДиаграммы(ВидФинансовогоОтчета);
	ДекорацияСброс.Видимость = Ложь;
	
	ДатаНачала = ПолучитьДатуНачала(Объект.ДатаНачала, ДанныеТаблицы);
	ДатаОкончания = ПолучитьДатуОкончания(Объект.ДатаОкончания, ТекущаяДатаСеанса(), ДанныеТаблицы);
	
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Если КоличествоМесяцевМеждуДатами(ДатаНачала, ДатаОкончания) <= 12 Тогда
			Пока НачалоМесяца(ДатаНачала) <= ДатаОкончания Цикл
				Точка = Гистограмма.УстановитьТочку(ДатаНачала);
				Точка.Текст = ФорматированнаяДатаПоМесяцу(ДатаНачала);
				СписокДатИзГистограммы.Добавить(Точка.Значение, Точка.Текст);
				Результат = ПолучитьДанныеЗаМесяц(ДатаНачала, МаксЗначениеШкалы, ВидФинансовогоОтчета);
				ДатаНачала = ДобавитьМесяц(ДатаНачала,1);
				Если Результат.МаксимальноеЗначение > МаксЗначениеШкалы Тогда
					МаксЗначениеШкалы = Результат.МаксимальноеЗначение;
				КонецЕсли;
				Гистограмма.УстановитьЗначение(Точка, СерияДоходы,Результат.Доход);
				Гистограмма.УстановитьЗначение(Точка, СерияРасходы,Результат.Расход);
			КонецЦикла;
			ТипПериода = Перечисления.Периодичность.Месяц;
		ИначеЕсли КоличествоМесяцевМеждуДатами(ДатаНачала, ДатаОкончания) <= 36 Тогда
			Пока НачалоМесяца(ДатаНачала) <= ДатаОкончания Цикл
				ТекКвартал = ФорматированнаяДатаПоКварталу(ДатаНачала);
				СписокДатИзГистограммы.Добавить(ДатаНачала, ТекКвартал);
				Точка = Гистограмма.УстановитьТочку(ДатаНачала);
				Точка.Текст = ФорматированнаяДатаПоКварталу(ТекКвартал);
				ДоходПоКварталу = 0;
				РасходПоКварталу = 0;
				Пока ФорматированнаяДатаПоКварталу(ДатаНачала) = ТекКвартал Цикл
					Результат = ПолучитьДанныеЗаМесяц(ДатаНачала, МаксЗначениеШкалы, ВидФинансовогоОтчета);
					ДоходПоКварталу = ДоходПоКварталу + Результат.Доход;
					РасходПоКварталу = РасходПоКварталу + Результат.Расход;
					Если Макс(ДоходПоКварталу, РасходПоКварталу) > МаксЗначениеШкалы Тогда
						МаксЗначениеШкалы = Макс(ДоходПоКварталу, РасходПоКварталу);
					КонецЕсли;
					Если НачалоМесяца(ДатаНачала) > ДатаОкончания Тогда
						Прервать;
					КонецЕсли;
					ДатаНачала = ДобавитьМесяц(ДатаНачала, 1);
				КонецЦикла;
				Гистограмма.УстановитьЗначение(Точка, СерияДоходы, ДоходПоКварталу);
				Гистограмма.УстановитьЗначение(Точка, СерияРасходы, РасходПоКварталу);
			КонецЦикла;
			ТипПериода = Перечисления.Периодичность.Квартал;
		Иначе
			Пока НачалоМесяца(ДатаНачала) <= ДатаОкончания Цикл
				ТекГод = ФорматированнаяДатаПоГоду(ДатаНачала);
				Точка = Гистограмма.УстановитьТочку(ДатаНачала);
				Точка.Текст = ТекГод;
				СписокДатИзГистограммы.Добавить(ДатаНачала, ТекГод);
				ДоходПоГоду = 0;
				РасходПоГоду = 0;
				Пока ФорматированнаяДатаПоГоду(ДатаНачала) = ТекГод Цикл
					Результат = ПолучитьДанныеЗаМесяц(ДатаНачала, МаксЗначениеШкалы, ВидФинансовогоОтчета);
					ДоходПоГоду = ДоходПоГоду + Результат.Доход;
					РасходПоГоду = РасходПоГоду + Результат.Расход;
					Если Макс(ДоходПоГоду, РасходПоГоду) > МаксЗначениеШкалы Тогда
						МаксЗначениеШкалы = Макс(ДоходПоГоду, РасходПоГоду);
					КонецЕсли;
					Если НачалоМесяца(ДатаНачала) > ДатаОкончания Тогда
						Прервать;
					КонецЕсли;
					ДатаНачала = ДобавитьМесяц(ДатаНачала, 1);
				КонецЦикла;
				Гистограмма.УстановитьЗначение(Точка, СерияДоходы, ДоходПоГоду);
				Гистограмма.УстановитьЗначение(Точка, СерияРасходы, РасходПоГоду);
			КонецЦикла;
			ТипПериода = Перечисления.Периодичность.Год;
		КонецЕсли;
	КонецЕсли;
	СуммаДоходов = ДанныеТаблицы.Итог("Доход");
	СуммаРасходов = ДанныеТаблицы.Итог("Расход");
	
	Гистограмма.ОсьЗначений.МаксимальноеЗначение = МаксЗначениеШкалы * 1.2;
	Гистограмма.ОсьЗначений.СпособОпределенияМаксимальногоЗначения = 
		СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
	
	Точка = КольцеваяДиаграмма.УстановитьТочку("");
	Серия = КольцеваяДиаграмма.УстановитьСерию(ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета));
	Серия.Цвет = ЦветаСтиля.ЦветДоходаВПроекте;
	КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СуммаДоходов);
	Серия = КольцеваяДиаграмма.УстановитьСерию(ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета));
	Серия.Цвет = ЦветаСтиля.ЦветРасходаВПроекте;
	КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СуммаРасходов);
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		
		ТипПериодаДР = ТипПериода;
		ОбновитьИтоги(Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы);
		
	Иначе
		
		ТипПериодаДП = ТипПериода;
		ОбновитьИтоги(Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток);
		
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаМесяц(ДатаНачала, МаксЗначениеШкалы, ВидФинансовогоОтчета)
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		СписокДатИзГистограммы = СписокДатИзГистограммыДР;
		ДанныеТаблицы = ДоходыИРасходы.Выгрузить();
	Иначе
		СписокДатИзГистограммы = СписокДатИзГистограммыДП;
		ДанныеТаблицы = ДенежныйПоток.Выгрузить();
	КонецЕсли;	
	
	МаксПоПериоду = МаксЗначениеШкалы;
	ДоходПоПериоду = 0;
	РасходПоПериоду = 0;	
	СтрокиИзПериода = ДанныеТаблицы.НайтиСтроки(Новый Структура("Период", НачалоМесяца(ДатаНачала)));
	Если СтрокиИзПериода.Количество() > 0 Тогда
		Для Каждого СтрокаТЗ Из СтрокиИзПериода Цикл
			Если СтрокаТЗ.Доход > 0 И СтрокаТЗ.Расход > 0 Тогда
				ДоходПоПериоду = ДоходПоПериоду + СтрокаТЗ.Доход;
				РасходПоПериоду = РасходПоПериоду + СтрокаТЗ.Расход;
			ИначеЕсли СтрокаТЗ.Доход > 0 Тогда
				ДоходПоПериоду = ДоходПоПериоду + СтрокаТЗ.Доход;
			ИначеЕсли СтрокаТЗ.Расход > 0 Тогда
				РасходПоПериоду = РасходПоПериоду + СтрокаТЗ.Расход;
			КонецЕсли;
			Если Макс(ДоходПоПериоду, РасходПоПериоду) > МаксПоПериоду Тогда
				МаксПоПериоду = Макс(ДоходПоПериоду, РасходПоПериоду);
			КонецЕсли;
		КонецЦикла;
		СписокДатИзГистограммы.Добавить(НачалоМесяца(ДатаНачала), ФорматированнаяДатаПоМесяцу(ДатаНачала));
	КонецЕсли;
	Результат = Новый Структура;
	Результат.Вставить("Доход", ДоходПоПериоду);
	Результат.Вставить("Расход", РасходПоПериоду);
	Результат.Вставить("МаксимальноеЗначение", МаксПоПериоду);
	Возврат Результат; 

КонецФункции

&НаСервере
Процедура ЗаполнитьДиаграммыТестовымиЗначениями(ВидФинансовогоОтчета)
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		Элементы.ГистограммаДР.ТолькоПросмотр = Истина;
		Элементы.КольцеваяДиаграммаДР.ТолькоПросмотр = Истина; 
		КольцеваяДиаграмма = КольцеваяДиаграммаДР;
		Гистограмма = ГистограммаДР;
	Иначе
		Элементы.ГистограммаДП.ТолькоПросмотр = Истина;
		Элементы.КольцеваяДиаграммаДП.ТолькоПросмотр = Истина;
		КольцеваяДиаграмма = КольцеваяДиаграммаДП;
		Гистограмма = ГистограммаДП;
	КонецЕсли;   	
	
	ГенераторЧисел = Новый ГенераторСлучайныхЧисел;
	СуммаДоходов = 0;
	СуммаРасходов = 0;
	
	КольцеваяДиаграмма.ОтображатьЛегенду = Ложь;
	
	СерияДоходы = Гистограмма.УстановитьСерию(ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета));
	СерияДоходы.Цвет = ЦветНетДанных(Ложь);
	СерияРасходы = Гистограмма.УстановитьСерию(ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета));
	СерияРасходы.Цвет = ЦветНетДанных(Истина);
	ТекДата = НачалоГода(ТекущаяДатаСеанса());
	
	МассивМесяцев = Новый Массив;
	
	Для НомерМесяца = 0 По 11 Цикл
		СтрокаСМесяцем = СтрШаблон("%1 %2",Лев(Формат(ТекДата,"ДФ=ММММ"),3), Формат(ТекДата,"ДФ=гг"));
		МассивМесяцев.Добавить(СтрокаСМесяцем);
		ТекДата = ДобавитьМесяц(ТекДата,1);
	КонецЦикла;
	
	Для Каждого Месяц Из МассивМесяцев Цикл
		Точка = Гистограмма.УстановитьТочку(Месяц);
		СлучайныйДоход = ГенераторЧисел.СлучайноеЧисло(5000, 100000);
		СлучайныйРасход = ГенераторЧисел.СлучайноеЧисло(5000, 100000);
		СуммаДоходов = СуммаДоходов + СлучайныйДоход;
		СуммаРасходов = СуммаРасходов + СлучайныйРасход;
		Гистограмма.УстановитьЗначение(Точка, СерияДоходы, СлучайныйДоход);
		Гистограмма.УстановитьЗначение(Точка, СерияРасходы, СлучайныйРасход);
	КонецЦикла;
	
	Точка = КольцеваяДиаграмма.УстановитьТочку("");
	Серия = КольцеваяДиаграмма.УстановитьСерию(ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета));
	Серия.Цвет = ЦветНетДанных(Ложь);
	КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СуммаДоходов);
	Серия = КольцеваяДиаграмма.УстановитьСерию(ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета));
	Серия.Цвет = ЦветНетДанных(Истина);
	КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СуммаРасходов);
	
КонецПроцедуры

&НаСервере
Процедура ПерестроитьКольцевуюДиаграмму(Период, ТипОборота)
	
	ДоходЗаПериод = 0;
	РасходЗаПериод = 0;
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		КольцеваяДиаграмма = КольцеваяДиаграммаДР;
		ДанныеТаблицы = ДоходыИРасходы.Выгрузить();
		ДекорацияЗаголовок = Элементы.ДекорацияЗаголовокДоходыРасходы;
		ДекорацияСбросить = Элементы.ДекорацияСброситьВыборДоходыРасходы;
	Иначе
		КольцеваяДиаграмма = КольцеваяДиаграммаДП;
		ДанныеТаблицы = ДенежныйПоток.Выгрузить();
		ДекорацияЗаголовок = Элементы.ДекорацияЗаголовокДенежныйПоток;
		ДекорацияСбросить = Элементы.ДекорацияСброситьВыборДенежныйПоток;
	КонецЕсли;
		
	КольцеваяДиаграмма.Очистить();
	
	ДекорацияЗаголовок.Заголовок = ЗаголовокКолцевойДиаграммыСОтбором(ТипОборота, НачалоМесяца(Период));
	ДекорацияСбросить.Видимость = Истина;
	
	КольцеваяДиаграмма.ОтображатьЛегенду = Истина;
	КольцеваяДиаграмма.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Право;
	
	СтрокиИзПериода = ДанныеТаблицы.НайтиСтроки(Новый Структура("Период", НачалоМесяца(Период)));
	Точка = КольцеваяДиаграмма.УстановитьТочку("");
	
	Для Каждого СтрокаТЗ Из СтрокиИзПериода Цикл
		Если ТипОборота = ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета) Тогда
			Если СтрокаТЗ.Доход > 0 Тогда
				Серия = КольцеваяДиаграмма.УстановитьСерию(СтрокаТЗ.Статья);
				КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СтрокаТЗ.Доход);
			КонецЕсли;
		Иначе
			Если СтрокаТЗ.Расход > 0 Тогда
				Серия = КольцеваяДиаграмма.УстановитьСерию(СтрокаТЗ.Статья);
				КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СтрокаТЗ.Расход);
			КонецЕсли;
		КонецЕсли;
		ДоходЗаПериод = ДоходЗаПериод + СтрокаТЗ.Доход;
		РасходЗаПериод = РасходЗаПериод + СтрокаТЗ.Расход;
	КонецЦикла;
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		БылаПерестроенаКольцеваяДиаграммаДР = Истина;
		ОбновитьИтоги(Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы);
	Иначе
		БылаПерестроенаКольцеваяДиаграммаДП = Истина;
		ОбновитьИтоги(Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерестроитьГистограммуКМесяцам(Период, ЭтоГод)

	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		Гистограмма = ГистограммаДР;
		ТипПериодаДР = Перечисления.Периодичность.Месяц;
	Иначе
		Гистограмма = ГистограммаДП; 
		ТипПериодаДП = Перечисления.Периодичность.Месяц;
	КонецЕсли;
	
	МаксЗначениеШкалы = 0;
	
	Гистограмма.Очистить();
	СерияДоходы = Гистограмма.УстановитьСерию(ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета));
	СерияДоходы.Цвет = ЦветаСтиля.ЦветДоходаВПроекте;
	СерияРасходы = Гистограмма.УстановитьСерию(ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета));
	СерияРасходы.Цвет = ЦветаСтиля.ЦветРасходаВПроекте;
	
	Если ЭтоГод Тогда
		ДатаНачала = НачалоГода(Период);
		ДатаОкончания = КонецГода(Период);
	Иначе
		ДатаНачала = НачалоКвартала(Период);
		ДатаОкончания = КонецКвартала(Период);
	КонецЕсли;
	
	Пока НачалоМесяца(ДатаНачала) <= ДатаОкончания Цикл
		Точка = Гистограмма.УстановитьТочку(ФорматированнаяДатаПоМесяцу(ДатаНачала));
		Результат = ПолучитьДанныеЗаМесяц(ДатаНачала, МаксЗначениеШкалы, ВидФинансовогоОтчета);
		ДатаНачала = ДобавитьМесяц(ДатаНачала,1);
		Если Результат.МаксимальноеЗначение > МаксЗначениеШкалы Тогда
			МаксЗначениеШкалы = Результат.МаксимальноеЗначение;
		КонецЕсли;
		Гистограмма.УстановитьЗначение(Точка,СерияДоходы,Результат.Доход);
		Гистограмма.УстановитьЗначение(Точка,СерияРасходы,Результат.Расход);
	КонецЦикла;
	
	Гистограмма.ОсьЗначений.МаксимальноеЗначение = МаксЗначениеШкалы * 1.2;
	Гистограмма.ОсьЗначений.СпособОпределенияМаксимальногоЗначения =
		СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ФорматированнаяДатаПоМесяцу(ТекДата)
	
	ДатаДляФорматирования = Формат(ТекДата,НСтр("ru = 'ДФ=''ММММ гг'''"));
	Месяц = Лев(ДатаДляФорматирования, 3);
	Год = Прав(ДатаДляФорматирования, 2);
	Возврат СтрШаблон("%1 %2", Месяц, Год);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокКолцевойДиаграммыСОтбором(ВидПоказателя, Период)
	
	ШаблонЗаголовка = НСтр("ru= '%1 за %2 по статьям'");
	ДатаДляФорматирования = НРег(Формат(Период, НСтр("ru = 'ДФ=''ММММ гг'''")));
	Возврат СтрШаблон(ШаблонЗаголовка, Строка(ВидПоказателя), ДатаДляФорматирования);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФорматированнаяДатаПоКварталу(ТекДата)
	
	ЭлементыДаты = СтрРазделить(Формат(ТекДата, НСтр("ru = 'ДФ=''к гггг'''")), " ", Ложь);
	ФорматированнаяДата = СтрШаблон("%1 %2 %3", ЭлементыДаты[0], НСтр("ru= 'квартал'"), ЭлементыДаты[1]);
	Возврат ФорматированнаяДата;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФорматированнаяДатаПоГоду(ТекДата)
	
	Возврат СтрЗаменить(Строка(Год(ТекДата)), Символы.НПП, "");
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЗаголовокДиаграммы(ВидФинансовогоОтчета)
	
	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда	
		Возврат ПолучитьДоходыИРасходы();
	Иначе
		Возврат ПолучитьДенежныйПоток();
	КонецЕсли
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета)
	
	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда	
		Возврат ПолучитьДоход();
	Иначе
		Возврат ПолучитьПоступления();
	КонецЕсли
	
КонецФункции    

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета)
	
	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда	
		Возврат ПолучитьРасход();
	Иначе
		Возврат ПолучитьВыбытия();
	КонецЕсли
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЦветНетДанных(ЭтоТемный)
	
	Если ЭтоТемный Тогда
		//@skip-check new-color
		Возврат Новый Цвет(180,180,180);
	Иначе
		//@skip-check new-color
		Возврат Новый Цвет(200,200,200);
	КонецЕсли
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНетДанных()
	
	Возврат НСтр("ru='Нет данных'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДоход()
	
	Возврат НСтр("ru = 'Доход'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьРасход()
	
	Возврат НСтр("ru = 'Расход'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДоходыИРасходы()
	
	Возврат НСтр("ru = 'Доходы и расходы'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПоступления()
	
	Возврат НСтр("ru = 'Поступления'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьВыбытия()
	
	Возврат НСтр("ru = 'Выбытия'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДенежныйПоток()
	
	Возврат НСтр("ru = 'Денежный поток'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КоличествоМесяцевМеждуДатами(ДатаНачала, ДатаОкончания)
	
	МесяцНачала = Месяц(ДатаНачала);
	МесяцОкончания = Месяц(ДатаОкончания);
	ГодовМеждуДатами = Год(ДатаОкончания) - Год(ДатаНачала);
	Возврат МесяцОкончания - МесяцНачала + ГодовМеждуДатами * 12;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДатуНачала(ДатаНачалаИзДокумента, АктивнаяТаблица = Неопределено) 
	
	Если ЗначениеЗаполнено(ДатаНачалаИзДокумента) Тогда
		ДатаНачала = ДатаНачалаИзДокумента;
	Иначе
		Если ЗначениеЗаполнено(АктивнаяТаблица) Тогда
			Документ = АктивнаяТаблица.Получить(0);
			ДатаНачала = Документ.Период;
		Иначе
			Возврат '00010101';
		КонецЕсли;
	КонецЕсли;
	Возврат ДатаНачала; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДатуОкончания(ДатаОкончанияИзДокумента, ТекДатаСеанса = Неопределено, АктивнаяТаблица = Неопределено)
	
	Если ЗначениеЗаполнено(ДатаОкончанияИзДокумента) Тогда
		ДатаОкончания = ДатаОкончанияИзДокумента;
	Иначе
		Если ЗначениеЗаполнено(АктивнаяТаблица) Тогда
			Документ = АктивнаяТаблица.Получить(АктивнаяТаблица.Количество() - 1);
			ДатаОкончания = Документ.Период;
		Иначе
			Возврат ТекДатаСеанса;
		КонецЕсли;
	КонецЕсли;
	Возврат ДатаОкончания;
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылкаВариантаОтчета(ИмяОтчета, КлючВарианта)
	
	Отчет = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет." + ИмяОтчета);
	Возврат ВариантыОтчетов.ВариантОтчета(Отчет, КлючВарианта);
	
КонецФункции

&НаКлиенте
Процедура ПерейтиКОтчету()

	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда 
		КольцеваяДиаграмма = КольцеваяДиаграммаДР;
		АктивнаяТаблица = ДоходыИРасходы; 
		СписокДатИзГистограммы = СписокДатИзГистограммыДР;
		Вариант = СсылкаВариантаОтчета("ДоходыИРасходы", "ДоходыИРасходыПоПроектам");		
	Иначе            
		КольцеваяДиаграмма = КольцеваяДиаграммаДП;       
		АктивнаяТаблица = ДенежныйПоток;    
		СписокДатИзГистограммы = СписокДатИзГистограммыДП;
		Вариант = СсылкаВариантаОтчета("ДвижениеДенежныхСредствПоПроектам", "ДвижениеДенежныхСредствПоПроектам");		
	КонецЕсли;      

	Период = Новый СтандартныйПериод;
	ОтборРасшифровки = Новый Структура;
	ОтборРасшифровки.Вставить("Проект", Объект.Ссылка);
	
	Если КольцеваяДиаграмма.ОбластьЗаголовка.Текст = ПолучитьЗаголовокДиаграммы(ВидФинансовогоОтчета) Тогда
		Период.ДатаНачала = ПолучитьДатуНачала(Объект.ДатаНачала, АктивнаяТаблица);
		Период.ДатаОкончания = КонецМесяца(ПолучитьДатуОкончания(Объект.ДатаОкончания, ОбщегоНазначенияКлиент.ДатаСеанса(), АктивнаяТаблица));
	Иначе
		Индекс = СписокДатИзГистограммы.Количество() - 1;
		ДатаИзГистограммы = СписокДатИзГистограммы[Индекс].Значение;
		Период.ДатаНачала = НачалоМесяца(ДатаИзГистограммы);
		Период.ДатаОкончания = КонецМесяца(ДатаИзГистограммы);
	КонецЕсли;
	ОтборРасшифровки.Вставить("СтПериод", Период);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("Отбор", ОтборРасшифровки); 
	
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант, ПараметрыОткрытия);

КонецПроцедуры

&НаСервере
Процедура ОбновитьИтоги(ВидОтчета)
	
	СтрокаФормата = НСтр("ru = 'ЧДЦ=2; ЧН=0,00'");
	
	Если ВидОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		
		СуммаДоходов = ДоходыИРасходы.Итог("Доход");
		СуммаРасходов = ДоходыИРасходы.Итог("Расход");
		
		Доход   = Формат(СуммаДоходов, СтрокаФормата);
		Расход  = Формат(СуммаРасходов, СтрокаФормата);
		Прибыль = Формат(СуммаДоходов - СуммаРасходов, СтрокаФормата);
		
		Если СуммаДоходов > 0 Тогда
			ЗначениеРентабельности = Формат(((СуммаДоходов - СуммаРасходов) * 100)/СуммаДоходов,НСтр("ru= 'ЧДЦ=0; ЧФ=""Ч%""; ЧН='"));
		ИначеЕсли СуммаДоходов = 0 И СуммаРасходов = 0 Тогда
			ЗначениеРентабельности = ПолучитьНетДанных();
		ИначеЕсли СуммаРасходов > 0 И СуммаДоходов = 0 Тогда
			ЗначениеРентабельности = Формат(-100,НСтр("ru = 'ЧДЦ=0; ЧФ=""Ч%""'"));
		КонецЕсли;
		
		Рентабельность = ЗначениеРентабельности;
		
	КонецЕсли;
	
	Если ВидОтчета = Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток Тогда
		
		СуммаПоступлений = ДенежныйПоток.Итог("Доход");
		СуммаВыбытий = ДенежныйПоток.Итог("Расход");
		
		Поступления          = Формат(СуммаПоступлений, СтрокаФормата);
		Выбытия              = Формат(СуммаВыбытий, СтрокаФормата);
		ЧистыйДенежныйПоток = Формат(СуммаПоступлений - СуммаВыбытий, СтрокаФормата);
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект); 
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если НЕ ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.СоздатьНовыйДопРеквизит, Элементы.СтраницаОсновное);
	Элементы.Переместить(Элементы.ГруппаДополнительныеРеквизиты, Элементы.СтраницаОсновное);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДиаграмммыНаКлиенте(ВидОтчета)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда
		КольцеваяДиаграмма = КольцеваяДиаграммаДР;
		Гистограмма = ГистограммаДР;
		АктивнаяТаблица = ДоходыИРасходы;
	Иначе
		КольцеваяДиаграмма = КольцеваяДиаграммаДП;
		Гистограмма = ГистограммаДП;
		АктивнаяТаблица = ДенежныйПоток;
	КонецЕсли;
	
	Если АктивнаяТаблица.Количество() < 1 Тогда
		Возврат;
	КонецЕсли;
	
	КольцеваяДиаграмма.Очистить();
	Гистограмма.Очистить();
	
	ЗаполнитьДиаграммы(ВидОтчета, Ложь);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#КонецОбласти