
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьОписанияВычетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОписаниеВычета();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодВычетаПриИзменении(Элемент)
	
	ОбновитьОписаниеВычета();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОписанияВычетов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыВычетовНДФЛ.ПолноеНаименование КАК ПолноеНаименование,
	               |	ЕСТЬNULL(РазмерВычетовНДФЛСрезПоследних.Размер, 0) КАК Размер,
	               |	ВидыВычетовНДФЛ.Ссылка КАК ВидВычета
	               |ИЗ
	               |	Справочник.ВычетыНДФЛ КАК ВидыВычетовНДФЛ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛРазмерВычетов.СрезПоследних КАК РазмерВычетовНДФЛСрезПоследних
	               |		ПО ВидыВычетовНДФЛ.Ссылка = РазмерВычетовНДФЛСрезПоследних.КодВычета
	               |ГДЕ
	               |	ВидыВычетовНДФЛ.ГруппаВычета = ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.СтандартныеНаДетей)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидыВычетовНДФЛ.Код";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СписокВычетов.Очистить();
	Пока Выборка.Следующий() Цикл
		ОписаниеВычета = Выборка.ПолноеНаименование;
		Если ЗначениеЗаполнено(Выборка.Размер) Тогда
			ОписаниеВычета = СтрШаблон("%1 руб.: %2", Выборка.Размер, ОписаниеВычета);
		КонецЕсли;
    	СписокВычетов.Добавить(Выборка.ВидВычета, ОписаниеВычета);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОписаниеВычета()
	
	ОписаниеВычета = "";
	ЭлементВычет = СписокВычетов.НайтиПоЗначению(Запись.КодВычета);
	Если ЭлементВычет <> Неопределено Тогда
		ОписаниеВычета = ЭлементВычет.Представление;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти