
#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьИнтерфейс;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуВзаиморасчетов();
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		УстановитьДоступность();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособРазнесенияОплатыПоУмолчаниюПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаПредоплатыПоУмолчаниюПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАналитикаВзаиморасчетовТаблица

&НаКлиенте
Процедура АналитикаВзаиморасчетовТаблицаДолгиПриИзменении(Элемент)
	
	Таблица = Элемент.Родитель;
	Если Таблица = Неопределено Или Таблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Таблица.ТекущиеДанные;
	ИдентификаторАналитики = ТекущиеДанные.ИдентификаторАналитики;
	
	Если ИдентификаторАналитики = ИдентификаторАналитикиПоДоговорам() Тогда
		СохранитьЗначениеРеквизита("НаборКонстант.ВестиРасчетыПоДоговорам", ТекущиеДанные.Долги);
	ИначеЕсли ИдентификаторАналитики = ИдентификаторАналитикиПоДокументам() Тогда
		СохранитьЗначениеРеквизита("НаборКонстант.ВестиРасчетыПоДокументам", ТекущиеДанные.Долги);
	ИначеЕсли ИдентификаторАналитики = ИдентификаторАналитикиПоЗаказам() Тогда
		СохранитьЗначениеРеквизита("НаборКонстант.ВестиРасчетыПоЗаказам", ТекущиеДанные.Долги);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикаВзаиморасчетовТаблицаОплатаПриИзменении(Элемент)

	Таблица = Элемент.Родитель;
	Если Таблица = Неопределено Или Таблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Таблица.ТекущиеДанные;
	ИдентификаторАналитики = ТекущиеДанные.ИдентификаторАналитики;
	
	Если ИдентификаторАналитики = ИдентификаторАналитикиПоСчетам() Тогда
		СохранитьЗначениеРеквизита("НаборКонстант.ВестиУчетОплатыПоСчетам", ТекущиеДанные.Оплата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторАналитикиПоДокументам()
	
	Возврат "ПоДокументам";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторАналитикиПоДоговорам()
	
	Возврат "ПоДоговорам";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторАналитикиПоЗаказам()
	
	Возврат "ПоЗаказам";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторАналитикиПоСчетам()
	
	Возврат "ПоСчетам";
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуВзаиморасчетов()
	
	ДанныеСтроки = АналитикаВзаиморасчетов.Добавить();
	ДанныеСтроки.ИдентификаторАналитики = ИдентификаторАналитикиПоДоговорам();
	ДанныеСтроки.Представление = НСтр("ru = 'По договорам'");
	ДанныеСтроки.Долги = НаборКонстант.ВестиРасчетыПоДоговорам;
	ДанныеСтроки.ДолгиДоступны = Истина;
	ДанныеСтроки.Доступность = Истина;
	ДанныеСтроки.Видимость = Истина;
	
	ДанныеСтроки = АналитикаВзаиморасчетов.Добавить();
	ДанныеСтроки.ИдентификаторАналитики = ИдентификаторАналитикиПоДокументам();
	ДанныеСтроки.Представление = НСтр("ru = 'По документам'");
	ДанныеСтроки.Долги = НаборКонстант.ВестиРасчетыПоДокументам;
	ДанныеСтроки.ДолгиДоступны = Истина;
	ДанныеСтроки.Доступность = Истина;
	ДанныеСтроки.Видимость = Истина;
	
	ДанныеСтроки = АналитикаВзаиморасчетов.Добавить();
	ДанныеСтроки.ИдентификаторАналитики = ИдентификаторАналитикиПоЗаказам();
	ДанныеСтроки.Представление = НСтр("ru = 'По заказам'");
	ДанныеСтроки.Долги = НаборКонстант.ВестиРасчетыПоЗаказам;
	ДанныеСтроки.ДолгиДоступны = Истина;
	ДанныеСтроки.Доступность = Истина;
	ДанныеСтроки.Видимость = Истина;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСчетаНаОплату") Тогда
		
		ДанныеСтроки = АналитикаВзаиморасчетов.Добавить();
		ДанныеСтроки.ИдентификаторАналитики = ИдентификаторАналитикиПоСчетам();
		ДанныеСтроки.Представление = НСтр("ru = 'По счетам'");
		ДанныеСтроки.Оплата = НаборКонстант.ВестиУчетОплатыПоСчетам;
		ДанныеСтроки.ОплатаДоступна = Истина;
		ДанныеСтроки.Доступность = Истина;
		ДанныеСтроки.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#Область СтандартноеСохранениеЗначенийКонстант

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	ИмяКонстанты = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	КонецЕсли;
		
	Если ИмяКонстанты <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, ИмяКонстанты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	ИмяКонстанты = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	УстановитьДоступность(РеквизитПутьКДанным);
	ОбновитьПовторноИспользуемыеЗначения();
	Возврат ИмяКонстанты;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным, УстанавливаемоеЗначение = Неопределено)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	
	ЧастиИмени = СтрРазделить(РеквизитПутьКДанным, ".");
	Если ЧастиИмени.Количество() <> 2 Тогда
		Возврат "";
	КонецЕсли;

	ИмяКонстанты = ЧастиИмени[1];
	
	Если УстанавливаемоеЗначение <> Неопределено Тогда
		НаборКонстант[ИмяКонстанты] = УстанавливаемоеЗначение
	КонецЕсли;
	
	КонстантаМенеджер = Константы[ИмяКонстанты];
	НовоеЗначение = НаборКонстант[ИмяКонстанты];
	СтароеЗначение = КонстантаМенеджер.Получить();
	
	Если СтароеЗначение <> НовоеЗначение Тогда
		
		ТекстОшибки = ПриПроверкеВозможностиУстановкиЗначенияКонстанты(РеквизитПутьКДанным, НовоеЗначение);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , РеквизитПутьКДанным);
			НаборКонстант[ИмяКонстанты] = СтароеЗначение;
		Иначе
			КонстантаМенеджер.Установить(НовоеЗначение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИмяКонстанты;
	
КонецФункции

#КонецОбласти

&НаСервере
Функция ПриПроверкеВозможностиУстановкиЗначенияКонстанты(РеквизитПутьКДанным, НовоеЗначение)
	
	ТекстОшибки = "";
	Возврат ТекстОшибки;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступность(РеквизитПутьКДанным = "")
	
	Если РеквизитПутьКДанным = "" Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ИдентификаторАналитики", ИдентификаторАналитикиПоДокументам());
		НайденныеСтроки = АналитикаВзаиморасчетов.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() Тогда
			НайденныеСтроки[0].ДолгиДоступны = Не ОтчетностьВключена();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтчетностьВключена()
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьОтчетность");
КонецФункции

#КонецОбласти
