
#Область ПроцедураОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСегментыНоменклатуры") Тогда
		ВариантПоСегментам = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоСегменту;
		Элемент = Элементы.ВариантИсключенийКонтроляОстатковВРознице.СписокВыбора.НайтиПоЗначению(ВариантПоСегментам);
		Если Элемент <> Неопределено Тогда
			Элементы.ВариантИсключенийКонтроляОстатковВРознице.СписокВыбора.Удалить(Элемент);
		КонецЕсли;
	КонецЕсли;
	
	ВариантИсключенийКонтроляОстатковВРознице = Константы.ВариантИсключенийКонтроляОстатковВРознице.Получить();
	
	Если Не ЗначениеЗаполнено(ВариантИсключенийКонтроляОстатковВРознице) Тогда
		ВариантИсключенийКонтроляОстатковВРознице = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре;
		СохранитьВариантИсключений();
	КонецЕсли;
	
	ВариантИсключенийКонтроляОстатковВРозницеДоИзменения = ВариантИсключенийКонтроляОстатковВРознице;
	
	ИсключитьКонтрольОстатковВКассах = Не Константы.КонтролироватьОстаткиДенегВКассах.Получить();
	
	УстановитьУсловноеОформлениеФормы();
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементымиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедураОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВариантИсключенийКонтроляОстатковВРозницеПриИзменении(Элемент)
	
	Если ЕстьНастройкиИсключений() Тогда
		Оповещение = Новый ОписаниеОповещения("ВариантИсключенийКонтроляОстатковВРозницеПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru = 'Список исключений будет очищен. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет,
			НСтр("ru = 'Изменение варианта исключений'"));
	Иначе
		СохранитьВариантИсключений();
		ВариантИсключенийКонтроляОстатковВРозницеДоИзменения = ВариантИсключенийКонтроляОстатковВРознице;
		УправлениеЭлементымиФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеКонтролироватьОстаткиВКассахПриИзменении(Элемент)
	
	УстановитьКонстантуКонтроляОстатковВКассе();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	Интерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ФормаКоманднаяПанель", "Видимость", Интерфейс85);
	
КонецПроцедуры

&НаСервере
Функция ЕстьНастройкиИсключений()
	
	ЕстьНастройки = РегистрыСведений.ИсключенияКонтроляОстатковВРознице.ЕстьНастройкиИсключений();
	
	Возврат ЕстьНастройки;
	
КонецФункции

&НаКлиенте
Процедура ВариантИсключенийКонтроляОстатковВРозницеПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ВариантИсключенийКонтроляОстатковВРознице = ВариантИсключенийКонтроляОстатковВРозницеДоИзменения;
	Иначе
		ИзменитьВариантИсключенийНаСервере();
		УправлениеЭлементымиФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВариантИсключенийНаСервере()
	
	НаборЗаписей = РегистрыСведений.ИсключенияКонтроляОстатковВРознице.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	
	СохранитьВариантИсключений();
	ВариантИсключенийКонтроляОстатковВРозницеДоИзменения = ВариантИсключенийКонтроляОстатковВРознице;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВариантИсключений()
	
	Константы.ВариантИсключенийКонтроляОстатковВРознице.Установить(ВариантИсключенийКонтроляОстатковВРознице);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементымиФормы()
	
	Если ВариантИсключенийКонтроляОстатковВРознице = ПредопределенноеЗначение("Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "Заголовок", НСтр("ru = 'Номенклатура'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "ОграничениеТипа", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ИначеЕсли ВариантИсключенийКонтроляОстатковВРознице = ПредопределенноеЗначение("Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоКатегориям") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "Заголовок", НСтр("ru = 'Категория'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "ОграничениеТипа", Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры"));
	ИначеЕсли ВариантИсключенийКонтроляОстатковВРознице = ПредопределенноеЗначение("Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоСегменту") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "Заголовок", НСтр("ru = 'Сегмент'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "ОграничениеТипа", Новый ОписаниеТипов("СправочникСсылка.СегментыНоменклатуры"));
	ИначеЕсли ВариантИсключенийКонтроляОстатковВРознице = ПредопределенноеЗначение("Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоЦеновымГруппам") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "Заголовок", НСтр("ru = 'Ценовая группа'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "ОграничениеТипа", Новый ОписаниеТипов("СправочникСсылка.ЦеновыеГруппы"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКонстантуКонтроляОстатковВКассе()
	
	Константы.КонтролироватьОстаткиДенегВКассах.Установить(Не ИсключитьКонтрольОстатковВКассах);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Список.СтруктурнаяЕдиница", Неопределено, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "СтруктурнаяЕдиница");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = '<Все склады>'"));
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Желтый50УНФ);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Список.Номенклатура", Неопределено, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "Номенклатура");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = '<Все товары>'"));
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаПалитры.Желтый50УНФ);

КонецПроцедуры // УстановитьУсловноеОформлениеФормы()

#КонецОбласти