#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстОшибок = Параметры.ТекстОшибок;
	Номенклатура = Параметры.Номенклатура;
	Характеристика = Параметры.Характеристика;
	
	Элементы.Характеристика.Видимость = ЗначениеЗаполнено( Характеристика );
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьИзображенияНеПрошедшиеПроверку(Команда)
	
	ПараметрыФормы = Новый Структура("Номенклатура", Номенклатура);
	
	ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаПроверкиИзображенийТоваров",
	ПараметрыФормы,ЭтотОбъект,,,,,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


#КонецОбласти
