#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает следующего участника маршрута
//
// Параметры:
//  Маршрут         - СправочникСсылка.МаршрутыСогласованияЗаявок - маршрут,
//  ТекущийУчастник - СправочникСсылка.Пользователи, Неопределено - текущий участник маршрута
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи, Неопределено - следующий участник маршрута
//
Функция ПолучитьСледующегоУчастникаМаршрута(Маршрут, ТекущийУчастник) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекущийУчастник) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Маршрут = АвтоматическоеУтверждениеЗаявки Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МаршрутыСогласованияЗаявокУчастникиМаршрута.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.МаршрутыСогласованияЗаявок.УчастникиМаршрута КАК МаршрутыСогласованияЗаявокУчастникиМаршрута
		|ГДЕ
		|	МаршрутыСогласованияЗаявокУчастникиМаршрута.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Маршрут);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаУчастникиМаршрута = РезультатЗапроса.Выгрузить();
	
	НайденнаяСтрока = ТаблицаУчастникиМаршрута.Найти(ТекущийУчастник, "Пользователь");
	
	ИндексТекущегоУчастника = ТаблицаУчастникиМаршрута.Индекс(НайденнаяСтрока);
	
	Если ИндексТекущегоУчастника = ТаблицаУчастникиМаршрута.Количество() - 1 Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Возврат ТаблицаУчастникиМаршрута.Получить(ИндексТекущегоУчастника + 1).Пользователь;
	КонецЕсли;
	
КонецФункции

// Возвращает первого участника маршрута
//
// Параметры:
//  Маршрут - СправочникСсылка.МаршрутыСогласованияЗаявок - маршрут
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи, Неопределено - первый участник маршрута
//
Функция ПолучитьПервогоУчастникаМаршрута(Маршрут) Экспорт
	
	Если Маршрут = АвтоматическоеУтверждениеЗаявки Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МаршрутыСогласованияЗаявокУчастникиМаршрута.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.МаршрутыСогласованияЗаявок.УчастникиМаршрута КАК МаршрутыСогласованияЗаявокУчастникиМаршрута
		|ГДЕ
		|	МаршрутыСогласованияЗаявокУчастникиМаршрута.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Маршрут);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Пользователь;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Получить признак использования маршрута
//
// Параметры:
//  Маршрут - СправочникСсылка.МаршрутыСогласованияЗаявок - маршрут
// 
// Возвращаемое значение:
//  Булево  - Признак того, что по маршруту есть несогласованные заявки 
//
Функция МаршрутИспользуется(Маршрут) Экспорт
	
	Если Не ЗначениеЗаполнено(Маршрут) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.СогласованиеЗаявок КАК СогласованиеЗаявок
		|ГДЕ
		|	СогласованиеЗаявок.ЗаявкаНаРасходДС.МаршрутСогласования = &МаршрутСогласования
		|	И СогласованиеЗаявок.ТекущийСогласующий.Ссылка <> ЗНАЧЕНИЕ(Справочник.МаршрутыСогласованияЗаявок.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("МаршрутСогласования", Маршрут);
		
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();

КонецФункции

#КонецОбласти

#КонецЕсли