#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Предопределенный Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("УчастникиМаршрута"));
	КонецЕсли;
	
	Ошибки = Неопределено;
	
	УчастникиВременно = УчастникиМаршрута.Выгрузить();
    УчастникиВременно.Колонки.Добавить("Дубли");
    УчастникиВременно.ЗаполнитьЗначения(1, "Дубли");
    УчастникиВременно.Свернуть("Пользователь", "Дубли");
    Если УчастникиВременно.Количество() < УчастникиМаршрута.Количество() Тогда
        Для Каждого СтрокаУчастникиВременно из УчастникиВременно Цикл
            Если СтрокаУчастникиВременно.Дубли > 1 Тогда
        		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Пользователь ""%1"" задублирован в маршруте'"), СтрокаУчастникиВременно.Пользователь);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.УчастникиМаршрута", ТекстОшибки);
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
    
    ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления И Справочники.МаршрутыСогласованияЗаявок.МаршрутИспользуется(Ссылка) Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru = 'Нельзя пометить маршрут на удаление, так как он используется в несогласованных заявках!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли