///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоНаРедактированиеНастроекСервиса = ПроверкаКонтрагентов.ЕстьПравоНаРедактированиеНастроек();
	
	ПроверкаКонтрагентов.СохранитьДатуПоследнегоОтображенияПредложенияПодключиться();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьСервисСейчас(Команда)
	
	ПроверкаКонтрагентовВызовСервера.ПриВключенииВыключенииПроверки(Истина);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяПроверка(Команда)
	
	ПроверкаКонтрагентовВызовСервера.ЗапомнитьЧтоБольшеНеНужноПоказыватьПредложениеИспользоватьСервис();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура БольшеНеПоказывать(Команда)
	
	ПроверкаКонтрагентовВызовСервера.ЗапомнитьЧтоБольшеНеНужноПоказыватьПредложениеИспользоватьСервис();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НапомнитьПозже(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ЭтоМедленныйРежимРаботы = ПроверкаКонтрагентов.ЭтоМедленныйРежимРаботы();
	
	// В зависимости от наличия административных прав будут доступны разные элементы управления.
	Элементы.ИнформацияОНеобходимостиОбратитьсяКАдминистратору.ОтображатьЗаголовок = 
		Не ЕстьПравоНаРедактированиеНастроекСервиса;
	
	// Управление кнопками. Видимость.
	Элементы.ВключитьСервисСейчас.Видимость = ЕстьПравоНаРедактированиеНастроекСервиса;
	Элементы.РучнаяПроверка.Видимость       = ЕстьПравоНаРедактированиеНастроекСервиса;
	Элементы.БольшеНеПоказывать.Видимость   = НЕ ЕстьПравоНаРедактированиеНастроекСервиса;
	
	// Управление кнопками. Кнопка по умолчанию.
	Если ЕстьПравоНаРедактированиеНастроекСервиса Тогда
		Если ЭтоМедленныйРежимРаботы Тогда
			Элементы.РучнаяПроверка.КнопкаПоУмолчанию = Истина;
			Элементы.Переместить(
					Элементы.РучнаяПроверка,
					Элементы.ФормаКоманднаяПанель,
					Элементы.ВключитьСервисСейчас);
			// Платформа85
			Если ИнтернетПоддержкаПользователейКлиентСервер.ЭтоПлатформа85() Тогда
				Элементы.РучнаяПроверка.Важность = ВажностьКнопки.Главная;
			КонецЕсли;
			// Конец Платформа85
		Иначе
			Элементы.ВключитьСервисСейчас.КнопкаПоУмолчанию = Истина;
			// Платформа85
			Если ИнтернетПоддержкаПользователейКлиентСервер.ЭтоПлатформа85() Тогда
				Элементы.ВключитьСервисСейчас.Важность = ВажностьКнопки.Главная;
			КонецЕсли;
			// Конец Платформа85
		КонецЕсли;
	Иначе
		Элементы.НапомнитьПозже.КнопкаПоУмолчанию = Истина;
		// Платформа85
		Если ИнтернетПоддержкаПользователейКлиентСервер.ЭтоПлатформа85() Тогда
			Элементы.НапомнитьПозже.Важность = ВажностьКнопки.Главная;
		КонецЕсли;
		// Конец Платформа85
	КонецЕсли;
	
	// Настройка в зависимости от медленности компьютера.
	Элементы.РежимыМедленнойРаботы.Видимость = ЭтоМедленныйРежимРаботы;
	Если ЭтоМедленныйРежимРаботы Тогда
		УправлениеНадписьюДляМедленногоРежима();
	КонецЕсли;
	
	КлючСохраненияПоложенияОкна = Строка(ЕстьПравоНаРедактированиеНастроекСервиса)
		+ Строка(ЭтоМедленныйРежимРаботы);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеНадписьюДляМедленногоРежима()
	
	ИБФайловая = (ОбщегоНазначения.ИнформационнаяБазаФайловая()
		И Не ОбщегоНазначения.КлиентПодключенЧерезВебСервер());
	
	Элементы.НедостаточноПамяти.Видимость  = ИБФайловая;
	Элементы.МедленноеСоединение.Видимость = Не ИБФайловая;
	
КонецПроцедуры

#КонецОбласти
