
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Получить() Тогда
		УстановитьВидимостьОтФОИспользоватьПодсистемуПроизводство();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьОтФОИспользоватьПодсистемуПроизводство()
	
	ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипСчета");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.Использование = Истина;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыСчетов.НезавершенноеПроизводство);
	СписокЗначений.Добавить(Перечисления.ТипыСчетов.КосвенныеЗатраты);
	
	ЭлементОтбора.ПравоеЗначение = СписокЗначений;
	
КонецПроцедуры

#КонецОбласти
