#Область ОписаниеПеременных

&НаКлиенте
Перем СоответствиеСтрокРазвернутая;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьНастройкиПомощникРМК(ЭтотОбъект);
	ЗаполнитьДанныеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОткрытьПомощникНастройкиОбмена();
	ЗапускОбмена();
	СоответствиеСтрокРазвернутая = Новый Соответствие;
	ЗаполнитьСканерПриСтарте();
	НастроитьИспользованиеСервераЛояльности();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ПерезаполнитьНастройки = Ложь;
	Если ИмяСобытия = "СохранениеНастроекРМК" Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметр, "НастройкаЗаписана")
			И Параметр.НастройкаЗаписана Тогда
			ПерезаполнитьНастройки = Истина;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "РабочееМестоКассираУспешноНастроено" Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметр, "РабочееМестоКассираУспешноНастроено")
			И Параметр.РабочееМестоКассираУспешноНастроено Тогда
			ПерезаполнитьНастройки = Истина;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ПодключениеОборудования" Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметр, "ПодключенТерминал")
			И Параметр.ПодключенТерминал Тогда
			НастройкиРМК.ИспользоватьОплатуПлатежнымиКартами = Истина;
		КонецЕсли;
		ЗаполнитьКарточкиКассыИЭквайринг();
		ПереключитьСтраницу();
	ИначеЕсли ИмяСобытия = "НастройкаПлатежныхСистем" Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметр, "ПлатежныеСистемыПодключены")
			И Параметр.ПлатежныеСистемыПодключены Тогда
			НастройкиРМК.ИспользоватьОплатуПлатежнымиСистемами = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ПерезаполнитьНастройки Тогда
		НастройкиИзменены = Ложь;
		ЗаполнитьНастройкуРабочегоМестаКассира();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПомощникНастройкиОбмена(Команда)
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуНастройкиОбменаРезультат", ЭтотОбъект);
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуНастройкиОбмена(ОбработчикОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзНастройки(Команда)
	УдалитьСотрудникаИзДерева();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПользователя(Команда)
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуСозданияПользователь(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПользователейПоСотрудникам(Команда)
	ПараметрыОткрытияФормы = Новый Структура("ТорговыйОбъект", ТорговыйОбъект);
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ОбновитьТаблицуПользователей", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПомощникНастройкиКассовогоМестаРМК.Форма.СписокФизическихЛиц"
		,ПараметрыОткрытияФормы,ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор,,, ОбработчикЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	Элементы.ГруппаНастройкиВсплывающая.Показать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппуДоступа(Команда)
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуСозданияГруппыДоступа(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВНастройкуМножественный(Команда)
	ДобавитьПользователейВТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОборудование(Команда)
	ПараметрыОткрытияФормы = Новый Структура;
	МассивКасс = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаКассККМ Цикл
		Если СтрокаТаблицы.КассаПодключена
			Или СтрокаТаблицы.ИспользоватьБезПодключенияОборудования Тогда
			Продолжить;
		КонецЕсли;
		МассивКасс.Добавить(Новый Структура("КассаККМ, Организация", СтрокаТаблицы.КассаККМ, СтрокаТаблицы.Организация));
	КонецЦикла;
	
	МассивЭквайринга = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаЭквайринговыйТерминал Цикл
		Если СтрокаТаблицы.ЭквайрингПодключен
			Или СтрокаТаблицы.ИспользоватьБезПодключенияОборудования Тогда
			Продолжить;
		КонецЕсли;
		МассивЭквайринга.Добавить(Новый Структура("ЭквайринговыйТерминал, Организация", СтрокаТаблицы.КассаККМ, СтрокаТаблицы.Организация));
	КонецЦикла;

	ПараметрыОткрытияФормы.Вставить("МассивКасс", МассивКасс);
	ПараметрыОткрытияФормы.Вставить("МассивЭквайринга", МассивЭквайринга);
	ПараметрыОткрытияФормы.Вставить("ТекущееРабочееМесто", ТекущееРабочееМесто);
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ЗаполнитьПодключаемоеОборудование", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПомощникНастройкиКассовогоМестаРМК.Форма.ФормаОборудование", ПараметрыОткрытияФормы, ЭтотОбъект,
			,,, ОбработкаОповещения, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПлатежныеСистемы(Команда)
	НастроитьПлатежныеСистемыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеСерверЛояльности();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРасписание(Команда)
	ДобавитьРасписаниеНаСервере();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Сценарий обмена создан'"));
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияОбмена(Команда)
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуЗаписиРегистраСведенийОбменРМК(ЭтотОбъект, УзелОбмена);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСценарииОбменаДанными(Команда)
	ОбменДаннымиКлиент.ОбработкаКомандыНастроитьРасписаниеВыполненияОбмена(УзелОбмена, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеРегламентногоЗадания(Команда)
	// Если расписание не инициализировано в форме на сервере, то создаем новое.
	Если РасписаниеРегламентногоЗаданияВыгрузкаДанных = Неопределено Тогда
		
		РасписаниеРегламентногоЗаданияВыгрузкаДанных = Новый РасписаниеРегламентногоЗадания;
		
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗаданияВыгрузкаДанных);
	
	// Открываем диалог для редактирования Расписания.
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеРасписанияРегламентногоЗаданияЗавершение", ЭтотОбъект, Новый Структура("ВыгрузкаДанных", Истина));
	Диалог.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеРегламентногоЗагрузкаДанных(Команда)
	// Если расписание не инициализировано в форме на сервере, то создаем новое.
	Если РасписаниеРегламентногоЗаданияЗагрузкаДанных = Неопределено Тогда
		
		РасписаниеРегламентногоЗаданияЗагрузкаДанных = Новый РасписаниеРегламентногоЗадания;
		
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗаданияЗагрузкаДанных);
	
	// Открываем диалог для редактирования Расписания.
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеРасписанияРегламентногоЗаданияЗавершение", ЭтотОбъект, Новый Структура("ВыгрузкаДанных", Ложь));
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьКассу(Команда)
	ИмяЭлемента = ТекущийЭлемент.Имя;
	НомерЭлемента = Число(СтрЗаменить(ИмяЭлемента, "ПодключитьКассу_", ""));
	
	СтрокиКассаККМ = ТаблицаКассККМ.НайтиСтроки(Новый Структура("НомерЭлемента", НомерЭлемента));
	Если СтрокиКассаККМ.Количество() > 0 Тогда
		МассивКасс = Новый Массив();
		
		СтруктураНастройки = Новый Структура;
		СтруктураНастройки.Вставить("КассаККМ", СтрокиКассаККМ[0].КассаККМ);
		СтруктураНастройки.Вставить("Организация", СтрокиКассаККМ[0].Организация);
		МассивКасс.Добавить(СтруктураНастройки);
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("МассивКасс", МассивКасс);
		ПараметрыОткрытияФормы.Вставить("ТекущееРабочееМесто", ТекущееРабочееМесто);
		ПараметрыОткрытияФормы.Вставить("НастройкаККТ", Истина);
		ОбработкаОповещения = Новый ОписаниеОповещения("ЗаполнитьПодключаемоеОборудование", ЭтотОбъект);
		ОткрытьФорму("Обработка.ПомощникНастройкиКассовогоМестаРМК.Форма.ФормаОборудование", ПараметрыОткрытияФормы, ЭтотОбъект,
			,,, ОбработкаОповещения, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьЭквайринг(Команда)
	ИмяЭлемента = ТекущийЭлемент.Имя;
	НомерЭлемента = Число(СтрЗаменить(ИмяЭлемента, "ПодключитьЭквайринг_", ""));
	
	СтрокиЭквайринг = ТаблицаЭквайринговыйТерминал.НайтиСтроки(Новый Структура("НомерЭлемента", НомерЭлемента));
	Если СтрокиЭквайринг.Количество() > 0 Тогда
		МассивЭкварйринг = Новый Массив();
		
		СтруктураНастройки = Новый Структура;
		СтруктураНастройки.Вставить("Эквайринг", СтрокиЭквайринг[0].ЭквайринговыйТерминал);
		СтруктураНастройки.Вставить("Организация", СтрокиЭквайринг[0].Организация);
		МассивЭкварйринг.Добавить(СтруктураНастройки);
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("МассивЭквайринга", МассивЭкварйринг);
		ПараметрыОткрытияФормы.Вставить("ТекущееРабочееМесто", ТекущееРабочееМесто);
		ПараметрыОткрытияФормы.Вставить("НастройкаЭквайринг", Истина);
		ОбработкаОповещения = Новый ОписаниеОповещения("ЗаполнитьПодключаемоеОборудование", ЭтотОбъект);
		ОткрытьФорму("Обработка.ПомощникНастройкиКассовогоМестаРМК.Форма.ФормаОборудование", ПараметрыОткрытияФормы, ЭтотОбъект,
			,,, ОбработкаОповещения, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапускатьРМКПриВходе(Команда)
	
	ТекущаяСтрокаДерево = Элементы.ДеревоГруппДоступа.ТекущиеДанные;
	Если ТекущаяСтрокаДерево.Уровень <> 2 Тогда
		СообщениеПользователю = НСтр("ru = 'Настройка запуска не установлена не установлен. Активируйте строку с пользователем.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);
		Возврат;
	КонецЕсли;
	ЗапускатьРМКПриСтартеНаСервере(ТекущаяСтрокаДерево.ЭлементДерева);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТорговыйОбъект(Команда)
	ТекущаяСтрокаДерево = Элементы.ДеревоГруппДоступа.ТекущиеДанные;
	Если ТекущаяСтрокаДерево.Уровень <> 2 Тогда
		СообщениеПользователю = НСтр("ru = 'Торговый объект не установлен. Активируйте строку с пользователем.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);
		Возврат;
	КонецЕсли;
	Результат = Ложь;
	УстановитьТорговыйОбъектПользователя(ТекущаяСтрокаДерево.ЭлементДерева, Результат);
	
	Если Результат Тогда
		ЗаполнитьДеревоГруппыДоступа();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПереключательСтраницПриИзменении(Элемент)
	ПереключитьСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СверятьСОФДНажатие(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НомерЭлемента = Число(СтрЗаменить(НавигационнаяСсылкаФорматированнойСтроки, "ИнтеграцияСОФД_", ""));
	СтрокиКасс = ТаблицаКассККМ.НайтиСтроки(Новый Структура("НомерЭлемента", НомерЭлемента));
	
	Если СтрокиКасс.Количество() > 0 Тогда
		НастройкиПодключения = Новый Структура;
		НастройкиПодключения.Вставить("Касса", СтрокиКасс[0].КассаККМ);
		ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьПараметрыПодключенияСверятьСОФД(НастройкиПодключения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СверятьСОФДПриИзменении(Элемент)
	ИмяЭлемента = Элемент.Имя;
	НомерЭлемента = Число(СтрЗаменить(ИмяЭлемента, "СверятьОФД_", ""));
	СтрокиКасс = ТаблицаКассККМ.НайтиСтроки(Новый Структура("НомерЭлемента", НомерЭлемента));
	
	Если СтрокиКасс.Количество() > 0 Тогда
		СтрукутураИзменяемыхРеквизитов = Новый Структура;
		СтрукутураИзменяемыхРеквизитов.Вставить("СверятьДанныеССервисомОФД", ЭтотОбъект[ИмяЭлемента]);
		СохранитьИзменениеКассыККМ(СтрокиКасс[0].КассаККМ, СтрукутураИзменяемыхРеквизитов);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТорговыйОбъектПриИзменении(Элемент)
	ИзменитьТорговыйОбъект();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИспользоватьОборудованиеПриИзменении(Элемент)
	ИмяЭлемента = Элемент.Имя;
	НомерЭлемента = Число(СтрЗаменить(ИмяЭлемента, "ИспользоватьБезПодключения_", ""));
	СтрокиКасс = ТаблицаКассККМ.НайтиСтроки(Новый Структура("НомерЭлемента", НомерЭлемента));
	
	Если СтрокиКасс.Количество() > 0 Тогда
		СтрукутураИзменяемыхРеквизитов = Новый Структура;
		СтрукутураИзменяемыхРеквизитов.Вставить("ИспользоватьБезПодключенияОборудования", ЭтотОбъект[ИмяЭлемента]);
		СтрокиКасс[0].ИспользоватьБезПодключенияОборудования = ЭтотОбъект[ИмяЭлемента];
		СохранитьИзменениеКассыККМ(СтрокиКасс[0].КассаККМ, СтрукутураИзменяемыхРеквизитов);
		
		ИмяРеквизитаПодключитьКассу = СтрШаблон(НСтр("ru = 'ПодключитьКассу_%1'"), НомерЭлемента);
		ЭлементФормы = Элементы.Найти(ИмяРеквизитаПодключитьКассу);
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭлементФормы.Видимость = Не СтрокиКасс[0].КассаПодключена
				И Не СтрокиКасс[0].ИспользоватьБезПодключенияОборудования;
			
		КонецЕсли;
		
		ИспользоватьБезПодключенияОборудования = СтрокиКасс[0].ИспользоватьБезПодключенияОборудования;
		ДекорацияСтатусИмя = СтрШаблон("ДекорацияСтатус_%1", НомерЭлемента);
		ЭлементФормыСтатус = Элементы.Найти(ДекорацияСтатусИмя);
		Если НЕ ЭлементФормыСтатус = Неопределено Тогда
			ЭлементФормыСтатус.Картинка = ?(ИспользоватьБезПодключенияОборудования, БиблиотекаКартинок.РМКЗеленыйКруг,
				БиблиотекаКартинок.РМККрасныйКруг);
		КонецЕсли;
		КарточкаСтатус = СтрШаблон("КарточкаДекорацииСтатуса_%1", НомерЭлемента);
		ЭлементКарточкаСтатус = Элементы.Найти(КарточкаСтатус);
		Если НЕ ЭлементКарточкаСтатус = Неопределено Тогда
			ЭлементКарточкаСтатус.ЦветФона = ?(ИспользоватьБезПодключенияОборудования, ЦветаФормы.БаннерЗеленыйРМК, ЦветаФормы.БаннерКрасныйРМК);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИспользоватьОборудованиеЭквайрингПриИзменении(Элемент)
	ИмяЭлемента = Элемент.Имя;
	НомерЭлемента = Число(СтрЗаменить(ИмяЭлемента, "ИспользоватьБезПодключенияЭквайринг_", ""));
	СтрокиЭквайринг = ТаблицаЭквайринговыйТерминал.НайтиСтроки(Новый Структура("НомерЭлемента", НомерЭлемента));
	
	Если СтрокиЭквайринг.Количество() > 0 Тогда
		СтрукутураИзменяемыхРеквизитов = Новый Структура;
		СтрукутураИзменяемыхРеквизитов.Вставить("ИспользоватьБезПодключенияОборудования", ЭтотОбъект[ИмяЭлемента]);
		СохранитьИзменениеЭквайринговыйТерминал(СтрокиЭквайринг[0].ЭквайринговыйТерминал, СтрукутураИзменяемыхРеквизитов);
		СтрокиЭквайринг[0].ИспользоватьБезПодключенияОборудования = ЭтотОбъект[ИмяЭлемента];
		
		ИмяРеквизитаПодключитьЭквайринг = СтрШаблон(НСтр("ru = 'ПодключитьЭквайринг_%1'"), НомерЭлемента);
		ЭлементФормы = Элементы.Найти(ИмяРеквизитаПодключитьЭквайринг);
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭлементФормы.Видимость = Не СтрокиЭквайринг[0].ЭквайрингПодключен
				И Не СтрокиЭквайринг[0].ИспользоватьБезПодключенияОборудования;
		КонецЕсли;
		
		ИспользоватьБезПодключенияОборудования = СтрокиЭквайринг[0].ИспользоватьБезПодключенияОборудования;
		ДекорацияСтатусИмя = СтрШаблон("ДекорацияСтатусЭквайринг_%1", НомерЭлемента);
		ЭлементФормыСтатус = Элементы.Найти(ДекорацияСтатусИмя);
		Если НЕ ЭлементФормыСтатус = Неопределено Тогда
			ЭлементФормыСтатус.Картинка = ?(ИспользоватьБезПодключенияОборудования, БиблиотекаКартинок.РМКЗеленыйКруг,
				БиблиотекаКартинок.РМККрасныйКруг);
		КонецЕсли;
		КарточкаСтатус = СтрШаблон("КарточкаДекорацииСтатусаЭквайринг_%1", НомерЭлемента);
		ЭлементКарточкаСтатус = Элементы.Найти(КарточкаСтатус);
		Если НЕ ЭлементКарточкаСтатус = Неопределено Тогда
			ЭлементКарточкаСтатус.ЦветФона = ?(ИспользоватьБезПодключенияОборудования, ЦветаФормы.БаннерЗеленыйРМК, ЦветаФормы.БаннерКрасныйРМК);
		КонецЕсли;
	КонецЕсли;
	
	НастройкиРМК.ИспользоватьОплатуПлатежнымиКартами = ЭтотОбъект[ИмяЭлемента];
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКИспользоватьСерверЛояльностиПолучательДанныхПриИзменении(Элемент)
	НастроитьИспользованиеСервераЛояльности();
	УстановитьИзмененностьНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПарольСерверЛояльностиПриИзменении(Элемент)
	ПарольСервераЛояльностиИзменен = Истина;
	УстановитьИзмененностьНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКАдресСервераЛояльностиПриИзменении(Элемент)
	УстановитьИзмененностьНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКПользовательСервераЛояльностиПриИзменении(Элемент)
	УстановитьИзмененностьНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКРаботаВРежимеМедленногоСоединенияПриИзменении(Элемент)
	УстановитьИзмененностьНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКТаймаутСерверЛояльностиПриИзменении(Элемент)
	УстановитьИзмененностьНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКВыполнятьЛокальныйРасчетСкидокПриИзменении(Элемент)
	УстановитьИзмененностьНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРМКЗапретитьПробитиеЧекаБезРасчетаСкидокПриИзменении(Элемент)
	УстановитьИзмененностьНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РегламентноеЗаданиеРавноОтправкеПриИзменении(Элемент)
	Элементы.ГруппаПолучениеСообщений.Доступность = НЕ РегламентноеЗаданиеРавноОтправке;
КонецПроцедуры

&НаКлиенте
Процедура ТекущееРабочееМестоПриИзменении(Элемент)
	ЗаполнитьНастройкуРабочегоМестаКассира();
	ЗаполнитьТаблицуОборудования();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовДеревоГруппДоступа
&НаКлиенте
Процедура ДеревоГруппДоступаПередРазворачиванием(Элемент, Строка, Отказ)
	ТекущаяСтрока = ДеревоГруппДоступа.НайтиПоИдентификатору(Строка);
	Если ТекущаяСтрока <> Неопределено Тогда
		НайденноеЗначение = СоответствиеСтрокРазвернутая.Получить(ТекущаяСтрока.ЭлементДерева);
		
		Если НайденноеЗначение = Неопределено Тогда
			СоответствиеСтрокРазвернутая.Вставить(ТекущаяСтрока.ЭлементДерева, Строка);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоГруппДоступаПередСворачиванием(Элемент, Строка, Отказ)
	ТекущаяСтрока = ДеревоГруппДоступа.НайтиПоИдентификатору(Строка);
	Если ТекущаяСтрока <> Неопределено Тогда
		СоответствиеСтрокРазвернутая.Удалить(ТекущаяСтрока.ЭлементДерева);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГруппДоступаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураОткрытияФормы = Новый Структура;
	СтруктураОткрытияФормы.Вставить("ГруппаДоступа", Элемент.ТекущиеДанные.ГруппаДоступа);
	СтруктураОткрытияФормы.Вставить("РежимПодбора", Истина);
	ДобавитьПользователяВГруппуДоступаИПрисвоитьКод(СтруктураОткрытияФормы);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГруппДоступаПриАктивизацииСтроки(Элемент)
	Если РаботаССотрудникамиРМК Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = Элементы.ДеревоГруппДоступа.ТекущиеДанные;
	МассивСотрудников = Новый Массив;
	Если ТекущиеДанные.Уровень = 3 Тогда
		Элементы.СписокСотрудников.ТекущаяСтрока = ТекущиеДанные.ЭлементДерева;
		МассивСотрудников.Добавить(ТекущиеДанные.ЭлементДерева);
	ИначеЕсли ТекущиеДанные.Уровень = 2 Тогда
		СотрудникиСписок = ТекущиеДанные.ПолучитьЭлементы();
		Для Каждого СтрокаДерева Из СотрудникиСписок Цикл
			МассивСотрудников.Добавить(СтрокаДерева.ЭлементДерева);
		КонецЦикла;
	КонецЕсли;
	УстановитьТекстЗапросаТаблицаСотрудников(МассивСотрудников);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицаОборудования

&НаКлиенте
Процедура ТаблицаОборудованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрокаОборудование = Элемент.ТекущиеДанные;
	Если ТекущаяСтрокаОборудование.Уровень = 1 Тогда
		ТекстПредупреждения = НСтр("ru = 'Необходимо выбрать оборудование'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	МассивНастройкиОборудования = Новый Массив;
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("ПодключаемоеОборудование", ТекущаяСтрокаОборудование.ПодключенноеОборудование);
	МассивНастройкиОборудования.Добавить(СтруктураНастройки);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("МассивНастройкиОборудования", МассивНастройкиОборудования);
	ПараметрыОткрытияФормы.Вставить("ТекущееРабочееМесто", ТекущееРабочееМесто);
	ПараметрыОткрытияФормы.Вставить("ОткрытиеОборудования", Истина);
	
	ОткрытьФорму("Обработка.ПомощникНастройкиКассовогоМестаРМК.Форма.ФормаОборудование", ПараметрыОткрытияФормы, ЭтотОбъект,
		,,,, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСписокСотрудников

&НаКлиенте
Процедура СписокСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если РаботаССотрудникамиРМК Тогда
		ПроверкаИСозданиеПерсональногоКода();
	Иначе
		ОткрытьФормуСозданияКодаДоступа();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличныйДокументФинал

&НаКлиенте
Процедура ТабличныйДокументФиналВыбор(Элемент, Область, СтандартнаяОбработка)
	Если Область.Имя = "Подсказка" Тогда
		Элементы.СтраницыПомощникаКассовогоМеста.ТекущаяСтраница = Элементы.СтраницаТипыОборудования;
		МассивСтраниц = СписокСтраниц.НайтиСтроки(Новый Структура("ИмяСтраницы", Элементы.СтраницаТипыОборудования.Имя));
		Если МассивСтраниц.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ПереключательСтраниц = МассивСтраниц[0].НомерСтраницы;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнение
&НаСервере
Процедура ЗаполнитьДанныеФормы()
	Интерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЦветаФормы = ОбщегоНазначенияРМК.ЦветаФормыРМК();
	УстановитьУсловноеОформление();
	ПараметрыВалюты = ОбщегоНазначенияРМК.ПараметрыНациональнойВалюты();
	ВалютаУчета = ПараметрыВалюты.Наименование;
	ТекущееРабочееМесто = МенеджерОборудованияРМК.РабочееМестоКлиента();
	СоздатьГруппыКассККМ();
	
	ЗаполнитьДанныеСтраницыОбмена();
	
	ЗаполнитьИменаСтраниц();
	СоздатьСтраницыПереключатели();
	ПереключательСтраниц = 1;
	
	СоздатьЭкземплярСканераШтрихкода();
	ЗаполнитьТаблицуОборудования();
	ЗаполнитьНастройкуРабочегоМестаКассира();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСтраницыТорговыйОбъект()
	
	ТекстЗапроса = НСтр("ru = ''");
	ДанныеЗаполнены = Ложь;
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТорговыйОбъект(ТорговыйОбъект, ДанныеЗаполнены);
	Если ДанныеЗаполнены Тогда
		ЗаполнитьКарточкиКассыИЭквайринг();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКарточкиКассыИЭквайринг()
	ТаблицаКассККМ.Очистить();
	ТаблицаЭквайринговыйТерминал.Очистить();
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьДанныеКассККМИЭквайринг(ТаблицаКассККМ, ТаблицаЭквайринговыйТерминал, ТорговыйОбъект);
	Для Каждого СтрокаКасса Из ТаблицаКассККМ Цикл
		ЗаполнитьКарточкиКассККМ(СтрокаКасса);
	КонецЦикла;
		
	Для Каждого СтрокаЭквайринг Из ТаблицаЭквайринговыйТерминал Цикл
		ЗаполнитьКарточкиЭквайринг(СтрокаЭквайринг);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИменаСтраниц()
	НомерСтраницы = 0;
	Для Каждого Элемент Из Элементы.СтраницыПомощникаКассовогоМеста.ПодчиненныеЭлементы Цикл
		Если Элемент.Вид = ВидГруппыФормы.Страница
			И Элемент.Видимость Тогда
			НомерСтраницы = НомерСтраницы + 1;
			НоваяСтрока = СписокСтраниц.Добавить();
			НоваяСтрока.ИмяСтраницы = Элемент.Имя;
			НоваяСтрока.НомерСтраницы = НомерСтраницы;
			НоваяСтрока.Представление = Элемент.Заголовок;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьСтраницыПереключатели()
	
	Для Каждого СтрокаТаблицы Из СписокСтраниц Цикл
		Элементы.ПереключательСтраниц.СписокВыбора.Добавить(СтрокаТаблицы.НомерСтраницы, СтрокаТаблицы.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУзлыОбмена()

	Результат = Новый Массив;
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьУзлыОбменаРМК(Результат);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		УзелОбмена = Результат[0];
		ЗаполнитьДанныеРасписанияПоУмолчанию();
		РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРасписанияПоУмолчанию()
	
	СтруктураДанныхРасписания = Новый Структура;
	СтруктураДанныхРасписания.Вставить("ВидТранспортаОбмена", Неопределено);
	СтруктураДанныхРасписания.Вставить("РасписаниеРегламентногоЗадания", Неопределено);
	
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьРасписаниеПоУмолчаниюОбменРМК(УзелОбмена, СтруктураДанныхРасписания);
	ИдентификаторТранспортаВыгрузкаДанных = СтруктураДанныхРасписания.ВидТранспортаОбмена;
	ИспользоватьРегламентноеЗаданиеВыгрузкаДанных = Истина;
	ШаблонЗаголовкаРасписания = НСтр("ru = '%1 %2'");
	ПредставлениеРасписания = Строка(СтруктураДанныхРасписания.РасписаниеРегламентногоЗадания);
	Если ПредставлениеРасписания = Строка(Новый РасписаниеРегламентногоЗадания) Тогда	
		ПредставлениеРасписания = НСтр("ru = 'Расписание не задано'");
	Иначе
		ЗаголовкаРасписания = НСтр("ru = 'Расписание'");
	КонецЕсли;
	РасписаниеРегламентногоЗаданияВыгрузкаДанных = СтруктураДанныхРасписания.РасписаниеРегламентногоЗадания;
	Элементы.НастроитьРасписаниеРегламентногоЗадания.Заголовок = СтрШаблон(ШаблонЗаголовкаРасписания, ЗаголовкаРасписания, ПредставлениеРасписания);
	
	ИдентификаторТранспортаЗагрузкаДанных = СтруктураДанныхРасписания.ВидТранспортаОбмена;
	ИспользоватьРегламентноеЗаданиеЗагрузкаДанных = Истина;
	ПредставлениеРасписания = Строка(СтруктураДанныхРасписания.РасписаниеРегламентногоЗадания);
	Если ПредставлениеРасписания = Строка(Новый РасписаниеРегламентногоЗадания) Тогда	
		ПредставлениеРасписания = НСтр("ru = 'Расписание не задано'");
	КонецЕсли;
	РасписаниеРегламентногоЗаданияЗагрузкаДанных = СтруктураДанныхРасписания.РасписаниеРегламентногоЗадания;
	Элементы.НастроитьРасписаниеРегламентногоЗагрузкаДанных.Заголовок = СтрШаблон(ШаблонЗаголовкаРасписания, ЗаголовкаРасписания, ПредставлениеРасписания);
	
	РегламентноеЗаданиеРавноОтправке = Истина;
	Элементы.ГруппаПолучениеСообщений.Доступность = Ложь;
	
	СписокВыбора = Новый Структура;
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьСписокВыбораТранспортаОбмена(УзелОбмена, СписокВыбора);
	Элементы.ИдентификаторТранспортаЗагрузкаДанных.СписокВыбора.Очистить();
	Элементы.ИдентификаторТранспортаВыгрузкаДанных.СписокВыбора.Очистить();
	Для Каждого Элемент Из СписокВыбора Цикл
		Элементы.ИдентификаторТранспортаЗагрузкаДанных.СписокВыбора.Добавить(Элемент.Ключ, Элемент.Значение);
		Элементы.ИдентификаторТранспортаВыгрузкаДанных.СписокВыбора.Добавить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПомощникНастройкиОбменаСуществует()
	
	ИмяКлассаМетаданных = "Обработки";
	ИмяОбработки = "ПомощникНастройкиОбмена";
	Возврат МетаданныеСуществуют(ИмяКлассаМетаданных, ИмяОбработки);
	
КонецФункции

&НаСервереБезКонтекста
Функция МетаданныеСуществуют(ИмяКлассаМетаданныхВоМножественномЧисле, ИмяМетаданных)
	
	Результат = Ложь;
	Попытка
		
		КоллекцияМетаданных = Метаданные[ИмяКлассаМетаданныхВоМножественномЧисле];
		Результат = КоллекцияМетаданных.Найти(ИмяМетаданных) <> Неопределено;
		
	Исключение
		
		Результат = Ложь;
		ЗаписьЖурналаРегистрации( НСтр("ru = 'Попытка обращения к несуществующим метаданным'",
			ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Предупреждение,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеСтраницыОбмена()
	ЗаполнитьДанныеСтраницыТорговыйОбъект();
	ЗаполнитьУзлыОбмена();
	ПомощникНастройкиОбменаСуществует = ПомощникНастройкиОбменаСуществует();
	ОбменНастроен = ОбщегоНазначенияРМК.НастройкаСинхронизацииДанныхСуществует();
	
	ДоступныЭлементы = НЕ ОбменНастроен Или НЕ ДанныеЗаполнены Или ДоступноРасписание;
	УстановитьВидимостьЭлементаФормы(Элементы.СтраницаНастройкиОбмена, ДоступныЭлементы);
	Если НЕ ДоступныЭлементы Тогда
		ВыполнятьПервоначальныйОбмен = Ложь;
	КонецЕсли;
	ВыполнятьПервоначальныйОбмен = ВыполнятьПервоначальныйОбмен И НЕ ДанныеЗаполнены;
	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаНастройкаОбмена, НЕ ОбменНастроен И ПомощникНастройкиОбменаСуществует);
	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаРасписаниеОбмена, ОбменНастроен И ДоступноРасписание);
	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаУправлениемРасписаниемОбмена, ОбменНастроен И ДоступноРасписание);
	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаЗагрузкаДанных, НЕ ДанныеЗаполнены И ОбменНастроен);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаПереключательСтраниц, ОбменНастроен И ДанныеЗаполнены);
	
	Если ОбменНастроен И ДанныеЗаполнены Тогда
		ЗаполнитьТаблицуСотрудников();
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементаФормы(Элемент, Видимость)
	Элемент.Видимость = Видимость;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементаФормы(Элемент, Доступность)
	Элемент.Доступность = Доступность;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементыОформления = УсловноеОформление.Элементы;
	ЭлементыОформления.Очистить();
	ЭлементОформления = ЭлементыОформления.Добавить();
	Элемент = ЭлементыОформления.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГруппДоступа.Имя);
	
	ЭлементОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГруппДоступаУровень.ПутьКДанным);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 1;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирныйРМК);
	
	Элемент = ЭлементыОформления.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаОборудование.Имя);
	
	ЭлементОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаОборудованиеУровень.ПутьКДанным);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 1;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирныйРМК);
	
	Элемент = ЭлементыОформления.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСотрудников.Имя);
	
	ЭлементОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.СписокСотрудниковАктивен.ПутьКДанным);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирныйРМК);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКарточкиКассККМ(СтруктураСозданияКарточки)
	
	ИмяРеквизитаКассаККМ = СтрШаблон(НСтр("ru = 'КассаККМ_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	ИмяРеквизитаОрганизация = СтрШаблон(НСтр("ru = 'Организация_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	ИмяРеквизитаОстатокВКассе = СтрШаблон(НСтр("ru = 'ОстатокВКассе_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	ИмяРеквизитаСверятьОФД = СтрШаблон(НСтр("ru = 'СверятьОФД_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	ИмяРеквизитаИспользоватьОборудование = СтрШаблон(НСтр("ru = 'ИспользоватьБезПодключения_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	
	ЭтотОбъект[ИмяРеквизитаКассаККМ] = СтруктураСозданияКарточки.КассаККМ;
	ЭтотОбъект[ИмяРеквизитаОрганизация] = СтруктураСозданияКарточки.Организация;
	ОстатокВКассе = СтрШаблон(НСтр("ru = '%1 %2'"), Формат(СтруктураСозданияКарточки.ОстатокВКассе, "ЧДЦ=2; ЧН=0.00"), ВалютаУчета);
	ЭтотОбъект[ИмяРеквизитаОстатокВКассе] = ОстатокВКассе;
	ЭтотОбъект[ИмяРеквизитаСверятьОФД] = СтруктураСозданияКарточки.СверятьДанныеССервисомОФД;
	ЭтотОбъект[ИмяРеквизитаИспользоватьОборудование] = СтруктураСозданияКарточки.ИспользоватьБезПодключенияОборудования;
	
	ИмяГруппыКассаККМ = СтрШаблон(НСтр("ru = 'ГруппаКассаККМ_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	ЭлементФормы = Элементы.Найти(ИмяГруппыКассаККМ);
	Если НЕ ЭлементФормы = Неопределено Тогда
		ЭлементФормы.Видимость = Истина;
		Если НЕ СтруктураСозданияКарточки.КассаПодключена
			И НЕ СтруктураСозданияКарточки.ИспользоватьБезПодключенияОборудования Тогда
			Возврат;
		КонецЕсли;
		
		ДекорацияСтатусИмя = СтрШаблон("ДекорацияСтатус_%1", СтруктураСозданияКарточки.НомерЭлемента);
		ЭлементФормыСтатус = Элементы.Найти(ДекорацияСтатусИмя);
		Если НЕ ЭлементФормыСтатус = Неопределено Тогда
			ЭлементФормыСтатус.Картинка = БиблиотекаКартинок.РМКЗеленыйКруг;
		КонецЕсли;
		КарточкаСтатус = СтрШаблон("КарточкаДекорацииСтатуса_%1", СтруктураСозданияКарточки.НомерЭлемента);
		ЭлементКарточкаСтатус = Элементы.Найти(КарточкаСтатус);
		Если НЕ ЭлементКарточкаСтатус = Неопределено Тогда
			ЭлементКарточкаСтатус.ЦветФона = ЦветаФормы.БаннерЗеленыйРМК;
		КонецЕсли;
	КонецЕсли;
	
	ИмяРеквизитаИспользоватьОборудование = СтрШаблон(НСтр("ru = 'ИспользоватьБезПодключения_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	ЭлементФормы = Элементы.Найти(ИмяРеквизитаИспользоватьОборудование);
	Если НЕ ЭлементФормы = Неопределено Тогда
		ЭлементФормы.Доступность = Не СтруктураСозданияКарточки.КассаПодключена;
	КонецЕсли;
	
	ИмяРеквизитаПодключитьКассу = СтрШаблон(НСтр("ru = 'ПодключитьКассу_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	ЭлементФормы = Элементы.Найти(ИмяРеквизитаПодключитьКассу);
	Если НЕ ЭлементФормы = Неопределено Тогда
		ЭлементФормы.Видимость = Не СтруктураСозданияКарточки.КассаПодключена
			И Не СтруктураСозданияКарточки.ИспользоватьБезПодключенияОборудования;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКарточкиЭквайринг(СтруктураСозданияКарточки)
	
	ИмяРеквизитаЭквайринговыйТерминал = СтрШаблон(НСтр("ru = 'ЭквайринговыйТерминал_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	ИмяРеквизитаОрганизацияЭквайринг = СтрШаблон(НСтр("ru = 'ОрганизацияЭквайринг_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	ИмяРеквизитаИспользоватьОборудованиеЭквайринг = СтрШаблон(НСтр("ru = 'ИспользоватьБезПодключенияЭквайринг_%1'"),
		СтруктураСозданияКарточки.НомерЭлемента);
	ИмяРеквизитаКассаККМЭквайринг = СтрШаблон(НСтр("ru = 'КассаККМЭквайринг_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	
	ЭтотОбъект[ИмяРеквизитаЭквайринговыйТерминал] = СтруктураСозданияКарточки.ЭквайринговыйТерминал;
	ЭтотОбъект[ИмяРеквизитаОрганизацияЭквайринг] = СтруктураСозданияКарточки.Организация;
	ЭтотОбъект[ИмяРеквизитаИспользоватьОборудованиеЭквайринг] = СтруктураСозданияКарточки.ИспользоватьБезПодключенияОборудования;
	ЭтотОбъект[ИмяРеквизитаКассаККМЭквайринг] = СтруктураСозданияКарточки.КассаККМ;
	
	ИмяГруппыЭквайринг = СтрШаблон(НСтр("ru = 'ГруппаЭквайринг_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	ЭлементФормы = Элементы.Найти(ИмяГруппыЭквайринг);
	Если НЕ ЭлементФормы = Неопределено Тогда
		ЭлементФормы.Видимость = Истина;
		Если НЕ СтруктураСозданияКарточки.ЭквайрингПодключен
			И НЕ СтруктураСозданияКарточки.ИспользоватьБезПодключенияОборудования Тогда
			Возврат;
		КонецЕсли;
		
		ДекорацияСтатусИмя = СтрШаблон("ДекорацияСтатусЭквайринг_%1", СтруктураСозданияКарточки.НомерЭлемента);
		ЭлементФормыСтатус = Элементы.Найти(ДекорацияСтатусИмя);
		Если НЕ ЭлементФормыСтатус = Неопределено Тогда
			ЭлементФормыСтатус.Картинка = БиблиотекаКартинок.РМКЗеленыйКруг;
		КонецЕсли;
		КарточкаСтатус = СтрШаблон("КарточкаДекорацииСтатусаЭквайринг_%1", СтруктураСозданияКарточки.НомерЭлемента);
		ЭлементКарточкаСтатус = Элементы.Найти(КарточкаСтатус);
		Если НЕ ЭлементКарточкаСтатус = Неопределено Тогда
			ЭлементКарточкаСтатус.ЦветФона = ЦветаФормы.БаннерЗеленыйРМК;
		КонецЕсли;
	КонецЕсли;
	
	ИмяРеквизитаПодключитьЭквайринг = СтрШаблон(НСтр("ru = 'ПодключитьЭквайринг_%1'"), СтруктураСозданияКарточки.НомерЭлемента);
	ЭлементФормы = Элементы.Найти(ИмяРеквизитаПодключитьЭквайринг);
	Если НЕ ЭлементФормы = Неопределено Тогда
		ЭлементФормы.Видимость = Не СтруктураСозданияКарточки.ЭквайрингПодключен
			И Не СтруктураСозданияКарточки.ИспользоватьБезПодключенияОборудования;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппыКассККМ()
	НомерПоПорядку = 0;
	Для НомерЭлемента = 1 По 3 Цикл
		НомерПоПорядку = НомерПоПорядку + 1;
		
		ИмяГруппыКассаККМ = СтрШаблон(НСтр("ru = 'ГруппаКассаККМ_%1'"), НомерПоПорядку);
		НоваяГруппаКарточка = Элементы.Добавить(ИмяГруппыКассаККМ, Тип("ГруппаФормы"), Элементы.ГруппаРядКассыККМ);
		НоваяГруппаКарточка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаКарточка.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппаКарточка.ОтображатьЗаголовок = Ложь;
		НоваяГруппаКарточка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппаКарточка.ОтображатьКакКарточку = Истина;
		НоваяГруппаКарточка.РастягиватьПоГоризонтали = Истина;
		НоваяГруппаКарточка.Видимость = Ложь;
		
		ДобавляемыеРеквизиты = Новый Массив;
		ТипРеквизита = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.КассаККМРМК.Тип);
		ИмяРеквизитаКассаККМ = СтрШаблон(НСтр("ru = 'КассаККМ_%1'"), НомерПоПорядку);
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаКассаККМ, ТипРеквизита);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		ТипРеквизита = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ОрганизацияРМК.Тип);
		ИмяРеквизитаОрганизация = СтрШаблон(НСтр("ru = 'Организация_%1'"), НомерПоПорядку);
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаОрганизация, ТипРеквизита);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		ИмяРеквизитаОстатокВКассе = СтрШаблон(НСтр("ru = 'ОстатокВКассе_%1'"), НомерПоПорядку);
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаОстатокВКассе, Новый ОписаниеТипов("Строка"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		ИмяРеквизитаСверятьОФД = СтрШаблон(НСтр("ru = 'СверятьОФД_%1'"), НомерПоПорядку);
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаСверятьОФД, Новый ОписаниеТипов("Булево"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		ИмяРеквизитаИспользоватьОборудование = СтрШаблон(НСтр("ru = 'ИспользоватьБезПодключения_%1'"), НомерПоПорядку);
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаИспользоватьОборудование, Новый ОписаниеТипов("Булево"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		УправлениеКассаККМ = СтрШаблон(НСтр("ru = 'ГруппаУправлениеКассаККМ_%1'"), НомерПоПорядку);
		НоваяГруппаКарточкаУправление = Элементы.Добавить(УправлениеКассаККМ, Тип("ГруппаФормы"), НоваяГруппаКарточка);
		НоваяГруппаКарточкаУправление.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаКарточкаУправление.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппаКарточкаУправление.ОтображатьЗаголовок = Ложь;
		НоваяГруппаКарточкаУправление.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		ГруппаСтатусИмя = СтрШаблон("ГруппаСтатус_%1", НомерПоПорядку);
		ГруппаСтатус = Элементы.Добавить(ГруппаСтатусИмя, Тип("ГруппаФормы"), НоваяГруппаКарточкаУправление);
		ГруппаСтатус.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСтатус.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаСтатус.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСтатус.ОтображатьЗаголовок = Ложь;
		ГруппаСтатус.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ГруппаСтатус.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		
		КарточкаСтатус = СтрШаблон("КарточкаДекорацииСтатуса_%1", НомерПоПорядку);
		КарточкаДекорации = Элементы.Добавить(КарточкаСтатус, Тип("ГруппаФормы"), ГруппаСтатус);
		КарточкаДекорации.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		КарточкаДекорации.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		КарточкаДекорации.Отображение = ОтображениеОбычнойГруппы.Нет;
		КарточкаДекорации.ОтображатьЗаголовок = Ложь;
		КарточкаДекорации.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		КарточкаДекорации.ЦветФона = ?(Интерфейс85, ЦветаПалитры.Красный, ЦветаПалитры.КрасныйСветлоТусклыйРМК);
		
		ДекорацияСтатусИмя = СтрШаблон("ДекорацияСтатус_%1", НомерПоПорядку);
		ДекорацияСтатус = Элементы.Добавить(ДекорацияСтатусИмя, Тип("ДекорацияФормы"), КарточкаДекорации);
		ДекорацияСтатус.Вид = ВидДекорацииФормы.Картинка;
		ДекорацияСтатус.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
		ДекорацияСтатус.Шрифт = Новый Шрифт(ШрифтыСтиля.ТекстТретьегоУровня,,,,,,,70);
		ДекорацияСтатус.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		ДекорацияСтатус.Картинка = БиблиотекаКартинок.РМККрасныйКруг;
		ДекорацияСтатус.ОтображениеФона = ОтображениеФонаКартинки.НеОтображать;
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаКассаККМ, Тип("ПолеФормы"), НоваяГруппаКарточкаУправление);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаКассаККМ;
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		ИмяДекорацииОтступ = СтрШаблон(НСтр("ru = 'ДекорацияОтступ_%1'"), НомерПоПорядку);
		НовыйЭлемент = Элементы.Добавить(ИмяДекорацииОтступ, Тип("ДекорацияФормы"), НоваяГруппаКарточкаУправление);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		
		ИмяИнформацияКассаККМ = СтрШаблон(НСтр("ru = 'ГруппаИнформацияКассаККМ_%1'"), НомерПоПорядку);
		НоваяГруппаКарточкаИнформация = Элементы.Добавить(ИмяИнформацияКассаККМ, Тип("ГруппаФормы"), НоваяГруппаКарточка);
		НоваяГруппаКарточкаИнформация.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаКарточкаИнформация.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппаКарточкаИнформация.ОтображатьЗаголовок = Ложь;
		НоваяГруппаКарточкаИнформация.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаОрганизация, Тип("ПолеФормы"), НоваяГруппаКарточкаИнформация);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Заголовок = НСтр("ru = 'Организация'");
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаОрганизация;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаОстатокВКассе, Тип("ПолеФормы"), НоваяГруппаКарточкаИнформация);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Заголовок = НСтр("ru = 'Наличные в кассе'");
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаОстатокВКассе;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.МаксимальнаяШирина = 13;
		
		ИмяГруппыСверкаОФД = СтрШаблон(НСтр("ru = 'ГруппаСверкаОФД_%1'"), НомерПоПорядку);
		НоваяГруппаСверкаОФД = Элементы.Добавить(ИмяГруппыСверкаОФД, Тип("ГруппаФормы"), НоваяГруппаКарточка);
		НоваяГруппаСверкаОФД.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаСверкаОФД.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппаСверкаОФД.ОтображатьЗаголовок = Ложь;
		НоваяГруппаСверкаОФД.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппаСверкаОФД.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаСверятьОФД, Тип("ПолеФормы"), НоваяГруппаСверкаОФД);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.Заголовок = НСтр("ru = 'Сверять данные с ОФД при закрытии смены.'");
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаСверятьОФД;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_СверятьСОФДПриИзменении");
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаИспользоватьОборудование, Тип("ПолеФормы"), НоваяГруппаКарточка);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.Заголовок = НСтр("ru = 'Использовать без подключения оборудования'");
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаИспользоватьОборудование;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ИспользоватьОборудованиеПриИзменении");
		
		ИмяКомандыПодключитьКассу = СтрШаблон(НСтр("ru = 'ПодключитьКассу_%1'"), НомерПоПорядку);
		НовыйЭлемент = ЭтотОбъект.Элементы.Добавить(ИмяКомандыПодключитьКассу, Тип("КнопкаФормы"), НоваяГруппаКарточка);
		НовыйЭлемент.Заголовок = НСтр("ru = 'Подключить кассу'");
		НовыйЭлемент.ИмяКоманды = НСтр("ru = 'ПодключитьКассу'");
		НовыйЭлемент.Отображение = ОтображениеКнопки.Текст;
		НовыйЭлемент.Важность = ВажностьКнопки.Дополнительная;
		
		ДанныеПодсказки = Новый Массив;
		ИмяРасширеннойПодсказки = СтрШаблон(НСтр("ru = 'ГруппаСверкаОФД_%1%2'"), НомерПоПорядку, НСтр("ru = 'РасширеннаяПодсказка'"));
		НавигационнаяСсылка = СтрШаблон(НСтр("ru = 'ИнтеграцияСОФД_%1%2'"), НомерПоПорядку);
		ДанныеПодсказки.Добавить(НСтр("ru = 'Для настройки перейдите в'"));
		ДанныеПодсказки.Добавить(НСтр("ru = ' '"));
		ДанныеПодсказки.Добавить(Новый ФорматированнаяСтрока(
			НСтр("ru= 'форму интеграции с ОФД.'"),,
			,,
			НавигационнаяСсылка));
		ПодсказкаТекст = Новый ФорматированнаяСтрока(ДанныеПодсказки);
		Элементы[ИмяРасширеннойПодсказки].Заголовок = ПодсказкаТекст;
		Элементы[ИмяРасширеннойПодсказки].УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_СверятьСОФДНажатие");
		
		ИмяГруппыЭквайринговыйТерминал = СтрШаблон(НСтр("ru = 'ГруппаЭквайринг_%1'"), НомерПоПорядку);
		НоваяГруппаКарточкаЭквайринг = Элементы.Добавить(ИмяГруппыЭквайринговыйТерминал, Тип("ГруппаФормы"), Элементы.ГруппаРядЭквайринговыеТерминалы);
		НоваяГруппаКарточкаЭквайринг.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаКарточкаЭквайринг.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппаКарточкаЭквайринг.ОтображатьЗаголовок = Ложь;
		НоваяГруппаКарточкаЭквайринг.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппаКарточкаЭквайринг.ОтображатьКакКарточку = Истина;
		НоваяГруппаКарточкаЭквайринг.РастягиватьПоГоризонтали = Истина;
		НоваяГруппаКарточкаЭквайринг.Видимость = Ложь;
		
		ДобавляемыеРеквизиты = Новый Массив;
		ТипРеквизита = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ЭквайринговыйТерминалРМК.Тип);
		ИмяРеквизитаЭквайринговыйТерминал = СтрШаблон(НСтр("ru = 'ЭквайринговыйТерминал_%1'"), НомерПоПорядку);
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаЭквайринговыйТерминал, ТипРеквизита);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		ТипРеквизита = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.КассаККМРМК.Тип);
		ИмяРеквизитаКассаККМЭквайринг = СтрШаблон(НСтр("ru = 'КассаККМЭквайринг_%1'"), НомерПоПорядку);
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаКассаККМЭквайринг, ТипРеквизита);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		ТипРеквизита = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ОрганизацияРМК.Тип);
		ИмяРеквизитаОрганизацияЭквайринг = СтрШаблон(НСтр("ru = 'ОрганизацияЭквайринг_%1'"), НомерПоПорядку);
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаОрганизацияЭквайринг, ТипРеквизита);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		ИмяРеквизитаИспользоватьОборудованиеЭквайринг = СтрШаблон(НСтр("ru = 'ИспользоватьБезПодключенияЭквайринг_%1'"), НомерПоПорядку);
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаИспользоватьОборудованиеЭквайринг, Новый ОписаниеТипов("Булево"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		УправлениеЭквайринг = СтрШаблон(НСтр("ru = 'ГруппаУправлениеЭквайринг_%1'"), НомерПоПорядку);
		НоваяГруппаКарточкаУправление = Элементы.Добавить(УправлениеЭквайринг, Тип("ГруппаФормы"), НоваяГруппаКарточкаЭквайринг);
		НоваяГруппаКарточкаУправление.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаКарточкаУправление.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппаКарточкаУправление.ОтображатьЗаголовок = Ложь;
		НоваяГруппаКарточкаУправление.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		ГруппаСтатусИмя = СтрШаблон("ГруппаСтатусЭквайринг_%1", НомерПоПорядку);
		ГруппаСтатус = Элементы.Добавить(ГруппаСтатусИмя, Тип("ГруппаФормы"), НоваяГруппаКарточкаУправление);
		ГруппаСтатус.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСтатус.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаСтатус.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСтатус.ОтображатьЗаголовок = Ложь;
		ГруппаСтатус.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ГруппаСтатус.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		
		КарточкаСтатус = СтрШаблон("КарточкаДекорацииСтатусаЭквайринг_%1", НомерПоПорядку);
		КарточкаДекорации = Элементы.Добавить(КарточкаСтатус, Тип("ГруппаФормы"), ГруппаСтатус);
		КарточкаДекорации.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		КарточкаДекорации.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		КарточкаДекорации.Отображение = ОтображениеОбычнойГруппы.Нет;
		КарточкаДекорации.ОтображатьЗаголовок = Ложь;
		КарточкаДекорации.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		КарточкаДекорации.ЦветФона = ?(Интерфейс85, ЦветаПалитры.Красный, ЦветаПалитры.КрасныйСветлоТусклыйРМК);
		
		ДекорацияСтатусИмя = СтрШаблон("ДекорацияСтатусЭквайринг_%1", НомерПоПорядку);
		ДекорацияСтатус = Элементы.Добавить(ДекорацияСтатусИмя, Тип("ДекорацияФормы"), КарточкаДекорации);
		ДекорацияСтатус.Вид = ВидДекорацииФормы.Картинка;
		ДекорацияСтатус.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
		ДекорацияСтатус.Шрифт = Новый Шрифт(ШрифтыСтиля.ТекстТретьегоУровня,,,,,,,70);
		ДекорацияСтатус.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		ДекорацияСтатус.Картинка = БиблиотекаКартинок.РМККрасныйКруг;
		ДекорацияСтатус.ОтображениеФона = ОтображениеФонаКартинки.НеОтображать;
		
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаЭквайринговыйТерминал, Тип("ПолеФормы"), НоваяГруппаКарточкаУправление);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаЭквайринговыйТерминал;
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		ИмяДекорацииОтступ = СтрШаблон(НСтр("ru = 'ДекорацияОтступЭквайринг_%1'"), НомерПоПорядку);
		НовыйЭлемент = Элементы.Добавить(ИмяДекорацииОтступ, Тип("ДекорацияФормы"), НоваяГруппаКарточкаУправление);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		
		ИмяИнформацияЭквайринг = СтрШаблон(НСтр("ru = 'ГруппаИнформацияЭквайринг_%1'"), НомерПоПорядку);
		НоваяГруппаКарточкаИнформация = Элементы.Добавить(ИмяИнформацияЭквайринг, Тип("ГруппаФормы"), НоваяГруппаКарточкаЭквайринг);
		НоваяГруппаКарточкаИнформация.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаКарточкаИнформация.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппаКарточкаИнформация.ОтображатьЗаголовок = Ложь;
		НоваяГруппаКарточкаИнформация.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаОрганизацияЭквайринг, Тип("ПолеФормы"), НоваяГруппаКарточкаИнформация);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Заголовок = НСтр("ru = 'Организация'");
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаОрганизацияЭквайринг;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаКассаККМЭквайринг, Тип("ПолеФормы"), НоваяГруппаКарточкаИнформация);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Заголовок = НСтр("ru = 'Касса'");
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаКассаККМЭквайринг;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаИспользоватьОборудованиеЭквайринг, Тип("ПолеФормы"), НоваяГруппаКарточкаЭквайринг);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.Заголовок = НСтр("ru = 'Использовать без подключения оборудования'");
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаИспользоватьОборудованиеЭквайринг;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ИспользоватьОборудованиеЭквайрингПриИзменении");
		
		ИмяКомандыПодключитьЭквайринг= СтрШаблон(НСтр("ru = 'ПодключитьЭквайринг_%1'"), НомерПоПорядку);
		НовыйЭлемент = ЭтотОбъект.Элементы.Добавить(ИмяКомандыПодключитьЭквайринг, Тип("КнопкаФормы"), НоваяГруппаКарточкаЭквайринг);
		НовыйЭлемент.Заголовок = НСтр("ru = 'Подключить эквайринг'");
		НовыйЭлемент.ИмяКоманды = НСтр("ru = 'ПодключитьЭквайринг'");
		НовыйЭлемент.Отображение = ОтображениеКнопки.Текст;
		НовыйЭлемент.Важность = ВажностьКнопки.Дополнительная;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначениеКонстанты(КонстантаИмя, ТекущееЗначениеКонстанты)
	
	Если КонстантаИмя <> "" Тогда
		
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = ТекущееЗначениеКонстанты;
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкуРабочегоМестаКассира()
	ДоступныеНастройкиРМК = ОбщегоНазначенияРМК.НастройкиРМКДляТекущегоРабочегоМеста(ТекущееРабочееМесто);
	КоличествоДоступныхНастроек = ДоступныеНастройкиРМК.Количество();
	
	Если КоличествоДоступныхНастроек = 1
		И ЗначениеЗаполнено(ДоступныеНастройкиРМК[0]) Тогда
		
		НастройкиОбъект = ДоступныеНастройкиРМК[0].ПолучитьОбъект();
		ЗначениеВРеквизитФормы(НастройкиОбъект, "НастройкиРМК");
	КонецЕсли;
	
	НастроитьКассировДляВхода = Ложь;
	ОбщегоНазначенияРМКПереопределяемый.УстановитьНастройкуКассировДляВхода(НастроитьКассировДляВхода);
	НастройкиРМК.НастроитьКассировДляВхода = НастроитьКассировДляВхода;
	ЗаполнитьДанныеСервераЛояльности();
КонецПроцедуры

#КонецОбласти

#Область ПереключениеСтраниц
&НаКлиенте
Процедура ПереключитьСтраницу()
	ПереключитьСтраницуКоманда();
	
	ТекущаяСтраница = Элементы.СтраницыПомощникаКассовогоМеста.ТекущаяСтраница;
	Если ТекущаяСтраница = Элементы.СтраницаНастройкиРМК
		И Не ФормаНастроекОткрыта Тогда
		ОповещениеЗакрытия = Новый ОписаниеОповещения("УстановитьНастройкиПослеЗакрытияФормы", ЭтотОбъект);
		ПараметрыОткрытияФормыНастроек = Новый Структура;
		ПараметрыОткрытияФормыНастроек.Вставить("ПомощникНастройкиРабочегоМеста", Истина);
		ПараметрыОткрытияФормыНастроек.Вставить("НастройкиИзменены", НастройкиИзменены);
		ПараметрыОткрытияФормыНастроек.Вставить("ПарольСервераЛояльностиИзменен", ПарольСервераЛояльностиИзменен);
		СписокПереключателей = Новый Массив;
		Для Каждого СтрокаТаблицы Из СписокСтраниц Цикл
			СтруктураПереключателей = Новый Структура;
			СтруктураПереключателей.Вставить("НомерСтраницы", СтрокаТаблицы.НомерСтраницы);
			СтруктураПереключателей.Вставить("Представление", СтрокаТаблицы.Представление);
			СписокПереключателей.Добавить(СтруктураПереключателей);
		КонецЦикла;
		ФормаНастроекОткрыта = Истина;
		ПараметрыОткрытияФормыНастроек.Вставить("СписокПереключателей", СписокПереключателей);
		ПараметрыОткрытияФормыНастроек.Вставить("НастройкаРМК", НастройкиРМК);
		ПараметрыОткрытияФормыНастроек.Вставить("НомерСтраницы", ПереключательСтраниц);
		ПараметрыОткрытияФормыНастроек.Вставить("ПарольСерверЛояльности", ПарольСерверЛояльности);
		ОткрытьФорму("ОбщаяФорма.НастройкиРабочегоМестаКассира", ПараметрыОткрытияФормыНастроек,ЭтотОбъект,,ЭтотОбъект.Окно,,ОповещениеЗакрытия,
			РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать,РежимОтображенияОкнаФормы.ВОсновномОкне);
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаРезультат Тогда
		ЗаполнитьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПереключитьСтраницуКоманда()
	МассивСтраниц = СписокСтраниц.НайтиСтроки(Новый Структура("НомерСтраницы", ПереключательСтраниц));
	Если МассивСтраниц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыПомощникаКассовогоМеста.ТекущаяСтраница = Элементы[МассивСтраниц[0].ИмяСтраницы];
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

&НаКлиенте
Процедура ОткрытьПомощникНастройкиОбмена()
	Если ПомощникНастройкиОбменаСуществует
		И Не ОбменНастроен Тогда
		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуНастройкиОбменаРезультат", ЭтотОбъект);
		ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуНастройкиОбмена(ОбработчикОповещения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапускОбмена()
	Если Не УзелОбмена = ПредопределенноеЗначение("ПланОбмена.ОбменСУРМК.ПустаяСсылка")
		И ВыполнятьПервоначальныйОбмен Тогда
		ВыполнитьПервоначальныйОбмен();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПервоначальныйОбмен()
	ТекстВопроса = НСтр("ru = 'Выполнить первоначальный обмен?'");
	СписокОтветов = Новый СписокЗначений;
	СписокОтветов.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Выполнить'"));
	СписокОтветов.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Отмена'"));
	ОповещениеПоРезультатуВопроса = Новый ОписаниеОповещения("ВыполнитьПервоначальныйОбменРезультат", ЭтаФорма);
	ПоказатьВопрос(ОповещениеПоРезультатуВопроса, ТекстВопроса, СписокОтветов, ,КодВозвратаДиалога.Да, НСтр("ru = 'Обмен данными'"));
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияДанных(ОписаниеСтрокиПриложения)
	
	РезультатДополнительнойПроверки = (ОписаниеСтрокиПриложения.ВариантОбменаДанными <> "Синхронизация" ИЛИ ОписаниеСтрокиПриложения.ИспользоватьДопОтборы);
	
	Если ОписаниеСтрокиПриложения.ПолученоСообщениеДляСопоставления
		ИЛИ (ОписаниеСтрокиПриложения.ДоступнаИнтерактивнаяОтправка И РезультатДополнительнойПроверки)
		Тогда
		
		ОткрытьПомощникИнтерактивнойСинхронизации(ОписаниеСтрокиПриложения);
		
	Иначе
		
		ОткрытьПомощникАвтоматическойСинхронизации(ОписаниеСтрокиПриложения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПомощникИнтерактивнойСинхронизации(ДополнительныеПараметры)
	
	РежимДополненияВыгрузки = ДополнительныеПараметры.ИспользоватьДопОтборы ИЛИ (ДополнительныеПараметры.ВариантОбменаДанными = "ПолучениеИОтправка");
	
	ПараметрыПомощника = Новый Структура;
	ПараметрыПомощника.Вставить("ЭтоОбменСПриложениемВСервисе", ДополнительныеПараметры.ЭтоОбменСПриложениемВСервисе);
	ПараметрыПомощника.Вставить("ОбластьДанныхКорреспондента",  ДополнительныеПараметры.ОбластьДанныхКорреспондента);
	ПараметрыПомощника.Вставить("ОтправитьДанные", Не ДополнительныеПараметры.ЗапускОбменаИзКорреспондента);
	ПараметрыПомощника.Вставить("РежимДополненияВыгрузки", РежимДополненияВыгрузки);
	ПараметрыПомощника.Вставить("НастройкаРасписания", Ложь);
	
	ВспомогательныеПараметры = Новый Структура;
	ВспомогательныеПараметры.Вставить("ПараметрыПомощника", ПараметрыПомощника);
	ВспомогательныеПараметры.Вставить("ОповещениеОЗакрытии", Новый ОписаниеОповещения("ПослеЗакрытияПомощникаОбменов", ЭтотОбъект, ДополнительныеПараметры));
	
	ОбменДаннымиКлиент.ОткрытьПомощникСопоставленияОбъектовОбработкаКоманды(ДополнительныеПараметры.УзелИнформационнойБазы, ЭтотОбъект, ВспомогательныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПомощникАвтоматическойСинхронизации(ДополнительныеПараметры)
	
	ПараметрыПомощника = Новый Структура;	
	ПараметрыПомощника.Вставить("ЭтоОбменСПриложениемВСервисе", ДополнительныеПараметры.ЭтоОбменСПриложениемВСервисе);
	ПараметрыПомощника.Вставить("ОбластьДанныхКорреспондента",  ДополнительныеПараметры.ОбластьДанныхКорреспондента);
		
	ВспомогательныеПараметры = Новый Структура;
	ВспомогательныеПараметры.Вставить("ПараметрыПомощника", ПараметрыПомощника);
	ВспомогательныеПараметры.Вставить("ОповещениеОЗакрытии", Новый ОписаниеОповещения("ПослеЗакрытияПомощникаОбменов", ЭтотОбъект, ДополнительныеПараметры));
	
	ОбменДаннымиКлиент.ВыполнитьОбменДаннымиОбработкаКоманды(ДополнительныеПараметры.УзелИнформационнойБазы, ЭтотОбъект, , Истина, ВспомогательныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРасписаниеНаСервере()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("РегламентноеЗаданиеРавноОтправке", РегламентноеЗаданиеРавноОтправке);
	СтруктураДанных.Вставить("ИспользоватьРегламентноеЗаданиеВыгрузкаДанных", ИспользоватьРегламентноеЗаданиеВыгрузкаДанных);
	СтруктураДанных.Вставить("ИспользоватьРегламентноеЗаданиеЗагрузкаДанных", ИспользоватьРегламентноеЗаданиеПолучение);
	СтруктураДанных.Вставить("РасписаниеРегламентногоЗаданияВыгрузкаДанных", РасписаниеРегламентногоЗаданияВыгрузкаДанных);
	СтруктураДанных.Вставить("РасписаниеРегламентногоЗаданияЗагрузкаДанных", РасписаниеРегламентногоЗаданияЗагрузкаДанных);
	СтруктураДанных.Вставить("ВидТранспортаВыгрузкаДанных", ИдентификаторТранспортаВыгрузкаДанных);
	СтруктураДанных.Вставить("ВидТранспортаЗагрузкаДанных", ИдентификаторТранспортаЗагрузкаДанных);
	
	ОбщегоНазначенияРМКПереопределяемый.ДобавитьРасписаниеОбменаРМК(УзелОбмена, СтруктураДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидТранспорта()
	
	СтруктураДанныхРасписания = Новый Структура;
	СтруктураДанныхРасписания.Вставить("ВидТранспортаОбмена", Неопределено);
	СтруктураДанныхРасписания.Вставить("РасписаниеРегламентногоЗадания", Неопределено);
	
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьРасписаниеПоУмолчаниюОбменРМК(УзелОбмена, СтруктураДанныхРасписания);
	
	ИдентификаторТранспортаВыгрузкаДанных = СтруктураДанныхРасписания.ВидТранспортаОбмена;
	ИдентификаторТранспортаЗагрузкаДанных = СтруктураДанныхРасписания.ВидТранспортаОбмена;
КонецПроцедуры

Процедура ОбновитьПредставлениеРасписания(Расписание, ВыгрузкаДанных = Истина)
	
	ПредставлениеРасписания = Строка(Расписание);
	
	Если ПредставлениеРасписания = Строка(Новый РасписаниеРегламентногоЗадания) Тогда
		
		ПредставлениеРасписания = НСтр("ru = 'Расписание не задано'");
		
	КонецЕсли;
	
	Если ВыгрузкаДанных Тогда
		Элементы.НастроитьРасписаниеРегламентногоЗадания.Заголовок = ПредставлениеРасписания;
	Иначе
		Элементы.НастроитьРасписаниеРегламентногоЗагрузкаДанных.Заголовок = ПредставлениеРасписания;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаСотрудников

&НаСервере
Процедура ЗаполнитьТаблицуСотрудников()
	Если РаботаССотрудникамиРМК Тогда
		ОбщегоНазначенияРМКПереопределяемый.СоздатьГруппыДоступаПоУмолчанию();
		ОбщегоНазначенияРМКПереопределяемый.СоздатьПользователейПриПервоначальномЗаполнении(ПродавцыНеПередаются, ТорговыйОбъект);
	КонецЕсли;
	МассивСотрудников = Новый Массив;
	ОбщегоНазначенияРМКПереопределяемый.СформироватьДинамическийСписокСотрудники(СписокСотрудников, МассивСотрудников);
	ЗаполнитьДеревоГруппыДоступа();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоГруппыДоступа()
	
	ЭлементыГруппыДоступа = ДеревоГруппДоступа.ПолучитьЭлементы();
	ЭлементыГруппыДоступа.Очистить();
	
	ТекстЗапроса = НСтр("ru = ''");
	
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТекстЗапросаДеревоГруппыДоступа(ТекстЗапроса);
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ДеревоОбъект = РеквизитФормыВЗначение("ДеревоГруппДоступа");
		ВыборкаГруппаДоступа = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппаДоступа.Следующий() Цикл
			СтрокиГруппыДоступа = ДеревоОбъект.Строки.Добавить();
			СтрокиГруппыДоступа.ЭлементДерева = ВыборкаГруппаДоступа.ГруппаДоступа;
			СтрокиГруппыДоступа.ГруппаДоступа = ВыборкаГруппаДоступа.ГруппаДоступа;
			СтрокиГруппыДоступа.Уровень = 1;
			ВыборкаПользователи = ВыборкаГруппаДоступа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПользователи.Следующий() Цикл
				Если Не ЗначениеЗаполнено(ВыборкаПользователи.Пользователь) Тогда
					Продолжить;
				КонецЕсли;
				СтрокиПользователи = СтрокиГруппыДоступа.Строки.Добавить();
				СтрокиПользователи.ЭлементДерева = ВыборкаПользователи.Пользователь;
				СтрокиПользователи.ГруппаДоступа = ВыборкаПользователи.ГруппаДоступа;
				Если НЕ РаботаССотрудникамиРМК Тогда
					ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТорговыйОбъектПользователя(ВыборкаПользователи.Пользователь, СтрокиПользователи.ТорговыйОбъект);
				КонецЕсли;
				СтрокиПользователи.Уровень = 2;
				Выборка = ВыборкаПользователи.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Не ЗначениеЗаполнено(Выборка.ФизическоеЛицо) Тогда
						Продолжить;
					КонецЕсли;
					Строки = СтрокиПользователи.Строки.Добавить();
					Строки.ЭлементДерева = Выборка.ФизическоеЛицо;
					Строки.ГруппаДоступа = Выборка.ГруппаДоступа;
					Строки.Пользователь = ВыборкаПользователи.Пользователь;
					Строки.Уровень = 3;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоОбъект, "ДеревоГруппДоступа");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователейВТаблицу()
	Если РаботаССотрудникамиРМК Тогда
		ДобавитьПользователейВГруппуДоступа();
	Иначе
		ДобавитьСотрудникаКПользователю();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователейВГруппуДоступа()
	ВыбранныеПользователи = Элементы.СписокСотрудников.ВыделенныеСтроки;
	МассивПользователей = Новый Массив;
	Если ВыбранныеПользователи.Количество() > 0 Тогда
		Для Каждого СтрокаСписка Из ВыбранныеПользователи Цикл
			СтрокаТаблицы = Элементы.СписокСотрудников.ДанныеСтроки(СтрокаСписка);
			ДобавитьСтрокуПользователяВМассив(СтрокаТаблицы, МассивПользователей);
		КонецЦикла;
	Иначе
		ТекущаяСтрокаПользователь = Элементы.СписокСотрудников.ТекущиеДанные;
		ДобавитьСтрокуПользователяВМассив(ТекущаяСтрокаПользователь, МассивПользователей);
	КонецЕсли;
	
	ТекущаяСтрокаГруппаДоступа = Элементы.ДеревоГруппДоступа.ТекущиеДанные;
	ВыбраннаяГруппа = ТекущаяСтрокаГруппаДоступа.ГруппаДоступа;
	
	ТекстВопроса = НСтр("ru = 'Добавить пользователей в группу доступа %1?'");
	
	ДополнительныеПараметрыВопроса = Новый Структура;
	ДополнительныеПараметрыВопроса.Вставить("МассивПользователей", МассивПользователей);
	ДополнительныеПараметрыВопроса.Вставить("ВыбраннаяГруппа", ВыбраннаяГруппа);
	ОповещениеОЗакрытииВопроса = Новый ОписаниеОповещения("ДобавитьПользователяОповещениеОЗакрытииВопроса",
		ЭтотОбъект, ДополнительныеПараметрыВопроса);
		
	СписокЗначенийОтветы = Новый СписокЗначений;
	СписокЗначенийОтветы.Добавить(КодВозвратаДиалога.Да, НСтр("ru= 'Добавить'"));
	СписокЗначенийОтветы.Добавить(КодВозвратаДиалога.Нет, НСтр("ru= 'Отменить'"));
	ПоказатьВопрос(ОповещениеОЗакрытииВопроса, СтрШаблон(ТекстВопроса, ВыбраннаяГруппа),СписокЗначенийОтветы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуПользователяВМассив(СтрокаТаблицы, МассивПользователей)
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Пользователь", СтрокаТаблицы.Пользователь);
	СтруктураСтроки.Вставить("Кассир", СтрокаТаблицы.Кассир);
	СтруктураСтроки.Вставить("КодСотрудника", СтрокаТаблицы.КодСотрудника);
	МассивПользователей.Добавить(СтруктураСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователяВГруппуДоступаИПрисвоитьКод(СтруктураОткрытияФормы)
	
	Если РаботаССотрудникамиРМК Тогда
		ОбработкаОповещенияЗакрытияФормы = Новый ОписаниеОповещения("ПерезаполнитьСпискиГрупп", ЭтотОбъект);
		ОткрытьФорму("Обработка.ПомощникНастройкиКассовогоМестаРМК.Форма.ФормаКодаДоступа",
			СтруктураОткрытияФормы, ЭтотОбъект, Новый УникальныйИдентификатор, , , ОбработкаОповещенияЗакрытияФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуГруппыДоступа(ЭтотОбъект, СтруктураОткрытияФормы);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПользователяВГруппуДоступаНаСервере(МассивПользователей, ВыбраннаяГруппа)
	СтрукутраЗаписи = Новый Структура;
	СтрукутраЗаписи.Вставить("ГруппаДоступа", ВыбраннаяГруппа);
	СтрукутраЗаписи.Вставить("УстанавливатьКод", Ложь);
	СтрукутраЗаписи.Вставить("РежимПодбора", Ложь);
	СтрукутраЗаписи.Вставить("ОтправлятьЭлектроннуюПочту", Ложь);
	ОбщегоНазначенияРМКПереопределяемый.ЗаписатьНастройкиПользователей(МассивПользователей, СтрукутраЗаписи);
КонецПроцедуры

&НаСервере
Процедура ОбновитьИдентификаторыСтрок(СоответствиеСтрокРазвернутая, ДополнительныеПараметры)
	Если СоответствиеСтрокРазвернутая = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьИдентификаторыЭлементовДерева(ДеревоГруппДоступа, СоответствиеСтрокРазвернутая, ДополнительныеПараметры);
	
	Для Каждого ЭлементСоответствия Из СоответствиеСтрокРазвернутая Цикл
		СтрокаДерева = ДеревоГруппДоступа.НайтиПоИдентификатору(ЭлементСоответствия.Значение);
		Если СтрокаДерева = Неопределено Тогда
			СоответствиеСтрокРазвернутая.Удалить(ЭлементСоответствия.Ключ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьИдентификаторыЭлементовДерева(ДеревоЗначений, СоответствиеСтрокРазвернутая, ДополнительныеПараметры)
	ЭлементыДерева = ДеревоЗначений.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из ЭлементыДерева Цикл
		НайденноеЗначение = СоответствиеСтрокРазвернутая.Получить(СтрокаДерева.ЭлементДерева);
		Если НЕ НайденноеЗначение = Неопределено Тогда
			СоответствиеСтрокРазвернутая.Удалить(СтрокаДерева.ЭлементДерева);
			СоответствиеСтрокРазвернутая.Вставить(СтрокаДерева.ЭлементДерева, СтрокаДерева.ПолучитьИдентификатор());
		КонецЕсли;
		Если СтрокаДерева.ЭлементДерева = ДополнительныеПараметры.ЭлементДерева Тогда
			ДополнительныеПараметры.ИдентификаторТекущейСтроки = СтрокаДерева.ПолучитьИдентификатор();
		КонецЕсли;
		
		ЗаполнитьИдентификаторыЭлементовДерева(СтрокаДерева, СоответствиеСтрокРазвернутая, ДополнительныеПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоГруппыДоступаНаКлиенте()
	ТекущиеДанные = Элементы.ДеревоГруппДоступа.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ЭлементДерева = ТекущиеДанные.ЭлементДерева;
	Иначе
		ЭлементДерева = Неопределено;
	КонецЕсли;
	ИдентификаторТекущейСтроки = Элементы.ДеревоГруппДоступа.ТекущаяСтрока;
	Если ИдентификаторТекущейСтроки = Неопределено Тогда
		ИдентификаторТекущейСтроки = - 1;
	КонецЕсли;
	ЗаполнитьДеревоГруппыДоступа();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭлементДерева", ЭлементДерева);
	ДополнительныеПараметры.Вставить("ИдентификаторТекущейСтроки", ИдентификаторТекущейСтроки);
	
	ОбновитьИдентификаторыСтрок(СоответствиеСтрокРазвернутая, ДополнительныеПараметры);
	Для Каждого ЭлементСоответствия Из СоответствиеСтрокРазвернутая Цикл
		Элементы.ДеревоГруппДоступа.Развернуть(ЭлементСоответствия.Значение);
	КонецЦикла;
	
	Если ДополнительныеПараметры.ИдентификаторТекущейСтроки > -1 Тогда
		Элементы.ДеревоГруппДоступа.ТекущаяСтрока = ДополнительныеПараметры.ИдентификаторТекущейСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСотрудникаИзДерева()
	Если РаботаССотрудникамиРМК Тогда
		УдалитьПользователяИзГруппыДоступаКоманда();
	Иначе
		УдалитьСотрудника();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПользователяИзГруппыДоступаКоманда()
	ТекущаяСтрокаДеревоГрупп = Элементы.ДеревоГруппДоступа.ТекущиеДанные;
	Если ТекущаяСтрокаДеревоГрупп.Уровень <> 2 Тогда
		ТекстСообщения = НСтр("ru = 'Пользователь не выбран'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	ВыбранныйПользователь = ТекущаяСтрокаДеревоГрупп.ЭлементДерева;
	ВыбраннаяГруппа = ТекущаяСтрокаДеревоГрупп.ГруппаДоступа;
	
	ТекстВопроса = НСтр("ru = 'Удалить пользователя %1 из группы доступа %2?'");
	ДополнительныеПараметрыВопроса = Новый Структура("ВыбранныйПользователь, ВыбраннаяГруппа", ВыбранныйПользователь, ВыбраннаяГруппа);
	ОповещениеОЗакрытииВопроса = Новый ОписаниеОповещения("УдалитьПользователяОповещениеОЗакрытииВопроса",ЭтаФорма, ДополнительныеПараметрыВопроса);
	СписокЗначенийОтветы = Новый СписокЗначений;
	СписокЗначенийОтветы.Добавить(КодВозвратаДиалога.Да, НСтр("ru= 'Удалить'"));
	СписокЗначенийОтветы.Добавить(КодВозвратаДиалога.Нет, НСтр("ru= 'Отменить'"));
	ПоказатьВопрос(ОповещениеОЗакрытииВопроса, СтрШаблон(ТекстВопроса,ВыбранныйПользователь,ВыбраннаяГруппа), СписокЗначенийОтветы);
КонецПроцедуры

&НаСервере
Процедура УдалитьПользователяИзГруппыДоступаНаСервере(ВыбранныйПользователь, ВыбраннаяГруппа)
	
	Если ТипЗнч(ВыбранныйПользователь) = Тип("Строка")
		ИЛИ ТипЗнч(ВыбраннаяГруппа) = Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = ''");
	ОбщегоНазначенияРМКПереопределяемый.УдалитьПользователяИзГруппыДоступаПомощникРМК(ВыбранныйПользователь, ВыбраннаяГруппа, ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИСозданиеПерсональногоКода()
	НетЗаписи = Ложь;
	ТекущаяСтрока = Элементы.СписокСотрудников.ТекущиеДанные;
	ДанныеЗаписи = Новый Структура("Пользователь, Кассир",
			ТекущаяСтрока.Пользователь, ТекущаяСтрока.Кассир);
	ВыбраннаяСтрока = Неопределено;
	ПроверитьЗаписьНаНаличие(ВыбраннаяСтрока, НетЗаписи, ДанныеЗаписи);
	Если НетЗаписи Тогда
		СтруктураСозданияКода = Новый Структура("Пользователь, ФизическоеЛицо, ПерсональныйКод",
			ТекущаяСтрока.Пользователь, ТекущаяСтрока.Кассир, ТекущаяСтрока.КодСотрудника);
	Иначе
		СтруктураСозданияКода = Новый Структура("Ключ",ВыбраннаяСтрока);
	КонецЕсли;
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуСозданияКодаДоступа(СтруктураСозданияКода, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаписьНаНаличие(ВыбраннаяСтрока, НетЗаписи, ДанныеЗаписи)
	ОбщегоНазначенияРМКПереопределяемый.ПроверитьИНайтиЗаписьПерсональныйКод(ВыбраннаяСтрока, НетЗаписи, ДанныеЗаписи);
КонецПроцедуры

&НаСервере
Процедура ЗапускатьРМКПриСтартеНаСервере(Пользователь)
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("СообщениеПользователю", НСтр("ru = ''"));
	СтруктураРезультата.Вставить("Результат", Ложь);
	ОбщегоНазначенияРМКПереопределяемый.ЗапускатьРМКПриСтарте(Пользователь, СтруктураРезультата);
	Если Не ПустаяСтрока(СтруктураРезультата.СообщениеПользователю) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтруктураРезультата.СообщениеПользователю);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСозданияКодаДоступа()
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.СписокСотрудников.ТекущиеДанные;
	МассивПользователей = Новый Массив;
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("НастройкаСотрудника", Истина);
	
	СтруктураПользователя = Новый Структура;
	СтруктураПользователя.Вставить("Кассир", ТекущиеДанные.Сотрудник);
	СтруктураПользователя.Вставить("КодСотрудника", ТекущиеДанные.КодСотрудника);
	МассивПользователей.Добавить(СтруктураПользователя);
	ПараметрыОткрытияФормы.Вставить("МассивПользователей", МассивПользователей);
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуСозданияКодаДоступа(ПараметрыОткрытияФормы, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстЗапросаТаблицаСотрудников(МассивСотрудников)
	ОбщегоНазначенияРМКПереопределяемый.СформироватьДинамическийСписокСотрудники(СписокСотрудников, МассивСотрудников);
КонецПроцедуры

&НаСервере
Процедура УстановитьТорговыйОбъектПользователя(Пользователь, Результат)
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("СообщениеПользователю", НСтр("ru = ''"));
	СтруктураРезультата.Вставить("Результат", Результат);
	ОбщегоНазначенияРМКПереопределяемый.УстановитьТорговыйОбъектПользователя(Пользователь, ТорговыйОбъект, СтруктураРезультата);
	Если Не ПустаяСтрока(СтруктураРезультата.СообщениеПользователю) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтруктураРезультата.СообщениеПользователю);
	КонецЕсли;
	Результат = СтруктураРезультата.Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСотрудникаКПользователю()
	ТекущаяСтрокаПользователь = Элементы.ДеревоГруппДоступа.ТекущиеДанные;
	Если ТекущаяСтрокаПользователь.Уровень <> 2 Тогда
		СообщениеПользователю = НСтр("ru = 'Сотрудники не добавлены. Активируйте строку с пользователем.'");
		ПоказатьПредупреждение(,СообщениеПользователю);
		Возврат;
	КонецЕсли;
	
	ВыбранныеПользователи = Элементы.СписокСотрудников.ВыделенныеСтроки;
	МассивСотрудников = Новый Массив;
	Если ВыбранныеПользователи.Количество() > 0 Тогда
		Для Каждого СтрокаСписка Из ВыбранныеПользователи Цикл
			СтрокаТаблицы = Элементы.СписокСотрудников.ДанныеСтроки(СтрокаСписка);
			ДобавитьСтрокуСотрудникаВМассив(СтрокаТаблицы, МассивСотрудников);
		КонецЦикла;
	Иначе
		ТекущаяСтрокаПользователь = Элементы.СписокСотрудников.ТекущиеДанные;
		ДобавитьСтрокуСотрудникаВМассив(ТекущаяСтрокаПользователь, МассивСотрудников);
	КонецЕсли;
	
	ВыбранныйПользователь = ТекущаяСтрокаПользователь.ЭлементДерева;
	
	ТекстВопроса = НСтр("ru = 'Добавить сотрудников к пользователю %1?'");
	
	ДополнительныеПараметрыВопроса = Новый Структура;
	ДополнительныеПараметрыВопроса.Вставить("МассивСотрудников", МассивСотрудников);
	ДополнительныеПараметрыВопроса.Вставить("ВыбранныйПользователь", ВыбранныйПользователь);
	ОповещениеОЗакрытииВопроса = Новый ОписаниеОповещения("ДобавитьСотрудникаОповещениеОЗакрытииВопроса",
		ЭтотОбъект, ДополнительныеПараметрыВопроса);
		
	СписокЗначенийОтветы = Новый СписокЗначений;
	СписокЗначенийОтветы.Добавить(КодВозвратаДиалога.Да, НСтр("ru= 'Добавить'"));
	СписокЗначенийОтветы.Добавить(КодВозвратаДиалога.Нет, НСтр("ru= 'Отменить'"));
	ПоказатьВопрос(ОповещениеОЗакрытииВопроса, СтрШаблон(ТекстВопроса, ВыбранныйПользователь),СписокЗначенийОтветы);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСотрудникаКПользователюСервер(МассивСотрудников, Пользователь, Результат)
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("СообщениеПользователю", НСтр("ru = ''"));
	СтруктураРезультата.Вставить("Результат", Результат);
	ОбщегоНазначенияРМКПереопределяемый.ДобавитьСотрудникаКПользователю(МассивСотрудников, Пользователь, СтруктураРезультата);
	Результат = СтруктураРезультата.Результат;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуСотрудникаВМассив(СтрокаТаблицы, МассивСотрудников)
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Сотрудник", СтрокаТаблицы.Сотрудник);
	СтруктураСтроки.Вставить("КодСотрудника", СтрокаТаблицы.КодСотрудника);
	МассивСотрудников.Добавить(СтруктураСтроки);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСотрудника()
	ТекущаяСтрокаДерево = Элементы.ДеревоГруппДоступа.ТекущиеДанные;
	Если ТекущаяСтрокаДерево.Уровень <> 3 Тогда
		СообщениеПользователю = НСтр("ru = 'Сотрудник не удален. Активируйте строку с сотрудником.'");
		ПоказатьПредупреждение(,СообщениеПользователю);
		Возврат;
	КонецЕсли;
	
	Результат = Ложь;
	УдалитьСотрудникаПользователяСервер(ТекущаяСтрокаДерево.ЭлементДерева, ТекущаяСтрокаДерево.Пользователь, Результат);
	Если Результат Тогда
		ЗаполнитьДеревоГруппыДоступаНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьСотрудникаПользователяСервер(Сотрудник, Пользователь, Результат)
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("СообщениеПользователю", НСтр("ru = ''"));
	СтруктураРезультата.Вставить("Результат", Результат);
	ОбщегоНазначенияРМКПереопределяемый.УдалитьСотрудникаПользователя(Сотрудник, Пользователь, СтруктураРезультата);
	Если Не ПустаяСтрока(СтруктураРезультата.СообщениеПользователю) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтруктураРезультата.СообщениеПользователю);
	КонецЕсли;
	Результат = СтруктураРезультата.Результат;
КонецПроцедуры
#КонецОбласти

#Область СтраницаТорговыйОбъект
&НаСервере
Процедура СохранитьИзменениеКассыККМ(НастраиваемаяКассаККМ, СтрукутураИзменяемыхРеквизитов)
	ОбщегоНазначенияРМКПереопределяемый.СохранитьИзмененияКассыККМ(НастраиваемаяКассаККМ, СтрукутураИзменяемыхРеквизитов);
КонецПроцедуры

&НаСервере
Процедура ИзменитьТорговыйОбъект()
	СброситьНастройкиКарточек();
	ЗаполнитьКарточкиКассыИЭквайринг();
КонецПроцедуры

&НаСервере
Процедура СброситьНастройкиКарточек()
	ТаблицаКассККМ.Очистить();
	ТаблицаЭквайринговыйТерминал.Очистить();
	Для НомерЭлемента = 1 По 3 Цикл
		ИмяРеквизитаКассаККМ = СтрШаблон(НСтр("ru = 'КассаККМ_%1'"), НомерЭлемента);
		ИмяРеквизитаОрганизация = СтрШаблон(НСтр("ru = 'Организация_%1'"), НомерЭлемента);
		ИмяРеквизитаОстатокВКассе = СтрШаблон(НСтр("ru = 'ОстатокВКассе_%1'"), НомерЭлемента);
		ИмяРеквизитаСверятьОФД = СтрШаблон(НСтр("ru = 'СверятьОФД_%1'"), НомерЭлемента);
		ЭтотОбъект[ИмяРеквизитаКассаККМ] = Неопределено;
		ЭтотОбъект[ИмяРеквизитаОрганизация] = Неопределено;
		ОстатокВКассе = СтрШаблон(НСтр("ru = '%1 %2'"), Формат(0, "ЧДЦ=2; ЧН=0.00"), ВалютаУчета);
		ЭтотОбъект[ИмяРеквизитаОстатокВКассе] = ОстатокВКассе;
		ЭтотОбъект[ИмяРеквизитаСверятьОФД] = Ложь;
		ИмяГруппыКассаККМ = СтрШаблон(НСтр("ru = 'ГруппаКассаККМ_%1'"), НомерЭлемента);
		ЭлементГруппа = Элементы.Найти(ИмяГруппыКассаККМ);
		Если Не ЭлементГруппа = Неопределено Тогда
			ЭлементГруппа.Видимость = Ложь;
		КонецЕсли;
		
		ИмяРеквизитаЭквайринговыйТерминал = СтрШаблон(НСтр("ru = 'ЭквайринговыйТерминал_%1'"), НомерЭлемента);
		ИмяРеквизитаКассаККМЭквайринг = СтрШаблон(НСтр("ru = 'КассаККМЭквайринг_%1'"), НомерЭлемента);
		ИмяРеквизитаИспользоватьОборудованиеЭквайринг = СтрШаблон(НСтр("ru = 'ИспользоватьБезПодключенияЭквайринг_%1'"), НомерЭлемента);
		ИмяРеквизитаОрганизацияЭквайринг = СтрШаблон(НСтр("ru = 'ОрганизацияЭквайринг_%1'"), НомерЭлемента);
		УправлениеЭквайринг = СтрШаблон(НСтр("ru = 'ГруппаЭквайринг_%1'"), НомерЭлемента);
		ЭтотОбъект[ИмяРеквизитаЭквайринговыйТерминал] = Неопределено;
		ЭтотОбъект[ИмяРеквизитаКассаККМЭквайринг] = Неопределено;
		ЭтотОбъект[ИмяРеквизитаОрганизацияЭквайринг] = Неопределено;
		ЭтотОбъект[ИмяРеквизитаИспользоватьОборудованиеЭквайринг] = Ложь;
		ЭлементГруппа = Элементы.Найти(УправлениеЭквайринг);
		Если Не ЭлементГруппа = Неопределено Тогда
			ЭлементГруппа.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область НастройкаОборудования
&НаКлиенте
Процедура ЗаполнитьСканерПриСтарте()
	Если ЗначениеЗаполнено(СканерДляПодключения) Тогда
		Контекст = Новый Структура();
		Контекст.Вставить("ДрайверОборудования", СканерДляПодключения);
		Оповещение = Новый ОписаниеОповещения("ЗавершениеУстановкиДрайвераСканера", ЭтотОбъект, Контекст);
		МенеджерОборудованияРМККлиент.УстановитьДрайверОборудования(Оповещение, СканерДляПодключения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьЭкземплярСканераШтрихкода()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка КАК СканерШтрихкода
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	НЕ ПодключаемоеОборудование.ПометкаУдаления
	|	И ПодключаемоеОборудование.РабочееМесто = &ТекущееРабочееМесто
	|	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.СканерШтрихкода)");
	
	Запрос.УстановитьПараметр("ТекущееРабочееМесто", ТекущееРабочееМесто);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		
		ИмяКонстантыПодключаемоеОборудование = ОбщегоНазначенияРМК.ИмяКонстанты("ИспользоватьПодключаемоеОборудование");
		СохранитьЗначениеКонстанты(ИмяКонстантыПодключаемоеОборудование, Истина);
		НачатьТранзакцию();
		
		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ПодключаемоеОборудование");
			БлокировкаДанных.Заблокировать();
			
			СканерШтрихкодаОбъект = Справочники.ПодключаемоеОборудование.СоздатьЭлемент();
			СканерШтрихкодаОбъект.ТипПодключения =
				ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ТипыПодключенияОборудования.ЛокальноеПодключение");
			СканерШтрихкодаОбъект.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода;
			СканерШтрихкодаОбъект.ДрайверОборудования = Справочники.ДрайверыОборудования.Драйвер1ССканерыШтрихкодаNative;
			СканерШтрихкодаОбъект.РабочееМесто = ТекущееРабочееМесто;
			СканерШтрихкодаОбъект.УстройствоИспользуется = Истина;
			
			ИмяРабочегоМеста = СтрШаблон(НСтр("ru = '%1на %2'"), " ", Строка(ТекущееРабочееМесто));
							
			Если ПустаяСтрока(Строка(ТекущееРабочееМесто)) Тогда
				ИмяРабочегоМеста = "";
			КонецЕсли;
			
			ЛокализованныйШаблон = НСтр("ru = '''%1''%2'");
			ИмяДрайвера = Строка(СканерШтрихкодаОбъект.ДрайверОборудования);
			Наименование = СтрШаблон(ЛокализованныйШаблон, ИмяДрайвера, ИмяРабочегоМеста);
			СканерШтрихкодаОбъект.Наименование = Наименование;
			
			СканерШтрихкодаОбъект.Записать();
			
			МенеджерОборудования.ОбновитьУстановленныеДрайвераПоТипу(
				Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода);
			СканерДляПодключения = СканерШтрихкодаОбъект.ДрайверОборудования;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Ошибка при подключении сканера штрихкода.'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОборудования()
	
	ЭлементыГруппыДоступа = ТаблицаОборудование.ПолучитьЭлементы();
	ЭлементыГруппыДоступа.Очистить();
	
	ТекстЗапроса = НСтр("ru = ''");
	
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТекстЗапросаПодключенноеОборудование(ТекстЗапроса);
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекущееРабочееМесто", ТекущееРабочееМесто);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ДеревоОбъект = РеквизитФормыВЗначение("ТаблицаОборудование");
		ВыборкаТипОборудования = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТипОборудования.Следующий() Цикл
			СтрокиГруппыДоступа = ДеревоОбъект.Строки.Добавить();
			СтрокиГруппыДоступа.ПодключенноеОборудование = ВыборкаТипОборудования.ТипОборудования;
			СтрокиГруппыДоступа.Уровень = 1;
			ВыборкаОборудование = ВыборкаТипОборудования.Выбрать();
			Пока ВыборкаОборудование.Следующий() Цикл
				СтрокиПользователи = СтрокиГруппыДоступа.Строки.Добавить();
				СтрокиПользователи.ПодключенноеОборудование = ВыборкаОборудование.ПодключенноеОборудование;
				СтрокиПользователи.Уровень = 2;
			КонецЦикла;
		КонецЦикла;
		ЗначениеВРеквизитФормы(ДеревоОбъект, "ТаблицаОборудование");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзменениеЭквайринговыйТерминал(НастраиваемыйТерминал, СтрукутураИзменяемыхРеквизитов)
	ОбщегоНазначенияРМКПереопределяемый.СохранитьИзменениеЭквайринговыйТерминал(НастраиваемыйТерминал, СтрукутураИзменяемыхРеквизитов);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПлатежныеСистемыНаКлиенте()
	СтруктураОткрытияФормы = Новый Структура;
	МассивКасс = Новый Массив;
	Для Каждого СтрокаКассаККМ Из ТаблицаКассККМ Цикл
		СтруктураНастройки = Новый Структура;
		СтруктураНастройки.Вставить("КассаККМ", СтрокаКассаККМ.КассаККМ);
		СтруктураНастройки.Вставить("Организация", СтрокаКассаККМ.Организация);
		СтруктураНастройки.Вставить("ТорговыйОбъект", ТорговыйОбъект);
		МассивКасс.Добавить(СтруктураНастройки);
	КонецЦикла;
	СтруктураОткрытияФормы.Вставить("МассивКасс", МассивКасс);
	
	Если МассивКасс.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Нет доступных касс для настройки'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
	Иначе
		ОткрытьФорму("Обработка.ПомощникНастройкиКассовогоМестаРМК.Форма.ФормаПлатежныеСистемы", СтруктураОткрытияФормы
			,,,,,,РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СерверЛояльности

&НаКлиенте
Процедура НастроитьИспользованиеСервераЛояльности()
	
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаНастройкиСервераЛояльностиГоризонтальная, НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных);
	
	Если НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных
		И НЕ ПарольСервераЛояльностиИзменен Тогда
		ПарольСервераЛояльности = УникальныйИдентификатор;
	КонецЕсли;
	
	Если НастройкиРМК.РаботаВРежимеМедленногоСоединения
		И Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		НастройкиРМК.РаботаВРежимеМедленногоСоединения = Ложь;
	КонецЕсли;
	
	Если Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных
		И НастройкиРМК.ВыполнятьЛокальныйРасчетСкидок Тогда
		НастройкиРМК.ВыполнятьЛокальныйРасчетСкидок = Ложь;
	КонецЕсли;
	
	Если Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных
		И НастройкиРМК.ЗапретитьПробитиеЧекаБезРасчетаСкидок Тогда
		НастройкиРМК.ЗапретитьПробитиеЧекаБезРасчетаСкидок = Ложь;
	КонецЕсли;
	
	Если Не НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных
		И НастройкиРМК.ЗапретитьПробитиеЧекаБезРасчетаСкидок Тогда
		НастройкиРМК.РазрешитьЗапросОстатка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеСерверЛояльности()
	ТекстСообщенияПользователю = НСтр("ru = ''");
	
	Если НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		
		ИсходныеДанные = НастройкиРМК;
		ПараметрыПроверкиПодключения = ИсходныеДанныеДляПроверкиДоступностиСервераЛояльности(ИсходныеДанные, ПарольСерверЛояльности, ПарольСервераЛояльностиИзменен);
		АдресСервера = ПараметрыПроверкиПодключения.АдресСервера;
		
		Если НЕ ЗначениеЗаполнено(АдресСервера) Тогда
			
			СтрокаСообщения = НСтр("ru = 'Не заполнен адрес сервера лояльности.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения,, "НастройкаРМК.АдресСервераЛояльности");
			Возврат;
			
		КонецЕсли;
		
		ПараметрыВыполненияЗапроса = СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыЗапросаПроверитьПодключениеКСерверуЛояльности(ПараметрыПроверкиПодключения);
		РезультатПроверки = СерверЛояльностиПолучательДанныхКлиентСервер.ВыполнитьЗапросКСерверуЛояльности(ПараметрыВыполненияЗапроса);
		ТекстСообщенияПользователю = НСтр("ru = 'Соединение с сервером успешно установлено.'");
		
		Если РезультатПроверки.ЕстьОшибки Тогда
			
			ТекстСообщенияПользователю = РезультатПроверки.ТекстОшибки;
			
		Иначе
			
			ДанныеОтвета = Неопределено;
			СтрокаJSON = РезультатПроверки.ДанныеОтвета;
			СерверЛояльностиПолучательДанныхКлиентСервер.ОбработатьJSON(СтрокаJSON, ДанныеОтвета);
			Если ДанныеОтвета <> Неопределено
				И ТипЗнч(ДанныеОтвета) = Тип("Структура") Тогда
				Если ДанныеОтвета.Error Тогда
					ТекстСообщенияПользователю = ДанныеОтвета.ErrorMessage;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
			
	Иначе
		
		ТекстСообщенияПользователю =
			НСтр("ru = 'Пожалуйста, включите использование сервера лояльности перед проверкой подключения к серверу.'");
			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекстСообщенияПользователю) Тогда
		ТекстСообщенияПользователю =
			НСтр("ru = 'Произошла непредвиденная ошибка. Сервер лояльности недоступен'");
	КонецЕсли;
	ПоказатьПредупреждение(, ТекстСообщенияПользователю);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИсходныеДанныеДляПроверкиДоступностиСервераЛояльности(НастройкиРМК, ПарольСервераЛояльности, ПарольСервераЛояльностиИзменен)
	
	Таймаут = ?(НастройкиРМК.РаботаВРежимеМедленногоСоединения, НастройкиРМК.ТаймаутСерверЛояльности, 0);
	
	Результат = Новый Структура();
	Результат.Вставить("АдресСервера", НастройкиРМК.АдресСервераЛояльности);
	Результат.Вставить("Логин", НастройкиРМК.ПользовательСервераЛояльности);
	Результат.Вставить("Таймаут", Таймаут);
	Результат.Вставить("Пароль", ПарольСервераЛояльности(НастройкиРМК.Ссылка, ПарольСервераЛояльности, ПарольСервераЛояльностиИзменен));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПарольСервераЛояльности(ТекущаяНастройкаРМК, ПарольСервераЛояльности, ПарольСервераЛояльностиИзменен)
	Если НЕ ТекущаяНастройкаРМК.Пустая()
		И НЕ ПарольСервераЛояльностиИзменен Тогда
		Возврат ОбщегоНазначенияРМК.ПарольСервераЛояльности(ТекущаяНастройкаРМК);
	Иначе
		Возврат ПарольСервераЛояльности;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура УстановитьИзмененностьНастроек()
	НастройкиИзменены = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСервераЛояльности()
	Если НастройкиРМК.ИспользоватьСерверЛояльностиПолучательДанных Тогда
		ПарольСервераЛояльности = УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ИтоговыйОтчет
&НаСервере
Процедура ЗаполнитьОтчет()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("ИтоговыйОтчет");
	
	ЭтоКассаСамообслуживания = Ложь;
	Если НастройкиРМК.СценарийИспользования = Перечисления.СценарииИспользованияРМК.ТерминалСамообслуживания Тогда
		ЭтоКассаСамообслуживания = Истина;
	КонецЕсли;
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаПО	= Макет.ПолучитьОбласть("ШапкаПО");
	ОбластьШапкаПС	= Макет.ПолучитьОбласть("ШапкаПC");
	
	ТабличныйДокументФинал.Очистить();
	ОбластьШапка.Параметры.РабочееМесто = ТекущееРабочееМесто;
	ТабличныйДокументФинал.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	ТекстЗапроса = НСтр("ru = ''");
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТекстЗапросаОтчетПодключенноеОборудование(ТекстЗапроса);
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивКасс", ТаблицаКассККМ.Выгрузить(,"КассаККМ"));
	Запрос.УстановитьПараметр("МассивТерминалов", ТаблицаЭквайринговыйТерминал.Выгрузить(,"ЭквайринговыйТерминал"));
	Запрос.УстановитьПараметр("НастройкаРабочегоМеста", НастройкиРМК.Ссылка);
	Запрос.УстановитьПараметр("ТекущееРабочееМесто", ТекущееРабочееМесто);
	Запрос.УстановитьПараметр("МассивОрганизаций", ТаблицаКассККМ.Выгрузить(,"Организация"));
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаОрганизации = ПакетыЗапросов[2].Выбрать();
	
	Если ВыборкаОрганизации.Количество() > 0 Тогда
		ОбластьШапкаТаблицыОрганизаций 	= Макет.ПолучитьОбласть("ШапкаТаблицыОрганизаций|ТаблицаОрганизация");
		ОбластьШапкаТаблицыНаличные 	= Макет.ПолучитьОбласть("ШапкаТаблицыОрганизаций|ТаблицаНаличные");
		ОбластьШапкаТаблицыКарта 		= Макет.ПолучитьОбласть("ШапкаТаблицыОрганизаций|ТаблицаКарта");
		ОбластьШапкаТаблицыПС 			= Макет.ПолучитьОбласть("ШапкаТаблицыОрганизаций|ТаблицаПС");
		
		ОбластьОрганизация 				= Макет.ПолучитьОбласть("Организация|ТаблицаОрганизация");
		ОбластьНаличные 				= Макет.ПолучитьОбласть("Организация|ТаблицаНаличные");
		ОбластьКарта 					= Макет.ПолучитьОбласть("Организация|ТаблицаКарта");
		ОбластьПС 						= Макет.ПолучитьОбласть("Организация|ТаблицаПС");
		ТабличныйДокументФинал.Вывести(ОбластьШапкаТаблицыОрганизаций);
		Если НЕ ЭтоКассаСамообслуживания
			И НастройкиРМК.ИспользоватьОплатуНаличными Тогда
			ТабличныйДокументФинал.Присоединить(ОбластьШапкаТаблицыНаличные);
		КонецЕсли;
		Если НастройкиРМК.ИспользоватьОплатуПлатежнымиКартами Тогда
			ТабличныйДокументФинал.Присоединить(ОбластьШапкаТаблицыКарта);
		КонецЕсли;
		Если НастройкиРМК.ИспользоватьОплатуПлатежнымиСистемами Тогда
			ТабличныйДокументФинал.Присоединить(ОбластьШапкаТаблицыПС);
		КонецЕсли;
	КонецЕсли;
	Пока ВыборкаОрганизации.Следующий() Цикл
		ОбластьОрганизация.Параметры.Заполнить(ВыборкаОрганизации);
		ТабличныйДокументФинал.Вывести(ОбластьОрганизация);
		Если НастройкиРМК.ИспользоватьОплатуНаличными
			И НЕ ЭтоКассаСамообслуживания Тогда
			ОбластьНаличные.Параметры.ОплатаНаличными = "V";
			ОбластьНаличные.Параметры.НаличныеПОСсылка = ВыборкаОрганизации.НаличныеПОСсылка;
			Если ВыборкаОрганизации.НаличныеПОСкрыть Тогда
				ОбластьНаличные.Области.ОбластьНаличные.Картинка = Новый Картинка;
			КонецЕсли;
			ТабличныйДокументФинал.Присоединить(ОбластьНаличные);
		КонецЕсли;
		Если НастройкиРМК.ИспользоватьОплатуПлатежнымиКартами Тогда
			ОбластьКарта.Параметры.ОплатаКартой = "V";
			ОбластьКарта.Параметры.ОплатаКартойПОСсылка = ВыборкаОрганизации.ОплатаКартойПОСсылка;
			Если ВыборкаОрганизации.ОплатаКартойПОСкрыть Тогда
				ОбластьКарта.Области.ОбластьКартой.Картинка = Новый Картинка;
			КонецЕсли;
			ТабличныйДокументФинал.Присоединить(ОбластьКарта);
		КонецЕсли;
		
		Если НастройкиРМК.ИспользоватьОплатуПлатежнымиКартами Тогда
			ОбластьПС.Параметры.ОплатаПС = "V";
			ТабличныйДокументФинал.Присоединить(ОбластьПС);
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаОоборудование = ПакетыЗапросов[3].Выбрать();
	ТекстЗаголовкаШапки = НСтр("ru = 'Используемое подключаемое оборудование'");
	Если ВыборкаОоборудование.Количество() = 0 Тогда
		ТекстЗаголовкаШапки = ТекстЗаголовкаШапки + СтрШаблон(НСтр("ru = '%1не обнаружено.'"), " ");
	КонецЕсли;
	
	ОбластьШапкаПО.Параметры.ЗаголовокШапкиТаблицыОборудования = ТекстЗаголовкаШапки;
	Подсказка = НСтр("ru = 'Для настройки оборудования необходимо перейти'");
	ПодсказкаГиперссылка = НСтр("ru = 'на страницу настройки оборудования'");
	ОбластьШапкаПО.Параметры.Подсказка = Подсказка;
	ОбластьШапкаПО.Параметры.ПодсказкаГиперссылка = ПодсказкаГиперссылка;
	ТабличныйДокументФинал.Вывести(ОбластьШапкаПО);
	
	Пока ВыборкаОоборудование.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаОоборудование.ИмяТипаОборудования) Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть(ВыборкаОоборудование.ИмяТипаОборудования);
			ОбластьМакета.Параметры.Заполнить(ВыборкаОоборудование);
			ТабличныйДокументФинал.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НастройкиРМК.ИспользоватьОплатуПлатежнымиСистемами Тогда
	
		ТекстЗаголовкаШапки = НСтр("ru = 'Используемые платежные системы'");
	
		ОбластьШапкаПС.Параметры.ЗаголовокШапки = ТекстЗаголовкаШапки;
		ТабличныйДокументФинал.Вывести(ОбластьШапкаПС);
		
		Пока ВыборкаОрганизации.Следующий() Цикл
			НастройкиИнтеграции = РегистрыСведений.СоответствиеНастроекИнтеграцииРМК.НастройкиИнтеграции(
				ВыборкаОрганизации.Организация,
				ТорговыйОбъект);
			Для Каждого Выборка Из НастройкиИнтеграции Цикл
				Если Выборка.ПлатежнаяСистема = Перечисления.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("СБП");
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ТабличныйДокументФинал.Вывести(ОбластьМакета);
				ИначеЕсли Выборка.ПлатежнаяСистема = Перечисления.ТипыПлатежнойСистемыККТ.ЮКасса Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ЮКасса");
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ТабличныйДокументФинал.Вывести(ОбластьМакета);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ТекстЗапросаКассира = НСтр("ru = ''");
	ОбщегоНазначенияРМКПереопределяемый.СформироватьТекстЗапросаКассира(ТекстЗапросаКассира);
	Если ЗначениеЗаполнено(ТекстЗапросаКассира) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаКассира;
		Запрос.УстановитьПараметр("ИспользуютсяКассирыДляВхода", НастройкиРМК.НастроитьКассировДляВхода);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыКассиры");
			ТабличныйДокументФинал.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыКассиры");
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабличныйДокументФинал.Вывести(ОбластьМакета);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеОткрытьФормуНастройкиОбменаРезультат(Результат, ДополнительныеПараметры) Экспорт
	ЗаполнитьДанныеСтраницыОбмена();
	Если ОбменНастроен Или Не ПомощникНастройкиОбменаСуществует Тогда
		Если Не УзелОбмена = ПредопределенноеЗначение("ПланОбмена.ОбменСУРМК.ПустаяСсылка")
			И ВыполнятьПервоначальныйОбмен Тогда
			ВыполнитьПервоначальныйОбмен();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПервоначальныйОбменРезультат(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ВыполнятьПервоначальныйОбмен = Ложь;
	ЕстьОшибки = Ложь;
	ОписаниеСтрокиПриложения = Новый Структура;
	ЗаполнитьНастройкиСинхронизации(ОписаниеСтрокиПриложения, ЕстьОшибки);
	Если Не ЕстьОшибки Тогда
		СинхронизацияДанных(ОписаниеСтрокиПриложения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиСинхронизации(ОписаниеСтрокиПриложения, ЕстьОшибки)
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьНастройкиСинхронизации(ОписаниеСтрокиПриложения, ЕстьОшибки, УзелОбмена);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПомощникаОбменов(Результат, ДополнительныеПараметры) Экспорт
	ЗаполнитьДанныеСтраницыОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователяОповещениеОЗакрытииВопроса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПрофильКассира = Ложь;
	ОбщегоНазначенияРМККлиентПереопределяемый.ПроверитьПринадлежностьКПрофилюКассир(ДополнительныеПараметры.ВыбраннаяГруппа, ПрофильКассира);
	МассивПользователей = ДополнительныеПараметры.МассивПользователей;
	Если ПрофильКассира Тогда
		СтруктураОткрытияФормы = Новый Структура;
		СтруктураОткрытияФормы.Вставить("МассивПользователей", МассивПользователей);
		СтруктураОткрытияФормы.Вставить("ГруппаДоступа", ДополнительныеПараметры.ВыбраннаяГруппа);
		ДобавитьПользователяВГруппуДоступаИПрисвоитьКод(СтруктураОткрытияФормы);
	Иначе
		ДобавитьПользователяВГруппуДоступаНаСервере(МассивПользователей, ДополнительныеПараметры.ВыбраннаяГруппа);
		ЗаполнитьДеревоГруппыДоступаНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьСпискиГрупп(Результат, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат);
	КонецЕсли;
	Элементы.СписокСотрудников.Обновить();
	ЗаполнитьДеревоГруппыДоступаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПользователяОповещениеОЗакрытииВопроса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьПользователяИзГруппыДоступаНаСервере(ДополнительныеПараметры.ВыбранныйПользователь, ДополнительныеПараметры.ВыбраннаяГруппа);
	
	ВыбраннаяГруппаДоступа = ДополнительныеПараметры.ВыбраннаяГруппа;
	
	ЗаполнитьДеревоГруппыДоступаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоГрупп(Результат, ДополнительныеПараметры) Экспорт
	ЗаполнитьДеревоГруппыДоступаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуПользователей(Результат, ДополнительныеПараметры) Экспорт
	Элементы.СписокСотрудников.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеУстановкиДрайвераСканера(РезультатВыполнения, Контекст) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		ТекстСообщения = НСтр("ru = 'Установка драйвера оборудования завершена.
		|Пожалуйста, подключите сканер к компьютеру для дальнейшей работы.'");
		
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		ПоказатьПредупреждение(,ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодключаемоеОборудование(Результат, ДополнительныеПараметры) Экспорт
	ЗаполнитьТаблицуОборудования();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПослеЗакрытияФормы(Результат, ДополнительныеПараметры) Экспорт
	ПереключитьСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидПодключения(Результат, ДополнительныеПараметры) Экспорт
	ЗаполнитьВидТранспорта();
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеРасписанияРегламентногоЗаданияЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание <> Неопределено Тогда
		
		Если Расписание.ПериодПовтораВТечениеДня < 15*60 Тогда
			
			Расписание.ПериодПовтораВТечениеДня = 15*60;
			ТекстПредупреждения = НСтр("ru = 'Минимальный интервал не должен быть меньше 15 минут (900 секунд).'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
			
		КонецЕсли;
		Если ДополнительныеПараметры.ВыгрузкаДанных Тогда
			РасписаниеРегламентногоЗаданияВыгрузкаДанных = Расписание;
			ОбновитьПредставлениеРасписания(РасписаниеРегламентногоЗаданияВыгрузкаДанных, ДополнительныеПараметры.ВыгрузкаДанных);
		Иначе
			РасписаниеРегламентногоЗаданияЗагрузкаДанных = Расписание;
			ОбновитьПредставлениеРасписания(РасписаниеРегламентногоЗаданияЗагрузкаДанных, ДополнительныеПараметры.ВыгрузкаДанных);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСотрудникаОповещениеОЗакрытииВопроса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = ДополнительныеПараметры.МассивСотрудников;
	РезультатОбработки = Ложь;
	ДобавитьСотрудникаКПользователюСервер(МассивСотрудников, ДополнительныеПараметры.ВыбранныйПользователь, РезультатОбработки);
	ЗаполнитьДеревоГруппыДоступаНаКлиенте();
	
	Если Не РезультатОбработки Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'При добавлении сотрудников возникли ошибки.'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти