#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Регистрирует данные к обновлению в плане обмена ОбновлениеИнформационнойБазы
//  см. Стандарты и методики разработки прикладных решений: Параллельный режим отложенного обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = Метаданные.РегистрыСведений.ТорговыеПредложенияТорговойПлощадки.ПолноеИмя();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТорговыеПредложенияТорговойПлощадки.ПрайсЛист,
		|	ТорговыеПредложенияТорговойПлощадки.Номенклатура,
		|	ТорговыеПредложенияТорговойПлощадки.Характеристика,
		|	ТорговыеПредложенияТорговойПлощадки.Упаковка
		|ИЗ
		|	РегистрСведений.ТорговыеПредложенияТорговойПлощадки КАК ТорговыеПредложенияТорговойПлощадки
		|ГДЕ
		|	ТорговыеПредложенияТорговойПлощадки.КратностьУпаковки = 0";
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Выгрузка, ДополнительныеПараметры);
	
КонецПроцедуры

// Обрабатывает данные, зарегистрированные в плане обмена ОбновлениеИнформационнойБазы
//  см. Стандарты и методики разработки прикладных решений: Параллельный режим отложенного обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.ТорговыеПредложенияТорговойПлощадки;
	ПолноеИмяОбъекта  = МетаданныеОбъекта.ПолноеИмя();
	
	Если ОбновлениеИнформационнойБазы.ЕстьЗаблокированныеПредыдущимиОчередямиДанные(
		Параметры.Очередь, ПолноеИмяОбъекта) Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	ПараметрыВыборки = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(
		Параметры.Очередь, ПолноеИмяОбъекта, ПараметрыВыборки);
	
	ЕстьОтработанныеЗаписи = Ложь;
	ПроизошлаОшибка        = Ложь;
	ТекстСообщения         = "";
	
	Пока ОбновляемыеДанные.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПрайсЛист.Установить(ОбновляемыеДанные.ПрайсЛист);
			НаборЗаписей.Отбор.Номенклатура.Установить(ОбновляемыеДанные.Номенклатура);
			НаборЗаписей.Отбор.Характеристика.Установить(ОбновляемыеДанные.Характеристика);
			НаборЗаписей.Отбор.Упаковка.Установить(ОбновляемыеДанные.Упаковка);
			
			ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(НаборЗаписей);
			
			НаборЗаписей.Прочитать();
			
			Записать = Ложь;
			
			Если НаборЗаписей.Количество() > 0 Тогда
				
				ТекущаяЗапись = НаборЗаписей[0];
				
				Если ТекущаяЗапись.КратностьУпаковки = 0 Тогда
					
					Записать = Истина;
					
					ТекущаяЗапись.КратностьУпаковки = 1;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Записать Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ЕстьОтработанныеЗаписи = Истина;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ШаблонСообщения = НСтр("ru = 'Не удалось обработать запись по торговому предложению %1 по причине: %2%3'");
			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения = СтрШаблон(
				ШаблонСообщения, 
				ОбновляемыеДанные.ПрайсЛист, 
				Символы.ПС, 
				ПредставлениеОшибки);
			
			Событие = ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации();
			ЗаписьЖурналаРегистрации(
				Событие, 
				УровеньЖурналаРегистрации.Ошибка,
				МетаданныеОбъекта, 
				ОбновляемыеДанные.ПрайсЛист, 
				ТекстСообщения);
			
			ПроизошлаОшибка = Истина;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если Не ЕстьОтработанныеЗаписи И ПроизошлаОшибка Тогда
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = 
		ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ОбработатьДанныеДляПереходаНаНовуюВерсию", Истина);
	Методы.Вставить("ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. ТорговыеПредложенияСлужебный.ПубликуемаяНоменклатураТорговыхПредложений
//
Функция ПубликуемаяНоменклатураТорговыхПредложений(ПрайсЛист = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТорговыеПредложенияТорговойПлощадки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ТорговыеПредложенияТорговойПлощадки КАК ТорговыеПредложенияТорговойПлощадки";
		
	ТекстУсловийСекцииГДЕ = "ТорговыеПредложенияТорговойПлощадки.Публикуется";

	Если ПрайсЛист <> Неопределено Тогда
		ТекстУсловийСекцииГДЕ = 
			СтрШаблон("%1 
				|	И %2", 
				ТекстУсловийСекцииГДЕ,
				"ТорговыеПредложенияТорговойПлощадки.ПрайсЛист = &ПрайсЛист");
		Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	КонецЕсли;
	
	ТекстСекцииГДЕ = ТорговыеПредложенияСлужебный.ТекстЗапросаСекцияГДЕ(ТекстУсловийСекцииГДЕ);
	
	ТекстЗапроса = СтрШаблон("%1%2", ТекстЗапроса, ТекстСекцииГДЕ);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеКратностиУпаковокПубликуемыхТорговыхПредложений(ПрайсЛист) Экспорт
	
	Результат = Новый Массив;
	
	Отбор = Новый Структура("ПрайсЛист", ПрайсЛист);
	СведенияОТорговомПредложении = ТорговыеПредложенияСлужебный.ПолучитьДанныеПубликации("Товары", Отбор);
	ТаблицаТовары = СведенияОТорговомПредложении.Товары.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура,
		|	ТаблицаТовары.Характеристика,
		|	ТаблицаТовары.Упаковка,
		|	ТаблицаТовары.КратностьУпаковки
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура,
		|	ТаблицаТовары.Характеристика,
		|	ТаблицаТовары.Упаковка,
		|	ЕСТЬNULL(ТорговыеПредложенияТорговойПлощадки.КратностьУпаковки, ТаблицаТовары.КратностьУпаковки) КАК
		|		КратностьУпаковки
		|ИЗ
		|	ТаблицаТовары КАК ТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТорговыеПредложенияТорговойПлощадки КАК ТорговыеПредложенияТорговойПлощадки
		|		ПО ТаблицаТовары.Номенклатура = ТорговыеПредложенияТорговойПлощадки.Номенклатура
		|		И ТаблицаТовары.Характеристика = ТорговыеПредложенияТорговойПлощадки.Характеристика
		|		И ТаблицаТовары.Упаковка = ТорговыеПредложенияТорговойПлощадки.Упаковка
		|		И ТорговыеПредложенияТорговойПлощадки.ПрайсЛист = &ПрайсЛист";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары);
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДанныеКратности = ТорговыеПредложенияСлужебный.НовыеДанныеКратностиУпаковок();
		ЗаполнитьЗначенияСвойств(ДанныеКратности, ВыборкаДетальныеЗаписи);
		Результат.Добавить(ДанныеКратности);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Изменяет кратности упаковок в переданных данных. Ни в коем случае не использовать внутри явно открытой транзакции!
// 
// Параметры:
//  ПрайсЛист - ОпределяемыйТип.ТорговоеПредложение
//  ДанныеЗаписей - ТаблицаЗначений:
//  * Номенклатура - ОпределяемыйТип.НоменклатураБЭД
//  * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД
//  * Упаковка - ОпределяемыйТип.УпаковкаНоменклатурыБЭД
//  * КратностьУпаковки - Число
//  Отказ - Булево
Процедура ИзменитьКратностиУпаковок(ПрайсЛист, Знач ДанныеЗаписей, Отказ) Экспорт
	
	Если ДанныеЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаписей.Колонки.Добавить("ПрайсЛист", 
		Метаданные.РегистрыСведений.ТорговыеПредложенияТорговойПлощадки.Измерения.ПрайсЛист.Тип);
		
	Для Каждого ДанныеЗаписи Из ДанныеЗаписей Цикл
		ДанныеЗаписи.ПрайсЛист = ПрайсЛист;
	КонецЦикла;
	
	ПоляКлючейЗаписиСтрокой = ИменаИзмеренийСтрокой();
	
	ТаблицаОтбора = ДанныеЗаписей.Скопировать(, ПоляКлючейЗаписиСтрокой);
	ТаблицаТорговыеПредложенияДляСохранения = ТекущиеЗначения(ТаблицаОтбора);
	
	Для Каждого ДанныеЗаписи Из ДанныеЗаписей Цикл
		ОтборСтроки = Новый Структура(ПоляКлючейЗаписиСтрокой);
		ЗаполнитьЗначенияСвойств(ОтборСтроки, ДанныеЗаписи);
		СтрокиТаблицыТорговыеПредложенияДляСохранения = 
			ТаблицаТорговыеПредложенияДляСохранения.НайтиСтроки(ОтборСтроки);
		Если СтрокиТаблицыТорговыеПредложенияДляСохранения.Количество() > 0 Тогда
			СтрокаТаблицыТорговыеПредложенияДляСохранения = СтрокиТаблицыТорговыеПредложенияДляСохранения[0];
		Иначе
			СтрокаТаблицыТорговыеПредложенияДляСохранения = ТаблицаТорговыеПредложенияДляСохранения.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыТорговыеПредложенияДляСохранения, ДанныеЗаписи);
	КонецЦикла;
	
	Попытка 
		
		СохранитьЗаписи(ТаблицаТорговыеПредложенияДляСохранения);
		
	Исключение
		
		Отказ = Истина;
		
		ВидОперации = 
			НСтр("ru = 'Изменение кратности упаковки торгового предложения'", ОбщегоНазначения.КодОсновногоЯзыка());
		ПодробныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронноеВзаимодействие.ОбработатьОшибку(
			ВидОперации, ПодробныйТекстОшибки, ПодробныйТекстОшибки, "ТорговыеПредложения");
	
	КонецПопытки;
	
КонецПроцедуры

// Удалить прайс лист. Ни в коем случае не использовать внутри явно открытой транзакции!
// 
// Параметры:
//  ПрайсЛист - ОпределяемыйТип.ТорговоеПредложение
//  Отказ - Булево
//
Процедура УдалитьПрайсЛист(ПрайсЛист, Отказ) Экспорт
		
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТорговыеПредложенияТорговойПлощадки");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ПрайсЛист", ПрайсЛист.Ссылка);
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛист.Ссылка);
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Отказ = Истина;
		
		ТекстОшибки = НСтр("ru = 'Удаление прайс листа.'");
		ПодробныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1%2%3", 
			ТекстОшибки, 
			Символы.ПС, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Подсистема = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ТорговыеПредложения;
		ОбщегоНазначенияБЭД.ЗаписатьВЖурналРегистрации(ПодробныйТекстОшибки, Подсистема);
		
	КонецПопытки;
	
КонецПроцедуры

// Позиции торговых предложений по причине исключения.
// 
// Параметры:
//  ПрайсЛист - ОпределяемыйТип.ТорговоеПредложение
//  ПричинаИсключенияИзПубликации - ОпределяемыйТип.ПричинаИсключенияИзПубликацииТорговыеПредложения
// 
// Возвращаемое значение:
//  Массив из см. НовыйПозицияТорговогоПредложения
//
Функция ПозицииТорговыхПредложенийПоПричинеИсключения(ПрайсЛист, ПричинаИсключенияИзПубликации) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТорговыеПредложенияТорговойПлощадки.ПрайсЛист,
		|	ТорговыеПредложенияТорговойПлощадки.Номенклатура,
		|	ТорговыеПредложенияТорговойПлощадки.Характеристика,
		|	ТорговыеПредложенияТорговойПлощадки.Упаковка,
		|	ТорговыеПредложенияТорговойПлощадки.ЕстьПредупреждения
		|ИЗ
		|	РегистрСведений.ТорговыеПредложенияТорговойПлощадки КАК ТорговыеПредложенияТорговойПлощадки
		|ГДЕ
		|	ТорговыеПредложенияТорговойПлощадки.ПрайсЛист = &ПрайсЛист
		|	И ТорговыеПредложенияТорговойПлощадки.ПричинаИсключенияИзПубликации = &ПричинаИсключенияИзПубликации";
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	Запрос.УстановитьПараметр("ПричинаИсключенияИзПубликации", ПричинаИсключенияИзПубликации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПозицияТорговогоПредложения = НовыйПозицияТорговогоПредложения();
		ЗаполнитьЗначенияСвойств(ПозицияТорговогоПредложения, ВыборкаДетальныеЗаписи);
		Результат.Добавить(ПозицияТорговогоПредложения);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Имена измерений строкой.
// 
// Возвращаемое значение:
//  Строка
Функция ИменаИзмеренийСтрокой() Экспорт
	
	Результат = "";
	
	Для Каждого Измерение Из Метаданные.РегистрыСведений.ТорговыеПредложенияТорговойПлощадки.Измерения Цикл
		Результат = СтрШаблон("%1,%2", Результат, Измерение.Имя);
	КонецЦикла;
	
	Результат = Сред(Результат, 2); // Исключаем первую запятую
	
	Возврат Результат;
	
КонецФункции

// Возвращает текущие значения регистра. С учетом отборов, если они переданы.
// 
// Параметры:
//  ТаблицаОтбора - ТаблицаЗначений:
// * ПрайсЛист - ОпределяемыйТип.ТорговоеПредложение
// * Номенклатура - ОпределяемыйТип.НоменклатураБЭД
// * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД
// * Упаковка - ОпределяемыйТип.УпаковкаНоменклатурыБЭД
// 
// Возвращаемое значение:
//  см. ТорговыеПредложенияСлужебный.НоваяТаблицаТорговыеПредложенияДляСохранения
Функция ТекущиеЗначения(ТаблицаОтбора = Неопределено) Экспорт
	
	Результат = ТорговыеПредложенияСлужебный.НоваяТаблицаТорговыеПредложенияДляСохранения();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаТорговыеПредложенияТорговойПлощадки();
	ПсевдонимТаблицы = ПсевдонимТаблицы();
		
	Если ТаблицаОтбора <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("ТаблицаОтбора", ТаблицаОтбора);
		ТорговыеПредложенияСлужебный.ДополнитьТекстЗапросаТаблицаЗначений(Запрос, "ТаблицаОтбора", ТаблицаОтбора);
		
		ИндексПакета = 1;
		ИндексОператораПакета = 0;
		ИндексИсточникаИсходнойТаблицы = 0;
		ИмяТаблицы = "ТаблицаОтбора";
		УсловияСоединения = "Истина";
		Для каждого Колонка Из ТаблицаОтбора.Колонки Цикл
			УсловияСоединения = СтрШаблон("%1%2 И %3.%4 = ТаблицаОтбора.%4",
				УсловияСоединения,
				Символы.ПС,
				ПсевдонимТаблицы,
				Колонка.Имя);
		КонецЦикла;
		
		ТорговыеПредложенияСлужебный.ДобавитьСоединениеВТекстЗапроса(Запрос.Текст, ИндексПакета, ИндексОператораПакета,
			ИндексИсточникаИсходнойТаблицы, ИмяТаблицы, ТипСоединенияСхемыЗапроса.Внутреннее, УсловияСоединения);
				
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

// Добавляет/обновляет переданные записи в режиме замещения Слияние.
// 
// Параметры:
//  ТаблицаТорговыеПредложенияДляСохранения - см. ТорговыеПредложенияСлужебный.НоваяТаблицаТорговыеПредложенияДляСохранения
//  ДополнительныеСвойства - Неопределено, Структура:
//  * ОтключитьОбновлениеСтатистики - Булево
Процедура СохранитьЗаписи(ТаблицаТорговыеПредложенияДляСохранения, ДополнительныеСвойства = Неопределено) Экспорт
	
	ИмяСобытия = НСтр("ru = 'Сохранить записи торговых предложений торговой площадки'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписатьНаборы(ТаблицаТорговыеПредложенияДляСохранения, РежимЗамещения.Слияние, ИмяСобытия, ДополнительныеСвойства);
	
КонецПроцедуры

// Удаляет переданные записи из регистра.
// 
// Параметры:
//  ТаблицаТорговыеПредложенияДляУдаления - см. ТорговыеПредложенияСлужебный.НоваяТаблицаТорговыеПредложенияДляУдаления
Процедура УдалитьЗаписи(ТаблицаТорговыеПредложенияДляУдаления) Экспорт
	
	ИмяСобытия = НСтр("ru = 'Удалить записи торговых предложений торговой площадки'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписатьНаборы(ТаблицаТорговыеПредложенияДляУдаления, РежимЗамещения.Удаление, ИмяСобытия);
	
КонецПроцедуры

// Устанавливает блокировку записей.
// 
// Параметры:
//  ИсточникДанных - РезультатЗапроса, ТаблицаЗначений
Процедура УстановитьБлокировкуЗаписей(ИсточникДанных) Экспорт

	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ТорговыеПредложенияТорговойПлощадки");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ИсточникДанных;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПрайсЛист"      , "ПрайсЛист");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура"   , "Номенклатура");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика" , "Характеристика");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Упаковка"       , "Упаковка");
	
		БлокировкаДанных.Заблокировать();
		
	Исключение
		
		ИмяСобытия = НСтр("ru = 'Установить блокировку записей торговых предложений торговой площадки'",
			ОбщегоНазначения.КодОсновногоЯзыка());

		ЗаписьЖурналаРегистрации(
			ИмяСобытия, 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ТорговыеПредложенияТорговойПлощадки, 
			"ТорговыеПредложенияТорговойПлощадки.УстановитьБлокировкуЗаписей", 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		ВызватьИсключение;

	КонецПопытки;
	
КонецПроцедуры

// Устанавливает пессимистическую блокировку для редактирования записей.
// 
// Параметры:
//  ПрайсЛист - ОпределяемыйТип.ТорговоеПредложение
//  ДанныеЗаписей - ТаблицаЗначений:
//  * Номенклатура - ОпределяемыйТип.НоменклатураБЭД
//  * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД
//  * Упаковка - ОпределяемыйТип.УпаковкаНоменклатурыБЭД
//  ИдентификаторФормы - УникальныйИдентификатор
Процедура ЗаблокироватьДляРедактирования(ПрайсЛист, ДанныеЗаписей, ИдентификаторФормы) Экспорт
	
	Для Каждого ДанныеЗаписи Из ДанныеЗаписей Цикл
	
		ЗначениеКлюча = Новый Структура;
		ЗначениеКлюча.Вставить("ПрайсЛист", ПрайсЛист);
		ЗначениеКлюча.Вставить("Номенклатура", ДанныеЗаписи.Номенклатура);
		ЗначениеКлюча.Вставить("Характеристика", ДанныеЗаписи.Характеристика);
		ЗначениеКлюча.Вставить("Упаковка", ДанныеЗаписи.Упаковка);
		КлючЗаписи = СоздатьКлючЗаписи(ЗначениеКлюча);
		
		ЗаблокироватьДанныеДляРедактирования(КлючЗаписи,, ИдентификаторФормы);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Новый позиция торгового предложения.
// 
// Возвращаемое значение:
//  Структура:
//  * ПрайсЛист - ОпределяемыйТип.ТорговоеПредложение
//  * Номенклатура - ОпределяемыйТип.НоменклатураБЭД
//  * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД
//  * Упаковка - ОпределяемыйТип.УпаковкаНоменклатурыБЭД
//
Функция НовыйПозицияТорговогоПредложения()
	
	Результат = Новый Структура;
	
	Измерения = Метаданные.РегистрыСведений.ТорговыеПредложенияТорговойПлощадки.Измерения;
	Для Каждого Измерение Из Измерения Цикл
		Результат.Вставить(Измерение.Имя, Измерение.Тип.ПривестиЗначение());
	КонецЦикла;
	
	//@skip-warning
	Возврат Результат;
	
КонецФункции

// Записывает наборы из переданной таблицы с переданным режимом замещения
// 
// Параметры:
//  ТаблицаТорговыеПредложения - см. ТорговыеПредложенияСлужебный.НоваяТаблицаТорговыеПредложенияДляСохранения
//                               см. ТорговыеПредложенияСлужебный.НоваяТаблицаТорговыеПредложенияДляУдаления
//  РежимЗамещенияЗаписей - ПеречислениеРежимЗамещения
//  ИмяСобытия - Строка
//  ДополнительныеСвойства - Неопределено, Структура:
//  * ОтключитьОбновлениеСтатистики - Булево
Процедура ЗаписатьНаборы(ТаблицаТорговыеПредложения, 
	РежимЗамещенияЗаписей, ИмяСобытия, ДополнительныеСвойства = Неопределено)
	
	ТорговыеПредложенияСлужебный.ЗаписатьНаборыРегистраСведений(РегистрыСведений.ТорговыеПредложенияТорговойПлощадки,
		ТаблицаТорговыеПредложения, РежимЗамещенияЗаписей, ИмяСобытия, ДополнительныеСвойства);
		
КонецПроцедуры

#Область ТекстыЗапросов

// Текст запроса торговые предложения торговой площадки
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаТорговыеПредложенияТорговойПлощадки()
	
	ПсевдонимТаблицы = ПсевдонимТаблицы();
	
	ТекстЗапроса = ТорговыеПредложенияСлужебный.ТекстЗапросаПоМетаданным(
		Метаданные.РегистрыСведений.ТорговыеПредложенияТорговойПлощадки,
		ПсевдонимТаблицы);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Псевдоним таблицы. Для использования в текста запроса, возвращающего данные регистра.
// 
// Возвращаемое значение:
//  Строка
Функция ПсевдонимТаблицы()
	
	ПсевдонимТаблицы = ТорговыеПредложенияСлужебный.ПсевдонимТаблицыПоМетаданным(
		Метаданные.РегистрыСведений.ТорговыеПредложенияТорговойПлощадки);
		
	Возврат ПсевдонимТаблицы;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли