#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ВидОперации") Тогда
		ПустойМассив = Новый Массив;
		Параметры.Отбор.ВидОперации = Новый ФиксированныйМассив(ПустойМассив);
		Параметры.Отбор.Проведен = Ложь;
	КонецЕсли;
	
	АдаптацияФормыТакси();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ИнтерфейсТакси = НЕ ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	Элементы.Переместить(Элементы.КоманднаяПанель, Элементы.Список.КоманднаяПанель);
	
КонецПроцедуры

#КонецОбласти