#Область ОписаниеПеременных

&НаКлиенте
Перем ВозможныеСостояния;

&НаКлиенте
Перем ОписаниеНовогоДрайвера;

&НаКлиенте
Перем ОписаниеСтарогоДрайвера;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	НовыйДрайвер = Параметры.НовыйДрайвер;
	СтарыйДрайвер = Параметры.СтарыйДрайвер;
	ПодключаемоеОборудование = Параметры.ПодключаемоеОборудование;
	
	Если ЗначениеЗаполнено(Параметры.ТСПИоТ) Тогда
		Элементы.ГруппаЗапретСменыДрайвера.Видимость = Истина;
		Элементы.ГруппаЧтениеОписанийДрайвера.Видимость = Ложь;
		ПодключаемоеОборудование = Неопределено;
	Иначе
		Элементы.ГруппаЗапретСменыДрайвера.Видимость = Ложь;
		Элементы.ГруппаЧтениеОписанийДрайвера.Видимость = Истина;
	КонецЕсли;
	Элементы.ГруппаЗаменаДрайвера.Видимость = Ложь;
	Элементы.Отмена.Видимость = Ложь;
	
	Элементы.ГруппаПроверкаСменыДрайвера.Видимость = Ложь;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Инициализация();
	
	Если ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		ЭтаФорма.Доступность = Ложь;
		ПодключитьОбработчикОжидания("ПослеОткрытиФормы", 0.1, Истина);
	Иначе
		ЭтаФорма.Доступность = Истина;
		Элементы.Отмена.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "КассоваяСменаЗакрыта" Тогда
		ПроверитьВозможностьСмены(Неопределено);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура УстановитьНовыйДрайвер(Команда)
	
	РезультатУстановки = Ждать МенеджерОборудованияКлиент.УстановитьДрайверОборудованияАсинх(НовыйДрайвер);
	Если РезультатУстановки.Результат Тогда
		ОписаниеНовогоДрайвера = Ждать МенеджерОборудованияКлиент.ОписаниеДрайвераАсинх(НовыйДрайвер);
	Иначе
		Текст = НСтр("ru = 'Ошибка установки.'") + Символы.ПС + РезультатУстановки.ОписаниеОшибки;
		ПредупреждениеАсинх(Текст);
	КонецЕсли;
	ОбновитьСостояние();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура УстановитьСтарыйДрайвер(Команда)
	
	РезультатУстановки = Ждать МенеджерОборудованияКлиент.УстановитьДрайверОборудованияАсинх(СтарыйДрайвер);
	Если РезультатУстановки.Результат Тогда
		ОписаниеСтарогоДрайвера = Ждать МенеджерОборудованияКлиент.ОписаниеДрайвераАсинх(СтарыйДрайвер);
	Иначе
		Текст = НСтр("ru = 'Ошибка установки.'") + Символы.ПС + РезультатУстановки.ОписаниеОшибки;
		ПредупреждениеАсинх(Текст);
	КонецЕсли;
	ОбновитьСостояние();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗакрытьКассовуюСмену(Команда)
	
	СтандартнаяОбработка = Истина;
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяКассоваяСмена() Тогда
		МодульКассовыеСменыКлиентПереопределяемый = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("КассовыеСменыКлиентПереопределяемый");
		МодульКассовыеСменыКлиентПереопределяемый.ЗакрытиеКассовойСменыПриЗаменеДрайвераОборудования(ПодключаемоеОборудование, СтандартнаяОбработка);
		
		Если СтандартнаяОбработка Тогда

			ТекущийКассир = МенеджерОборудованияКлиентСервер.ТекущийКассирДляФискальныхОпераций();  
			
			ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
			ПараметрыОперации.Кассир = ТекущийКассир.Кассир;
			ПараметрыОперации.КассирИНН = ТекущийКассир.КассирИНН;
			
			РезультатЗакрытия = Ждать ОборудованиеЧекопечатающиеУстройстваКлиент.ЗакрытьСменуНаФискальномУстройствеАсинх(
				ЭтотОбъект, 
				ПодключаемоеОборудование,
				ПараметрыОперации);
			
			ПроверитьВозможностьСмены(Команда);
		Иначе
			Закрыть(КодВозвратаДиалога.Отмена);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьДрайвер(Команда)
	
	НовыеПараметрыДрайвераXML = ОписаниеНовогоДрайвера.ОписаниеДрайвера.ПараметрыДрайвера;
	УдалитьОтличающиесяПараметрыНаСервере(ПодключаемоеОборудование, НовыеПараметрыДрайвераXML);
	
	Закрыть(КодВозвратаДиалога.ОК);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьСмены(Команда)
	
	ПроверитьВозможностьСменыДрайвераНаСервере(ОписаниеНовогоДрайвера.ОписаниеДрайвера.ПараметрыДрайвера);
	ОбновитьСостояние();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ПослеОткрытиФормы()
	
	Ждать ОбновитьОписанияДрайверов();
	ЭтаФорма.Доступность = Истина;
	
	Элементы.ГруппаЧтениеОписанийДрайвера.Видимость = Ложь;
	Элементы.ГруппаЗаменаДрайвера.Видимость = Истина;
	Элементы.Отмена.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ОбновитьОписанияДрайверов()
	
	ОписаниеСтарогоДрайвера = Ждать МенеджерОборудованияКлиент.ОписаниеДрайвераАсинх(СтарыйДрайвер);
	ОписаниеНовогоДрайвера = Ждать МенеджерОборудованияКлиент.ОписаниеДрайвераАсинх(НовыйДрайвер);
	ОбновитьСостояние();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСостояние()
	
	Если ТекущееСостояние = ВозможныеСостояния.Установка Тогда
		
		Если ОписаниеНовогоДрайвера.Результат Тогда
			ТекущееСостояние = ВозможныеСостояния.Проверка;
		КонецЕсли;
		
	ИначеЕсли ТекущееСостояние = ВозможныеСостояния.Проверка Тогда
		Если ПроверкаПройдена Тогда
			ТекущееСостояние = ВозможныеСостояния.Замена;
		КонецЕсли;
	Иначе 
		// ТекущееСостояние = ВозможныеСостояния.Замена
	КонецЕсли;
	
	ОбновитьВидимостьФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьФормы()
	
	Если ОписаниеНовогоДрайвера.Результат Тогда
		Элементы.НовыйДрайверУстановлен.Видимость = Истина;
		Элементы.УстановитьНовыйДрайвер.Видимость = Ложь;
	Иначе
		Элементы.НовыйДрайверУстановлен.Видимость = Ложь;
		Элементы.УстановитьНовыйДрайвер.Видимость = Истина;
	КонецЕсли;
	
	Если ОписаниеСтарогоДрайвера.Результат Тогда
		Элементы.СтарыйДрайверУстановлен.Видимость = Истина;
		Элементы.УстановитьСтарыйДрайвер.Видимость = Ложь;
	Иначе
		Элементы.СтарыйДрайверУстановлен.Видимость = Ложь;
		Элементы.УстановитьСтарыйДрайвер.Видимость = Истина;
	КонецЕсли;
	
	Если ТекущееСостояние = ВозможныеСостояния.Установка Тогда
		Элементы.КнопкаУстановитьНовыйДрайвер.Видимость = Истина;
		Элементы.КнопкаПроверитьВозможностьСмены.Видимость = Ложь;
		Элементы.КнопкаЗаменить.Видимость = Ложь;
	ИначеЕсли ТекущееСостояние = ВозможныеСостояния.Проверка Тогда
		Элементы.КнопкаУстановитьНовыйДрайвер.Видимость = Ложь;
		Элементы.КнопкаПроверитьВозможностьСмены.Видимость = Истина;
		Элементы.КнопкаЗаменить.Видимость = Ложь;
	ИначеЕсли ТекущееСостояние = ВозможныеСостояния.Замена Тогда
		Элементы.КнопкаУстановитьНовыйДрайвер.Видимость = Ложь;
		Элементы.КнопкаПроверитьВозможностьСмены.Видимость = Ложь;
		Элементы.КнопкаЗаменить.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Инициализация()
	ВозможныеСостояния = Новый Структура;
	ВозможныеСостояния.Вставить("Установка", "Установка");
	ВозможныеСостояния.Вставить("Проверка", "Проверка");
	ВозможныеСостояния.Вставить("Замена", "Замена");
	
	ТекущееСостояние = ВозможныеСостояния.Установка;
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьСменыДрайвераНаСервере(Знач НовыеПараметрыДрайвераXML)
	
	ПроверкаПройдена = Истина;
	
	// проверить что кассовая смена закрыта
	Реквизиты = ОбщегоНазначенияБПО.ЗначенияРеквизитовОбъекта(ПодключаемоеОборудование, "ТипОборудования");
	Если Реквизиты.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ 
		И ОбщегоНазначенияБПО.ИспользуетсяКассоваяСмена() Тогда
		МодульКассовыеСмены = ОбщегоНазначенияБПО.ОбщийМодуль("КассовыеСмены");
		Если МодульКассовыеСмены.ПоследняяСменаЗакрыта(ПодключаемоеОборудование) Тогда
			Элементы.ДекорацияПроверкаКассоваяСмена.Заголовок = НСтр("ru = 'Кассовая смена закрыта'");
			Элементы.ЗакрытьКассовуюСмену.Видимость = Ложь;
		Иначе
			Элементы.ДекорацияПроверкаКассоваяСмена.Заголовок = НСтр("ru = 'Кассовая смена открыта.'");
			Элементы.ЗакрытьКассовуюСмену.Видимость = Истина;
			ПроверкаПройдена = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ГруппаПроверкаЗакрытияКассовойСмены.Видимость = Ложь;
	КонецЕсли;
	
	// проверить что свойства одинаковые
	ПараметрыУстройстваВБазе = МенеджерОборудования.ПараметрыУстройства(ПодключаемоеОборудование);
	НовыеПараметрыДрайвера = ЗагрузитьПараметрыXML(НовыеПараметрыДрайвераXML);
	
	Если ВходитВПодмножество(ПараметрыУстройстваВБазе, НовыеПараметрыДрайвера) Тогда
		Элементы.ДекорацияРеквизитыОборудования.Заголовок = НСтр("ru = 'Настройки оборудования совместимы'");
		Элементы.ГруппаПроверкаРеквизитовОборудования.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	Иначе
		Элементы.ДекорацияРеквизитыОборудования.Заголовок = НСтр("ru = 'Настройки оборудования отличаются.'");
		Элементы.ГруппаПроверкаРеквизитовОборудования.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	КонецЕсли;
	
	Элементы.ГруппаПроверкаСменыДрайвера.Видимость = Истина;
	Возврат ПроверкаПройдена;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьОтличающиесяПараметрыНаСервере(Знач ПодключаемоеОборудование, Знач НовыеПараметрыДрайвераXML)
	
	ПараметрыУстройстваВБазе = МенеджерОборудования.ПараметрыУстройства(ПодключаемоеОборудование);
	НовыеПараметрыДрайвера = ЗагрузитьПараметрыXML(НовыеПараметрыДрайвера);
	
	ЗаполнитьЗначенияСвойств(НовыеПараметрыДрайвера, ПараметрыУстройстваВБазе);
	МенеджерОборудования.СохранитьПараметрыУстройства(ПодключаемоеОборудование, НовыеПараметрыДрайвера);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьПараметрыXML(Знач ПараметрыXML)
	
	Результат = Новый Структура;
	Если ПустаяСтрока(ПараметрыXML) Тогда
		Возврат Результат;
	КонецЕсли;
	
	
	ЧтениеXML = Новый ЧтениеXML; 
	ЧтениеXML.УстановитьСтроку(ПараметрыXML);
	ЧтениеXML.ПерейтиКСодержимому();
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "Parameter" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда     
			ПараметрИмя = ЧтениеXML.ЗначениеАтрибута("Name");
			ПараметрЗначение = ЧтениеXML.ЗначениеАтрибута("DefaultValue");   
			Если ПараметрИмя <> "EquipmentType" Тогда  
				ПараметрИмя = "P_" + ПараметрИмя;
				Результат.Вставить(ПараметрИмя, ПараметрЗначение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВходитВПодмножество(СтруктураА, СтруктураБ)
	
	Для Каждого Поле Из СтруктураА Цикл
		Если Не СтруктураБ.Свойство(Поле) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

#КонецОбласти

