
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидДействия = Параметры.ВидДействия;
	Действия = Параметры.Действия;
	Источник = Параметры.Источник;
	ИмяТЧ = Параметры.ИмяТЧ;
	
	Если Параметры.Свойство("Значения") И ТипЗнч(Параметры.Значения) = Тип("Массив") Тогда
		Значения.ЗагрузитьЗначения(Параметры.Значения);
	КонецЕсли;
	
	Параметры.Свойство("ИмяФормыИсточника", ИмяФормыИсточника);
	Параметры.Свойство("СпискиВыбораПоДействиям", СпискиВыбораПоДействиям);
	Параметры.Свойство("ТипЗначения", ТипЗначения);
	
	НастроитьВидФормы(ВидДействия, Действия);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
		
		Если ИмяФормыИсточника = "РасходыПриИмпорте" Тогда
			Если Не ЗначениеЗаполнено(ЗначениеДобавитьИзДокументаИмпортныеТовары) Тогда
				Поле = "ЗначениеДобавитьИзДокументаИмпортныеТовары";
			КонецЕсли;
		ИначеЕсли Не ЗначениеЗаполнено(ЗначениеДобавитьИзДокумента) Тогда
			Поле = "ЗначениеДобавитьИзДокумента";
		КонецЕсли;
		
		Если Поле <> Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Выберите документ'"), , Поле, , Отказ);
		КонецЕсли;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокументаИмпортныеТовары") Тогда
		
		Если Не ЗначениеЗаполнено(ЗначениеДобавитьИзДокументаИмпортныеТовары) Тогда
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Выберите документ'"), , "ЗначениеДобавитьИзДокументаИмпортныеТовары", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДействияПриИзменении(Элемент)
	
	НастроитьВидФормы(ВидДействия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Действие", ВидДействия);
	Результат.Вставить("Значение", ЗначениеПоВидуДействия());
	Результат.Вставить("ОтменаИзменений", Ложь);
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОкругления(Команда)
	
	ОткрытьФорму("Обработка.БонусныеПрограммы.Форма", Новый Структура("Округления", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Действие", ВидДействия);
	Результат.Вставить("Значение", ЗначениеПоВидуДействия());
	Результат.Вставить("ИмяТЧ", ИмяТЧ);
	Результат.Вставить("Владелец", ВладелецФормы);
	
	Оповестить("ИзменитьВыделенные_Применить", Результат, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИзменения(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("ОтменаИзменений", Истина);
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидФормы(ВидДействия, Действия = Неопределено)
	
	Если Действия <> Неопределено Тогда
		
		Элементы.ВидДействия.СписокВыбора.Очистить();
		
		Для каждого Действие Из Действия Цикл
			
			Если Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента")
				Или Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокументаИмпортныеТовары") Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ДействиеОписание = ГрупповоеИзменениеСтрокСервер.ПредставлениеДействия(Действие);
			Если ИмяФормыИсточника <> "" Тогда
				НестандартноеОписание = НестандартныйЗаголовокДействия(ИмяФормыИсточника, Действие);
				Если НестандартноеОписание <> Неопределено Тогда
					ДействиеОписание = НестандартноеОписание;
				КонецЕсли;
			КонецЕсли;
			
			Элементы.ВидДействия.СписокВыбора.Добавить(Действие, ДействиеОписание);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого Элемент Из Элементы.ГруппаЗначенияДействий.ПодчиненныеЭлементы Цикл
		Элемент.Видимость = Ложь;
	КонецЦикла;
	
	Если ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
		
		Если ИмяФормыИсточника = "РасходыПриИмпорте" Тогда
			
			Элементы.ЗначениеДобавитьИзДокументаИмпортныеТовары.Видимость = Истина;
			ВыбранноеЗначение = ЗначениеДобавитьИзДокументаИмпортныеТовары;
			
		Иначе
			
			Элементы.ЗначениеДобавитьИзДокумента.Видимость = Истина;
			ВыбранноеЗначение = ЗначениеДобавитьИзДокумента;
			
		КонецЕсли;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокументаИмпортныеТовары") Тогда
		
		Элементы.ЗначениеДобавитьИзДокументаИмпортныеТовары.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеДобавитьИзДокументаИмпортныеТовары;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
		
		Элементы.ЗачениеПроцент.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеПроцент;
		
		Если ИмяФормыИсточника = "ПланПродаж" Тогда
			Элементы.ЗачениеПроцент.Заголовок = НСтр("ru = 'Изменить суммы на'");
		КонецЕсли;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены") Тогда
		
		Элементы.ЗначениеОкругление.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеОкругление;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьСуммы") Тогда
		
		Элементы.ЗначениеОкругление.Видимость = Истина;
		Элементы.НастроитьОкругления.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеОкругление;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммеПередачи")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммеВознаграждения") Тогда
		
		Элементы.ЗначениеСумма.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеСумма;
		
		Если ИмяФормыИсточника = "ПланПродаж" Тогда
			
			Если ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
				Элементы.ЗначениеСумма.Заголовок = НСтр("ru = 'Количество'");
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
		
		Элементы.ЗначениеСтавкаНДС.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеСтавкаНДС;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПроцентСкидкиНаценки") Тогда
		
		Элементы.ЗначениеСкидка.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеСкидка;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦены") Тогда
		
		Элементы.ЗначениеЦена.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеЦена;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦеныПоВиду")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьВидЦен") Тогда
		
		Элементы.ЗачениеВидЦен.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеВидЦен;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПокупателя") Тогда
		
		Элементы.ЗначениеЗаказПокупателя.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеЗаказПокупателя;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуОтгрузки")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуПоступления")
		ИЛИ ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуРеализации")
		ИЛИ ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуПланирования") Тогда
		
		Элементы.ЗначениеДата.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеДата;
		
		Если ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуОтгрузки") Тогда
			Элементы.ЗначениеДата.Заголовок = НСтр("ru = 'Дата отгрузки'");
		ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуПоступления") Тогда
			Элементы.ЗначениеДата.Заголовок = НСтр("ru = 'Дата поступления'");
		ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуРеализации") Тогда
			Элементы.ЗначениеДата.Заголовок = НСтр("ru = 'Дата реализации'");
		ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуПланирования") Тогда
			Элементы.ЗначениеДата.Заголовок = НСтр("ru = 'Дата планирования'");
		КонецЕсли;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПокупателя")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПоставщика") Тогда
		
		Элементы.ЗначениеКонтрагент.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеКонтрагент;
		
		Если ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПокупателя") Тогда
			Элементы.ЗначениеКонтрагент.Заголовок = НСтр("ru = 'Покупатель'");
		ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПоставщика") Тогда
			Элементы.ЗначениеКонтрагент.Заголовок = НСтр("ru = 'Поставщик'");
		КонецЕсли;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСклад")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьИзготовителя") Тогда
		
		Элементы.ЗначениеСклад.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеСклад;
		
		Если ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСклад") Тогда
			Элементы.ЗначениеСклад.Заголовок = НСтр("ru = 'Склад'");
		ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьИзготовителя") Тогда
			Элементы.ЗначениеСклад.Заголовок = НСтр("ru = 'Изготовитель'");
		КонецЕсли;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПоставщикуЗаказПокупателя") Тогда
		
		Если ТипЗначения = "ЗаказПокупателя" Тогда
			
			Элементы.ЗначениеЗаказПокупателя.Видимость = Истина;
			ВыбранноеЗначение = ЗначениеЗаказПокупателя;
			
		ИначеЕсли ТипЗначения = "ЗаказПоставщику" Тогда
			
			Элементы.ЗначениеЗаказПоставщику.Видимость = Истина;
			ВыбранноеЗначение = ЗначениеЗаказПоставщику;
			
		Иначе
			
			Элементы.ЗначениеЗаказПоставщикуЗаказПокупателя.Видимость = Истина;
			ВыбранноеЗначение = ЗначениеЗаказПоставщикуЗаказПокупателя;
			
		КонецЕсли;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЯчейку") Тогда
		
		Элементы.ЗначениеЯчейка.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеЯчейка;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьИсходноеМесто") Тогда
		
		Элементы.ЗначениеМесто.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеМесто;
		
		Если СпискиВыбораПоДействиям <> Неопределено И СпискиВыбораПоДействиям.Свойство("УстановитьИсходноеМесто") Тогда
			
			Элементы.ЗначениеМесто.СписокВыбора.Очистить();
			СписокВыбора = СпискиВыбораПоДействиям.УстановитьИсходноеМесто;
			Для Каждого ЭлементСписка Из СписокВыбора Цикл
				Элементы.ЗначениеМесто.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.СоздатьПартииНоменклатуры") Тогда
		
		Элементы.ЗначениеПартия.Видимость = Истина;
		ЗначениеПартия = НСтр("ru = 'Партия создана автоматически'");
		ВыбранноеЗначение = ЗначениеПартия;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЭтап") Тогда
		
		Элементы.ЗначениеЭтап.Видимость = Истина;
		Элементы.ЗначениеЭтап.СписокВыбора.ЗагрузитьЗначения(Значения.ВыгрузитьЗначения());
		ВыбранноеЗначение = ЗначениеЭтап;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСостояниеДоставки") Тогда
		
		Элементы.ЗначениеСостояниеДоставкиЗаказа.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеСостояниеДоставкиЗаказа;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСостояниеОплаты") Тогда
		
		Элементы.ЗначениеСостояниеОплатыЗаказа.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеСостояниеОплатыЗаказа;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСпособУказанияЗаказа") Тогда
		
		Элементы.ЗначениеСпособЗачетаИРаспределенияПлатежей.Видимость = Истина;
		ВыбранноеЗначение = ЗначениеСпособЗачетаИРаспределенияПлатежей;
		
	КонецЕсли;
	
	Если ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокументаИмпортныеТовары") Тогда
		
		Элементы.ВидДействия.Видимость = Ложь;
		
		Если ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			Заголовок = НСтр("ru = 'Добавление из документа'");
			
		ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокументаИмпортныеТовары") Тогда
			
			Заголовок = НСтр("ru = 'Добавление из документа (импортные товары)'");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗначениеПоВидуДействия()
	
	Результат = Неопределено;
	
	Если ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
		
		Если ИмяФормыИсточника = "РасходыПриИмпорте" Тогда
			
			Результат = ЗначениеДобавитьИзДокументаИмпортныеТовары;
			
		Иначе
			
			Результат = ЗначениеДобавитьИзДокумента;
			
		КонецЕсли;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокументаИмпортныеТовары") Тогда
		
		Результат = ЗначениеДобавитьИзДокументаИмпортныеТовары;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
		
		Результат = ЗначениеПроцент;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьСуммы") Тогда
		
		Результат = ЗначениеОкругление;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммеПередачи")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммеВознаграждения") Тогда
		
		Результат = ЗначениеСумма;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
		
		Результат = ЗначениеСтавкаНДС;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПроцентСкидкиНаценки") Тогда
		
		Результат = ЗначениеСкидка;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦены") Тогда
		
		Результат = ЗначениеЦена;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦеныПоВиду")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьВидЦен") Тогда
		
		Результат = ЗначениеВидЦен;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПокупателя") Тогда
		
		Результат = ЗначениеЗаказПокупателя;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуОтгрузки")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуПоступления")
		ИЛИ ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуРеализации")
		ИЛИ ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуПланирования") Тогда
		
		Результат = ЗначениеДата;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПокупателя")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПоставщика") Тогда
		
		Результат = ЗначениеКонтрагент;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСклад")
		Или ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьИзготовителя") Тогда
		
		Результат = ЗначениеСклад;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПоставщикуЗаказПокупателя") Тогда
		
		Если ТипЗначения = "ЗаказПокупателя" Тогда
			
			Результат = ЗначениеЗаказПокупателя;
			
		ИначеЕсли ТипЗначения = "ЗаказПоставщику" Тогда
			
			Результат = ЗначениеЗаказПоставщику;
			
		Иначе
			
			Результат = ЗначениеЗаказПоставщикуЗаказПокупателя;
			
		КонецЕсли;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЯчейку") Тогда
		
		Результат = ЗначениеЯчейка;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьИсходноеМесто") Тогда
		
		Результат = ЗначениеМесто;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.СоздатьПартииНоменклатуры") Тогда
		
		Результат = ЗначениеПартия;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЭтап") Тогда
		
		Результат = ЗначениеЭтап;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСостояниеДоставки") Тогда
		
		Результат = ЗначениеСостояниеДоставкиЗаказа;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСостояниеОплаты") Тогда
		
		Результат = ЗначениеСостояниеОплатыЗаказа;
		
	ИначеЕсли ВидДействия = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСпособУказанияЗаказа") Тогда
		
		Результат = ЗначениеСпособЗачетаИРаспределенияПлатежей;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НестандартныйЗаголовокДействия(ИмяФормы = "", Действие)
	
	Если ИмяФормы = "ПланПродаж" Тогда
		Если Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
			Возврат НСтр("ru='Изменить суммы на процент'");
		ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
			Возврат НСтр("ru='Установить количество для всех периодов'");
		ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			Возврат НСтр("ru='Установить сумму для всех периодов'");
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяФормы = "РасходыПриИмпорте" Тогда
		Если Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ПодобратьНомераГТД") Тогда
			Возврат НСтр("ru='Добавить строки по номеру ГТД из приходных накладных'");
		ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			Возврат НСтр("ru='Уточнить суммы распределения таможенного сбора'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти