#Область СлужебныйПрограммныйИнтерфейс

#Область ФиксированныеСтроки

Функция РассчитыватьПоПродажам() Экспорт
	
	Возврат "ПоПродажам";
	
КонецФункции

Функция РассчитыватьПоПродажамРасширение() Экспорт
	
	Возврат "ПоПродажамРасширение";
	
КонецФункции

Функция РассчитыватьПоЗаказам() Экспорт
	
	Возврат "ПоЗаказам";
	
КонецФункции

Функция МетодПрогнозаСреднедневныеПродажи() Экспорт
	
	Возврат "СреднедневныеПродажи";
	
КонецФункции

Функция СпособПополненияЗакупкаПереработка() Экспорт
	
	Возврат "ЗакупкаПереработка";
	
КонецФункции

Функция СпособПополненияЗакупка() Экспорт
	
	Возврат "Закупка";
	
КонецФункции

Функция СпособПополненияПроизводство() Экспорт
	
	Возврат "Производство";
	
КонецФункции

Функция СпособПополненияПеремещение() Экспорт
	
	Возврат "Перемещение";
	
КонецФункции

Функция СпособПополненияВсе() Экспорт
	
	Возврат "Все";
	
КонецФункции

Функция ИмяГруппировкиНоменклатура() Экспорт
	
	Возврат "Номенклатура";
	
КонецФункции

Функция ГруппировкаНоменклатураДень() Экспорт
	
	Возврат "НоменклатураДень";	
	
КонецФункции

Функция ГруппировкаДеньНоменклатура() Экспорт
	
	Возврат "ДеньНоменклатура";
	
КонецФункции

Функция ГруппировкаЗаказНоменклатура() Экспорт
	
	Возврат "ЗаказНоменклатура";	
	
КонецФункции

Функция ИмяГруппировкиЗаказ() Экспорт
	
	Возврат "Заказ";	
	
КонецФункции 

Функция ИмяГруппировкиЗаказРекомендации() Экспорт
	
	Возврат "ЗаказРекомендации";
	
КонецФункции

Функция ИмяГруппировкиПериод() Экспорт
	
	Возврат "Период";
	
КонецФункции

Функция ИмяГруппировкиНачальныйОстаток() Экспорт
	
	Возврат "НачальныйОстаток";
	
КонецФункции

Функция ИмяГруппировкиКонечныйОстаток() Экспорт
	
	Возврат "КонечныйОстаток";
	
КонецФункции

Функция ИмяГруппировкиПоступление() Экспорт
	
	Возврат "Поступление";
	
КонецФункции

Функция ИмяГруппировкиПотребность() Экспорт
	
	Возврат "Потребность";
	
КонецФункции

Функция ИмяГруппировкиМинимальныйЗапас() Экспорт
	
	Возврат "МинимальныйЗапас";
	
КонецФункции

Функция ИмяГруппировкиМаксимальныйЗапас() Экспорт
	
	Возврат "МаксимальныйЗапас";
	
КонецФункции 

Функция ИмяГруппировкиРекомендовано() Экспорт
	
	Возврат "Рекомендовано";
	
КонецФункции

Функция ИмяГруппировкиИсточник() Экспорт
	
	Возврат "Источник";
	
КонецФункции

Функция ИмяКолонкиПериод(Дата) Экспорт
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат "Просрочено";
	КонецЕсли; 
	Возврат "Период" + Формат(Дата, "ДФ=yyyyMMdd");
	
КонецФункции

#КонецОбласти

Функция ПериодПоДатеНачалаИДлительности(ДатаНачала, Знач КоличествоПериодов, Периодичность) Экспорт

	КоличествоПериодов = МАКС(КоличествоПериодов, 1);
	
	Возврат Новый СтандартныйПериод(
		НачалоДня(ДатаНачала), 
		РассчитатьДатуОкончанияПериода(КонецДня(ДатаНачала), Периодичность, КоличествоПериодов));
	
КонецФункции

Функция РассчитатьДатуОкончанияПериода(ДатаНачала, Периодичность, КоличествоПериодов) Экспорт
	
	Если ТипЗнч(Периодичность) = Тип("ПеречислениеСсылка.Периодичность") Тогда
		
		СледующийПериод = ПланированиеКлиентСервер.РассчитатьДатуОкончанияПериода(
			ДатаНачала, 
			Периодичность, 
			КоличествоПериодов);
			
	Иначе	
		СледующийПериод = Дата("39991212");
	КонецЕсли;
	
	Возврат СледующийПериод;
	
КонецФункции

Функция СтруктураНастроекРасчетаПотребностей() Экспорт
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("Группировать", "");
	СтруктураНастроек.Вставить("ДатаНачалаПланирования", "");
	СтруктураНастроек.Вставить("ДатаПоставки", Дата(1,1,1));
	СтруктураНастроек.Вставить("ДополнительныеПоляМетодаПрогноза", Неопределено);
	СтруктураНастроек.Вставить("ЕстьПравоСохраненияВариантаРасчетаПотребности", Ложь);
	СтруктураНастроек.Вставить("ЗаказыПоставщикуРазнымиДатами", Ложь);
	СтруктураНастроек.Вставить("ЗаполнитьНоменклатуруПоставщика", Ложь);
	СтруктураНастроек.Вставить("КоличествоДнейПланирования", 0);
	СтруктураНастроек.Вставить("КоличествоПериодовПродаж", 0);
	СтруктураНастроек.Вставить("МетодОбеспечения","");
	СтруктураНастроек.Вставить("МетодПрогноза", "");
	СтруктураНастроек.Вставить("МетодРасчетаСтраховогоЗапаса","");
	СтруктураНастроек.Вставить("ОтдельныеДокументыПоЗаказамПокупателя", Ложь);
	СтруктураНастроек.Вставить("ПериодичностьПланирования","");
	СтруктураНастроек.Вставить("ПериодПланирования", Новый СтандартныйПериод);
	СтруктураНастроек.Вставить("ПериодПродаж",Новый СтандартныйПериод);
	СтруктураНастроек.Вставить("ПоВсемПериодам","");
	СтруктураНастроек.Вставить("ПоЗаказам", Ложь);
	СтруктураНастроек.Вставить("ПоставкаОднойДатой", Ложь);
	СтруктураНастроек.Вставить("ПредставлениеПериодаПродаж","");
	СтруктураНастроек.Вставить("ПроизвольныйПериод", Ложь);
	СтруктураНастроек.Вставить("Рассчитывать","");
	СтруктураНастроек.Вставить("РезервироватьЗаказомНаПеремещение", Ложь);
	СтруктураНастроек.Вставить("СтраховойЗапас", 0);
	СтруктураНастроек.Вставить("ЕстьПравоСохраненияВариантаРасчетаПотребности", Ложь);
	СтруктураНастроек.Вставить("СохранитьНастройки", Ложь);
	СтруктураНастроек.Вставить("РезервированиеЗапасов", Ложь);
	СтруктураНастроек.Вставить("ОтборСпособПополнения", "");
	
	Возврат СтруктураНастроек;
КонецФункции

#КонецОбласти
