
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Задолженность = Параметры.Задолженность;
	Для Каждого Строка Из Задолженность Цикл
		НоваяСтрока = СведенияОЗадолженности.Добавить();
		НоваяСтрока.Наименование = Строка.Наименование;
		НоваяСтрока.СсылкаНаPDF = Строка.СсылкаНаPDF;
	КонецЦикла;
	
	Если ИнтерфейсПользователяБЭДКлиентСервер.ЭтоИнтерфейсВерсия8_5() Тогда
		Элементы.СведенияОЗадолженностиИнформационноеПоле.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСведенияОЗадолженности

&НаКлиенте
Процедура СведенияОЗадолженностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаНаPDF = СведенияОЗадолженности.НайтиПоИдентификатору(ВыбраннаяСтрока).СсылкаНаPDF;
	ИнтерфейсДокументовЭДОКлиент.ОткрытьPDFФайлОЗадолженности(ЭтотОбъект, СсылкаНаPDF);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	Если ИнтерфейсПользователяБЭДКлиентСервер.ЭтоИнтерфейсВерсия8_5() Тогда
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Использование = Истина;
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Имеется задолженность");
		
		ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СведенияОЗадолженностиСсылкаНаPDF");
				
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СведенияОЗадолженности.СсылкаНаPDF");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;		
	Иначе	
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Использование = Истина;
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Подробнее");
		
		ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СведенияОЗадолженностиСсылкаНаPDF");
				
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СведенияОЗадолженности.СсылкаНаPDF");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;	
	КонецЕсли;

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Имеется задолженность");
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СведенияОЗадолженностиИнформационноеПоле");
			
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СведенияОЗадолженности.ИнформационноеПоле");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	
КонецПроцедуры

#КонецОбласти
