
#Область ПрограммныйИнтерфейс

Функция GetItems(ModificationDate, GroupCode, SettingsExchangeCode = Неопределено) Экспорт
	
	Попытка
		
		Возврат ИнтеграцияСИнтернетМагазиномСервер.ПолучитьКлассификаторИКаталогВебСервис(ModificationDate, GroupCode, SettingsExchangeCode);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации("ИнтеграцияСИнтернетМагазином.SiteExchange2.GetItems",
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецФункции

Функция GetAmountAndPrices(ModificationDate, GroupCode, WarehouseCode, OrganizationCode, SettingsExchangeCode = Неопределено) Экспорт
	
	Попытка
		
		Возврат ИнтеграцияСИнтернетМагазиномСервер.ПолучитьОстаткиИЦеныВебСервис(ModificationDate, GroupCode, WarehouseCode, OrganizationCode, SettingsExchangeCode);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации("ИнтеграцияСИнтернетМагазином.SiteExchange2.GetAmountAndPrices",
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецФункции

Функция GetOrders(ModificationDate, SettingsExchangeCode = Неопределено) Экспорт
	
	Попытка
		
		Возврат ИнтеграцияСИнтернетМагазиномСервер.ПолучитьЗаказыВебСервис(ModificationDate, SettingsExchangeCode);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации("ИнтеграцияСИнтернетМагазином.SiteExchange2.GetOrders",
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецФункции

Функция LoadOrders(OrdersData, SettingsExchangeCode = Неопределено) Экспорт
	
	Попытка
		
		Возврат ИнтеграцияСИнтернетМагазиномСервер.ЗагрузитьЗаказыВебСервис(OrdersData, SettingsExchangeCode);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации("ИнтеграцияСИнтернетМагазином.SiteExchange2.LoadOrders",
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецФункции

Функция GetPicture(ItemID, SettingsExchangeCode = Неопределено) Экспорт
	
	Попытка
		
		Возврат ИнтеграцияСИнтернетМагазиномСервер.ПолучитьКартинкуВебСервис(ItemID);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации("ИнтеграцияСИнтернетМагазином.SiteExchange2.GetPicture",
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти