#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.СчитывательМагнитныхКарт = Истина;
	
	ОповещенияПриПодключении = Новый ОписаниеОповещения("ПослеПодключенияОборудования", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.СчитывательМагнитныхКарт = Истина;
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованияПоТипу(Неопределено, УникальныйИдентификатор, ПоддерживаемыеТипы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "TracksData" Тогда
			
			// Открываем совпадающие шаблоны.
			ОчиститьСообщения();
			Если ЗначениеЗаполнено(Параметр.СписокШаблонов) И Параметр.СписокШаблонов.Количество() > 0 Тогда
				
				НайденШаблон = Ложь;
				Для Каждого ТекущийШаблон Из Параметр.СписокШаблонов Цикл
					НайденШаблон = Истина;
					ОткрытьФорму("Справочник.ШаблоныМагнитныхКарт.ФормаОбъекта", Новый Структура("Ключ", ТекущийШаблон.Шаблон));
				КонецЦикла;
				
				Если Не НайденШаблон Тогда
					ОбщегоНазначенияБПОКлиент.СообщитьПользователю(
						НСтр("ru='Код не соответствует данному шаблону. Возможно, шаблон настроен неверно.'"));
				КонецЕсли;
				
			Иначе
				ОбщегоНазначенияБПОКлиент.СообщитьПользователю(
					НСтр("ru='Не удалось прочитать поля. Возможно, шаблон настроен неверно.'"));
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ВнешнееСобытие(Источник, Событие, Данные)
//	
//	Если ВводДоступен() Тогда
//		
//		ОписаниеСобытия = Новый Структура();
//		ОписаниеОшибки  = "";
//		ОписаниеСобытия.Вставить("Источник", Источник);
//		ОписаниеСобытия.Вставить("Событие",  Событие);
//		ОписаниеСобытия.Вставить("Данные",   Данные);
//		
//		РезультатОбработки = МенеджерОборудованияКлиент.ПолучитьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
//		Если РезультатОбработки = Неопределено Тогда 
//			ТекстСообщения = НСтр("ru = 'При обработке внешнего события от устройства произошла ошибка:'") + Символы.ПС + ОписаниеОшибки;
//			ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
//		Иначе
//			ОбработкаОповещения(РезультатОбработки.Событие, РезультатОбработки.Данные, "ПодключаемоеОборудование");
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеПодключенияОборудования(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
				|""%1"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемоеОборудование(Команда)
	
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

