#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Предназначена для получения статуса и сведений квитанций ДОПП.
// Параметры:
//   СсылкаНаДОПП - Ссылка.
//
// Возвращаемое значение:
//   Структура:
//     * СтатусДОПП - Строка или Неопределено,
//     * СтатусДОППТекстом - Строка или Неопределено,
//     * НомерДОПП - Строка или Неопределено,
//     * ДатаРегистрацииДокумента - Дата или Неопределено,
//     * ДанныеКартинкиQRКода - ДвоичныеДанные или Неопределено,
//     * СведенияПоследнейКвитанции - Структура или Неопределено - результат вызова
//         "ИнтерфейсыВзаимодействияБРОВызовСервера.СведенияКвитанцииОПрисвоенииСтатусаДОПП" для последней квитанции.
//
Функция СтатусИСведенияКвитанций(СсылкаНаДОПП) Экспорт
	
	Результат = Новый Структура("СтатусДОПП, СтатусДОППТекстом, НомерДОПП, ДатаРегистрацииДокумента, "
		+ "ДанныеКартинкиQRКода, СведенияПоследнейКвитанции");
	Если НЕ ЗначениеЗаполнено(СсылкаНаДОПП) Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивКвитанцийОПрисвоенииСтатусаДОПП = ИнтерфейсыВзаимодействияБРОВызовСервера.ДокументыРеализацииПолномочийНО(
		СсылкаНаДОПП);
	Результат.СтатусДОПП = ИнтерфейсыВзаимодействияБРОВызовСервера.СтатусыДОПП(,,, МассивКвитанцийОПрисвоенииСтатусаДОПП);
	Если ЗначениеЗаполнено(Результат.СтатусДОПП) Тогда
		ДвоичныеДанныеКвитанции = ИнтерфейсыВзаимодействияБРОВызовСервера.ДокументыРеализацииПолномочийНО(
			СсылкаНаДОПП,,
			".xml",
			Новый Структура("СтатусДОПП", Результат.СтатусДОПП));
		СведенияКвитанции = ?(ЗначениеЗаполнено(ДвоичныеДанныеКвитанции),
			ИнтерфейсыВзаимодействияБРОВызовСервера.СведенияКвитанцииОПрисвоенииСтатусаДОПП(ДвоичныеДанныеКвитанции),
			Неопределено);
		Результат.СведенияПоследнейКвитанции = СведенияКвитанции;
		Если ТипЗнч(СведенияКвитанции) = Тип("Структура") Тогда
			Результат.НомерДОПП = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияКвитанции.Квитанция, "НомерДОПП");
			Результат.ДатаРегистрацииДокумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияКвитанции.Квитанция,
				"ДатаРегистрацииДокумента");
		КонецЕсли;
		Результат.СтатусДОППТекстом = ИнтерфейсыВзаимодействияБРОВызовСервера.СтатусыДОПП(Результат.СтатусДОПП,, Истина);
	КонецЕсли;
	
	Статусы = ИнтерфейсыВзаимодействияБРОВызовСервера.СтатусыДОПП();
	Если НЕ ЗначениеЗаполнено(Результат.НомерДОПП) ИЛИ НЕ ЗначениеЗаполнено(Результат.ДатаРегистрацииДокумента) Тогда
		// на случай незаполненности, получение из квитанции о присвоении статуса ДОПП "Зарегистрирован"
		ДвоичныеДанныеКвитанции = ИнтерфейсыВзаимодействияБРОВызовСервера.ДокументыРеализацииПолномочийНО(
			СсылкаНаДОПП,,
			".xml",
			Новый Структура("СтатусДОПП", Статусы.Зарегистрировано));
		СведенияКвитанции = ?(ЗначениеЗаполнено(ДвоичныеДанныеКвитанции),
			ИнтерфейсыВзаимодействияБРОВызовСервера.СведенияКвитанцииОПрисвоенииСтатусаДОПП(ДвоичныеДанныеКвитанции),
			Неопределено);
		Если ТипЗнч(СведенияКвитанции) = Тип("Структура") Тогда
			Если НЕ ЗначениеЗаполнено(Результат.НомерДОПП) Тогда
				Результат.НомерДОПП = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияКвитанции.Квитанция, "НомерДОПП");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Результат.ДатаРегистрацииДокумента) Тогда
				Результат.ДатаРегистрацииДокумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияКвитанции.Квитанция,
					"ДатаРегистрацииДокумента");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Результат.ДанныеКартинкиQRКода = ИнтерфейсыВзаимодействияБРОВызовСервера.ДокументыРеализацииПолномочийНО(
		СсылкаНаДОПП,,
		".png",
		Новый Структура("СтатусДОПП", Статусы.Обеспечено));
	
	Возврат Результат;
	
КонецФункции

// Возвращает контейнер, который надо заполнять данными
//
// Параметры:
//    ИмяФормы - Строка - например, Форма2026_1
// Возвращаемое значение:
//    Структура контейнера для заполнения ДОПП
//
Функция КонтейнерДляЗаполнения(ИмяФормы) Экспорт
	Если ИмяФормы = "Форма2026_1" Тогда
		Возврат КонтейнерДляЗаполнения_2026();
	Иначе
		ВызватьИсключение "Не поддерживаемый параметр";
	КонецЕсли;
КонецФункции

// Создание нового или редактирование существующего документ о предварительной поставке
//
// Параметры:
// Данные - Структура с полями:
//   Организация - СправочникСсылка.Организации
//   РегистрацияВИФНС - СправочникСсылка.РегистрацииВНалоговомОргане
//   Контейнер - Структура - получена из КонтейнерДляЗаполнения(...) и заполнена данными
//   Ссылка - ДокументСсылка.УведомлениеОСпецрежимахНалогообложения для редактирования существующего уведомления или Неопределено для создания нового
//   ДокументОснование - ОпределяемыйТип.ОснованиеУведомления или Неопределено
//   ИмяФормы - Строка - например, Форма2026_1
//
// Возвращаемое значение:
//    ДокументСсылка.УведомлениеОСпецрежимахНалогообложения ссылка на созданный ДОПП
Функция НовыйДОПП(Данные) Экспорт 
	ИмяФормы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ИмяФормы");
	Если ИмяФормы = "Форма2026_1" Тогда
		Возврат НовыйДОПП_2026(Данные);
	Иначе
		ВызватьИсключение "Не поддерживаемый параметр";
	КонецЕсли;
КонецФункции

// Возвращает номер корректировки ДОПП
//
// Параметры:
// Ссылка - ДокументСсылка.УведомлениеОСпецрежимахНалогообложения
//
// Возвращаемое значение:
//    Число - номер корректировки
Функция НомерКорректировкиДОПП(Ссылка) Экспорт 
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.УведомлениеОСпецрежимахНалогообложения") Или Не ЗначениеЗаполнено(Ссылка) Тогда 
		ВызватьИсключение "Некорректный параметр";
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ВидУведомления,ДанныеУведомления");
	Если Реквизиты.ВидУведомления <> Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ДокументОПредстоящейПоставке Тогда 
		ВызватьИсключение "Некорректный параметр";
	КонецЕсли;
	
	Данные = Реквизиты.ДанныеУведомления.Получить();
	НомКорр = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные.ДанныеУведомления.Титульная, "НомКорр");
	Возврат ?(ТипЗнч(НомКорр) = Тип("Число"), НомКорр, 0);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуПримененияФорматов() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуПримененияФорматов();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2026_1";
	Стр.КНД = "1160303";
	Стр.ВерсияФормата = "5.01";
	
	Возврат Результат;
КонецФункции

Функция ДанноеУведомлениеДоступноДляОрганизации() Экспорт 
	Возврат Истина;
КонецФункции

Функция ДанноеУведомлениеДоступноДляИП() Экспорт 
	Возврат Истина;
КонецФункции

Функция ПолучитьОсновнуюФорму() Экспорт 
	Возврат "";
КонецФункции

Функция ПолучитьФормуПоУмолчанию() Экспорт 
	Возврат "";
КонецФункции

Функция ПолучитьТаблицуФорм() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуФормУведомления();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2026_1";
	Стр.ОписаниеФормы = "Приказ ФНС России от --.--.---- № ЕД-----/---@";
	Стр.ДатаНачала = '20210701';
	Стр.ДатаКонца = '20991231';

	Возврат Результат;
КонецФункции

Функция ЭлектронноеПредставление(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт
	Если ИмяФормы = "Форма2026_1" Тогда
		Возврат ЭлектронноеПредставление_Форма2026_1(Объект, УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

Функция СформироватьСписокЛистов(Объект) Экспорт
	Если Объект.ИмяФормы = "Форма2026_1" Тогда
		Возврат СформироватьСписокЛистов_Форма2026_1(Объект);
	КонецЕсли;
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт 
	Если ИмяФормы = "Форма2026_1"  Тогда 
		Возврат ПроверитьДокументСВыводомВТаблицу_Форма2026_1(
			УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект), УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

Процедура ПроверкаТовар_Форма2026_1(ТаблицаОшибок, Товар, ИмяСтраницы, Данные)
	Если Не СтрПодобнаПоРегулярномуВыражению("" + Товар.ТНВЭД, "[0-9]{10}") Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан / неправильно указан ТНВЭД", ИмяСтраницы, "ТНВЭД", Товар.УИД));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Товар.НаимТов) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указано наименование товара", ИмяСтраницы, "НаимТов", Товар.УИД));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Товар.ПрПТ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан признак подакцизности товара", ИмяСтраницы, "ПрПТ", Товар.УИД));
	КонецЕсли;
	Если Товар.ПрПТ = "0" И ЗначениеЗаполнено(Товар.КодПТ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Код подакцизного товара не указывается", ИмяСтраницы, "КодПТ", Товар.УИД));
	ИначеЕсли Товар.ПрПТ = "1" И Не ЗначениеЗаполнено(Товар.КодПТ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Необходимо указать код подакцизного товара", ИмяСтраницы, "КодПТ", Товар.УИД));
	КонецЕсли;
	Если Не СтрПодобнаПоРегулярномуВыражению("" + Товар.ОКЕИ, "[0-9]{3}") Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан / неправильно указан код ОКЕИ", ИмяСтраницы, "ОКЕИ", Товар.УИД));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Товар.КолТов) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указано количество товара", ИмяСтраницы, "КолТов", Товар.УИД));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Товар.СтоимТов) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана стоимость товара", ИмяСтраницы, "СтоимТов", Товар.УИД));
	КонецЕсли;
	Если Не СтрПодобнаПоРегулярномуВыражению("" + Товар.ОКСМПроисх, "[0-9]{3}") Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан / неправильно указан код страны", ИмяСтраницы, "ОКСМПроисх", Товар.УИД));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Товар.СтрПроисх) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана страна происхождения", ИмяСтраницы, "СтрПроисх", Товар.УИД));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Товар.ОсобПризн) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан особый признак", ИмяСтраницы, "ОсобПризн", Товар.УИД));
	КонецЕсли;
	
	СтавкиАкцизаЗаполнены = УведомлениеОСпецрежимахНалогообложения.БлокЗаполнен(Товар, "АкцТвСт,АкцАдвСт");
	Если Товар.ПрПТ = "0" И СтавкиАкцизаЗаполнены Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Ставки акцизов не заполняются", ИмяСтраницы, ?(ЗначениеЗаполнено(Товар.АкцТвСт), "АкцТвСт", "АкцАдвСт"), Товар.УИД));
	КонецЕсли;
	Если Товар.ПрПТ = "1" И Не СтавкиАкцизаЗаполнены Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не заполнены ставки акцизов", ИмяСтраницы, "АкцТвСт", Товар.УИД));
	КонецЕсли;
	Если ЗначениеЗаполнено(Товар.АкцТвСт) И Не ЗначениеЗаполнено(Товар.АкцизТвБаза) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана налоговая база акциза", ИмяСтраницы, "АкцизТвБаза", Товар.УИД));
	ИначеЕсли Не ЗначениеЗаполнено(Товар.АкцТвСт) И ЗначениеЗаполнено(Товар.АкцизТвБаза) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Налоговая база акциза не указывается", ИмяСтраницы, "АкцизТвБаза", Товар.УИД));
	КонецЕсли;
	Если ЗначениеЗаполнено(Товар.АкцАдвСт) И Не ЗначениеЗаполнено(Товар.АкцизАдвБаза) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана налоговая база акциза", ИмяСтраницы, "АкцизАдвБаза", Товар.УИД));
	ИначеЕсли Не ЗначениеЗаполнено(Товар.АкцАдвСт) И ЗначениеЗаполнено(Товар.АкцизАдвБаза) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Налоговая база акциза не указывается", ИмяСтраницы, "АкцизАдвБаза", Товар.УИД));
	КонецЕсли;
	Если ЗначениеЗаполнено(Товар.АкцТвСт) И Не ЗначениеЗаполнено(Товар.СумАкцизТв) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана сумма акциза", ИмяСтраницы, "СумАкцизТв", Товар.УИД));
	ИначеЕсли Не ЗначениеЗаполнено(Товар.АкцТвСт) И ЗначениеЗаполнено(Товар.СумАкцизТв) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Сумма акциза не указывается", ИмяСтраницы, "СумАкцизТв", Товар.УИД));
	КонецЕсли;
	Если ЗначениеЗаполнено(Товар.АкцАдвСт) И Не ЗначениеЗаполнено(Товар.СумАкцизАдв) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана сумма акциза", ИмяСтраницы, "СумАкцизАдв", Товар.УИД));
	ИначеЕсли Не ЗначениеЗаполнено(Товар.АкцАдвСт) И ЗначениеЗаполнено(Товар.СумАкцизАдв) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Сумма акциза не указывается", ИмяСтраницы, "СумАкцизАдв", Товар.УИД));
	КонецЕсли;
	
	Если Товар.ОсобПризн = "0" Тогда
		Если Не ЗначениеЗаполнено(Товар.НДССт) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана ставка НДС", ИмяСтраницы, "НДССт", Товар.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Товар.НДСБаза) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана база НДС", ИмяСтраницы, "НДСБаза", Товар.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Товар.СумНДС) И Товар.НДССт <> "0" Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана сумма НДС", ИмяСтраницы, "СумНДС", Товар.УИД));
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Товар.НДССт) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Ставка НДС не указывается", ИмяСтраницы, "НДССт", Товар.УИД));
		КонецЕсли;
		Если ЗначениеЗаполнено(Товар.НДСБаза) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"База НДС не указывается", ИмяСтраницы, "НДСБаза", Товар.УИД));
		КонецЕсли;
		Если ЗначениеЗаполнено(Товар.СумНДС) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Сумма НДС не указывается", ИмяСтраницы, "СумНДС", Товар.УИД));
		КонецЕсли;
	КонецЕсли;
	
	Инд = 0;
	Для Каждого Стр Из Данные.ДанныеДопСтрокБД.МнгСтр1.НайтиСтроки(Новый Структура("УИД", Товар.УИД)) Цикл 
		Инд = Инд + 1;
		Если Не УведомлениеОСпецрежимахНалогообложенияСлужебный.СтрокаТаблицыЗначенийЗаполнена(Стр) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.НаимДок) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано наименование документа", ИмяСтраницы, "НаимДок___" + Инд, Товар.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Стр.НомерДок) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан номер документа", ИмяСтраницы, "НомерДок___" + Инд, Товар.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Стр.ДатаДок) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана дата документа", ИмяСтраницы, "ДатаДок___" + Инд, Товар.УИД));
		ИначеЕсли НачалоДня(Стр.ДатаДок) < НачалоДня(ТекущаяДатаСеанса()) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Дата документа должна быть не меньше текущей", ИмяСтраницы, "ДатаДок___" + Инд, Товар.УИД));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПроверитьДокументСВыводомВТаблицу_Форма2026_1(Данные, УникальныйИдентификатор)
	ТаблицаОшибок = Новый СписокЗначений;
	УведомлениеОСпецрежимахНалогообложения.ПроверкаАктуальностиФормыПриВыгрузке(
		Данные.Объект.ИмяФормы, ТаблицаОшибок, ПолучитьТаблицуФорм());
	УведомлениеОСпецрежимахНалогообложения.ПроверкаДатВУведомлении(Данные, ТаблицаОшибок);
	УведомлениеОСпецрежимахНалогообложения.ПолнаяПроверкаЗаполненныхПоказателейНаСоотвествиеСписку(
		"СпискиВыбора2026_1", "СхемаВыгрузкиФорма2026_1",
		Данные.Объект.ИмяОтчета, ТаблицаОшибок, Данные);
	
	ЭтоЮЛ = РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Данные.Организация);
	Титульная = Данные.ДанныеУведомления.Титульная;
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаКодаНО(Титульная.КодНО, ТаблицаОшибок, "Титульная");
	Если Не ЗначениеЗаполнено(Титульная.ДАТА_ПОДПИСИ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана дата подписи", "Титульная", "ДАТА_ПОДПИСИ"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.ОсПрЗаяв) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан особый признак заявителя", "Титульная", "ОсПрЗаяв"));
	КонецЕсли;
	Если Титульная.ОсПрЗаяв = "2" И Не ЗначениеЗаполнено(Титульная.ИнОсПрЗаяв) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Необходимо указать иной особый признак", "Титульная", "ИнОсПрЗаяв"));
	КонецЕсли;
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаИННКПП(ЭтоЮЛ, Титульная, ТаблицаОшибок);
	Если ЭтоЮЛ Тогда 
		Если Не ЗначениеЗаполнено(Титульная.НаимОрг) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано наименование организации", "Титульная", "НаимОрг"));
		КонецЕсли;
	Иначе 
		Если Не ЗначениеЗаполнено(Титульная.Фамилия) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана фамилия", "Титульная", "Фамилия"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Титульная.Имя) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано имя", "Титульная", "Имя"));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Титульная.ПРИЗНАК_НП_ПОДВАЛ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан признак подписанта", "Титульная", "ПРИЗНАК_НП_ПОДВАЛ"));
	КонецЕсли;
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаПодписантаНалоговойОтчетности(
		Данные, ТаблицаОшибок, "Титульная", ЭтоЮЛ Или Титульная.ПРИЗНАК_НП_ПОДВАЛ = "2");
	Если Титульная.ПРИЗНАК_НП_ПОДВАЛ = "2" И Не ЗначениеЗаполнено(Титульная.НаимДок) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан документ представителя", "Титульная", "НаимДок"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Титульная.НомКорр) Тогда 
		Если Не СтрПодобнаПоРегулярномуВыражению("" + Титульная.НомерДОПП,
				"(0[1-9]{1}|1[0-9]{1}|2[0-9]{1}|3[0-1])(0[1-9]|1[0-2])([0-9]{2})([0-9]{7})") Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан / неправильно указан номер корректируемого документа", "Титульная", "НомерДОПП"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Титульная.ДатаРегистр) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана дата регистрации корректируемого документа", "Титульная", "ДатаРегистр"));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Титульная.НаимПрод) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указано наименование продавца", "Титульная", "НаимПрод"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.РегНомПрод) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан регистрационный номер продавца", "Титульная", "РегНомПрод"));
	КонецЕсли;
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаОКСМ(Титульная, ТаблицаОшибок, "Титульная", "ОКСМПрод", Истина);
	Если Не ЗначениеЗаполнено(Титульная.АдресПрод) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан адрес продавца", "Титульная", "АдресПрод"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Титульная.НаимПерев) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указано наименование перевозчика", "Титульная", "НаимПерев"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.РегНомПерев) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан регистрационный номер перевозчика", "Титульная", "РегНомПерев"));
	КонецЕсли;
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаОКСМ(Титульная, ТаблицаОшибок, "Титульная", "ОКСМПерев", Истина);
	Если Не ЗначениеЗаполнено(Титульная.ДатаВвоз) Или (НачалоДня(ТекущаяДатаСеанса()) > НачалоДня(Титульная.ДатаВвоз)) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Дата ввоза должны быть заполнена и не меньше текущей даты", "Титульная", "ДатаВвоз"));
	КонецЕсли;
	
	Если Титульная.ВидТС = "1" Тогда
		Если Не ЗначениеЗаполнено(Титульная.РегЗнакТС) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан регистрационный знак (номер)", "Титульная", "РегЗнакТС"));
		КонецЕсли;
		Если ЗначениеЗаполнено(Титульная.НомерПрицеп1) И (СокрЛП(Титульная.НомерПрицеп1) = СокрЛП(Титульная.НомерПрицеп2)) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Номер прицепа должен быть уникальным", "Титульная", "НомерПрицеп2"));
		КонецЕсли;
	ИначеЕсли Титульная.ВидТС = "2" Тогда
		Если Не ЗначениеЗаполнено(Титульная.НомерНаклАвиа) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан номер грузовой авианакладной", "Титульная", "НомерНаклАвиа"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Титульная.ДатаНаклАвиа) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана дата грузовой авианакладной", "Титульная", "ДатаНаклАвиа"));
		КонецЕсли;
	ИначеЕсли Титульная.ВидТС = "3" Тогда
		Если Не ЗначениеЗаполнено(Титульная.НомерНаклЖД) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан номер железнодорожной накладной", "Титульная", "НомерНаклЖД"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Титульная.ДатаНаклЖД) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана дата железнодорожной накладной", "Титульная", "ДатаНаклЖД"));
		КонецЕсли;
	ИначеЕсли Титульная.ВидТС = "4" Тогда
		Если Не ЗначениеЗаполнено(Титульная.НомерКон) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан номер коносамента", "Титульная", "НомерКон"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Титульная.ДатаКон) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана дата коносамента", "Титульная", "ДатаКон"));
		КонецЕсли;
	Иначе
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан / неправильно указан вид транспорта", "Титульная", "ВидТС"));
	КонецЕсли;
	
	Если (Титульная.ВидТС = "2" Или Титульная.ВидТС = "3" Или Титульная.ВидТС = "4")
		И ТекущаяДатаСеанса() < НачалоДня('20270101') Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Документ для Авиа/ЖД/морского транспорта оформляется с 01.01.2027", "Титульная", "ВидТС"));
	КонецЕсли;
	
	ВсеДоговоры = Новый Соответствие;
	Для Каждого Элт1 Из Данные.ДанныеМногостраничныхРазделов.Договор Цикл 
		Договор = Элт1.Значение;
		
		Если Не ЗначениеЗаполнено(Договор.НомерДог) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан номер договора", "Договор", "НомерДог", Договор.УИД));
		ИначеЕсли ВсеДоговоры[СокрЛП(Договор.НомерДог)] = Истина Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Номер договора должен быть уникальным", "Договор", "НомерДог", Договор.УИД));
		КонецЕсли;
		ВсеДоговоры.Вставить(СокрЛП(Договор.НомерДог), Истина);
		Если Не ЗначениеЗаполнено(Договор.ДатаДог) Или НачалоДня(Договор.ДатаДог) > ТекущаяДатаСеанса() Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана / неправильно указана дата договора", "Договор", "ДатаДог", Договор.УИД));
		КонецЕсли;
		Если Не СтрПодобнаПоРегулярномуВыражению("" + Договор.КодВалют, "[0-9]{3}") Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан / неправильно указан код валюты", "Договор", "КодВалют", Договор.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Договор.КурсВалют) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан курс валюты", "Договор", "КурсВалют", Договор.УИД));
		ИначеЕсли Договор.КодВалют = "643" И Договор.КурсВалют <> 1 Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Для кода валюты 643 (рубль) курс должен быть равен 1", "Договор", "КурсВалют", Договор.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Договор.БазаВалют) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана база валюты", "Договор", "БазаВалют", Договор.УИД));
		ИначеЕсли Договор.КодВалют = "643" И Договор.БазаВалют <> 1 Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Для кода валюты 643 (рубль) база должна быть равеной 1", "Договор", "БазаВалют", Договор.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Договор.ДатаКурсВалют) Или НачалоДня(Договор.ДатаКурсВалют) >= НачалоДня(ТекущаяДатаСеанса()) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана / неправильно указана дата курса валют", "Договор", "ДатаКурсВалют", Договор.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Договор.ПрСпецТов) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан признак содержимого договора", "Договор", "ПрСпецТов", Договор.УИД));
		КонецЕсли;
		
		Если Договор.ПрСпецТов = "1" Тогда
			ВсеСпецификации = Новый Соответствие;
			Для Каждого Элт2 Из Данные.ДанныеМногостраничныхРазделов.Спецификация Цикл 
				Спецификация = Элт2.Значение;
				Если Спецификация.УИДРодителя <> Договор.УИД Тогда 
					Продолжить;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Спецификация.НомерСп) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указан номер спецификации", "Спецификация", "НомерСп", Спецификация.УИД));
				ИначеЕсли ВсеСпецификации[СокрЛП(Спецификация.НомерСп)] = Истина Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Номер спецификации должен быть уникальным", "Спецификация", "НомерСп", Спецификация.УИД));
				КонецЕсли;
				ВсеСпецификации.Вставить(СокрЛП(Спецификация.НомерСп), Истина);
				Если Не ЗначениеЗаполнено(Спецификация.ДатаСп) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указана дата спецификации", "Спецификация", "ДатаСп", Спецификация.УИД));
				ИначеЕсли НачалоДня(Спецификация.ДатаСп) < НачалоДня(Договор.ДатаДог) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Дата спецификации должна быть больше даты договора", "Спецификация", "ДатаСп", Спецификация.УИД));
				КонецЕсли;
				Для Каждого Элт3 Из Данные.ДанныеМногостраничныхРазделов.ТоварСпецификация Цикл 
					Товар = Элт3.Значение;
					Если Товар.УИДРодителя = Спецификация.УИД Тогда 
						ПроверкаТовар_Форма2026_1(ТаблицаОшибок, Товар, "ТоварСпецификация", Данные);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		ИначеЕсли Договор.ПрСпецТов = "2" Тогда 
			Для Каждого Элт2 Из Данные.ДанныеМногостраничныхРазделов.ТоварДоговор Цикл 
				Товар = Элт2.Значение;
				Если Товар.УИДРодителя = Договор.УИД Тогда 
					ПроверкаТовар_Форма2026_1(ТаблицаОшибок, Товар, "ТоварДоговор", Данные);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаОшибок;
КонецФункции

Функция ИдентификаторФайлаЭлектронногоПредставления(СведенияОтправки)
	Префикс = "NO_SPOTDOPP";
	Возврат Документы.УведомлениеОСпецрежимахНалогообложения.ИдентификаторФайлаЭлектронногоПредставления(Префикс, СведенияОтправки);
КонецФункции

Функция ОсновныеСведенияЭлектронногоПредставления(Объект, Данные)
	ОсновныеСведения = Документы.УведомлениеОСпецрежимахНалогообложения.НачальнаяИнициализацияОбщихРеквизитовВыгрузки(Объект);
	ИдентификаторФайла = ИдентификаторФайлаЭлектронногоПредставления(ОсновныеСведения);
	ОсновныеСведения.Вставить("ИдФайл", ИдентификаторФайла);
	ОсновныеСведения.Вставить("ВидТС", Данные.ДанныеУведомления.Титульная["ВидТС"]);
	ОсновныеСведения.Вставить("ОКСМПрод", Данные.ДанныеУведомления.Титульная["ОКСМПрод"]);
	ОсновныеСведения.Вставить("НомКорр", Данные.ДанныеУведомления.Титульная["НомКорр"]);
	
	СодерживоеДоговора = Новый Соответствие;
	Для Каждого Элт Из Данные.ДанныеМногостраничныхРазделов.Договор Цикл 
		СодерживоеДоговора.Вставить(Элт.Значение.УИД, Элт.Значение.ПрСпецТов);
	КонецЦикла;
	Для Каждого Элт Из Данные.ДанныеМногостраничныхРазделов.Спецификация Цикл 
		Элт.Значение.УИДРодителя = ?(СодерживоеДоговора[Элт.Значение.УИДРодителя] = "1", Элт.Значение.УИДРодителя, Неопределено);
	КонецЦикла;
	Для Каждого Элт Из Данные.ДанныеМногостраничныхРазделов.ТоварДоговор Цикл 
		Элт.Значение.УИДРодителя = ?(СодерживоеДоговора[Элт.Значение.УИДРодителя] = "2", Элт.Значение.УИДРодителя, Неопределено);
	КонецЦикла;
	
	НумерацияТоваров = Новый Соответствие;
	Для Каждого Стр Из СтрРазделить("ТоварДоговор,ТоварСпецификация", ",") Цикл 
		Для Каждого Элт Из Данные.ДанныеМногостраничныхРазделов[Стр] Цикл 
			НумерацияТоваров.Вставить(Элт.Значение.УИДРодителя, 0);
		КонецЦикла;
		Для Каждого Элт Из Данные.ДанныеМногостраничныхРазделов[Стр] Цикл 
			НумерацияТоваров[Элт.Значение.УИДРодителя] = НумерацияТоваров[Элт.Значение.УИДРодителя] + 1;
			Элт.Значение.Вставить("НомерТов", НумерацияТоваров[Элт.Значение.УИДРодителя]);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ОсновныеСведения;
КонецФункции

Процедура ОбработкаДанныхУведомленияПередВыгрузкой(ДанныеУведомления)
	ОТЧ = Новый ОписаниеТипов("Число");
	Для Каждого Элт Из СтрРазделить("ТоварДоговор,ТоварСпецификация", ",") Цикл 
		Для Каждого Стр Из ДанныеУведомления.ДанныеМногостраничныхРазделов[Элт] Цикл 
			Стр.Значение.СумНДС = ?(СокрЛП(Стр.Значение.НДССт) = "0", 
				"0", Формат(Окр(ОТЧ.ПривестиЗначение(Стр.Значение.СумНДС), 2), "ЧРД=.; ЧГ="));
		КонецЦикла;
	КонецЦикла;
	
	ДанныеУведомления.ДанныеДопСтрокБД.Вставить("МнгСтр", Новый ТаблицаЗначений);
	ДанныеУведомления.ДанныеДопСтрокБД.МнгСтр.Колонки.Добавить("УИД");
	ДанныеУведомления.ДанныеДопСтрокБД.МнгСтр.Колонки.Добавить("НомерПрицеп");
	
	НовСтр = ДанныеУведомления.ДанныеДопСтрокБД["МнгСтр"].Добавить();
	НовСтр.НомерПрицеп = ДанныеУведомления.ДанныеУведомления.Титульная["НомерПрицеп1"];
	НовСтр = ДанныеУведомления.ДанныеДопСтрокБД["МнгСтр"].Добавить();
	НовСтр.НомерПрицеп = ДанныеУведомления.ДанныеУведомления.Титульная["НомерПрицеп2"];
КонецПроцедуры

Функция ЭлектронноеПредставление_Форма2026_1(Объект, УникальныйИдентификатор) 
	СведенияЭлектронногоПредставления = УведомлениеОСпецрежимахНалогообложения.СведенияЭлектронногоПредставления();
	ДанныеУведомления = УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект);
	Ошибки = ПроверитьДокументСВыводомВТаблицу_Форма2026_1(ДанныеУведомления, УникальныйИдентификатор);
	УведомлениеОСпецрежимахНалогообложения.СообщитьОшибкиПриПроверкеВыгрузки(Объект, Ошибки, ДанныеУведомления);
	
	ОбработкаДанныхУведомленияПередВыгрузкой(ДанныеУведомления);
	ОсновныеСведения = ОсновныеСведенияЭлектронногоПредставления(Объект, ДанныеУведомления);
	СтруктураВыгрузки = Документы.УведомлениеОСпецрежимахНалогообложения.ИзвлечьСтруктуруXMLУведомления(Объект.ИмяОтчета, "СхемаВыгрузкиФорма2026_1");
	УведомлениеОСпецрежимахНалогообложения.ТиповоеЗаполнениеДанными(ДанныеУведомления, ОсновныеСведения, СтруктураВыгрузки);
	УведомлениеОСпецрежимахНалогообложения.ВыгрузитьДеревоВТаблицу(СтруктураВыгрузки, ОсновныеСведения, СведенияЭлектронногоПредставления);
	Возврат СведенияЭлектронногоПредставления;
КонецФункции

Функция СформироватьСписокЛистов_Форма2026_1(Объект) Экспорт
	СтатусИСведенияКвитанций = СтатусИСведенияКвитанций(Объект.Ссылка);
	Если ТипЗнч(СтатусИСведенияКвитанций.ДанныеКартинкиQRКода) = Тип("ДвоичныеДанные") Тогда
		КартинкаQRКода = Новый Картинка(СтатусИСведенияКвитанций.ДанныеКартинкиQRКода);
	КонецЕсли;
	
	Листы = Новый СписокЗначений;
	МакетУведомления = Отчеты[Объект.ИмяОтчета].ПолучитьМакет("Печать_Форма2026_1");
	Данные = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ДанныеУведомления").Получить();
	
	ЭтоЮЛ = РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация);
	Титульная = Данные.ДанныеУведомления["Титульная"];
	
	ПечатнаяФорма = УведомлениеОСпецрежимахНалогообложения.НовыйПустойЛист();
	ОбластьШапка = МакетУведомления.ПолучитьОбласть("Титульный");
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Титульная);
	ОбластьШапка.Параметры.НаименованиеЗаявителя = ?(ЭтоЮЛ, Титульная.НаимОрг
		,СокрЛП(Титульная.Фамилия + " " + Титульная.Имя + " " + Титульная.Отчество));
	ОбластьШапка.Параметры.НомерПрицеп = Титульная.НомерПрицеп1 
		+ ?(ЗначениеЗаполнено(Титульная.НомерПрицеп1), ", " + Титульная.НомерПрицеп2, "");
	
	ОбластьШапка.Параметры.НомерДОПП = СтатусИСведенияКвитанций.НомерДОПП;
	ОбластьШапка.Параметры.ДатаРегистр = СтатусИСведенияКвитанций.ДатаРегистрацииДокумента;
	ОбластьШапка.Параметры.СтатусДОПП = СтатусИСведенияКвитанций.СтатусДОППТекстом;
	
	ПечатнаяФорма.Вывести(ОбластьШапка);
	Если ТипЗнч(КартинкаQRКода) = Тип("Картинка") Тогда 
		Рисунок = ПечатнаяФорма.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
		Рисунок.Картинка = КартинкаQRКода;
		Рисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии, 0);
		Рисунок.РазмерКартинки = РазмерКартинки.Пропорционально;
		Рисунок.Расположить(ПечатнаяФорма.Области.Найти("QR"));
	КонецЕсли;
	УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, Листы.Количество() + 1, Ложь);
	
	Для Каждого Элт1 Из Данные.ДанныеМногостраничныхРазделов.Договор Цикл 
		Таблица1 = Новый Массив;
		Таблица2 = Новый Массив;
		
		Договор = Элт1.Значение;
		ПечатнаяФорма = УведомлениеОСпецрежимахНалогообложения.НовыйПустойЛист();
		ПечатнаяФорма.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
		ЗаголовокДоговор = МакетУведомления.ПолучитьОбласть("ЗаголовокДоговор");
		ЗаполнитьЗначенияСвойств(ЗаголовокДоговор.Параметры, Договор);
		НомПП = 0;
		Если Договор.ПрСпецТов = "2" Тогда 
			Для Каждого Элт2 Из Данные.ДанныеМногостраничныхРазделов["ТоварДоговор"] Цикл 
				Товар = Элт2.Значение;
				Если Товар.УИДРодителя <> Договор.УИД Тогда 
					Продолжить;
				КонецЕсли;
				НомПП = НомПП + 1;
				Строка = МакетУведомления.ПолучитьОбласть("СтрокаТовары");
				ЗаполнитьЗначенияСвойств(Строка.Параметры, Товар);
				Строка.Параметры.НомПП = НомПП;
				Таблица1.Добавить(Строка);
				Строка = МакетУведомления.ПолучитьОбласть("СтрокаНалоги");
				ЗаполнитьЗначенияСвойств(Строка.Параметры, Товар);
				Строка.Параметры.НомПП = НомПП;
				Таблица2.Добавить(Строка);
			КонецЦикла;
		ИначеЕсли Договор.ПрСпецТов = "1" Тогда 
			Для Каждого Спец Из Данные.ДанныеМногостраничныхРазделов["Спецификация"] Цикл 
				Если Спец.Значение.УИДРодителя <> Договор.УИД Тогда 
					Продолжить;
				КонецЕсли;
				Для Каждого Элт2 Из Данные.ДанныеМногостраничныхРазделов["ТоварСпецификация"] Цикл 
					Товар = Элт2.Значение;
					Если Товар.УИДРодителя <> Спец.Значение.УИД Тогда 
						Продолжить;
					КонецЕсли;
					НомПП = НомПП + 1;
					Строка = МакетУведомления.ПолучитьОбласть("СтрокаТовары");
					ЗаполнитьЗначенияСвойств(Строка.Параметры, Товар);
					Строка.Параметры.НомПП = НомПП;
					Таблица1.Добавить(Строка);
					Строка = МакетУведомления.ПолучитьОбласть("СтрокаНалоги");
					ЗаполнитьЗначенияСвойств(Строка.Параметры, Товар);
					Строка.Параметры.НомПП = НомПП;
					Таблица2.Добавить(Строка);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		ПечатнаяФорма.Вывести(ЗаголовокДоговор);
		ПечатнаяФорма.Вывести(МакетУведомления.ПолучитьОбласть("ШапкаТовары"));
		Для Каждого Элт Из Таблица1 Цикл 
			ПечатнаяФорма.Вывести(Элт);
		КонецЦикла;
		
		ПечатнаяФорма.Вывести(МакетУведомления.ПолучитьОбласть("ШапкаНалоги"));
		Для Каждого Элт Из Таблица2 Цикл 
			ПечатнаяФорма.Вывести(Элт);
		КонецЦикла;
		УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, Листы.Количество() + 1, Ложь);
	КонецЦикла;
	
	Возврат Листы;
КонецФункции

#Область СозданиеДОПП

Функция КонтейнерДляЗаполнения_2026()
	Контейнер = Новый Структура;
	
	Контейнер.Вставить("Титульная", Новый Структура);
	Контейнер.Вставить("Договор", Новый ТаблицаЗначений);
	Контейнер.Вставить("ТоварДоговор", Новый ТаблицаЗначений);
	Контейнер.Вставить("Спецификация", Новый ТаблицаЗначений);
	Контейнер.Вставить("ТоварСпецификация", Новый ТаблицаЗначений);
	Контейнер.Вставить("МнгСтр1", Новый ТаблицаЗначений);
	
	Макет = Отчеты["РегламентированноеУведомлениеДокументОПредстоящейПоставке"].ПолучитьМакет("Титульная_2026").ПолучитьОбласть("ОсновнаяЧасть");
	Для Каждого Обл Из Макет.Области Цикл 
		Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
			И Обл.СодержитЗначение = Истина Тогда 
			Контейнер["Титульная"].Вставить(Обл.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Макет = Отчеты["РегламентированноеУведомлениеДокументОПредстоящейПоставке"].ПолучитьМакет("Договор_2026").ПолучитьОбласть("ОсновнаяЧасть");
	Контейнер["Договор"].Колонки.Добавить("УИД");
	Контейнер["Договор"].Колонки.Добавить("УИДРодителя");
	Для Каждого Обл Из Макет.Области Цикл 
		Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
			И Обл.СодержитЗначение = Истина Тогда 
			Контейнер["Договор"].Колонки.Добавить(Обл.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Макет = Отчеты["РегламентированноеУведомлениеДокументОПредстоящейПоставке"].ПолучитьМакет("Спецификация_2026").ПолучитьОбласть("ОсновнаяЧасть");
	Контейнер["Спецификация"].Колонки.Добавить("УИД");
	Контейнер["Спецификация"].Колонки.Добавить("УИДРодителя");
	Для Каждого Обл Из Макет.Области Цикл 
		Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
			И Обл.СодержитЗначение = Истина Тогда 
			Контейнер["Спецификация"].Колонки.Добавить(Обл.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Макет = Отчеты["РегламентированноеУведомлениеДокументОПредстоящейПоставке"].ПолучитьМакет("Товар_2026").ПолучитьОбласть("ОсновнаяЧасть");
	Контейнер["ТоварДоговор"].Колонки.Добавить("УИД");
	Контейнер["ТоварДоговор"].Колонки.Добавить("УИДРодителя");
	Контейнер["ТоварСпецификация"].Колонки.Добавить("УИД");
	Контейнер["ТоварСпецификация"].Колонки.Добавить("УИДРодителя");
	Для Каждого Обл Из Макет.Области Цикл 
		Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
			И Обл.СодержитЗначение = Истина Тогда 
			Контейнер["ТоварДоговор"].Колонки.Добавить(Обл.Имя);
			Контейнер["ТоварСпецификация"].Колонки.Добавить(Обл.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Макет = Отчеты["РегламентированноеУведомлениеДокументОПредстоящейПоставке"].ПолучитьМакет("Товар_2026").ПолучитьОбласть("Str_МнгСтр1");
	Контейнер["МнгСтр1"].Колонки.Добавить("УИД");
	Для Каждого Обл Из Макет.Области Цикл 
		Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
			И Обл.СодержитЗначение = Истина Тогда 
			Контейнер["МнгСтр1"].Колонки.Добавить(Обл.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Контейнер;
КонецФункции

Функция НовыйДОПП_2026(Параметры)
	Ссылка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Ссылка");
	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Организация");
	РегистрацияВИФНС = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "РегистрацияВИФНС");
	Контейнер = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Контейнер");
	
	ДокументОбъект = ?(ЗначениеЗаполнено(Ссылка), 
		Ссылка.ПолучитьОбъект(),
		Документы.УведомлениеОСпецрежимахНалогообложения.СоздатьДокумент());
		
	ДокументОбъект.Организация = Организация;
	ДокументОбъект.РегистрацияВИФНС = РегистрацияВИФНС;
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.ДатаПодписи = ТекущаяДатаСеанса();
	ДокументОбъект.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ДокументОПредстоящейПоставке;
	ДокументОбъект.Основание = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДокументОснование");
	ДокументОбъект.ИмяОтчета = "РегламентированноеУведомлениеДокументОПредстоящейПоставке";
	ДокументОбъект.ИмяФормы = "Форма2026_1";
	
	УИДТитульная = Новый УникальныйИдентификатор;
	ДеревоСтраниц = УведомлениеОСпецрежимахНалогообложения.ПустоеДеревоСтраницУведомления();
	
	Стр001 = ДеревоСтраниц.Строки.Добавить();
	Стр001.Наименование = "Основные данные";
	Стр001.ИндексКартинки = 1;
	Стр001.ИмяМакета = "Титульная_2026";
	Стр001.Многостраничность = Ложь;
	Стр001.Многострочность = Ложь;
	Стр001.УИД = Новый УникальныйИдентификатор;
	Стр001.ИДНаименования = "Титульная";
	
	Титульная = Контейнер["Титульная"];
	Титульная.Вставить("КодНО", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистрацияВИФНС, "Код"));
	Реквизиты = РегистрацияВНОСервер.ДанныеРегистрации(РегистрацияВИФНС);
	Титульная.Вставить("КодНО", Реквизиты.Код);
	Титульная.Вставить("КПП", Реквизиты.КПП);
	Титульная.Вставить("ДАТА_ПОДПИСИ", ДокументОбъект.ДатаПодписи);
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация) Тогда
		СтрокаСведений = "ИННЮЛ,НаимЮЛПол,КППЮЛ";
		СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
			Организация, ДокументОбъект.ДатаПодписи, СтрокаСведений);
		Титульная.Вставить("ИНН", СведенияОбОрганизации.ИННЮЛ);
		Титульная.Вставить("КПП", СведенияОбОрганизации.КППЮЛ);
		Титульная.Вставить("НаимОрг", СведенияОбОрганизации.НаимЮЛПол);
	Иначе
		СтрокаСведений = "ИННФЛ,ФамилияИП,ИмяИП,ОтчествоИП";
		СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
			Организация, ДокументОбъект.ДатаПодписи, СтрокаСведений);
		Титульная.Вставить("ИНН", СведенияОбОрганизации.ИННФЛ);
		Титульная.Вставить("Фамилия", СведенияОбОрганизации.ФамилияИП);
		Титульная.Вставить("Имя", СведенияОбОрганизации.ИмяИП);
		Титульная.Вставить("Отчество", СведенияОбОрганизации.ОтчествоИП);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Реквизиты.Представитель) Тогда
		СведенияОПредставителе = РегламентированнаяОтчетностьВызовСервера.ПолучитьПоКодамСведенияОПредставителе(
			Организация, Реквизиты.Код, Реквизиты.КПП);
			
		Если ЗначениеЗаполнено(СведенияОПредставителе.НаименованиеОрганизацииПредставителя) Тогда 
			ПодписантСтр = СведенияОПредставителе.ФИОПредставителя;
			ФИО = РегламентированнаяОтчетность.РазложитьФИО(СведенияОПредставителе.ФИОПредставителя);
			ДокументОбъект.ПодписантФамилия = СокрЛП(ФИО.Фамилия);
			ДокументОбъект.ПодписантИмя = СокрЛП(ФИО.Имя);
			ДокументОбъект.ПодписантОтчество = СокрЛП(ФИО.Отчество);
		Иначе
			ДанныеПредставителя = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОФизЛице(
				Реквизиты.Представитель, , ДокументОбъект.ДатаПодписи);
			ДокументОбъект.ПодписантФамилия = СокрЛП(ДанныеПредставителя.Фамилия);
			ДокументОбъект.ПодписантИмя = СокрЛП(ДанныеПредставителя.Имя);
			ДокументОбъект.ПодписантОтчество = СокрЛП(ДанныеПредставителя.Отчество);
			ПодписантСтр = СокрЛП(ДокументОбъект.ПодписантФамилия + " " + ДокументОбъект.ПодписантИмя + " " + ДокументОбъект.ПодписантОтчество);
		КонецЕсли;
		
		Титульная.Вставить("ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ", ПодписантСтр);
		Титульная.Вставить("НаимДок", Реквизиты.ДокументПредставителя);
		Титульная.Вставить("ПРИЗНАК_НП_ПОДВАЛ", "2");
	Иначе
		Документы.УведомлениеОСпецрежимахНалогообложения.УстановитьДанныеРуководителя(ДокументОбъект);
		ПодписантСтр = СокрЛП(ДокументОбъект.ПодписантФамилия + " " + ДокументОбъект.ПодписантИмя + " " + ДокументОбъект.ПодписантОтчество);
		Титульная.Вставить("ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ", ПодписантСтр);
		Титульная.Вставить("ПРИЗНАК_НП_ПОДВАЛ", "1");
	КонецЕсли;
	
	ДанныеУведомления = Новый Структура("Титульная", Титульная);
	ИдентификаторыОбычныхСтраниц = Новый Структура("Титульная", УИДТитульная);
	ДанныеДопСтрокБД = Новый Структура("МнгСтр1", Контейнер.МнгСтр1);
	
	ДанныеМногостраничныхРазделов = Новый Структура;
	ДанныеМногостраничныхРазделов.Вставить("Договор", Новый СписокЗначений);
	ДанныеМногостраничныхРазделов.Вставить("Спецификация", Новый СписокЗначений);
	ДанныеМногостраничныхРазделов.Вставить("ТоварДоговор", Новый СписокЗначений);
	ДанныеМногостраничныхРазделов.Вставить("ТоварСпецификация", Новый СписокЗначений);
	
	Если Контейнер["Договор"].Количество() = 0 Тогда 
		Контейнер["Договор"].Добавить();
		Контейнер["Договор"][0].УИД = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Стр001 = ДеревоСтраниц.Строки.Добавить();
	Стр001.Наименование = "Договоры";
	Стр001.ИндексКартинки = 1;
	Стр001.Многостраничность = Истина;
	Стр001.Многострочность = Ложь;
	
	Для Каждого Стр Из Контейнер["Договор"] Цикл 
		СтрДог = Стр001.Строки.Добавить();
		СтрДог.Наименование = "Стр. " + (Контейнер["Договор"].Индекс(Стр) + 1);
		СтрДог.ИндексКартинки = 1;
		СтрДог.ИмяМакета = "Договор_2026";
		СтрДог.Многостраничность = Истина;
		СтрДог.Многострочность = Ложь;
		СтрДог.УИД = Стр.УИД;
		СтрДог.ИДНаименования = "Договор";
		ДанныеМногостраничныхРазделов["Договор"].Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
		
		СтрТовар = СтрДог.Строки.Добавить();
		СтрТовар.Наименование = "Товары";
		СтрТовар.ИндексКартинки = 1;
		СтрТовар.Многостраничность = Истина;
		СтрТовар.Многострочность = Истина;
		
		ДобавлениеТоваров_2026(СтрТовар.Строки, ДанныеМногостраничныхРазделов["ТоварДоговор"],
			Стр.УИД, Контейнер["ТоварДоговор"], "ТоварДоговор");
		
		СтрСпецификация = СтрДог.Строки.Добавить();
		СтрСпецификация.Наименование = "Спецификации";
		СтрСпецификация.ИндексКартинки = 1;
		СтрСпецификация.Многостраничность = Истина;
		СтрСпецификация.Многострочность = Истина;
		
		ДобавлениеСпецификаций_2026(СтрСпецификация.Строки, Контейнер, Стр.УИД, ДанныеМногостраничныхРазделов);
	КонецЦикла;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДеревоСтраниц", ДеревоСтраниц);
	СтруктураПараметров.Вставить("ДанныеУведомления", ДанныеУведомления);
	СтруктураПараметров.Вставить("РазрешитьВыгружатьСОшибками", Ложь);
	СтруктураПараметров.Вставить("ИдентификаторыОбычныхСтраниц", ИдентификаторыОбычныхСтраниц);
	СтруктураПараметров.Вставить("ДанныеМногостраничныхРазделов", ДанныеМногостраничныхРазделов);
	СтруктураПараметров.Вставить("ДанныеДопСтрокБД", ДанныеДопСтрокБД);
	
	ДокументОбъект.ДанныеУведомления = Новый ХранилищеЗначения(СтруктураПараметров);
	ДокументОбъект.Записать();
	Возврат ДокументОбъект.Ссылка;
КонецФункции

Процедура ДобавлениеСпецификаций_2026(СтрокиВДереве, Контейнер, УИДРодителя, ДанныеМногостраничныхРазделов)
	ОтбСтроки = Контейнер["Спецификация"].НайтиСтроки(Новый Структура("УИДРодителя", УИДРодителя));
	Если ОтбСтроки.Количество() = 0 Тогда 
		НовСтр = Контейнер["Спецификация"].Добавить();
		НовСтр.УИДРодителя = УИДРодителя;
		ОтбСтроки.Добавить(НовСтр);
	КонецЕсли;
	
	Инд = 0;
	Для Каждого Стр Из ОтбСтроки Цикл
		Инд = Инд + 1;
		
		Стр001 = СтрокиВДереве.Добавить();
		Стр001.Наименование = "Стр. " + Инд;
		Стр001.ИндексКартинки = 1;
		Стр001.ИмяМакета = "Спецификация_2026";
		Стр001.Многостраничность = Истина;
		Стр001.Многострочность = Ложь;
		Стр001.УИД = Стр.УИД;
		Стр001.ИДНаименования = "Спецификация";
		
		ДанныеМногостраничныхРазделов["Спецификация"].Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
		
		Стр001 = Стр001.Строки.Добавить();
		Стр001.Наименование = "Товары";
		Стр001.ИндексКартинки = 1;
		Стр001.Многостраничность = Истина;
		Стр001.Многострочность = Истина;
		
		ДобавлениеТоваров_2026(Стр001.Строки, ДанныеМногостраничныхРазделов["ТоварСпецификация"],
			Стр.УИД, Контейнер["ТоварСпецификация"], "ТоварСпецификация");
	КонецЦикла;
КонецПроцедуры

Процедура ДобавлениеТоваров_2026(СтрокиВДереве, СписокСДанными, УИДРодителя, ДанныеЗаполнения, ИмяРаздела)
	ОтбСтроки = ДанныеЗаполнения.НайтиСтроки(Новый Структура("УИДРодителя", УИДРодителя));
	Если ОтбСтроки.Количество() = 0 Тогда 
		НовСтр = ДанныеЗаполнения.Добавить();
		НовСтр.УИДРодителя = УИДРодителя;
		ОтбСтроки.Добавить(НовСтр);
	КонецЕсли;
	
	Инд = 0;
	Для Каждого Стр Из ОтбСтроки Цикл
		Инд = Инд + 1;
		
		Стр001 = СтрокиВДереве.Добавить();
		Стр001.Наименование = "Стр. " + Инд;
		Стр001.ИндексКартинки = 1;
		Стр001.ИмяМакета = "Товар_2026";
		Стр001.Многостраничность = Истина;
		Стр001.Многострочность = Истина;
		Стр001.УИД = Стр.УИД;
		Стр001.ИДНаименования = ИмяРаздела;
		Стр001.МногострочныеЧасти.Добавить("МнгСтр1");
		
		СписокСДанными.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;
КонецПроцедуры

#Конецобласти

#КонецОбласти

#КонецЕсли