#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// РегламентированнаяОтчетность.ЗадачиБухгалтера

// Подробнее
// См. ВыполнениеЗадачБухгалтераКлиентСерверПереопределяемый.ПриОпределенииЭтоДокументСЭДО
//
Процедура ПриОпределенииЭтоДокументСЭДО(Признак, Правило) Экспорт
	
КонецПроцедуры

// Конец РегламентированнаяОтчетность.ЗадачиБухгалтера

#КонецОбласти

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Процедура ПриОпределенииВозможныхПредметов(ТипыПредметов) Экспорт
	ЗарплатаКадрыКлиентСерверБазовый.ПриОпределенииВозможныхПредметов(ТипыПредметов);
КонецПроцедуры

Процедура ПриОпределенииВозможныхКонтактов(ТипыКонтактов) Экспорт
	ЗарплатаКадрыКлиентСерверБазовый.ПриОпределенииВозможныхКонтактов(ТипыКонтактов)
КонецПроцедуры

#КонецОбласти

