
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если МобильныйКлиентУНФ.ФункциональностьВременноНедоступна(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	Доступность = ЭтоПолноправныйПользователь;
	
	ЗаполнитьТаблицуОператоров();
	
	СсылкиНаСтатьи = Перечисления.СервисыМассовыхРассылок.СсылкиНаСтатьи();
	
	ТекущийСервис = МассовыеРассылкиИнтеграция.ПодключенныйСервис();
	
	АдаптацияТакси();
	
	УправлениеФормой();

	ПрочитатьНастройкиИнтеграции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.НастройкаИнтеграции.Видимость = Ложь;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеталиОтключить", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеталиПодключить", "Видимость", Ложь);
	
	УстановитьФлагИспользованияВТаблице();
	ПерейтиНаСтрокуПодключенногоОператора();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлючAPIПриИзменении(Элемент)
	СохранитьНастройкиИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура СекретныйКлючПриИзменении(Элемент)
	СохранитьНастройкиИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	СохранитьНастройкиИнтеграции();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОператоры

&НаКлиенте
Процедура ОператорыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьКарточкуВыбранногоОператора", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОператорыПриНаведении(Элемент, Строка, Поле)
	
	Если Не ЭтоВариантИнтерфейса85 Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка <> Неопределено Тогда
		
		ДанныеСтроки = Элемент.ДанныеСтроки(Строка);				
		Если ДанныеСтроки <> Неопределено Тогда
			Элементы.СписокПодключитьОператора.Доступность = Не ДанныеСтроки.Подключен;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИнструкцияПодключениеОператора(Команда)

	ТекущиеДанные = Элементы.Операторы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ИнструкцияПодключенияСсылка(ТекущиеДанные.Идентификатор));

КонецПроцедуры

&НаКлиенте
Процедура СписокПодключитьОператора(Команда)

	ПодключитьОператораПоТекущимДанным();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуОператора(Команда)

	ТекущиеДанные = Элементы.Операторы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОткрытьСтраницуСервиса(ТекущиеДанные.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиПодключить(Команда)

	ПодключитьОператораПоТекущимДанным();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОписаниеВозможностей(Команда)

	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://its.1c.ru/db/metod81#browse:13:-1:2115:2503:2512:2529");
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Отключить(Команда)
	
	ТекущиеДанные = Элементы.Операторы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = СтрШаблон(
		НСтр("ru='Отключить ""%1""?'"), ТекущиеДанные.Представление);
		
	Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПриВыбореСервиса(Неопределено);
	
	УстановитьФлагИспользованияВТаблице();
	ОбновитьКарточкуВыбранногоОператора();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьФлагИспользованияВТаблице()
	
	СтрокаОператора = Неопределено;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Идентификатор", ТекущийСервис);
		
	НайденныеСтроки = Операторы.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() Тогда
		СтрокаОператора = НайденныеСтроки[0];
	КонецЕсли;

	Для Каждого ОбрабатываемаяСтрока Из Операторы Цикл
		ОбрабатываемаяСтрока.Подключен = ОбрабатываемаяСтрока = СтрокаОператора;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтрокуПодключенногоОператора()
		
	Если Не ЗначениеЗаполнено(ТекущийСервис) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Идентификатор", ТекущийСервис);
	
	НайденныеСтроки = Операторы.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() Тогда
		СтрокаОператора = НайденныеСтроки[0];
		Элементы.Операторы.ТекущаяСтрока = СтрокаОператора.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОператоров()
	
	НовыйОператор = Операторы.Добавить();
	НовыйОператор.Идентификатор = Перечисления.СервисыМассовыхРассылок.SendPulse;
	НовыйОператор.Представление = "SendPulse";
	НовыйОператор.ИмяКартинки = "СервисРассылокSendPulse";
	
	НовыйОператор = Операторы.Добавить();
	НовыйОператор.Идентификатор = Перечисления.СервисыМассовыхРассылок.UniSender;
	НовыйОператор.Представление = "UniSender";
	НовыйОператор.ИмяКартинки = "СервисРассылокUnisender";
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Если Не ЗначениеЗаполнено(ТекущийСервис) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиИнтерфейса = МассовыеРассылкиИнтеграция.НастройкиИнтерфейса(ТекущийСервис);
	
	Элементы.Логин.Видимость         = НастройкиИнтерфейса.ИспользоватьЛогин;
	Элементы.СекретныйКлюч.Видимость = НастройкиИнтерфейса.ИспользоватьСекретныйКлюч;
	Элементы.КлючAPI.Видимость       = НастройкиИнтерфейса.ИспользоватьКлючAPI;
	
	Если ТекущийСервис = Перечисления.СервисыМассовыхРассылок.SendPulse Тогда
		Элементы.КлючAPI.Заголовок = НСтр("ru='ID'");
		Элементы.СекретныйКлюч.Заголовок = НСтр("ru='Secret'");
	ИначеЕсли ТекущийСервис = Перечисления.СервисыМассовыхРассылок.UniSender Тогда
		Элементы.КлючAPI.Заголовок = НСтр("ru='Ключ доступа к API'");
	Иначе
		Элементы.КлючAPI.Заголовок = НСтр("ru='Ключ API'");
		Элементы.СекретныйКлюч.Заголовок = НСтр("ru='Секретный ключ'");
	КонецЕсли;
	
	Если Не ЭтоПолноправныйПользователь Тогда
		Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриВыбореСервиса(ВыбранныйСервис)
	
	Если Не ЗначениеЗаполнено(ВыбранныйСервис) Тогда
		ОтключитьИнтеграцию();
	КонецЕсли;
	
	ТекущийСервис = ВыбранныйСервис;
	Константы.ИспользоватьМассовыеРассылкиИнтеграция.Установить(Истина);
	Константы.СервисМассовыхРассылок.Установить(ТекущийСервис);
	
	УправлениеФормой();
	
	КлючAPI = Неопределено;
	Логин = Неопределено;
	СекретныйКлюч = Неопределено;
	
	ПрочитатьНастройкиИнтеграции();
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьИнтеграцию()
	
	Константы.ИспользоватьМассовыеРассылкиИнтеграция.Установить(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиИнтеграции()
	
	НастройкаИнтеграции = МассовыеРассылкиИнтеграция.НастройкаИнтеграции(ТекущийСервис);
	КлючAPI       = НастройкаИнтеграции.КлючAPI;
	Логин         = НастройкаИнтеграции.Логин;
	СекретныйКлюч = НастройкаИнтеграции.СекретныйКлюч;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиИнтеграции()
	
	НастройкаИнтеграции = МассовыеРассылкиИнтеграция.НовыйНастройкаИнтеграции();
	НастройкаИнтеграции.Сервис        = ТекущийСервис;
	НастройкаИнтеграции.КлючAPI       = КлючAPI;
	НастройкаИнтеграции.Логин         = Логин;
	НастройкаИнтеграции.СекретныйКлюч = СекретныйКлюч;
	
	МассовыеРассылкиИнтеграция.СохранитьНастройкиИнтеграции(НастройкаИнтеграции);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуСервиса(Сервис)
	
	Ссылка = СсылкиНаСтатьи.НайтиПоЗначению(Сервис).Представление;
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Ссылка);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИнструкцияПодключенияСсылка(Сервис)
	
	СсылкиНаСтатьи = Новый Соответствие;
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.СервисыМассовыхРассылок.SendPulse"),
		"https://its.1c.ru/db/metod81#content:7392:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.СервисыМассовыхРассылок.UniSender"),
		"https://its.1c.ru/db/metod81#content:7393:hdoc");
	
	Возврат СсылкиНаСтатьи.Получить(Сервис);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьКарточкуВыбранногоОператора()
	
	ТекущиеДанные = Элементы.Операторы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаПараметры.Заголовок = ТекущиеДанные.Представление;
	
	Если ПустаяСтрока(ТекущиеДанные.ИмяКартинки) Тогда
		ЛоготипОператора = Новый Картинка;
		Элементы.ЛоготипПодключенногоОператора.Видимость = Ложь;
	Иначе
		ЛоготипОператора = БиблиотекаКартинок[ТекущиеДанные.ИмяКартинки];
		Элементы.ЛоготипПодключенногоОператора.Видимость = Истина;
	КонецЕсли;
	
	
	Элементы.ЛоготипПодключенногоОператора.Картинка = ЛоготипОператора;
	
	Элементы.НастройкаИнтеграции.Видимость = ТекущиеДанные.Подключен И ЭтоПолноправныйПользователь;
	Элементы.ДеталиОтключить.Видимость  = ТекущиеДанные.Подключен;
	Элементы.ДеталиПодключить.Видимость = Не ТекущиеДанные.Подключен;
	
	УстановитьРазмерыЛоготипа(ТекущиеДанные.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРазмерыЛоготипа(ИдентификаторОператора)
	
	ШиринаЛоготипа = Новый Соответствие;
	ШиринаЛоготипа.Вставить(ПредопределенноеЗначение("Перечисление.СервисыМассовыхРассылок.UniSender"), 14);

	ШиринаЛоготипаОператора = ШиринаЛоготипа.Получить(ИдентификаторОператора);
	Если ШиринаЛоготипаОператора = Неопределено Тогда
		ШиринаЛоготипаОператора = 19;
	КонецЕсли;
	
	Элементы.ЛоготипПодключенногоОператора.Ширина = ШиринаЛоготипаОператора;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОператораПоТекущимДанным()
	
	ТекущиеДанные = Элементы.Операторы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Подключен Тогда
		ПоказатьПредупреждение(, НСтр("ru='Оператор уже подключен'"));
		Возврат;
	КонецЕсли;
	
	ЕстьПодключенныеОператоры = ЗначениеЗаполнено(ТекущийСервис);
		
	ТекстВопроса = СтрШаблон(
		НСтр("ru='Подключить ""%1""?'"), ТекущиеДанные.Представление);
		
	Если ЕстьПодключенныеОператоры Тогда
		ТекстВопроса = СтрШаблон("%1 %2", ТекстВопроса, 
			НСтр("ru='Ранее подключенный оператор будет отключен.'"));
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьОператораПоТекущимДаннымЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОператораПоТекущимДаннымЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Операторы.ТекущиеДанные;
	
	ПриВыбореСервиса(ТекущиеДанные.Идентификатор);
	УстановитьФлагИспользованияВТаблице();
	ОбновитьКарточкуВыбранногоОператора();
	
	ТекущиеДанные.Подключен = Истина;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если Не ЭтоВариантИнтерфейса85 Тогда
		Элементы.СписокПодключитьОператора.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

