
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказателиБизнесаФормы.ИнициализироватьСлужебныеРеквизитыФормы(ЭтотОбъект);
	УстановитьОтбор();
	
	Если Параметры.Отбор.Свойство("ВидОтчета") И ЗначениеЗаполнено(Параметры.Отбор.ВидОтчета) Тогда
		ВыбранныйОтчет = Параметры.Отбор.ВидОтчета;
		Элементы.ВыбранныйОтчет.Видимость = Ложь;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидОтчета", ВыбранныйОтчет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыбранныйОтчетОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйОтчетПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ВидОтчета", ВыбранныйОтчет);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ПередНачаломДобавленияПоказателя(Элемент, Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтбор()
	
	Если Параметры.Свойство("ПоказательБизнеса") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипПоказателя");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение = Перечисления.ТипыПоказателейБизнеса.Формула;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломДобавленияПоказателя(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если ВыбранныйОтчет = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ИначеЕсли ВыбранныйОтчет = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДенежныйПоток") Тогда
		ТекущиеДанные = Элементы.СписокДенежныйПоток.ТекущиеДанные;
	Иначе // Баланс
		ТекущиеДанные = Элементы.СписокБаланс.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("ВидОтчета", ВыбранныйОтчет);
	Иначе
		ПараметрыОткрытия = Новый Структура("ТекущийЭлемент", ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ПоказателиБизнеса.Форма.ФормаЭлемента", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
