
#Область ПрограммныйИнтерфейс

// Заполняет структуру параметров записи метки RFID.
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПараметрыЗаписиМеткиRFID() Экспорт; 
	
	Результат = Новый Структура();
	Результат.Вставить("TID"       , Неопределено);
	Результат.Вставить("EPC"       , Неопределено);
	Результат.Вставить("Данные"    , Неопределено);
	Результат.Вставить("БанкПамяти", "EPC");
	Результат.Вставить("Таймаут"   , 0);
	Возврат Результат;
	
КонецФункции

// Начать открытие сессии считывателя RFID.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьОткрытиеСессииСчитывателяRFID(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ОткрытьСессиюСчитывателяRFIDАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;

КонецПроцедуры

// Начать закрытие сессии считывателя RFID.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьЗакрытиеСессииСчитывателяRFID(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ЗакрытьСессиюСчитывателяRFIDАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;

КонецПроцедуры

// Начать запись данных в метку RFID.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьЗаписьДанныхВМеткуRFID(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ЗаписатьДанныеВМеткуRFIDАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;

КонецПроцедуры

// Генерировать внешнее событие для эмулятора RFID.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура ГенерироватьВнешнееСобытие(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ГенерироватьВнешнееСобытиеАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;

КонецПроцедуры

// Открыть сессию считывателя RFID.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ОткрытьСессиюСчитывателяRFIDАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "OpenSessionRFID";
	Контекст = НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Закрыть сессию считывателя RFID.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ЗакрытьСессиюСчитывателяRFIDАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "CloseSessionRFID";
	Контекст = НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Записать данные в метку RFID.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ЗаписатьДанныеВМеткуRFIDАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "SaveDataTagRFID";
	Контекст = НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Генерировать внешнее событие для эмулятора RFID.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ГенерироватьВнешнееСобытиеАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "ExternalEvent";
	Контекст = НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйКонтекстОперацииСОборудованием() Экспорт
	
	Контекст = МенеджерОборудованияКлиентСервер.НовыйКонтекстВыполненияОперации();
	Контекст.ПроцессорДанныхСервер = "ОборудованиеСчитывательRFID";
	Контекст.ПроцессорДанныхКлиент = "ОборудованиеСчитывательRFIDКлиент";
	Возврат Контекст;
	
КонецФункции

#Область ПодготовкаИОбработкаДанныхОперации

Асинх Функция ПриПодготовкеДанныхОперацииАсинх(ДанныеОперации, ПараметрыПодключения, Команда, ПараметрыОперации) Экспорт
	
КонецФункции

Асинх Функция ПриОбработкеРезультатовОперацииАсинх(ДанныеОперации, ПараметрыПодключения, Команда, РезультатОперации) Экспорт
	
КонецФункции

#КонецОбласти

#КонецОбласти
