#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Параметры.ПолноеИмяОбъектаМетаданных) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Параметры.ВидыОпераций) <> Тип("СписокЗначений") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ДокументСсылка = Параметры.ДокументСсылка;

	ИсключаемыеОбъекты = Новый Массив;

	Если ТипЗнч(Параметры.ИсключитьТипы) = Тип("Массив") Тогда

		Для Каждого ИсключаемыйТип Из Параметры.ИсключитьТипы Цикл
			ИсключаемыеОбъекты.Добавить(Метаданные.НайтиПоТипу(ИсключаемыйТип));
		КонецЦикла;

		Если Параметры.ИсключитьТипы.Найти(ТипЗнч(ДокументСсылка)) <> Неопределено Тогда
			ДокументСсылка = Неопределено;
		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ПолноеИмя = ДокументСсылка.Метаданные().ПолноеИмя();
	КонецЕсли;

	ЗаполнитьРеквизитыПоИдентификаторуОбъектаМетаданных(Параметры.ПолноеИмяОбъектаМетаданных, ИсключаемыеОбъекты);
	УстановитьОтборПоВидамОпераций(Параметры.ВидыОпераций);

	НастроитьФорму();

	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Подходящий шаблон не найден'");
	ПараметрыВажногоСообщения.Сообщение = НСтр(
		"ru = 'Нужного шаблона нет? Откройте документ и выберите ""Сохранить документ как шаблон"".
		|Поля из документа автоматически подставятся в шаблон.'");
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия <> "ЗаписанШаблонДокумента" Тогда
		Возврат;
	КонецЕсли;

#Если ВебКлиент Или МобильныйКлиент Тогда
	Высота = 25;
#КонецЕсли

	ВыполнитьПереход(Параметр);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда,
	НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуНовогоДокумента();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)

	Если Копирование Тогда
		Возврат;
	КонецЕсли;

	Отказ = Истина;

	ВыбраннаяСтрока = СтрокаИдентификаторыОбъектовМетаданных();
	ОбработатьСозданиеПустогоШаблона(ВыбраннаяСтрока);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ШаблонПоДокументу(Команда)

	ИмяФормыДокумента = СтрШаблон("%1.ФормаОбъекта", ПолноеИмя);
	ПараметрыФормыДокумента = Новый Структура("Ключ", ДокументСсылка);
	//@skip-check use-non-recommended-method
	ФормаДокумента = ПолучитьФорму(ИмяФормыДокумента, ПараметрыФормыДокумента, ЭтотОбъект);

	ФормаДокумента.СохранитьДокументКакШаблон(Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыШаблона", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ПустойШаблон(Команда)

	ВыбраннаяСтрока = СтрокаИдентификаторыОбъектовМетаданных();
	ОбработатьСозданиеПустогоШаблона(ВыбраннаяСтрока);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуНовогоДокумента()

	ОценкаПроизводительностиКлиент.ЗамерВремени("СозданиеДокументаПоШаблону");

	ЭлементыСписокТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ЭлементыСписокТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура);
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("ШаблонДокумента", ЭлементыСписокТекущиеДанные.Ссылка);

	ОткрытьФорму(СтрШаблон("%1.ФормаОбъекта", ЭлементыСписокТекущиеДанные.ПолноеИмяОбъекта), ПараметрыФормы);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоИдентификаторуОбъектаМетаданных(ПолноеИмяОбъектаМетаданных, ИсключаемыеОбъекты)

	ИдентификаторыОбъектовМетаданных.Очистить();

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);

	Если Не Метаданные.ЖурналыДокументов.Содержит(ОбъектМетаданных) Тогда
		ДобавитьСтрокуВИдентификаторыОбъектовМетаданных(ОбъектМетаданных, ИсключаемыеОбъекты);
	Иначе
		Для Каждого ТекДокумент Из ОбъектМетаданных.РегистрируемыеДокументы Цикл
			Если ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ТекДокумент) Тогда
				ДобавитьСтрокуВИдентификаторыОбъектовМетаданных(ТекДокумент, ИсключаемыеОбъекты);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ПравоеЗначениеОтбора = ИдентификаторыОбъектовМетаданных.Выгрузить( , "Ссылка").ВыгрузитьКолонку("Ссылка");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ИдентификаторОбъектаМетаданных",
		ПравоеЗначениеОтбора, ВидСравненияКомпоновкиДанных.ВСписке);

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВИдентификаторыОбъектовМетаданных(ОбъектМетаданных, ИсключаемыеОбъекты)

	Если ИсключаемыеОбъекты.Найти(ОбъектМетаданных) <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	НоваяСтрока = ИдентификаторыОбъектовМетаданных.Добавить();
	НоваяСтрока.Ссылка = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных);
	НоваяСтрока.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	НоваяСтрока.Синоним = ОбъектМетаданных.Синоним;

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоВидамОпераций(ВидыОпераций)

	Если ВидыОпераций.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидОперации", ВидыОпераций,
		ВидСравненияКомпоновкиДанных.ВСписке);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СписокВидовОперацийДляОтбора(ПараметрыСписок)

	Результат = Новый СписокЗначений;

	Для Каждого ЭлементОтбора Из ПараметрыСписок.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл

		Если Не ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;

		Если ЭлементОтбора.ЛевоеЗначение <> Новый ПолеКомпоновкиДанных("ВидОперации") Тогда
			Продолжить;
		КонецЕсли;

		Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			Результат.Добавить(ЭлементОтбора.ПравоеЗначение);
			Возврат Результат;
		КонецЕсли;

		Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			Результат.ЗагрузитьЗначения(ЭлементОтбора.ПравоеЗначение.ВыгрузитьЗначения());
			Возврат Результат;
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыШаблона(Результат, Параметры) Экспорт

	НастроитьФорму();

КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШаблоныДокументов.Ссылка
	|ИЗ
	|	Справочник.ШаблоныДокументовУНФ КАК ШаблоныДокументов
	|ГДЕ
	|	ШаблоныДокументов.ИдентификаторОбъектаМетаданных В(&ИдентификаторыОбъектовМетаданных)";
	СсылкиНаИдентификаторыОбъектовМетаданных = ИдентификаторыОбъектовМетаданных.Выгрузить( , "Ссылка");
	ПараметрИдентификаторыОбъектовМетаданных = СсылкиНаИдентификаторыОбъектовМетаданных.ВыгрузитьКолонку("Ссылка");
	Запрос.УстановитьПараметр("ИдентификаторыОбъектовМетаданных", ПараметрИдентификаторыОбъектовМетаданных);

	ДобавитьОтборПоВидамОпераций(Запрос);

	КлючСохраненияПоложенияОкна = Заголовок;

КонецПроцедуры

&НаСервере
Процедура ДобавитьОтборПоВидамОпераций(Запрос)

	ВидыОпераций = СписокВидовОперацийДляОтбора(Список);

	Если ВидыОпераций.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос.Текст = СтрШаблон(
		"%1
		|И ШаблоныДокументов.ВидОперации В (&ВидыОпераций)", Запрос.Текст);

	Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСозданиеПустогоШаблона(ТекСтрокаИОМ)

	Если ТекСтрокаИОМ = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИмяФормыДокумента = СтрШаблон("%1.ФормаОбъекта", ТекСтрокаИОМ.ПолноеИмя);
	ПараметрыФормыДокумента = ПараметрыФормыОбъектаПоИдентификаторуМетаданных();
	//@skip-check use-non-recommended-method
	ФормаДокумента = ПолучитьФорму(ИмяФормыДокумента, ПараметрыФормыДокумента, ЭтотОбъект);

	ФормаДокумента.СохранитьДокументКакШаблон(Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыШаблона", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Функция ПараметрыФормыОбъектаПоИдентификаторуМетаданных()

	Результат = Новый Структура;
	Результат.Вставить("ЗначенияЗаполнения", Новый Структура);
	Результат.ЗначенияЗаполнения.Вставить("ПропуститьЗаполнение", Истина);

	ВидыОпераций = СписокВидовОперацийДляОтбора(Список);

	Если ВидыОпераций.Количество() = 1 И РаботаСЗаявкамиКлиентСервер.ЭтоТипЗаказНаряда(ВидыОпераций[0].Значение) Тогда
		Результат.ЗначенияЗаполнения.Вставить(
		"ВидОперации", ВидыОпераций[0].Значение);
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаКлиенте
Функция СтрокаИдентификаторыОбъектовМетаданных()

	Если ИдентификаторыОбъектовМетаданных.Количество() = 1 Тогда
		Возврат ИдентификаторыОбъектовМетаданных[0];
	КонецЕсли;

	СписокИдентификаторов = Новый СписокЗначений;
	Для Каждого ТекСтрока Из ИдентификаторыОбъектовМетаданных Цикл
		СписокИдентификаторов.Добавить(ТекСтрока.ПолучитьИдентификатор(), ТекСтрока.Синоним);
	КонецЦикла;

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборИзМеню", ЭтотОбъект);

	ПоказатьВыборИзМеню(ОписаниеОповещения, СписокИдентификаторов);

	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура ОбработатьВыборИзМеню(Результат, Параметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("ЭлементСпискаЗначений") Тогда
		Возврат;
	КонецЕсли;

	ВыбраннаяСтрока = ИдентификаторыОбъектовМетаданных.НайтиПоИдентификатору(Результат.Значение);
	ОбработатьСозданиеПустогоШаблона(ВыбраннаяСтрока);

КонецПроцедуры

#КонецОбласти