#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заменить(Команда)
	
	ТекстОшибки = "";
	Если Не ЗначениеЗаполнено(ИсходноеРабочееМесто) Тогда
		ТекстОшибки = НСтр("ru = 'Не заполнено текущще рабочее место.'");
	ИначеЕсли Не ЗначениеЗаполнено(НовоеРабочееМесто) Тогда
		ТекстОшибки = НСтр("ru = 'Не заполнено новое рабочее место.'");
	Иначе
		ИзмененияБыли = Ложь;
		ЗаменитьНаСервере(ИсходноеРабочееМесто, НовоеРабочееМесто, ИзмененияБыли);
		Если ИзмененияБыли Тогда
			Оповестить("ЗаменаРабочегоМеста");
			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Замена выполнена.'"));
		Иначе
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Для рабочего места ""%1"" не было найдено оборудования и настроек.'"),
				Строка(ИсходноеРабочееМесто));
		КонецЕсли;
	КонецЕсли;
	Если Не ТекстОшибки = "" Тогда
		ПоказатьПредупреждение(Неопределено, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаменитьНаСервере(ИсходноеРабочееМесто, НовоеРабочееМесто, ИзмененияБыли)
	
	ОбщегоназначенияРМК.ЗаменитьРабочееМестоОборудованияИНастроек(ИсходноеРабочееМесто, НовоеРабочееМесто, ИзмененияБыли);
	
КонецПроцедуры

#КонецОбласти