#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СразуНаПринтер        = Параметры.СразуНаПринтер;
	ШаблонЭтикетки        = Параметры.ШаблонЭтикетки;
	ИмяМакета           = Параметры.ИмяМакета;
	
	ДанныеПечати = Неопределено;
	Если ЭтоАдресВременногоХранилища(Параметры.АдресВХранилище) Тогда
		ДанныеПечати = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ИмяМакета = "ЭтикеткаКодМаркировкиИСМП" Тогда
		Заголовок = НСтр("ru = 'Выбор шаблона этикетки'");
		Элементы.СразуНаПринтер.Видимость = Истина;
		ОтборШаблона = Новый ПараметрВыбора("Отбор.ТипШаблона",
			Перечисления.ТипыШаблонов.ЭтикеткаКодМаркировкиИСМП);
		АдресВХранилище = ПоместитьВоВременноеХранилище(ДанныеПечати, УникальныйИдентификатор);
	ИначеЕсли ИмяМакета = "ЭтикеткаШтрихкодыУпаковки" Тогда
		Заголовок = НСтр("ru = 'Выбор шаблона этикетки упаковки'");
		Элементы.СразуНаПринтер.Видимость = Ложь;
		ОтборШаблона = Новый ПараметрВыбора("Отбор.ТипШаблона",
			Перечисления.ТипыШаблонов.ЭтикеткаДляШтрихкодовУпаковок);
		ШтрихкодыУпаковок.Загрузить(ДанныеПечати);
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(ОтборШаблона);
	Элементы.ШаблонЭтикетки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"));
	
	ПараметрыПечати = ПараметрыПечати();
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьЭтикетокИЦенников",
		ИмяМакета,
		ПараметрКоманды,
		ВладелецФормы,
		ПараметрыПечати);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыПечати()
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("КоличествоЭкземпляров", 1);
	ПараметрыПечати.Вставить("РежимПечати", "ЭтикеткаКодМаркировкиИСМП");
	
	Если ИмяМакета = "ЭтикеткаКодМаркировкиИСМП" Тогда
		ПараметрыПечати.Вставить("АдресВХранилище", "");
		ПараметрыПечати.Вставить("КаждаяЭтикеткаНаНовомЛисте", Истина);
		ПараметрыПечати.Вставить("СразуНаПринтер", СразуНаПринтер);
		
		ДанныеПечати = ПолучитьИзВременногоХранилища(АдресВХранилище);
		Для Каждого СтрокаПечати Из ДанныеПечати.ОбъектыПечати Цикл
			СтрокаПечати.ШаблонЭтикетки = ШаблонЭтикетки;
		КонецЦикла;
		ПараметрыПечати.Вставить("СтруктураДанных", ДанныеПечати);
	ИначеЕсли ИмяМакета = "ЭтикеткаШтрихкодыУпаковки" Тогда
		ПараметрыПечати.Вставить("ШаблонЭтикетки",         ШаблонЭтикетки);
		ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);
		ПараметрыПечати.Вставить("ИсходныеДанные",
			ЗначениеВСтрокуВнутр(ШтрихкодыУпаковок.Выгрузить()));
	КонецЕсли;
	
	Возврат ПараметрыПечати;
	
КонецФункции

#КонецОбласти