#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//@skip-check using-form-data-to-value
	ЗначениеДляПреобразования = ДанныеФормыВЗначение(Параметры.ДеревоВидовОпераций, Тип("ДеревоЗначений"));
	ЗначениеВРеквизитФормы(ЗначениеДляПреобразования, "ДеревоЗначений");

	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЗначений

&НаКлиенте
Процедура ДеревоЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ВызватьОбработчикКомандыВыбрать();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать()

	ВызватьОбработчикКомандыВыбрать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВызватьОбработчикКомандыВыбрать()

	Если ТипЗнч(Элементы.ДеревоЗначений.ТекущиеДанные.ВидОперации) = Тип("Строка") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Выберите операцию (не группу)'"));
	Иначе
		Закрыть(Элементы.ДеревоЗначений.ТекущиеДанные.ВидОперации);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти