#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаКодВычета.Доступность = Запись.Применяется;
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрименяетсяПриИзменении(Элемент)
	
	Элементы.ГруппаКодВычета.Доступность = Запись.Применяется;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьПодробнееКод104(Команда)
	
	РегламентированнаяОтчетностьУСНКлиент.ПоказатьОписаниеВычетаНДФЛ("104");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодробнееКод105(Команда)
	
	РегламентированнаяОтчетностьУСНКлиент.ПоказатьОписаниеВычетаНДФЛ("105");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаПодробнее.Группировка = ГруппировкаПодчиненныхЭлементовФормы.АвтоматическиУчитыватьВидЭкрана;
	
КонецПроцедуры

#КонецОбласти