
#Область ПрограммныйИнтерфейс

// Заполняет структуру дополнительных параметров операции на Оборудовании.
// 
// Параметры:
//  СтрокиТекста - Строка - строки текста для отображения.
//  ЗначениеQRКода - Строка, Неопределено - Значение QRКода
// 
// Возвращаемое значение:
//  Структура - Параметры операции дисплей покупателя:
//    * СтрокиТекста - Строка - Текстовая строка
//    * ЗначениеQRКода - Строка - значение QR кода
//    * КартинкаQRКода - Строка - строка с base64 представлением png картинки логотипа.
//    * Сумма - Число - Сумма операции.
//    * СтатусОперации - ПеречислениеСсылка.СтатусОперацииНаДисплее - Статус операции
//    * СтатусРабочегоМеста - ПеречислениеСсылка.СтатусРабочегоМестаНаДисплее  - Статус рабочего места
//    * ЗвуковойСигнал - Булево - Звуковой сигнал.
//    * ТекстHTML - Строка - строка с base64 представлением png картинки логотипа.
//    * НазваниеОрганизации - Строка - Название организации 
//    * Операция - Строка - выполняемая операция.
//    * ТипПлатежнойСистемы - ПеречислениеСсылка.ТипыПлатежнойСистемыККТ
//                          - Неопределено
//    * НаличнаяОплата - Булево - Наличная оплата.
//    * ДополнительныйТекст - Строка - Дополнительный текст.
//    * Сдача - Число - Сдача по операции. 
//    * ГотовностьКРаботе - Булево - Готовность кассы к работе.
//    * КартинкаBase64 - Строка - строка с base64 представлением png картинки логотипа. 
//    * КолонкиТабличнойЧасти - Массив из Структура
//    * ТабличнаяЧасть - Массив из Соответствие 
//    * Возврат - Булево - флаг того что операция является возвратом
//    * ПодвалСумма - Число - Сумма табличной части    
//    * ВнутренняяОперация - Булево - отображение на дисплее выполняется БПО
//
Функция ПараметрыОперацииДисплейПокупателя(СтрокиТекста = "", ЗначениеQRКода = Неопределено) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("СтрокиТекста", СтрокиТекста);
	Результат.Вставить("ЗначениеQRКода", ЗначениеQRКода);
	Результат.Вставить("КартинкаQRКода");
	Результат.Вставить("Сумма", 0);
	// Статус операции: 0-Не установлены, 1-Выполнено успешно, 2-Операция не выполнена
	Результат.Вставить("СтатусОперации");
	Результат.Вставить("СтатусРабочегоМеста");
	Результат.Вставить("ЗвуковойСигнал", Ложь);
	Результат.Вставить("ТекстHTML");
	
	Результат.Вставить("НазваниеОрганизации");
	Результат.Вставить("Операция");
	Результат.Вставить("ТипПлатежнойСистемы");
	Результат.Вставить("НаличнаяОплата", Ложь);
	Результат.Вставить("ДополнительныйТекст");
	Результат.Вставить("Сдача", 0);
	Результат.Вставить("ГотовностьКРаботе");
	Результат.Вставить("КартинкаBase64");
	
	Результат.Вставить("КолонкиТабличнойЧасти", Новый Массив());
	Результат.Вставить("ТабличнаяЧасть", Новый Массив());
	Результат.Вставить("ПодвалСумма", 0);
	Результат.Вставить("Возврат", Ложь);
	Результат.Вставить("ПодвалСкидка", 0);
	Результат.Вставить("ВнутренняяОперация", Ложь);
	
	Результат.Вставить("Кнопки", Новый Массив());
	
	Возврат Результат;
	
КонецФункции

Функция КнопкаДисплеяПокупателя(Идентификатор, Наименование = "") Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("Наименование", ?(ПустаяСтрока(Наименование), Идентификатор, Наименование));
	Возврат Результат;
	
КонецФункции

// Заполняет структуру параметров колонки табличной части дисплея покупателя.
// 
// Параметры:
//  Имя - Строка
//  Заголовок - Строка
//  Ширина - Число
//  Выравнивание - ГоризонтальноеПоложение
// Возвращаемое значение:
//  Структура -Параметры операции дисплей покупателя
//
Функция ПараметрыКолонкиТабличнойЧастиДисплеяПокупателя(Имя, Заголовок = "", Ширина = 0, Выравнивание = Неопределено) Экспорт
	
	Результат = Новый Структура();     
	Результат.Вставить("Имя", Имя);  // Строка,Обязательно - Идентификатор колонки
	Результат.Вставить("Заголовок", Заголовок);  // Строка,Обязательно - Представление колонки     
	Результат.Вставить("Ширина", Ширина);  // Число,Обязательно - Ширина колонки в процентах     
	Результат.Вставить("Выравнивание", Выравнивание); // ГоризонтальноеПоложение
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйКонтекстОперацииСОборудованием() Экспорт
	
	Контекст = МенеджерОборудованияКлиентСервер.НовыйКонтекстВыполненияОперации();
	Контекст.ПроцессорДанныхСервер = "ОборудованиеДисплеиПокупателя";
	Контекст.ПроцессорДанныхКлиент = "ОборудованиеДисплеиПокупателяКлиент";
	Возврат Контекст;
	
КонецФункции

#КонецОбласти

