
#Область ОписаниеПеременных

&НаКлиенте
Перем ПользователиТелефонииПользовательИзменен;

&НаКлиенте
Перем ПользователиТелефонииВнутреннийНомерИзменен;

&НаКлиенте
Перем ПользователиТелефонииИсходящийНомерИзменен;

&НаКлиенте
Перем ПользователиТелефонииВнутреннийИдентификаторВАТСИзменен;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если МобильныйКлиентУНФ.ФункциональностьВременноНедоступна(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьПользователиТелефонии();
	ПрочитатьЗначенияНастроек();
	
	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	
	// Идентификаторами операторов Itoolabs являются строки
	ОператорыItoolabs = Перечисления.ДоступныеАТС.ДоступныеАТСУниверсальногоВиджетаItoolabs();
	ОператорыItoolabs.Сортировать("Представление Возр");

	ЗаполнитьСсылкиНаСтатьи(ОператорыItoolabs);
	ЗаполнитьТаблицуОператоров(ОператорыItoolabs);	
		
	УстановитьДоступностьЭлементов();	
	ЗаполнитьДействияОбработкиЗвонков();
	
	ВывестиБаннеры();	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеталиОтключить",  "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеталиПодключить", "Видимость", Ложь);
	Элементы.ГруппаБаннерМобильнаяТелефония.Видимость = Ложь;
	Элементы.ГруппаСтраницыПараметров.Видимость = Ложь;
	
	УстановитьФлагИспользованияВТаблице();
	ПерейтиНаСтрокуПодключенногоОператора();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбсужденияПодключены" Тогда
		АвтоматическаяОбработкаЗвонков = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант" И Источник = "ОбщиеНастройкиТелефонии" Тогда
		Если ИспользуемаяАТС <> Неопределено
			И ИспользуемаяАТС = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Билайн") Тогда
			ПроверкаПодпискиНаСобытияАТСБилайн();
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредложитьВозможностьНажатие(Элемент)
	
	ТекстПисьма = НСтр("ru = 'С какими операторами телефонии вы бы хотели интеграцию?'");
	Тег = НСтр("ru = 'Телефония'");
	
	УправлениеНебольшойФирмойКлиент.ПредложитьВозможностьНажатие(Тег, ТекстПисьма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БаннерМобильнойТелефонииОбработкаНавигационнойСсылки(Команда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://dl03.1c.ru/content/SmallBusiness/Extrafiles/Android.zip");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда, НавигационнаяСсылка,
		СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическаяОбработкаЗвонковПриИзменении(Элемент)
	
	АвтоматическаяОбработкаЗвонков = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	НачатьПодключениеОбсуждений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокНеобрабатываемыеТелефонныеНомераНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВводаНеобрабатываемыхНомеров", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.НеобрабатываемыеТелефонныеНомера.ФормаСписка", , , , , , ОписаниеОповещения);
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовНастроекТелефонии

// MangoOffice
&НаКлиенте
Процедура АТС_MangoOffice_vpbx_api_keyПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_MangoOffice", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура АТС_MangoOffice_vpbx_api_saltПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_MangoOffice", 2);
	
КонецПроцедуры

// ДомRu
&НаКлиенте
Процедура АТС_ДомRu_АдресОблачнойАТСПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_ДомRu", 0);
	
КонецПроцедуры

&НаКлиенте
Процедура АТС_ДомRu_КлючДляАвторизацииВОблачнойАТСПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_ДомRu", 1);
	
КонецПроцедуры

// Яндекс
&НаКлиенте
Процедура АТС_Яндекс_КлючДляАвторизацииПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_Яндекс", 1);
	ОчиститьТокеныДоступа();
	
КонецПроцедуры

// Ростелеком
&НаКлиенте
Процедура АТС_Ростелеком_КодИдентификацииПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_Ростелеком", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура АТС_Ростелеком_КлючДляПодписиПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_Ростелеком", 2);
	
КонецПроцедуры

// ВестКоллСПб
&НаКлиенте
Процедура АТС_ВестКоллСПб_АдресОблачнойАТСПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_ВестКоллСПб", 0);
	
КонецПроцедуры

&НаКлиенте
Процедура АТС_ВестКоллСПб_КлючДляАвторизацииВОблачнойАТСПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_ВестКоллСПб", 1);
	
КонецПроцедуры

// ДеловаяСетьИркутск
&НаКлиенте
Процедура АТС_ДеловаяСетьИркутск_АдресОблачнойАТСПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_ДеловаяСетьИркутск", 0);
	
КонецПроцедуры

&НаКлиенте
Процедура АТС_ДеловаяСетьИркутск_КлючДляАвторизацииВОблачнойАТСПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_ДеловаяСетьИркутск", 1);
	
КонецПроцедуры

// Билайн
&НаКлиенте
Процедура АТС_Билайн_КлючДляАвторизацииВОблачнойАТСПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_Билайн", 0);
	ПроверкаПодпискиНаСобытияАТСБилайн();
	ОбновитьСписокПользователейТелефонииНаКлиенте(ИспользуемаяАТС);
	
	Оповестить("Телефония_ДиагностикаОбновлениеНастроек");
	
КонецПроцедуры

// Itoolabs
&НаКлиенте
Процедура АТС_Itoolabs_АдресОблачнойАТСПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_Itoolabs", 0);
	
КонецПроцедуры

&НаКлиенте
Процедура АТС_Itoolabs_КлючДляАвторизацииВОблачнойАТСПриИзменении(Элемент)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТС("НастройкиАТС_Itoolabs", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутизироватьВходящиеНаОтветственныхПриИзменении(Элемент)
	
	ЗаписатьЗначениеОбщейНастройкиТелефонии("МаршрутизироватьВходящиеНаОтветственных",
		МаршрутизироватьВходящиеНаОтветственных);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеВходящийЗвонокИзвестногоАбонентаПриИзменении(Элемент)
	
	ЗаписатьЗначениеОбщейНастройкиТелефонии("ДействиеТекущегоЗвонкаНайденногоАбонента",
		ДействиеВходящийЗвонокИзвестногоАбонента);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеВходящийЗвонокНеизвестногоАбонентаПриИзменении(Элемент)
	
	ЗаписатьЗначениеОбщейНастройкиТелефонии("ДействиеТекущегоЗвонкаНеизвестногоАбонента",
		ДействиеВходящийЗвонокНеизвестногоАбонента);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеИсходящийЗвонокПриИзменении(Элемент)
	
	ЗаписатьЗначениеОбщейНастройкиТелефонии("ДействиеИсходящегоЗвонка", ДействиеИсходящийЗвонок);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовНастроекОбработкиЗвонков

&НаКлиенте
Процедура ДействиеПропущенныйЗвонокПриИзменении(Элемент)
	
	ЗаписатьЗначениеОбщейНастройкиТелефонии("ДействиеПропущенногоЗвонка", ДействиеПропущенныйЗвонок);
	ОбновитьПовторноИспользуемыеЗначения();

	Элементы.СлужебныйПользователь.Видимость = ДействиеПропущенныйЗвонок <> "ПоследнегоОтклонившегоЗвонок";
	Если ДействиеПропущенныйЗвонок = "ПоследнегоОтклонившегоЗвонок" Тогда
		ЗаписатьЗначениеОбщейНастройкиТелефонии("СлужебныйПользовательДляПропущенногоЗвонка",
			ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СлужебныйПользовательПриИзменении(Элемент)
	
	ЗаписатьЗначениеОбщейНастройкиТелефонии("СлужебныйПользовательДляПропущенногоЗвонка", СлужебныйПользователь);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПользователиТелефонии

&НаКлиенте
Процедура ПользователиТелефонииПриИзменении(Элемент)
	
	Если Не (ПользователиТелефонииПользовательИзменен = Истина
		Или ПользователиТелефонииВнутреннийНомерИзменен = Истина
		Или ПользователиТелефонииИсходящийНомерИзменен = Истина
		Или ПользователиТелефонииВнутреннийИдентификаторВАТСИзменен = Истина) Тогда
			
		ПроверитьЗаполнениеПользователейТелефонии();
		Возврат;
		
	КонецЕсли;
	
	ПользователиТелефонииПользовательИзменен                = Ложь;
	ПользователиТелефонииВнутреннийНомерИзменен             = Ложь;
	ПользователиТелефонииИсходящийНомерИзменен              = Ложь;
	ПользователиТелефонииВнутреннийИдентификаторВАТСИзменен = Ложь;
	
	ЗаписатьПользователиТелефонии();
	ПроверитьЗаполнениеПользователейТелефонии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиТелефонииПослеУдаления(Элемент)
	
	ЗаписатьПользователиТелефонии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиТелефонииПользовательПриИзменении(Элемент)
	ПользователиТелефонииПользовательИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПользователиТелефонииВнутреннийНомерПриИзменении(Элемент)
	ПользователиТелефонииВнутреннийНомерИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПользователиТелефонииИсходящийНомерПриИзменении(Элемент)
	ПользователиТелефонииИсходящийНомерИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПользователиТелефонииВнутреннийНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ИспользуемаяАТС = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Билайн") Тогда
		Элементы.ПользователиТелефонии.ТекущиеДанные.ВнутреннийИдентификаторВАТС =
			СписокАбонентов.НайтиПоЗначению(ВыбранноеЗначение).Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиТелефонииВнутреннийИдентификаторВАТСПриИзменении(Элемент)
	ПользователиТелефонииВнутреннийИдентификаторВАТСИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПользователиТелефонииПользовательОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные,
	ВыборДобавлением, СтандартнаяОбработка)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Пользователь", ВыбранноеЗначение);
	НайденныеСтроки = ПользователиТелефонии.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, НСтр("ru='Пользователь уже присутствует в списке'"));
		ВыбранноеЗначение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБработчикиСобытийЭлементовТаблицыФормыОператоры

&НаКлиенте
Процедура ОператорыПриАктивизацииСтроки(Элемент)

	ПодключитьОбработчикОжидания("ОбновитьКарточкуВыбранногоОператора", 0.3, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОператорыПриНаведении(Элемент, Строка, Поле)
	
	Если Не ЭтоВариантИнтерфейса85 Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка = Неопределено Тогда
		ДанныеСтроки = Элемент.ТекущиеДанные;
	Иначе
		ДанныеСтроки =  Элемент.ДанныеСтроки(Строка);
	КонецЕсли;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СписокПодключитьОператора.Доступность = Не ДанныеСтроки.Подключен;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИнструкцияПубликацияИБ(Команда)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ИнструкцияПубликацииСервисаТелефонии());
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПубликацииСервисов(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьНастройкуПубликацииHttpСервисовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ОбщиеНастройкиТелефонии.Форма", , , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОператораСписок(Команда)
	
	ПодключитьОператораПоТекущимДанным();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиПодключить(Команда)

	ПодключитьОператораПоТекущимДанным();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Отключить(Команда)
	
	ТекущиеДанные = Элементы.Операторы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = СтрШаблон(
		НСтр("ru='Отключить ""%1""?'"), ТекущиеДанные.Представление);
		
	Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОтключитьОператораНаСервере(ИспользуемаяАТС);
	Оповестить("Запись_НаборКонстант");
	
	ИспользуемаяАТС = Неопределено;
	ИспользуемаяАТСДополнительно = "";
	
	// Реквизиты формы
	ПризнакиИспользованияАТС = ПризнакиИспользованияАТС();
	Для Каждого КлючИЗначение Из ПризнакиИспользованияАТС Цикл
		ЭтотОбъект[КлючИЗначение.Ключ] = Ложь;
	КонецЦикла;
	
	ПрочитатьЗначенияНастроек();
	УстановитьОтметкуПодключенногоОператораВСписке();
	ОбновитьКарточкуВыбранногоОператора(); 

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуОператора(Команда)
	
	Если Не ПустаяСтрока(СсылкаНаСтатьюОператора) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СсылкаНаСтатьюОператора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьДиагностику(Команда)

	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаТелефонииДиагностика", , ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОтладку(Команда)
	
	ОткрытьФорму("Обработка.ОтладкаТелефонии.Форма.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОписаниеВозможностей(Команда)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://its.1c.ru/bmk/unf16/telephony");
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструкцияПодключениеОператора(Команда)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ИнструкцияПодключенияСсылка(ИспользуемаяАТС));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВводаНеобрабатываемыхНомеров(Результат, ДополнительныеПараметры) Экспорт 
	
	ОбновитьОтображениеКоличестваНеобрабатываемыхНомеров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОператораПоТекущимДанным()
	
	ТекущиеДанные = Элементы.Операторы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Подключен Тогда
		ПоказатьПредупреждение(, НСтр("ru='Оператор уже подключен'"));
		Возврат;
	КонецЕсли;
	
	ЕстьПодключенныеОператоры = ЗначениеЗаполнено(
		ПодключенныйОператор());
		
	ТекстВопроса = СтрШаблон(
		НСтр("ru='Подключить ""%1""?'"), 
		ТекущиеДанные.Представление);
		
	Если ЕстьПодключенныеОператоры Тогда
		ТекстВопроса = СтрШаблон("%1 %2", ТекстВопроса, 
			НСтр("ru='Ранее подключенный оператор будет отключен.'"));
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьОператораПоТекущимДаннымЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОператораПоТекущимДаннымЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Операторы.ТекущиеДанные;
	ПодключитьОператора(ТекущиеДанные.Идентификатор, ТекущиеДанные.ЭтоОператорItoolabs);
	ТекущиеДанные.Подключен = Истина;
	
	ОбновитьКарточкуВыбранногоОператора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОператора(ИдентификаторОператора, ЭтоОператорItoolabs)
	
	Если ЗначениеЗаполнено(ИспользуемаяАТС) Тогда
		ОтключитьОператораНаСервере(ИспользуемаяАТС);
	КонецЕсли;
	
	ПодключитьОператораНасервере(ИдентификаторОператора, ЭтоОператорItoolabs);
	Оповестить("Запись_НаборКонстант");
	
	Если ЭтоОператорItoolabs Тогда
		ИспользуемаяАТС = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.УниверсальныйItoolabs");
		ИспользуемаяАТСДополнительно = ИдентификаторОператора;
	ИначеЕсли ЭтоМобильнаяТелефония(ИдентификаторОператора) Тогда
		ИспользоватьМобильнаяТелефония = Истина;
		ИспользуемаяАТС = ИдентификаторОператора;
		ИспользуемаяАТСДополнительно = "";
	Иначе
		ИспользуемаяАТС = ИдентификаторОператора;
		ИспользуемаяАТСДополнительно = "";
	КонецЕсли;
	
	ОбновитьСписокПользователейТелефонииНаКлиенте(ИспользуемаяАТС);
	УстановитьОтметкуПодключенногоОператораВСписке();
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если Не ЭтоВариантИнтерфейса85 Тогда		
		Элементы.СписокПодключитьОператора.Видимость = Ложь;
		Элементы.ЛоготипПодключенногоОператора.Высота = 4;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиБаннеры()

	ПараметрыВажногоСообщенияМК = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщенияМК.Скрываемый           = Ложь;
	ПараметрыВажногоСообщенияМК.ТипСообщения         = "Предупреждение";
	ПараметрыВажногоСообщенияМК.Сообщение            = НСтр("ru = 'Необходимо использовать мобильный клиент УНФ.'");
	ПараметрыВажногоСообщенияМК.КраткоеПредставление = НСтр("ru = 'Мобильная телефония'");
	
	ПараметрыДействияМК = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	ПараметрыДействияМК.ИмяКоманды = "Загрузить";
	ПараметрыДействияМК.Обработчик = "Подключаемый_БаннерМобильнойТелефонииОбработкаНавигационнойСсылки";
	ПараметрыДействияМК.Заголовок  = НСтр("ru = 'Загрузить'");
	
	ПараметрыВажногоСообщенияМК.ПараметрыДействия = ПараметрыДействияМК;	
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщенияМК,
		Элементы.ГруппаБаннерМобильнаяТелефония.Имя);

	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый           = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения         = "Предупреждение";
	ПараметрыВажногоСообщения.Сообщение            = НСтр("ru = 'Параметры интеграции не заполнены'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Не заполнены параметры'");
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.ГруппаБаннерПараметры.Имя);
	
	ПараметрыВажногоСообщенияПользователи = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщенияПользователи.Скрываемый           = Ложь;
	ПараметрыВажногоСообщенияПользователи.ТипСообщения         = "Предупреждение";
	ПараметрыВажногоСообщенияПользователи.Сообщение            = НСтр("ru='Не указаны пользователи.'");
	ПараметрыВажногоСообщенияПользователи.КраткоеПредставление = НСтр("ru = 'Пользователи'");
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщенияПользователи,
		Элементы.ГруппаБаннерПользователиНеУказаны.Имя);
	
	ПараметрыВажногоСообщенияНомера = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщенияНомера.Скрываемый           = Ложь;
	ПараметрыВажногоСообщенияНомера.ТипСообщения         = "Предупреждение";
	ПараметрыВажногоСообщенияНомера.Сообщение            = НСтр("ru='Не заполнены внутренние номера.'");
	ПараметрыВажногоСообщенияНомера.КраткоеПредставление = НСтр("ru = 'Внутренние номера'");
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщенияНомера,
		Элементы.ГруппаБаннерПользователиНеЗаполненыНомера.Имя);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСсылкиНаСтатьи(ОператорыItoolabs)
	
	СсылкиНаСтатьи = Перечисления.ДоступныеАТС.СсылкиНаСтатьи();
	
	Для Каждого ОператорItoolabs Из ОператорыItoolabs Цикл
		СсылкиНаСтатьи.Добавить(ОператорItoolabs.Идентификатор, ОператорItoolabs.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОператоров(ОператорыItoolabs)

	ИдентификаторАТС = Перечисления.ДоступныеАТС.MangoOffice;
	ДобавитьОператора(ИдентификаторАТС, "Mango Office", "АТС_MangoOffice", Ложь);

	ИдентификаторАТС = Перечисления.ДоступныеАТС.ДомRu;
	ДобавитьОператора(ИдентификаторАТС, "Дом.ru Бизнес", "АТС_ДомRu", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.Ростелеком;
	ДобавитьОператора(ИдентификаторАТС, "Ростелеком", "АТС_Ростелеком", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.МГТС;
	ДобавитьОператора(ИдентификаторАТС, "МГТС", "АТС_МГТС", Ложь);

	ИдентификаторАТС = Перечисления.ДоступныеАТС.Мегафон;
	ДобавитьОператора(ИдентификаторАТС, "Мегафон", "АТС_Мегафон", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.ВестКоллСПб;
	ДобавитьОператора(ИдентификаторАТС, "ВестКолл (СПб)", "АТС_WestCall", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.ТТК;
	ДобавитьОператора(ИдентификаторАТС, "ТТК", "АТС_ТТК", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.Энфорта;
	ДобавитьОператора(ИдентификаторАТС, "Энфорта", "АТС_Энфорта", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.ДеловаяСетьИркутск;
	ДобавитьОператора(ИдентификаторАТС, "Деловая Сеть – Иркутск", "АТС_ДеловаяСетьИркутск", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.ВестКоллМосква;
	ДобавитьОператора(ИдентификаторАТС, "ВестКолл (Москва)", "АТС_ВестКоллМосква", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.VirginConnect;
	ДобавитьОператора(ИдентификаторАТС, "Virgin Connect", "АТС_VirginConnect", Ложь);

	ИдентификаторАТС = Перечисления.ДоступныеАТС.ГарсТелеком;
	ДобавитьОператора(ИдентификаторАТС, "Гарс Телеком", "АТС_ГарсТелеком", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.НаукаСвязь;
	ДобавитьОператора(ИдентификаторАТС, "Наука-связь", "АТС_НаукаСвязь", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.RiNet;
	ДобавитьОператора(ИдентификаторАТС, "RiNet", "АТС_RiNet", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.СибирскиеСети;
	ДобавитьОператора(ИдентификаторАТС, "Сибирские Сети", "АТС_СибирскиеСети", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.Авантел;
	ДобавитьОператора(ИдентификаторАТС, "Авантел", "АТС_Авантел", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.Гравител;
	ДобавитьОператора(ИдентификаторАТС, "Гравител", "АТС_Гравител", Ложь);
	
	ИдентификаторАТС = Перечисления.ДоступныеАТС.МТТ;
	ДобавитьОператора(ИдентификаторАТС, "МТТ Бизнес", "АТС_МТТ", Ложь);

	ИдентификаторАТС = Перечисления.ДоступныеАТС.Билайн;
	ДобавитьОператора(ИдентификаторАТС, "Билайн", "АТС_Билайн", Ложь);
	
	ИдентификаторАТС = "МобильнаяТелефония"; 
	ДобавитьОператора(ИдентификаторАТС, "Мобильная телефония 1С", "МобильнаяТелефония", Ложь);
	
	Для каждого ОператорItoolabs Из ОператорыItoolabs Цикл	
		ДобавитьОператора(ОператорItoolabs.Идентификатор, ОператорItoolabs.Представление, , Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОператора(Идентификатор, Представление, ИмяКартинки = "", ЭтоОператорItoolabs = Ложь)
	
	НоваяСтрока = Операторы.Добавить();
	НоваяСтрока.Идентификатор = Идентификатор;
	НоваяСтрока.Представление = Представление;
	НоваяСтрока.ИмяКартинки = ИмяКартинки;
	НоваяСтрока.ЭтоОператорItoolabs = ЭтоОператорItoolabs;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарточкуВыбранногоОператора()
	
	ТекущиеДанные = Элементы.Операторы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаПараметры.Заголовок = ТекущиеДанные.Представление;
	
	Если ПустаяСтрока(ТекущиеДанные.ИмяКартинки) Тогда
		ЛоготипОператора = Новый Картинка;
		Элементы.ЛоготипПодключенногоОператора.Видимость = Ложь;
	Иначе
		ЛоготипОператора = БиблиотекаКартинок[ТекущиеДанные.ИмяКартинки];
		Элементы.ЛоготипПодключенногоОператора.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ЛоготипПодключенногоОператора.Картинка = ЛоготипОператора;
	СсылкаНаСтатьюОператора =  СсылкиНаСтатьи.НайтиПоЗначению(ТекущиеДанные.Идентификатор).Представление;
	
	// Страница настроек
	Элементы.ГруппаСтраницыПараметров.Видимость = ТекущиеДанные.Подключен И ЭтоПолноправныйПользователь;
	Элементы.ЗапуститьДиагностику.Видимость = ТекущиеДанные.Подключен;
	Элементы.ЗапуститьОтладку.Видимость = ТекущиеДанные.Подключен;
	
	Элементы.ДеталиОтключить.Видимость = ТекущиеДанные.Подключен;
	Элементы.ДеталиПодключить.Видимость = Не ТекущиеДанные.Подключен;
	
	Элементы.ГруппаНастройкиАТС_MangoOffice.Видимость = 
		ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.MangoOffice");
	Элементы.ГруппаНастройкиАТС_ДомRu.Видимость =
		ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ДомRu");
	Элементы.ГруппаНастройкиАТС_Яндекс.Видимость =
		ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Яндекс");
	Элементы.ГруппаНастройкиАТС_Ростелеком.Видимость = 
		ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Ростелеком");
	Элементы.ГруппаНастройкиАТС_ВестКоллСПб.Видимость = 
		ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ВестКоллСПб");
	Элементы.ГруппаНастройкиАТС_ДеловаяСетьИркутск.Видимость =
		ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ДеловаяСетьИркутск");
	Элементы.ГруппаНастройкиАТС_Билайн.Видимость = 
		ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Билайн");
	Элементы.ГруппаНастройкиАТС_Itoolabs.Видимость =
		ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Энфорта")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Мегафон")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ТТК")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ВестКоллМосква")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.VirginConnect")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ГарсТелеком")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.НаукаСвязь")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.RiNet")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.СибирскиеСети")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Авантел")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Гравител")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.МГТС")
		Или ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.МТТ")
		Или ТекущиеДанные.ЭтоОператорItoolabs;
	
	Элементы.АвтоматическаяОбработкаЗвонков.Видимость = ЗначениеЗаполнено(ТекущиеДанные.Идентификатор);
	
	Элементы.ГруппаБаннерМобильнаяТелефония.Видимость = ЭтоМобильнаяТелефония(ТекущиеДанные.Идентификатор);
	
	Элементы.ГруппаСтраницаПользователи.Видимость = ЭтоОблачнаяАТС(ИспользуемаяАТС)
		Или ТекущиеДанные.ЭтоОператорItoolabs;
	Элементы.ГруппаСтраницаПараметрыИнтеграции.Видимость = ЭтоОблачнаяАТС(ТекущиеДанные.Идентификатор)
		Или ТекущиеДанные.ЭтоОператорItoolabs;
		
	ОтображатьДополнительныеИнструкции = ЭтоОблачнаяАТС(ТекущиеДанные.Идентификатор)
		Или ТекущиеДанные.ЭтоОператорItoolabs;
	Элементы.ИнструкцияПодключениеОператора.Видимость = ОтображатьДополнительныеИнструкции;
	Элементы.ИнструкцияПубликацияИБ.Видимость = ОтображатьДополнительныеИнструкции;

	Элементы.ПользователиТелефонииИсходящийНомер.Видимость =
		ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Яндекс");
	
	Элементы.ПользователиТелефонииВнутреннийИдентификаторВАТС.Видимость =
		ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Билайн");
	Элементы.ПользователиТелефонииВнутреннийНомер.РежимВыбораИзСписка =
		ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Билайн");
	
	ТекстПодсказкиМаршрутизацияШаблон = "%1
	|
	|%2";
	ТекстПодсказкиМаршрутизация = НСтр("ru='Входящий звонок клиента будет перенаправляться на закрепленного за ним ответственного (указывается в карточке контрагента).'");
	Если ТекущиеДанные.Идентификатор = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.MangoOffice") Тогда
		ТекстПодсказкиМаршрутизацияАТС = НСтр("ru='В личном кабинете Mango Office в окне настройки входящих линий необходимо добавить ""Звуковое приветствие"" с опцией ""Ожидать окончание - ДА"".'");
	Иначе
		ТекстПодсказкиМаршрутизацияАТС = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстПодсказкиМаршрутизацияАТС) Тогда
		Элементы.МаршрутизироватьВходящиеНаОтветственных.Подсказка = СтрШаблон(
			ТекстПодсказкиМаршрутизацияШаблон, ТекстПодсказкиМаршрутизация, ТекстПодсказкиМаршрутизацияАТС);
	Иначе
		Элементы.МаршрутизироватьВходящиеНаОтветственных.Подсказка = ТекстПодсказкиМаршрутизация;
	КонецЕсли;
	
	Если ЭтоМобильнаяТелефония(ИспользуемаяАТС) Тогда
		Элементы.МаршрутизироватьВходящиеНаОтветственных.Видимость = Ложь;
	Иначе
		Элементы.МаршрутизироватьВходящиеНаОтветственных.Видимость =
			ИспользоватьНастройкуМаршрутизацииЗвонковНаОтветственного(ИспользуемаяАТС);
	КонецЕсли;
	
	ОбновитьОтображениеКоличестваНеобрабатываемыхНомеров();

	Если ЭтоОблачнаяАТС(ИспользуемаяАТС) Тогда
		ПроверитьЗаполнениеНастроекИнтеграции(ИспользуемаяАТС);
		ПроверитьЗаполнениеПользователейТелефонии();
	КонецЕсли;
	
	УстановитьРазмерыЛоготипа(ТекущиеДанные.Идентификатор);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьРазмерыЛоготипа(ИдентификаторОператора)
	
	ШиринаЛоготипа = Новый Соответствие;
	ШиринаЛоготипа.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.МГТС"),            13);
	ШиринаЛоготипа.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ГарсТелеком"),     12);
	ШиринаЛоготипа.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.СибирскиеСети"),   12);
	ШиринаЛоготипа.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Авантел"),         17);
	ШиринаЛоготипа.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ДомRu"),           25);

	Если Не ЭтоВариантИнтерфейса85 Тогда
		ШиринаЛоготипа.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.MangoOffice"), 14);
	КонецЕсли;
	
	ШиринаЛоготипаОператора = ШиринаЛоготипа.Получить(ИдентификаторОператора);
	Если ШиринаЛоготипаОператора = Неопределено Тогда
		ШиринаЛоготипаОператора = 19;
	КонецЕсли;
	
	Элементы.ЛоготипПодключенногоОператора.Ширина = ШиринаЛоготипаОператора;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКоличестваНеобрабатываемыхНомеров()
	
	КоличествоНеобрабатываемыхНомеров = КоличествоНеобрабатываемыхНомеров();
	ЗаголовокКоманды = НСтр("ru='Необрабатываемые телефонные номера'");
	Если КоличествоНеобрабатываемыхНомеров > 0 Тогда
		ЗаголовокКоманды = СтрШаблон("%1 (%2)", ЗаголовокКоманды, Формат(КоличествоНеобрабатываемыхНомеров, "ЧГ=0"));
	КонецЕсли;
	
	Элементы.ОткрытьСписокНеобрабатываемыеТелефонныеНомера.Заголовок = ЗаголовокКоманды;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КоличествоНеобрабатываемыхНомеров()
	
	Возврат РегистрыСведений.НеобрабатываемыеТелефонныеНомера.КоличествоНомеров();
	
КонецФункции

&НаСервереБезКонтекста
Функция ИспользоватьНастройкуМаршрутизацииЗвонковНаОтветственного(ИспользуемаяАТС)

	Возврат ТелефонияСервер.ИспользоватьНастройкуМаршрутизацииЗвонковНаОтветственного(ИспользуемаяАТС);
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьЗначениеНастройкиИнтеграцииАТС(ТаблицаНастроек, Индекс)
	
	ЗаписатьЗначениеНастройкиИнтеграцииАТССервер(ТаблицаНастроек, Индекс);
	Оповестить("Телефония_ОбновлениеНастроек");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуПубликацииHttpСервисовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьЗначенияНастроек();
	
КонецПроцедуры

#Область РаботаСНастройками

&НаСервере
Процедура ЗаполнитьДействияОбработкиЗвонков()
	
	Элементы.ДействиеВходящийЗвонокИзвестногоАбонента.СписокВыбора.Добавить(
		"ОткрытьКарточкуАбонента", НСтр("ru='Открыть карточку контрагента'"));
	Элементы.ДействиеВходящийЗвонокИзвестногоАбонента.СписокВыбора.Добавить(
		"ОткрытьСобытие", НСтр("ru='Открыть событие-звонок'"));
	Элементы.ДействиеВходящийЗвонокИзвестногоАбонента.СписокВыбора.Добавить(
		"ОткрыватьСобытиеПриЗакрытииКарточкиАбонента", НСтр("ru='Сперва карточку контрагента, потом событие-звонок'"));
	
	Элементы.ДействиеВходящийЗвонокНеизвестногоАбонента.СписокВыбора.Добавить(
		"СозданиеКонтрагента", НСтр("ru='Создание контрагента'"));
	Элементы.ДействиеВходящийЗвонокНеизвестногоАбонента.СписокВыбора.Добавить(
		"СозданиеСобытия", НСтр("ru='Открытие события-звонка'"));
	Элементы.ДействиеВходящийЗвонокНеизвестногоАбонента.СписокВыбора.Добавить(
		"ЗадаватьВопрос", НСтр("ru='Задавать вопрос'"));
	
	Элементы.ДействиеИсходящийЗвонок.СписокВыбора.Добавить(
		"Вызов", НСтр("ru='Вызов'"));
	Элементы.ДействиеИсходящийЗвонок.СписокВыбора.Добавить(
		"ОткрытьСобытие", НСтр("ru='Открыть событие'"));
	Элементы.ДействиеИсходящийЗвонок.СписокВыбора.Добавить(
		"ОткрытьСобытиеИЗвонок", НСтр("ru='Открыть событие + вызов'"));
	
	Элементы.ДействиеПропущенныйЗвонок.СписокВыбора.Добавить(
		"ПоследнегоОтклонившегоЗвонок", НСтр("ru='Сотрудник отклонивший звонок последним'"));
	Элементы.ДействиеПропущенныйЗвонок.СписокВыбора.Добавить(
		"НазначитьСотрудника", НСтр("ru='Назначить сотрудника'"));
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЗначенияНастроек()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Константы.ИспользоватьОблачнуюТелефонию.Получить() Тогда
		ИспользуемаяАТС = Константы.ИспользуемаяАТС.Получить();
	ИначеЕсли Константы.ИспользоватьМобильнуюТелефонию.Получить() Тогда
		ИспользуемаяАТС = "МобильнаяТелефония";
	Иначе
		ИспользуемаяАТС = Неопределено;
	КонецЕсли;
	
	Если ИспользуемаяАТС = Перечисления.ДоступныеАТС.УниверсальныйItoolabs Тогда
		ИспользуемаяАТСДополнительно = Константы.ИспользуемаяАТСДополнительно.Получить();
	Иначе
		ИспользуемаяАТСДополнительно = "";
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
	НастройкиТелефонии = ТелефонияСервер.ПолучитьНастройкиТелефонии();
	МаршрутизироватьВходящиеНаОтветственных = НастройкиТелефонии.МаршрутизироватьВходящиеНаОтветственных;
	
	// MangoOffice
	НастройкиАТС_MangoOffice.Очистить();
	НоваяНастройка = НастройкиАТС_MangoOffice.Добавить();
	НоваяНастройка.Ключ = "URL";
	НоваяНастройка.Значение = ТелефонияСервер.АдресОбратногоВызоваОблачнаяТелефония(
		Перечисления.ДоступныеАТС.MangoOffice);
	
	НоваяНастройка = НастройкиАТС_MangoOffice.Добавить();
	НоваяНастройка.Ключ = "vpbx_api_key";
	НоваяНастройка.Значение = НастройкиТелефонии.vpbx_api_key;
	
	НоваяНастройка = НастройкиАТС_MangoOffice.Добавить();
	НоваяНастройка.Ключ = "vpbx_api_salt";
	НоваяНастройка.Значение = НастройкиТелефонии.vpbx_api_salt;
	
	// ДомRu
	НастройкиАТС_ДомRu.Очистить();
	НоваяНастройка = НастройкиАТС_ДомRu.Добавить();
	НоваяНастройка.Ключ = "АдресОблачнойАТС";
	НоваяНастройка.Значение = НастройкиТелефонии.АдресОблачнойАТС;
	
	НоваяНастройка = НастройкиАТС_ДомRu.Добавить();
	НоваяНастройка.Ключ = "КлючДляАвторизацииВОблачнойАТС";
	НоваяНастройка.Значение = НастройкиТелефонии.КлючДляАвторизацииВОблачнойАТС;
	
	НоваяНастройка = НастройкиАТС_ДомRu.Добавить();
	НоваяНастройка.Ключ = "URL";
	НоваяНастройка.Значение = ТелефонияСервер.АдресОбратногоВызоваОблачнаяТелефония(Перечисления.ДоступныеАТС.ДомRu);
	
	НоваяНастройка = НастройкиАТС_ДомRu.Добавить();
	НоваяНастройка.Ключ = "КлючДляАвторизацииВУНФ";
	НоваяНастройка.Значение = НастройкиТелефонии.КлючДляАвторизацииВУНФ;
	
	// Яндекс
	НастройкиАТС_Яндекс.Очистить();
	НоваяНастройка = НастройкиАТС_Яндекс.Добавить();
	НоваяНастройка.Ключ = "URL";
	НоваяНастройка.Значение = ТелефонияСервер.АдресОбратногоВызоваОблачнаяТелефония(
		Перечисления.ДоступныеАТС.Яндекс);
	
	НоваяНастройка = НастройкиАТС_Яндекс.Добавить();
	НоваяНастройка.Ключ = "КлючДляАвторизацииАТСЯндекс";
	НоваяНастройка.Значение = НастройкиТелефонии.КлючДляАвторизацииАТСЯндекс;
	
	// Ростелеком
	НастройкиАТС_Ростелеком.Очистить();
	
	НоваяНастройка = НастройкиАТС_Ростелеком.Добавить();
	НоваяНастройка.Ключ = "URL";
	НоваяНастройка.Значение = ТелефонияСервер.АдресОбратногоВызоваОблачнаяТелефония(
		Перечисления.ДоступныеАТС.Ростелеком);
	
	НоваяНастройка = НастройкиАТС_Ростелеком.Добавить();
	НоваяНастройка.Ключ = "УникальныйКодИдентификации";
	НоваяНастройка.Значение = НастройкиТелефонии.УникальныйКодИдентификации;
	
	НоваяНастройка = НастройкиАТС_Ростелеком.Добавить();
	НоваяНастройка.Ключ = "УникальныйКлючДляПодписи";
	НоваяНастройка.Значение = НастройкиТелефонии.УникальныйКлючДляПодписи;
	
	// ВестКоллСПб
	НастройкиАТС_ВестКоллСПб.Очистить();
	НоваяНастройка = НастройкиАТС_ВестКоллСПб.Добавить();
	НоваяНастройка.Ключ = "АдресОблачнойАТС";
	НоваяНастройка.Значение = НастройкиТелефонии.АдресОблачнойАТС;
	
	НоваяНастройка = НастройкиАТС_ВестКоллСПб.Добавить();
	НоваяНастройка.Ключ = "КлючДляАвторизацииВОблачнойАТС";
	НоваяНастройка.Значение = НастройкиТелефонии.КлючДляАвторизацииВОблачнойАТС;
	
	НоваяНастройка = НастройкиАТС_ВестКоллСПб.Добавить();
	НоваяНастройка.Ключ = "URL";
	НоваяНастройка.Значение = ТелефонияСервер.АдресОбратногоВызоваОблачнаяТелефония(
		Перечисления.ДоступныеАТС.ВестКоллСПб);
	
	НоваяНастройка = НастройкиАТС_ВестКоллСПб.Добавить();
	НоваяНастройка.Ключ = "КлючДляАвторизацииВУНФ";
	НоваяНастройка.Значение = НастройкиТелефонии.КлючДляАвторизацииВУНФ;
	
	// ДеловаяСетьИркутск
	НастройкиАТС_ДеловаяСетьИркутск.Очистить();
	НоваяНастройка = НастройкиАТС_ДеловаяСетьИркутск.Добавить();
	НоваяНастройка.Ключ = "АдресОблачнойАТС";
	НоваяНастройка.Значение = НастройкиТелефонии.АдресОблачнойАТС;
	
	НоваяНастройка = НастройкиАТС_ДеловаяСетьИркутск.Добавить();
	НоваяНастройка.Ключ = "КлючДляАвторизацииВОблачнойАТС";
	НоваяНастройка.Значение = НастройкиТелефонии.КлючДляАвторизацииВОблачнойАТС;
	
	НоваяНастройка = НастройкиАТС_ДеловаяСетьИркутск.Добавить();
	НоваяНастройка.Ключ = "URL";
	НоваяНастройка.Значение = ТелефонияСервер.АдресОбратногоВызоваОблачнаяТелефония(
		Перечисления.ДоступныеАТС.ДеловаяСетьИркутск);
	
	НоваяНастройка = НастройкиАТС_ДеловаяСетьИркутск.Добавить();
	НоваяНастройка.Ключ = "КлючДляАвторизацииВУНФ";
	НоваяНастройка.Значение = НастройкиТелефонии.КлючДляАвторизацииВУНФ;
	
	// Билайн
	НастройкиАТС_Билайн.Очистить();
	НоваяНастройка = НастройкиАТС_Билайн.Добавить();
	НоваяНастройка.Ключ = "КлючДляАвторизацииВАТСБилайн";
	НоваяНастройка.Значение = НастройкиТелефонии.КлючДляАвторизацииВАТСБилайн;
	
	НоваяНастройка = НастройкиАТС_Билайн.Добавить();
	НоваяНастройка.Ключ = "URL";
	НоваяНастройка.Значение = ТелефонияСервер.АдресОбратногоВызоваОблачнаяТелефония(
		Перечисления.ДоступныеАТС.Билайн);
	
	// Itoolabs
	НастройкиАТС_Itoolabs.Очистить();
	НоваяНастройка = НастройкиАТС_Itoolabs.Добавить();
	НоваяНастройка.Ключ = "АдресОблачнойАТС";
	НоваяНастройка.Значение = НастройкиТелефонии.АдресОблачнойАТС;
	
	НоваяНастройка = НастройкиАТС_Itoolabs.Добавить();
	НоваяНастройка.Ключ = "КлючДляАвторизацииВОблачнойАТС";
	НоваяНастройка.Значение = НастройкиТелефонии.КлючДляАвторизацииВОблачнойАТС;
	
	НоваяНастройка = НастройкиАТС_Itoolabs.Добавить();
	НоваяНастройка.Ключ = "URL";
	НоваяНастройка.Значение = ТелефонияСервер.АдресОбратногоВызоваОблачнаяТелефония(
		Перечисления.ДоступныеАТС.УниверсальныйItoolabs);
	
	НоваяНастройка = НастройкиАТС_Itoolabs.Добавить();
	НоваяНастройка.Ключ = "КлючДляАвторизацииВУНФ";
	НоваяНастройка.Значение = НастройкиТелефонии.КлючДляАвторизацииВУНФ;
	
	// Обработка звонка
	ДействиеВходящийЗвонокИзвестногоАбонента   = НастройкиТелефонии.ДействиеТекущегоЗвонкаНайденногоАбонента;
	ДействиеВходящийЗвонокНеизвестногоАбонента = НастройкиТелефонии.ДействиеТекущегоЗвонкаНеизвестногоАбонента;
	ДействиеИсходящийЗвонок                    = НастройкиТелефонии.ДействиеИсходящегоЗвонка;
	ДействиеПропущенныйЗвонок                  = НастройкиТелефонии.ДействиеПропущенногоЗвонка;
	СлужебныйПользователь                      = НастройкиТелефонии.СлужебныйПользовательДляПропущенногоЗвонка;
	
	АвтоматическаяОбработкаЗвонков = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	
	// Установка реквизитов формы
	ПризнакиИспользованияАТС = ПризнакиИспользованияАТС();
	
	Для Каждого ПризнакИспользуемойАТС Из ПризнакиИспользованияАТС Цикл
		ЭтотОбъект[ПризнакИспользуемойАТС.Ключ] = ИспользуемаяАТС = ПризнакИспользуемойАТС.Значение;
	КонецЦикла;
	
	ИспользоватьМобильнаяТелефония = ЭтоМобильнаяТелефония(ИспользуемаяАТС);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначениеНастройкиИнтеграцииАТССервер(ТаблицаНастроек, Индекс)
	
	Настройка = ЭтотОбъект[ТаблицаНастроек][Индекс];
	УдалитьСлужебныеСимволы(Настройка.Значение);
	
	ТелефонияСервер.УстановитьНастройкуТелефонии(Настройка.Ключ, Настройка.Значение);
	ПроверитьЗаполнениеНастроекИнтеграции(, ТаблицаНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначениеОбщейНастройкиТелефонии(Ключ, НовоеЗначение)
	
	ТелефонияСервер.УстановитьНастройкуТелефонии(Ключ, НовоеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПользователиТелефонии()
	
	НаборЗаписей = РегистрыСведений.НастройкиПользователейТелефонии.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ЗначениеВРеквизитФормы(НаборЗаписей, "ПользователиТелефонии");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПользователиТелефонии()
	
	НаборЗаписей = РеквизитФормыВЗначение("ПользователиТелефонии",
		Тип("РегистрСведенийНаборЗаписей.НастройкиПользователейТелефонии"));
	
	СтрокиКУдалению = Новый Массив;
	Для каждого Строка Из НаборЗаписей Цикл
		Если ЗначениеЗаполнено(Строка.Пользователь) Тогда
			Продолжить;
		КонецЕсли;
		СтрокиКУдалению.Добавить(Строка);
	КонецЦикла;
	
	Для каждого Строка Из СтрокиКУдалению Цикл
		НаборЗаписей.Удалить(Строка);
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеНастроекИнтеграции(АТС = Неопределено, ТаблицаНастроек = Неопределено)
	
	ИмяТаблицыНастроек = Неопределено;
	
	Если ТаблицаНастроек <> Неопределено Тогда
		ИмяТаблицыНастроек = ТаблицаНастроек;
	КонецЕсли;
	
	Если ИмяТаблицыНастроек = Неопределено И ЗначениеЗаполнено(АТС) Тогда
		ИмяТаблицыНастроек = ИмяТаблицыНастроек(АТС);
	КонецЕсли;
	
	Если ИмяТаблицыНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиЗаполнены = Истина;
	Для каждого Настройка Из ЭтотОбъект[ИмяТаблицыНастроек] Цикл
		Если НЕ ЗначениеЗаполнено(Настройка.Значение) Тогда
			НастройкиЗаполнены = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ГруппаСтраницаПараметрыИнтеграции.Картинка = ?(НастройкиЗаполнены,
		Новый Картинка, БиблиотекаКартинок.ПредупреждениеБаннер);
	Элементы.ГруппаБаннерПараметры.Видимость = Не НастройкиЗаполнены;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПользователейТелефонии()

	Элементы.ГруппаБаннерПользователиНеУказаны.Видимость         = Ложь;
	Элементы.ГруппаБаннерПользователиНеЗаполненыНомера.Видимость = Ложь;

	ПользователиНеУказаны =  ПользователиТелефонии.Количество() = 0;
	Если Не ПользователиНеУказаны Тогда
		
		ПользователиНеУказаныВоВсехСтроках = Истина;
		Для каждого НастройкаПользователя Из ПользователиТелефонии Цикл
			Если ЗначениеЗаполнено(НастройкаПользователя.Пользователь) Тогда
				ПользователиНеУказаныВоВсехСтроках = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПользователиНеУказаныВоВсехСтроках Тогда
			ПользователиНеУказаны = Истина;
		КонецЕсли;
	КонецЕсли;

	Если ПользователиНеУказаны Тогда 
		Элементы.ГруппаСтраницаПользователи.Картинка = БиблиотекаКартинок.ПредупреждениеБаннер;
		Элементы.ГруппаБаннерПользователиНеУказаны.Видимость = Истина;
		Возврат;
	КонецЕсли;

	ВнутренниеНомераЗаполнены = Истина;
	Для каждого НастройкаПользователя Из ПользователиТелефонии Цикл
		Если Не ЗначениеЗаполнено(НастройкаПользователя.ВнутреннийНомер) Тогда
			ВнутренниеНомераЗаполнены = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ВнутренниеНомераЗаполнены Тогда
		Элементы.ГруппаСтраницаПользователи.Картинка = БиблиотекаКартинок.ПредупреждениеБаннер;
		Элементы.ГруппаБаннерПользователиНеЗаполненыНомера.Видимость = Истина;
		Возврат;
	КонецЕсли;

	Элементы.ГруппаСтраницаПользователи.Картинка = Новый Картинка;
	
КонецПроцедуры

&НаСервере
Функция ИмяТаблицыНастроек(АТС)
	
	Если АТС = Перечисления.ДоступныеАТС.MangoOffice Тогда
		Возврат "НастройкиАТС_MangoOffice";
	ИначеЕсли АТС = Перечисления.ДоступныеАТС.ДомRu Тогда
		Возврат "НастройкиАТС_ДомRu";
	ИначеЕсли АТС = Перечисления.ДоступныеАТС.Яндекс Тогда
		Возврат "НастройкиАТС_Яндекс";
	ИначеЕсли АТС = Перечисления.ДоступныеАТС.Ростелеком Тогда
		Возврат "НастройкиАТС_Ростелеком";
	ИначеЕсли АТС = Перечисления.ДоступныеАТС.ВестКоллСПб Тогда
		Возврат "НастройкиАТС_ВестКоллСПб";
	ИначеЕсли АТС = Перечисления.ДоступныеАТС.ДеловаяСетьИркутск Тогда
		Возврат "НастройкиАТС_ДеловаяСетьИркутск";
	ИначеЕсли АТС = Перечисления.ДоступныеАТС.Билайн Тогда
		Возврат "НастройкиАТС_Билайн";
	ИначеЕсли АТС = Перечисления.ДоступныеАТС.Энфорта
		Или АТС = Перечисления.ДоступныеАТС.Мегафон
		Или АТС = Перечисления.ДоступныеАТС.ТТК
		Или АТС = Перечисления.ДоступныеАТС.ВестКоллМосква
		Или АТС = Перечисления.ДоступныеАТС.VirginConnect
		Или АТС = Перечисления.ДоступныеАТС.ГарсТелеком
		Или АТС = Перечисления.ДоступныеАТС.НаукаСвязь
		Или АТС = Перечисления.ДоступныеАТС.RiNet
		Или АТС = Перечисления.ДоступныеАТС.СибирскиеСети
		Или АТС = Перечисления.ДоступныеАТС.Авантел
		Или АТС = Перечисления.ДоступныеАТС.Гравител
		Или АТС = Перечисления.ДоступныеАТС.УниверсальныйItoolabs
		Или АТС = Перечисления.ДоступныеАТС.МГТС
		Или АТС = Перечисления.ДоступныеАТС.МТТ Тогда
		Возврат "НастройкиАТС_Itoolabs";
	Иначе
		ВызватьИсключение НСтр("ru='Неизвестное имя АТС.'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура УстановитьДоступностьЭлементов()

	РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	Элементы.НастройкаПубликацииСервисов.Видимость = Не РазделениеВключено;
	Элементы.ИнструкцияПубликацияИБ.Видимость      = Не РазделениеВключено;
	
	Элементы.СлужебныйПользователь.Видимость = ДействиеПропущенныйЗвонок <> "ПоследнегоОтклонившегоЗвонок";

	Если Не ЭтоПолноправныйПользователь Тогда
		Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;	
	СравнениеВерсий = ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(
		ОбщегоНазначенияКлиентСервер.ВерсияКонфигурацииБезНомераСборки(СистемнаяИнформация.ВерсияПриложения), "8.3.11");
		
	Элементы.АвтоматическаяОбработкаЗвонков.ТолькоПросмотр = СравнениеВерсий < 0;
	
	// Статические настройки.
	Элементы.АТС_ВестКоллСПб_КлючДляАвторизацииВУНФ.ТолькоПросмотр = Истина;
	Элементы.АТС_ВестКоллСПб_АдресУНФ.ТолькоПросмотр               = Истина;
	Элементы.АТС_Яндекс_АдресУНФ.ТолькоПросмотр                    = Истина;
	Элементы.АТС_ДомRu_КлючДляАвторизацииВУНФ.ТолькоПросмотр       = Истина;
	Элементы.АТС_ДомRu_АдресУНФ.ТолькоПросмотр                     = Истина;
	Элементы.АТС_MangoOffice_АдресОбратногоВызова.ТолькоПросмотр   = Истина;
	Элементы.АТС_Itoolabs_АдресУНФ.ТолькоПросмотр                  = Истина;
	Элементы.АТС_Itoolabs_КлючДляАвторизацииВУНФ.ТолькоПросмотр    = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПризнакиИспользованияАТС()
	
	ПризнакиИспользованияАТС = Новый Структура;
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_MangoOffice",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.MangoOffice"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_ДомRu",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ДомRu"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_Ростелеком",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Ростелеком"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_ВестКоллСПб",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ВестКоллСПб"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_ДеловаяСетьИркутск",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ДеловаяСетьИркутск"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_RiNet",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.RiNet"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_VirginConnect",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.VirginConnect"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_Авантел",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Авантел"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_ВестКоллМосква",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ВестКоллМосква"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_ГарсТелеком",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ГарсТелеком"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_Гравител",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Гравител"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_Мегафон",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Мегафон"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_НаукаСвязь",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.НаукаСвязь"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_СибирскиеСети",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.СибирскиеСети"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_ТТК",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ТТК"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_Энфорта",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Энфорта"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_МГТС",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.МГТС"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_МТТ",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.МТТ"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_Билайн",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Билайн"));
	ПризнакиИспользованияАТС.Вставить("ИспользоватьАТС_УниверсальныйItoolabs",
		ПредопределенноеЗначение("Перечисление.ДоступныеАТС.УниверсальныйItoolabs"));
	
	Возврат ПризнакиИспользованияАТС;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоОблачнаяАТС(АТС)
	
	Возврат ТипЗнч(АТС) = Тип("ПеречислениеСсылка.ДоступныеАТС");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоМобильнаяТелефония(АТС)
	
	Возврат АТС = "МобильнаяТелефония";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСлужебныеСимволы(Строка)
	
	Строка = СтрЗаменить(Строка, Символы.ПС, "");
	Строка = СокрЛП(Строка);
	Строка = СтрЗаменить(Строка, "¶", "");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИнструкцияПодключенияСсылка(АТС)
	
	СсылкиНаСтатьи = Новый Соответствие;
	
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.MangoOffice"),
		"https://its.1c.ru/db/metod81#content:6962:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ДомRu"),
		"https://its.1c.ru/db/metod81#content:6963:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Яндекс"),
		"https://its.1c.ru/db/metod81#content:6987:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Ростелеком"),
		"https://its.1c.ru/db/metod81#content:7316:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ВестКоллСПб"), 
		"https://its.1c.ru/db/metod81#content:6967:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ДеловаяСетьИркутск"),
		"https://its.1c.ru/db/metod81#content:6988:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Энфорта"),
		"https://its.1c.ru/db/metod81#content:7059:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Мегафон"),
		"https://its.1c.ru/db/metod81#content:7058:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ТТК"),
		"https://its.1c.ru/db/metod81#content:7060:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ВестКоллМосква"),
		"https://its.1c.ru/db/metod81#content:7061:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.VirginConnect"),
		"https://its.1c.ru/db/metod81#content:7062:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.ГарсТелеком"),
		"https://its.1c.ru/db/metod81#content:7063:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.НаукаСвязь"),
		"https://its.1c.ru/db/metod81#content:7064:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.RiNet"),
		"https://its.1c.ru/db/metod81#content:7065:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.СибирскиеСети"),
		"https://its.1c.ru/db/metod81#content:7066:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Авантел"),
		"https://its.1c.ru/db/metod81#content:7067:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Гравител"),
		"https://its.1c.ru/db/metod81#content:7068:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.МГТС"),
		"https://its.1c.ru/db/metod81#content:7279:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.МТТ"),
		"https://its.1c.ru/db/metod81#content:8111:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Билайн"),
		"https://its.1c.ru/db/metod81#content:8112:hdoc");
	СсылкиНаСтатьи.Вставить(ПредопределенноеЗначение("Перечисление.ДоступныеАТС.УниверсальныйItoolabs"),
		"https://its.1c.ru/db/metod81#content:7070:hdoc");
	СсылкиНаСтатьи.Вставить("МобильнаяТелефония",
		"https://its.1c.ru/db/metod81#content:6964:hdoc");
	
	Возврат СсылкиНаСтатьи.Получить(АТС);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИнструкцияПубликацииСервисаТелефонии()
	
	Возврат "https://its.1c.ru/db/metod81#content:6966:hdoc";
	
КонецФункции

&НаСервере
Процедура ОчиститьТокеныДоступа()
	
	ТелефонияСервер.ОчиститьТокеныДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодключениеОбсуждений()
	
	Продолжение = Новый ОписаниеОповещения("ПослеПодключенияОбсуждений", ЭтотОбъект);
	ОбсужденияКлиент.ПоказатьПодключение(Продолжение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияОбсуждений(Результат, ДополнительныеПараметры) Экспорт
	
	АвтоматическаяОбработкаЗвонков = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПользователейТелефонииНаКлиенте(ИспользуемаяАТС)

	Если ИспользуемаяАТС = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.Билайн")
		И НастройкиАТС_Билайн <> Неопределено
		И ЗначениеЗаполнено(НастройкиАТС_Билайн[0].Значение) Тогда
		
		СписокАбонентовВАТС = СписокАбонентовВАТС();

		Элементы.ГруппаПользователиТелефонии.ПодчиненныеЭлементы.ПользователиТелефонии.ПодчиненныеЭлементы.ПользователиТелефонииВнутреннийНомер.СписокВыбора.Очистить();
		Если СписокАбонентовВАТС <> Неопределено Тогда
			Для каждого Абонент Из СписокАбонентовВАТС Цикл
				Элементы.ГруппаПользователиТелефонии.ПодчиненныеЭлементы.ПользователиТелефонии.ПодчиненныеЭлементы.ПользователиТелефонииВнутреннийНомер.СписокВыбора.Добавить(Строка(Абонент.Представление), Строка(Абонент.Представление));
				СписокАбонентов.Добавить(Строка(Абонент.Представление), Строка(Абонент.Значение));
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокАбонентовВАТС()
	
	Возврат ТелефонияБилайн.ЗагрузитьДанныеПоАбонентам();
	
КонецФункции

&НаСервере
Процедура ПроверкаПодпискиНаСобытияАТСБилайн()
	
	ТелефонияБилайн.ПроверкаПодпискиНаСобытияАТС();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкуПодключенногоОператораВСписке()
	
	Для Каждого СтрокаОператора Из Операторы Цикл
		
		ЗначениеОтметки = Ложь;
		
		Если ЭтоОператорItoolabs(ИспользуемаяАТС) И СтрокаОператора.Идентификатор = ИспользуемаяАТСДополнительно Тогда
			ЗначениеОтметки = Истина;
		Иначе
			ЗначениеОтметки = СтрокаОператора.Идентификатор = ИспользуемаяАТС;
		КонецЕсли;
			
		СтрокаОператора.Подключен = ЗначениеОтметки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоОператорItoolabs(ИдентификаторОператора)
	
	Возврат ИдентификаторОператора = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.УниверсальныйItoolabs");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтключитьОператораНаСервере(ИдентификаторОператора)

	НачатьТранзакцию();
	
	Попытка
		
		ИспользуемаяАТС = Перечисления.ДоступныеАТС.ПустаяСсылка();
		Константы.ИспользуемаяАТС.Установить(ИспользуемаяАТС);
		Константы.ИспользуемаяАТСДополнительно.Установить("");
		Константы.ИспользоватьМобильнуюТелефонию.Установить(Ложь);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Отключение оператора: %1'"),
			ИдентификаторОператора);
				
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
		ОбщегоНазначения.СообщитьПользователю(
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
			
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодключитьОператораНаСервере(ИдентификаторОператора, ЭтоОператорItoolabs)

	Если Не ЗначениеЗаполнено(ИдентификаторОператора) Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	
	Попытка
		
		ЭтоОблачнаяАТС = ЭтоОблачнаяАТС(ИдентификаторОператора) Или ЭтоОператорItoolabs;
		
		ТелефонияСервер.СоздатьИзменитьСлужебногоПользователяТелефонии(ЭтоОблачнаяАТС);
		
		Константы.ИспользоватьОблачнуюТелефонию.Установить(ЭтоОблачнаяАТС);
		
		ИспользоватьРегламентноеОбновлениеПодпискиАТС = ЭтоОблачнаяАТС
			И ИдентификаторОператора = Перечисления.ДоступныеАТС.Билайн;
			
		Константы.ИспользоватьРегламентноеОбновлениеПодпискиАТС.Установить(
			ИспользоватьРегламентноеОбновлениеПодпискиАТС);
		
		Если ЭтоОблачнаяАТС(ИдентификаторОператора) Тогда
			КлючевойПараметрИспользуемойАТС = ИдентификаторОператора;
		ИначеЕсли ЭтоОператорItoolabs Тогда
			КлючевойПараметрИспользуемойАТС = Перечисления.ДоступныеАТС.УниверсальныйItoolabs;
		Иначе
			КлючевойПараметрИспользуемойАТС = Перечисления.ДоступныеАТС.ПустаяСсылка();
		КонецЕсли;
		
		Константы.ИспользуемаяАТС.Установить(КлючевойПараметрИспользуемойАТС);
		
		ИспользоватьМобильнаяТелефония = ЭтоМобильнаяТелефония(ИдентификаторОператора);
		Константы.ИспользоватьМобильнуюТелефонию.Установить(ИспользоватьМобильнаяТелефония);
		
		КлючевойПараметрДополнительнойАТС = ?(ЭтоОператорItoolabs, ИдентификаторОператора, "");
		Константы.ИспользуемаяАТСДополнительно.Установить(КлючевойПараметрДополнительнойАТС);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Выбор оператора: %1'"), ИдентификаторОператора); 
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
		
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагИспользованияВТаблице()
	
	СтрокаОператора = Неопределено;
	
	ПодключенныйОператор = ПодключенныйОператор();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Идентификатор", ПодключенныйОператор);
		
	НайденныеСтроки = Операторы.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() Тогда
		СтрокаОператора = НайденныеСтроки[0];
	КонецЕсли;

	Для Каждого ОбрабатываемаяСтрока Из Операторы Цикл
		ОбрабатываемаяСтрока.Подключен = ОбрабатываемаяСтрока = СтрокаОператора;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПодключенныйОператор()
	
	Результат = Неопределено;
	
	Если ИспользуемаяАТС = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ИспользуемаяАТС = ПредопределенноеЗначение("Перечисление.ДоступныеАТС.УниверсальныйItoolabs") Тогда
		Результат = ИспользуемаяАТСДополнительно;
	Иначе
		Результат = ИспользуемаяАТС;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиНаСтрокуПодключенногоОператора()
		
	ПодключенныйОператор = ПодключенныйОператор();
	Если ПодключенныйОператор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Идентификатор", ПодключенныйОператор);
	
	НайденныеСтроки = Операторы.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() Тогда
		СтрокаОператора = НайденныеСтроки[0];
		Элементы.Операторы.ТекущаяСтрока = СтрокаОператора.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
