&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Перечисления") Тогда	
		Перечисления.ЗагрузитьЗначения(СтрРазделить(Параметры.Перечисления, "|", Ложь));
	КонецЕсли;
	
	ВидимостьЭлементов85 = КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5;
	Элементы.ФормаЗакрыть.Видимость = Не ВидимостьЭлементов85;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(СтрСоединить(Перечисления.ВыгрузитьЗначения(), "|"));

КонецПроцедуры

