
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Наименование.ТолькоПросмотр = Объект.Предопределенный;
	Элементы.ГруппаУчастники.Видимость = Не Объект.Предопределенный;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Объект.Приоритет = ПолучитьНаименьшийДоступныйПриоритет();
	
	КонецЕсли;
	
	Если Объект.Предопределенный Тогда
		
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		
		ПараметрыСообщения.ТипСообщения = "Информация";
		ПараметрыСообщения.Скрываемый = Ложь;
		ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Маршрут без участников'");
		ПараметрыСообщения.Сообщение = НСтр("ru = 'Данный маршрут позволяет автоматически утверждать заявки на расход денег и не содержит участников'");
		
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
	
	КонецЕсли;
	
	Если Справочники.МаршрутыСогласованияЗаявок.МаршрутИспользуется(Объект.Ссылка) Тогда
		
		Элементы.ГруппаУчастники.ТолькоПросмотр = Истина;
		
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		
		ПараметрыСообщения.ТипСообщения = "Предупреждение";
		ПараметрыСообщения.Скрываемый = Ложь;
		ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Маршрут используется'");
		ПараметрыСообщения.Сообщение = НСтр("ru = 'По маршруту существуют несогласованные заявки. Редактирование таблицы участников невозможно.'");
		
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
		
	КонецЕсли;
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ПроверкиВыполнены") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаУчастникиИзменена И МаршрутИспользуется(Объект.Ссылка) Тогда

		Отказ = Истина;

		ТекстСообщения = НСтр(
			"ru = 'Нельзя записать маршрут, так как он используется в несогласованных заявках и была изменена таблица участников.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;

	КонецЕсли;
	
	Если Не ПриоритетУникален(Объект.Ссылка, Объект.Приоритет) Тогда
		
		Отказ = Истина;
		
		Кнопки	= Новый СписокЗначений;
		Кнопки.Добавить("УстановитьДоступныйПриоритет", НСтр("ru = 'Установить наименьший'"));
		Кнопки.Добавить("ВставитьПриоритет", НСтр("ru = 'Установить введенный'"));
		Кнопки.Добавить("Отмена", НСтр("ru = 'Отмена'"));
		
		ТекстВопроса = НСтр("ru = 'Введенный приоритет уже используется. Выберите действие:
								  |
								  |- Нажмите на кнопку ""Установить наименьший"", чтобы установить наименьший доступный приоритет.
								  |- Нажмите на кнопку ""Установить введенный"", чтобы установить введенный приоритет. Для сохранения уникальности приоритеты маршрутов будут смещены на 1.
								  |- Нажмите на кнопку ""Отмена"", чтобы продолжить редактирование маршрута.'");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьНовыйПриоритет", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , "УстановитьДоступныйПриоритет", НСтр("ru = 'Приоритет не уникален'"));
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ТаблицаУчастникиИзменена = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУчастникиМаршрута

&НаКлиенте
Процедура УчастникиМаршрутаПриИзменении(Элемент)
	ТаблицаУчастникиИзменена = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция МаршрутИспользуется(Ссылка)
	
	Возврат Справочники.МаршрутыСогласованияЗаявок.МаршрутИспользуется(Ссылка);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНаименьшийДоступныйПриоритет(НижняяГраницаПоиска = 0)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(СвободныеПриоритеты.Приоритет) КАК Приоритет
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПотенциальныеПриоритеты.Приоритет КАК Приоритет
		|	ИЗ
		|		(ВЫБРАТЬ
		|			МаршрутыСогласованияЗаявок.Приоритет + 1 КАК Приоритет
		|		ИЗ
		|			Справочник.МаршрутыСогласованияЗаявок КАК МаршрутыСогласованияЗаявок
		|
		|		ОБЪЕДИНИТЬ ВСЕ
		|
		|		ВЫБРАТЬ
		|			1) КАК ПотенциальныеПриоритеты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МаршрутыСогласованияЗаявок КАК МаршрутыСогласованияЗаявок1
		|			ПО ПотенциальныеПриоритеты.Приоритет = МаршрутыСогласованияЗаявок1.Приоритет
		|	ГДЕ
		|		МаршрутыСогласованияЗаявок1.Приоритет ЕСТЬ NULL
		|		И ПотенциальныеПриоритеты.Приоритет > &НижняяГраницаПоиска) КАК СвободныеПриоритеты";
	
	Запрос.УстановитьПараметр("НижняяГраницаПоиска", НижняяГраницаПоиска);
			
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Приоритет;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ВставитьПриоритет(Ссылка, НовыйПриоритет)
	
	ТекущийПриоритет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Приоритет");
	НаименьшийДоступныйПриоритет = ПолучитьНаименьшийДоступныйПриоритет(НовыйПриоритет);
	Если ТекущийПриоритет > НовыйПриоритет Тогда
		ВерхняяГраница = Мин(ТекущийПриоритет, НаименьшийДоступныйПриоритет);
	Иначе
		ВерхняяГраница = НаименьшийДоступныйПриоритет;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутыСогласованияЗаявок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МаршрутыСогласованияЗаявок КАК МаршрутыСогласованияЗаявок
		|ГДЕ
		|	МаршрутыСогласованияЗаявок.Приоритет МЕЖДУ &НижняяГраница И &ВерхняяГраница
		|	И МаршрутыСогласованияЗаявок.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("НижняяГраница", НовыйПриоритет);
	Запрос.УстановитьПараметр("ВерхняяГраница", ВерхняяГраница);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		МаршрутОбъект = Выборка.Ссылка.ПолучитьОбъект();
		МаршрутОбъект.Приоритет = МаршрутОбъект.Приоритет + 1;
		МаршрутОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет уникальность приоритета маршрута
//
// Параметры:
//  Маршрут		 - СправочникСсылка.МаршрутыСогласованияЗаявок - маршрут
//  Приоритет	 - Число - проверяемый приоритет
// 
// Возвращаемое значение:
//  Булево - признак уникальности приоритета 
// 
&НаСервереБезКонтекста
Функция ПриоритетУникален(Маршрут, Приоритет)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутыСогласованияЗаявок.Приоритет КАК Приоритет
		|ИЗ
		|	Справочник.МаршрутыСогласованияЗаявок КАК МаршрутыСогласованияЗаявок
		|ГДЕ
		|	МаршрутыСогласованияЗаявок.Приоритет = &Приоритет
		|	И МаршрутыСогласованияЗаявок.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	Запрос.УстановитьПараметр("Ссылка", Маршрут);
		
	Возврат Запрос.Выполнить().Пустой();

КонецФункции

&НаКлиенте
Процедура УстановитьНовыйПриоритет(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = "УстановитьДоступныйПриоритет" Тогда
		
		Объект.Приоритет = ПолучитьНаименьшийДоступныйПриоритет();
	
	ИначеЕсли РезультатЗакрытия = "ВставитьПриоритет" Тогда
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("ПроверкиВыполнены", Истина);
		
		Если Записать(ПараметрыЗаписи) Тогда
			ВставитьПриоритет(Объект.Ссылка, Объект.Приоритет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
