
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = НСтр("ru = 'Вывести список'");
	
	Если Параметры.Свойство("ИменаКолонокПоУмолчанию") Тогда
				
		Для Каждого ТекИмяКолонки Из Параметры.ИменаКолонокПоУмолчанию Цикл
			НоваяСтрокаТЗ = ТаблицаКолонок.Добавить(); 
			НоваяСтрокаТЗ.ИмяВыбираемойКолонки = ТекИмяКолонки; 
			НоваяСтрокаТЗ.Представление 		= ПредставлениеИмениКолонки(ТекИмяКолонки); 
			НоваяСтрокаТЗ.Выбрать 			= Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	АдаптацияТакси();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого СтрокаКоллекции Из ТаблицаКолонок Цикл  
		СтрокаКоллекции.Выбрать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для Каждого СтрокаКоллекции Из ТаблицаКолонок Цикл  
		СтрокаКоллекции.Выбрать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	РезультатЗакрытия = Новый Структура;
	РезультатЗакрытия.Вставить("ВыбранныеКолонки", ПолучитьВыбранныеКолонки()); 
	
	Закрыть(РезультатЗакрытия); 

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	СвойствоВидимость = "Видимость";  
	
	Интерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ИнтерфейсТакси = Не Интерфейс85;
	
	ОтображатьКоманднуюПанель = ИнтерфейсТакси;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКоманды", 
			СвойствоВидимость, ИнтерфейсТакси);
	
	Если ИнтерфейсТакси Тогда
		
		Элементы.Переместить(Элементы.ВыбратьВсе, Элементы.ТаблицаКолонокКоманднаяПанель, Элементы.ТаблицаКолонокПереместитьВверх);
		Элементы.Переместить(Элементы.СнятьВсе, Элементы.ТаблицаКолонокКоманднаяПанель, Элементы.ТаблицаКолонокПереместитьВверх);
			
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТаблицаКолонокВыбрать1", 
			"Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТаблицаКолонокДобавить", 
			"Видимость", Ложь);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПредставлениеИмениКолонки(Знач ТекИмяКолонки)
	
	Результат = СтрЗаменить(ТекИмяКолонки, "ТЧНоменклатура", "");
	Результат = СтрЗаменить(Результат, "_ЦенаДо", "_Цена старая"); 
	Результат = СтрЗаменить(Результат, "_ЦенаНовая", "_Цена новая");
	Результат = СтрЗаменить(Результат, "_", ", "); 
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Функция ПолучитьВыбранныеКолонки() 
	
	ВыбранныеКолонки = Новый Соответствие; 
	
	Для Каждого СтрокаКоллекции Из ТаблицаКолонок Цикл 
		
		ИмяВыбираемойКолонки = СтрЗаменить(СтрокаКоллекции.ИмяВыбираемойКолонки, "ТЧНоменклатура", "");
		ВыбранныеКолонки.Вставить(ИмяВыбираемойКолонки, СтрокаКоллекции.Выбрать);
		
	КонецЦикла;
	
	Возврат ВыбранныеКолонки;
	
КонецФункции

#КонецОбласти

