#Область ПрограммныйИнтерфейс

#Область Локализация

Процедура МодификацияРеквизитовФормы(Форма, ПараметрыИнтеграции, ДобавляемыеРеквизиты) Экспорт
	
	ДобавитьОбщиеНастройкиВстраивания(Форма, ПараметрыИнтеграции);
	ДобавитьРеквизитТекстСостояниеВЕТИС(Форма, ПараметрыИнтеграции, ДобавляемыеРеквизиты);
	
КонецПроцедуры

Процедура МодификацияЭлементовФормы(Форма) Экспорт
	
	СобытияФормИС.ВстроитьСтрокуИнтеграцииВДокументОснованиеПоПараметрам(Форма, "ВЕТИС.ДокументОснование");
	
КонецПроцедуры

Процедура ЗаполнениеРеквизитовФормы(Форма) Экспорт
	
	ИмяРеквизитаФормыОбъект = Форма.ПараметрыИнтеграцииГосИС.Получить("ВЕТИС").ИмяРеквизитаФормыОбъект;
	ПараметрыИнтеграции = Форма.ПараметрыИнтеграцииГосИС.Получить("ВЕТИС.ДокументОснование");
	
	СобытияФормИС.ЗаполнитьСтатусыОформленияУстановитьВидимостьПоНастройкам(
		Форма, ПараметрыИнтеграции, ИнтеграцияВЕТИСВызовСервера, ИмяРеквизитаФормыОбъект);
	
КонецПроцедуры

Процедура ОбновитьСтатусыОформления(Ссылка, ПараметрыИнтеграцииГосИС, РеквизитыФормыСтатусовОформления, Статусы) Экспорт
	
	Настройка = ПараметрыИнтеграцииГосИС.Получить("ВЕТИС.ДокументОснование");
	СобытияФормИС.ОбновитьСтатусыОформленияПоНастройке(
		Ссылка, Настройка, ИнтеграцияВЕТИСВызовСервера, РеквизитыФормыСтатусовОформления, Статусы);
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма) Экспорт
	
	СобытияФормВЕТИСПереопределяемый.ПослеЗаписиНаСервере(Форма);
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	СобытияФормВЕТИСПереопределяемый.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
	СобытияФормВЕТИСПереопределяемый.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	
КонецПроцедуры

#Область СобытияЭлементовФорм

// Серверная переопределяемая процедура, вызываемая из обработчика события элемента.
//
// Параметры:
//   Форма                   - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//   Элемент                 - Строка           - имя элемента-источника события "При изменении"
//   ДополнительныеПараметры - Структура        - значения дополнительных параметров влияющих на обработку.
//
Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры) Экспорт
	
	СобытияФормВЕТИСПереопределяемый.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОбщиеНастройкиВстраивания(Форма, ПараметрыИнтеграции)
	
	ОбщиеНастройки = СобытияФормИС.ОбщиеПараметрыИнтеграции("СобытияФормВЕТИС");
	ПараметрыИнтеграции.Вставить("ВЕТИС", ОбщиеНастройки);
	
КонецПроцедуры

// Встраивает реквизит - форматированную строку перехода к ВЕТИС в прикладные формы
// 
// Параметры:
//   Форма                - ФормаКлиентскогоПриложения - форма в которую происходит встраивание
//   ПараметрыИнтеграции  - См. ПараметрыИнтеграцииВЕТИС
//   ДобавляемыеРеквизиты - Массив Из РеквизитФормы - массив реквизитов формы к добавлению
//
Процедура ДобавитьРеквизитТекстСостояниеВЕТИС(Форма, ПараметрыИнтеграции, ДобавляемыеРеквизиты)
	
	Настройки = ПараметрыИнтеграцииВЕТИС(Форма);
	СобытияФормИС.НастроитьСтатусыДобавитьРеквизиты(
		Форма, "ВЕТИС.ДокументОснование", ПараметрыИнтеграции, Настройки, ДобавляемыеРеквизиты);
	
КонецПроцедуры

// Возвращает структуру, заполненную значениями по умолчанию, используемую для интеграции реквизитов ВЕТИС
//   в прикладные формы конфигурации - потребителя библиотеки ГосИС. Если передана форма - сразу заполняет ее
//   специфику в переопределяемом модуле.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма для которой возвращаются параметры интеграции
//
// ВозвращаемоеЗначение:
//   Структура - См. СобытияФормИС.ПараметрыИнтеграцииДляДокументаОснования.
//
Функция ПараметрыИнтеграцииВЕТИС(Форма)
	
	ПараметрыНадписи = СобытияФормИС.ПараметрыИнтеграцииДляДокументаОснования();
	ПараметрыНадписи.Ключ = "ЗаполнениеТекстаДокументаВЕТИС";
	ПараметрыНадписи.ИмяЭлементаФормы = "ТекстДокументаВЕТИС";
	ПараметрыНадписи.ИмяРеквизитаФормы = "ТекстДокументаВЕТИС";
	ПараметрыНадписи.Наименование = "ВетИС";
	ПараметрыНадписи.Идентификатор = "ГосИС_ФГИС";
	ПараметрыНадписи.Обработчик = "СобытияФормИСКлиент.СтатусОбработчикНажатия";
	
	Если НЕ(Форма = Неопределено) Тогда
		СобытияФормВЕТИСПереопределяемый.ПриОпределенииПараметровИнтеграцииВЕТИС(Форма, ПараметрыНадписи);
	КонецЕсли;
	
	Возврат ПараметрыНадписи;
	
КонецФункции

#КонецОбласти

