
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	Если ЭтоИнтерфейсТакси Тогда
		ПараметрыРазмещения.КоманднаяПанель = КоманднаяПанель;
	КонецЕсли;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		ОтборОрганизация = Параметры.Организация;
	Иначе
		ОтборОрганизация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
		Если Не ЗначениеЗаполнено(ОтборОрганизация) Тогда
			ОтборОрганизация = Справочники.Организации.ПредопределеннаяОрганизация();
		КонецЕсли;
	КонецЕсли;
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);

	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", ОтборОрганизация, , ,
		ЗначениеЗаполнено(ОтборОрганизация));
	НастроитьВидимостьИДоступность(); 
	
	УстановитьУсловноеОформление();
	УстановитьКоличествоФильтров(ЭтотОбъект);
	
	//УНФ.ОтборыСписка
	КоличествоДопФильтров =  ?(ЗначениеЗаполнено(ОтборОрганизация), 1, 0);
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список);
	РаботаСОтборами.СвернутьРазвернутьОтборыНаСервере(ЭтотОбъект, Истина); // отбор по организации всегда устанавливается
	
	АдаптацияТакси();
	
	Использование = ЗначениеЗаполнено(ОтборПериод.ДатаНачала) Или ЗначениеЗаполнено(ОтборПериод.ДатаОкончания);
	УстановитьОтборПоПериоду(ЭтотОбъект, ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания, Использование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		//УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		//Конец УНФ.ОтборыСписка
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	КоличествоФильтров = ?(ЗначениеЗаполнено(ОтборОрганизация), 1, 0) + ?(ЗначениеЗаполнено(ОтборПериод), 1, 0);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПредставлениеПериодаПриИзменении(Элемент)
	УстановитьКоличествоФильтров(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", ОтборОрганизация, , ,
		ЗначениеЗаполнено(ОтборОрганизация));
	НастроитьВидимостьИДоступность();
	
	КоличествоДопФильтров =  ?(ЗначениеЗаполнено(ОтборОрганизация), 1, 0);
	РаботаСОтборамиКлиентСервер.ОбновитьКоличествоФильтров(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИспользоватьОтчетностьНажатие(Элемент)
	
	НастроитьОрганизацияИспользуетсяОтчетность();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияУстановитьСдаватьОтчетностьНажатие(Элемент)
	
	НастроитьОрганизацияИспользуетсяОтчетность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОтборПериодНачалоВыбора_Завершение", ЭтотОбъект);
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Значение", НачалоПериода);
	ПараметрыОткрытия.Вставить("ЗапрашиватьРежимВыбораПериодаУВладельца", Ложь);
	ПараметрыОткрытия.Вставить("ВыбиратьВидПериода", Истина);
	ПараметрыОткрытия.Вставить("ВидыВыбираемыхПериодов", Новый Массив);
	ПараметрыОткрытия.ВидыВыбираемыхПериодов.Добавить("КВАРТАЛ");
	ПараметрыОткрытия.ВидыВыбираемыхПериодов.Добавить("ГОД");
	
	ОткрытьФорму("Документ.ЖурналУчетаСчетовФактур.Форма.ВыборПериода", 
		ПараметрыОткрытия,
		ЭтотОбъект, , , , Оповещение, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОтборПериодНачалоВыбора_Завершение", ЭтотОбъект);
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Значение", НачалоПериода);
	ПараметрыОткрытия.Вставить("ЗапрашиватьРежимВыбораПериодаУВладельца", Ложь);
	ПараметрыОткрытия.Вставить("ВыбиратьВидПериода", Истина);
	ПараметрыОткрытия.Вставить("ВидыВыбираемыхПериодов", Новый Массив);
	ПараметрыОткрытия.ВидыВыбираемыхПериодов.Добавить("КВАРТАЛ");
	ПараметрыОткрытия.ВидыВыбираемыхПериодов.Добавить("ГОД");
	
	ОткрытьФорму("Документ.ЖурналУчетаСчетовФактур.Форма.ВыборПериода", 
		ПараметрыОткрытия,
		ЭтотОбъект, , , , Оповещение, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры
	
	&НаКлиенте
Процедура ПредставлениеПериодаОчистка(Элемент, СтандартнаяОбработка)
	
	НачалоПериода = Дата(1, 1, 1);
	КонецПериода  = Дата(1, 1, 1);
	
	ОтборПериод.ДатаНачала = НачалоПериода;
	ОтборПериод.ДатаОкончания = КонецПериода;
	
	УстановитьОтборПоПериоду(ЭтотОбъект, НачалоПериода, КонецПериода, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;

КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Интерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	//ОтображатьКоманднуюПанель = Интерфейс85;
	Элементы.Список.ОтображатьКоманднуюПанель = Интерфейс85;
	
	Элементы.ИндексФильтрыТакси.Видимость = НЕ Интерфейс85;
	Элементы.ПредставлениеПериодаТакси.Видимость = НЕ Интерфейс85;
	
	Если Не Интерфейс85 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюПечатьОбычное_Элемент_Список_ЖурналУчетаСчетовФактур"
																	, "ПоложениеВКоманднойПанели", ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю);
	КонецЕсли;
	
	//Если Интерфейс85 Тогда
	//	Элементы.Переместить(Элементы.ГруппаГлобальныеКоманды, КоманднаяПанель);
	//	Элементы.Переместить(Элементы.ГруппаВажныеКоманды, КоманднаяПанель);
	//КонецЕсли;
	
	Элементы.ПредставлениеПериода.Видимость = Интерфейс85;
	Элементы.ИндексФильтры.Видимость = Интерфейс85;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьИДоступность()
	
	ВидимостьГруппыИспользуетсяОтчетность = Ложь;
	ВидимостьЭтоЮридическоеЛицо = Ложь;
	ВидимостьЭтоСамозанятый = Ложь;
	
	Если Не ОтборОрганизация.Пустая() Тогда
		ЗначенияРеквизитовСтруктура = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтборОрганизация, "ИспользуетсяОтчетность, ЮридическоеФизическоеЛицо, СтатусФизическогоЛица");
		Если ЗначенияРеквизитовСтруктура.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
			ВидимостьЭтоЮридическоеЛицо = Истина;
		ИначеЕсли ЗначенияРеквизитовСтруктура.СтатусФизическогоЛица = ПредопределенноеЗначение("Перечисление.СтатусыФизическихЛиц.Самозанятый") Тогда
			ВидимостьЭтоСамозанятый = Истина;
		ИначеЕсли Не ЗначенияРеквизитовСтруктура.ИспользуетсяОтчетность Тогда
			ВидимостьГруппыИспользуетсяОтчетность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ДекорацияЭтоЮридическоеЛицо.Видимость = ВидимостьЭтоЮридическоеЛицо;
	Элементы.ДекорацияЭтоСамозанятый.Видимость = ВидимостьЭтоСамозанятый;
	Элементы.ГруппаИспользуетсяОтчетность.Видимость = ВидимостьГруппыИспользуетсяОтчетность;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента 		= ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных("СписокОрганизация");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Организация", ВидСравненияКомпоновкиДанных.НеРавно, Справочники.Организации.ПустаяСсылка());
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодНачалоВыбора_Завершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РезультатВыбора.Период) Тогда
		НачалоПериода = Дата(1, 1, 1);
		КонецПериода  = Дата(1, 1, 1);
		
		ОтборПериод.ДатаНачала = НачалоПериода;
		ОтборПериод.ДатаОкончания = КонецПериода;
		
		УстановитьОтборПоПериоду(ЭтотОбъект, НачалоПериода, КонецПериода, Ложь);
		
		ПредставлениеПериода = НСтр("ru = 'Период: за все время'");
	
		Возврат;
		
	КонецЕсли;
	
	НачалоПериода = РезультатВыбора.Период;
	КонецПериода = ?(РезультатВыбора.Горизонт = "ГОД", КонецГода(НачалоПериода), КонецКвартала(НачалоПериода));
	
	ПредставлениеПериода = ПредставлениеПериода(
		НачалоПериода,
		КонецДня(КонецПериода),
		"ФП = Истина");
		
	ОтборПериод.ДатаНачала = НачалоПериода;
	ОтборПериод.ДатаОкончания = КонецПериода;

	УстановитьОтборПоПериоду(ЭтотОбъект, НачалоПериода, КонецПериода, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоПериоду(Форма, НачалоПериода, КонецПериода, Использование)
	
	ОтборКомпоновкиДанных = Форма.Список.КомпоновщикНастроек.Настройки.Отбор;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
		ОтборКомпоновкиДанных, , "ПериодДокумента");
		
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
		ОтборКомпоновкиДанных, , "Период");
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
		ОтборКомпоновкиДанных, "НалоговыйПериод");
	
	Если ДобавитьМесяц(НачалоПериода, 3) - 1 = КонецДня(КонецПериода) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ОтборКомпоновкиДанных, "НалоговыйПериод", ВидСравненияКомпоновкиДанных.Равно, НачалоКвартала(НачалоПериода), , Использование);
	Иначе
		ГруппаОтбораПериод = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ОтборКомпоновкиДанных, "ПериодДокумента", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораПериод, "НалоговыйПериод", ВидСравненияКомпоновкиДанных.БольшеИлиРавно, НачалоПериода, , Использование);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораПериод, "НалоговыйПериод", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, КонецПериода, , Использование);
	КонецЕсли;
	
	УстановитьКоличествоФильтров(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьКоличествоФильтров(Форма)
	
	Форма.КоличествоФильтров = ?(ЗначениеЗаполнено(Форма.ОтборОрганизация), 1, 0) + ?(ЗначениеЗаполнено(Форма.ОтборПериод), 1, 0);
	Форма.КоличествоФильтровИндекс = Форма.КоличествоФильтров;
	Форма.Элементы.ИндексФильтрыТакси.Заголовок = "(" + Строка(Форма.КоличествоФильтровИндекс) + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОрганизацияИспользуетсяОтчетность()
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ОтборОрганизация);
	ПараметрыОткрытия.Вставить("УстановитьТекущийЭлемент", "ИспользуетсяОтчетность");
	
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
// 

#КонецОбласти

#КонецОбласти