#Область ПрограммныйИнтерфейс

// Обновляет видимость и положение команд печати на форме.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма документа / Списка документов
Процедура ОбновитьСостояниеКомандПечатиПоУмолчанию(Форма) Экспорт
	
	ПечатныеФормы = Форма.СведенияОПечатныхФормах.Скопировать();
	Если ПечатныеФормы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПерваяГруппа = Неопределено;
	ОтключитьКнопкиРекурсивно(Форма.Элементы.ПодменюПечать, ПерваяГруппа);
	
	ПечатныеФормыКопия = ПечатныеФормы.Скопировать();

	Для Каждого ЭлементСпискаПечатныхФорм Из ПечатныеФормы Цикл
		ЭлементСпискаПечатныхФорм.Представление = Формат(ПечатныеФормы.Индекс(ЭлементСпискаПечатныхФорм), "ЧЦ=2; ЧВН=;");
	КонецЦикла;
	ПечатныеФормы.СортироватьПоПредставлению(НаправлениеСортировки.Убыв);
	Для Каждого ЭлементСпискаПечатныхФорм Из ПечатныеФормы Цикл
		ЭлементСпискаПечатныхФормКопия = ПечатныеФормыКопия.НайтиПоЗначению(ЭлементСпискаПечатныхФорм.Значение);
		Если ЭлементСпискаПечатныхФормКопия = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЭлементСпискаПечатныхФорм.Представление = ЭлементСпискаПечатныхФормКопия.Представление;
	КонецЦикла;
	
	Для Каждого ЭлементСпискаПечатныхФорм Из ПечатныеФормы Цикл
		Если ЭлементСпискаПечатныхФорм.Значение = "ПечатьПоУмолчаниюНастройка" Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКоманды = "";
		Команда = Форма.Команды.Найти(ЭлементСпискаПечатныхФорм.Значение);
		Если Команда = Неопределено Тогда 
			СтруктураПоиска = Новый Структура("ЗаголовокКоманды", ЭлементСпискаПечатныхФорм.Представление);
			СтрокиКомандПечати = Форма.СведенияОКомандахПечати.НайтиСтроки(СтруктураПоиска);
			Если СтрокиКомандПечати.Количество() > 0 Тогда
				ИмяКоманды = СтрокиКомандПечати[0].ИмяКоманды;
			КонецЕсли;
		Иначе
			ИмяКоманды = Команда.Имя;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяКоманды) Тогда
			Кнопка = Форма.Элементы.Найти(ИмяКоманды);
			Если Кнопка <> Неопределено Тогда
				Кнопка.Видимость = ЭлементСпискаПечатныхФорм.Пометка;
				#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
					Форма.Элементы.Переместить(Кнопка, Кнопка.Родитель, ПерваяГруппа);
				#КонецЕсли
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ГруппаПечатьПоУмолчанию = Форма.Элементы.ПодменюПечатьПоУмолчанию;
	ГруппаПечатьПоУмолчанию.Видимость = Истина;
	КнопкаПечатьПоУмолчанию = Форма.Элементы.ПечатьПоУмолчаниюНастройка;
	КнопкаПечатьПоУмолчанию.Видимость = Истина;
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Форма.Элементы.Переместить(ГруппаПечатьПоУмолчанию, ГруппаПечатьПоУмолчанию.Родитель);
	#КонецЕсли
	
КонецПроцедуры

// Процедура заполняет соответствие, где ключ - имя команды,
// а значение - ее заголовок.
//
// Параметры:
// КоллекцияКоманд - КомандыФормы - Коллекция команд формы (например, Форма.Команды).
//  
// Возвращаемое значение:
//   Соответствие из КлючИЗначение - - Заполненное соответствие команд и их заголовков:
//    * Ключ - Строка - Заголовок команды.
//    * Значение - Строка - имя команды 
//   
Функция СоответствиеЗаголовковИИменКоманд(КоллекцияКоманд) Экспорт
	
	Результат = Новый Соответствие;
	
	// Перебираем все команды в коллекции команд формы
	Для Каждого ТекущаяКоманда Из КоллекцияКоманд Цикл
		Результат.Вставить(ТекущаяКоманда.Заголовок,ТекущаяКоманда.Имя);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 


// Ищет команду в коллекции по ее заголовку.
//
// Параметры:
//  КоллекцияКоманд - КомандыФормы - Коллекция команд формы (например, Форма.Команды).
//  ЗаголовокДляПоиска - Строка - Заголовок команды, которую нужно найти.
//
// Возвращаемое значение:
//  КомандаФормы - Найденный объект команды или Неопределено, если ничего не найдено.
//
Функция НайтиКомандуПоЗаголовку(КоллекцияКоманд, ЗаголовокДляПоиска) Экспорт
	
	Для каждого Команда Из КоллекцияКоманд Цикл
		Если ВРег(Команда.Заголовок) = ВРег(ЗаголовокДляПоиска) Тогда
			Возврат Команда;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции


#Область СлужебныеПроцедурыИФункции

Процедура ОтключитьКнопкиРекурсивно(ПодменюПечать, ПерваяГруппа)
	Для Каждого ЭлементПечати Из ПодменюПечать.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ЭлементПечати) = Тип("ГруппаФормы") Тогда
			ОтключитьКнопкиРекурсивно(ЭлементПечати, ПерваяГруппа);
		Иначе
			ЭлементПечати.Видимость = Ложь;
			Если ПерваяГруппа = Неопределено Тогда
				ПерваяГруппа = ЭлементПечати.Родитель;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти