
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьИнтерфейсРежимаКассыСамообслуживания(Форма) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.ГруппаДанныеДляТекущейСтроки, Ложь);
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.СкидкаНаЧек, Ложь);
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.ГруппаРучнаяСкидкаНаТовар, Ложь);
	
	УстановитьДоступностьЭлементаФормы(ЭлементыФормы.СкидкаНаЧек, Ложь);
	УстановитьДоступностьЭлементаФормы(ЭлементыФормы.ГруппаДанныеДляТекущейСтроки, Ложь);
	
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.ГруппаВидОплатыПредоплата, Ложь);
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.ГруппаВидОплатыВыдачаНаличных, Ложь);
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.ГруппаВидОплатыЗачетАванса, Ложь);
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.ГруппаВидОплатыНСПК, Ложь);
	
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.ОтменаРасчетаСкидок, Ложь);
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.ГруппаВидОплатыВРассрочку, Ложь);
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.ГруппаВидОплатыКредитом, Ложь);
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.ГруппаВидОплатыБезнал, Ложь);
	УстановитьВидимостьЭлементаФормы(ЭлементыФормы.ГруппаВидОплатыЗаменаТоваров, Ложь);
	
	ПараметрыПлиточногоИнтерфейса = ПараметрыПлиточногоИнтерфейса();
	ВидимостьНоваяПокупка = (Форма.Объект.Товары.Количество() > 0)
		И Не (Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.Проверка);
	Если Не ЭлементыФормы.КнопкаНоваяПокупкаКСО.Видимость = ВидимостьНоваяПокупка Тогда
		УстановитьВидимостьЭлементаФормы(ЭлементыФормы.КнопкаНоваяПокупкаКСО, ВидимостьНоваяПокупка);
		УстановитьВидимостьЭлементаФормы(ЭлементыФормы.КнопкаНоваяПокупкаВПлиткеКСО, ВидимостьНоваяПокупка);
	КонецЕсли;
	
	ЭлементыФормы.ПодтвердитьВозраст.Картинка = БиблиотекаКартинок.ПодтверждениеДействияРМК;
	ЭлементыФормы.ОпровергнутьВозраст.Картинка = БиблиотекаКартинок.ОтказОтДействияРМК;
	
	ЭлементыФормы.ПродолжитьРаботуСЧеком.Картинка = БиблиотекаКартинок.ПодтверждениеДействияРМК;
	ЭлементыФормы.УдалитьЧекИзФормыЗапретаПродажи.Картинка = БиблиотекаКартинок.ОтказОтДействияРМК;

	КрупныйШрифт = ЭлементыФормы.СуммаИтого.Шрифт;
	ЭлементыФормы.ДекорацияВводПромокода.Заголовок = НСтр("ru = 'Просканируйте промокод'");
	ЭлементыФормы.ДекорацияВводПромокода.Шрифт = КрупныйШрифт;
	ЭлементыФормы.ДекорацияВводПромокода.Высота = 2;
	ЭлементыФормы.ОписаниеНайденнойСкидки.Шрифт = КрупныйШрифт;
	ЭлементыФормы.ОписаниеНайденнойСкидки.Высота = 2;
	
КонецПроцедуры

Процедура УстановитьВидимостьГруппыОперации(Элементы) Экспорт
	
	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаОперации, Истина);
	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаУправленияКСО, Истина);
	Элементы.ГруппаУправления.ТекущаяСтраница = Элементы.ГруппаСтраницаОперации;
	
КонецПроцедуры

Функция ПараметрыРазмеровКомандУправленияЧекомДляКСО() Экспорт
	
	ПараметрыИнтерфейсаКСО = ПараметрыИнтерфейсаКСО();
	ПараметрыПлиточногоИнтерфейса = ПараметрыПлиточногоИнтерфейса();
	ПараметрыРазмеров = Новый Структура;
	ПараметрыРазмеров.Вставить("ВысотаКоманды", ПараметрыИнтерфейсаКСО.ВысотаКоманды);
	ПараметрыРазмеров.Вставить("ШиринаКоманды", ПараметрыИнтерфейсаКСО.ШиринаКоманды);
	ПараметрыРазмеров.Вставить("ВысотаКомандыОперации", ПараметрыПлиточногоИнтерфейса.ВысотаКоманды);
	ПараметрыРазмеров.Вставить("ШиринаКомандыОперации", ПараметрыПлиточногоИнтерфейса.ШиринаКоманды);
	
	Возврат ПараметрыРазмеров;
	
КонецФункции

// Настраивает размеры команд управления составом чека.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма РМК.
//  ПараметрыРазмеровКоманд - структура:
//		* ВысотаКоманды - Число,
//		* ШиринаКоманды - Число,
//		* ВысотаКомандыОперации - Число,
//		* ШиринаКомандыОперации - Число.
//  Инициализация - Булево, устанавливать размеры команд, только при инициализации формы.
//
Процедура НастроитьРазмерКомандУправленияСоставомЧека(Форма, ПараметрыРазмеровКоманд, НастройкиЭлементов,
		Инициализация = Ложь) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	РежимПлитки = Форма.РежимПлитки;

	ВысотаКомандыОперации = ПараметрыРазмеровКоманд.ВысотаКомандыОперации;
	ШиринаКомандыОперации = ПараметрыРазмеровКоманд.ШиринаКомандыОперации;
	
	СтандартныеРазмеры = Новый Структура();
	СтандартныеРазмеры.Вставить("Ширина", ПараметрыРазмеровКоманд.ШиринаКоманды);
	СтандартныеРазмеры.Вставить("Высота", ПараметрыРазмеровКоманд.ВысотаКоманды);
	УстановитьФормуИРазмерыЭлементаСУчетомНастроек(ЭлементыФормы.УдалитьТовар, Форма,
		СтандартныеРазмеры, НастройкиЭлементов);
	
	УстановитьФормуИРазмерыЭлементаСУчетомНастроек(ЭлементыФормы.ТекущийТоварУменьшитьКоличество, Форма,
		СтандартныеРазмеры, НастройкиЭлементов);
	УстановитьФормуИРазмерыЭлементаСУчетомНастроек(ЭлементыФормы.ТекущийТоварУвеличитьКоличество, Форма,
		СтандартныеРазмеры, НастройкиЭлементов);
	УстановитьФормуИРазмерыЭлементаСУчетомНастроек(ЭлементыФормы.ПолучитьВес, Форма,
		СтандартныеРазмеры, НастройкиЭлементов);
		
	Если Не Форма.РежимПлитки Тогда
		СтандартныеРазмеры.Ширина = 0;
	КонецЕсли;
	УстановитьФормуИРазмерыЭлементаСУчетомНастроек(ЭлементыФормы.ТекущийТоварУстановитьДробноеКоличество, Форма,
		СтандартныеРазмеры, НастройкиЭлементов);
		
	СтандартныеРазмеры.Вставить("Высота", ВысотаКомандыОперации);
	СтандартныеРазмеры.Вставить("Ширина", ШиринаКомандыОперации);
	
КонецПроцедуры

Процедура НастроитьОтображениеКнопкиФормы(Форма, КнопкаФормы, НаборСвойств) Экспорт
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	УстановленЗаголовокДробноеКоличество = Ложь;
	ИмяКнопкиДробноеКоличество = "ТекущийТоварУстановитьДробноеКоличество";
	ФигураОвальная = "Овальная";
	Для Каждого СвойствоНабора Из НаборСвойств Цикл
		
		Если СвойствоНабора.Ключ = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ВысотаКнопок")
				И Не КнопкаФормы.Имя = "ПерейтиКОплате" Тогда
			РодительКнопки = КнопкаФормы.Родитель;
			Если ТипЗнч(РодительКнопки) = Тип("ГруппаФормы") И ЭтоИнтерфейс85
					И Не КнопкаФормы.Вид = ВидКнопкиФормы.Гиперссылка Тогда
				РодительКнопки.Высота = СвойствоНабора.Значение;
			ИначеЕсли Не КнопкаФормы.Вид = ВидКнопкиФормы.Гиперссылка Тогда
				КнопкаФормы.Высота = СвойствоНабора.Значение;
			КонецЕсли;
		ИначеЕсли СвойствоНабора.Ключ = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ШиринаКнопок") Тогда
			Если КнопкаФормы.Имя = "ПерейтиКОплате" Тогда
				Форма.Элементы.ДекорацияФиксацияШириныСтаканаОплаты.Ширина = СвойствоНабора.Значение;
			Иначе
				КнопкаФормы.Ширина = СвойствоНабора.Значение;
			КонецЕсли;
		ИначеЕсли СвойствоНабора.Ключ = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ФигураКнопок") Тогда
			КнопкаФормы.Фигура = ?(СвойствоНабора.Значение = ФигураОвальная, ФигураКнопки.Овал, ФигураКнопки.Обычная);
		ИначеЕсли СвойствоНабора.Ключ = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ЦветКнопок") Тогда
			Если Не КнопкаФормы.Вид = ВидКнопкиФормы.Гиперссылка Тогда
				КнопкаФормы.ЦветФона = СвойствоНабора.Значение;
			КонецЕсли;
		ИначеЕсли СвойствоНабора.Ключ = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ЦветШрифта") Тогда
			КнопкаФормы.ЦветТекста = СвойствоНабора.Значение;
		ИначеЕсли СвойствоНабора.Ключ = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ШрифтКнопок") Тогда
			КнопкаФормы.Шрифт = СвойствоНабора.Значение;
		ИначеЕсли СвойствоНабора.Ключ
				= ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ВеличинаДробногоКоличества") Тогда
				
			КнопкаФормы.Видимость = Истина;
			Если Не УстановленЗаголовокДробноеКоличество Тогда
				КнопкаФормы.Заголовок = Формат(СвойствоНабора.Значение, "ЧГ=");
			КонецЕсли;
				
		ИначеЕсли СвойствоНабора.Ключ = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ЗаголовокКнопки") Тогда
			КнопкаФормы.Заголовок = СвойствоНабора.Значение;
			Если КнопкаФормы.имя = ИмяКнопкиДробноеКоличество Тогда
				УстановленЗаголовокДробноеКоличество = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗначениеПерсональнойНастройки(НастройкиЭлементов, ИмяЭлемента, СвойствоНастройки) Экспорт
	
	РезультатФункции = Неопределено;
	
	Если (Не НастройкиЭлементов = Неопределено) Тогда
		НастройкиЭлемента = НастройкиЭлементов.Получить(ИмяЭлемента);
		Если Не НастройкиЭлемента = Неопределено Тогда
			
			РезультатФункции = НастройкиЭлемента.Получить(СвойствоНастройки);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура НастроитьВидГлавнойКнопкиПереходаКОплате(Форма, НастройкиЭлементов, ЭтоВозврат = Ложь,
		УникальныйВидОплаты = Ложь) Экспорт
		
	Элементы = Форма.Элементы;
	КнопкаОплаты = Элементы.ПерейтиКОплате;
	ДекорацияСложнаяОплата = Элементы.ДекорацияСложнаяОплата;
	
	Если УникальныйВидОплаты И Не ЭтоВозврат И Не Форма.РежимЗаказа Тогда
		Элементы.ГруппаУникальнойКнопкиОплаты.Видимость = Истина;
		КнопкаОплаты.Видимость = Ложь;
		ДекорацияСложнаяОплата.Видимость = Ложь;
	Иначе
		Элементы.ГруппаУникальнойКнопкиОплаты.Видимость = Ложь;
		НастроитьВидОбщейКнопкиПереходаКОплате(Форма, ЭтоВозврат, НастройкиЭлементов);
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьВидОбщейКнопкиПереходаКОплате(Форма, ЭтоВозврат, НастройкиЭлементов)
		
	КнопкаОплаты = Форма.Элементы.ПерейтиКОплате;
	ДекорацияСложнаяОплата = Форма.Элементы.ДекорацияСложнаяОплата;
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	РежимКСО = Форма.РежимКассыСамообслуживания;
	ФонКнопки = Новый Цвет();
	ОбычнаяКнопка = (РежимКСО Или ЭтоВозврат);
	ЭтоГруппаКарточка = (ЭтоИнтерфейс85 И (Не РежимКСО) И (Не ЭтоВозврат) И (Не Форма.РежимЗаказа));
	ЗаголовокКнопки = "";
	ЦветКнопки = Новый Цвет();
	Если РежимКСО Или Форма.РежимЗаказа Тогда
		ЗаголовокКнопки = НСтр("ru='Перейти к оплате'");
		ЦветКнопки = Форма.ЦветаФормы.ЦветГлавнойКнопки;
	ИначеЕсли ЭтоВозврат Тогда
		ЗаголовокКнопки = НСтр("ru='Продолжить'");
		ЦветКнопки = Форма.ЦветаФормы.ЦветГлавнойКнопки;
	Иначе
		ЗаголовокКнопки = НСтр("ru='Сложная оплата'");
		Если Не ЭтоИнтерфейс85 Тогда
			ЦветКнопки = WebЦвета.Белый;
		КонецЕсли;
	КонецЕсли;
	
	ТекущийЦветКнопки = КнопкаОплаты.ЦветФона;
	ТекущаяКнопкаКарточка = КнопкаОплаты.Родитель.ОтображатьКакКарточку;
	Если (Не ЭтоГруппаКарточка = ТекущаяКнопкаКарточка)
			Или ((Не ЭтоГруппаКарточка) И (Не ЦветКнопки = ТекущийЦветКнопки)) Тогда
			
		Если ЭтоГруппаКарточка Тогда
			КнопкаОплаты.Родитель.Высота = 3;
			КнопкаОплаты.Родитель.ОтображатьКакКарточку = Истина;
			КнопкаОплаты.Родитель.Гиперссылка = Истина;
			КнопкаОплаты.Видимость = Ложь;
			ДекорацияСложнаяОплата.Видимость = Истина;
			
		Иначе
			КнопкаОплаты.Родитель.Высота = ?(РежимКСО, 5, 3);
			КнопкаОплаты.МаксимальнаяВысота = КнопкаОплаты.Родитель.Высота;
			КнопкаОплаты.Родитель.ОтображатьКакКарточку = Ложь;
			КнопкаОплаты.Родитель.Гиперссылка = Ложь;
			КнопкаОплаты.Видимость = Истина;
			ДекорацияСложнаяОплата.Видимость = Ложь;
			
			КнопкаОплаты.ЦветФона = ЦветКнопки;
			НастройкиКнопкиОплаты = ?(НастройкиЭлементов = Неопределено, Неопределено,
				НастройкиЭлементов.Получить(КнопкаОплаты.Имя));
			Если РежимКСО И Не НастройкиКнопкиОплаты = Неопределено Тогда
				НастроитьОтображениеКнопкиФормы(Форма, КнопкаОплаты, НастройкиКнопкиОплаты);
				СкорректироватьВысотуКнопкиОплатыВРежимеКСО(КнопкаОплаты ,НастройкиКнопкиОплаты);
			КонецЕсли;
		КонецЕсли;
		КнопкаОплаты.Заголовок = ЗаголовокКнопки;
		
	ИначеЕсли Не (КнопкаОплаты.Видимость Или ДекорацияСложнаяОплата.Видимость) Тогда
		
		Если ЭтоГруппаКарточка Тогда
			ДекорацияСложнаяОплата.Видимость = Истина;
		Иначе
			КнопкаОплаты.Видимость = Истина;
		КонецЕсли;
		КнопкаОплаты.Заголовок = ЗаголовокКнопки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьФормуИРазмерыЭлементаСУчетомНастроек(ЭлементФормы, Форма, СтандартныеРазмеры,
		НастройкиЭлементов) Экспорт
		
	РежимПлитки = Форма.РежимПлитки;
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	
	СвойствоВысота = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ВысотаКнопок");
	СвойствоШирина = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ШиринаКнопок");
	СвойствоФигура = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ФигураКнопок");
	СвойствоЦвет = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ЦветКнопок");
	СвойствоШрифт = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ШрифтКнопок");
	
	ФигураЭлемента = ФигураКнопки.Авто;
	АвтоШрифт = Новый Шрифт();
	ЦветЭлемента = Новый Цвет();
	ШрифтЭлемента = АвтоШрифт;
	Если ЭлементФормы = Форма.Элементы.ТекущийТоварУстановитьДробноеКоличество Тогда
		ШрифтЭлемента = Форма.Элементы.ТекущийТоварУстановитьДробноеКоличество.Шрифт;
	КонецЕсли;
	ВысотаЭлемента = СтандартныеРазмеры.Высота;
	ШиринаЭлемента = СтандартныеРазмеры.Ширина;
	НаборСвойствИндивидуальный = Неопределено;
	Если РежимПлитки И Не Форма.РежимКассыСамообслуживания Тогда
		НаборСвойств = НастройкиЭлементов.Получить(ЗаголовкиОбластей.ПлиточныйИнтерфейс);
		Если Форма.РежимКассыСамообслуживания Тогда
			НаборСвойствИндивидуальный = НастройкиЭлементов.Получить(ЭлементФормы.Имя);
		КонецЕсли;
	Иначе
		НаборСвойств = НастройкиЭлементов.Получить(ЭлементФормы.Имя);
	КонецЕсли;
	Если Не НаборСвойств = Неопределено Тогда
		ЗначениеВысоты = НаборСвойств.Получить(СвойствоВысота);
		ЗначениеШирины = НаборСвойств.Получить(СвойствоШирина);
		Если РежимПлитки И Не НаборСвойствИндивидуальный = Неопределено Тогда
			ЗначениеШириныИндивидуальное = НаборСвойствИндивидуальный.Получить(СвойствоШирина);
			Если ЗначениеЗаполнено(ЗначениеШириныИндивидуальное) Тогда
				ЗначениеШирины = ЗначениеШириныИндивидуальное;
			КонецЕсли;
		КонецЕсли;
		ЗначениеФигуры = НаборСвойств.Получить(СвойствоФигура);
		ЗначениеЦвета = НаборСвойств.Получить(СвойствоЦвет);
		ЗначениеШрифта = НаборСвойств.Получить(СвойствоШрифт);
		Если ЗначениеЗаполнено(ЗначениеВысоты) Тогда
			ВысотаЭлемента = ЗначениеВысоты;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗначениеШирины) Тогда
			ШиринаЭлемента = ЗначениеШирины;
		КонецЕсли;
		Если Не ЗначениеФигуры = Неопределено И Не ЗначениеФигуры = "Авто" Тогда
			ФигураЭлемента = ?(ЗначениеФигуры = "Овальная", ФигураКнопки.Овал, ФигураКнопки.Обычная);
		КонецЕсли;
		Если Не ЗначениеЦвета = Неопределено Тогда
			ЦветЭлемента = ЗначениеЦвета;
		КонецЕсли;
		Если Не ЗначениеШрифта = Неопределено И Не ЗначениеШрифта = АвтоШрифт Тогда
			ШрифтЭлемента = ЗначениеШрифта;
		КонецЕсли;
	КонецЕсли;
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		ЭлементФормы.Высота = ВысотаЭлемента;
	КонецЕсли;
	ЭлементФормы.Ширина = ШиринаЭлемента;
	ЭлементФормы.ЦветФона = ЦветЭлемента;
	ЭлементФормы.Фигура = ФигураЭлемента;
	ЭлементФормы.Шрифт = ШрифтЭлемента;
	
КонецПроцедуры

Функция ПолучитьЗначениеСвойстваИзНастроек(ИмяЭлемента, НастройкиЭлементов, СвойствоЭлементов) Экспорт
	
	ЗначениеСвойства = Неопределено;
	
	НаборСвойств = НастройкиЭлементов.Получить(ИмяЭлемента);
	Если Не НаборСвойств = Неопределено Тогда
		ЗначениеСвойства = НаборСвойств.Получить(СвойствоЭлементов);
	КонецЕсли;
	
	Возврат ЗначениеСвойства;
	
КонецФункции

Процедура УстановитьШиринуЭлементаПриОтсутствииПерсональнойНастройки(НастройкиЭлементов, ЭлементФормы, Ширина) Экспорт
	
	СвойствоШирина = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ШиринаКнопок");
	ШиринаИзНастроек = ПолучитьЗначениеСвойстваИзНастроек(ЭлементФормы.Имя, НастройкиЭлементов, СвойствоШирина);
	Если Не ЗначениеЗаполнено(ШиринаИзНастроек) Тогда
		ЭлементФормы.Ширина = Ширина;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВысотуЭлементаПриОтсутствииПерсональнойНастройки(НастройкиЭлементов, ЭлементФормы, Высота) Экспорт
	
	СвойствоВысота = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ВысотаКнопок");
	ВысотаИзНастроек = ПолучитьЗначениеСвойстваИзНастроек(ЭлементФормы.Имя, НастройкиЭлементов, СвойствоВысота);
	Если Не ЗначениеЗаполнено(ВысотаИзНастроек) Тогда
		ЭлементФормы.Высота = Высота;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗаголовкиОбластейДляНастроек() Экспорт
	
	ЗаголовкиОбластей = Новый Структура();
	
	ЗаголовкиОбластей.Вставить("ОбластьПанельОпераций", НСтр("ru = 'Панель операций'"));
	ЗаголовкиОбластей.Вставить("ОбластьОплатить", НСтр("ru = 'Оплатить'"));
	ЗаголовкиОбластей.Вставить("ОбластьДанныеТекущегоТовара", НСтр("ru = 'Данные текущего товара'"));
	ЗаголовкиОбластей.Вставить("ОбластьСписокТоваров", НСтр("ru = 'Список товаров'"));
	ЗаголовкиОбластей.Вставить("ПлиточныйИнтерфейс", НСтр("ru = 'ПлиточныйИнтерфейс'"));
	ЗаголовкиОбластей.Вставить("ВвестиДанныеПокупателя", НСтр("ru = 'ВвестиДанныеПокупателя'"));
	
	Возврат ЗаголовкиОбластей;
	
КонецФункции

Функция ПолучитьЭлементыОбластиПанельОпераций() Экспорт
	
	ЭлементыОбласти = Новый Массив;
	
	ЭлементыОбласти.Добавить("ОткрытьПлиточныйИнтерфейсКаталога");
	ЭлементыОбласти.Добавить("НастройкаВводаПоСтрокеОткрытьНастройки");
	ЭлементыОбласти.Добавить("Каталог");
	ЭлементыОбласти.Добавить("НайтиВЧеке");
	ЭлементыОбласти.Добавить("ПереключательДействующиеСкидки");
	ЭлементыОбласти.Добавить("ПечатьСкидок");
	ЭлементыОбласти.Добавить("НайтиПоШтрихкодуКСО");
	ЭлементыОбласти.Добавить("СкидкаНаЧек");
	ЭлементыОбласти.Добавить("УправляемыеСкидки");
	ЭлементыОбласти.Добавить("СборкаПоЗаказу");
	ЭлементыОбласти.Добавить("ВвестиКомментарийКЧеку");
	ЭлементыОбласти.Добавить("ОтменитьИзмененияЧека");
	ЭлементыОбласти.Добавить("ОтложитьЧек");
	ЭлементыОбласти.Добавить("УдалитьЧек");
	ЭлементыОбласти.Добавить("КомандаРежим");
	ЭлементыОбласти.Добавить("КомандаЕще");
	ЭлементыОбласти.Добавить("ДобавитьПродавцаВРежимеПлитки");
	
	Возврат ЭлементыОбласти;
	
КонецФункции

Функция ПолучитьЭлементыОбластиОплатить() Экспорт
	
	ЭлементыОбласти = Новый Массив;
	ЭлементыОбласти.Добавить("ПерейтиКОплате");
	ЭлементыОбласти.Добавить("ПерейтиВОплату");
	
	Возврат ЭлементыОбласти;
	
КонецФункции

Функция ПолучитьЭлементыОбластиДанныхТекущегоТовара() Экспорт
	
	ЭлементыОбласти = Новый Массив;
	
	ЭлементыОбласти.Добавить("ЗапроситьБалансСертификата");
	ЭлементыОбласти.Добавить("УдалитьТовар");
	ЭлементыОбласти.Добавить("ПоказатьОстатки");
	ЭлементыОбласти.Добавить("ТекущийТоварУменьшитьКоличество");
	ЭлементыОбласти.Добавить("ТекущийТоварУвеличитьКоличество");
	ЭлементыОбласти.Добавить("ТекущийТоварУстановитьДробноеКоличество");
	ЭлементыОбласти.Добавить("ПолучитьВес");
	ЭлементыОбласти.Добавить("ТекущийТоварСкидкаПереключатель");
	ЭлементыОбласти.Добавить("СкидкаНаЧекПроцентом");
	ЭлементыОбласти.Добавить("СкидкаНаЧекСуммой");
	
	Возврат ЭлементыОбласти;
	
КонецФункции

Функция ПараметрыРазмеровИнтерфейса() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ШиринаПолейОплат", 9);
	РезультатФункции.Вставить("ШиринаПанелиВидовОплат", 25);
	РезультатФункции.Вставить("ШиринаИнтервалов", 4);
	РезультатФункции.Вставить("ШиринаКнопокОплатыСтандартная", 12);
	РезультатФункции.Вставить("ШиринаПанелиДанныхПокупателя", 24);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура НастроитьРазмерыКомандВРежимеКассыСамообслуживания(Форма, НастройкиЭлементов) Экспорт
	
	ПараметрыИнтерфейсаКСО = ПараметрыИнтерфейсаКСО();
	ПараметрыПлиточногоИнтерфейса = ПараметрыПлиточногоИнтерфейса();
	ВысотаКоманд = ПараметрыИнтерфейсаКСО.ВысотаКоманды;
	ШиринаКоманд = ПараметрыИнтерфейсаКСО.ШиринаКоманды;
	ВысотаКомандГруппыОперации = ПараметрыПлиточногоИнтерфейса.ВысотаКоманды;
	ШиринаКомандГруппыОперации = ПараметрыПлиточногоИнтерфейса.ШиринаКомандыСНадписью;
	ЭлементыФормы = Форма.Элементы;
	
	ЗаголовкиОбластей = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьЗаголовкиОбластейДляНастроек();
	НаборСвойствПлитки = НастройкиЭлементов.Получить(ЗаголовкиОбластей.ПлиточныйИнтерфейс);
	СвойствоВысота = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ВысотаКнопок");
	
	ЗначениеВысоты = Неопределено;
	Если Не НаборСвойствПлитки = Неопределено Тогда
		ЗначениеВысоты = НаборСвойствПлитки.Получить(СвойствоВысота);
	КонецЕсли;
	
	УстановитьВысотуЭлементаПриОтсутствииПерсональнойНастройки(НастройкиЭлементов,
		ЭлементыФормы.ОплатаКартой, ВысотаКоманд);
	УстановитьВысотуЭлементаПриОтсутствииПерсональнойНастройки(НастройкиЭлементов,
		ЭлементыФормы.ОплатаСБП, ВысотаКоманд);
	УстановитьВысотуЭлементаПриОтсутствииПерсональнойНастройки(НастройкиЭлементов,
		ЭлементыФормы.ОплатаСертификатом, ВысотаКоманд);
	УстановитьВысотуЭлементаПриОтсутствииПерсональнойНастройки(НастройкиЭлементов,
		ЭлементыФормы.ОплатаБонусами, ВысотаКоманд);
	//УстановитьВысотуЭлементаПриОтсутствииПерсональнойНастройки(НастройкиЭлементов,
	//	ЭлементыФормы.ОтменитьВводКарты, ВысотаКоманд);
	
КонецПроцедуры

Процедура ВывестиОшибкуОткрытияРабочегоМеста(Элементы, ТекстЗаголовка, ТекстСообщения) Экспорт

	ПараметрыИнтерфейса = ПараметрыИнтерфейсаКСО();
	ВысотаКоманд = ПараметрыИнтерфейса.ВысотаКоманды;
	ШиринаКоманд = ПараметрыИнтерфейса.ШиринаКоманды;
	
	УстановитьВидимостьГруппыОперации(Элементы);
	Элементы.УдалитьЧек.Картинка = БиблиотекаКартинок.ЗавершитьРаботу;
	Элементы.УдалитьЧек.Высота = ВысотаКоманд;
	Элементы.УдалитьЧек.Ширина = ШиринаКоманд;
	Элементы.УдалитьЧек.Отображение = ОтображениеКнопки.Картинка;
	УстановитьДоступностьЭлементаФормы(Элементы.УдалитьЧек, Истина);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаОперации, Истина);
	
	ЭлементыИсключения = Новый Массив;
	ЭлементыИсключения.Добавить(Элементы.ПодгруппаУдалитьЧек);
	ЭлементыИсключения.Добавить(Элементы.Декорация1);
	ЭлементыИсключения.Добавить(Элементы.ДекорацияРастяжениеСправа);
	ЭлементыИсключения.Добавить(Элементы.ПодгруппаЧасы);
	ЭлементыИсключения.Добавить(Элементы.ПодгруппаСтатусы);
	ЭлементыИсключения.Добавить(Элементы.ДекорацияСтатусСмены);
	
	Для Каждого ЭлементГруппы Из Элементы.ГруппаОперации.ПодчиненныеЭлементы Цикл
		Если ЭлементыИсключения.Найти(ЭлементГруппы) = Неопределено Тогда
			УстановитьВидимостьЭлементаФормы(ЭлементГруппы, Ложь);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияРМККлиентСервер.УстановитьТекущуюСтраницу(Элементы.СтраницаЗавершение);
	Элементы.ЗаголовокОшибкиВхода.Заголовок = ТекстЗаголовка;
	Элементы.ТекстОшибкиВхода.Заголовок = ТекстСообщения;
	
КонецПроцедуры

Процедура УстановитьРежимРаботыПустойЧек(Форма) Экспорт
	
	Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.ЧекПустой;
	НастроитьПанельУправленияЧекомВРежимеВводаТоваров(Форма, Форма.Элементы);
	
КонецПроцедуры

Функция ЭтоЭтапРаботыСОплатой(Форма) Экспорт
	
	РезультатФункции = (Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.Оплата
		Или Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.ПереходКОплате);
	Возврат РезультатФункции;
	
КонецФункции

Функция ЭтоЭтапРаботыДоОплаты(Форма) Экспорт
	
	РезультатФункции = (Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.ЧекПустой
		Или Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.ВводТоваров);
	Возврат РезультатФункции;
	
КонецФункции

Процедура НастроитьДоступностьМаркетинговыхКомандПоЭтапуРаботыСЧеком(Форма, ЭтоОперацияПродажи) Экспорт
	
	Элементы = Форма.Элементы;
	РежимРаботыСЧеком = Форма.РежимРаботыСЧеком;
	РежимыРаботыСЧеком = Форма.РежимыРаботыСЧеком;
	ДоступностьЭлементов = (Не (РежимРаботыСЧеком = РежимыРаботыСЧеком.Оплата));
	УстановитьДоступностьЭлементаФормы(Элементы.РассчитатьСкидки, ДоступностьЭлементов);
	УстановитьДоступностьЭлементаФормы(Элементы.ОтменаРасчетаСкидок,
		ДоступностьЭлементов И Форма.СкидкиРассчитаны);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаПромокоды, ДоступностьЭлементов);
	УстановитьДоступностьЭлементаФормы(Элементы.ВвестиДанныеПокупателя, Истина);
	УстановитьДоступностьЭлементаФормы(Элементы.ОплатаБонусами, ДоступностьЭлементов И Форма.БонусыДоступноКОплате > 0);
	
КонецПроцедуры

Процедура НастроитьДоступностьГруппДанныхПокупателя(Форма) Экспорт
	
	ДоступностьДанных = (Не Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.Оплата);
	ДанныеКартыЗаполнены = ДанныеДисконтнойКартыЗаполнены(Форма);
	Элементы = Форма.Элементы;
	
КонецПроцедуры

Процедура НастроитьДоступностьЭлементовФормыПриПереключенииРежима(Форма,
	ЭтоОперацияПродажи,
	НастроитьМаркетинговыеКоманды = Истина) Экспорт
	
	Элементы = Форма.Элементы;
	ДоступностьЭлементов = (Не ЭтоЭтапРаботыСОплатойИлиКоррекцией(Форма));
	ДоступностьГруппыТоваров = (Не ЭтоЭтапРаботыСОплатой(Форма));
	НастроитьДоступностьЭлементовГруппыОперацииКромеОтложитьУдалить(Элементы, ДоступностьЭлементов);
	УстановитьДоступностьЭлементаФормы(Элементы.СменитьКассира, ДоступностьЭлементов);
	УстановитьДоступностьЭлементаФормы(Элементы["СменитьКассира_Карточка"], ДоступностьЭлементов);
	УстановитьДоступностьЭлементаФормы(Элементы.ГруппаЛево, ДоступностьГруппыТоваров);
	Если НастроитьМаркетинговыеКоманды Тогда
		НастроитьДоступностьМаркетинговыхКомандПоЭтапуРаботыСЧеком(Форма, ЭтоОперацияПродажи);
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьДоступностьЭлементовГруппыОперацииКромеОтложитьУдалить(Элементы, ДоступностьЭлементов) Экспорт
	
	ЭлементыИсключения = Новый Массив;
	ЭлементыИсключения.Добавить(Элементы.ПодгруппаУдалитьЧек);
	ЭлементыИсключения.Добавить(Элементы.ПодгруппаОтложитьЧек);
	ЭлементыИсключения.Добавить(Элементы.ПодгруппаВвестиКомментарийКЧеку);
	ЭлементыИсключения.Добавить(Элементы.ПодгруппаЧасы);
	ЭлементыИсключения.Добавить(Элементы.ПодгруппаСтатусы);
	ЭлементыИсключения.Добавить(Элементы.ДекорацияСтатусСмены);
	ЭлементыИсключения.Добавить(Элементы.ПодгруппаОперации3);
	
	Для Каждого ЭлементГруппы Из Элементы.ГруппаОперации.ПодчиненныеЭлементы Цикл
		Если ЭлементыИсключения.Найти(ЭлементГруппы) = Неопределено Тогда
			УстановитьДоступностьЭлементаФормы(ЭлементГруппы, ДоступностьЭлементов);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВосстановитьКнопкиВидовОплат(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Для Каждого ГруппаВидаОплат Из Элементы.ГруппаВидовОплат.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ГруппаВидаОплат) = Тип("ГруппаФормы") Тогда
			Для Каждого ГруппаВидаОплатГоризонтально Из ГруппаВидаОплат.ПодчиненныеЭлементы Цикл
				Если ТипЗнч(ГруппаВидаОплатГоризонтально) = Тип("ГруппаФормы") Тогда
					Для Каждого ЭлементПодгруппы Из ГруппаВидаОплатГоризонтально.ПодчиненныеЭлементы Цикл
						Если ТипЗнч(ЭлементПодгруппы) = Тип("КнопкаФормы") И (Не ЭлементПодгруппы.Видимость) Тогда
							УстановитьВидимостьЭлементаФормы(ЭлементПодгруппы, Истина);
						КонецЕсли;
						Если ЭлементПодгруппы.Вид = ВидГруппыФормы.Страницы Тогда
							ВосстановитьПодсказки(ЭлементПодгруппы);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СкрытьКнопкиНулевыхВидовОплат(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Форма.СуммаОплаченоНал = 0 Тогда
		ОбщегоНазначенияРМККлиентСервер.УстановитьТекущуюСтраницу(Элементы.СтраницаОплатаНал);
	КонецЕсли;
		
	СкрытьРазделОплатыПриНеобходимости(Элементы, Элементы.ОплатаКартой,
		Элементы.ГруппаОплатаКартой, Неопределено, Форма.СуммаОплаченоБН);
	
	Если Форма.СуммаОплаченоБН = 0 Тогда
		Форма.СуммаНаличныхКВыдаче = 0;
		УстановитьВидимостьЭлементаФормы(Элементы.ГруппаВидОплатыВыдачаНаличных, Ложь);
	КонецЕсли;
	
	Если Форма.СуммаНаличныхКВыдаче = 0 Тогда
		ОбщегоНазначенияРМККлиентСервер.УстановитьТекущуюСтраницу(Элементы.СтраницаОплатаВыдачаНаличных);
	КонецЕсли;
	
	Если Форма.СуммаОплаченоСБП = 0 Тогда
		ОбщегоНазначенияРМККлиентСервер.УстановитьТекущуюСтраницу(Элементы.СтраницаОплатаСБП);
	КонецЕсли;
	
	Если Форма.СуммаОплаченоЮКасса = 0 Тогда
		ОбщегоНазначенияРМККлиентСервер.УстановитьТекущуюСтраницу(Элементы.СтраницаОплатаЮКасса);
	КонецЕсли;
	
	Если Форма.СуммаОплаченоСертификатамиНСПК = 0 Тогда
		ОбщегоНазначенияРМККлиентСервер.УстановитьТекущуюСтраницу(Элементы.СтраницаОплатаСертификатомНСПК);
	КонецЕсли;
	
	//Если Форма.СуммаОплаченоВРассрочку = 0 Тогда
	//	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаОплатаПредоплата, Ложь);
	//	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаПодсказкаПредоплата, Ложь);
	//	УстановитьВидимостьЭлементаФормы(Элементы.Предоплата, Ложь);
	//	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаОплатаВРассрочку, Ложь);
	//	УстановитьВидимостьЭлементаФормы(Элементы.ГруппаПодсказкаОплатаВРассрочку, Ложь);
	//	УстановитьВидимостьЭлементаФормы(Элементы.ОплатаВРассрочку, Ложь);
	//ИначеЕсли Не Элементы.ГруппаОплатаПредоплата.Видимость Тогда
	//	УстановитьВидимостьЭлементаФормы(Элементы.Предоплата, Ложь);
	//Иначе
	//	УстановитьВидимостьЭлементаФормы(Элементы.ОплатаВРассрочку, Ложь);
	//КонецЕсли;
	
	СкрытьРазделОплатыПриНеобходимости(Элементы, Элементы.ЗачетАванса,
		Элементы.ГруппаОплатаЗачетАванса, Неопределено, Форма.СуммаОплаченоЗачетАванса);
	СкрытьРазделОплатыПриНеобходимости(Элементы, Элементы.Безнал, Элементы.ГруппаОплатаБезнал, Неопределено, Форма.СуммаОплаченоБезнал);
	СкрытьРазделОплатыПриНеобходимости(Элементы, Элементы.ОплатаКредитом,
		Элементы.ГруппаОплатаКредитом, Элементы.ГруппаПодсказкаОплатаКредитом, Форма.СуммаОплаченоКредитом);
	УстановитьВидимостьЭлементаФормы(Элементы.ОтменитьВсеОплаты, Ложь);
	
КонецПроцедуры

// Возвращает текущую активную группу родительской группы.
//
// Параметры:
//  ЭлементГруппа - ГруппаФормы.
//
// Возвращаемое значение:
//  АктивнаяГруппа - ГруппаФормы.
//
Функция ПолучитьТекущийСлойГруппы(ЭлементГруппа) Экспорт
	
	АктивнаяГруппа = Неопределено;
	КоличествоПотомков = ЭлементГруппа.ПодчиненныеЭлементы.Количество();
	ИндексПотомка = 0;
	Пока ИндексПотомка < КоличествоПотомков И АктивнаяГруппа = Неопределено Цикл
		ТекущийПотомок = ЭлементГруппа.ПодчиненныеЭлементы.Получить(ИндексПотомка);
		Если ТекущийПотомок.Видимость Тогда
			АктивнаяГруппа = ТекущийПотомок;
		КонецЕсли;
		ИндексПотомка = ИндексПотомка + 1;
	КонецЦикла;
	
	Возврат АктивнаяГруппа;
	
КонецФункции

// Возвращает признак, использует ли форма вместо страниц слои групп.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения.
//
// Возвращаемое значение:
//  Булево - Истина - используются слои.
//
Функция ИспользоватьСлои(Форма) Экспорт
	
	РезультатФункции = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ИспользоватьСлои") Тогда
		РезультатФункции = (Форма.ИспользоватьСлои = Истина);
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

// Устанавливает переданную группу активной у родительской группы формы РМК
//
// Параметры:
//  ЭлементГруппа - ГруппаФормы.
//
Процедура УстановитьТекущийСлойГруппы(ЭлементГруппа) Экспорт
	
	ГруппаРодитель = ЭлементГруппа.Родитель;
	ПереключитьНаСлойГруппы(ГруппаРодитель, ЭлементГруппа);
	
КонецПроцедуры

Процедура АктивизироватьСлойГруппы(Форма, ЭлементГруппа) Экспорт
	Элементы = Форма.Элементы;
	УстановитьТекущийСлойГруппы(ЭлементГруппа);
	
	ВозвратНазадДоступен = (ЭтоЭтапРаботыСОплатой(Форма)
		Или Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.ВозвратКоррекция)
		И ((Форма.ВертикальнаяОриентация И НЕ Форма.РежимЦифровойПанели = Форма.РежимыЦифровойПанели.ДанныеПокупателя) 
			Или Форма.РежимЦифровойПанели = Форма.РежимыЦифровойПанели.Пустой)
		И ПолучитьТекущийСлойГруппы(Элементы.ГруппаСлоевСлужебнаяИнформацияЧека)
			= Элементы.ОбластьОперативногоУправленияЧеком;
		
	Если Не Форма.ВертикальнаяОриентация Тогда
		Если ВозвратНазадДоступен Тогда
			УстановитьТекущийСлойГруппы(Элементы.ГруппаКомандВозвратИзПробитияЧека);
		ИначеЕсли Элементы.ГруппаКомандВозвратИзПробитияЧека.Видимость Тогда
			УстановитьТекущийСлойГруппы(Элементы.ГруппаДополнительнаяКоманднаяПанельПустая);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВключитьДополнительнуюКоманднуюПанельУправленияЧеком(ЭлементГруппа) Экспорт
	
	ГруппаРодитель = ЭлементГруппа.Родитель;
	УстановитьВидимостьЭлементаФормы(ГруппаРодитель, Истина);
	ПереключитьНаСлойГруппы(ГруппаРодитель, ЭлементГруппа);
	
КонецПроцедуры

Функция РазделительДробнойЧасти() Экспорт
	Возврат Сред("" + 1.1 , 2, 1);
КонецФункции

Функция ТелефонныйКодСтраны() Экспорт
	Возврат НСтр("ru = '+7'");
КонецФункции

Функция МаскаВводаТелефона() Экспорт
	Возврат НСтр("ru = '+7 999 999 99 99'");
КонецФункции

Функция ТолькоЦифры(ИсходнаяСтрока) Экспорт
	
	РезультатФункции = "";
	ИндексСимвола = 0;
	Пока ИндексСимвола < СтрДлина(ИсходнаяСтрока) Цикл
		ТекущийСимвол = Сред(ИсходнаяСтрока, ИндексСимвола + 1, 1);
		Если СтрНайти("0123456789", ТекущийСимвол) > 0 Тогда
			РезультатФункции = РезультатФункции + ТекущийСимвол;
		КонецЕсли;
		ИндексСимвола = ИндексСимвола + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Функция ТелефонБезКодаСтраны(ИсходнаяСтрока) Экспорт
	
	ДлинаНомерБезКодаСтраны = 10;
	СтрокаТолькоЦифры = ТолькоЦифры(ИсходнаяСтрока);
	Если СтрДлина(СтрокаТолькоЦифры) > ДлинаНомерБезКодаСтраны Тогда
		СтрокаТолькоЦифры = Прав(СтрокаТолькоЦифры, ДлинаНомерБезКодаСтраны);
	КонецЕсли;
	Возврат СтрокаТолькоЦифры;
	
КонецФункции

Функция ПривестиЗначениеКМаскеТелефона(ИсходноеЗначение, МаскаТелефона) Экспорт
	
	РезультатФункции = ТелефонныйКодСтраны();
	ЧастьБезКодаСтраны = ОставитьЦифрыТелефонаБезКодаСтраны(ИсходноеЗначение);
	НомерСимволаМаски = СтрДлина(ТелефонныйКодСтраны()) + 1;
	ДлинаМаски = СтрДлина(МаскаТелефона);
	ДлинаЧасти = СтрДлина(ЧастьБезКодаСтраны);
	НомерСимволаЧасти = 1;
	Пока НомерСимволаМаски <= ДлинаМаски И НомерСимволаЧасти <= ДлинаЧасти Цикл
		СимволМаски = Сред(МаскаТелефона, НомерСимволаМаски, 1);
		Если СимволМаски = "9" Тогда
			СимволЦифрыТелефона = Сред(ЧастьБезКодаСтраны, НомерСимволаЧасти, 1);
			РезультатФункции = СтрШаблон("%1%2", РезультатФункции, СимволЦифрыТелефона);
			НомерСимволаЧасти = НомерСимволаЧасти + 1;
		Иначе
			РезультатФункции = СтрШаблон("%1%2", РезультатФункции, СимволМаски);
		КонецЕсли;
		НомерСимволаМаски = НомерСимволаМаски + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

// Преобразует строку даты формата "dd.MM.yyyy" в массив из 8 цифр в порядке от дней до года
//
// Параметры:
//  СтрокаФорматаДаты - Строка, 10.
//
// Возвращаемое значение:
//  Массив - массив цифр даты.
//
Функция СформироватьМассивЦифрДаты(СтрокаФорматаДаты) Экспорт
	
	МассивЦифр = Новый Массив;
	ПозицияПервойТочки = 2;
	ПозицияВторойТочки = 4;
	КоличествоЦифрДаты = 8;
	Для ИндексЦифры = 1 По КоличествоЦифрДаты Цикл
		СмещениеИндекса = ?(ИндексЦифры > ПозицияВторойТочки, 2, ?(ИндексЦифры > ПозицияПервойТочки, 1, 0));
		ИндексСимвола = ИндексЦифры + СмещениеИндекса;
		ТекущийЭлементМассива = Неопределено;
		Если ИндексСимвола <= СтрДлина(СтрокаФорматаДаты) Тогда
			СимволСтроки = Сред(СтрокаФорматаДаты, ИндексСимвола, 1);
			Если СтрНайти("0123456789", СимволСтроки) > 0 Тогда
				ТекущийЭлементМассива = Число(СимволСтроки);
			КонецЕсли;
		КонецЕсли;
		МассивЦифр.Добавить(ТекущийЭлементМассива);
	КонецЦикла;
	Возврат МассивЦифр;
	
КонецФункции

Функция СформироватьКаноническуюСтрокуДатыИзМассиваЦифр(МассивЦифр) Экспорт
	
	СтрокаДатыКаноническая = "";
	Если МассивЦифрЗаполненПолностью(МассивЦифр) Тогда
		Для ИндексЭлемента = 4 По 7 Цикл
			СтрокаДатыКаноническая = СтрокаДатыКаноническая + Строка(МассивЦифр[ИндексЭлемента]);
		КонецЦикла;
		СтрокаДатыКаноническая = СтрокаДатыКаноническая + Строка(МассивЦифр[2]) + Строка(МассивЦифр[3]);
		СтрокаДатыКаноническая = СтрокаДатыКаноническая + Строка(МассивЦифр[0]) + Строка(МассивЦифр[1]);
	КонецЕсли;
	Возврат СтрокаДатыКаноническая;
	
КонецФункции

Функция МассивЦифрЗаполненПолностью(МассивЦифр) Экспорт
	
	РезультатФункции = (МассивЦифр.Количество() = 8);
	ИндексЭлемента = 0;
	Пока ИндексЭлемента < 8 И РезультатФункции Цикл
		Если МассивЦифр[ИндексЭлемента] = Неопределено Тогда
			РезультатФункции = Ложь;
		КонецЕсли;
		ИндексЭлемента = ИндексЭлемента + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Функция МассивЦифрПустой(МассивЦифр) Экспорт
	
	РезультатФункции = Истина;
	ИндексЭлемента = 0;
	Пока РезультатФункции И ИндексЭлемента < МассивЦифр.Количество() Цикл
		Если ТипЗнч(МассивЦифр[ИндексЭлемента]) = Тип("Число") Тогда
			РезультатФункции = Ложь;
		КонецЕсли;
		ИндексЭлемента = ИндексЭлемента + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

// Добавляет к строковому представлению даты цифру в первую свободную позицию, если такая есть.
// Например, "27.02.19  " + "5" = "27.02.195 "
//
// Параметры:
//  ТекстВвода - Строка, 10. Строка из поля ввода даты с маской "99.99.9999",
//  Цифра - Строка, 1. Символ цифры.
//
// Возвращаемое значение:
//  Строка, 10 - Строка с представлением даты с маской "99.99.9999".
//
Функция ДобавитьЦифруКТекстуДаты(ТекстВвода, Цифра) Экспорт
	
	РезультатФункции = ТекстВвода;
	ДлинаПредставленияДаты = 10;
	ПозицияДляВставки = ПозицияПоследнейЦифрыВСтроке(ТекстВвода) + 1;
	Если ПозицияДляВставки <= ДлинаПредставленияДаты Тогда
		Если ПозицияДляВставки = 3 Или ПозицияДляВставки = 6 Тогда
			ПозицияДляВставки = ПозицияДляВставки + 1;
		КонецЕсли;
		ЛеваяЧасть = ?(ПозицияДляВставки = 1, "", Лев(ТекстВвода, ПозицияДляВставки - 1));
		ПраваяЧасть = ?(ПозицияДляВставки < ДлинаПредставленияДаты, Сред(ТекстВвода, ПозицияДляВставки + 1), "");
		РезультатФункции = ЛеваяЧасть + Цифра + ПраваяЧасть;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ЭтоПолеДатыСМаской(ЭлементПоля) Экспорт
	
	РезультатФункции = Ложь;
	Если Не ЭлементПоля = Неопределено Тогда
		Если ЭлементПоля.Маска = МаскаВводаДаты() Тогда
			РезультатФункции = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ЭтоПолеТелефонаСМаской(ЭлементПоля) Экспорт
	
	РезультатФункции = Ложь;
	ДлинаТелефонаБезКодаСтраны = 10;
	Если Не ЭлементПоля = Неопределено Тогда
		КодСтраны = ТелефонныйКодСтраны();
		Если СтрДлина(ЭлементПоля.Маска) > ДлинаТелефонаБезКодаСтраны И Лев(ЭлементПоля.Маска, СтрДлина(КодСтраны)) = КодСтраны Тогда
			РезультатФункции = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПараметрыКартыЛояльности() Экспорт
	
	ПараметрыКарты = Новый Структура();
	ПараметрыКарты.Вставить("ИдентификаторКарты", "");
	ПараметрыКарты.Вставить("КодКарты", "");
	ПараметрыКарты.Вставить("ФИО", "");
	ПараметрыКарты.Вставить("НомерТелефонаВладельцаКарты", "");
	ПараметрыКарты.Вставить("СуммаПродаж", 0);
	ПараметрыКарты.Вставить("АдресЭПВладельцаКарты", "");
	ПараметрыКарты.Вставить("ДатаРождения", Дата(1, 1, 1));
	ПараметрыКарты.Вставить("ЭтоКомпания", Ложь);
	ПараметрыКарты.Вставить("ЭтоБонуснаяКарта", Ложь);
	
	Возврат ПараметрыКарты;
	
КонецФункции

Функция ДанныеЛояльностиЗаполнены(Форма) Экспорт
	
	ФормаОбъект = Форма.Объект;
	КартаЛояльностиЗаполнена = ЗначениеЗаполнено(ФормаОбъект.ДисконтнаяКарта)
		И ОбщегоНазначенияРМКВызовСервера.СсылкаСуществует(ФормаОбъект.ДисконтнаяКарта);
	РезультатФункции = КартаЛояльностиЗаполнена
		Или ЗначениеЗаполнено(Форма.Объект.Контрагент)
		Или ПараметрыКартыЗаполнены(Форма.ПараметрыКартыЛояльности);
		
	Возврат РезультатФункции;
	
КонецФункции

Функция ДанныеДисконтнойКартыЗаполнены(Форма) Экспорт
	
	РезультатФункции = ЗначениеЗаполнено(Форма.Объект.ДисконтнаяКарта)
		Или ПараметрыКартыЗаполнены(Форма.ПараметрыКартыЛояльности);
		
	Возврат РезультатФункции;
	
КонецФункции

Функция СохраненТолькоНомерКартыЛояльности(ПараметрыКартыЛояльности) Экспорт
	
	РезультатФункции = Ложь;

	Если ТипЗнч(ПараметрыКартыЛояльности) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыКартыЛояльности.КодКарты)
			И Не ЗначениеЗаполнено(ПараметрыКартыЛояльности.ИдентификаторКарты) Тогда
		
		РезультатФункции = Истина;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолученИдентификаторКартыЛояльности(ПараметрыКартыЛояльности) Экспорт
	
	РезультатФункции = Ложь;
	Если ТипЗнч(ПараметрыКартыЛояльности) = Тип("Структура")
			И ЗначениеЗаполнено(ПараметрыКартыЛояльности.ИдентификаторКарты) Тогда
		
		РезультатФункции = Истина;
		
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПараметрыКартыЗаполнены(ПараметрыКартыЛояльности) Экспорт
	
	РезультатФункции = Ложь;
	
	Если ТипЗнч(ПараметрыКартыЛояльности) = Тип("Структура")
		И (ЗначениеЗаполнено(ПараметрыКартыЛояльности.ИдентификаторКарты)
		Или ЗначениеЗаполнено(ПараметрыКартыЛояльности.КодКарты)) Тогда
		
		РезультатФункции = Истина;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УстановитьМаскуВводаДатыРожденияНовойКарты(Форма) Экспорт

	МаскаДата = "";
	Элементы = Форма.Элементы;
	Если Элементы.ОсновнаяГруппаСозданиеКарты.Доступность И Элементы.ГруппаНоваяКартаДатаРождения.Доступность
		И Элементы.ГруппаРеквизитовКарты.Доступность Тогда
		
		МаскаДаты = МаскаВводаДаты();
		
	КонецЕсли;
	Элементы.НоваяКартаДатаРождения.Маска = МаскаДаты;
	
КонецПроцедуры

Функция ПреобразоватьДатуИзСтроковогоПредставления(ТекстДаты) Экспорт
	
	ОписаниеТипаДата = Новый ОписаниеТипов("Дата");
	ДатаРожденияКлиента = Дата(1, 1, 1);
	МассивЦифрДаты = СформироватьМассивЦифрДаты(ТекстДаты);
	Если МассивЦифрЗаполненПолностью(МассивЦифрДаты) Тогда
		ДатаКаноническаяСтрока = СформироватьКаноническуюСтрокуДатыИзМассиваЦифр(МассивЦифрДаты);
		ДатаРожденияКлиента = ОписаниеТипаДата.ПривестиЗначение(ДатаКаноническаяСтрока);
	КонецЕсли;
	Возврат ДатаРожденияКлиента;
	
КонецФункции

Процедура ОтобразитьИнформациюОПродажах(Форма, ДанныеПродаж) Экспорт
	
	Элементы = Форма.Элементы;

	Форма.НайденнаяКартаСуммаПродаж = Формат(ДанныеПродаж.SellCount,"ЧДЦ=2");
	Форма.СуммаПродаж = Формат(ДанныеПродаж.SellCount,"ЧДЦ=2");

		
КонецПроцедуры

Функция ЭтоЭтапРаботыСОплатойИлиКоррекцией(Форма) Экспорт
	
	РезультатФункции = (Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.Оплата
		Или Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.ПереходКОплате
		Или Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.ВозвратКоррекция);
	Возврат РезультатФункции;
	
КонецФункции

Функция ПредставлениеПустойКлавиши() Экспорт
	
	Возврат НСтр("ru = 'Нет'");
	
КонецФункции

Функция ИсточникиДанныхДляПлитки() Экспорт
	
	ИсточникиДанныхПлитки = Новый Структура;
	ИсточникиДанныхПлитки.Вставить("Остальное", 0);
	ИсточникиДанныхПлитки.Вставить("Палитра", 1);
	ИсточникиДанныхПлитки.Вставить("Избранное", 2);
	ИсточникиДанныхПлитки.Вставить("ВесовойТовар", 3);
	ИсточникиДанныхПлитки.Вставить("СлужебныеГруппы", 4);
	
	Возврат ИсточникиДанныхПлитки;
	
КонецФункции

Функция ИмяГруппыДругихВесовыхТоваров() Экспорт
	
	Возврат НСтр("ru = 'Другие товары'");
	
КонецФункции

Функция ИмяГруппыРаспознанныхВесовыхТоваров() Экспорт
	
	Возврат НСтр("ru = 'Распознанные товары'");
	
КонецФункции

Функция НаименованиеКнопкиЗакрытияДанныхПокупателя(РежимКСО) Экспорт
	
	РезультатФункции = "";
	Если РежимКСО Тогда
		РезультатФункции = НСтр("ru = 'Вернуться к покупке'");
	Иначе
		РезультатФункции = НСтр("ru = 'Вернуться к продаже'");
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПодготовитьПараметрыОперацииНаРабочемМестеКассира(Форма) Экспорт
	
	ОбъектФормы = Форма.Объект;
	ПараметрыОперации = Новый Структура();
	
	ПараметрыОперации.Вставить("РабочееМесто", Форма.РабочееМесто);
	ПараметрыОперации.Вставить("ТорговыйОбъект", ОбъектФормы.ТорговыйОбъект);
	ПараметрыОперации.Вставить("Кассир", ОбъектФормы.Кассир);
	ПараметрыОперации.Вставить("ПользовательБД", ОбъектФормы.ПользовательБД);
	ПараметрыОперации.Вставить("РегистрируемаяОперация", Неопределено);
	ПараметрыОперации.Вставить("Чек", Неопределено);
	ПараметрыОперации.Вставить("Сумма", 0);
	
	Возврат ПараметрыОперации;
	
КонецФункции

Функция РегистрироватьДействияКассира(Форма) Экспорт
	
	Возврат (Форма.ВестиЖурналДействийКассира И Не Форма.ЭтоПолноправныйПользователь);
	
КонецФункции

Функция ШаблонКэшаКонтроляПродаж() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ЭлементыКонтроляПродаж", Новый Массив);
	РезультатФункции.Вставить("СтрокиВидовКонтроля", Новый Массив);
	РезультатФункции.Вставить("НоменклатураПлиткиКонтроляПродаж", Новый Массив);
	РезультатФункции.Вставить("НоменклатураКонтроляПродаж", Новый Массив);
	РезультатФункции.Вставить("ОбщийКонтрольПродаж", Новый Массив);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ШаблонЭлементаКонтроляПродаж() Экспорт

	ПустаяДата = Дата(1, 1, 1, 0, 0, 0);
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("КонтрольПродаж", Неопределено);
	РезультатФункции.Вставить("НаименованиеГруппыТоваров", "");
	РезультатФункции.Вставить("СтрокиКонтроля", Новый Массив);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ШаблонСтрокиКонтроляПродаж() Экспорт
	
	ПустаяДата = Дата(1, 1, 1, 0, 0, 0);
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ВидКонтроля", Неопределено);
	РезультатФункции.Вставить("НачалоПериода", ПустаяДата);
	РезультатФункции.Вставить("КонецПериода", ПустаяДата);
	РезультатФункции.Вставить("ДеньНедели", Неопределено);
	РезультатФункции.Вставить("ВремяНачала", ПустаяДата);
	РезультатФункции.Вставить("ВремяОкончания", ПустаяДата);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ШаблонСтрокиВидаКонтроляПродаж() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ВидКонтроля", Неопределено);
	РезультатФункции.Вставить("ТипКонтроля", Неопределено);
	РезультатФункции.Вставить("ТекстШаблонаПредупреждения", "");
	РезультатФункции.Вставить("ПараметрыКонтроля", Новый Массив);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ШаблонСтрокиПараметровВидаКонтроля() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("Параметр", Неопределено);
	РезультатФункции.Вставить("Значение", Неопределено);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ШаблонСтрокиНоменклатурыКонтроляПродаж() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("Номенклатура", Неопределено);
	РезультатФункции.Вставить("Характеристика", Неопределено);
	РезультатФункции.Вставить("МассивКонтролейПродаж", Новый Массив);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьНовыеДанныеКэшаПродаж(ДанныеПриемник, ДанныеИсточник, ЭтоКэшПлитки = Ложь) Экспорт

	Если ДанныеПриемник.Количество() = 0 Или ДанныеИсточник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Общий контроль продаж
	ПеренестиНедостающиеЭлементыПростогоМассива(ДанныеИсточник.ОбщийКонтрольПродаж, ДанныеПриемник.ОбщийКонтрольПродаж);
	
	// Контроль продаж по номенклатуре
	Для Каждого СтрокаНоменклатурыКонтроляИсточник Из ДанныеИсточник.НоменклатураКонтроляПродаж Цикл
		
		СтрокаНоменклатурыКонтроляПриемник
			= ПолучитьСтрокуНоменклатурыКонтроляПродаж(ДанныеПриемник.НоменклатураКонтроляПродаж,
				СтрокаНоменклатурыКонтроляИсточник);
		
		СтрокаНоменклатурыКонтроляПлиткиПриемник
			= ПолучитьСтрокуНоменклатурыКонтроляПродаж(ДанныеПриемник.НоменклатураПлиткиКонтроляПродаж,
				СтрокаНоменклатурыКонтроляИсточник);
		
		Если СтрокаНоменклатурыКонтроляПриемник = Неопределено
				И СтрокаНоменклатурыКонтроляПлиткиПриемник = Неопределено Тогда
			
			НоменклатураКонтроляПродажПриемник
				= ?(ЭтоКэшПлитки, ДанныеПриемник.НоменклатураПлиткиКонтроляПродаж, ДанныеПриемник.НоменклатураКонтроляПродаж);
			НоменклатураКонтроляПродажПриемник.Добавить(СтрокаНоменклатурыКонтроляИсточник);
			
		Иначе
			Если Не СтрокаНоменклатурыКонтроляПриемник = Неопределено Тогда
				ПеренестиНедостающиеЭлементыПростогоМассива(СтрокаНоменклатурыКонтроляИсточник.МассивКонтролейПродаж,
					СтрокаНоменклатурыКонтроляПриемник.МассивКонтролейПродаж);
			КонецЕсли;
			Если Не СтрокаНоменклатурыКонтроляПлиткиПриемник = Неопределено Тогда
				ПеренестиНедостающиеЭлементыПростогоМассива(СтрокаНоменклатурыКонтроляИсточник.МассивКонтролейПродаж,
					СтрокаНоменклатурыКонтроляПлиткиПриемник.МассивКонтролейПродаж);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Элементы контроля продаж
	Для Каждого СтрокаЭлементаКонтроляИсточник Из ДанныеИсточник.ЭлементыКонтроляПродаж Цикл
		СтрокаЭлементаКонтроляПриемник = ПолучитьСтрокуЭлементаКонтроляПродаж(ДанныеПриемник.ЭлементыКонтроляПродаж,
			СтрокаЭлементаКонтроляИсточник.КонтрольПродаж);
		
		Если СтрокаЭлементаКонтроляПриемник = Неопределено Тогда
			ДанныеПриемник.ЭлементыКонтроляПродаж.Добавить(СтрокаЭлементаКонтроляИсточник);
		Иначе
			Для Каждого СтрокаКонтроляИсточник Из СтрокаЭлементаКонтроляИсточник.СтрокиКонтроля Цикл
				СтрокаКонтроляПриемник
					= ПолучитьСтрокуКонтроля(СтрокаЭлементаКонтроляПриемник.СтрокиКонтроля, СтрокаКонтроляИсточник);
				Если СтрокаКонтроляПриемник = Неопределено Тогда
					СтрокаЭлементаКонтроляПриемник.СтрокиКонтроля.Добавить(СтрокаКонтроляИсточник);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Строки вида контроля
	Для Каждого СтрокаВидаКонтроляИсточник Из ДанныеИсточник.СтрокиВидовКонтроля Цикл
		СтрокаВидаКонтроляПриемник = ПолучитьСтрокуВидаКонтроля(ДанныеПриемник.СтрокиВидовКонтроля,
			СтрокаВидаКонтроляИсточник.ВидКонтроля);
		
		Если СтрокаВидаКонтроляПриемник = Неопределено Тогда
			 ДанныеПриемник.СтрокиВидовКонтроля.Добавить(СтрокаВидаКонтроляИсточник);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция DecToHex(Знач Значение) Экспорт
	
	РезультатФункции = "";
	Если Значение <= 0 Тогда
		РезультатФункции = "0";
	Иначе
		Размерность = 16;
		Значение = Цел(Значение);
		Пока Значение > 0 Цикл
			СимволЦифра = Сред("0123456789ABCDEF", Значение%Размерность + 1, 1);
			РезультатФункции = СтрШаблон("%1%2", СимволЦифра, РезультатФункции);
			Значение = Цел(Значение/Размерность);
		КонецЦикла;
	КонецЕсли;

	Пока СтрДлина(РезультатФункции) <= 1 Цикл
		РезультатФункции = СтрШаблон("%1%2", "0", РезультатФункции);
	КонецЦикла;

	Возврат РезультатФункции;

КонецФункции

Функция ОпределитьПрименитьВыравниваниеГруппыОперации(Форма, НаборСвойств) Экспорт
	
	ПоложениеЛево = НСтр("ru = 'Лево'");
	ПоложениеЦентр = НСтр("ru = 'Центр'");
	ПоложениеПраво = НСтр("ru = 'Право'");
	ВыравниваниеАвто = НСтр("ru = 'Авто'");
	СвойствоВыравнивание = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ВыравниваниеЭлементов");
	ЗначениеВыравнивания = НаборСвойств.Получить(СвойствоВыравнивание);
	РастягиватьСередину = Истина;
	ГоризонтальноеПоложениеКоманд = ГоризонтальноеПоложениеЭлемента.Авто;
	
	Если Не (ЗначениеВыравнивания = Неопределено Или ЗначениеВыравнивания = ВыравниваниеАвто) Тогда
		
		РастягиватьСередину = Ложь;
		
		Если ЗначениеВыравнивания = ПоложениеЛево Тогда
			ГоризонтальноеПоложениеКоманд = ГоризонтальноеПоложениеЭлемента.Лево;
		ИначеЕсли ЗначениеВыравнивания = ПоложениеЦентр Тогда
			ГоризонтальноеПоложениеКоманд = ГоризонтальноеПоложениеЭлемента.Центр;
		ИначеЕсли ЗначениеВыравнивания = ПоложениеПраво Тогда
			ГоризонтальноеПоложениеКоманд = ГоризонтальноеПоложениеЭлемента.Право;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	Если Не Элементы.ДекорацияРастяжениеСправа.Видимость = РастягиватьСередину Тогда
		Элементы.ДекорацияРастяжениеСправа.Видимость = РастягиватьСередину;
		Элементы.ДекорацияОперацияОтступСправа.Видимость = Не РастягиватьСередину;
	КонецЕсли;
	Если Не Элементы.ГруппаОперации.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеКоманд Тогда
		Элементы.ГруппаОперации.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеКоманд;
	КонецЕсли;
	
КонецФункции

Функция РежимыФормыПодтвержденияДобавленияТоваров() Экспорт
	
	РежимыФормы = Новый Структура();

	РежимыФормы.Вставить("ПодтверждениеВеса", 0);
	РежимыФормы.Вставить("РучнойВводВеса", 1);
	РежимыФормы.Вставить("ВводДробногоКоличества", 2);
	
	Возврат РежимыФормы;
	
КонецФункции

Функция ПолучитьРазмерыПлиткиПоУмолчанию(ВертикальнаяОриентация) Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("КоличествоЭлементовВРяду", ?(ВертикальнаяОриентация, 3, 4));
	РезультатФункции.Вставить("КоличествоРядовНаСтранице", ?(ВертикальнаяОриентация, 4, 3));
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПоказыватьСтатусКассовыхСмен(НастройкиЭлементов) Экспорт
	
	РезультатФункции = Ложь;
	
	ЗаголовкиОбластей = ПолучитьЗаголовкиОбластейДляНастроек();
	СвойствоСтатусСмены = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ПоказыватьСтатусСмены");
	НаборСвойствПанелиОпераций = НастройкиЭлементов.Получить(ЗаголовкиОбластей.ОбластьПанельОпераций);
	Если Не НаборСвойствПанелиОпераций = Неопределено Тогда
		ЗначениеСтатусСмены = НаборСвойствПанелиОпераций.Получить(СвойствоСтатусСмены);
		Если ЗначениеСтатусСмены = Истина Тогда
			РезультатФункции = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ГрупповыеСтатусыКассовыхСмен() Экспорт
	
	ГрупповыеСтатусы = Новый Структура();
	
	ГрупповыеСтатусы.Вставить("Неопределен", 0);
	ГрупповыеСтатусы.Вставить("СменыАктуальны", 1);
	ГрупповыеСтатусы.Вставить("СменыАктуальныЧастично", 2);
	ГрупповыеСтатусы.Вставить("ТребуетсяОткрытиеСмен", 3);
	
	Возврат ГрупповыеСтатусы;
	
КонецФункции

Функция ПолучитьГрупповойСтатусКассовыхСмен(Форма, ДатаТекущая, СтатусСменИзменился) Экспорт
	
	ГрупповыеСтатусы = ГрупповыеСтатусыКассовыхСмен();
	РезультатФункции = ГрупповыеСтатусы.Неопределен;
	
	Сутки = 86400;
	ВремяНачалаСменыВСекундах = Форма.ВремяНачалаСмены - Дата(1, 1, 1);
	МинимальнаяДатаНачалаСмены = НачалоДня(ДатаТекущая) + ВремяНачалаСменыВСекундах;
	Если ДатаТекущая < МинимальнаяДатаНачалаСмены Тогда
		МинимальнаяДатаНачалаСмены = МинимальнаяДатаНачалаСмены - Сутки;
	КонецЕсли;
	ЕстьАктуальнаяСмена = Ложь;
	ЕстьУстаревшаяСмена = Ложь;
	
	КоличествоКасс = Форма.ТаблицаКассККМОрганизаций.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоКасс И НЕ (ЕстьАктуальнаяСмена И ЕстьУстаревшаяСмена) Цикл
		СтрокаКассыККМ = Форма.ТаблицаКассККМОрганизаций[ИндексСтроки];
		Если СтрокаКассыККМ.Открыта Тогда
			Если ДатаТекущая - СтрокаКассыККМ.НачалоКассовойСмены >= Сутки
					Или СтрокаКассыККМ.НачалоКассовойСмены < МинимальнаяДатаНачалаСмены Тогда
				ЕстьУстаревшаяСмена = Истина;
			Иначе
				ЕстьАктуальнаяСмена = Истина;
			КонецЕсли;
		Иначе
			ЕстьУстаревшаяСмена = Истина;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Если ЕстьАктуальнаяСмена И ЕстьУстаревшаяСмена Тогда
		РезультатФункции = ГрупповыеСтатусы.СменыАктуальныЧастично;
	ИначеЕсли ЕстьАктуальнаяСмена Тогда
		РезультатФункции = ГрупповыеСтатусы.СменыАктуальны;
	ИначеЕсли ЕстьУстаревшаяСмена Тогда
		РезультатФункции = ГрупповыеСтатусы.ТребуетсяОткрытиеСмен;
	КонецЕсли;
	Если Не Форма.ГрупповойСтатусСмен = РезультатФункции Тогда
		СтатусСменИзменился = Истина;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТипыКонтроляНаЧек() Экспорт
	
	РезультатФункции = Новый Массив;
	
	РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваСтрокВЧеке"));
	РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитСуммыВЧеке"));
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТипыКонтроляЛимитов() Экспорт
	
	РезультатФункции = Новый Массив;
	
	РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваВСтроке"));
	РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваСтрокВЧеке"));
	РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитСуммыВЧеке"));
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗаменитьСимволGS1(Штрихкод) Экспорт
	
	СимволGS1 = МенеджерОборудованияРМККлиентСервер.РазделительGS1();
	Разделитель = МенеджерОборудованияРМККлиентСервер.ЭкранированныйСимволGS1();
	
	Штрихкод = СтрЗаменить(Штрихкод, СимволGS1, Разделитель);
	
КонецПроцедуры

Функция НазначенияАвторизации() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ОткрытиеФормы", 0);
	РезультатФункции.Вставить("ПринудительнаяСменаКассира", 1);
	РезультатФункции.Вставить("СменаКассира", 2);
	РезультатФункции.Вставить("СменаМагазина", 3);
	РезультатФункции.Вставить("ПовышениеПрав", 4);
	РезультатФункции.Вставить("СлужебныеДействияКСО", 5);
	РезультатФункции.Вставить("РазблокировкаКСО", 6);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТипыГруппировок() Экспорт
	
	ТипыГруппировок = Новый Структура();
	ТипыГруппировок.Вставить("Вертикальная", "Вертикальная");
	ТипыГруппировок.Вставить("Горизонтальная", "Горизонтальная");
	
	Возврат ТипыГруппировок;
	
КонецФункции

Функция ВозможныеСостоянияНастроек() Экспорт
	
	ВозможныеСостоянияНастроек = Новый Структура();
	ВозможныеСостоянияНастроек.Вставить("НеИмеетНастроек", -1);
	ВозможныеСостоянияНастроек.Вставить("НастройкиПоУмолчанию", 0);
	ВозможныеСостоянияНастроек.Вставить("НастройкиИзменены", 1);
	
	Возврат ВозможныеСостоянияНастроек;
	
КонецФункции

Функция ИменаУникальныхВидовОплат() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("Карта", "Картой");
	РезультатФункции.Вставить("Наличные", "Наличными");
	РезультатФункции.Вставить("СБП", "СБП");
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПоддерживаемыеКнопкиУникальныхВидовОплат() Экспорт
	
	ИменаВидовОплат = ИменаУникальныхВидовОплат();
	
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(ИменаВидовОплат.Наличные);
	РезультатФункции.Добавить(ИменаВидовОплат.Карта);
	РезультатФункции.Добавить(ИменаВидовОплат.СБП);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция КоличествоКарточекИзбранногоНаСтранице() Экспорт
	
	Возврат 8;
	
КонецФункции

#Область УточненияПринадлежностиЗапасов

Функция ШаблонКэшаУточненияПринадлежностиЗапасов() Экспорт
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ТорговыйОбъект");
	РезультатФункции.Вставить("Номенклатура");
	РезультатФункции.Вставить("Характеристика");
	РезультатФункции.Вставить("Серия");
	РезультатФункции.Вставить("ОрганизацияПродавец");
	РезультатФункции.Вставить("Комитент");
	РезультатФункции.Вставить("СистемаНалогообложения");
	РезультатФункции.Вставить("СтавкаНДС");
	РезультатФункции.Вставить("СтавкаНДСУСН");
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьНовыеДанныеКэшаУточненияПринадлежностиЗапасов(ДанныеПриемник, ДанныеИсточник, ЭтоКэшПлитки = Ложь) Экспорт
	
	Для Каждого Соответствие Из ДанныеИсточник Цикл
		ДанныеПриемник.Вставить(Соответствие.Ключ, Соответствие.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция СтруктураДанныхКартыДляИнтерфейса()
	Результат = Новый Структура();
	Результат.Вставить("КодКарты", "");
	Результат.Вставить("ПокупательФИО", "");
	Результат.Вставить("ИдентификаторПокупателя", "");
	Результат.Вставить("НомерТелефона", "");
	Результат.Вставить("ПокупательПочта", "");
	Результат.Вставить("ФизическоеЛицо", Ложь);
	Результат.Вставить("ДатаРождения", Дата(1,1,1));
	Результат.Вставить("ВидДисконтнойКарты",  "");
	Результат.Вставить("КартаНедействительна",  Ложь);
	Результат.Вставить("ИдентификаторКарты",  "");
	Результат.Вставить("ОстатокБонусныхБаллов",  0);
	Результат.Вставить("КурсБонусов",  0);
	Результат.Вставить("ОстатокБалловРуб",  0);
	Результат.Вставить("КоличествоОстатокЛимит",  0);
	Результат.Вставить("ПродажиОборот",  0);
	Результат.Вставить("МаксимальныйПроцентОплаты",  0);
	Результат.Вставить("ИдентификаторБонуснойПрограммы",  "");
	Результат.Вставить("БонуснаяПрограмма", "");
	Результат.Вставить("БонуснаяПрограммаНаименование", "");
    Возврат Результат;
КонецФункции

Функция ОписаниеКартыДляИнтерфейса(ДанныеССервераЛояльности) Экспорт
	Результат = СтруктураДанныхКартыДляИнтерфейса();
	НомерКарты = ?(ЗначениеЗаполнено(ДанныеССервераЛояльности.Barcode), ДанныеССервераЛояльности.Barcode, ДанныеССервераЛояльности.MagneticCode);
	Результат.КодКарты = НомерКарты;
	Если ДанныеССервераЛояльности.Свойство("BonusData") Тогда
		Результат.ПокупательФИО = ДанныеССервераЛояльности.ClientName;
		Результат.НомерТелефона = ДанныеССервераЛояльности.Phone;
		Результат.ПокупательПочта = ДанныеССервераЛояльности.EMail;
		Результат.ФизическоеЛицо = ДанныеССервераЛояльности.IsPerson;
		СтрокаXMLТолькоЧастьДата = Лев(ДанныеССервераЛояльности.DateOfBirth, 10);
		СтрокаДатыДляПреобразования = СтрЗаменить(СтрокаXMLТолькоЧастьДата, "-", "");
		ДатаРожденияКлиента = Дата(СтрокаДатыДляПреобразования);
		Результат.ДатаРождения = ДатаРожденияКлиента;

		Результат.ВидДисконтнойКарты =  ДанныеССервераЛояльности.TypeCard;
		Результат.КартаНедействительна =  НЕ ДанныеССервераЛояльности.Valid;
		//
		Результат.ИдентификаторКарты =  ДанныеССервераЛояльности.CardGUID;
		Результат.ОстатокБонусныхБаллов =  ДанныеССервераЛояльности.BonusData.BonusCount;
		Результат.КурсБонусов =  ДанныеССервераЛояльности.BonusData.BonusRate;
		Результат.ОстатокБалловРуб =  Результат.ОстатокБонусныхБаллов * Результат.КурсБонусов;
		Результат.КоличествоОстатокЛимит =  ДанныеССервераЛояльности.BonusData.BonusLimitBalance;
		Результат.ПродажиОборот =  ДанныеССервераЛояльности.SellCount;
		Результат.МаксимальныйПроцентОплаты =  ДанныеССервераЛояльности.BonusData.PaymentPercent;
		Результат.ИдентификаторБонуснойПрограммы =  ДанныеССервераЛояльности.BonusData.BonusGUID;
		Результат.БонуснаяПрограмма = ДанныеССервераЛояльности.BonusData.BonusGUID;
		Результат.БонуснаяПрограммаНаименование = ДанныеССервераЛояльности.BonusData.BonusName;
		Результат.ИдентификаторПокупателя = ДанныеССервераЛояльности.ClientGUID;
	Иначе
		Результат.ИдентификаторКарты =  ДанныеССервераЛояльности.CardRef;
		Результат.ОстатокБонусныхБаллов =  ДанныеССервераЛояльности.BonusCount;
		Результат.КурсБонусов =  ДанныеССервераЛояльности.BonusRate;
		Результат.ОстатокБалловРуб =  Результат.ОстатокБонусныхБаллов * Результат.КурсБонусов;
		Результат.КоличествоОстатокЛимит =  ДанныеССервераЛояльности.BonusLimitBalance;
		Результат.МаксимальныйПроцентОплаты =  ДанныеССервераЛояльности.PaymentPercent;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура ОтобразитьИнформациюОБонусныхБаллах85(Форма, ДанныеБонусов) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Форма.СписатьБаллыПоВладельцу Тогда
		КоличествоБонусов = 0;
		КоличествоБонусовКОплатеВВалюте = 0;
		Для Каждого СтрокаТаблицы Из Форма.ТаблицаВыбранныхКарт Цикл
			КоличествоБонусов = КоличествоБонусов + СтрокаТаблицы.ОстатокБонусныхБаллов;
			КоличествоБонусовКОплатеВВалюте = КоличествоБонусовКОплатеВВалюте + СтрокаТаблицы.ОстатокБонусныхБаллов * ?(СтрокаТаблицы.КурсБонусов = 0, 1, СтрокаТаблицы.КурсБонусов);
		КонецЦикла;
		Если Форма.ПроцентБонуснойПрограммы = 0 Тогда
			Форма.ПроцентОплатыБонусами = ДанныеБонусов.МаксимальныйПроцентОплаты;
		Иначе
			Форма.ПроцентОплатыБонусами = Форма.ПроцентБонуснойПрограммы;
		КонецЕсли;
		
	Иначе
		КоличествоБонусов = ДанныеБонусов.ОстатокБонусныхБаллов;
		КоличествоБонусовКОплатеВВалюте = КоличествоБонусов * ?(ДанныеБонусов.КурсБонусов = 0, 1, ДанныеБонусов.КурсБонусов);
		Форма.ПроцентОплатыБонусами = ДанныеБонусов.МаксимальныйПроцентОплаты;
	КонецЕсли;
	Форма.КоличествоБонусов = КоличествоБонусов;
	Форма.КурсБонусов = ДанныеБонусов.КурсБонусов;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеБонусов, "КоличествоБонусовОграничение") Тогда
		Форма.КоличествоБонусовОграничение = ДанныеБонусов.КоличествоБонусовОграничение;
	КонецЕсли;
	Форма.БонусыДоступноКОплате = КоличествоБонусовКОплатеВВалюте;
		
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Бонусами можно оплатить до %1%% от суммы чека'"), Форма.ПроцентОплатыБонусами);
		
КонецПроцедуры

Процедура ОчиститьДанныеПанелиИзбранных(Форма) Экспорт
	
	ДанныеКнопок = Форма.ДанныеКнопок;
	ДанныеКнопок.Очистить();
	КоличествоКарточек = ИнтерфейсРМКСлужебныйКлиентСервер.КоличествоКарточекИзбранногоНаСтранице();
	Для ПорядковыйНомер = 1 По КоличествоКарточек Цикл
		СтрокаКнопка = ДанныеКнопок.Добавить();
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыФормыВводаПокупателя() Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", "Поиск дисконтной карты");
	ПараметрыФормы.Вставить("ИспользоватьЦифровуюКлавиатуру", Истина);
	ПараметрыФормы.Вставить("ИспользоватьДисконтныеКарты", Ложь);
	ПараметрыФормы.Вставить("ЭлектронныйЧек", Ложь);
	ПараметрыФормы.Вставить("ИспользоватьСерверЛояльностиПолучательДанных", Истина);
	ПараметрыФормы.Вставить("РежимВыбораКонтрагента", Ложь);
	ПараметрыФормы.Вставить("ВертикальнаяОриентация", Ложь);
	ПараметрыФормы.Вставить("ЗапоминатьНомерКартыЛояльности", Ложь);
	ПараметрыФормы.Вставить("Контрагент", Неопределено);
	ПараметрыФормы.Вставить("ПокупательФИО", Неопределено);
	ПараметрыФормы.Вставить("ДисконтнаяКарта", Неопределено);
	ПараметрыФормы.Вставить("ПараметрыКартыЛояльности", Неопределено);
	ПараметрыФормы.Вставить("ТекущаяНастройкаРМК", Неопределено);
	ПараметрыФормы.Вставить("СуммаДокумента", 0);
	ПараметрыФормы.Вставить("КодВалютыЦены", "");
	ПараметрыФормы.Вставить("ЭтоРаботаСАвансом", Ложь); 
	ПараметрыФормы.Вставить("РазрешитьЗаменуДисконтнойКарты", Ложь);
	ПараметрыФормы.Вставить("ВидСоздаваемойКарты", Неопределено);
	ПараметрыФормы.Вставить("НомерСоздаваемойКарты", Неопределено);
	ПараметрыФормы.Вставить("РедактироватьКарту", Ложь);
	ПараметрыФормы.Вставить("ПродолжатьБезКарты", Ложь);
	ПараметрыФормы.Вставить("ШтрихкодДляПоиска", "");
	ПараметрыФормы.Вставить("ОстатокБалловНаКарте", 0);
	ПараметрыФормы.Вставить("КурсБаллов", 1);
	ПараметрыФормы.Вставить("ТорговыйОбъект", Неопределено);
	ПараметрыФормы.Вставить("ТаблицаВидыКарт", Неопределено);
	ПараметрыФормы.Вставить("Организация", Неопределено);
	ПараметрыФормы.Вставить("ПодключенаОблачнаяККТ", Ложь);
	
	Возврат ПараметрыФормы;
	
КонецФункции

Функция НастройкаОбластиСоответствуетСценариюИспользования(ЗаголовокОбласти, СвойствоНастройки, Сценарий) Экспорт
	
	РезультатФункции = Истина;
	ЗаголовкиОбластей = ПолучитьЗаголовкиОбластейДляНастроек();
	СценарийСамообслуживание = ПредопределенноеЗначение("Перечисление.СценарииИспользованияРМК.ТерминалСамообслуживания");
	
	СвойствоСтатусСмены = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ПоказыватьСтатусСмены");
	СвойствоОбластьПрименения = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ОбластьПрименения");
	СвойствоРазмерКнопокВПлитке
		= ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.РазмерКнопокПлиточныйИнтерфейс");
	СвойствоРазмерКнопок = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.РазмерКнопок");
	СвойствоВысотаКнопок = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ВысотаКнопок");
	
	Если ЗаголовокОбласти = ЗаголовкиОбластей.ОбластьДанныеТекущегоТовара Тогда
		
		Если (СвойствоНастройки = СвойствоРазмерКнопокВПлитке Или СвойствоНастройки = СвойствоРазмерКнопок)
				И Не Сценарий = СценарийСамообслуживание Тогда
			РезультатФункции = Ложь;
		ИначеЕсли СвойствоНастройки = СвойствоВысотаКнопок И Сценарий = СценарийСамообслуживание Тогда
			РезультатФункции = Ложь;
		КонецЕсли;
		
	ИначеЕсли ЗаголовокОбласти = ЗаголовкиОбластей.ОбластьПанельОпераций Тогда
		
		Если (СвойствоНастройки = СвойствоСтатусСмены Или СвойствоНастройки = СвойствоОбластьПрименения)
				И Сценарий = СценарийСамообслуживание Тогда
			РезультатФункции = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СкорректироватьВысотуКнопкиОплатыВРежимеКСО(КнопкаОплаты ,НастройкиКнопкиОплаты)
	
	СвойствоВысота = ПредопределенноеЗначение("Перечисление.СвойстваЭлементовРМК.ВысотаКнопок");
	ЗначениеВысоты = НастройкиКнопкиОплаты.Получить(СвойствоВысота);
	Если ЗначениеЗаполнено(ЗначениеВысоты) Тогда
		КнопкаОплаты.Родитель.Высота = ЗначениеВысоты;
		КнопкаОплаты.МаксимальнаяВысота = ЗначениеВысоты;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтрокуВидаКонтроля(СтрокиВидовКонтроля, ВидКонтроля)
	
	РезультатФункции = Неопределено;
	КоличествоСтрок = СтрокиВидовКонтроля.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаВидаКонтроля = СтрокиВидовКонтроля.Получить(ИндексСтроки);
		Если СтрокаВидаКонтроля.ВидКонтроля = ВидКонтроля Тогда
			РезультатФункции = СтрокаВидаКонтроля;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьСтрокуЭлементаКонтроляПродаж(ЭлементыКонтроляПродаж, КонтрольПродаж)
	
	РезультатФункции = Неопределено;
	КоличествоСтрок = ЭлементыКонтроляПродаж.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаЭлементаКонтроляПродаж = ЭлементыКонтроляПродаж.Получить(ИндексСтроки);
		Если СтрокаЭлементаКонтроляПродаж.КонтрольПродаж = КонтрольПродаж Тогда
			РезультатФункции = СтрокаЭлементаКонтроляПродаж;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьСтрокуКонтроля(СтрокиКонтроля, СтрокаКонтроляИсточник)
	
	РезультатФункции = Неопределено;
	КоличествоСтрок = СтрокиКонтроля.Количество();
	ИндексСтроки = 0;
	ИменаСравниваемыхПолей = "ВидКонтроля,НачалоПериода,КонецПериода,ДеньНедели,ВремяНачала,ВремяОкончания";
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаКонтроля = СтрокиКонтроля.Получить(ИндексСтроки);
		
		Если СтруктурыИдентичны(СтрокаКонтроля, СтрокаКонтроляИсточник, ИменаСравниваемыхПолей) Тогда
			РезультатФункции = СтрокаКонтроля;
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Функция СтруктурыИдентичны(СтруктураПервая, СтруктураВторая, ИменаПолей)
	
	РезультатФункции = Истина;
	МассивПолей = СтрРазделить(ИменаПолей, ",");
	
	КоличествоПолей = МассивПолей.Количество();
	ИндексПоля = 0;
	Пока ИндексПоля < КоличествоПолей И РезультатФункции = Истина Цикл
		ИмяПоля = МассивПолей[ИндексПоля];
		ЗначениеПервое = Неопределено;
		ЗначениеВторое = Неопределено;
		СтруктураПервая.Свойство(ИмяПоля, ЗначениеПервое);
		СтруктураВторая.Свойство(ИмяПоля, ЗначениеВторое);
		Если Не ЗначениеПервое = ЗначениеВторое Тогда
			РезультатФункции = Ложь;
		КонецЕсли;
		ИндексПоля = ИндексПоля + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ПеренестиНедостающиеЭлементыПростогоМассива(МассивИсточник, МассивПриемник)
	
	Для Каждого ЭлементМассива Из МассивИсточник Цикл
		Если МассивПриемник.Найти(ЭлементМассива) = Неопределено Тогда
			МассивПриемник.Добавить(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтрокуНоменклатурыКонтроляПродаж(НоменклатураКонтроляПродажПриемник,
		СтрокаНоменклатурыКонтроляИсточник)
		
	РезультатФункции = Неопределено;
	КоличествоСтрок = НоменклатураКонтроляПродажПриемник.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаНоменклатурыКонтроляПродаж = НоменклатураКонтроляПродажПриемник.Получить(ИндексСтроки);
		Если СтрокаНоменклатурыКонтроляПродаж.Номенклатура = СтрокаНоменклатурыКонтроляИсточник.Номенклатура
			И СтрокаНоменклатурыКонтроляПродаж.Характеристика = СтрокаНоменклатурыКонтроляИсточник.Характеристика Тогда
			
			РезультатФункции = СтрокаНоменклатурыКонтроляПродаж;
			
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ВосстановитьПодсказки(ЭлементПодгруппы)
	Для Каждого ЭлементСтраницы Из ЭлементПодгруппы.ПодчиненныеЭлементы Цикл
		Если Найти(ЭлементСтраницы.Имя, "Подсказка") > 0 Тогда
			УстановитьВидимостьЭлементаФормы(ЭлементСтраницы, Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция МаскаВводаДаты()
	Возврат НСтр("ru = '99.99.9999'");
КонецФункции

Функция ОставитьЦифрыТелефонаБезКодаСтраны(ИсходноеЗначение)
	
	ДлинаНомераТелефона = 10;
	РезультатФункции = ИсходноеЗначение;
	Если СтрНайти(РезультатФункции, ТелефонныйКодСтраны()) = 1 Тогда
		РезультатФункции = Сред(РезультатФункции, СтрДлина(ТелефонныйКодСтраны()) + 1);
		РезультатФункции = ТолькоЦифры(РезультатФункции);
	Иначе
		РезультатФункции = ТолькоЦифры(РезультатФункции);
		Если СтрДлина(РезультатФункции) > ДлинаНомераТелефона Тогда
			РезультатФункции = Прав(РезультатФункции, ДлинаНомераТелефона);
		КонецЕсли;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПозицияПоследнейЦифрыВСтроке(ПроверяемаяСтрока)
	
	РезультатФункции = 0;
	
	КоличествоСимволов = СтрДлина(ПроверяемаяСтрока);
	ИндексСимвола = КоличествоСимволов;
	Пока ИндексСимвола > 0 И РезультатФункции = 0 Цикл
		ПроверяемыйСимвол = Сред(ПроверяемаяСтрока, ИндексСимвола, 1);
		Если СтрНайти("0123456789", ПроверяемыйСимвол) > 0 Тогда
			РезультатФункции = ИндексСимвола;
		КонецЕсли;
		ИндексСимвола = ИндексСимвола - 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПараметрыИнтерфейсаКСО()
	
	ПараметрыИнтерфейса = Новый Структура;
	ПараметрыИнтерфейса.Вставить("ВысотаКоманды", 2);
	ПараметрыИнтерфейса.Вставить("ШиринаКоманды", 5);
	ПараметрыИнтерфейса.Вставить("ШиринаКомандыСНадписью", 13);
	
	Возврат ПараметрыИнтерфейса;
	
КонецФункции

Функция ПараметрыПлиточногоИнтерфейса() Экспорт
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ПараметрыИнтерфейса = Новый Структура;
	ПараметрыИнтерфейса.Вставить("ВысотаКоманды", 3);
	ПараметрыИнтерфейса.Вставить("ШиринаКоманды", 6);
	ПараметрыИнтерфейса.Вставить("ШиринаКомандыСНадписью", 13);
	ПараметрыИнтерфейса.Вставить("ВысотаКартинкиСтарта", ?(ЭтоИнтерфейс85, 2, 3));
	
	Возврат ПараметрыИнтерфейса;
	
КонецФункции

Процедура НастроитьПанельУправленияЧекомВРежимеВводаТоваров(Форма, Элементы)
	
	АктивизироватьСлойГруппы(Форма, Элементы.ГруппаКомандПереходаКОплате);
	
	ОбщегоНазначенияРМККлиентСервер.УстановитьТекущуюСтраницу(Элементы.СтраницаУправленияЧеком);
	
КонецПроцедуры

Процедура СкрытьРазделОплатыПриНеобходимости(Элементы, КнопкаРаздела, ГруппаОплатыРаздела, ГруппаПодсказкаРаздела, РеквизитРаздела)
	Если РеквизитРаздела = 0 Тогда
		УстановитьВидимостьЭлементаФормы(ГруппаОплатыРаздела, Ложь);
		УстановитьВидимостьЭлементаФормы(КнопкаРаздела, Ложь);
		Если ГруппаПодсказкаРаздела <> Неопределено Тогда
			УстановитьВидимостьЭлементаФормы(ГруппаПодсказкаРаздела, Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПереключитьНаСлойГруппы(ГруппаРодитель, ЭлементГруппа)
	Для Каждого СлойГруппы Из ГруппаРодитель.ПодчиненныеЭлементы Цикл
		УстановитьВидимостьЭлементаФормы(СлойГруппы, (ЭлементГруппа = СлойГруппы));
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьВидимостьЭлементаФормы(Элемент, Видимость)
	Элемент.Видимость = Видимость;
КонецПроцедуры

Процедура УстановитьДоступностьЭлементаФормы(Элемент, Доступность)
	Элемент.Доступность = Доступность;
КонецПроцедуры

Процедура УстановитьПараметрыЭлементовКСО(ГруппаПанельДействий)
	
	Для Каждого ПодчиненнаяГруппа Из ГруппаПанельДействий.ПодчиненныеЭлементы Цикл
		
		Если СтрНачинаетсяС(ПодчиненнаяГруппа.Имя, "НЕКСО") Тогда
			ПодчиненнаяГруппа.Видимость = Ложь;
		ИначеЕсли СтрНачинаетсяС(ПодчиненнаяГруппа.Имя, "КСО") Тогда
			ПодчиненнаяГруппа.Видимость = Истина;
		ИначеЕсли СтрНачинаетсяС(ПодчиненнаяГруппа.Имя, "Группа") Тогда
			УстановитьПараметрыЭлементовКСО(ПодчиненнаяГруппа);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
