
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ДатаДокумента = Объект.Дата;
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Компания = Константы.УчетПоКомпании.Компания(Объект.Организация);
	ВалютаПоУмолчанию = Константы.НациональнаяВалюта.Получить();
	
	ОписаниеРежимовПросмотра = ОписаниеПереключенияРежимов();
	ОписаниеРежимовПросмотра.Сотрудники.ИмяСтраницы = Элементы.СтраницаТолькоСотрудники.Имя;
	ОписаниеРежимовПросмотра.Сотрудники.ИмяТаблицыСотрудники = Элементы.Сотрудники.Имя;
	ОписаниеРежимовПросмотра.НачисленияУдержания.ИмяСтраницы = Элементы.СтраницаНачисленияУдержания.Имя;
	ОписаниеРежимовПросмотра.НачисленияУдержания.ИмяТаблицыСотрудники = Элементы.СотрудникиНачислений.Имя;
	ОписаниеРежимовПросмотра.Налоги.ИмяСтраницы = Элементы.СтраницаНалоги.Имя;
	ОписаниеРежимовПросмотра.Налоги.ИмяТаблицыСотрудники = Элементы.СотрудникиНалоги.Имя;
	
	ИмяТабличнойЧасти = ОписаниеРежимовПросмотра.Сотрудники.ИмяТаблицыСотрудники;
	РежимПросмотраСотрудники = ОписаниеРежимовПросмотра.Сотрудники.СписокЗначение;
	РежимПросмотраСотрудникиПредыдущий = РежимПросмотраСотрудники;
	ОбновитьОписаниеРежимов(ОписаниеРежимовПросмотра, РежимПросмотраСотрудники,
		Объект.НачисленияУдержания.Количество(), Объект.НалогиНаДоходы.Количество());
		
	Элементы.РежимПросмотраСотрудники.СписокВыбора.Очистить();
	Элементы.РежимПросмотраСотрудники.СписокВыбора.Добавить(ОписаниеРежимовПросмотра.Сотрудники.СписокЗначение,
		ОписаниеРежимовПросмотра.Сотрудники.СписокПредставление);
	Элементы.РежимПросмотраСотрудники.СписокВыбора.Добавить(ОписаниеРежимовПросмотра.НачисленияУдержания.СписокЗначение,
		ОписаниеРежимовПросмотра.НачисленияУдержания.СписокПредставление);
	Элементы.РежимПросмотраСотрудники.СписокВыбора.Добавить(ОписаниеРежимовПросмотра.Налоги.СписокЗначение,
		ОписаниеРежимовПросмотра.Налоги.СписокПредставление);
	
	ВестиШтатноеРасписание = Константы.ФункциональнаяОпцияВестиШтатноеРасписание.Получить();
	
	ВидОперации = Объект.ВидОперации;
	
	ОбработатьСобытиеНаСервере();
	
	Если НЕ Константы.ФункциональнаяОпцияИспользоватьСовместительство.Получить() Тогда
		
		Если Элементы.Найти("СотрудникиСотрудникКод") <> Неопределено Тогда
			
			Элементы.СотрудникиСотрудникКод.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ЗначениеНастройки = ПерсональныеНастройкиРУНФ.Прочитать("ОсновноеПодразделение");
	ОсновноеПодразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки,
		Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить() Тогда
		Элементы.СотрудникиПрежнееПодразделение.Видимость = Ложь;
	КонецЕсли;
	
	УчетНалогов = ПолучитьФункциональнуюОпцию("ВестиУчетНалогаНаДоходыИВзносов");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТекущийСотрудникНалоги", "Видимость",
		УчетНалогов);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
	УстановитьУсловноеОформлениеФормы();

	ИспользоватьМногофирменныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Если Не ИспользоватьМногофирменныйУчет И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Организация.Гиперссылка = Истина;
	КонецЕсли;
	
	РежимПросмотраСотрудники = "Сотрудники";
	РежимПросмотраСотрудникиПредыдущий = РежимПросмотраСотрудники;
	
	АдаптацияФормыТакси();
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбработатьСобытиеНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	Оповестить("ИзменениеПоКадровомуУчету");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьДоступностьПоляСумма();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДанныеДляИзмененияДаты = ДокументыУНФКлиент.ДанныеДляИзмененияДаты(ЭтотОбъект, Объект);
	Если ДанныеДляИзмененияДаты.ДатаНеМенялась Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписьРуководителяНажатие(Элемент)
	
	ОткрытьФормуРеквизитыПечати();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПередИзменением = ВидОперации;
	ВидОперации = Объект.ВидОперации;
	
	Если ВидОперации <> ВидОперацииПередИзменением Тогда
		
		ПриИзмененииВидаОперации();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПросмотраСотрудникиПриИзменении(Элемент)

	ОписаниеПредыдущее = ОписаниеРежимовПросмотра[РежимПросмотраСотрудникиПредыдущий];
	
	ТекущаяСтрока = Элементы[ОписаниеПредыдущее.ИмяТаблицыСотрудники].ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		Элементы.Сотрудники.ТекущаяСтрока = ТекущаяСтрока;
		Элементы.СотрудникиНачислений.ТекущаяСтрока = ТекущаяСтрока;
		Элементы.СотрудникиНалоги.ТекущаяСтрока = ТекущаяСтрока;
	КонецЕсли;
	РежимПросмотраСотрудникиПредыдущий = РежимПросмотраСотрудники;
	
	ОписаниеТекущее = ОписаниеРежимовПросмотра[РежимПросмотраСотрудники];
	Элементы.СтраницыДанныеСотрудников.ТекущаяСтраница = Элементы[ОписаниеТекущее.ИмяСтраницы];
	
	ОбновитьЭлементРежимПросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура СтраницыДанныеСотрудниковПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОткрытыйРежим = "";
	Для Каждого Режим Из ОписаниеРежимовПросмотра Цикл
		Если ТекущаяСтраница.Имя = Режим.Значение.ИмяСтраницы Тогда
			ОткрытыйРежим = Режим.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОткрытыйРежим) И ОткрытыйРежим <> РежимПросмотраСотрудники Тогда
		РежимПросмотраСотрудники = ОткрытыйРежим;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийСвернутоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	
	ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, "НачисленияУдержания");
	ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, "НалогиНаДоходы");
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ИмяТабличнойЧасти = "Сотрудники";
	Если НоваяСтрока Тогда

		ТабличныеЧастиУНФКлиент.ДобавитьКлючСвязиВСтрокуТабличнойЧасти(ЭтотОбъект);
		ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, "НачисленияУдержания");
		ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, "НалогиНаДоходы");
		
		СтрокаТабличнойЧасти = Элементы.Сотрудники.ТекущиеДанные;
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередУдалением(Элемент, Отказ)
	
	ИмяТабличнойЧасти = "Сотрудники";
	Для Каждого ВыделеннаяСтрока Из Элементы.Сотрудники.ПолучитьСтрокиДляОбработки() Цикл
		ТекущиеДанныеСтроки = Элементы.Сотрудники.ДанныеСтроки(ВыделеннаяСтрока);
		ТабличныеЧастиУНФКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтотОбъект, "НачисленияУдержания", Ложь,
			ТекущиеДанныеСтроки);
		ТабличныеЧастиУНФКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтотОбъект, "НалогиНаДоходы", Ложь,
			ТекущиеДанныеСтроки);
	КонецЦикла;

	ОбновитьЭлементРежимПросмотра();

КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	ТекущиеДанные.Период = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСотрудник = Новый Структура();
	СтруктураСотрудник.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
	СтруктураСотрудник.Вставить("Период", ТекущиеДанные.Период);
	СтруктураСотрудник.Вставить("Организация", Объект.Организация);
	
	ПолучитьДанныеСотрудника(СтруктураСотрудник);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураСотрудник);
		
	ТекущиеДанные.ПрежнееПодразделение = СтруктураСотрудник.СтруктурнаяЕдиница;
	ТекущиеДанные.ПрежняяДолжность = СтруктураСотрудник.Должность;
	ТекущиеДанные.ПрежнееКоличествоЗанимаемыхСтавок = СтруктураСотрудник.ЗанимаемыхСтавок;
	ТекущиеДанные.ПрежнийГрафикРаботы = СтруктураСотрудник.ГрафикРаботы;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СтруктурнаяЕдиница) Тогда
		ТекущиеДанные.СтруктурнаяЕдиница = ОсновноеПодразделение;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПериодПриИзменении(Элемент)
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	СтруктураСотрудник = Новый Структура();
	СтруктураСотрудник.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
	СтруктураСотрудник.Вставить("Период", ТекущиеДанные.Период);
	СтруктураСотрудник.Вставить("Организация", Объект.Организация);
	
	ПолучитьДанныеСотрудника(СтруктураСотрудник);
	
	ТекущиеДанные.ПрежнееПодразделение = СтруктураСотрудник.СтруктурнаяЕдиница;
	ТекущиеДанные.ПрежняяДолжность = СтруктураСотрудник.Должность;
	ТекущиеДанные.ПрежнееКоличествоЗанимаемыхСтавок = СтруктураСотрудник.ЗанимаемыхСтавок;
	ТекущиеДанные.ПрежнийГрафикРаботы = СтруктураСотрудник.ГрафикРаботы;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СтруктурнаяЕдиница) И НЕ ЗначениеЗаполнено(ТекущиеДанные.Должность) И НЕ ЗначениеЗаполнено(ТекущиеДанные.ГрафикРаботы) Тогда	
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураСотрудник);	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисленияУдержания

&НаКлиенте
Процедура НачисленияУдержанияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТабличныеЧастиУНФКлиент.ДобавитьКлючСвязиВСтрокуПодчиненнойТабличнойЧасти(ЭтотОбъект, Элемент.Имя);
		СтрокаТабличнойЧасти = Элементы.НачисленияУдержания.ТекущиеДанные;
		СтрокаТабличнойЧасти.Валюта = ВалютаПоУмолчанию;
		СтрокаТабличнойЧасти.Актуальность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

#Если МобильныйКлиент Тогда
	Если НеВыбранаСтрокаСотрудника(Элемент.Имя) Тогда
		Отказ = Истина;
	КонецЕсли; 
#Иначе
	Если ТабличныеЧастиУНФКлиент.НеВыбранаСтрокаОсновнойТЧ(ЭтотОбъект, Элемент.Имя) Тогда
		Отказ = Истина;
	КонецЕсли; 
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияВидНачисленияУдержанияПриИзменении(Элемент)
	
	ЗарплатаИПерсоналКлиент.СчетЗатратПоУмолчаниюВТекущуюСтроку(ЭтотОбъект);
	УстановитьДоступностьПоляСумма();
	
КонецПроцедуры // НачисленияУдержанияВидНачисленияУдержанияПриИзменении()

&НаКлиенте
Процедура НачисленияУдержанияСчетЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаИПерсоналКлиент.ПараметрыВыбораСчетаЗатрат(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНалогиНаДоходы

&НаКлиенте
Процедура НалогиНаДоходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТабличныеЧастиУНФКлиент.ДобавитьКлючСвязиВСтрокуПодчиненнойТабличнойЧасти(ЭтотОбъект, Элемент.Имя);
		СтрокаТабличнойЧасти = Элементы.НалогиНаДоходы.ТекущиеДанные;
		СтрокаТабличнойЧасти.Валюта = ВалютаПоУмолчанию;
		СтрокаТабличнойЧасти.Актуальность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НалогиНаДоходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
#Если МобильныйКлиент Тогда
	Если НеВыбранаСтрокаСотрудника(Элемент.Имя) Тогда
		Отказ = Истина;
	КонецЕсли; 
#Иначе
	Если ТабличныеЧастиУНФКлиент.НеВыбранаСтрокаОсновнойТЧ(ЭтотОбъект, Элемент.Имя) Тогда
		Отказ = Истина;
	КонецЕсли; 
#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудникиНачислений

&НаКлиенте
Процедура СотрудникиНачисленийПриАктивизацииСтроки(Элемент)
	ИмяТабличнойЧасти = Элементы.СотрудникиНачислений.Имя;
	ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, Элементы.НачисленияУдержания.Имя);
	
	Если ЭтоМобильныйКлиент И Элемент.ТекущиеДанные <> Неопределено Тогда
		Элементы.ГруппаТаблицаНачисления.Заголовок = СтрШаблон(НСтр("ru = 'Начисления и удержания сотрудника ""%1""'"),
			Элемент.ТекущиеДанные.Сотрудник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиНачисленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если ЭтоМобильныйКлиент Тогда
		Элементы.СотрудникиНачислений.Видимость = Ложь;
		Элементы.ВыбратьСотрудникаНачислений.Видимость = Истина;
		Элементы.ГруппаТаблицаНачисления.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудникиНалоги

&НаКлиенте
Процедура СотрудникиНалогиПриАктивизацииСтроки(Элемент)
	ИмяТабличнойЧасти = Элементы.СотрудникиНалоги.Имя;
	ТабличныеЧастиУНФКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, Элементы.НалогиНаДоходы.Имя);
	
	Если ЭтоМобильныйКлиент И Элемент.ТекущиеДанные <> Неопределено Тогда
		Элементы.ГруппаТаблицаНалоги.Заголовок = СтрШаблон(НСтр("ru = 'Налоги сотрудника ""%1""'"),
			Элемент.ТекущиеДанные.Сотрудник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиНалогиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если ЭтоМобильныйКлиент Тогда
		Элементы.СотрудникиНалоги.Видимость = Ложь;
		Элементы.ВыбратьСотрудникаНалоги.Видимость = Истина;
		Элементы.ГруппаТаблицаНалоги.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьНачисленияУдержания(Команда)	
	
	СтрокаТабличнойЧасти = Элементы.СотрудникиНачислений.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбрана строка табличной части ""Сотрудники"".'");
		Сообщение.Сообщить();	
		Возврат;
		
	КонецЕсли;  
	
	ОтборСотрудник = Новый Структура("КлючСвязи", СтрокаТабличнойЧасти.КлючСвязи);
	Если Объект.НачисленияУдержания.НайтиСтроки(ОтборСотрудник).Количество() = 0 Тогда
		ЗаполнитьНачисленияУдержанияФрагмент(СтрокаТабличнойЧасти);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьНачисленияУдержанияЗавершение", ЭтотОбъект,
			Новый Структура("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти));
		ТекстВопроса = НСтр("ru = 'Табличная часть ""Начисления и удержания"" будет очищена. Продолжить выполнение операции?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНалогиНаДоходы(Команда)	
	
	СтрокаТабличнойЧасти = Элементы.СотрудникиНалоги.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбрана строка табличной части ""Сотрудники"".'");
		Сообщение.Сообщить();	
		Возврат;
		
	КонецЕсли;  
	
	ОтборСотрудник = Новый Структура("КлючСвязи", СтрокаТабличнойЧасти.КлючСвязи);
	Если Объект.НалогиНаДоходы.НайтиСтроки(ОтборСотрудник).Количество()	= 0 Тогда
		ЗаполнитьНалогиНаДоходыФрагмент(СтрокаТабличнойЧасти);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьНалогиНаДоходыЗавершение", ЭтотОбъект,
			Новый Структура("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти));
		ТекстВопроса = НСтр("ru = 'Табличная часть ""Налоги на доходы"" будет очищена. Продолжить выполнение операции?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьКомментарий(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСотрудникаНачислений(Команда)
	
	Элементы.СотрудникиНачислений.Видимость = Истина;
	Элементы.ВыбратьСотрудникаНачислений.Видимость = Ложь;
	Элементы.ГруппаТаблицаНачисления.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСотрудникаНалоги(Команда)

	Элементы.СотрудникиНалоги.Видимость = Истина;
	Элементы.ВыбратьСотрудникаНалоги.Видимость = Ложь;
	Элементы.ГруппаТаблицаНалоги.Видимость = Ложь;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;

	Элементы.Комментарий.КнопкаВыбора = Истина;
	Элементы.Переместить(Элементы.СотрудникиНачисленийЗаполнитьНачисленияУдержания,
		Элементы.ГруппаКомандыНачисленияУдержания);
	Элементы.Переместить(Элементы.СотрудникиНалогиЗаполнитьНалогиНаДоходы,		Элементы.НалогиНаДоходы.КоманднаяПанель);
		
	ЗаголовокЗаполнить = НСтр("ru = 'Заполнить'");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		Элементы.СотрудникиНачисленийЗаполнитьНачисленияУдержания.Имя, "Заголовок", ЗаголовокЗаполнить);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		Элементы.СотрудникиНалогиЗаполнитьНалогиНаДоходы.Имя, "Заголовок", ЗаголовокЗаполнить);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПодвалСвернут", "Видимость", Ложь);	
КонецПроцедуры

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	МобильныйКлиентУНФ.НастроитьФормуОбъектаМобильныйКлиент(Элементы);
	
	Элементы.СотрудникиНачислений.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Элементы.СотрудникиНачислений.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	Элементы.ГруппаТаблицаНачисления.ОтображатьЗаголовок = Истина;
	Элементы.ГруппаТаблицаНачисления.Видимость = Ложь;
	
	Элементы.СотрудникиНалоги.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Элементы.СотрудникиНалоги.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	Элементы.ГруппаТаблицаНалоги.ОтображатьЗаголовок = Истина;
	Элементы.ГруппаТаблицаНалоги.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеПереключенияРежимов()
	
	ОписаниеРежима = Новый Структура;
	ОписаниеРежима.Вставить("ИмяСтраницы", "");
	ОписаниеРежима.Вставить("ИмяТаблицыСотрудники", "");
	ОписаниеРежима.Вставить("Заголовок", "");
	ОписаниеРежима.Вставить("СписокЗначение", "");
	ОписаниеРежима.Вставить("СписокПредставление", "");
	ОписаниеРежима.Вставить("ОтображатьКоличествоНачисления", Истина);
	ОписаниеРежима.Вставить("ОтображатьКоличествоНалоги", Истина);
	
	ШаблонОписания = Новый ФиксированнаяСтруктура(ОписаниеРежима);
	
	Результат = Новый Структура;
	
	КлючСотрудники = "Сотрудники";
	Результат.Вставить(КлючСотрудники, Новый Структура(ШаблонОписания));
	Результат.Сотрудники.СписокЗначение = КлючСотрудники;
	Результат.Сотрудники.Заголовок = НСтр("ru = 'Сотрудники'");
	Результат.Сотрудники.СписокПредставление = Результат.Сотрудники.Заголовок;
	
	КлючНачисления = "НачисленияУдержания";
	Результат.Вставить(КлючНачисления, Новый Структура(ШаблонОписания));
	Результат.НачисленияУдержания.СписокЗначение = КлючНачисления;
	Результат.НачисленияУдержания.Заголовок = НСтр("ru = 'Начисления и удержания сотрудников'");
	Результат.НачисленияУдержания.Вставить("ОтображатьКоличествоНачисления", Ложь);
	
	КлючНалоги = "Налоги";
	Результат.Вставить(КлючНалоги, Новый Структура(ШаблонОписания));
	Результат.Налоги.СписокЗначение = "Налоги";
	Результат.Налоги.Заголовок = НСтр("ru = 'Налоги сотрудников'");
	Результат.Налоги.Вставить("ОтображатьКоличествоНалоги", Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЭлементРежимПросмотра()
	
	ОбновитьОписаниеРежимов(ОписаниеРежимовПросмотра, РежимПросмотраСотрудники,
		Объект.НачисленияУдержания.Количество(), Объект.НалогиНаДоходы.Количество());
		
	ЭлементНачисления = Элементы.РежимПросмотраСотрудники.СписокВыбора.НайтиПоЗначению(
		ОписаниеРежимовПросмотра.НачисленияУдержания.СписокЗначение);
	Если ЭлементНачисления <> Неопределено Тогда
		ЭлементНачисления.Представление = ОписаниеРежимовПросмотра.НачисленияУдержания.СписокПредставление;
	КонецЕсли;
	
	ЭлементНалоги = Элементы.РежимПросмотраСотрудники.СписокВыбора.НайтиПоЗначению(
		ОписаниеРежимовПросмотра.Налоги.СписокЗначение);
	Если ЭлементНалоги <> Неопределено Тогда
		ЭлементНалоги.Представление = ОписаниеРежимовПросмотра.Налоги.СписокПредставление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОписаниеРежимов(ОписаниеРежимов, ТекущийРежим, КоличествоНачисления, КоличествоНалоги)
	
	ШаблонКоличество = "%1 (%2)";
	
	ТекущееОписание = ОписаниеРежимов[ТекущийРежим];
	
	ЗаголовокНачисления = ОписаниеРежимов.НачисленияУдержания.Заголовок;
	Если ТекущееОписание.ОтображатьКоличествоНачисления Тогда
		ЗаголовокНачисления = СтрШаблон(ШаблонКоличество, ЗаголовокНачисления, КоличествоНачисления);
	КонецЕсли;
	ОписаниеРежимов.НачисленияУдержания.СписокПредставление = ЗаголовокНачисления;
	
	ЗаголовокНалоги = ОписаниеРежимов.Налоги.Заголовок;
	Если ТекущееОписание.ОтображатьКоличествоНалоги Тогда
		ЗаголовокНалоги = СтрШаблон(ШаблонКоличество, ЗаголовокНалоги, КоличествоНалоги);
	КонецЕсли;
	ОписаниеРежимов.Налоги.СписокПредставление = ЗаголовокНалоги;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеБлокировкиСуммы(ВидНачисленияУдержания)
	
	Если НЕ ЗначениеЗаполнено(ВидНачисленияУдержания) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДанныеНачисления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидНачисленияУдержания,
		"Предопределенный, Формула");
	
	Возврат ДанныеНачисления.Предопределенный	ИЛИ НЕ ЗначениеЗаполнено(ДанныеНачисления.Формула);
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьПоляСумма()
	
	ТекущиеДанные = Элементы.НачисленияУдержания.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.ВидНачисленияУдержания) Тогда
		
		ТекущиеДанные.СуммаЗаблокирована = ПолучитьЗначениеБлокировкиСуммы(ТекущиеДанные.ВидНачисленияУдержания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	УсловноеОформление.Элементы.Очистить();
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"Объект.НачисленияУдержания.СуммаЗаблокирована", Истина);
	РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление,
		Элементы.НачисленияУдержанияСумма.Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление,
		"ЦветТекста", ЦветаПалитры.ТекстВторостепеннойНадписиУНФ);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление,
		"Текст", НСтр("ru = '<Значение не требуется>'"));
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр", Истина);

КонецПроцедуры
	
&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКоманду(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиНачисленияУдержанияСотрудникаСервер(СтруктураОтбора, Налог = Ложь)	
	
	Документ = РеквизитФормыВЗначение("Объект");
	РезультатПоиска = Документ.НайтиНачисленияУдержанияСотрудника(СтруктураОтбора, Налог);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
	Возврат РезультатПоиска;
	
КонецФункции

&НаСервере
Процедура ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты)
	
	ДокументыУНФ.ДатаПриИзменении(ДанныеДляИзмененияДаты, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ДокументыУНФ.ОрганизацияПриИзменении(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
// Заполняет значения ТЧ Сотрудники.
//
Процедура ЗаполнитьЗначения()
	
	Если Объект.Сотрудники.Количество() = 0
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийКадровоеПеремещение.ИзменениеСпособаОплаты Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект.Сотрудники Цикл
		
		СтруктураСотрудник = Новый Структура;
		СтруктураСотрудник.Вставить("Период", СтрокаТЧ.Период - 1);
		СтруктураСотрудник.Вставить("Сотрудник", СтрокаТЧ.Сотрудник);
		СтруктураСотрудник.Вставить("Организация", Объект.Организация);
		
		ПолучитьДанныеСотрудника(СтруктураСотрудник);
		
		СтрокаТЧ.ПрежнееПодразделение = СтруктураСотрудник.СтруктурнаяЕдиница;
		СтрокаТЧ.ПрежняяДолжность = СтруктураСотрудник.Должность;
		СтрокаТЧ.ПрежнееКоличествоЗанимаемыхСтавок = СтруктураСотрудник.ЗанимаемыхСтавок;
		СтрокаТЧ.ПрежнийГрафикРаботы = СтруктураСотрудник.ГрафикРаботы;
		
	КонецЦикла;
	
КонецПроцедуры // 

&НаСервереБезКонтекста
// Получает с сервера набор данных из РС Сотрудники.
//
Процедура ПолучитьДанныеСотрудника(СтруктураСотрудник)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.Должность,
	|	СотрудникиСрезПоследних.ЗанимаемыхСтавок,
	|	СотрудникиСрезПоследних.ГрафикРаботы
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&Период,
	|			Сотрудник = &Сотрудник
	|				И Организация = &Организация) КАК СотрудникиСрезПоследних");
	
	Запрос.УстановитьПараметр("Период", СтруктураСотрудник.Период);
	Запрос.УстановитьПараметр("Сотрудник", СтруктураСотрудник.Сотрудник);
	Запрос.УстановитьПараметр("Организация", Константы.УчетПоКомпании.Компания(СтруктураСотрудник.Организация));
	
	СтруктураСотрудник.Вставить("СтруктурнаяЕдиница");
	СтруктураСотрудник.Вставить("Должность");
	СтруктураСотрудник.Вставить("ЗанимаемыхСтавок", 1);
	СтруктураСотрудник.Вставить("ГрафикРаботы");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураСотрудник, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура устанавливает доступность элементов формы на клиенте.
//
Процедура УстановитьВидимостьНаСервере()
	
	ЭтоКадровоеПеремещениеОклад = (Объект.ВидОперации
		= ПредопределенноеЗначение("Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты"));
	
	Элементы.СотрудникиПрежнийГрафикРаботы.Видимость 	= ЭтоКадровоеПеремещениеОклад;
	Элементы.СотрудникиПрежняяДолжность.Видимость 		= ЭтоКадровоеПеремещениеОклад;
	Элементы.СотрудникиПрежнееПодразделение.Видимость	= ЭтоКадровоеПеремещениеОклад;
	Элементы.СотрудникиГрафикРаботы.Видимость 			= ЭтоКадровоеПеремещениеОклад;
	Элементы.СотрудникиДолжность.Видимость 				= ЭтоКадровоеПеремещениеОклад;
	Элементы.СотрудникиСтруктурнаяЕдиница.Видимость 	= ЭтоКадровоеПеремещениеОклад;
	
	Если ЭтоКадровоеПеремещениеОклад Тогда
		
		Элементы.СотрудникиПрежнееКоличествоЗанимаемыхСтавок.Видимость	= ВестиШтатноеРасписание;
		Элементы.СотрудникиЗанимаемыхСтавок.Видимость					= ВестиШтатноеРасписание;
		
		Элементы.СотрудникиСтруктурнаяЕдиница.АвтоВыборНезаполненного 	= Истина;
		Элементы.СотрудникиДолжность.АвтоВыборНезаполненного 			= Истина;
		Элементы.СотрудникиЗанимаемыхСтавок.АвтоВыборНезаполненного 	= Истина;
		Элементы.СотрудникиСтруктурнаяЕдиница.АвтоОтметкаНезаполненного = Истина;
		Элементы.СотрудникиДолжность.АвтоОтметкаНезаполненного 			= Истина;
		Элементы.СотрудникиЗанимаемыхСтавок.АвтоОтметкаНезаполненного 	= Истина;
		
	Иначе
		
		Элементы.СотрудникиПрежнееКоличествоЗанимаемыхСтавок.Видимость	= Ложь;
		Элементы.СотрудникиЗанимаемыхСтавок.Видимость					= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьНаСервере()

&НаСервере
Процедура ОбработатьСобытиеНаСервере(УстановитьВидимость = Истина, ЗаполнитьЗначения = Истина)
	
	Если УстановитьВидимость Тогда
		
		УстановитьВидимостьНаСервере();
		
	КонецЕсли;
	
	Если ЗаполнитьЗначения Тогда
		
		ЗаполнитьЗначения();
		
	КонецЕсли;
	
КонецПроцедуры //ОбработатьСобытиеНаСервере()

&НаКлиенте
Процедура ОткрытьФормуРеквизитыПечати()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиКадровоеПеремещение", 
		Новый Структура("КонтекстПечати", Объект), ЭтотОбъект, , , , ОписаниеОповещения);	
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВидаОперации()
	
	ОбновитьПрежниеЗначения = (Объект.ВидОперации
		= ПредопределенноеЗначение("Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты"));
	
	ОбработатьСобытиеНаСервере(, ОбновитьПрежниеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачисленияУдержанияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    СтрокаТабличнойЧасти = ДополнительныеПараметры.СтрокаТабличнойЧасти;
    
    Ответ = Результат;
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли; 
    
    ЗаполнитьНачисленияУдержанияФрагмент(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачисленияУдержанияФрагмент(Знач СтрокаТабличнойЧасти)
    
    Перем НоваяСтрока, РезультатПоиска, СтрокаПоиска, СтрОтбора, СтруктураОтбора;
    
    ТабличныеЧастиУНФКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтотОбъект, "НачисленияУдержания");
    
    СтруктураОтбора = Новый Структура;
    СтруктураОтбора.Вставить("Сотрудник", 	СтрокаТабличнойЧасти.Сотрудник);
    СтруктураОтбора.Вставить("Организация", Объект.Организация);
    СтруктураОтбора.Вставить("Дата", 		СтрокаТабличнойЧасти.Период);		
    РезультатПоиска = НайтиНачисленияУдержанияСотрудникаСервер(СтруктураОтбора);
    
    Для каждого СтрокаПоиска Из РезультатПоиска Цикл
        НоваяСтрока 						= Объект.НачисленияУдержания.Добавить();
        НоваяСтрока.ВидНачисленияУдержания 	= СтрокаПоиска.ВидНачисленияУдержания;		
        НоваяСтрока.Сумма 					= СтрокаПоиска.Сумма;
        НоваяСтрока.Валюта 					= СтрокаПоиска.Валюта;
        НоваяСтрока.СчетЗатрат			 	= СтрокаПоиска.СчетЗатрат;
        НоваяСтрока.Актуальность			= СтрокаПоиска.Актуальность;
        НоваяСтрока.КлючСвязи 				= СтрокаТабличнойЧасти.КлючСвязи;
    КонецЦикла;	
    
    СтрОтбора = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТабличнойЧасти.КлючСвязи);
    Элементы.НачисленияУдержания.ОтборСтрок 	= СтрОтбора;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНалогиНаДоходыЗавершение(Результат, ДополнительныеПараметры) Экспорт

	СтрокаТабличнойЧасти = ДополнительныеПараметры.СтрокаТабличнойЧасти;
	Ответ = Результат;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьНалогиНаДоходыФрагмент(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНалогиНаДоходыФрагмент(Знач СтрокаТабличнойЧасти)

	Перем НоваяСтрока, РезультатПоиска, СтрокаПоиска, СтрОтбора, СтруктураОтбора;

	ТабличныеЧастиУНФКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтотОбъект, "НалогиНаДоходы");

	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Сотрудник", СтрокаТабличнойЧасти.Сотрудник);
	СтруктураОтбора.Вставить("Организация", Объект.Организация);
	СтруктураОтбора.Вставить("Дата", СтрокаТабличнойЧасти.Период);
	РезультатПоиска = НайтиНачисленияУдержанияСотрудникаСервер(СтруктураОтбора, Истина);

	Для Каждого СтрокаПоиска Из РезультатПоиска Цикл
		НоваяСтрока 						= Объект.НалогиНаДоходы.Добавить();
		НоваяСтрока.ВидНачисленияУдержания 	= СтрокаПоиска.ВидНачисленияУдержания;
		НоваяСтрока.Валюта 					= СтрокаПоиска.Валюта;
		НоваяСтрока.Актуальность			= СтрокаПоиска.Актуальность;
		НоваяСтрока.КлючСвязи 				= СтрокаТабличнойЧасти.КлючСвязи;
	КонецЦикла;

	СтрОтбора = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТабличнойЧасти.КлючСвязи);
	Элементы.НалогиНаДоходы.ОтборСтрок 	= СтрОтбора;

КонецПроцедуры

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
// @skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

// @skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Функция НеВыбранаСтрокаСотрудника(ИмяЭлемента)
	
	ТекущийОтбор = Элементы[ИмяЭлемента].ОтборСтрок;
	Если ТипЗнч(ТекущийОтбор) = Тип("ФиксированнаяСтруктура") И ТекущийОтбор.Свойство("КлючСвязи") Тогда
		Возврат Ложь;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбрана строка Сотрудника'");
		Сообщение.Сообщить();
		Возврат Истина;
	КонецЕсли;

КонецФункции

#КонецОбласти
