#Область ОбъявлениеПеременных
// Таблица клиентская (массив структур) с иерархией построения плитки для текущего типа построения.
&НаКлиенте
Перем ДанныеДляПлитки Экспорт;

// Структура с возможными вариантами типов построения плитки: 0 - по палитре, 1 - весовой товар,
// 3 - распознанный весовой товар.
&НаКлиенте
Перем ТипыПостроенияПлитки Экспорт;

// Текущий тип построения плитки.
&НаКлиенте
Перем ТипПостроенияПлитки Экспорт;

// Соответствие свойств и их значений в разрезе элементов формы.
&НаКлиенте
Перем СвойстваНастроекЭлементов Экспорт;

// Идентификатор электронных весов, на которых происходит взвешивание в текущей операции выбора весового товара
&НаКлиенте
Перем ТекущиеЭлектронныеВесы Экспорт;

&НаКлиенте
Перем ЭлектронныеВесыЗаняты;

// Значения величины для кнопки установки дробного количества и плюс минус, при установке количества номенклатуре,
// У которой нет запрета ввода дробного количества
&НаКлиенте
Перем ВеличинаДробногоКоличества;

// Значение шага для кнопок плюс минус, при установке количества номенклатуре,
// у которой нет запрета ввода дробного количества
&НаКлиенте
Перем ШагДробногоКоличества;

// Признак подтверждения добавления товара с дробным количеством при подборе из плитки
&НаКлиенте
Перем ПодтверждениеДробногоТовара;

// Цвет кнопки отбора весового товара при не нажатом состоянии
&НаКлиенте
Перем ЦветФонаОтборВеса Экспорт;

// Цвет текста кнопки отбора весового товара при не нажатом состоянии
&НаКлиенте
Перем ЦветТекстаОтборВеса Экспорт;

// Хранит последнюю добавленную строку до момента начала любой новой операции
&НаКлиенте
Перем ДобавленнаяСтрока;

// Структура, содержащая кэши строк таблицы товаров, используемые при добавления строки.
&НаКлиенте
Перем КэшиСтрокТоваров;

// Структура, содержащая сохраняемые на клиенте данные контроля продаж для номенклатуры, которая есть в кэше плитки,
// которая есть в текущей корзине, чтобы не обращаться на сервер. когда строка добавляется только по данным на клиенте.
// Описание структуры в "интерфейсРМКСлужебныйКлиентСервер.ШаблонКэшаКонтроляПродаж()"
&НаКлиенте
Перем КэшКонтроляПродаж Экспорт;

// Соответствие, содержащее сохраняемые на клиенте данные уточнения принадлежности запасов для номенклатуры, которая есть в кэше плитки,
// которая есть в текущей корзине, чтобы не обращаться на сервер. когда строка добавляется только по данным на клиенте.
// Ключ соответствия Номенклатура, значение Структура, описание в "интерфейсРМКСлужебныйКлиентСервер.ШаблонКэшаУточненияПринадлежностиЗапасов()"
&НаКлиенте
Перем КэшУточненияПринадлежностиЗапасов Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущаяНастройкаРМК = Параметры.ТекущаяНастройкаРМК;
	ЗаполнитьТекущуюНастройкуРМК();
	РазмерыПлиткиПоУмолчанию = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьРазмерыПлиткиПоУмолчанию(ВертикальнаяОриентация);
	КоличествоЭлементовВРяду = РазмерыПлиткиПоУмолчанию.КоличествоЭлементовВРяду;
	КоличествоРядовНаСтранице = РазмерыПлиткиПоУмолчанию.КоличествоРядовНаСтранице;
	
	Организация = Параметры.Организация;
	Кассир = Параметры.Кассир;
	ТорговыйОбъект = Параметры.ТорговыйОбъект;
	ТекущийТорговыйОбъект = ТорговыйОбъект;
	ОтображатьНаименованиеДляПечати = Параметры.ОтображатьНаименованиеДляПечати;
	ОписаниеСостоянияПодарков = ПолучитьИзВременногоХранилища(Параметры.АдресСостоянияПодарков);
	Если ОписаниеСостоянияПодарков.Свойство("ТаблицаПодаркиБезВыбора") 
		И ОписаниеСостоянияПодарков.ТаблицаПодаркиБезВыбора.Количество() > 0 Тогда
		ТаблицаПодаркиБезВыбора.Загрузить(ОписаниеСостоянияПодарков.ТаблицаПодаркиБезВыбора);
		Для Каждого СтрПодарка Из ТаблицаПодаркиБезВыбора Цикл
			СтрПодарка.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
			СтрПодарка.КратностьУпаковок = 1;
		КонецЦикла;
	Конецесли;
	Если ОписаниеСостоянияПодарков.Свойство("ТаблицаПодаркиНаВыбор") 
		И ОписаниеСостоянияПодарков.ТаблицаПодаркиНаВыбор.Количество() > 0 Тогда 
		ТаблицаПодаркиНаВыбор.Загрузить(ОписаниеСостоянияПодарков.ТаблицаПодаркиНаВыбор);
		Для Каждого СтрПодарка Из ТаблицаПодаркиНаВыбор Цикл
			СтрПодарка.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
			СтрПодарка.КратностьУпаковок = 1;
		КонецЦикла;
	Конецесли;

	Если ОписаниеСостоянияПодарков.Свойство("ТаблицаРанееВыданныеПодарки") Тогда
		ТаблицаПодарков.Загрузить(ОписаниеСостоянияПодарков.ТаблицаРанееВыданныеПодарки);
		Для Каждого СтрПодарка Из ТаблицаПодарков Цикл
			СтрПодарка.КратностьУпаковок = 1;
			СтрПодарка.ВыданРанее = Истина;
		КонецЦикла;
	КонецЕсли;
	ПостроитьШаги();
	Если СкидкиШаги.Количество() > 0 ИЛИ ТаблицаПодарков.Количество() > 0 Тогда
		ТекущийНомерШага = 1;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	ЦветаФормы = ОбщегоНазначенияРМК.ЦветаФормыРМК();
	ОтображатьОстаток = Истина;
	ПустаяСтрокаТаблицыТоваров = СтруктураПустойСтрокиТаблицыТоваров();
	ЭтоПродажа = Параметры.ЭтоПродажа;
	ВидОперации = ОбщегоНазначенияРМК.ВидТекущейОперации(ЭтоПродажа);
	ИспользоватьКонтрольПродаж = Ложь;
	ОсновнаяОрганизцаия = Организация;
	ИспользоватьВыборСкладаПриПродаже = Ложь;
	ИспользоватьУточненияПринадлежностиЗапасов = Ложь;
	НастроитьКассировДляВхода = Ложь;
	
	МножественноеВыделениеТоваров = Ложь;
	ЗакрыватьПодборПриВыбореТовара = Ложь;
	ПодготовитьПлиточныйИнтерфейсПодбора();
	НастроитьВидимостьТолькоВыданныхПодарков();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИнициализироватьКлиентскиеПеременные();
	ИнициализироватьКлиентскиеПеречисленияФормы();
	
	ВыполнитьСерверныеДействияДляКлиента();
	
	КэшиСтрокТоваров = ОбщегоНазначенияРМККлиент.СтруктураКэшовСтрокТоваров();
	ЗаполнитьКэшПлитки();
	
	Для Каждого РанееВыданныйПодарок Из ТаблицаПодарков Цикл
		ОбработатьДобавлениеСтрокиВыданногоПодарка(РанееВыданныйПодарок);
	КонецЦикла;
	
	ОтобразитьТекущийШаг();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОтборВесовогоТовара(Команда)
	ПереключитьТипПостроенияПлитки();
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьВыбранныеПодарки(Команда)
	Результат = ПодготовитьРезультат();
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура СледующаяСкидка(Команда)
	ОтказатьсяОтВыдачи();
	ТекущийНомерШага = Мин(ТекущийНомерШага + 1, СкидкиШаги.Количество());
	ОтобразитьТекущийШаг();
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяСкидка(Команда)
	ТекущийНомерШага = Макс(ТекущийНомерШага - 1, 0);
	ОтобразитьТекущийШаг();
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьПодаркиОтКоторыхОтказались(Команда)
	СтрокиОтмены = ТаблицаПодарков.НайтиСтроки(Новый Структура("ОтказОтВыдачиПодарка", Истина));
	Для Каждого СтрокаОтмены Из СтрокиОтмены Цикл
		Если СтрокаОтмены.ВыборИзСписка Тогда
			СтрокаПодарка = ТаблицаПодаркиНаВыбор.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПодарка, СтрокаОтмены);
			СтрокаПодарка.КратностьУпаковок = 1;
		Иначе
			СтрокаПодарка = ТаблицаПодаркиБезВыбора.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПодарка, СтрокаОтмены);
			СтрокаПодарка.КратностьУпаковок = 1;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаОтмены Из СтрокиОтмены Цикл
		ТаблицаПодарков.Удалить(СтрокаОтмены);
	КонецЦикла;
	ПостроитьШаги();
	ТекущийНомерШага = 1;
	ОтобразитьТекущийШаг();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ПлиткаВыбор(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомерНажатой = Число(ИнтерфейсРМКСлужебныйКлиент.ПолучитьНомерНажатойПлитки(Элемент));
	СтрокаНажатойКнопки = ДанныеКнопокПлиток.Получить(НомерНажатой);
	ВыбратьЭлементИзИзбранногоИПлитки(СтрокаНажатойКнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаНачальнуюСтраницуНажатие(Элемент)
	ПлиткаДомойКлиент();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПлиткаНазад(Элемент, СтандартнаяОбработка)
	
	ПерейтиНаСтраницуВлево();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПлиткаВперед(Элемент, СтандартнаяОбработка)
	
	ПерейтиНаСтраницуВправо();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБаннер2Нажатие(Элемент)
	Элементы.Баннер3.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБаннер1Нажатие(Элемент)
	Элементы.Баннер1.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПостроитьШаги()
	счШагов = 1;
	СкидкиШаги.Очистить();
	// Все подарки, которые не требуется выбирать - собираются в один список и выдаются по одному.
	Если ТаблицаПодаркиБезВыбора.Количество() > 0 Тогда
		ОписаниеШага = СкидкиШаги.Добавить();
		ОписаниеШага.ЭтоШагСВыбором = Ложь;
		ОписаниеШага.Скидка = "";
		ОписаниеШага.НомерШага = счШагов;		
		счШагов = счШагов + 1;
	КонецЕсли;
	
	ОписаниеСкидок = ТаблицаПодаркиНаВыбор.Выгрузить(,"ВладелецПодарка, ПредставлениеВладельца");
	ОписаниеСкидок.Свернуть("ВладелецПодарка, ПредставлениеВладельца");
	Для Каждого Скидка Из ОписаниеСкидок Цикл
		ОписаниеШага = СкидкиШаги.Добавить();
		ОписаниеШага.ЭтоШагСВыбором = Истина;
		ОписаниеШага.Скидка = Скидка.ВладелецПодарка;
		ОписаниеШага.НомерШага = счШагов;
		ОписаниеШага.ПредставлениеСкидки = Скидка.ПредставлениеВладельца;
		счШагов = счШагов + 1;
	КонецЦикла;
 
	Если СкидкиШаги.Количество() = 0 Тогда
		ОписаниеШага = СкидкиШаги.Добавить();
		ОписаниеШага.ЭтоШагСВыбором = Ложь;
		ОписаниеШага.Скидка = "";
		ОписаниеШага.НомерШага = 1;		
	КонецЕсли;

	ВсегоШагов = СкидкиШаги.Количество();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьДействияИПолучитьДанныеДляКлиента(ПараметрыРМК)
	
	ДополнительныеДанные = Новый Структура();
	
	НастройкиЭлементов = ИнтерфейсРМКСлужебный.ПодготовитьНастройкиЭлементовДляКлиента(ПараметрыРМК);
	ДополнительныеДанные.Вставить("СвойстваНастроекЭлементов", НастройкиЭлементов);
	
	Возврат ДополнительныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСерверныеДействияДляКлиента()
	
	ПараметрыРМК = Новый Структура();
	ПараметрыРМК.Вставить("НастройкаРМК", ТекущаяНастройкаРМК);
	ПараметрыРМК.Вставить("РежимКассыСамообслуживания", РежимКассыСамообслуживания);
	ДополнительныеДанные = ВыполнитьДействияИПолучитьДанныеДляКлиента(ПараметрыРМК);

	СвойстваНастроекЭлементов = ДополнительныеДанные.СвойстваНастроекЭлементов;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПлиточныйИнтерфейсПодбора()
	
	ТекущийПервыйИндексПлитки = -1;
	ТекущаяСтраницаКнопок = -1;
	ТекстШапкиХарактеристик = НСтр("ru = '  Характеристики'");
	
	ИнтерфейсРМКСлужебный.СформироватьЭлементыПлиток(ЭтотОбъект);
	ИмяЭлемента = "ДекорацияПутьПлиточногоИнтерфейса";
	ЭлементПуть = Элементы.Найти(ИмяЭлемента);
	Если ЭлементПуть <> Неопределено Тогда
		ЭлементПуть.Видимость = Ложь;
	КонецЕсли;
	ИсходныеДанныеГорячейКлавиши = ДанныеВедущейКомбинацииГорячихКлавиш();
	ВедущаяКомбинацияСтрокой = ИсходныеДанныеГорячейКлавиши.ВедущаяКомбинацияСтрокой;
	ИспользоватьПанельИзбранныхТоваров = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницуПлитки(Дельта)
	
	КоличествоПлиток = КоличествоЭлементовВРяду * КоличествоРядовНаСтранице;
	СтрокаДанных = ДанныеДляПлитки[ТекущийПервыйИндексПлитки];
	ТекущаяКатегорияРамещения = СтрокаДанных.НомерКатегорииРазмещенияЭлемента;
	Если ТекущаяКатегорияРамещения = 0 Тогда
		ТекущийПервыйИндексПлитки = ТекущийПервыйИндексПлитки + Дельта * (КоличествоПлиток - 1);
		ТекущийВторойИндексПлитки = 0;
	Иначе
		ТекущийВторойИндексПлитки = ТекущийВторойИндексПлитки + Дельта * (КоличествоПлиток - 2);
	КонецЕсли;
	ЗаполнитьКнопкиПлиток();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуВправо()
	
	ПереключитьСтраницуПлитки(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуВлево()
	
	ПереключитьСтраницуПлитки(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлементИзИзбранногоИПлитки(СтрокаНажатойКнопки)
	
	Если НЕ ЗначениеЗаполнено(Кассир) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаНажатойКнопки.ЭтоКатегория ИЛИ СтрокаНажатойКнопки.ЭтоТекущаяКатегория Тогда
		ТекущийПервыйИндексПлитки = СтрокаНажатойКнопки.ПервыйИндексПлитки;
		ТекущийВторойИндексПлитки = СтрокаНажатойКнопки.ВторойИндексПлитки;
		ЗаполнитьКнопкиПлиток();
		Возврат;
	КонецЕсли;
	
	ИндексВОпорныхДанных = СтрокаНажатойКнопки.ПервыйИндексПлитки;
	
	СтрокаДанныхДляПлитки = ДанныеДляПлитки[ИндексВОпорныхДанных];
	ИндексВОпорныхДанных = СтрокаДанныхДляПлитки.ИндексИзОпорныхДанных;
	
	СтрокаПозиции = ОпорныеДанные[ИндексВОпорныхДанных];
	
	Если СтрокаПозиции.ЭтоКатегория Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("СтрокаНажатойКнопки", СтрокаНажатойКнопки);
	ДополнительныеПараметры.Вставить("ИндексВОпорныхДанных", ИндексВОпорныхДанных);
	ВыбратьЭлементИзИзбранногоИПлиткиЗавершение(СтрокаПозиции, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлементИзИзбранногоИПлиткиЗавершение(СтрокаПозиции, ДополнительныеПараметры)
	
	СтрокаНажатойКнопки = ДополнительныеПараметры.СтрокаНажатойКнопки;
	
	МассивДанных = Новый Массив;
	ОбщегоНазначенияРМККлиентПереопределяемый.ДозаполнитьДанныеРучногоВыбора(СтрокаПозиции,
		МассивДанных, ЭтотОбъект);
		
	КоличествоТовара = 0;
	Если ДополнительныеПараметры.Свойство("КоличествоТовара") Тогда
		КоличествоТовара = ДополнительныеПараметры.КоличествоТовара;
	КонецЕсли;
	Для Каждого СтрокаМассива Из МассивДанных Цикл
		СписокТоваровВыборКлиент(СтрокаМассива, КоличествоТовара);
		ОбновитьОставшиесяПодарки(СтрокаМассива);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеВесовогоИДробногоТовараЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Доступность = Истина;
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("КоличествоТовара") Тогда
		СтрокаПозиции = ОпорныеДанные[ДополнительныеПараметры.ИндексВОпорныхДанных];
		ДополнительныеПараметры.Вставить("КоличествоТовара", Результат.КоличествоТовара);
		
		ТекущееУстройствоРаспознавания = Неопределено;
		
		ВыбратьЭлементИзИзбранногоИПлиткиЗавершение(СтрокаПозиции, ДополнительныеПараметры);
		НомерНажатой = ДанныеКнопокПлиток.Индекс(ДополнительныеПараметры.СтрокаНажатойКнопки);
		РаспознаваниеБыло = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРежимБезАктивацииПоляКоличество(Форма)
	
	Возврат (Форма.РежимПлитки ИЛИ Форма.РежимКассыСамообслуживания);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекущийЭлементКоличество(Форма)
	
	Если ЭтоРежимБезАктивацииПоляКоличество(Форма)
			Или (НЕ Форма.РежимКассыСамообслуживания) Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Элементы.ТаблицаПодарков.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.ТекущийТоварКоличество.Доступность = Истина;
	Форма.ТекущийЭлемент = Форма.Элементы.ТекущийТоварКоличество;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьОпорныеДанныеПанелиДляПостроенияПлиточногоИнтерфейса()
	
	ОбщегоНазначенияРМК.ДополнитьОпорныеДанныеПанелиДляПостроенияПлиточногоИнтерфейса(ЭтотОбъект);
	ТаблицаДанных = ТаблицаПодаркиБезВыбора;
	Если ЭтоШагСВыбором Тогда
		ТаблицаДанных = ТаблицаПодаркиНаВыбор;
	КонецЕсли;
	Для Каждого ПодарокКВыдаче Из ТаблицаПодаркиБезВыбора Цикл
		Отбор = Новый Структура("ИдентификаторСтроки", ПодарокКВыдаче.ИдентификаторСтроки);
		Для Каждого СтрокаДанныхПлитки Из ДанныеКнопокПлиток.НайтиСтроки(Отбор) Цикл
			Если ЭтоШагСВыбором Тогда
				СтрокаДанныхПлитки.ЦенаТекст = "";
			Иначе
				СтрокаДанныхПлитки.ЦенаТекст = СтрШаблон(НСтр("ru = 'еще %1 %2'"), ПодарокКВыдаче.КоличествоУпаковок, СтрокаДанныхПлитки.Упаковка);
			КонецЕсли;
		КонецЦикла;
		Отбор = Новый Структура("ИдентификаторСтроки", ПодарокКВыдаче.ИдентификаторСтроки);
		Для Каждого СтрокаДанныхПлитки Из ОпорныеДанные.НайтиСтроки(Отбор) Цикл
			СтрокаДанныхПлитки.Цена = ПодарокКВыдаче.Цена;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементаФормы(Элемент, Видимость)
	Элемент.Видимость = Видимость;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТолькоПросмотрЭлементаФормы(Элемент, ТолькоПросмотр)
	Элемент.ТолькоПросмотр = ТолькоПросмотр;
КонецПроцедуры

&НаСервере
Функция ДанныеВедущейКомбинацииГорячихКлавиш()
	
	Результат = Новый Структура("ВедущаяКомбинацияСтрокой,Shift,Alt,Ctrl", Ложь, Ложь, Ложь, Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКнопкиПлиток();
	
	ДанныеДляПлитки = Новый Массив;
	ТипПостроенияПлитки = ТипыПостроенияПлитки.ПоПалитре;
	ИнтерфейсРМКСлужебныйКлиент.ПодготовитьДанныеДляПлитки(ЭтотОбъект);
	ИнтерфейсРМКСлужебныйКлиент.ЗаполнитьКнопкиПлиток(ЭтотОбъект);
	Если ТекущийПервыйИндексПлитки >= 0 Тогда
		Для ИндексПозиции = ТекущийПервыйИндексПлитки
				По Мин(ТекущийПервыйИндексПлитки + 11, ДанныеДляПлитки.Количество() - 1) Цикл
			
			СтрокаОпорныхДанных = ОпорныеДанные[ИндексПозиции];
			СтрокаКнопки = ДанныеКнопокПлиток[ИндексПозиции - ТекущийПервыйИндексПлитки];
			СтрокаКнопки.ИдентификаторСтроки = СтрокаОпорныхДанных.ИдентификаторСтроки;
			СтрокаКнопки.ВладелецПодарка = СтрокаОпорныхДанных.ВладелецПодарка;

		КонецЦикла;
	КонецЕсли;
	ДополнитьОпорныеДанныеПанелиДляПостроенияПлиточногоИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеДобавляемогоТовара(ДанныеВыбора, КоличествоТовара = 0, ПропуститьКонтроль = Ложь)
	ДанныеДобавляемогоТовара = Новый Структура();
	ДанныеДобавляемогоТовара.Вставить("Номенклатура", ДанныеВыбора.Номенклатура);
	ДанныеДобавляемогоТовара.Вставить("Цена", ДанныеВыбора.Цена);
	ДанныеДобавляемогоТовара.Вставить("ВыборТовараВручную", Истина);
	ДанныеДобавляемогоТовара.Вставить("ПропуститьКонтроль", ПропуститьКонтроль);
	
	
	Если ДанныеВыбора.Свойство("Характеристика") Тогда
		ДанныеДобавляемогоТовара.Вставить("Характеристика", ДанныеВыбора.Характеристика);
	КонецЕсли;
	
	Если ДанныеВыбора.Свойство("Серия") Тогда
		ДанныеДобавляемогоТовара.Вставить("Серия", ДанныеВыбора.Серия);
	КонецЕсли;
	
	Если ДанныеВыбора.Свойство("Упаковка") Тогда
		ДанныеДобавляемогоТовара.Вставить("Упаковка", ДанныеВыбора.Упаковка);
	КонецЕсли;
	
	Если ДанныеВыбора.Свойство("ОсобенностьУчета") Тогда
		ДанныеДобавляемогоТовара.Вставить("ОсобенностьУчета", ДанныеВыбора.ОсобенностьУчета);
	КонецЕсли;
	
	Если ДанныеВыбора.Свойство("ВидНоменклатуры") Тогда
		ДанныеДобавляемогоТовара.Вставить("ВидНоменклатуры", ДанныеВыбора.ВидНоменклатуры);
	КонецЕсли;
	
	Если ДанныеВыбора.Свойство("Организация") Тогда
		ДанныеДобавляемогоТовара.Вставить("Организация", ДанныеВыбора.Организация);
	КонецЕсли;
	Если ДанныеВыбора.Свойство("Количество") Тогда
		ДанныеДобавляемогоТовара.Вставить("Количество", ДанныеВыбора.Количество);
	КонецЕсли;
	Если ДанныеВыбора.Свойство("КоличествоУпаковок") Тогда
		ДанныеДобавляемогоТовара.Вставить("КоличествоУпаковок", ДанныеВыбора.КоличествоУпаковок);
	КонецЕсли;
	Если ДанныеВыбора.Свойство("ВладелецПодарка") Тогда
		ДанныеДобавляемогоТовара.Вставить("ВладелецПодарка", ДанныеВыбора.ВладелецПодарка);
	КонецЕсли;
	Если ДанныеВыбора.Свойство("Подарок") Тогда
		ДанныеДобавляемогоТовара.Вставить("Подарок", ДанныеВыбора.Подарок);
	КонецЕсли;
	Если ДанныеВыбора.Свойство("ОбластьПредоставленияДокумент") Тогда
		ДанныеДобавляемогоТовара.Вставить("ОбластьПредоставленияДокумент", ДанныеВыбора.ОбластьПредоставленияДокумент);
	КонецЕсли;
	Если ДанныеВыбора.Свойство("ВыводитьПодарокВЧек") Тогда
		ДанныеДобавляемогоТовара.Вставить("ВыводитьПодарокВЧек", ДанныеВыбора.ВыводитьПодарокВЧек);
	КонецЕсли;
	Если КоличествоТовара > 0 Тогда
		ДанныеДобавляемогоТовара.Вставить("Количество", КоличествоТовара);
		ДанныеДобавляемогоТовара.Вставить("КоличествоУпаковок", КоличествоТовара);
	КонецЕсли;
		
	Если ДанныеВыбора.Свойство("ИмяЭлемента") Тогда
		ДанныеДобавляемогоТовара.Вставить("КомментарийПодключенногоКега", ДанныеВыбора.ИмяЭлемента);
	КонецЕсли;
	Если ДанныеВыбора.Свойство("ИдентификаторСтроки") Тогда
		ДанныеДобавляемогоТовара.Вставить("ИдентификаторСтроки", ДанныеВыбора.ИдентификаторСтроки);
	КонецЕсли;
	Если ДанныеВыбора.Свойство("ОтказОтВыдачиПодарка") Тогда
		ДанныеДобавляемогоТовара.Вставить("ОтказОтВыдачиПодарка", ДанныеВыбора.ОтказОтВыдачиПодарка);
	Иначе
		ДанныеДобавляемогоТовара.Вставить("ОтказОтВыдачиПодарка", Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровВыборКлиент(ДанныеВыбора, КоличествоТовара = 0, ПропуститьКонтроль = Ложь)
	
	ЗаполнитьДанныеДобавляемогоТовара(ДанныеВыбора, КоличествоТовара = 0, ПропуститьКонтроль = Ложь);
	ДополнительныеПараметры = Новый Структура("ПропуститьКонтроль", Истина);
	СписокТоваровВыборПродолжение(Ложь, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровВыборПродолжение(ЭтоФормаРучногоПодбора = Ложь, ДополнительныеПараметры = Неопределено)
		
	
	ОбработатьВыборТовара(ДанныеДобавляемогоТовара, Ложь, ДополнительныеПараметры);

	ЗапросВесаСПовышениемПрав = Ложь;
	ДобавляемаяПозиция = ТаблицаПодарков.НайтиПоИдентификатору(ТекущийТоварИдентификатор);
	Если Не ДобавляемаяПозиция = Неопределено Тогда
		
		ВесовойНеФасованный = ДобавляемаяПозиция.Весовой И Не ДобавляемаяПозиция.Фасованный;
		Если ВесовойНеФасованный И ДобавляемаяПозиция.Количество = 0
				И Не ДобавляемаяПозиция.НеобходимостьВводаКодаМаркировки Тогда
				
			ОжиданиеКонтроляВеса = Ложь;
			ВесТекущегоТовара(ЗапросВесаСПовышениемПрав);
			
		КонецЕсли;
		
	КонецЕсли;

	ОжиданиеКонтроляВеса = Истина;
	ПересчитатьСуммы(ДобавляемаяПозиция);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборТовара(ТекущийВыбор, ДействующиеЗапретыПродаж = Неопределено,
		ДополнительныеПараметры = Неопределено)
	
	ОбработатьВыборТовараНаКлиенте(ТекущийВыбор, ДействующиеЗапретыПродаж);
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборТовараНаКлиенте(Знач ТекущийВыбор, Знач ДействующиеЗапретыПродаж = Неопределено)
	
	ЕстьХарактеристика = ТекущийВыбор.Свойство("Характеристика");
	ЕстьСерия = ТекущийВыбор.Свойство("Серия");
	ЕстьПартия = ТекущийВыбор.Свойство("Партия");
	
	ПартияВТаблице = Неопределено;
	Если ТекущийВыбор.Свойство("Партия") Тогда
		Типы = Новый Массив;
		Типы.Добавить(ТипЗнч(ПустаяСтрокаТаблицыТоваров.Партия));
		ОписаниеТипа = Новый ОписаниеТипов(Типы);
		ПартияВТаблице = ОписаниеТипа.ПривестиЗначение(ТекущийВыбор.Партия);
	КонецЕсли;
	
	СерияВТаблице = Неопределено;
	Если ТекущийВыбор.Свойство("Серия") Тогда
		Типы = Новый Массив;
		Типы.Добавить(ТипЗнч(ПустаяСтрокаТаблицыТоваров.Серия));
		ОписаниеТипа = Новый ОписаниеТипов(Типы);
		СерияВТаблице = ОписаниеТипа.ПривестиЗначение(ТекущийВыбор.Серия);
	КонецЕсли;
	
	УпаковкаВТаблице = Неопределено;
	Типы = Новый Массив;
	Типы.Добавить(ТипЗнч(ПустаяСтрокаТаблицыТоваров.Упаковка));
	ОписаниеТипа = Новый ОписаниеТипов(Типы);
	УпаковкаВТаблице = ОписаниеТипа.ПривестиЗначение(ТекущийВыбор.Упаковка);

	СтрокаТовара = Неопределено;
	СтрокаПолученаПриСканировании = Ложь;
	Если ТекущийВыбор.Свойство("СтрокаТовара") Тогда
		СтрокаТовара = ТекущийВыбор.СтрокаТовара;
		ТекущийВыбор = ТекущийВыбор.СтруктураНайденнойНоменклатуры;
		СтрокаПолученаПриСканировании = Истина;
	ИначеЕсли ТекущийВыбор.Свойство("ИндексКэшаСтрокиТовара")
			И ЗначениеЗаполнено(ТекущийВыбор.ИндексКэшаСтрокиТовара) Тогда
		КэшПлитки = КэшиСтрокТоваров.КэшПлитки;
		СтрокаТовара = КэшПлитки[ТекущийВыбор.ИндексКэшаСтрокиТовара - 1];
	Иначе
		Если Не КэшиСтрокТоваров = Неопределено Тогда
			Для НомерКэша = 1 По 2 Цикл
				
				Если НомерКэша = 1 И КэшиСтрокТоваров.Свойство("КэшКорзины") Тогда
					КэшПоиска = КэшиСтрокТоваров.КэшКорзины;
				ИначеЕсли НомерКэша = 2 И КэшиСтрокТоваров.Свойство("КэшПлитки") Тогда
					КэшПоиска = КэшиСтрокТоваров.КэшПлитки;
				Иначе
					Продолжить;
				КонецЕсли;
				
				Для Каждого СтрокаКэша Из КэшПоиска Цикл
					
					Если Не ТекущийВыбор.Номенклатура = СтрокаКэша.Номенклатура Тогда
						Продолжить;
					КонецЕсли;
					Если Не УпаковкаВТаблице = СтрокаКэша.Упаковка Тогда
						Продолжить;
					КонецЕсли;
					Если ЕстьХарактеристика Тогда
						Если Не ТекущийВыбор.Характеристика = СтрокаКэша.Характеристика Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					Если ЕстьСерия Тогда
						Если Не СерияВТаблице = СтрокаКэша.Серия Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					Если ЕстьПартия Тогда
						Если Не ПартияВТаблице = СтрокаКэша.Партия Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
					СтрокаТовара = СтрокаКэша;
					Прервать;
					
				КонецЦикла;
				
				Если Не СтрокаТовара = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаТовара = Неопределено Тогда
		РеквизитыФормыРМК = СтруктураРеквизитовФормыРМКДляДобавленияСтроки();
		РеквизитыФормыРМК.Вставить("ИспользоватьКод", ИспользоватьКод);
		РеквизитыФормыРМК.Вставить("ИспользоватьАртикул", ИспользоватьАртикул);
		РеквизитыФормыРМК.Вставить("ОтображатьНаименованиеДляПечати", ОтображатьНаименованиеДляПечати);
		
		ТекущийВыбор.Вставить("РеквизитыФормыРМК", РеквизитыФормыРМК);
		Данныетовара = СтрокаТовараНаСервере(ТекущийВыбор, Истина);
		СтрокаТовара = Данныетовара.СтрокаТовара;		
		Если КэшиСтрокТоваров.Свойство("КэшКорзины") Тогда
			Если СтрокаТовара.ДобавлятьСтрокуВКэшСтрок Тогда
				КэшиСтрокТоваров.КэшКорзины.Добавить(СтрокаТовара);
			КонецЕсли;
		КонецЕсли;
		Если Не Данныетовара.ДанныеКонтроляПродаж = Неопределено Тогда
			ИнтерфейсРМКСлужебныйКлиентСервер.ДобавитьНовыеДанныеКэшаПродаж(КэшКонтроляПродаж,
				Данныетовара.ДанныеКонтроляПродаж);
		КонецЕсли;
		Если Не Данныетовара.ДанныеУточненияПринадлежностиЗапасов = Неопределено Тогда
			ИнтерфейсРМКСлужебныйКлиентСервер.ДобавитьНовыеДанныеКэшаУточненияПринадлежностиЗапасов(КэшУточненияПринадлежностиЗапасов,
				Данныетовара.ДанныеУточненияПринадлежностиЗапасов);
		КонецЕсли;
	Иначе
		СтрокаТовара.КодМаркировки = "";
		СтрокаТовара.ТребуетсяПроверкаКодаМаркировки = Ложь;
		СтрокаТовара.СтрокаТовараПолученаИзКэша = Истина;
		СтрокаТовара.Подарок = Истина;
		СтрокаТовара.ВыбратьХарактеристикуПослеВводаПоСтроке = Ложь;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из ТекущийВыбор Цикл
		Если ЗначениеЗаполнено(ЭлементСтруктуры.Значение) Тогда
			Если ЭлементСтруктуры.Ключ = "Партия"
				Или ЭлементСтруктуры.Ключ = "Серия"
				Или ЭлементСтруктуры.Ключ = "СрокГодности"
				Или ЭлементСтруктуры.Ключ = "Упаковка"
				Или ЭлементСтруктуры.Ключ = "Организация"
				Или ЭлементСтруктуры.Ключ = "СистемаНалогообложения"
				Или ЭлементСтруктуры.Ключ = "СтавкаНДС" Тогда
					Продолжить;
			КонецЕсли;
			СтрокаТовара.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЕстьСерияПартия = Ложь;
	ДобавлятьСерийныйТоварНовойСтрокой = Истина;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущийВыбор, "Серия") 
		Или ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущийВыбор, "Партия") Тогда
		ЕстьСерияПартия = Истина;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущийВыбор, "УникальностьСерии") 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущийВыбор, "Серия") Тогда
		Если Не ТекущийВыбор.УникальностьСерии И ЗначениеЗаполнено(ТекущийВыбор.Серия) Тогда
			ДобавлятьСерийныйТоварНовойСтрокой = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТаблицы = СтрокаТовара;
	
	Если (СтрокаТаблицы.НеобходимоДобавитьСтроку И Не ЕстьСерияПартия) Тогда
		
		ДобавитьСтрокуВТабличнуюЧастьНаКлиенте(СтрокаТаблицы);
		Возврат;
		
	ИначеЕсли ЕстьСерияПартия И ДобавлятьСерийныйТоварНовойСтрокой И СтрокаТаблицы.НеобходимостьВводаСерии Тогда
		
		ДобавитьСтрокуВТабличнуюЧастьНаКлиенте(СтрокаТаблицы);
		Возврат
		
	ИначеЕсли СтрокаТаблицы.ЭтоНабор Тогда
		
		ДополнительныеДанные = ШаблонДополнительныхДанныхЗапросаКонтроляПродаж(ЭтотОбъект);
		ДобавитьНаборВТабличнуюЧасть(ТекущийВыбор, ДополнительныеДанные);
		Возврат;
		
	Иначе
	КонецЕсли;
	
	Если ДобавитьТоварОтдельнойСтрокойНаКлиенте(СтрокаТаблицы) Тогда
		ДобавитьСтрокуВТабличнуюЧастьНаКлиенте(СтрокаТаблицы);
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицыТоваров Из ТаблицаПодарков Цикл
		
		Если СтрокаТаблицыТоваров.ЭтоНабор Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ТекущийВыбор.ВладелецПодарка = СтрокаТаблицыТоваров.ВладелецПодарка Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ТекущийВыбор.ОтказОтВыдачиПодарка = СтрокаТаблицыТоваров.ОтказОтВыдачиПодарка Тогда
			Продолжить;
		КонецЕсли;

		Если Не ТекущийВыбор.Номенклатура = СтрокаТаблицыТоваров.Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не УпаковкаВТаблице = СтрокаТаблицыТоваров.Упаковка Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЕстьХарактеристика Тогда
			Если Не ТекущийВыбор.Характеристика = СтрокаТаблицыТоваров.Характеристика Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьСерия Тогда
			Если Не СерияВТаблице = СтрокаТаблицыТоваров.Серия Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьПартия Тогда
			Если Не ПартияВТаблице = СтрокаТаблицыТоваров.Партия Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		
		ИзменитьСтрокуВТабличнойЧастиНаКлиенте(СтрокаТаблицыТоваров, ТекущийВыбор);
		Возврат;
		
	КонецЦикла;
	
	ДобавитьСтрокуВТабличнуюЧастьНаКлиенте(СтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОставшиесяПодарки(ВыданныйПодарок)
	ИдентификаторСтроки = ВыданныйПодарок.ИдентификаторСтроки;
	ВсеПодаркиВыданы = Ложь;
	УдалялиКнопки = Ложь;
	Если ЭтоШагСВыбором Тогда
		СтрокиУдалить = Новый Массив;
		ОтборСтрокСкидка = Новый Структура("ВладелецПодарка", ТекущаяСкидкаНаценка);
		ВариантыЭтойСкидки = ТаблицаПодаркиНаВыбор.НайтиСтроки(ОтборСтрокСкидка);
		Для Каждого ВариантПодарка Из ВариантыЭтойСкидки Цикл
			Если ВариантПодарка.КоличествоУпаковок > ВариантПодарка.КратностьУпаковок Тогда
				ВариантПодарка.КоличествоУпаковок = ВариантПодарка.КоличествоУпаковок - ВариантПодарка.КратностьУпаковок;
			Иначе
				СтрокиУдалить.Добавить(ВариантПодарка);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
			ТаблицаПодаркиНаВыбор.Удалить(СтрокаУдалить);
			УдалялиКнопки = Истина;
		КонецЦикла;
		ВариантыЭтойСкидки = ТаблицаПодаркиНаВыбор.НайтиСтроки(Новый Структура("ВладелецПодарка", ТекущаяСкидкаНаценка)); 
		Если ВариантыЭтойСкидки.Количество() = 0 Тогда
			ВсеПодаркиВыданы = Истина;
			КоличествоОсталосьВыдать = 0;
		Иначе
			КоличествоОсталосьВыдать = ВариантыЭтойСкидки[0].КоличествоУпаковок;
		КонецЕсли;
	Иначе
		ОтборЭтотПодарок = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
		ДобавленныеПодарки = ТаблицаПодаркиБезВыбора.НайтиСтроки(ОтборЭтотПодарок);
		СтрокиУдалить = Новый Массив;
		Для Каждого ДобавленныйПодарок Из ДобавленныеПодарки Цикл
			Если ДобавленныйПодарок.КоличествоУпаковок > ДобавленныйПодарок.КратностьУпаковок Тогда
				ДобавленныйПодарок.КоличествоУпаковок = ДобавленныйПодарок.КоличествоУпаковок - ДобавленныйПодарок.КратностьУпаковок;
			Иначе
				СтрокиУдалить.Добавить(ДобавленныйПодарок);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
			ТаблицаПодаркиБезВыбора.Удалить(СтрокаУдалить);
			УдалялиКнопки = Истина;
		КонецЦикла;
		ВсеПодаркиВыданы = ТаблицаПодаркиБезВыбора.Количество() = 0;
		КоличествоОсталосьВыдать = ТаблицаПодаркиБезВыбора.Итог("КоличествоУпаковок");
	КонецЕсли;
	УстановитьЗаголовокКомандыПродолжить();
	Если ВсеПодаркиВыданы Тогда
		ПерейтиНаСледующийШаг();
	Иначе
		Если УдалялиКнопки Тогда
			ЗаполнитьОпорныеДанныеПанелиПлиточногоИнтерфейса();
			ЗаполнитьКнопкиПлиток();
		Иначе
			ДополнитьОпорныеДанныеПанелиДляПостроенияПлиточногоИнтерфейса();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокКомандыПродолжить()
	ЗаголовокКоманды = НСтр("ru = 'Продолжить (осталось %1)'");
	Элементы.СледующаяСкидка.Заголовок = СтрШаблон(ЗаголовокКоманды, КоличествоОсталосьВыдать);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСледующийШаг()
	Если НЕ ТекущийНомерШага = ВсегоШагов Тогда
		ТекущийНомерШага = ТекущийНомерШага + 1;
		ОтобразитьТекущийШаг();
	Иначе
		ЗаполнитьОпорныеДанныеПанелиПлиточногоИнтерфейса();
		ЗаполнитьКнопкиПлиток();
		ОбновитьВидимостьКнопокНавигации();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СтрокаТовараНаСервере(Знач ТекущийВыбор, Знач ДополнятьСтрокуВычисляемымиДанными = Ложь)
	
	ДополнительныеДанные = ШаблонДополнительныхДанныхЗапросаКонтроляПродаж(ЭтотОбъект);
	ДополнительныеДанные.Вставить("Характеристика", Неопределено);
	Если ТекущийВыбор.Свойство("Характеристика") Тогда
		ДополнительныеДанные.Характеристика = ТекущийВыбор.Характеристика;
	КонецЕсли;
	
	ДанныеУточненияПринадлежностиЗапасов = ?(ИспользоватьУточненияПринадлежностиЗапасов, Новый Соответствие, Неопределено);
	ДополнительныеДанные.Вставить("ДанныеУточненияПринадлежностиЗапасов", ДанныеУточненияПринадлежностиЗапасов);
	
	ДополнительныеДанные.Вставить("ИспользоватьВыборСкладаПриПродаже", ИспользоватьВыборСкладаПриПродаже);
	ДополнительныеДанные.Вставить("ТорговыйОбъект", ТорговыйОбъект);
	
	СтрокаТовара = СтрокаТовара(ТекущийВыбор, ДополнительныеДанные);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовара, "Маркируемый")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовара, "НеобходимостьВводаКодаМаркировки")
		И СтрокаТовара.Маркируемый Тогда
		СтрокаТовара.НеобходимостьВводаКодаМаркировки = Истина;
	КонецЕсли;
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("СтрокаТовара", СтрокаТовара);
	РезультатФункции.Вставить("ДанныеКонтроляПродаж", ДополнительныеДанные.ДанныеКонтроляПродаж);
	РезультатФункции.Вставить("ДанныеУточненияПринадлежностиЗапасов", ДополнительныеДанные.ДанныеУточненияПринадлежностиЗапасов);
	Возврат РезультатФункции;
	
КонецФункции

&НаСервереБезКонтекста
Функция СтрокаТовара(Знач ТекущийВыбор, ДополнительныеИсходящиеДанные = Неопределено) Экспорт
	
	МассивТоваров = Новый Массив;
	МассивТоваров.Добавить(ТекущийВыбор.Номенклатура);
	
	ТаблицаТовары = Новый ТаблицаЗначений;
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТаблицуТовары(МассивТоваров, ТаблицаТовары);
	ЭтотОбъект = ТекущийВыбор.РеквизитыФормыРМК;
	СтруктураСтрокиТовара = ЭтотОбъект.ПустаяСтрокаТаблицыТоваров;
	
	Типы = Новый Массив;
	Типы.Добавить(ТипЗнч(СтруктураСтрокиТовара.Партия));
	ОписаниеТипаПартия = Новый ОписаниеТипов(Типы);
	
	Типы = Новый Массив;
	Типы.Добавить(ТипЗнч(СтруктураСтрокиТовара.Серия));
	ОписаниеТипаСерия = Новый ОписаниеТипов(Типы);
	
	Типы = Новый Массив;
	Типы.Добавить(ТипЗнч(СтруктураСтрокиТовара.Упаковка));
	ОписаниеТипаУпаковка = Новый ОписаниеТипов(Типы);
	
	СтруктураДополнительная = Новый Структура;
	
	Для Каждого КолонкаТаблицы Из ТаблицаТовары.Колонки Цикл
		СтруктураДополнительная.Вставить(КолонкаТаблицы.Имя);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураДополнительная, ТаблицаТовары[0]);
	СтруктураДополнительная.Вставить("Номенклатура", ТекущийВыбор.Номенклатура);
	
	Для Каждого Элемент Из СтруктураДополнительная Цикл
		СтруктураСтрокиТовара.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Для Каждого Элемент Из ТекущийВыбор Цикл
		СтруктураСтрокиТовара.Вставить(Элемент.Ключ, Элемент.Значение); 
	КонецЦикла;
	
	Объект = ЭтотОбъект.Объект;
	
	ОсновнаяОрганизация = ЭтотОбъект.ОсновнаяОрганизация;
	МассивОрганизаций = ЭтотОбъект.МассивОрганизаций;
	ОтображатьОстаток = ЭтотОбъект.ОтображатьОстаток;
	ИспользоватьВыборСкладаПриПродаже = ЭтотОбъект.ИспользоватьВыборСкладаПриПродаже;
	
	НоваяСтрока = СтруктураСтрокиТовара;
	
	Если НЕ ИспользоватьВыборСкладаПриПродаже Тогда
		НоваяСтрока.ТорговыйОбъект = ДополнительныеИсходящиеДанные.ТорговыйОбъект;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НоваяСтрока.Организация) Тогда
		НоваяСтрока.Организация = ОсновнаяОрганизация;
	КонецЕсли;
	
	ОбщегоНазначенияРМКПереопределяемый.СкорректироватьЦенуПодарочногоСертификата(ЭтотОбъект, НоваяСтрока);
	ОбщегоНазначенияРМКПереопределяемый.ПереопределитьПараметрыЗаполненияСерийИПартий(НоваяСтрока, ЭтотОбъект);
	ДополнитьСтрокуТовараВычисляемымиДанными(НоваяСтрока, ЭтотОбъект);
	
	ПартияВТаблице = ОписаниеТипаПартия.ПривестиЗначение(СтруктураСтрокиТовара.Партия);
	СтруктураСтрокиТовара.Партия = ПартияВТаблице;
	
	СерияВТаблице = ОписаниеТипаСерия.ПривестиЗначение(СтруктураСтрокиТовара.Серия);
	СтруктураСтрокиТовара.Серия = СерияВТаблице;
	
	УпаковкаВТаблице = ОписаниеТипаУпаковка.ПривестиЗначение(СтруктураСтрокиТовара.Упаковка);
	СтруктураСтрокиТовара.Упаковка = УпаковкаВТаблице;
	
	НоваяСтрока.ИспользоватьХарактеристики =
		ОбщегоНазначенияРМК.ТребуетсяВводХарактеристикиДляНоменклатуры(ТекущийВыбор.Номенклатура);
	
	Если ТекущийВыбор.Свойство("ПолучитьЦену") Тогда
		ПараметрыРасчетаЦены = ОбщегоНазначенияРМК.ПараметрыРасчетаЦены();
		ПараметрыРасчетаЦены.ВидЦен = ЭтотОбъект.РозничныйВидЦены;
		ПараметрыРасчетаЦены.ТорговыйОбъект = Объект.ТорговыйОбъект;
		ПараметрыРасчетаЦены.Организация = Объект.Организация;
		ПараметрыРасчетаЦены.Номенклатура = ТекущийВыбор.Номенклатура;
		
		ОбщегоНазначенияРМКПереопределяемый.РассчитатьЦенуВыбранногоТовара(ПараметрыРасчетаЦены);
		НоваяСтрока.Цена = ПараметрыРасчетаЦены.Цена;
	КонецЕсли;
	
	СтруктураСтрокиТовара.Удалить("РеквизитыФормыРМК");
	
	СтруктураСтрокиТовара.Вставить("СтрокаТовараПолученаИзКэша", Ложь);
	СтруктураСтрокиТовара.Вставить("ДобавлятьСтрокуВКэшСтрок", Истина);
	
	Возврат СтруктураСтрокиТовара;
	
КонецФункции

&НаКлиенте
Функция ДобавитьТоварОтдельнойСтрокойНаКлиенте(СтрокаТовара)
	
	РезультатФункции = ДобавлятьВсеТоварыОтдельнойСтрокой
		Или (РежимКассыСамообслуживания И СтрокаТовара.Весовой);
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьСтрокуВТабличнойЧастиНаКлиенте(НайденнаяСтрока, ТекущийВыбор)
	
	Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.ИдентификаторСтроки) Тогда
		НайденнаяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если ТекущийВыбор.Свойство("Количество") И ЗначениеЗаполнено(ТекущийВыбор.Количество) Тогда
		НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + ТекущийВыбор.Количество;
		Если ТекущийВыбор.Свойство("КоличествоУпаковок") Тогда
			НайденнаяСтрока.КоличествоУпаковок = НайденнаяСтрока.КоличествоУпаковок + ТекущийВыбор.КоличествоУпаковок;
		КонецЕсли;
	Иначе
		НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + 1;
		НайденнаяСтрока.КоличествоУпаковок = НайденнаяСтрока.КоличествоУпаковок + 1;
	КонецЕсли;
	
	ТекущийТоварКоличество = НайденнаяСтрока.КоличествоУпаковок;
	
	Элементы.ТаблицаПодарков.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
	
	УстановитьТекущийЭлементКоличество(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВТабличнуюЧастьНаКлиенте(Знач ДанныеТовара, Знач НеобходимВводМаркировки = Ложь)
	
	НоваяСтрока = ТаблицаПодарков.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеТовара);
	НоваяСтрока.ВыборИзСписка = ЭтоШагСВыбором;
	Если НЕ ИспользоватьВыборСкладаПриПродаже Тогда
		НоваяСтрока.ТорговыйОбъект = ТорговыйОбъект;
	КонецЕсли;
	НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	
	Отказ = Ложь;
		
	Если НЕ Отказ Тогда
		ОбработатьДобавлениеСтрокиВыданногоПодарка(НоваяСтрока);
		ДобавленаНоваяСтрокаКорзины = Истина;
		ДобавленнаяСтрока = НоваяСтрока;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДобавлениеСтрокиВыданногоПодарка(НоваяСтрока)
	НоваяСтрока.ПредставлениеКодАртикул = ПолучитьПредставлениеКодАртикул(НоваяСтрока, ИспользоватьКод, ИспользоватьАртикул);
	
	ДанныеДляФормированияПредставленияТовара = ДанныеДляФормированияПредставленияТовараВСтроке();
	ЗаполнитьЗначенияСвойств(ДанныеДляФормированияПредставленияТовара, НоваяСтрока);
	ДанныеДляФормированияПредставленияТовара.ОтображатьНаименованиеДляПечати = ОтображатьНаименованиеДляПечати;
	ЗаполнитьПредставлениеТовараВСтроке(НоваяСтрока, ДанныеДляФормированияПредставленияТовара);
	
	Если НоваяСтрока.НеобходимостьВводаСерии
		И ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
		НоваяСтрока.СерияПредставление = Строка(НоваяСтрока.Серия);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(НоваяСтрока.Упаковка) Тогда
		НоваяСтрока.ПредставлениеНоменклатураХарактеристика = СтрШаблон("%1 - %2",
			НоваяСтрока.ПредставлениеНоменклатураХарактеристика, НоваяСтрока.ПредставлениеЕдиницыИзмерения);
	КонецЕсли;
	
	ТекущийТоварКоличество = НоваяСтрока.КоличествоУпаковок;
	ТекущийТоварИдентификатор = НоваяСтрока.ПолучитьИдентификатор();
	ТекущийТоварИндексСтроки = ТаблицаПодарков.Индекс(НоваяСтрока);
	
	Элементы.ТаблицаПодарков.ТекущаяСтрока = ТекущийТоварИдентификатор;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(ИдентификаторСтроки = Неопределено)
	
	ТекущаяСтрока = ?((ИдентификаторСтроки <> Неопределено),
		ТаблицаПодарков.НайтиПоИдентификатору(ИдентификаторСтроки),
		ТаблицаПодарков.НайтиПоИдентификатору(ТекущийТоварИдентификатор));
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСуммы(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоТипПостроенияПлиткиСВесовымТоваром(ТипПостроенияПлитки, ТипыПостроенияПлитки)
	
	Возврат (ТипПостроенияПлитки = ТипыПостроенияПлитки.ВесовойТовар
		Или ТипПостроенияПлитки = ТипыПостроенияПлитки.РаспознанныйВесовойТовар);
	
КонецФункции  

&НаКлиенте
Процедура ПлиткаДомойКлиент()
	
	ТекущийПервыйИндексПлитки = 0;
	ТекущийВторойИндексПлитки = 0;
	ЗаполнитьКнопкиПлиток();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущуюНастройкуРМК(НастройкиЭлементов = Неопределено)
	
	ДоступноИзменениеНастройкиРМК = ПравоДоступа("Добавление", Метаданные.Справочники.НастройкиРабочегоМестаКассира);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК Ссылка,
	|	НастройкиРабочегоМестаКассира.ПечататьБумажныйЧек КАК ПечататьБумажныйЧек,
	|	НастройкиРабочегоМестаКассира.МаксимальныйПроцентРучнойСкидки КАК МаксимальныйПроцентРучнойСкидки,
	|	НастройкиРабочегоМестаКассира.ТочностьОкругления КАК ТочностьОкругления,
	|	НастройкиРабочегоМестаКассира.ОжидатьРезультатПроверкиМарок КАК ОжидатьРезультатПроверкиМарок,
	|	НастройкиРабочегоМестаКассира.ИспользоватьНовыйПодборТоваров КАК ИспользоватьНовыйПодборТоваров,
	|	НастройкиРабочегоМестаКассира.ЗакрыватьПодборПриВыбореТовара КАК ЗакрыватьПодборПриВыбореТовара,
	|	НастройкиРабочегоМестаКассира.ПоказыватьАртикулНоменклатуры КАК ПоказыватьАртикулНоменклатуры,
	|	НастройкиРабочегоМестаКассира.ПоказыватьКодНоменклатуры КАК ПоказыватьКодНоменклатуры,
	|	НастройкиРабочегоМестаКассира.ОтправлятьSMSКодПриЗаведенииКарты КАК ОтправлятьSMSКодПриЗаведенииКарты,
	|	НастройкиРабочегоМестаКассира.КонтролироватьЕМРЦ КАК КонтролироватьЕМРЦ,
	|	НастройкиРабочегоМестаКассира.ИспользоватьРежимСкупки КАК ИспользоватьРежимСкупки,
	|	НастройкиРабочегоМестаКассира.ВопросПоРасчетуСкидок КАК ВопросПоРасчетуСкидок,
	|	НастройкиРабочегоМестаКассира.РазрешитьВыборСклада КАК РазрешитьВыборСклада,
	|	НастройкиРабочегоМестаКассира.ВремяНачалаСмены КАК ВремяНачалаСмены,
	|	НастройкиРабочегоМестаКассира.ВариантЗаполненияМестаРасчетов КАК ВариантЗаполненияМестаРасчетов,
	|	НастройкиРабочегоМестаКассира.ВариантЗаполненияКассира КАК ВариантЗаполненияКассира,
	|	НастройкиРабочегоМестаКассира.ВыдаватьНаличныеНаКассе КАК ВыдаватьНаличныеНаКассе,
	|	НастройкиРабочегоМестаКассира.ЗавершатьСессиюКассираПослеПродажи КАК ЗавершатьСессиюКассираПослеПродажи,
	|	НастройкиРабочегоМестаКассира.ЗапускатьОбменИзИнтерфейсаРМК КАК ЗапускатьОбменИзИнтерфейсаРМК,
	|	НастройкиРабочегоМестаКассира.НаименованиеПользователяПриЗапросеПрав КАК НаименованиеПользователяПриЗапросеПрав,
	|	НастройкиРабочегоМестаКассира.СтруктураПлиточногоИнтерфейсаПодбора КАК СтруктураПлиточногоИнтерфейсаПодбора,
	|	НастройкиРабочегоМестаКассира.СпособФормированияТоварногоЧека КАК СпособФормированияТоварногоЧека,
	|	НастройкиРабочегоМестаКассира.ИспользоватьСтрокуБыстрогоДобавленияТовара КАК ИспользоватьБыстроеДобавлениеТовара,
	|	НастройкиРабочегоМестаКассира.ДобавлятьВсеТоварыОтдельнойСтрокой КАК ДобавлятьВсеТоварыОтдельнойСтрокой,
	|	НастройкиРабочегоМестаКассира.ОставлятьПоследнийЧекНаЭкране КАК ОставлятьПоследнийЧекНаЭкране,
	|	НастройкиРабочегоМестаКассира.ИспользоватьОплатуНаличными КАК ИспользоватьОплатуНаличными,
	|	НастройкиРабочегоМестаКассира.КонтролироватьОстатокНаличных КАК КонтролироватьОстатокНаличных,
	|	НастройкиРабочегоМестаКассира.ИспользоватьОплатуПлатежнымиСистемами КАК ИспользоватьОплатуПлатежнымиСистемами,
	|	НастройкиРабочегоМестаКассира.ИспользоватьОплатуБонусами КАК ИспользоватьОплатуБонусами,
	|	НастройкиРабочегоМестаКассира.ИспользоватьОплатуСертификатами КАК ИспользоватьОплатуСертификатами,
	|	НастройкиРабочегоМестаКассира.ИспользоватьПанельВводаНаличныхКупюр КАК ИспользоватьПанельВводаНаличныхКупюр,
	|	НастройкиРабочегоМестаКассира.ИспользоватьПромокоды КАК ИспользоватьПромокоды,
	|	НастройкиРабочегоМестаКассира.ВертикальнаяОриентация КАК ВертикальнаяОриентация,
	|	НастройкиРабочегоМестаКассира.ОтображатьНумерациюСтрок КАК ОтображатьНумерациюСтрок,
	|	НастройкиРабочегоМестаКассира.СуммаПодтвержденияСписанияБонусов КАК СуммаПодтвержденияСписанияБонусов,
	|	НастройкиРабочегоМестаКассира.ВыдаватьПодарокНаКассе КАК ВыдаватьПодарокНаКассе,
	|	НастройкиРабочегоМестаКассира.РаботаВРежимеМедленногоСоединения КАК РаботаВРежимеМедленногоСоединения,
	|	НастройкиРабочегоМестаКассира.РазрешитьЗапускРезервногоКопированияИзФормыРМК КАК РазрешитьЗапускРезервногоКопированияИзФормыРМК,
	|	НастройкиРабочегоМестаКассира.РежимОтображенияСкидки КАК РежимОтображенияСкидки,
	|	НастройкиРабочегоМестаКассира.ОтправлятьSMSКодПриПродаже КАК ОтправлятьSMSКодПриПродаже,
	|	НастройкиРабочегоМестаКассира.РазрешитьВводКомментарияКЧеку КАК РазрешитьВводКомментарияКЧеку,
	|	НастройкиРабочегоМестаКассира.ОтображатьОстаток КАК ОтображатьОстаток,
	|	НастройкиРабочегоМестаКассира.РазрешитьБыстроеДобавлениеПакета КАК РазрешитьБыстроеДобавлениеПакета,
	|	НастройкиРабочегоМестаКассира.НоменклатураПакет КАК НоменклатураПакет,
	|	НастройкиРабочегоМестаКассира.СоздаватьЗаказы КАК СоздаватьЗаказы,
	|	НастройкиРабочегоМестаКассира.ПокупательНовогоЗаказа КАК ПокупательНовогоЗаказа,
	|	НастройкиРабочегоМестаКассира.СпособПечатиЗаказаПокупателя КАК СпособПечатиЗаказаПокупателя,
	|	НастройкиРабочегоМестаКассира.ПечататьЗаказПриСоздании КАК ПечататьЗаказПриСоздании,
	|	НастройкиРабочегоМестаКассира.НастроитьКассировДляВхода КАК НастроитьКассировДляВхода,
	|	НастройкиРабочегоМестаКассира.МаксимальныйПроцентРучнойНаценки КАК МаксимальныйПроцентРучнойНаценки,
	|	НастройкиРабочегоМестаКассира.ИспользоватьКассираКакПродавца КАК ИспользоватьКассираКакПродавца,
	|	НастройкиРабочегоМестаКассира.РазрешитьВыборПродавца КАК РазрешитьВыборПродавца,
	|	НастройкиРабочегоМестаКассира.ЗапретитьЧастичнуюОтгрузкуЗаказа КАК ЗапретитьЧастичнуюОтгрузкуЗаказа,
	|	НастройкиРабочегоМестаКассира.РазрешитьПродажуСверхЗаказа КАК РазрешитьПродажуСверхЗаказа,
	|	НастройкиРабочегоМестаКассира.ИспользоватьОплатуПлатежнымиКартами КАК ИспользоватьОплатуПлатежнымиКартами,
	|	НастройкиРабочегоМестаКассира.ВестиЖурналДействийКассира КАК ВестиЖурналДействийКассира,
	|	НастройкиРабочегоМестаКассира.ЗапретитьПробитиеЧекаБезРасчетаСкидок КАК ЗапретитьПробитиеЧекаБезРасчетаСкидок,
	|	НастройкиРабочегоМестаКассира.МаксимальноеКоличествоРаспознанныхТоваров КАК МаксимальноеКоличествоРаспознанныхТоваров,
	|	НастройкиРабочегоМестаКассира.ОбучатьУстройствоРаспознаванияВоВремяПродажи КАК ОбучатьУстройствоРаспознаванияВоВремяПродажи,
	|	НастройкиРабочегоМестаКассира.ПечатьКопииЧека КАК ПечатьКопииЧека,
	|	НастройкиРабочегоМестаКассира.ПечатьТоварногоЧека КАК ПечатьТоварногоЧека,
	|	НастройкиРабочегоМестаКассира.ПечатьЗаказаПриПробитииЧека КАК ПечатьЗаказаПриПробитииЧека,
	|	НастройкиРабочегоМестаКассира.КоличествоДнейХраненияОтложенныхЧеков КАК КоличествоДнейХраненияОтложенныхЧеков,
	|	НастройкиРабочегоМестаКассира.УдалятьНепробитыеЧеки КАК УдалятьНепробитыеЧеки,
	|	НастройкиРабочегоМестаКассира.ЛокальныйКонтрольКлючаИСМП КАК ЛокальныйКонтрольКлючаИСМП,
	|	НастройкиРабочегоМестаКассира.ОсновнойПодборПлиточный КАК ОсновнойПодборПлиточный,
	|	НастройкиРабочегоМестаКассира.НапоминатьПроВводКартыЛояльности КАК НапоминатьПроВводКартыЛояльности,
	|	НастройкиРабочегоМестаКассира.ЗапретитьСопоставлениеТовара КАК ЗапретитьСопоставлениеТовара,
	|	НастройкиРабочегоМестаКассира.ПроизводитьПолныйРасчетСкидок КАК ПроизводитьПолныйРасчетСкидок,
	|	НастройкиРабочегоМестаКассира.ИспользоватьОплатуНесколькимиКартами КАК ИспользоватьОплатуНесколькимиКартами,
	|	НастройкиРабочегоМестаКассира.СкрыватьQRОплатыНаличными КАК СкрыватьQRОплатыНаличными,
	|	НастройкиРабочегоМестаКассира.СкрыватьQRОплатыКартой КАК СкрыватьQRОплатыКартой,
	|	НастройкиРабочегоМестаКассира.ВидОтображения КАК ВидОтображения,
	|	НастройкиРабочегоМестаКассира.ОбновлятьКоличествоПриПовторномПолученииВеса КАК ОбновлятьКоличествоПриПовторномПолученииВеса,
	|	НастройкиРабочегоМестаКассира.ПроверятьЗаполнениеПродавцов КАК ПроверятьЗаполнениеПродавцов,
	|	НастройкиРабочегоМестаКассира.СкрытьЦифровуюКлавиатуру КАК СкрытьЦифровуюКлавиатуру,
	|	НастройкиРабочегоМестаКассира.РазрешитьЗаменуДисконтнойКарты КАК РазрешитьЗаменуДисконтнойКарты,
	|	НастройкиРабочегоМестаКассира.ФорматКорзиныПлиточногоИнтерфейса КАК ФорматКорзиныПлиточногоИнтерфейса,
	|	НастройкиРабочегоМестаКассира.ВыполнятьЛокальныйРасчетСкидок КАК ВыполнятьЛокальныйРасчетСкидок,
	|	НастройкиРабочегоМестаКассира.ИспользоватьСборкуЗаказовПриОтгрузке КАК ИспользоватьСборкуЗаказовПриОтгрузке,
	|	НастройкиРабочегоМестаКассира.УказыватьПричинуВозврата КАК НастройкаУказыватьПричинуВозврата,
	|	НастройкиРабочегоМестаКассира.ИспользоватьЗаменуТоваров КАК ИспользоватьЗаменуТоваров,
	|	НастройкиРабочегоМестаКассира.ПечататьКороткийСлипЧек КАК ПечататьКороткийСлипЧек,
	|	НастройкиРабочегоМестаКассира.ИспользоватьКонтрольПродаж КАК ИспользоватьКонтрольПродаж,
	|	НастройкиРабочегоМестаКассира.ИспользоватьОплатуСертификатамиНСПК КАК ИспользоватьОплатуСертификатамиНСПК,
	|	НастройкиРабочегоМестаКассира.ИспользоватьСерверЛояльностиПолучательДанных КАК ИспользоватьСерверЛояльностиПолучательДанных,
	|	НастройкиРабочегоМестаКассира.ОтображатьНаименованиеДляПечати КАК ОтображатьНаименованиеДляПечати
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира
	|ГДЕ
	|	НЕ НастройкиРабочегоМестаКассира.ПометкаУдаления
	|	И НастройкиРабочегоМестаКассира.Ссылка = &ТекущаяНастройкаРМК");
	Запрос.УстановитьПараметр("ТекущаяНастройкаРМК", ТекущаяНастройкаРМК);
	
	ВыборкаНастроек = Запрос.Выполнить().Выбрать();
	КоличествоНастроек = ВыборкаНастроек.Количество();
	
	Если КоличествоНастроек = 1 И ВыборкаНастроек.Следующий() Тогда
		
		
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаНастроек, ,
			"ВертикальнаяОриентация");
		СтруктураПлиточногоИнтерфейсаПодбора = Неопределено; //Не добавляем товары из палитры, указанной в настройках РМК
		
		ИспользоватьКод =  ВыборкаНастроек.ПоказыватьКодНоменклатуры;
		ИспользоватьАртикул = ВыборкаНастроек.ПоказыватьАртикулНоменклатуры;
		ИспользоватьКодАртикул = ИспользоватьКод ИЛИ ИспользоватьАртикул;
		УстановитьВидимостьЭлементаФормы(Элементы.ТаблицаПодарковАртикул, ВыборкаНастроек.ПоказыватьАртикулНоменклатуры);
		УстановитьВидимостьЭлементаФормы(Элементы.ТаблицаПодарковКод, ВыборкаНастроек.ПоказыватьКодНоменклатуры);
		УстановитьВидимостьЭлементаФормы(Элементы.ТаблицаПодарковПредставлениеКодАртикул, ИспользоватьКодАртикул);
		УстановитьВидимостьЭлементаФормы(Элементы.ТаблицаПодарковМиниСписокКодАртикул, ИспользоватьКодАртикул); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьТипПостроенияПлитки()
	
	ВключитьОтборВесовогоТовара = (ТипПостроенияПлитки = ТипыПостроенияПлитки.ПоПалитре);
	Если (Не ВключитьОтборВесовогоТовара) Тогда
			
		РаспознаваниеБыло = Ложь;
		Если ВключитьОтборВесовогоТовара Тогда
			ИнтерфейсРМКСлужебныйКлиент.НастроитьОтображениеОтбораВесовогоТовара(ЭтотОбъект, Истина);
			НачатьВыборВесовогоТовара();
		Иначе
			ПерестроитьПлиткуПоТипуПостроения(ТипыПостроенияПлитки.ПоПалитре);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборВесовогоТовара()
	
	ПерестроитьПлиткуПоТипуПостроения(ТипыПостроенияПлитки.ВесовойТовар);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерестроитьПлиткуПоТипуПостроения(НовыйТипПостроенияПлитки, ТоварыКВыбору = Неопределено)
	
	ВесовойРежимДо = ЭтоТипПостроенияПлиткиСВесовымТоваром(ТипПостроенияПлитки, ТипыПостроенияПлитки);
		
	ВесовойРежимПосле = (НовыйТипПостроенияПлитки = ТипыПостроенияПлитки.ВесовойТовар
		Или НовыйТипПостроенияПлитки = ТипыПостроенияПлитки.РаспознанныйВесовойТовар);
	
	ТипПостроенияПлитки = НовыйТипПостроенияПлитки;
	ИнтерфейсРМКСлужебныйКлиент.ПодготовитьДанныеДляПлитки(ЭтотОбъект, ТоварыКВыбору);
	ПлиткаДомойКлиент();
	Если Не НовыйТипПостроенияПлитки = ТипыПостроенияПлитки.РаспознанныйВесовойТовар Тогда
		ТипПостроенияПлиткиДоРаспознавания = Неопределено;
	КонецЕсли;
	
	Если Не ВесовойРежимДо = ВесовойРежимПосле Тогда
		ИнтерфейсРМКСлужебныйКлиент.НастроитьОтображениеОтбораВесовогоТовара(ЭтотОбъект, ВесовойРежимПосле);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьКлиентскиеПеречисленияФормы()
	ИнтерфейсРМКСлужебныйКлиент.ИнициализироватьТипыПостроенияПлитки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьКлиентскиеПеременные()
	
	ТекущиеЭлектронныеВесы = Неопределено;
	РаспознаваниеБыло = Ложь;
	ОжиданиеКонтроляВеса = Истина;
	ПанельПокупателяВПроцессеПереходаКОплате = Ложь;
	СвойстваНастроекЭлементов = Новый Соответствие();
	ВеличинаДробногоКоличества = 0;
	ШагДробногоКоличества = 0;
	ПодтверждениеДробногоТовара = Ложь;
	ЦветФонаОтборВеса = Элементы.ОтборВесовогоТовара.ЦветФона;
	ЦветТекстаОтборВеса = Элементы.ОтборВесовогоТовара.ЦветТекста;
	КэшКонтроляПродаж = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонКэшаКонтроляПродаж();
	
КонецПроцедуры

&НаКлиенте
Процедура ВесТекущегоТовара(ЗапросВесаСПовышениемПрав = Ложь)
	
	ТекущаяСтрока = ТаблицаПодарков.НайтиПоИдентификатору(ТекущийТоварИдентификатор);
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		ЗаполнитьВесТекущегоТовара(ТекущаяСтрока, ЗапросВесаСПовышениемПрав);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВесТекущегоТовара(ТекущаяСтрока, ЗапросВесаСПовышениемПрав = Ложь)
	
	Товар = ТекущаяСтрока.Номенклатура;
	Если ЗначениеЗаполнено(ТаблицаЭлектронныхВесов) И Не ЭлектронныеВесыЗаняты Тогда
		ЗапуститьПолучениеВеса(Товар);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПолучениеВеса(Товар)
	
	ЭлектронныеВесыЗаняты = Истина;
	ПараметрыВзвешивания = Новый Структура();
	ПараметрыВзвешивания.Вставить("Товар", Товар);
	ПараметрыОперации = Новый Структура();
	
	Если ТаблицаЭлектронныхВесов.Количество() > 1 Тогда
		ИдентификаторВесов = Неопределено;
	Иначе
		ИдентификаторВесов = ТаблицаЭлектронныхВесов[0].ЭлектронныеВесы;
	КонецЕсли;
	
	ОповещениеЗавершенияВзвешивания = Новый ОписаниеОповещения("ПолучитьВесСЭлектронныхВесовЗавершение",
		ЭтотОбъект, ПараметрыВзвешивания);
		
	МенеджерОборудованияРМККлиент.НачатьПолученияВесаСЭлектронныхВесов(ОповещениеЗавершенияВзвешивания,
		Неопределено, ИдентификаторВесов, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоВесовогоТовара(ТекущаяСтрока, УвеличитьКоличество)
	
	Если УвеличитьКоличество Тогда
		
		ТекущийЭлемент = Элементы.ТекущийТоварКоличество;
		УстановитьТолькоПросмотрЭлементаФормы(Элементы.ТекущийТоварКоличество, Ложь);
		
	Иначе
		
		ТекущийТоварКоличество = 0;
		ТекущаяСтрока.Количество = 0;
		ТекущаяСтрока.КоличествоУпаковок = 0;
		
	КонецЕсли;
	
	ПересчитатьСуммы(ТекущаяСтрока, Истина);
	ПересчетКоличестваТовара(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МаксимальныйНомерНабора(ТаблицаТовары)
	
	МаксимальныйНомерНабора = 0;
	Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
		ТекущийНомерНабора = СтрокаТовары.НомерНабора;
		Если ТекущийНомерНабора > МаксимальныйНомерНабора Тогда
			МаксимальныйНомерНабора = ТекущийНомерНабора;
		КонецЕсли;
	КонецЦикла;
	МаксимальныйНомерНабора = МаксимальныйНомерНабора + 1;
	
	Возврат МаксимальныйНомерНабора;
	
КонецФункции

&НаСервере
Процедура ДобавитьНаборВТабличнуюЧасть(ТекущийВыбор, ДополнительныеДанные)
	
	Если ТекущийВыбор.Свойство("ПолучитьЦену") Тогда
		ПараметрыРасчетаЦены = ОбщегоНазначенияРМК.ПараметрыРасчетаЦены();
		ПараметрыРасчетаЦены.ВидЦен = РозничныйВидЦены;
		ПараметрыРасчетаЦены.ТорговыйОбъект = ТорговыйОбъект;
		ПараметрыРасчетаЦены.Организация = Организация;
		ПараметрыРасчетаЦены.Номенклатура = ТекущийВыбор.Номенклатура;
		
		ОбщегоНазначенияРМКПереопределяемый.РассчитатьЦенуВыбранногоТовара(ПараметрыРасчетаЦены);
		ТекущийВыбор.Вставить("Цена", ПараметрыРасчетаЦены.Цена);
	КонецЕсли;
	
	ТаблицаСоставНабора = Новый ТаблицаЗначений;
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьСоставНабора(ТекущийВыбор,
		ТаблицаСоставНабора, ЭтотОбъект, ДополнительныеДанные);
	
	МаксимальныйНомерНабора = МаксимальныйНомерНабора(ТаблицаПодарков);
	ВНабореЕстьПострочныйТовар = ВНабореЕстьПострочныйТовар(ТаблицаСоставНабора);
	
	Если ВНабореЕстьПострочныйТовар Тогда
		
		Для Каждого СтрокаТаблицы Из ТаблицаСоставНабора Цикл
			ДобавитьКомплектующуюНабораВТабличнуюЧасть(СтрокаТаблицы, МаксимальныйНомерНабора);
		КонецЦикла;
		
	Иначе
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("НоменклатураНабора", ТекущийВыбор.Номенклатура);
		Если ТекущийВыбор.Свойство("Характеристика") Тогда
			СтруктураПоиска.Вставить("ХарактеристикаНабора", ТекущийВыбор.Характеристика);
		КонецЕсли;
		МассивСтрокТоваров = ТаблицаПодарков.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрокТоваров.Количество() = 0 ИЛИ ДобавлятьВсеТоварыОтдельнойСтрокой Тогда
			
			Для Каждого СтрокаТаблицы Из ТаблицаСоставНабора Цикл
				ДобавитьКомплектующуюНабораВТабличнуюЧасть(СтрокаТаблицы, МаксимальныйНомерНабора);
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтрокаМассива Из МассивСтрокТоваров Цикл
				СтароеКоличествоНаборов = СтрокаМассива.КоличествоНаборов;
				НовоеКоличествоНаборов = СтароеКоличествоНаборов + 1;
				КоэффициентПересчета = НовоеКоличествоНаборов / СтароеКоличествоНаборов;
				СтрокаМассива.КоличествоНаборов = НовоеКоличествоНаборов;
				СтрокаМассива.Количество = СтрокаМассива.Количество * КоэффициентПересчета;
				СтрокаМассива.КоличествоУпаковок = СтрокаМассива.КоличествоУпаковок * КоэффициентПересчета;
				
				ТекущийТоварКоличество = НовоеКоличествоНаборов;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомплектующуюНабораВТабличнуюЧасть(СтрокаКомплектующая, НомерНабора)

	НоваяСтрока = ТаблицаПодарков.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКомплектующая);
	НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	НоваяСтрока.НеобходимостьВводаКодаМаркировки = СтрокаКомплектующая.Маркируемый;
	НоваяСтрока.НомерНабора = НомерНабора;
	
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьОрганизациюПродажи(НоваяСтрока, ЭтотОбъект);
	Если Не ЗначениеЗаполнено(НоваяСтрока.Организация) Тогда
		НоваяСтрока.Организация = Организация;
	Иначе
		ОтборПоОрганизации = Новый Структура("Организация", НоваяСтрока.Организация);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НоваяСтрока.СистемаНалогообложения) Тогда
		НоваяСтрока.СистемаНалогообложения = ОбщегоНазначенияРМК.СНОККТДляОрганизации(ЭтотОбъект, НоваяСтрока);
	КонецЕсли;
	
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьВозможностьОплатыЭС(НоваяСтрока, ЭтотОбъект);
	
	Объект = Новый Структура();
	СтавкаНДС = ПродажиРМК.АктуальнаяСтавкаНДСДляТовара(Объект, НоваяСтрока, НоваяСтрока.СистемаНалогообложения);
	НоваяСтрока.СтавкаНДС = СтавкаНДС;
	
	ШтрихкодированиеРМК.ЗаполнитьПредставлениеЕдиницыИзмерения(НоваяСтрока);
	
	ТекущийТоварКоличество = НоваяСтрока.КоличествоУпаковок;
	Элементы.Товары.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
	ДобавленаНоваяСтрокаКорзины = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВНабореЕстьПострочныйТовар(СписокТоваров)
	
	ВНабореЕстьПострочныйТовар = Ложь;
	
	Для Каждого СтрокаТовара Из СписокТоваров Цикл
		Если СтрокаТовара.НеобходимостьВводаСерии Или СтрокаТовара.НеобходимостьВводаКодаМаркировки Тогда
			ВНабореЕстьПострочныйТовар = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВНабореЕстьПострочныйТовар;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьКоличествоНабора(ТекущаяСтрока, УвеличитьКоличество, НовоеКоличество = 0)
	
	МаксимальныйНомерНабора = МаксимальныйНомерНабора(ТаблицаПодарков);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("НомерНабора", ТекущаяСтрока.НомерНабора);
	МассивСтрокНабора = ТаблицаПодарков.НайтиСтроки(СтруктураПоиска);
	
	ВНабореЕстьПострочныйТовар = ВНабореЕстьПострочныйТовар(МассивСтрокНабора);
	
	Если ВНабореЕстьПострочныйТовар Тогда
		
		Если УвеличитьКоличество Тогда
			Для Каждого СтрокаМассива Из МассивСтрокНабора Цикл
				НоваяСтрока = ТаблицаПодарков.Добавить();
				ИсключаяСвойства = "Серия, Партия, КодМаркировки, ПроцентАвтоматическойСкидки, ПроцентСкидкиНаценки,
					|СуммаАвтоматическойСкидки, СуммаСкидкиНаценки, СуммаСкидкиОплатыБонусом, Продавец, РассчитанаСкидка,
					|КонтрольнаяМарка, КонтрольнаяМаркаОбработана, Оплачена, СуммаСкидокОбщая";
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива, , ИсключаяСвойства);
				НоваяСтрока.НомерНабора = МаксимальныйНомерНабора;
				НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
				
				ПересчитатьСуммы(НоваяСтрока);
			КонецЦикла;
		Иначе
			Для Каждого СтрокаМассива Из МассивСтрокНабора Цикл
				ТаблицаПодарков.Удалить(СтрокаМассива);
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		Для Каждого СтрокаМассива Из МассивСтрокНабора Цикл
			ИзменитьКоличествоКомплектующихНабора(СтрокаМассива, УвеличитьКоличество, НовоеКоличество);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммы(ТекущаяСтрока, ОбнулитьСуммыОплат = Ложь, ОбнулитьПодарочныеСертификаты = Истина)
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	СимволРазделитель = Символ(160);
	ТекущаяСтрока.ТекстКоличествоСумма = СтрШаблон("%1%2=%3",
			ТекущаяСтрока.Количество, СимволРазделитель, ТекущаяСтрока.Сумма);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоКомплектующихНабора(ТекущаяСтрока, УвеличитьКоличество, НовоеКоличество)
	
	СтароеКоличествоНаборов = ТекущаяСтрока.КоличествоНаборов;
	
	Если УвеличитьКоличество Тогда
		НовоеКоличествоНаборов = ?(НовоеКоличество = 0, СтароеКоличествоНаборов + 1, НовоеКоличество);
	Иначе
		НовоеКоличествоНаборов = ?(НовоеКоличество = 0, СтароеКоличествоНаборов - 1, НовоеКоличество);
		Если Не ТекущаяСтрока.Весовой И НовоеКоличествоНаборов = 0 Тогда
			ТаблицаПодарков.Удалить(ТекущаяСтрока);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	КоэффициентПересчета = НовоеКоличествоНаборов / СтароеКоличествоНаборов;
	ТекущаяСтрока.Количество = ТекущаяСтрока.Количество * КоэффициентПересчета;
	ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок * КоэффициентПересчета;
	ТекущаяСтрока.КоличествоНаборов = НовоеКоличествоНаборов;
	ТекущийТоварКоличество = НовоеКоличествоНаборов;
	ПересчитатьСуммы(ТекущаяСтрока, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьТекущееКоличество(ТекущаяСтрока)
	
	Если ТекущаяСтрока.ПоштучноеВыбытие Тогда
		Если ТекущаяСтрока.ПоддерживаетсяПодключениеКОборудованиюРозлива Тогда
			НовоеКоличество = ТекущийТоварКоличество;
		Иначе
			НовоеКоличество = Окр(ТекущийТоварКоличество);
			Если Не ТекущаяСтрока.КоличествоВПотребительскойУпаковке = 0
				И ТекущаяСтрока.КоличествоВПотребительскойУпаковке < ТекущийТоварКоличество Тогда
				
				НовоеКоличество = ТекущаяСтрока.КоличествоВПотребительскойУпаковке;
			КонецЕсли;
		КонецЕсли;

		Если ЗначениеЗаполнено(ТекущаяСтрока.КодМаркировки) Тогда
			ТекущаяСтрока.ТребуетсяПроверкаКодаМаркировки = Истина;
		КонецЕсли;
		ТекущийТоварКоличество = НовоеКоличество;
		ТекущаяСтрока.Количество = НовоеКоличество;
		ТекущаяСтрока.КоличествоУпаковок = НовоеКоличество;
		ТекущаяСтрока.ЧастичноеВыбытиеКоличество = НовоеКоличество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеКоличестваНеВесовогоТовара(ТекущаяСтрока)
	
	ПересчетКоличестваТовара(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПересчетКоличестваТовара(ТекущаяСтрока)
	
	ТекущаяСтрока.Количество = ТекущийТоварКоличество;
	ТекущаяСтрока.КоличествоУпаковок = ТекущийТоварКоличество;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьРезультат()
	Результат = Новый Структура();
	СтрокиВыданныхПодарков = ТаблицаПодарков.НайтиСтроки(Новый Структура("ОтказОтВыдачиПодарка", Ложь));
	ТаблицаВыбранныхПодарков = ТаблицаПодарков.Выгрузить(СтрокиВыданныхПодарков);
	Результат.Вставить("АдресТаблицыВыданныхПодарков", ПоместитьВоВременноеХранилище(ТаблицаВыбранныхПодарков));
	СтрокиОтказаОтПодарков = ТаблицаПодарков.НайтиСтроки(Новый Структура("ОтказОтВыдачиПодарка", Истина));
	ТаблицаОтказаОтПодарков = ТаблицаПодарков.Выгрузить(СтрокиОтказаОтПодарков);
	Результат.Вставить("АдресТаблицыОтказаОтПодарков", ПоместитьВоВременноеХранилище(ТаблицаОтказаОтПодарков));
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОтобразитьТекущийШаг()
	
	ЗаполнитьФормуПоНомеруШага();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьКнопокНавигации()
	ЭтоПоследнийШаг = ТекущийНомерШага >= СкидкиШаги.Количество();
	МожноНазад = ТекущийНомерШага > 1;
	ВсеПодаркиШагаВыданы = ВсеПодаркиШагаВыданы();
	МожноЗавершать = ЭтоПоследнийШаг И ВсеПодаркиШагаВыданы;
	МожноВперед = НЕ МожноЗавершать;
	Если МожноВперед Тогда
		Элементы.СледующаяСкидка.Важность = ВажностьКнопки.Главная;
	Иначе
		Элементы.ВыдатьПодарки.Важность = ВажностьКнопки.Главная;
	КонецЕсли;
	Элементы.ГруппаДалее.Видимость = МожноВперед;
	Элементы.ПлиткаГруппаЗавершение.Видимость = МожноЗавершать;
	Если ВсегоШагов = 1 Тогда
		Элементы.БаннерПараметрыШага.Видимость = Ложь;
	КонецЕсли;
	Если МожноЗавершать Тогда
		СтрокаОтказа = ТаблицаПодарков.НайтиСтроки(Новый Структура("ОтказОтВыдачиПодарка", Истина));
		Если НЕ СтрокаОтказа.Количество() = 0 Тогда
			Элементы.ГруппаНазад.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаНазад.Видимость = Ложь;
		Элементы.ПанельБаннераСтраницы.ТекущаяСтраница = Элементы.БаннерПараметрыШага;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФормуПоНомеруШага()
	Отбор = Новый Структура("НомерШага", ТекущийНомерШага);
	СтрокиШага = СкидкиШаги.НайтиСтроки(Отбор);
	КоличествоПодарковКВыдачеТекущийШаг = 0;
	КоличествоОсталосьВыдать = 0;
	Если СтрокиШага.Количество() = 1 Тогда
		ОписаниеШага = СтрокиШага[0];
		ТекущаяСкидкаНаценка = ОписаниеШага.Скидка;
		ТекущаяСкидкаНаценкаПредставление = ОписаниеШага.ПредставлениеСкидки;
		ЭтоШагСВыбором = ОписаниеШага.ЭтоШагСВыбором;
		СкрыватьЦену = ЭтоШагСВыбором;
		Если ЭтоШагСВыбором Тогда
			Заголовок = СтрШаблон(НСтр("ru = 'Выберите подарки для покупателя: %1'"), ТекущаяСкидкаНаценкаПредставление);
			СтрокиТекущейСкидки = ТаблицаПодаркиНаВыбор.НайтиСтроки(Новый Структура("ВладелецПодарка", ТекущаяСкидкаНаценка));
			Если СтрокиТекущейСкидки.Количество() = 0 Тогда
				КоличествоПодарковКВыдачеТекущийШаг = 0;
			Иначе
				КоличествоПодарковКВыдачеТекущийШаг = СтрокиТекущейСкидки[0].КоличествоУпаковок;
			КонецЕсли;
			КоличествоОсталосьВыдать = КоличествоПодарковКВыдачеТекущийШаг;
			СтрокиТекущейСкидки = ТаблицаПодарков.НайтиСтроки(Новый Структура("ВладелецПодарка", ТекущаяСкидкаНаценка));
			Для Каждого СтрокаВыданногоПодарка Из СтрокиТекущейСкидки Цикл
				КоличествоПодарковКВыдачеТекущийШаг = КоличествоПодарковКВыдачеТекущийШаг + СтрокаВыданногоПодарка.КоличествоУпаковок;
			КонецЦикла;
		Иначе
			Если ЭтоПродажа Тогда
				Заголовок = НСтр("ru = 'Выдать все перечисленные подарки'");
			Иначе
				Заголовок = НСтр("Примите подарки от покупателя");
			КонецЕсли;
			КоличествоПодарковКВыдачеТекущийШаг = ТаблицаПодаркиБезВыбора.Итог("КоличествоУпаковок");
			КоличествоОсталосьВыдать = КоличествоПодарковКВыдачеТекущийШаг;
			СтрокиТекущейСкидки = ТаблицаПодарков.НайтиСтроки(Новый Структура("ВыборИзСписка", Ложь));
			Для Каждого СтрокаВыданногоПодарка Из СтрокиТекущейСкидки Цикл
				КоличествоПодарковКВыдачеТекущийШаг = КоличествоПодарковКВыдачеТекущийШаг + СтрокаВыданногоПодарка.КоличествоУпаковок;
			КонецЦикла;
		КонецЕсли;
		
		ЗаполнитьОпорныеДанныеПанелиПлиточногоИнтерфейса();
		
		ЗаполнитьКнопкиПлиток();
		ЕстьЭлементыПлитки = ТекущийПервыйИндексПлитки > -1;
		Элементы.ГруппаУведомленияОПустойСтруктуре.Видимость = НЕ ЕстьЭлементыПлитки;
		ОбновитьВидимостьКнопокНавигации();
		ЗаполнитьЗаголовокНомерШага();
		УстановитьЗаголовокКомандыПродолжить();
	Иначе
		ВызватьИсключение(НСтр("ru = 'Внутренняя ошибка: Нарушена последовательность шагов для выдачи подарка'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаголовокНомерШага()
	ЗаголовокШагов = НСтр("ru = 'Шаг %1 из %2'");
	Элементы.ДекорацияНомерШага.Заголовок = СтрШаблон(ЗаголовокШагов, ТекущийНомерШага, ВсегоШагов);
КонецПроцедуры

&НаКлиенте
Функция ВсеПодаркиШагаВыданы()
	Результат = Ложь;
	ПодаркиКвыдаче = ТаблицаПодаркиБезВыбора;
	Если ЭтоШагСВыбором Тогда
		ПодаркиКвыдаче = ТаблицаПодаркиНаВыбор.НайтиСтроки(Новый Структура("ВладелецПодарка", ТекущаяСкидкаНаценка));
	КонецЕсли;
	Если ПодаркиКвыдаче.Количество() = 0 Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьОпорныеДанныеПанелиПлиточногоИнтерфейса()
	
	ОпорныеДанные.Очистить();
	
	ТаблицаСоставаПалитры = ПодаркиТекущегоШага();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
	|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
	|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
	|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры,
	|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
	|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
	|	ПалитраТоваровРМКСостав.КартинкаПоУмолчанию КАК КартинкаПоУмолчанию,
	|	ПалитраТоваровРМКСостав.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПалитраТоваровРМКСостав.ВладелецПодарка КАК ВладелецПодарка,
	|	ПалитраТоваровРМКСостав.ЭтоПодарок КАК ЭтоПодарок,
	|	ПалитраТоваровРМКСостав.ВыводитьПодарокВЧек КАК ВыводитьПодарокВЧек
	|ПОМЕСТИТЬ ПалитраТоваровРМКСостав
	|ИЗ
	|	&ТаблицаСоставаПалитры КАК ПалитраТоваровРМКСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтрокиМодификатора,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|ПОМЕСТИТЬ ВТГрупповыеМодификаторы
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|			ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|			ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|		ИЗ
	|			ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ГДЕ
	|			ПалитраТоваровРМКСостав.НомерКатегорииРазмещения > 0
	|			И НЕ ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)) КАК ВложенныйЗапрос
	|		ПО ПалитраТоваровРМКСостав.НомерКатегорииРазмещения = ВложенныйЗапрос.НомерКатегорииРазмещения
	|			И ПалитраТоваровРМКСостав.ИсточникПалитры = ВложенныйЗапрос.ИсточникПалитры
	|			И (НЕ ПалитраТоваровРМКСостав.ЭтоКатегория)
	|ГДЕ
	|	ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|ПОМЕСТИТЬ СтруктураПалитрыБезМодификаторов
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрупповыеМодификаторы КАК ВТГрупповыеМодификаторы
	|		ПО ПалитраТоваровРМКСостав.НомерСтроки = ВТГрупповыеМодификаторы.НомерСтрокиМодификатора
	|			И ПалитраТоваровРМКСостав.ИсточникПалитры = ВТГрупповыеМодификаторы.ИсточникПалитры
	|ГДЕ
	|	ВТГрупповыеМодификаторы.НомерСтрокиМодификатора ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегории КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ЛОЖЬ КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|ПОМЕСТИТЬ СтруктураПалитрыМодификаторов
	|ИЗ
	|	СтруктураПалитрыБезМодификаторов КАК СтруктураПалитрыБезМодификаторов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрупповыеМодификаторы КАК ВТГрупповыеМодификаторы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|			ПО ВТГрупповыеМодификаторы.НомерСтрокиМодификатора = ПалитраТоваровРМКСостав.НомерСтроки
	|				И ВТГрупповыеМодификаторы.ИсточникПалитры = ПалитраТоваровРМКСостав.ИсточникПалитры
	|		ПО СтруктураПалитрыБезМодификаторов.НомерКатегории = ВТГрупповыеМодификаторы.НомерКатегории
	|			И СтруктураПалитрыБезМодификаторов.НомерКатегорииРазмещения = ВТГрупповыеМодификаторы.НомерКатегорииРазмещения
	|			И СтруктураПалитрыБезМодификаторов.ИндексПозиции = ВТГрупповыеМодификаторы.ИндексПозиции
	|			И СтруктураПалитрыБезМодификаторов.ИсточникПалитры = ВТГрупповыеМодификаторы.ИсточникПалитры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	0 КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегорииРазмещенияЭлемента,
	|	1 КАК ИндексПозицииВКатегории,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ИСТИНА КАК ЭтоТекущаяКатегория,
	|	1 КАК ПорядокВидов,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПлитки
	|ПОМЕСТИТЬ ИтоговаяСтруктура
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|ГДЕ
	|	ПалитраТоваровРМКСостав.НомерКатегории > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураПалитрыМодификаторов.НомерСтроки,
	|	СтруктураПалитрыМодификаторов.НомерКатегории,
	|	СтруктураПалитрыМодификаторов.НомерКатегорииРазмещения,
	|	СтруктураПалитрыМодификаторов.ИндексПозиции,
	|	СтруктураПалитрыМодификаторов.ЭтоКатегория,
	|	СтруктураПалитрыМодификаторов.ИмеетсяВложенность,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СтруктураПалитрыБезМодификаторов.ИндексПозиции > СтруктураПалитрыМодификаторов.ИндексПозиции
	|			ТОГДА 2
	|		ИНАЧЕ 4
	|	КОНЕЦ,
	|	СтруктураПалитрыМодификаторов.ИсточникПалитры
	|ИЗ
	|	СтруктураПалитрыМодификаторов КАК СтруктураПалитрыМодификаторов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтруктураПалитрыБезМодификаторов КАК СтруктураПалитрыБезМодификаторов
	|		ПО СтруктураПалитрыМодификаторов.НомерКатегорииРазмещения = СтруктураПалитрыБезМодификаторов.НомерКатегории
	|			И СтруктураПалитрыМодификаторов.ИсточникПалитры = СтруктураПалитрыБезМодификаторов.ИсточникПалитры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураПалитрыБезМодификаторов.НомерСтроки,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегории,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегорииРазмещения,
	|	СтруктураПалитрыБезМодификаторов.ИндексПозиции,
	|	СтруктураПалитрыБезМодификаторов.ЭтоКатегория,
	|	СтруктураПалитрыБезМодификаторов.ИмеетсяВложенность,
	|	ЛОЖЬ,
	|	3,
	|	СтруктураПалитрыБезМодификаторов.ИсточникПалитры
	|ИЗ
	|	СтруктураПалитрыБезМодификаторов КАК СтруктураПалитрыБезМодификаторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяСтруктура.ИсточникПлитки КАК ИсточникПлитки,
	|	ИтоговаяСтруктура.НомерСтроки КАК НомерСтроки,
	|	ИтоговаяСтруктура.НомерКатегорииРазмещенияЭлемента КАК НомерКатегорииРазмещенияЭлемента,
	|	ИтоговаяСтруктура.ПорядокВидов КАК ПорядокВидов,
	|	ИтоговаяСтруктура.ИндексПозицииВКатегории КАК ИндексПозицииВКатегории,
	|	ИтоговаяСтруктура.НомерКатегории КАК НомерКатегории,
	|	ИтоговаяСтруктура.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ИтоговаяСтруктура.ЭтоКатегория КАК ЭтоКатегория,
	|	ИтоговаяСтруктура.ЭтоТекущаяКатегория КАК ЭтоТекущаяКатегория,
	|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
	|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
	|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
	|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
	|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
	|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
	|	ПалитраТоваровРМКСостав.КартинкаПоУмолчанию КАК КартинкаПоУмолчанию,
	|	ПалитраТоваровРМКСостав.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПалитраТоваровРМКСостав.ВладелецПодарка КАК ВладелецПодарка,
	|	ПалитраТоваровРМКСостав.ЭтоПодарок КАК ЭтоПодарок,
	|	ПалитраТоваровРМКСостав.ВыводитьПодарокВЧек КАК ВыводитьПодарокВЧек
	|ИЗ
	|	ИтоговаяСтруктура КАК ИтоговаяСтруктура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ПО ИтоговаяСтруктура.НомерСтроки = ПалитраТоваровРМКСостав.НомерСтроки
	|			И ИтоговаяСтруктура.ИсточникПлитки = ПалитраТоваровРМКСостав.ИсточникПалитры
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсточникПлитки,
	|	НомерКатегорииРазмещенияЭлемента,
	|	ПорядокВидов,
	|	ИндексПозицииВКатегории");
	
	ПалитраПлитки = Неопределено;
	
	Запрос.УстановитьПараметр("ТаблицаСоставаПалитры", ТаблицаСоставаПалитры);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ИнтерфейсРМКСлужебный.ЗаполнитьОпорныеДанныеСтрокамиПалитры(ЭтотОбъект, Выборка, ПалитраПлитки);
	
КонецПроцедуры

&НаСервере
Функция ПодаркиТекущегоШага()
	
	ТаблицаДанныхПлитки = ПустаяТаблицаДляОпорныхДанных();
	СкидкиТекущегоШага = СкидкиШаги.НайтиСтроки(Новый Структура("НомерШага", ТекущийНомерШага));
	СкидкиПоказать = Новый Массив();
	ИндексПозиции = 0;
	ЦветАвто = "<Color xmlns=""http://v8.1c.ru/8.1/data/ui"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:type=""Color"">auto</Color>";
	ШрифтАвто = "<Font xmlns=""http://v8.1c.ru/8.1/data/ui"" xmlns:style=""http://v8.1c.ru/8.1/data/ui/style"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:type=""Font"" ref=""style:ШрифтОбычныйПолужирный12РМК"" kind=""StyleItem""/>";
	Для Каждого ОписаниеШага Из СкидкиТекущегоШага Цикл
		Если ОписаниеШага.ЭтоШагСВыбором Тогда			
			СкидкиПоказать.Добавить(ОписаниеШага.Скидка);
		Иначе
			Для Каждого ПодарокВыдать Из ТаблицаПодаркиБезВыбора Цикл
				СтрокаПоказать = ТаблицаДанныхПлитки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПоказать, ПодарокВыдать);
				СтрокаПоказать.ИндексПозиции = ИндексПозиции;
				ИндексПозиции = ИндексПозиции + 1;
				СтрокаПоказать.ЦветФона = ЦветАвто;
				СтрокаПоказать.ЦветШрифта = ЦветАвто;
				СтрокаПоказать.Шрифт = ШрифтАвто;
				СтрокаПоказать.ИсточникПалитры = 1;
				СтрокаПоказать.ИмяЭлемента = ПодарокВыдать.Номенклатура;
				СтрокаПоказать.ИдентификаторСтроки = ПодарокВыдать.ИдентификаторСтроки;
				СтрокаПоказать.ЭтоПодарок = Истина;
				СтрокаПоказать.КартинкаПоУмолчанию = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СкидкаПоказать Из СкидкиПоказать Цикл
		ПодаркиНаВыбор = ТаблицаПодаркиНаВыбор.НайтиСтроки(Новый Структура("ВладелецПодарка", СкидкаПоказать));
		Для Каждого ПодарокВыдать Из ПодаркиНаВыбор Цикл 
			СтрокаПоказать = ТаблицаДанныхПлитки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПоказать, ПодарокВыдать);
			СтрокаПоказать.ИндексПозиции = ИндексПозиции;
			ИндексПозиции = ИндексПозиции + 1;
			СтрокаПоказать.ЦветФона = ЦветАвто;
			СтрокаПоказать.ЦветШрифта = ЦветАвто;
			СтрокаПоказать.Шрифт = ШрифтАвто;
			СтрокаПоказать.ИсточникПалитры = 1;
			СтрокаПоказать.ИмяЭлемента = ПодарокВыдать.Номенклатура;
			СтрокаПоказать.ИдентификаторСтроки = ПодарокВыдать.ИдентификаторСтроки;
			СтрокаПоказать.ЭтоПодарок = Истина;
			СтрокаПоказать.КартинкаПоУмолчанию = Истина;
		КонецЦикла;
	КонецЦикла;
	Счетчик = 1;
	Для Каждого СтрокаТаблицы Из ТаблицаДанныхПлитки Цикл
		СтрокаТаблицы.НомерСтроки = Счетчик;
		ХарактеристикиИспользуются = ПроверитьПрименениеХарактеристикДляНоменклатуры(СтрокаТаблицы.Номенклатура);
		СтрокаТаблицы.ХарактеристикиИспользуются = ХарактеристикиИспользуются;
		
		ЗаполнитьИмяЭлементаВСтрокеСоставаПалитры(СтрокаТаблицы,
			ОтображатьНаименованиеДляПечати);
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Возврат ТаблицаДанныхПлитки;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПустаяТаблицаДляОпорныхДанных()

	ТЗДанныеДляОтображения = Новый ТаблицаЗначений();
	ТЗДанныеДляОтображения.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТЗДанныеДляОтображения.Колонки.Добавить("Номенклатура", Метаданные.ОпределяемыеТипы.НоменклатураРМК.Тип);
	ТЗДанныеДляОтображения.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаРМК.Тип);
	ТЗДанныеДляОтображения.Колонки.Добавить("ХарактеристикиИспользуются", Новый ОписаниеТипов("Булево"));
	ТЗДанныеДляОтображения.Колонки.Добавить("НомерКатегории", Новый ОписаниеТипов("Число"));
	ТЗДанныеДляОтображения.Колонки.Добавить("НомерКатегорииРазмещения", Новый ОписаниеТипов("Число"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ИндексПозиции", Новый ОписаниеТипов("Число"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ЦветШрифта", Новый ОписаниеТипов("Строка"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ЦветФона", Новый ОписаниеТипов("Строка"));
	ТЗДанныеДляОтображения.Колонки.Добавить("Шрифт", Новый ОписаниеТипов("Строка"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ЭтоКатегория", Новый ОписаниеТипов("Булево"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ИмяЭлемента", Новый ОписаниеТипов("Строка"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ИзображениеЭлемента", Новый ОписаниеТипов("СправочникСсылка.ПалитраТоваровРМКПрисоединенныеФайлы"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ВидМодификатора", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыМодификаторовРМК"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ИмеетсяВложенность", Новый ОписаниеТипов("Булево"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ИсточникПалитры", Новый ОписаниеТипов("Число"));
	ТЗДанныеДляОтображения.Колонки.Добавить("Упаковка", Метаданные.ОпределяемыеТипы.УпаковкаРМК.Тип);
	ТЗДанныеДляОтображения.Колонки.Добавить("СкрыватьОстаток", Новый ОписаниеТипов("Булево"));
	ТЗДанныеДляОтображения.Колонки.Добавить("КартинкаПоУмолчанию", Новый ОписаниеТипов("Булево"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ВладелецПодарка", Новый ОписаниеТипов("Строка"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ЭтоПодарок", Новый ОписаниеТипов("Булево"));
	ТЗДанныеДляОтображения.Колонки.Добавить("ВыводитьПодарокВЧек", Новый ОписаниеТипов("Булево"));

	Возврат ТЗДанныеДляОтображения;
КонецФункции

&НаКлиенте
Процедура ОтказатьсяОтВыдачи()
	
	Если ОпорныеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиДляОбработки = Новый Массив;
	ИсходнаяТаблицаПодарков = ТаблицаПодаркиБезВыбора;
	СтрокиДляОбработки = ОпорныеДанные;
	Для Каждого СтрокаПозиции Из СтрокиДляОбработки Цикл
		МассивДанных = Новый Массив;
		ОбщегоНазначенияРМККлиентПереопределяемый.ДозаполнитьДанныеРучногоВыбора(СтрокаПозиции,
			МассивДанных, ЭтотОбъект);
			
		КоличествоТовара = 0;
		СтрокиПодарка = ИсходнаяТаблицаПодарков.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаПозиции.ИдентификаторСтроки));
		Для Каждого ИсходнаяСтрокаПодарка Из СтрокиПодарка Цикл
			КоличествоТовара = КоличествоТовара + ИсходнаяСтрокаПодарка.КоличествоУпаковок;
		КонецЦикла;
		Для Каждого СтрокаМассива Из МассивДанных Цикл
			ЗаполнитьДанныеДобавляемогоТовара(СтрокаМассива, КоличествоТовара, Истина);
			ДанныеДобавляемогоТовара.Вставить("ОтказОтВыдачиПодарка", Истина);
			ДополнительныеПараметры = Новый Структура("ПропуститьКонтроль", Истина);
			СписокТоваровВыборПродолжение(Ложь, ДополнительныеПараметры);
		КонецЦикла;
	КонецЦикла;
	Если ЭтоШагСВыбором Тогда
		СтрокиУдалить = Новый Массив;
		ОтборСтрокСкидка = Новый Структура("ВладелецПодарка", ТекущаяСкидкаНаценка);
		ВариантыЭтойСкидки = ТаблицаПодаркиНаВыбор.НайтиСтроки(ОтборСтрокСкидка);
		Для Каждого СтрокаУдалить Из ВариантыЭтойСкидки Цикл
			ТаблицаПодаркиНаВыбор.Удалить(СтрокаУдалить);
		КонецЦикла;
	Иначе
		ТаблицаПодаркиБезВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПрименениеХарактеристикДляНоменклатуры(Номенклатура)
	Возврат ОбщегоНазначенияРМК.ТребуетсяВводХарактеристикиДляНоменклатуры(Номенклатура);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредставлениеКодАртикул(ТекущаяСтрока, ИспользоватьКод, ИспользоватьАртикул, ЭтоИнфоЗаголовок = Ложь)
	ПредставлениеКодАртикул = "";
	Если ИспользоватьКод ИЛИ ИспользоватьАртикул Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "НеобходимостьВводаКодаМаркировки")
			И ТекущаяСтрока.НеобходимостьВводаКодаМаркировки И ЗначениеЗаполнено(ТекущаяСтрока.КодМаркировки)
			И ТекущаяСтрока.ПоштучноеВыбытие
			И ТекущаяСтрока.ПоддерживаетсяПодключениеКОборудованиюРозлива Тогда
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ПолныйКодМаркировки", ТекущаяСтрока.КодМаркировки);
			ПредставлениеКодаМаркировки = ТекущаяСтрока.КодМаркировки;
			
			Если ТипЗнч(ТекущаяСтрока.КодыМаркировкиПоДаннымИБ) = Тип("Массив") Тогда
				Для каждого КодМаркировкиПоДаннымИБ Из ТекущаяСтрока.КодыМаркировкиПоДаннымИБ Цикл
					Если КодМаркировкиПоДаннымИБ.ПолныйКодМаркировки = ТекущаяСтрока.КодМаркировки Тогда
						ПредставлениеКодаМаркировки = КодМаркировкиПоДаннымИБ.КодМаркировкиПредставление;
					КонецЕсли;
				КонецЦикла;
			Иначе
				ОписаниеКодаМаркировки = ТекущаяСтрока.КодыМаркировкиПоДаннымИБ.НайтиСтроки(ПараметрыОтбора);
				Если ОписаниеКодаМаркировки.Количество() <> 0 Тогда
					ПредставлениеКодаМаркировки = ОписаниеКодаМаркировки[0].КодМаркировкиПредставление;
				КонецЕсли;
			КонецЕсли;
			
			ПредставлениеКодАртикул = ПредставлениеКодаМаркировки;
			
		Иначе
			ИспользоватьЗаголовок = ИспользоватьКод И ИспользоватьАртикул;
			ПредставлениеКодАртикул = "%1%2%3%4";
			ЗаголовокКод		= "";
			ЗаголовокАртикул	= "";
			КодТовара			= "";
			АртикулТовара		= "";
			
			Если ЭтоИнфоЗаголовок И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока,"ЭтоНабор")
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока,"КодНабора")
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока,"АртикулНабора")
				И ТекущаяСтрока.ЭтоНабор Тогда
				КодТовара		= ТекущаяСтрока.КодНабора;
				АртикулТовара	= ТекущаяСтрока.АртикулНабора;
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока,"Код")
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока,"Артикул") Тогда
				КодТовара		= ТекущаяСтрока.Код;
				АртикулТовара	= ТекущаяСтрока.Артикул;
			КонецЕсли;
			
			Если ИспользоватьКод И ЗначениеЗаполнено(КодТовара) Тогда
				Если ИспользоватьЗаголовок ИЛИ ЭтоИнфоЗаголовок Тогда
					ЗаголовокКод = НСтр("ru = 'Код: '");
				КонецЕсли;
			Иначе
				КодТовара = "";
			КонецЕсли;
			Если ИспользоватьАртикул И ЗначениеЗаполнено(АртикулТовара) Тогда
				Если (ИспользоватьЗаголовок ИЛИ ЭтоИнфоЗаголовок) И ЗначениеЗаполнено(КодТовара) Тогда
					ЗаголовокАртикул = НСтр("ru = ', Арт.: '");
				ИначеЕсли (ИспользоватьЗаголовок ИЛИ ЭтоИнфоЗаголовок) Тогда
					ЗаголовокАртикул = НСтр("ru = 'Арт.: '");
				КонецЕсли;
			Иначе
				АртикулТовара = "";
			КонецЕсли;
			
			ПредставлениеКодАртикул = СтрШаблон(ПредставлениеКодАртикул, ЗаголовокКод,
				КодТовара, ЗаголовокАртикул, АртикулТовара);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПредставлениеКодАртикул;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонДополнительныхДанныхЗапросаКонтроляПродаж(Форма)
	
	ДанныеКонтроляПродаж = ?(Форма.ИспользоватьКонтрольПродаж, Новый Структура, Неопределено);
	
	ДополнительныеДанные = Новый Структура("ДанныеКонтроляПродаж", ДанныеКонтроляПродаж);
	ДополнительныеДанные.Вставить("ТорговыйОбъект", Форма.ТорговыйОбъект);
	ДополнительныеДанные.Вставить("РежимКассыСамообслуживания", Форма.РежимКассыСамообслуживания);
	
	Возврат ДополнительныеДанные;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеДляФормированияПредставленияТовараВСтроке()
	
	ДанныеТовараВСтроке = Новый Структура;
	
	ДанныеТовараВСтроке.Вставить("ОтображатьНаименованиеДляПечати" , Ложь);
	ДанныеТовараВСтроке.Вставить("Номенклатура" , Неопределено);
	ДанныеТовараВСтроке.Вставить("Наименование" , "");
	ДанныеТовараВСтроке.Вставить("НаименованиеДляПечатиНоменклатуры" , "");
	ДанныеТовараВСтроке.Вставить("ПроверятьЗаполнениеХарактеристики" , Ложь);
	ДанныеТовараВСтроке.Вставить("Характеристика" , Неопределено);
	ДанныеТовараВСтроке.Вставить("НаименованиеДляПечатиХарактеристики" , "");
	ДанныеТовараВСтроке.Вставить("ЭтоНабор" , Ложь);
	ДанныеТовараВСтроке.Вставить("НоменклатураНабора" , Неопределено);
	ДанныеТовараВСтроке.Вставить("НаименованиеДляПечатиНоменклатурыНабора" , "");
	ДанныеТовараВСтроке.Вставить("ХарактеристикаНабора", Неопределено);
	ДанныеТовараВСтроке.Вставить("НаименованиеДляПечатиХарактеристикиНабора" , "");
	
	Возврат ДанныеТовараВСтроке;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПредставлениеТовараВСтроке(ТекущаяСтрока, Знач ДанныеТовара)
	
	Если НЕ ЗначениеЗаполнено(ДанныеТовара.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонПредставления = "%1 (%2)";
	
	Если ДанныеТовара.ОтображатьНаименованиеДляПечати
		И ЗначениеЗаполнено(ДанныеТовара.НаименованиеДляПечатиНоменклатуры) Тогда
		ПредставлениеНоменклатуры = ДанныеТовара.НаименованиеДляПечатиНоменклатуры;
	ИначеЕсли ЗначениеЗаполнено(ДанныеТовара.Наименование) Тогда
		ПредставлениеНоменклатуры = ДанныеТовара.Наименование;
	Иначе
		ПредставлениеНоменклатуры = Строка(ДанныеТовара.Номенклатура);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеТовара.Характеристика) Тогда
		Если ДанныеТовара.ОтображатьНаименованиеДляПечати
			И ЗначениеЗаполнено(ДанныеТовара.НаименованиеДляПечатиХарактеристики) Тогда
			ПредставлениеХарактеристики = ДанныеТовара.НаименованиеДляПечатиХарактеристики;
		Иначе
			ПредставлениеХарактеристики = Строка(ДанныеТовара.Характеристика);
		КонецЕсли;
		
		ПредставлениеТовара = СтрШаблон(ШаблонПредставления,
			ПредставлениеНоменклатуры, ПредставлениеХарактеристики);
	ИначеЕсли ДанныеТовара.ПроверятьЗаполнениеХарактеристики Тогда
		ПредставлениеТовара = СтрШаблон(ШаблонПредставления,
			ПредставлениеНоменклатуры, НСтр("ru = 'Характеристика не выбрана'"));
	Иначе
		ПредставлениеТовара = ПредставлениеНоменклатуры;
	КонецЕсли;
	
	ТекущаяСтрока.ПредставлениеНоменклатураХарактеристика = ПредставлениеТовара;
	
	Если НЕ ДанныеТовара.ЭтоНабор
		ИЛИ НЕ ЗначениеЗаполнено(ДанныеТовара.НоменклатураНабора) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеТовара.ОтображатьНаименованиеДляПечати
		И ЗначениеЗаполнено(ДанныеТовара.НаименованиеДляПечатиНоменклатурыНабора) Тогда
		ПредставлениеНоменклатурыНабора = ДанныеТовара.НаименованиеДляПечатиНоменклатурыНабора;
	Иначе
		ПредставлениеНоменклатурыНабора = Строка(ДанныеТовара.НоменклатураНабора);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеТовара.ХарактеристикаНабора) Тогда
		Если ДанныеТовара.ОтображатьНаименованиеДляПечати
			И ЗначениеЗаполнено(ДанныеТовара.НаименованиеДляПечатиХарактеристикиНабора) Тогда
			ПредставлениеХарактеристикиНабора = ДанныеТовара.НаименованиеДляПечатиХарактеристикиНабора
		Иначе
			ПредставлениеХарактеристикиНабора = Строка(ДанныеТовара.ХарактеристикаНабора);
		КонецЕсли;
		
		ПредставлениеНабора = СтрШаблон(ШаблонПредставления,
			ПредставлениеНоменклатурыНабора, ПредставлениеХарактеристикиНабора);
	Иначе
		ПредставлениеНабора = ПредставлениеНоменклатурыНабора;
	КонецЕсли;
	
	ТекущаяСтрока.ПредставлениеНабора = ПредставлениеНабора;
	
КонецПроцедуры

&НаСервере
Функция СтруктураПустойСтрокиТаблицыТоваров()
	
	СтруктураПустойСтрокиТаблицыТоваров = Новый Структура;
	ТаблицаТоваров = ТаблицаПодарков.Выгрузить(Новый Массив);
	ПустаяСтрокаТоваров = ТаблицаТоваров.Добавить();
	Для Каждого Колонка Из ТаблицаТоваров.Колонки Цикл
		ЗначениеКолонки = ПустаяСтрокаТоваров[Колонка.Имя];
		Если Колонка.Имя = "КартинкаПроцентов"
			Или Колонка.Имя = "КодыМаркировкиПоДаннымИБ" Тогда
			ЗначениеКолонки = Неопределено;
		КонецЕсли;
		СтруктураПустойСтрокиТаблицыТоваров.Вставить(Колонка.Имя, ЗначениеКолонки);
	КонецЦикла;
	
	Возврат СтруктураПустойСтрокиТаблицыТоваров;
	
КонецФункции

&НаКлиенте
Функция СтруктураРеквизитовФормыРМКДляДобавленияСтроки()
	
	ИменаРеквизитовОбъектаФормыРМК = ОбщегоНазначенияРМККлиент.ИменаРеквизитовОбъектаФормыРМКДляДобавленияСтроки();
	СтруктураРеквизитовОбъектаФормыРМК = Новый Структура(ИменаРеквизитовОбъектаФормыРМК);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовОбъектаФормыРМК, ЭтотОбъект, ИменаРеквизитовОбъектаФормыРМК);
	
	ИменаРеквизитовФормыРМК = "ОсновнаяОрганизация, ОтображатьОстаток, ИмяФормы, РозничныйВидЦены, ИспользоватьКонтрольПродаж,
		|ПараметрыСобытийПО, ФильтрПоискаПоШтрихкоду, ИспользоватьВыборСкладаПриПродаже, РежимКассыСамообслуживания,
		|ИспользоватьУточненияПринадлежностиЗапасов";
	СтруктураРеквизитовФормыРМК = Новый Структура(ИменаРеквизитовФормыРМК);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормыРМК, ЭтотОбъект, ИменаРеквизитовФормыРМК);
	СтруктураРеквизитовФормыРМК.Вставить("Объект", СтруктураРеквизитовОбъектаФормыРМК);
	
	ИменаРеквизитовТекущейСтрокиФормыРМК = ОбщегоНазначенияРМККлиент.ИменаРеквизитовТекущейСтрокиФормыРМКДляДобавленияСтроки();
	Если ЗначениеЗаполнено(ИменаРеквизитовТекущейСтрокиФормыРМК) Тогда
		Если Не Элементы.Товары.ТекущаяСтрока = Неопределено Тогда
			СтруктураРеквизитовТекущейСтрокиФормыРМК = Новый Структура(ИменаРеквизитовТекущейСтрокиФормыРМК);
			ЗаполнитьЗначенияСвойств(СтруктураРеквизитовТекущейСтрокиФормыРМК, Элементы.Товары.ТекущиеДанные, ИменаРеквизитовТекущейСтрокиФормыРМК);
			СтруктураРеквизитовФормыРМК.Вставить("ТекущаяСтрокаТовары", СтруктураРеквизитовТекущейСтрокиФормыРМК);
		КонецЕсли;
	КонецЕсли;
	
	КассыККМИОрганизации = ПодключенныеКассыККМИОрганизации();
	МассивОрганизаций = КассыККМИОрганизации.МассивОрганизаций;
	
	СтруктураРеквизитовФормыРМК.Вставить("МассивОрганизаций", МассивОрганизаций);
	
	СоответствияККТОрганизаций = Новый Соответствие;
	Для Каждого СтрокаКассы Из ТаблицаКассККМОрганизаций Цикл
		ПараметрыКассы = Новый Структура("ИдентификаторУстройства, НомерФискальногоНакопителя,
			|ОрганизацияЕГАИС, ПоддерживаетПроверкуКодовМаркировки");
		ЗаполнитьЗначенияСвойств(ПараметрыКассы, СтрокаКассы);
		СоответствияККТОрганизаций.Вставить(СтрокаКассы.Организация, ПараметрыКассы);
	КонецЦикла;
	
	СтруктураРеквизитовФормыРМК.Вставить("СоответствияККТОрганизаций", СоответствияККТОрганизаций);
	
	СтруктураРеквизитовФормыРМК.Вставить("ПустаяСтрокаТаблицыТоваров", ПустаяСтрокаТаблицыТоваров);
	
	Возврат СтруктураРеквизитовФормыРМК;
	
КонецФункции

&НаКлиенте
Функция ПодключенныеКассыККМИОрганизации()
	
	МассивКассККМ = Новый Массив;
	МассивОрганизаций = Новый Массив;
	
	Для Каждого СтрокаКасс Из ТаблицаКассККМОрганизаций Цикл
		
		МассивКассККМ.Добавить(СтрокаКасс.КассаККМ);
		МассивОрганизаций.Добавить(СтрокаКасс.Организация);
		
	КонецЦикла;
	
	СтруктураКассККМИОрганизаций = Новый Структура();
	СтруктураКассККМИОрганизаций.Вставить("МассивКассККМ", МассивКассККМ);
	СтруктураКассККМИОрганизаций.Вставить("МассивОрганизаций", МассивОрганизаций);
	
	Возврат СтруктураКассККМИОрганизаций;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаПодарковПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаПодарков.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущийТоварИдентификатор = Неопределено;
		ТекущийТоварИндексСтроки = Неопределено;
		
		Возврат;

	КонецЕсли;
	Если Не ТекущаяСтрока = ДобавленнаяСтрока Тогда
		ДобавленнаяСтрока = Неопределено;
	КонецЕсли;
	ТекущаяСтрокаРедактированияКоличества = Неопределено;
	НастроитьТекущееКоличество(ТекущаяСтрока);
	
	ТекущийТоварИдентификатор = ТекущаяСтрока.ПолучитьИдентификатор();
	ТекущийТоварИндексСтроки = ТаблицаПодарков.Индекс(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьТекущееКоличество(ТекущаяСтрока)
	
	Если ТекущаяСтрока.ЭтоНабор Тогда
		ТекущийТоварКоличество = ТекущаяСтрока.КоличествоНаборов;
	Иначе
		ТекущийТоварКоличество = ТекущаяСтрока.КоличествоУпаковок;
	КонецЕсли;
	
	ОбщегоНазначенияРМККлиентПереопределяемый.ПереопределитьНастройкуТекущегоКоличества(ЭтотОбъект,
		ТекущаяСтрока);
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Процедура ДополнитьСтрокуТовараВычисляемымиДанными(СтрокаТовара, ЭтотОбъект)
	Если Не СтрокаТовара = Неопределено Тогда
		СтрокаТовара.ЭтоПродукцияМОТП = ЭтоПродукцияМОТП(СтрокаТовара.КлючВидовПродукцииИС);
		СтрокаТовара.ЭтоМаркируемаяПродукцияЕГАИС = ЭтоМаркируемаяПродукцияЕГАИС(СтрокаТовара.КлючВидовПродукцииИС);
		СтрокаТовара.ПоддерживаетсяПодключениеКОборудованиюРозлива = ПоддерживаетсяПодключениеКОборудованиюРозлива(СтрокаТовара.КлючВидовПродукцииИС);
		ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТовара.НоменклатураНабора,
			"Код, Артикул"); 
		СтрокаТовара.КодНабора     = ДанныеНоменклатуры.Код;
		СтрокаТовара.АртикулНабора = ДанныеНоменклатуры.Артикул;
		СтрокаТовара.ПредставлениеКодАртикул = ПолучитьПредставлениеКодАртикул(СтрокаТовара, ЭтотОбъект.ИспользоватьКод, ЭтотОбъект.ИспользоватьАртикул);
		
		ДанныеДляФормированияПредставленияТовара = ДанныеДляФормированияПредставленияТовараВСтроке();
		ЗаполнитьЗначенияСвойств(ДанныеДляФормированияПредставленияТовара, СтрокаТовара);
		ДанныеДляФормированияПредставленияТовара.ОтображатьНаименованиеДляПечати = ЭтотОбъект.ОтображатьНаименованиеДляПечати;
		ЗаполнитьПредставлениеТовараВСтроке(СтрокаТовара, ДанныеДляФормированияПредставленияТовара);
		Если ЗначениеЗаполнено(СтрокаТовара.Упаковка) Тогда
			СтрокаТовара.ПредставлениеНоменклатураХарактеристика = СтрШаблон("%1 - %2",
				СтрокаТовара.ПредставлениеНоменклатураХарактеристика, СтрокаТовара.ПредставлениеЕдиницыИзмерения);
		КонецЕсли;
			
		СтрокаТовара.ЗапретитьВводДробногоКоличества = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "ЗапретитьВводДробногоКоличества");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоПродукцияМОТП(КлючВидовПродукцииИС)
	
	Возврат ОбщегоНазначенияРМК.ЭтоПродукцияМОТП(КлючВидовПродукцииИС);
		
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоМаркируемаяПродукцияЕГАИС(КлючВидовПродукцииИС)
	
	Возврат ОбщегоНазначенияРМК.ЭтоМаркируемаяПродукцияЕГАИС(КлючВидовПродукцииИС);
		
КонецФункции

&НаСервереБезКонтекста
Функция ПоддерживаетсяПодключениеКОборудованиюРозлива(КлючВидовПродукцииИС)
	
	Возврат ОбщегоНазначенияРМККлиентСервер.ПоддерживаетсяПодключениеКОборудованиюРозлива(КлючВидовПродукцииИС);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКэшПлитки()

	Если КэшиСтрокТоваров.Свойство("КэшПлитки") Или ((Не ДанныеПакета = Неопределено)
			И ЗначениеЗаполнено(ДанныеПакета.Номенклатура)) Тогда
		РеквизитыФормыРМК = СтруктураРеквизитовФормыРМКДляДобавленияСтроки();
		Если РеквизитыФормыРМК.МассивОрганизаций.Количество() > 0 Тогда
			ИнтерфейсРМКСлужебныйКлиент.ОчиститьКэшКонтроляПродаж(КэшКонтроляПродаж);
			КэшиСтрокТоваров.КэшПлитки = КэшОпорныхДанныхПлитки(РеквизитыФормыРМК, Неопределено, Неопределено);
			ДатаОбновленияКэшаКонтроляПродажПлитки = ОбщегоНазначенияКлиент.ДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КэшОпорныхДанныхПлитки(РеквизитыФормыРМК, ДанныеКонтроляПродаж, ДанныеУточненияПринадлежностиЗапасов)
	
	ИменаРеквизитовСтрокиОпорныхДанных = "Номенклатура, Характеристика, Упаковка, Цена";
	СтруктураСтрокиОпорныхДанных = Новый Структура(ИменаРеквизитовСтрокиОпорныхДанных);
	СтруктураСтрокиОпорныхДанных.Вставить("РеквизитыФормыРМК", РеквизитыФормыРМК);
	
	ПустаяСтрокаТаблицыТоваров = ОбщегоНазначения.СкопироватьРекурсивно(РеквизитыФормыРМК.ПустаяСтрокаТаблицыТоваров);
	КэшПлитки = Новый Массив;
	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	
	Для Каждого СтрокаОпорныхДанных Из ОпорныеДанные Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаОпорныхДанных.Номенклатура)
				Или СтрокаОпорныхДанных.ИсточникПлитки = ИсточникиДанныхПлитки.ВесовойТовар Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТовара = Неопределено;
		Индекс = 0;
		Для Каждого СтрокаКэша Из КэшПлитки Цикл
			
			Индекс = Индекс + 1;
			
			Если Не СтрокаОпорныхДанных.Номенклатура = СтрокаКэша.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не СтрокаОпорныхДанных.Упаковка = СтрокаКэша.Упаковка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не СтрокаОпорныхДанных.Характеристика = СтрокаКэша.Характеристика Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТовара = СтрокаКэша;
			Прервать;
			
		КонецЦикла;
		
		Если СтрокаТовара = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиОпорныхДанных, СтрокаОпорныхДанных);
			ОбновитьПустуюСтрокуДляЗаполнения(СтруктураСтрокиОпорныхДанных, ПустаяСтрокаТаблицыТоваров, РеквизитыФормыРМК);
			ДанныеТовара = СтрокаТовараНаСервере(СтруктураСтрокиОпорныхДанных);
			СтрокаТовара = ДанныеТовара.СтрокаТовара;
			Если СтрокаТовара.Свойство("ДобавлятьСтрокуВКэшСтрок") И СтрокаТовара.ДобавлятьСтрокуВКэшСтрок Тогда
				КэшПлитки.Добавить(СтрокаТовара);
				Индекс = Индекс + 1;
			КонецЕсли;
			Если Не Данныетовара.ДанныеКонтроляПродаж = Неопределено Тогда
				ИнтерфейсРМКСлужебныйКлиентСервер.ДобавитьНовыеДанныеКэшаПродаж(ДанныеКонтроляПродаж,
					Данныетовара.ДанныеКонтроляПродаж, Истина);
			КонецЕсли;
			Если Не Данныетовара.ДанныеУточненияПринадлежностиЗапасов = Неопределено Тогда
				ИнтерфейсРМКСлужебныйКлиентСервер.ДобавитьНовыеДанныеКэшаУточненияПринадлежностиЗапасов(ДанныеУточненияПринадлежностиЗапасов,
					Данныетовара.ДанныеУточненияПринадлежностиЗапасов);
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаТовара.Свойство("ДобавлятьСтрокуВКэшСтрок") И СтрокаТовара.ДобавлятьСтрокуВКэшСтрок Тогда
			СтрокаОпорныхДанных.ИндексКэшаСтрокиТовара = Индекс;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КэшПлитки;
	
КонецФункции

&НаСервере
Процедура ОбновитьПустуюСтрокуДляЗаполнения(СтруктураСтрокиОпорныхДанных,
		ПустаяСтрокаТаблицыТоваров, РеквизитыФормыРМК)
	
	ПустаяСтрокаТаблицыТоваровДляЗаполнения = ОбщегоНазначения.СкопироватьРекурсивно(ПустаяСтрокаТаблицыТоваров);
	РеквизитыФормыРМК.Вставить("ПустаяСтрокаТаблицыТоваров" ,ПустаяСтрокаТаблицыТоваровДляЗаполнения);
	СтруктураСтрокиОпорныхДанных.Вставить("РеквизитыФормыРМК", РеквизитыФормыРМК);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьТолькоВыданныхПодарков()
	
	Элементы.ТаблицаПодарков.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ОтказОтВыдачиПодарка", Ложь));
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

&НаСервереБезКонтекста
Процедура ЗаполнитьИмяЭлементаВСтрокеСоставаПалитры(СтрокаСостава, ОтображатьНаименованиеДляПечати = Ложь) Экспорт
	
	Если Не СтрокаСостава = Неопределено Тогда
		ПредставлениеНоменклатуры = "";
		ПредставлениеХарактеристики = "";
		Если НЕ ЗначениеЗаполнено(ПредставлениеНоменклатуры) Тогда
			ПредставлениеНоменклатуры = Строка(СтрокаСостава.Номенклатура);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаСостава.Характеристика)
			И НЕ ЗначениеЗаполнено(ПредставлениеХарактеристики) Тогда
			ПредставлениеХарактеристики = Строка(СтрокаСостава.Характеристика);
		КонецЕсли;
		
		ИмяЭлемента = СтрШаблон(НСтр("ru = '%1 %2 %3'"),
			ПредставлениеНоменклатуры, ПредставлениеХарактеристики, СтрокаСостава.Упаковка);
		СтрокаСостава.ИмяЭлемента = СокрЛП(ИмяЭлемента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДанныеПриИзмененииКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("УвеличитьКоличество") Тогда
		УвеличитьКоличество = ДополнительныеПараметры.УвеличитьКоличество;
	Иначе
		УвеличитьКоличество = Ложь;
	КонецЕсли;
	Дельта = ДополнительныеПараметры.Дельта;
	
	ТекущаяСтрока = ТаблицаПодарков.Получить(ТекущийТоварИндексСтроки);
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ТекущийТоварКоличество = ТекущаяСтрока.Количество;
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.ЭтоНабор Тогда
		ИзменитьКоличествоНабора(ТекущаяСтрока, УвеличитьКоличество);
		Возврат;
	ИначеЕсли ТекущаяСтрока.Весовой Тогда
		ИзменитьКоличествоВесовогоТовара(ТекущаяСтрока, УвеличитьКоличество);
		Возврат;
	КонецЕсли;
	
	Если УвеличитьКоличество Тогда
		ТекущийТоварКоличество = ТекущийТоварКоличество + Дельта;
		Если Дельта = 1 Или ТекущийТоварКоличество > 1 Тогда
			ТекущийТоварКоличество = Цел(ТекущийТоварКоличество);
		КонецЕсли;
		
		
		СкорректироватьТекущееКоличество(ТекущаяСтрока);
		ОбработатьИзменениеКоличестваНеВесовогоТовара(ТекущаяСтрока);
	Иначе
		Если ТекущийТоварКоличество > Дельта Тогда
			Если Дельта = 1 И ТекущийТоварКоличество > Цел(ТекущийТоварКоличество) Тогда
				ТекущийТоварКоличество = Цел(ТекущийТоварКоличество);
			Иначе
				ТекущийТоварКоличество = ТекущийТоварКоличество - Дельта;
			КонецЕсли;

				
			СкорректироватьТекущееКоличество(ТекущаяСтрока);
			ОбработатьИзменениеКоличестваНеВесовогоТовара(ТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти