#Область ОписаниеПеременных

&НаКлиенте
Перем ЭлектронныеВесыЗаняты;

&НаКлиенте
Перем ПоступилоСобытиеВзвешивания;

&НаКлиенте
Перем ПоказанаОшибкаНулевогоВеса;

// Массив структур с параметрами размещения на электронных весах, в разрезе эл-х весов.
&НаКлиенте
Перем ДанныеРазмещенияНаЭлектронныхВесах;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимыФормыПодтверждения = ИнтерфейсРМКСлужебныйКлиентСервер.РежимыФормыПодтвержденияДобавленияТоваров();
	ОбработатьВходныеПараметры();
	ЦветаФормы = ОбщегоНазначенияРМК.ЦветаФормыРМК();
	НастроитьЭлементыФормы();
	НастроитьСвойстваЭлементовПоИнтерфейсу();
	ТипКоличества = Метаданные.ОпределяемыеТипы.Число15_3РМК.Тип;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СчетчикВыводаОшибок = 0;
	ЭлектронныеВесыЗаняты = Ложь;
	ПоступилоСобытиеВзвешивания = Ложь;
	ПоказанаОшибкаНулевогоВеса = Ложь;
	Если Не АдресДанныхРазмещения = "" Тогда
		ДанныеРазмещенияНаЭлектронныхВесах = ПолучитьИзВременногоХранилища(АдресДанныхРазмещения);
	КонецЕсли;
	Если Не ДляОбучения И РежимФормы = РежимыФормыПодтверждения.ПодтверждениеВеса Тогда
		ЗапуститьПериодическийОпросВеса();
		Если ДоступноРедактированиеКоличества Тогда
			ТекущийЭлемент = Элементы.ОбновитьВес;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ДляОбучения Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник = "ПодключаемоеОборудование" И ЭтоПолучениеСтабильногоВеса(ИмяСобытия, Параметр) Тогда
		
		ИнтерфейсРМКСлужебныйКлиент.ОбновитьДанныеРазмещенияНаЭлектронныхВесах(ДанныеРазмещенияНаЭлектронныхВесах, Параметр);
		ПоступилоСобытиеВзвешивания = Истина;
		ОбработатьПолучениеВесаОтЭлектронныхВесов(Параметр.Вес);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекущееКоличествоПриИзменении(Элемент)
	
	Если (ДоступноРедактированиеКоличества Или Не РежимФормы = РежимыФормыПодтверждения.ПодтверждениеВеса)
			И ПоказанаОшибкаНулевогоВеса И Не ТекущееКоличество = 0 Тогда
		СкрытьОшибкуНулевогоВеса();
	КонецЕсли;
	Если ДоступноРедактированиеКоличества Тогда
		ОстановитьОпрос(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущееКоличествоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ДоступноРедактированиеКоличества И Не СкрытьЦифровуюКлавиатуру Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуВводаЗначенийСуммы(НСтр("ru = 'Вес'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущееКоличествоАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 И ДоступноРедактированиеКоличества И Не СкрытьЦифровуюКлавиатуру Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуВводаЗначенийСуммы(НСтр("ru = 'Вес'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьВес(Команда)
	
	ВозобновитьОпрос(ЭтотОбъект);
	ЗапроситьВесОднократно();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТовар(Команда)
	
	ДобавлениеПодтверждено = Истина;
	Если ДляОбучения Тогда
		ОбработатьПодтверждениеДобавления();
	Иначе
		Если РежимФормы = РежимыФормыПодтверждения.ПодтверждениеВеса И Не ОпросОстановлен Тогда
			
			ЗапроситьВесПередПодтверждением();
			
		ИначеЕсли ТекущееКоличество = 0 Тогда
			ТекстОшибки = ?(РежимФормы = РежимыФормыПодтверждения.РучнойВводВеса
				Или РежимФормы = РежимыФормыПодтверждения.ПодтверждениеВеса,
				НСтр("ru='Укажите вес.'"),
				НСтр("ru='Укажите количество.'"));
			ПоказатьОшибкуНулевогоВеса();
			ДобавлениеПодтверждено = Ложь;
			
			ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки);
			ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
			ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
		Иначе
			ОбработатьПодтверждениеДобавления();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьКоличество(Команда)
	УвеличитьКоличествоКлиент();
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьКоличество(Команда)
	УменьшитьКоличествоКлиент();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДробноеКоличество(Команда)
	
	Если ЗначениеЗаполнено(ВеличинаДробногоКоличества) Тогда
		ТекущееКоличество = ВеличинаДробногоКоличества;
		СкрытьОшибкуНулевогоВеса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьУниверсальнаяКлавиатура(Команда)
	
	ЗакрытьФормуЦифровойПанели();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЦифраУниверсальнаяКлавиатура(Команда)
	ОбработатьЦифруЦифровойКлавиатуры(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДваНуляУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуДваНуляЦифровойКлавиатуры();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапятаяУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыЗвездочкаЗапятая();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыОчистить();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьПоследнееУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПоискУниверсальнаяКлавиатура(Команда)
	
	ТекущийЭлемент = Элементы.ТекущееКоличество;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуСообщенияОбОшибке(ПараметрыДляОткрытия, ДополнительныеПараметры = Неопределено)
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ЗакрытиеСообщенияОбОшибке", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыДляОткрытия.Вставить("РежимКассыСамообслуживания", РежимКассыСамообслуживания);
	ПараметрыДляОткрытия.Вставить("УвеличенныйВариантМасштаба", УвеличенныйВариантМасштаба);
	ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыДляОткрытия, ОбработкаОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСообщенияОбОшибке(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
			И ДополнительныеПараметры.Свойство("ЗапуститьПериодическийОпросВеса")
			И ДополнительныеПараметры.ЗапуститьПериодическийОпросВеса Тогда
			
		ЗапуститьПериодическийОпросВеса();
			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПодтверждениеДобавления()
	
	Ответ = Новый Структура("КоличествоТовара", ТекущееКоличество);
	Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоПолучениеСтабильногоВеса(ИмяСобытия, Параметр)
	Возврат (ИмяСобытия = "Weighting" И Параметр.Вес > 0 И Параметр.Стабилизация = Истина);
КонецФункции

&НаКлиенте
Процедура ОбработатьПолучениеВесаОтЭлектронныхВесов(ВесТовара)
	
	Если Не (ТекущийЭлемент = Элементы.ТекущееКоличество И ДоступноРедактированиеКоличества) Тогда
		Если КоэффициентПереводаВКилограммы <> 0 Тогда
			ТекущееКоличество = ВесТовара * КоэффициентПереводаВКилограммы;
		Иначе
			ТекущееКоличество = ВесТовара;
		КонецЕсли;
		Если ТекущееКоличество > 0 И ПоказанаОшибкаНулевогоВеса Тогда
			СкрытьОшибкуНулевогоВеса();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВходныеПараметры()
	
	АдресДанныхРазмещения = "";
	Если Параметры.Свойство("ЭтоФормаобучения") Тогда
		ДляОбучения = Параметры.ЭтоФормаобучения;
	ИначеЕсли Параметры.Свойство("РежимФормы") Тогда
		РежимФормы = Параметры.РежимФормы;
	КонецЕсли;
	Если Параметры.Свойство("ТекущаяНастройкаРМК") Тогда
		ТекущаяНастройкаРМК = Параметры.ТекущаяНастройкаРМК;
	КонецЕсли;
	Если Параметры.Свойство("ИспользоватьДисплейПокупателя") Тогда
		ИспользоватьДисплейПокупателя = Параметры.ИспользоватьДисплейПокупателя;
	КонецЕсли;
	Если Параметры.Свойство("ИспользоватьПодключаемоеОборудование") Тогда
		ИспользоватьПодключаемоеОборудование = Параметры.ИспользоватьПодключаемоеОборудование;
	КонецЕсли;
	Если Параметры.Свойство("РежимКассыСамообслуживания") Тогда
		РежимКассыСамообслуживания = Параметры.РежимКассыСамообслуживания;
	КонецЕсли;
	Если Параметры.Свойство("ДоступноРедактированиеВеса") И РежимФормы = РежимыФормыПодтверждения.ПодтверждениеВеса Тогда
		ДоступноРедактированиеКоличества = Параметры.ДоступноРедактированиеВеса И Не РежимКассыСамообслуживания;
	КонецЕсли;
	Если Параметры.Свойство("КоэффициентПереводаВКилограммы") Тогда
		КоэффициентПереводаВКилограммы = Параметры.КоэффициентПереводаВКилограммы;
	КонецЕсли;
	ИнтерфейсРМКСлужебный.ПрименитьНаФормеМасштабИзПараметров(ЭтотОбъект, Параметры);
	Если Параметры.Свойство("СкрытьЦифровуюКлавиатуру") Тогда
		СкрытьЦифровуюКлавиатуру = Параметры.СкрытьЦифровуюКлавиатуру;
	КонецЕсли;
	Элементы.ДекорацияНаименованиеПозиции.Заголовок = Параметры.НаименованиеПозиции;
	ИдентификаторФормыВладельца = Параметры.ИдентификаторФормыВладельца;
	Если (Не ДляОбучения) И (Не Параметры.ТекущиеЭлектронныеВесы = Неопределено) Тогда
		ЭлектронныеВесы = Параметры.ТекущиеЭлектронныеВесы;
	КонецЕсли;
	ИзображениеТовара = Параметры.АдресИзображения;
	Если РежимФормы = РежимыФормыПодтверждения.ВводДробногоКоличества Тогда
		Если Параметры.Свойство("ВеличинаДробногоКоличества") Тогда
			ВеличинаДробногоКоличества = Параметры.ВеличинаДробногоКоличества;
		КонецЕсли;
		Если Параметры.Свойство("ШагДробногоКоличества") Тогда
			ШагДробногоКоличества = Параметры.ШагДробногоКоличества;
		КонецЕсли;
		ТекущееКоличество = 1;
	ИначеЕсли Параметры.Свойство("ДанныеРазмещения") Тогда
		АдресДанныхРазмещения = ПоместитьВоВременноеХранилище(Параметры.ДанныеРазмещения, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуДанныхРазмещения()
	
	РезультатФункции = Неопределено;
	
	Если ЗначениеЗаполнено(ЭлектронныеВесы) Тогда
		РезультатФункции
			= ИнтерфейсРМКСлужебныйКлиент.ПолучитьСтрокуДанныхРазмещения(ДанныеРазмещенияНаЭлектронныхВесах, ЭлектронныеВесы);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ЗапроситьВесПередПодтверждением()
	
	СтрокаОписанияРазмещения = ПолучитьСтрокуДанныхРазмещения();
	Если СтрокаОписанияРазмещения = Неопределено Или Не СтрокаОписанияРазмещения.ОшибкаРазмещения Тогда
		ЗапроситьВесОднократно();
	Иначе
		ДобавлениеПодтверждено = Ложь;
		ЗаголовокОшибки = НСтр("ru = 'Ошибка получения веса'");
		ТекстОшибки = НСтр("ru = 'Товар выходит за границы весовой платформы. Пожалуйста поправьте товар на весовой платформе.'");
		
		ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки, ЗаголовокОшибки);
		ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
		ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьВесОднократно()
	
	Если Не ЭлектронныеВесыЗаняты Тогда
		ПараметрыВзвешивания = Новый Структура();
		ПараметрыВзвешивания.Вставить("ВключитьОбработчикОжидания", ПоказанаОшибкаНулевогоВеса И Не ДобавлениеПодтверждено);
		ЗапроситьВес(ПараметрыВзвешивания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьВес(ПараметрыВзвешивания)
	
	ЭлектронныеВесыЗаняты = Истина;
	ПараметрыОперации = Новый Структура();
	
	ИдентификаторВесов = Неопределено;
	Если ЗначениеЗаполнено(ЭлектронныеВесы) Тогда
		ИдентификаторВесов = ЭлектронныеВесы;
	КонецЕсли;
	
	ОповещениеЗавершенияВзвешивания = Новый ОписаниеОповещения("ПолучитьВесСЭлектронныхВесовЗавершение",
		ЭтотОбъект, ПараметрыВзвешивания);
		
	МенеджерОборудованияРМККлиент.НачатьПолученияВесаСЭлектронныхВесов(ОповещениеЗавершенияВзвешивания,
		Неопределено, ИдентификаторВесов, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПериодическийОпросВеса()
	
	Если ЭлектронныеВесыЗаняты Тогда
		
		ЭтотОбъект.ПодключитьОбработчикОжидания("ЗапуститьПериодическийОпросВеса", 1, Истина);
		
	Иначе
		
		ПараметрыВзвешивания = Новый Структура();
		ПараметрыВзвешивания.Вставить("ВключитьОбработчикОжидания", Истина);
		ЗапроситьВес(ПараметрыВзвешивания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВесСЭлектронныхВесовЗавершение(Результат, ПараметрыВзвешивания) Экспорт
	
	ЭлектронныеВесыЗаняты = Ложь;
	Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(Результат, "Результат") И Результат.Результат Тогда
		
		Если Не ЗначениеЗаполнено(ЭлектронныеВесы) Тогда
			ЭлектронныеВесы = Результат.ИдентификаторУстройства;
		КонецЕсли;
		Если Не ОпросОстановлен Тогда
			ОбработатьПолучениеВесаОтЭлектронныхВесов(Результат.Вес);
			Если (Не ДобавлениеПодтверждено) И (Не ПоступилоСобытиеВзвешивания)
					И ПараметрыВзвешивания.ВключитьОбработчикОжидания Тогда
				ЭтотОбъект.ПодключитьОбработчикОжидания("ЗапуститьПериодическийОпросВеса", 1, Истина);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ТекущееКоличество = 0;
		
	КонецЕсли;
	Если ДобавлениеПодтверждено Тогда
		Если ТекущееКоличество = 0 Тогда
			ТекстОшибки = НСтр("ru='Положите товар на весы.'");
			ПоказатьОшибкуНулевогоВеса();
			ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстОшибки);
			ПараметрыОткрытияОшибки.ЭтоПредупреждение = Истина;
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ЗапуститьПериодическийОпросВеса", Истина);
			ОткрытьФормуСообщенияОбОшибке(ПараметрыОткрытияОшибки, ДополнительныеПараметры);
			ДобавлениеПодтверждено = Ложь;
		Иначе
			ОбработатьПодтверждениеДобавления();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуНулевогоВеса()
	
	Элементы.ТекущееКоличество.ЦветРамки = ЦветаФормы.ОсобыйТекст;
	Элементы.ИзображениеТовара.ЦветРамки = WebЦвета.Красный;
	ПоказанаОшибкаНулевогоВеса = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьОшибкуНулевогоВеса()
	
	Элементы.ТекущееКоличество.ЦветРамки = ЦветаФормы.Авто;
	Элементы.ИзображениеТовара.ЦветРамки = ЦветаФормы.Авто;
	ПоказанаОшибкаНулевогоВеса = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ПоказатьЦиферблат = Ложь;
	Если ДляОбучения Тогда
		Элементы.ГруппаВес.Видимость = Ложь;
	Иначе
		Если РежимФормы = РежимыФормыПодтверждения.ВводДробногоКоличества Тогда
			Элементы.ТекущееКоличество.Заголовок = НСтр("ru = 'Количество'");
			
			ПредставлениеЕдиницыИзмерения = "";
			Если Параметры.Свойство("ПредставлениеЕдиницыИзмерения") Тогда
				ПредставлениеЕдиницыИзмерения = Параметры.ПредставлениеЕдиницыИзмерения;
			КонецЕсли;
			Если ПредставлениеЕдиницыИзмерения = "" Тогда
				Элементы.ТекущееКоличество.ФорматРедактирования = "";
			Иначе
				Элементы.ТекущееКоличество.ФорматРедактирования = СтрШаблон("ЧФ='Ч ""%1""'", ПредставлениеЕдиницыИзмерения);
			КонецЕсли;
			Элементы.ОбновитьВес.Видимость = Ложь;
			Элементы.ГруппаУвеличенияУстановкиДробногоКоличества.Видимость = Истина;
			Если ЗначениеЗаполнено(ВеличинаДробногоКоличества) Тогда
				Элементы.УстановитьДробноеКоличество.Заголовок = Параметры.ЗаголовокКнопки;
				Если Параметры.ШиринаКнопки > Элементы.УстановитьДробноеКоличество.Ширина Тогда
					Элементы.УстановитьДробноеКоличество.Ширина = Параметры.ШиринаКнопки;
				КонецЕсли;
				Элементы.УстановитьДробноеКоличество.Видимость = Истина;
			КонецЕсли;
			ПоказатьЦиферблат = Истина;
		ИначеЕсли РежимФормы = РежимыФормыПодтверждения.РучнойВводВеса Тогда
			ПоказатьЦиферблат = Истина;
		Иначе
			Если ДоступноРедактированиеКоличества Тогда
				НастроитьЭлементыДляРедактированияВеса();
			Иначе
				Элементы.ТекущееКоличество.ТолькоПросмотр = Истина;
			КонецЕсли;
			Элементы.ОбновитьВес.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ПоказатьЦиферблат И Не СкрытьЦифровуюКлавиатуру Тогда
		ПостроитьЦифровуюКлавиатуру();
	Иначе
		Элементы.Переместить(Элементы.ГруппаВес, Элементы.ГруппаПраваяКолонка, Элементы.ИзображениеТовара);
		Элементы.Переместить(Элементы.ДобавитьТовар, Элементы.ГруппаКоманд, Элементы.ОтменаДобавления);
	КонецЕсли;
	Если РежимКассыСамообслуживания И ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		ЭтотОбъект.ОтображатьЗаголовок = Ложь;
		Элементы.ЗаголовокФормы.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыДляРедактированияВеса()
	
	Если Не СкрытьЦифровуюКлавиатуру Тогда
		Элементы.ТекущееКоличество.КнопкаВыбора = Истина;
		Элементы.ТекущееКоличество.КартинкаКнопкиВыбора = БиблиотекаКартинок.РМКЦифроваяПанель;
	КонецЕсли;
	Элементы.ДекорацияИзменениеВеса.Видимость = Истина;
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		Элементы.ДекорацияИзменениеВеса.Картинка = БиблиотекаКартинок.ИзменитьКрасныйРМК;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьЦифровуюКлавиатуру()
	
	ПараметрыПостроения = Новый Структура();
	ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиВертикальный", ИнтервалМеждуЭлементамиФормы.Половинный);
	ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиГоризонтальный", ИнтервалМеждуЭлементамиФормы.Половинный);
	ПараметрыПостроения.Вставить("РастягиватьПоШирине", Истина);
	ПараметрыПостроения.Вставить("ЦветКнопок", ИнтерфейсРМКСлужебный.ЦветУправляющейКнопки(Истина));
	ТекстОшибки = ИнтерфейсРМКСлужебный.ПостроитьПанельЦифровойКлавиатуры(ЭтотОбъект,
		Элементы.ГруппаЦифроваяПанель, ПараметрыПостроения);
	Если ТекстОшибки = "" Тогда
		УниверсальнаяКлавиатураСоздана = Истина;
		Элементы.ПоискСтраницы.Видимость = Ложь;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьКоличествоКлиент()
	
	Если ТекущееКоличество < 1 И ЗначениеЗаполнено(ШагДробногоКоличества) Тогда
		ТекущееКоличество = ТекущееКоличество + ШагДробногоКоличества;
	Иначе
		ТекущееКоличество = ТекущееКоличество + 1;
	КонецЕсли;
	Если ТекущееКоличество > 1 И ТекущееКоличество > Цел(ТекущееКоличество) Тогда
		ТекущееКоличество = Цел(ТекущееКоличество);
	КонецЕсли;
	СкрытьОшибкуНулевогоВеса();
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьКоличествоКлиент()
	
	Дельта = 1;
	Если ЗначениеЗаполнено(ШагДробногоКоличества) И ТекущееКоличество <= 1 Тогда
		Дельта = ШагДробногоКоличества;
	КонецЕсли;
	Если ТекущееКоличество > Дельта Тогда
		Если Дельта  = 1 И ТекущееКоличество > Цел(ТекущееКоличество) Тогда
			ТекущееКоличество = Цел(ТекущееКоличество);
		Иначе
			ТекущееКоличество = ТекущееКоличество - Дельта;
		КонецЕсли;
		СкрытьОшибкуНулевогоВеса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуЦифровойПанели()
	
	Элементы.ГруппаЦифроваяПанель.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиКурсорНаВводДробнойЧасти()
	
	ЭлементВводаСуммы = Элементы.ТекущееКоличество;
	ИмяЭлемента = ЭлементВводаСуммы.Имя;
	НачалоВыделения = 0;
	НачалоСтроки = 0;
	КонецВыделения = 0;
	КонецСтроки = 0;
	ЭлементВВодаСуммы.ПолучитьГраницыВыделения(НачалоСтроки, НачалоВыделения, КонецСтроки, КонецВыделения);
	СимволРазделителя = ИнтерфейсРМКСлужебныйКлиентСервер.РазделительДробнойЧасти();
	ПозицияРазделителя = СтрНайти(ЭлементВВодаСуммы.ТекстРедактирования, СимволРазделителя);
	ТекущийЭлемент = ЭлементВводаСуммы;
	Если ПозицияРазделителя > 0 И ПозицияРазделителя >= НачалоВыделения Тогда
		НоваяПозицияКурсора = ПозицияРазделителя + 1;
		ЭлементВВодаСуммы.УстановитьГраницыВыделения(НоваяПозицияКурсора, НоваяПозицияКурсора);
	Иначе
		ЭлементВВодаСуммы.УстановитьГраницыВыделения(НачалоВыделения, КонецВыделения);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЦифруЦифровойКлавиатуры(ИмяКомандыКлавиатуры)

	СимволКлавиатуры = ИнтерфейсРМКСлужебныйКлиент.ПолучитьСимволКоманды(ИмяКомандыКлавиатуры);
	ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, Элементы.ТекущееКоличество,
		СимволКлавиатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуДваНуляЦифровойКлавиатуры()
	
	Если ТекущееКоличество = 0 Тогда
		ТекущийЭлемент = Элементы.ТекущееКоличество;
	Иначе
		СимволыКлавиатуры = ИнтерфейсРМКСлужебныйКлиент.ПолучитьТекстКнопкиДваНуля();
		ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, Элементы.ТекущееКоличество,
			СимволыКлавиатуры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыЗвездочкаЗапятая()
	
	ПеревестиКурсорНаВводДробнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыОчистить()
	ИнтерфейсРМКСлужебныйКлиент.ОчиститьТекстРедактированияВПолеФормы(ЭтотОбъект, Элементы.ТекущееКоличество);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее()
	ИнтерфейсРМКСлужебныйКлиент.УдалитьСимволыВРедактируемомПоле(ЭтотОбъект, Элементы.ТекущееКоличество, Символы.НПП);
КонецПроцедуры

&НаСервере
Процедура НастроитьСвойстваЭлементовПоИнтерфейсу()
	
	Если Не ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85() Тогда
		
		ЭлементыПанелиОпераций = Новый Массив;
		ЭлементыПанелиОпераций.Добавить(Элементы.УменьшитьКоличество);
		ЭлементыПанелиОпераций.Добавить(Элементы.УвеличитьКоличество);
		ЭлементыПанелиОпераций.Добавить(Элементы.УстановитьДробноеКоличество);
		ЭлементыПанелиОпераций.Добавить(Элементы.ГруппаУвеличенияУстановкиДробногоКоличества);
		
		Для Каждого ЭлементПанели Из ЭлементыПанелиОпераций Цикл
			ЭлементПанели.РастягиватьПоВертикали = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводЗначенияСуммы(Результат, ДополнительныеРеквизиты) Экспорт
	
	Если НЕ Результат = Неопределено И Результат.ОперацияПодтверждена Тогда
		
		ТекущееКоличество = Результат.СуммаОперации;
		Элементы.ТекущееКоличество.ВыделенныйТекст = Результат.СуммаОперации;
		ОбновитьОтображениеДанных(Элементы.ТекущееКоличество);
		ОстановитьОпрос(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВводаЗначенийСуммы(ЗаголовокЭлемента)
	
	Если СкрытьЦифровуюКлавиатуру Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементКоличество = Элементы.ТекущееКоличество;
	
	ПараметрыОткрытия = ИнтерфейсРМКСлужебныйКлиент.ШаблонСтруктурыФормыВводаСумм();
	ПараметрыОткрытия.ИспользоватьЦифровуюКлавиатуру = (Не СкрытьЦифровуюКлавиатуру);
	ПараметрыОткрытия.Масштаб = Масштаб;
	ПараметрыОткрытия.УвеличенныйВариантМасштаба = УвеличенныйВариантМасштаба;
	ПараметрыОткрытия.ТекущаяНастройкаРМК = ТекущаяНастройкаРМК;
	ПараметрыОткрытия.ИспользоватьДисплейПокупателя
		= (ИспользоватьДисплейПокупателя И ИспользоватьПодключаемоеОборудование);
	ПараметрыОткрытия.Режим = 6;
	ПараметрыОткрытия.ЗаголовокЭлемента = ЗаголовокЭлемента;
	ПараметрыОткрытия.Формат = ЭлементКоличество.ФорматРедактирования;
	ПараметрыОткрытия.МаскаВвода = ЭлементКоличество.Маска;
	ПараметрыОткрытия.ЗначениеЭлемента = ТекущееКоличество;
	ПараметрыОткрытия.ТипЗначения = ТипКоличества;
	ПараметрыОткрытия.РежимКассыСамообслуживания = РежимКассыСамообслуживания;
	
	ОповещениеПродолжения = Новый ОписаниеОповещения("ЗавершитьВводЗначенияСуммы", ЭтотОбъект);
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаВводаСумм", ПараметрыОткрытия,,,,,ОповещениеПродолжения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОстановитьОпрос(Форма)
	
	Если Форма.РежимФормы = Форма.РежимыФормыПодтверждения.ПодтверждениеВеса Тогда
		ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
		Форма.ОпросОстановлен = Истина;
		Элементы = Форма.Элементы;
		Если ЭтоИнтерфейс85 Тогда
			Элементы.ДекорацияИзменениеВеса.ЦветКартинки = Форма.ЦветаФормы.БаннерКрасныйРМК;
		КонецЕсли;
		Элементы.ДекорацияИзменениеВеса.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВозобновитьОпрос(Форма)
	
	Форма.ОпросОстановлен = Ложь;
	Если Форма.РежимФормы = Форма.РежимыФормыПодтверждения.ПодтверждениеВеса Тогда
		ЭтоИнтерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
		Элементы = Форма.Элементы;
		Если ЭтоИнтерфейс85 Тогда
			Элементы.ДекорацияИзменениеВеса.ЦветКартинки = Новый Цвет();
		КонецЕсли;
		Элементы.ДекорацияИзменениеВеса.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти