// @strict-types
#Область ПрограммныйИнтерфейс

// При создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево - Стандартная обработка
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

	Элементы = Форма.Элементы;
	Если Форма.Элементы.Найти("Покупатели") <> Неопределено Тогда
		Форма.Элементы.Покупатели.Видимость = Ложь;
	ИначеЕсли Форма.ИмяФормы = "РегистрСведений.СтатусыПубликацииТоваровЭТП.Форма.ФормаЗаписи" Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Запись.Номенклатура");
		ВсеСвязи = Новый Массив; 
		ВсеСвязи.Добавить(НоваяСвязь);
		Элементы.Характеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(ВсеСвязи);
	КонецЕсли;

КонецПроцедуры

// Скорректировать текст.
// 
// Параметры:
//  Ключ - Строка - Ключ, по которому определяется источник текста
//  Текст - Строка - Переопределяемый текст
Процедура СкорректироватьТекст(Ключ, Текст) Экспорт

КонецПроцедуры

// Переопределяет обязательность заполнения характеристики.
// 
// Параметры:
//  Запись - ДанныеФормыСтруктура, РегистрСведенийМенеджерЗаписи.СтатусыПубликацииТоваровЭТП
//  Элемент - ПолеФормы - Элемент характеристики
//  Отказ - Булево, Неопределено - Результат
Процедура ПриОпределенииОбязательностиЗаполненияХарактеристики(Запись, Элемент, Отказ = Неопределено) Экспорт

КонецПроцедуры

// Переопределяет поля формирования представления товара или услуги.
// 
// Параметры:
//  ПоляФормированияПредставления - СписокЗначений - Строковые представления реквизитов установленного типа
//	см. ОпределяемыеТипы.НоменклатураИнтеграцияСЭлектроннымиТорговымиПлощадками
Процедура ПриОпределенииПолейПредставления(ПоляФормированияПредставления) Экспорт

КонецПроцедуры

// См. КоммерческиеПредложенияДокументыПереопределяемый.ПриОпределенииНастроекУчета
//
Процедура ПриОпределенииНастроекУчета(Настройки) Экспорт

КонецПроцедуры

#Область УсловияОтбораНоменклатуры

// Переопределяет текст запроса получения таблицы товаров или услуг по отбору.
// 
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса
//
Процедура ТекстЗапросаОтбораНоменклатуры(ТекстЗапроса) Экспорт

КонецПроцедуры

// Переопределяет список колонок полученной таблицы товаров или услуг.
// 
// Параметры:
//  ИменаКолонокРезультатаОтбора - Строка - перечисленные через "," имена колонок (без пробелов)
//
Процедура ИменаКолонокРезультатаОтбора(ИменаКолонокРезультатаОтбора) Экспорт

КонецПроцедуры

#КонецОбласти

#Область РаботаСЕдиницамиИзмерения

// Дополняет текст запроса, подменяет указанный параметр единицей измерения номенклатуры.
//
// Параметры:
// 	ТекстЗапроса - Строка - текст запроса, где необходимо указать путь к единице измерения номенклатуры.
// 	ИмяПараметра - Строка - имя параметра, которое подменяет.
// 	ИмяТаблицы - Строка - имя таблицы.
//
Процедура ДополнитьТекстЗапросаЕдиницейИзмеренияНоменклатуры(ТекстЗапроса, Знач ИмяПараметра, Знач ИмяТаблицы) Экспорт

КонецПроцедуры

#КонецОбласти

// Дополняет текст запроса и настройки схемы компоновки данных 
// 
// Параметры:
//  СхемаКомпоновкиДанных - СхемаКомпоновкиДанных
//  ДополнительныеПараметры - Структура - содержит значения ключевых полей объекта 
Процедура ДополнитьСКДПодбораТоваровПоОтбору(СхемаКомпоновкиДанных, ДополнительныеПараметры) Экспорт

КонецПроцедуры

// Дополняет настройки схемы компоновки данных 
// 
// Параметры:
//  НастройкиСКД - НастройкиКомпоновкиДанных
//  ДополнительныеПараметры - Структура - содержит значения ключевых полей объекта
//
Процедура ДополнитьНастройкиСКДПодбораТоваровПоОтбору(НастройкиСКД, ДополнительныеПараметры) Экспорт

КонецПроцедуры

// Переносит значения используемых отбров в параметры
// 
// Параметры:
//  НастройкиСКД - НастройкиКомпоновкиДанных - Настройки
//
Процедура ПеренестиОтборВПараметры(НастройкиСКД) Экспорт

КонецПроцедуры

// Дополнить структуру настроек.
// 
// Параметры:
//  Форма Форма - форма обработки "Подбор товаров по отбору"
//  СтруктураНастроек - Структура
Процедура ДополнитьСтруктуруНастроекПодбораТоваровПоОтбору(Форма, СтруктураНастроек) Экспорт

КонецПроцедуры

// Получает основные сведения о номенклатуре.
// Параметры:
//  Номенклатура - ОпределяемыйТип.НоменклатураБЭД - Номенклатура
//
// Возвращаемое значение:
//	Структура - основные сведения о номенклатуре:
//    * ЕдиницаИзмерения - Неопределено, СправочникСсылка - единица измерения номенклатуры
//    * ИспользованиеХарактеристик - Булево - признак использования характеристик номенклатуры
//
Функция СведенияОНоменклатуре(Номенклатура) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользованиеХарактеристик", Ложь);
	Результат.Вставить("ЕдиницаИзмерения", Неопределено);
	
	ИспользованиеХарактеристик = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользованиеХарактеристик
	|			ТОГДА Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользованиеХарактеристик,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&ИспользуемаяНоменклатура)";
	
	Запрос.УстановитьПараметр("ИспользуемаяНоменклатура", Номенклатура);
	Запрос.УстановитьПараметр("ИспользованиеХарактеристик", ИспользованиеХарактеристик);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Подготовить таблицу опубликованных документов
// 
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц
//  ОпубликованныеДокументы - Массив из ДокументСсылка - Документы, опубликованные в сервисе
Процедура ПодготовитьТаблицуОпубликованныхДокументовБидзаар(МенеджерВТ, ОпубликованныеДокументы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.УстановитьПараметр("ВсеДокументы", ОпубликованныеДокументы.Количество() = 0);
	Запрос.УстановитьПараметр("ОпубликованныеДокументы", ОпубликованныеДокументы);
	Запрос.УстановитьПараметр("СпособРазмещения",
		КоммерческиеПредложенияДокументыКлиентСервер.СпособРазмещенияБидзаар());
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаЗКППоставщиков.Ссылка КАК ОпубликованныйДокумент,
		|	ТаблицаЗКППоставщиков.ИдентификаторВСервисе КАК ИдентификаторВСервисе,
		|	ТаблицаЗКППоставщиков.Организация КАК Организация,
		|	ТаблицаЗКППоставщиков.МенеджерEmail КАК Email,
		|	ТаблицаЗКППоставщиков.Дата КАК Дата,
		|	СостоянияЗапросовКоммерческихПредложений.СостояниеВСервисе КАК СостояниеВСервисе
		|ПОМЕСТИТЬ ВТ_СостоянияОпубликованныхДокументов
		|ИЗ
		|	РегистрСведений.СостоянияЗапросовКоммерческихПредложений КАК СостоянияЗапросовКоммерческихПредложений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросКоммерческихПредложенийПоставщиков КАК ТаблицаЗКППоставщиков
		|		ПО СостоянияЗапросовКоммерческихПредложений.ЗапросКоммерческихПредложений = ТаблицаЗКППоставщиков.Ссылка
		|		И ТаблицаЗКППоставщиков.ЗапрашиватьПредложенияПоставщиков = &СпособРазмещения
		|		И ТаблицаЗКППоставщиков.Проведен
		|		И ВЫБОР
		|			КОГДА &ВсеДокументы
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТаблицаЗКППоставщиков.Ссылка В (&ОпубликованныеДокументы)
		|		КОНЕЦ
		|ГДЕ
		|	СостоянияЗапросовКоммерческихПредложений.НовоеСостояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗапросаКоммерческихПредложений.Завершено)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	ИдентификаторВСервисе
		|";
			
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК ОпубликованныйДокумент,
		|	"""" КАК ИдентификаторВСервисе,
		|	НЕОПРЕДЕЛЕНО КАК Организация,
		|	"""" КАК Email,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК Дата,
		|	НЕОПРЕДЕЛЕНО КАК СостояниеВСервисе
		|ПОМЕСТИТЬ ВТ_СостоянияОпубликованныхДокументов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	ИдентификаторВСервисе";
	КонецЕсли;
	
	Запрос.Выполнить();
		
КонецПроцедуры

// Зарегистрировать состояния опубликованных документов.
// 
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц
//  ТаблицаСобытий - ТаблицаЗначений - Таблица событий
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ДокументСсылка.КоммерческоеПредложениеКлиенту - Документ
//   * Значение - ПеречислениеСсылка - Состояние в сервисе
Функция ЗарегистрироватьСостоянияОпубликованныхДокументовБидзаар(МенеджерВТ, ТаблицаСобытий) Экспорт
	
	Результат = Новый Соответствие;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		ИмяКлючевойОперации =
			"ОбщийМодуль.ИнтеграцияСЭлектроннымиТорговымиПлощадками.ОбновлениеСостоянийЗКП";
		Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(ИмяКлючевойОперации); // Соответсвие
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаСобытий.УчетнаяЗапись КАК УчетнаяЗапись,
		|	ТаблицаСобытий.Организация КАК Организация,
		|	ТаблицаСобытий.ИдентификаторПроцедуры КАК ИдентификаторВСервисе,
		|	ТаблицаСобытий.Событие КАК Событие
		|ПОМЕСТИТЬ ВТ_ТаблицаСобытий
		|ИЗ
		|	&ТаблицаСобытий КАК ТаблицаСобытий
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	ИдентификаторВСервисе
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СостоянияОпубликованныхДокументов.ОпубликованныйДокумент КАК Документ,
		|	ВТ_СостоянияОпубликованныхДокументов.СостояниеВСервисе КАК СостояниеВСервисе,
		|	ВТ_ТаблицаСобытий.Событие КАК Событие
		|ИЗ
		|	ВТ_ТаблицаСобытий КАК ВТ_ТаблицаСобытий
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостоянияОпубликованныхДокументов КАК ВТ_СостоянияОпубликованныхДокументов
		|		ПО ВТ_СостоянияОпубликованныхДокументов.Организация = ВТ_ТаблицаСобытий.Организация
		|		И ВТ_СостоянияОпубликованныхДокументов.ИдентификаторВСервисе = ВТ_ТаблицаСобытий.ИдентификаторВСервисе
		|		И ВТ_СостоянияОпубликованныхДокументов.СостояниеВСервисе <> ВТ_ТаблицаСобытий.Событие
		|ГДЕ 
		|	ВТ_СостоянияОпубликованныхДокументов.ИдентификаторВСервисе IS NOT NULL
		|";

		Запрос.УстановитьПараметр("ТаблицаСобытий", ТаблицаСобытий);

		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();

		ПоправочныйКоэффициент = 100;
		КоличествоДанных = Выборка.Количество() / ПоправочныйКоэффициент;
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, ?(КоличествоДанных = 0, 0.01, КоличествоДанных));

		Если Не РезультатЗапроса.Пустой() Тогда

			КодСобытия = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.ИмяСервисаБидзаар();

			Пока Выборка.Следующий() Цикл
				Событие = Выборка["Событие"]; // Строка
				Документ = Выборка["Документ"]; // ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков
				
				Результат.Вставить(Документ, Событие);
				
				ПараметрыОбновления = РегистрыСведений.СостоянияЗапросовКоммерческихПредложений.ЗначенияПоУмолчанию(
						Документ);
				ПараметрыОбновления.СостояниеВСервисе = Событие;
				
				Состояния = ПолучитьСостоянияИзСобытия(Событие);
				Если Состояния.ТекущееСостояние <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(ПараметрыОбновления, Состояния);
				Иначе
					ЗаполнитьЗначенияСвойств(ПараметрыОбновления,
						РегистрыСведений.СостоянияЗапросовКоммерческихПредложений.ТекущееСостояние(Документ),
						"ТекущееСостояние, НовоеСостояние");
				КонецЕсли;
				
				РегистрыСведений.СостоянияЗапросовКоммерческихПредложений.ЗаписатьСтатус(Документ, ПараметрыОбновления,
					КодСобытия);
			КонецЦикла;

		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получить текущее состояние в сервисе.
// 
// Параметры:
//  Документы - Массив Из ДокументСсылка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ДокументСсылка.КоммерческоеПредложениеКлиенту - Документ
//   * Значение - ПеречислениеСсылка - Состояние в сервисе
Функция ПолучитьТекущееСостояниеВСервисеБидзаар(Документы) Экспорт
	
	Результат = Новый Соответствие;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияЗапросовКоммерческихПредложений.ЗапросКоммерческихПредложений КАК ЗапросКоммерческихПредложений,
		|	СостоянияЗапросовКоммерческихПредложений.СостояниеВСервисе КАК СостояниеВСервисе
		|ИЗ
		|	РегистрСведений.СостоянияЗапросовКоммерческихПредложений КАК СостоянияЗапросовКоммерческихПредложений
		|ГДЕ
		|	СостоянияЗапросовКоммерческихПредложений.ЗапросКоммерческихПредложений В(&Документы)";
		
		Запрос.УстановитьПараметр("Документы", Документы);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Результат.Вставить(Выборка.ЗапросКоммерческихПредложений, Выборка.СостояниеВСервисе);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить состояния из события.
// 
// Параметры:
//  Событие - Строка - Событие
// 
// Возвращаемое значение:
//  Структура - Состояния:
//   * ТекущееСостояние - Неопределено, ПеречислениеСсылка.СостоянияЗапросаКоммерческихПредложений - текущее состояние
//   * НовоеСостояние - Неопределено, ПеречислениеСсылка.СостоянияЗапросаКоммерческихПредложений - новое состояние
//
Функция ПолучитьСостоянияИзСобытия(Событие)
	
	Результат = Новый Структура;
	Результат.Вставить("ТекущееСостояние", Неопределено);
	Результат.Вставить("НовоеСостояние", Неопределено);

	СостоянияСобытий = Новый Соответствие;
	СостоянияСобытий.Вставить(
		ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СостояниеОпубликован(),
		Перечисления.СостоянияЗапросаКоммерческихПредложений.СборПредложений);
	СостоянияСобытий.Вставить(
		ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СостояниеСборПредложений(),
		Перечисления.СостоянияЗапросаКоммерческихПредложений.СборПредложений);
	СостоянияСобытий.Вставить(
		ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СостояниеСборПредложенийАвтопродление(),
		Перечисления.СостоянияЗапросаКоммерческихПредложений.СборПредложений);
	
	СостоянияСобытий.Вставить(
		ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СостояниеПодведениеИтогов(),
		Перечисления.СостоянияЗапросаКоммерческихПредложений.АнализПредложений);
	
	СостоянияСобытий.Вставить(
		ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СостояниеСборПредложенийЗавершен(),
		Перечисления.СостоянияЗапросаКоммерческихПредложений.ЗагрузкаИтоговыхДанныхБидзаар);
	СостоянияСобытий.Вставить(
		ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СостояниеСборПредложенийЗавершенБезПобедителя(),
		Перечисления.СостоянияЗапросаКоммерческихПредложений.ЗагрузкаИтоговыхДанныхБидзаар);
	СостоянияСобытий.Вставить(
		ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СостояниеПеренесенВАрхив(),
		Перечисления.СостоянияЗапросаКоммерческихПредложений.ЗагрузкаИтоговыхДанныхБидзаар);
	СостоянияСобытий.Вставить(
		ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СостояниеВозвращенИзАрхива(),
		Перечисления.СостоянияЗапросаКоммерческихПредложений.ЗагрузкаИтоговыхДанныхБидзаар);

	Результат.ТекущееСостояние = СостоянияСобытий.Получить(Событие);
	Результат.НовоеСостояние = СостоянияСобытий.Получить(Событие);

	Возврат Результат;
		
КонецФункции

#КонецОбласти