
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НавигационнаяСсылка = "e1cib/app/" + ИмяФормы;
	
	Если Не ТорговыеПредложения.ПравоНастройкиТорговыхПредложений(Истина)
		Или Не БизнесСеть.ПравоНастройкиОбменаДокументами(Истина) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ТорговыеПредложенияСлужебный.ИспользоватьФункционалПубликации() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Отсутствует функциональность публикации торговых предложений.'"),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Ссылка", Соглашение);
	ОбновитьДанныеФормы();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаДлительнаяОперация", "Видимость", Ложь);
	
	ТорговыеПредложенияСлужебный.НайтиДлительнуюОперациюСинхронизацииТорговыхПредложений(ДлительнаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТорговыеПредложения_ПослеЗаписи"
		Или ИмяСобытия = "ТорговыеПредложение_СопоставлениеНоменклатуры"
		Или ИмяСобытия = "СинхронизацияТорговыхПредложений_ПриИзменении"
		Или ИмяСобытия = "ТорговыеПредложения_ИзменениеСинхронизации" Тогда
		ОбновитьСтатистикуПубликации(Ложь, Истина, Ложь, Ложь);
	ИначеЕсли ИмяСобытия = "БизнесСеть_РегистрацияОрганизаций" Тогда
		ОбновитьСтатистикуПубликации(Ложь, Ложь, Ложь, Истина);
	ИначеЕсли ИмяСобытия = "ТорговыеПредложения_СохранениеРегионовАбонента" Тогда
		ОбновитьСтатистикуПубликации(Ложь, Ложь, Истина, Ложь);
	ИначеЕсли Источник = "ИспользоватьСервисРаботаСНоменклатурой" Тогда
		ОбновитьСтатистикуПубликации(Истина, Ложь, Истина, Ложь);
	ИначеЕсли ИмяСобытия = "РаботаСНоменклатурой_СопоставлениеНоменклатуры" Тогда	
		ОбновитьСтатистикуПубликации(Истина, Ложь, Ложь, Ложь);
	КонецЕсли;
	
	ТорговыеПредложенияКлиент.ОбработкаОповещенияСинхронизацииТорговыхПредложений(ИмяСобытия, Источник, Параметр, ДлительнаяОперация, ПараметрыСинхронизации());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "РезультатНадпись", "Видимость", ДлительнаяОперация = Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "КартинкаСостоянияСинхронизации", "Видимость", ДлительнаяОперация = Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОпубликоватьТорговыеПредложения", "Видимость", ДлительнаяОперация = Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСтатистикуПубликации(Истина, Истина, Истина, Истина);
	
	ТорговыеПредложенияКлиент.ОтобразитьСостояниеСинхронизацииТорговыхПредложений(ПараметрыСинхронизации(), ДлительнаяОперация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "РезультатНадпись", "Видимость", ДлительнаяОперация = Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "КартинкаСостоянияСинхронизации", "Видимость", ДлительнаяОперация = Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОпубликоватьТорговыеПредложения", "Видимость", ДлительнаяОперация = Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияДлительнаяОперацияНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	Если НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьФоновоеЗадание" Тогда

		СтандартнаяОбработка = Ложь;
		ДлительнаяОперация = ТорговыеПредложенияВызовСервера.ОтменитьФоновоеЗадание(ДлительнаяОперация);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаДлительнаяОперация", "Видимость", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМоиТорговыеПредложенияНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораОрганизации", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, Организации, Элементы.ОткрытьМоиТорговыеПредложенияОрганизация);
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеНоменклатурыОшибкаКартинкаНажатие(Элемент)
	ОбработатьОткрытиеФормыСопоставленияНоменклатуры();
КонецПроцедуры 

&НаКлиенте
Процедура ОрганизацииТребуетсяПовторноеПодключениеКартинкаНажатие(Элемент)
	ОчиститьСообщения();
	БизнесСетьСлужебныйКлиент.ОткрытьФормуРегистрацииОрганизаций();
КонецПроцедуры 

&НаКлиенте
Процедура ОрганизацияОшибкаНадписьНажатие(Элемент)
	ОчиститьСообщения();
	БизнесСетьСлужебныйКлиент.ОткрытьФормуРегистрацииОрганизаций();
КонецПроцедуры

&НаКлиенте
Процедура ТорговыеПредложенияОшибкаКартинкаНажатие(Элемент)
	
	ОчиститьСообщения();
	
	ПараметрыОткрытияФормы = ПараметрыОткрытияФормыСпискаПубликаций();
	ТорговыеПредложенияКлиент.ОткрытьФормуСпискаПубликаций(ПараметрыОткрытияФормы, ЭтотОбъект); 
	
	Оповестить("ТорговыеПредложения_ФильтрацияСостоянийПубликации", ПараметрыОткрытияФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТорговыеПредложенияТребуетсяСинхронизацияКартинкаНажатие(Элемент)
	
	ОчиститьСообщения();
	
	ПараметрыОткрытияФормы = ПараметрыОткрытияФормыСпискаПубликаций();
	ТорговыеПредложенияКлиент.ОткрытьФормуСпискаПубликаций(ПараметрыОткрытияФормы, ЭтотОбъект);
	
	Оповестить("ТорговыеПредложения_ФильтрацияСостоянийПубликации", ПараметрыОткрытияФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СинхронизироватьТорговыеПредложения(Команда)
	
	Отказ = Ложь;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОрганизацииТорговыхПредложений", Организации.ВыгрузитьЗначения());
	ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
	ТорговыеПредложенияКлиент.ПодключитьОрганизацииТорговыхПредложений(ДополнительныеПараметры, Отказ);
	
	Если Не Отказ Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "РезультатНадпись", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "КартинкаСостоянияСинхронизации", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОпубликоватьТорговыеПредложения", "Видимость", Ложь);
			
		ПараметрыСинхронизации = ПараметрыСинхронизации();
		ТорговыеПредложенияКлиент.ВыполнитьСинхронизациюТорговыхПредложений(
			ПараметрыСинхронизации, 
			ДлительнаяОперация);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСтатистикуПубликации(Истина, Истина, Истина, Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура СостоянияПубликаций(Команда)
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИспользоватьСтатистикуПубликации", Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСтатистикуПубликацииПоОповещению", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыОткрытияФормы = ТорговыеПредложенияКлиент.ПараметрыОткрытияФормы();
	
	ПараметрыОткрытияФормы.ОписаниеОповещения = ОписаниеОповещения;
	
	ТорговыеПредложенияКлиент.ОткрытьФормуСостоянияПубликацииТоваров(ПараметрыОткрытияФормы); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание(Команда)
	
	ИмяЗадания = ТорговыеПредложенияСлужебныйКлиент.ИмяЗаданияСинхронизацияТорговыхПредложений();
	Оповещение = Новый ОписаниеОповещения("НастроитьРасписаниеЗавершение", 	ЭтотОбъект, ИмяЗадания);
	ОбщегоНазначенияБЭДКлиент.НастроитьРасписаниеРегламентногоЗадания(ИмяЗадания, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРегистрацииОрганизацииВБизнесСети(Команда)
	ОчиститьСообщения();
	БизнесСетьСлужебныйКлиент.ОткрытьФормуРегистрацииОрганизаций();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаПубликацийТорговыхПредложений(Команда)
	
	ОчиститьСообщения();
	
	ТорговыеПредложенияКлиент.ОткрытьФормуСпискаПубликаций(Неопределено, ЭтотОбъект);
	
	Оповестить("ТорговыеПредложения_ФильтрацияСостоянийПубликации", Неопределено, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСопоставленияНоменклатуры(Команда)

	ОбработатьОткрытиеФормыСопоставленияНоменклатуры();
	
КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьФормуСопоставленияНоменклатурыПоКатегориям(Команда)
	
	ОчиститьСообщения();
	
	Если Не ИспользоватьСопоставление1СНоменклатура Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Раздел",    "НастройкиРаботаСНоменклатурой");
		ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Сервис 1С:Номенклатура'"));
		ПараметрыОткрытия.Вставить("ОписаниеРаздела",
			НСтр("ru = 'Для возможности сопоставления номенклатуры необходимо включить использование сервиса 1С:Номенклатура.'"));
		
		
		ОткрытьФорму("Обработка.РаботаСНоменклатурой.Форма.ПанельАдминистрирования", ПараметрыОткрытия, ЭтотОбъект,,,, 
			Новый ОписаниеОповещения("СопоставитьНоменклатуруСРубрикаторомПродолжение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	Иначе
		
		ОткрытьФормуСопоставленияНоменклатурыСРубрикатором();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВыключитьАвтоматическуюСинхронизацию(Команда)

	АвтоматическиСинхронизировать = Не АвтоматическиСинхронизировать;
	УстановитьКартинкуКомандыАвтоматическойСинхронизации(Элементы, АвтоматическиСинхронизировать);
	ИзменитьРегламентноеЗаданиеСинхронизацияТорговыхПредложений("Использование", АвтоматическиСинхронизировать);
	Оповестить("СинхронизацияТорговыхПредложений_ПриИзменении", АвтоматическиСинхронизировать);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасписаниеПубликации

&НаКлиенте
Процедура НастроитьРасписаниеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Расписание.Заголовок = Расписание;
	
	Оповестить(
		"СинхронизацияТорговыхПредложений_ПриИзменении", АвтоматическиСинхронизировать);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьРегламентноеЗаданиеСинхронизацияТорговыхПредложений(ИмяПараметра, ЗначениеПараметра)
	
	УстановитьПривилегированныйРежим(Истина);
	
	БизнесСеть.ИзменитьРегламентноеЗадание(
		Метаданные.РегламентныеЗадания.СинхронизацияТорговыхПредложений.Имя,
		ИмяПараметра, 
		ЗначениеПараметра);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеФормы

&НаСервере
Процедура ОбновитьДанныеФормы(АдресРезультата = Неопределено)
		
	// Получение статистики
	Если АдресРезультата <> Неопределено
		И АдресРезультатаПодсчетаСтатистики <> АдресРезультата
		И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		АдресРезультатаПодсчетаСтатистики = АдресРезультата;
		Статистика = БизнесСеть.ПолучитьУдалитьИзВременногоХранилища(АдресРезультатаПодсчетаСтатистики);
		ПараметрыВыполнения = Статистика.ПараметрыВыполнения;
	ИначеЕсли Статистика = Неопределено Тогда
		Статистика = Новый Структура;
		
		ПараметрыВыполнения = Новый Структура;
		ПараметрыВыполнения.Вставить("ИспользоватьСтатистикуСопоставления", Истина);
		ПараметрыВыполнения.Вставить("ИспользоватьСтатистикуПубликации"   , Истина);
		ПараметрыВыполнения.Вставить("ИспользоватьСведенияАбонента"       , Истина);
		ПараметрыВыполнения.Вставить("ИспользоватьРегистрациюОрганизации" , Истина);
		
	КонецЕсли;
	
#Область СтатистикаСопоставления
	
	Если ПараметрыВыполнения.ИспользоватьСтатистикуСопоставления Тогда
	
		КоличествоТоваров                    = 0;
		КоличествоСопоставленнойНоменклатуры = 0;
		КоличествоСопоставленныхКатегорий    = 0;
		КоличествоНесопоставленных           = 0;
		
		Если ТипЗнч(Статистика) = Тип("Структура") Тогда
			КоличествоТоваров = ?(Статистика.Свойство("КоличествоПозиций"), Статистика.КоличествоПозиций, КоличествоТоваров);
			КоличествоСопоставленнойНоменклатуры = ?(Статистика.Свойство("КоличествоСопоставлено1СНоменклатура"),
				Статистика.КоличествоСопоставлено1СНоменклатура, КоличествоСопоставленнойНоменклатуры);
			КоличествоСопоставленныхКатегорий = ?(Статистика.Свойство("КоличествоСопоставленоБизнесСеть"),
				Статистика.КоличествоСопоставленоБизнесСеть, КоличествоСопоставленныхКатегорий);
		КонецЕсли;
		
		Подсистема1СНоменклатураСуществует = ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.РаботаСНоменклатурой");
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеНоменклатурыГруппа", "Видимость", Подсистема1СНоменклатураСуществует);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеКатегорийГруппа", "Видимость", Подсистема1СНоменклатураСуществует);
		
		Если Подсистема1СНоменклатураСуществует Тогда 
						
			ИспользоватьСопоставление1СНоменклатура = ПолучитьФункциональнуюОпцию("ИспользоватьСервисРаботаСНоменклатурой");
			
			// Сопоставление с 1C:Номенклатура
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "СопоставлениеНоменклатурыУспех", "Видимость", КоличествоСопоставленнойНоменклатуры <> 0
					И Не ПустаяСтрока(АдресРезультатаПодсчетаСтатистики));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "СопоставлениеНоменклатурыОшибка", "Видимость", КоличествоСопоставленнойНоменклатуры = 0
					И Не ПустаяСтрока(АдресРезультатаПодсчетаСтатистики));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "СопоставлениеНоменклатурыОбновление", "Видимость", Ложь);
			
			Если КоличествоСопоставленнойНоменклатуры Тогда
				ПроцентСопоставленоНоменклатуры = Окр(КоличествоСопоставленнойНоменклатуры/КоличествоТоваров*100, 1);
				Элементы.СопоставлениеНоменклатурыУспехНадпись.Заголовок = СтрШаблон(НСтр("ru = 'Сопоставлено %1%% (%2)'"),
					ПроцентСопоставленоНоменклатуры , КоличествоСопоставленнойНоменклатуры);
			Иначе
				ПроцентСопоставленоНоменклатуры = 0;
			КонецЕсли;
		
			Если ПроцентСопоставленоНоменклатуры <> 100 Тогда 
				ПроцентСопоставленоКатегорий = ?(КоличествоТоваров,
					Окр(КоличествоСопоставленныхКатегорий/КоличествоТоваров * 100, 1), 0);
				Элементы.СопоставлениеКатегорийУспехНадпись.Заголовок = СтрШаблон(НСтр("ru = 'Сопоставлено %1%% (%2)'"),
					ПроцентСопоставленоКатегорий, КоличествоСопоставленныхКатегорий);
			КонецЕсли;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеРазноеГруппа", "Видимость", Не ПустаяСтрока(АдресРезультатаПодсчетаСтатистики));
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеКатегорийУспех", "Видимость", КоличествоСопоставленныхКатегорий > 0
				И Не ПустаяСтрока(АдресРезультатаПодсчетаСтатистики));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеКатегорийОшибка", "Видимость", КоличествоСопоставленныхКатегорий = 0
				И Не ПустаяСтрока(АдресРезультатаПодсчетаСтатистики));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеКатегорийОбновление", "Видимость", Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СтраницыСопоставления", "ТекущаяСтраница", Элементы.СтраницаСопоставленияДиаграмма);
		
		УстановитьОформлениеДиаграммыСопоставления(
			КоличествоТоваров, КоличествоСопоставленнойНоменклатуры, КоличествоСопоставленныхКатегорий);
		
	КонецЕсли; 
	
#КонецОбласти
	
#Область СтатистикаПубликации
	
	Если ПараметрыВыполнения.ИспользоватьСтатистикуПубликации Тогда
	
		Успех = Ложь;
		ТребуетсяСинхронизация = Ложь;
		Ошибка = Ложь; 
		СписокОтборовСостоянийСинхронизацииТорговыхПредложений.Очистить();
		
		ОшибкаСинхронизации          = ?(Статистика.Свойство("ОшибкаСинхронизации"), Статистика.ОшибкаСинхронизации, 0);
		СинхронизированоЧастично     = ?(Статистика.Свойство("СинхронизированоЧастично"), Статистика.СинхронизированоЧастично, 0);
		Синхронизировано             = ?(Статистика.Свойство("Синхронизировано"), Статистика.Синхронизировано, 0);
		КоличествоТорговыхСоглашений = ?(Статистика.Свойство("КоличествоТорговыхСоглашений"), Статистика.КоличествоТорговыхСоглашений, 0);
		КоличествоОрганизаций        = 
			?(Статистика.Свойство("ПодключенныеОрганизации"), Статистика.ПодключенныеОрганизации.Количество(), 0);
		ТорговоеПредложение          = ?(Статистика.Свойство("ТорговоеПредложение"), Статистика.ТорговоеПредложение, Неопределено);
		
		
		Если ОшибкаСинхронизации + СинхронизированоЧастично > 0 Тогда
			Ошибка = Истина;
			Элементы.ТорговыеПредложенияОшибкаНадпись.Заголовок = СтрШаблон(НСтр("ru = 'Есть ошибки синхронизации (%1)'"), 
				ОшибкаСинхронизации + СинхронизированоЧастично);
			СписокОтборовСостоянийСинхронизацииТорговыхПредложений.Добавить(Перечисления.СостоянияСинхронизацииТорговыеПредложения.ОшибкаСинхронизации);
			СписокОтборовСостоянийСинхронизацииТорговыхПредложений.Добавить(Перечисления.СостоянияСинхронизацииТорговыеПредложения.СинхронизированоЧастично);
		ИначеЕсли ТребуетсяСинхронизация > 0 Тогда
			ТребуетсяСинхронизация = Истина;
			Элементы.ТорговыеПредложенияТребуетсяСинхронизацияНадпись.Заголовок = СтрШаблон(НСтр("ru = 'Требуется синхронизация (%1)'"),
				ТребуетсяСинхронизация);
			СписокОтборовСостоянийСинхронизацииТорговыхПредложений.Добавить(Перечисления.СостоянияСинхронизацииТорговыеПредложения.ТребуетсяСинхронизация);
		ИначеЕсли Синхронизировано > 0 Тогда
			Успех = Истина;
			Элементы.ТорговыеПредложенияУспехНадпись.Заголовок = СтрШаблон(НСтр("ru = 'Торговые предложения настроены (%1)'"), 
				Синхронизировано);
		Иначе
			Ошибка = Истина;
			Элементы.ТорговыеПредложенияОшибкаНадпись.Заголовок = НСтр("ru = 'Требуется настройка'");
		КонецЕсли; 
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ТорговыеПредложенияУспех", "Видимость", Успех);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ТорговыеПредложенияТребуетсяСинхронизация", "Видимость", ТребуетсяСинхронизация);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ТорговыеПредложенияОшибка", "Видимость", Ошибка);

		// Подсчет количества опубликованных и ошибочных позиций
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СтраницыСостоянияПубликаций", "ТекущаяСтраница", Элементы.СтраницаСостоянияПубликацийДиаграмма); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ТорговыеПредложенияОбновление", "Видимость", Ложь);

		КоличествоОпубликованных = 0;
		КоличествоОшибок         = 0;
		
		Если ТипЗнч(Статистика) = Тип("Структура") И Статистика.Свойство("КоличествоОпубликованных") Тогда
			КоличествоОпубликованных = Статистика.КоличествоОпубликованных;
		КонецЕсли; 
		
		Если ТипЗнч(Статистика) = Тип("Структура") И Статистика.Свойство("КоличествоОшибок") Тогда
			КоличествоОшибок = Статистика.КоличествоОшибок;
		КонецЕсли;
		
	
		ЕстьБлокирующиеОшибки = КоличествоТоваров = 0
			ИЛИ КоличествоОрганизаций = 0
			ИЛИ КоличествоТорговыхСоглашений = 0;
		
		Если Не ТорговоеПредложение = Неопределено Тогда
			ЭлементСостояния = Элементы.РезультатНадпись; 
			ЭлементКартинкаСостояния = Элементы.КартинкаСостоянияСинхронизации;
			ТорговыеПредложения.ОбновитьДекорациюСостоянияПубликации(ТорговоеПредложение, ЭлементСостояния, , ЭлементКартинкаСостояния);
			Если ПустаяСтрока(ЭлементСостояния.Заголовок) Тогда
				ЭлементСостояния.Заголовок = НСтр("ru = 'Новая публикация'");
			КонецЕсли;
			ЭлементСостояния.Гиперссылка = Ложь;
            ЭлементКартинкаСостояния.Гиперссылка = Ложь;
		Иначе
			Элементы.РезультатНадпись.Заголовок = "";
		КонецЕсли;
		
		УстановитьОформлениеДиаграммыСостоянияПубликации(Статистика);
		
	КонецЕсли;
	
#КонецОбласти
	
#Область РегистрацияОрганизаций
	
	Если ПараметрыВыполнения.ИспользоватьРегистрациюОрганизации Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОрганизацияОбновление", "Видимость", Ложь);

		КоличествоОрганизаций        = 
			?(Статистика.Свойство("ПодключенныеОрганизации"), Статистика.ПодключенныеОрганизации.Количество(), 0);
				
		ОпубликованныеОрганизации = ТорговыеПредложенияСлужебный.ПолучитьОрганизацииОпубликованныхТорговыхПредложений(Истина);
		Организации.ЗагрузитьЗначения(ОпубликованныеОрганизации);
		
		ИспользуетсяНесколькоОрганизаций = ?(Статистика.Свойство("ИспользуетсяНесколькоОрганизаций"), 
			Статистика.ИспользуетсяНесколькоОрганизаций, Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОрганизацияУспех", "Видимость", КоличествоОрганизаций <> 0);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОрганизацияОшибка", "Видимость", КоличествоОрганизаций = 0);
		
		Если КоличествоОрганизаций <> 0 Тогда
			Если ИспользуетсяНесколькоОрганизаций Тогда
				Элементы.ОрганизацияУспехНадпись.Заголовок = СтрШаблон(НСтр("ru = 'Организации зарегистрированы (%1)'"),
				КоличествоОрганизаций);
			Иначе
				Элементы.ОрганизацияУспехНадпись.Заголовок = НСтр("ru = 'Организация зарегистрирована'");
			КонецЕсли;
		ИначеЕсли ИспользуетсяНесколькоОрганизаций Тогда
			Элементы.ОрганизацияОшибкаНадпись.Заголовок = НСтр("ru = 'Организации не зарегистрированы'");
		Иначе
			Элементы.ОрганизацияОшибкаНадпись.Заголовок = НСтр("ru = 'Организация не зарегистрирована'");
		КонецЕсли;
		
		КоличествоОпубликованныхОрганизаций = ОпубликованныеОрганизации.Количество();
		Если КоличествоОпубликованныхОрганизаций > 0 Тогда
			ОрганизацияОтбораФормыПоиска = Организации[0].Значение;
		КонецЕсли;
			
		ОрганизацииТребуетсяПовторноеПодключение = 
			ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				Статистика, "ОрганизацииТребуетсяПовторноеПодключение", Новый Массив);
		
		КоличествоОрганизацийТребуетсяПовторноеПодключение = ОрганизацииТребуетсяПовторноеПодключение.Количество();

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОрганизацииТребуетсяПовторноеПодключение", "Видимость",
				КоличествоОрганизацийТребуетсяПовторноеПодключение > 0);
				
		ШаблонТребуетсяПовторноеПодключение = НСтр("ru = 'Требуется повторное подключение (%1)'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
			
		ТекстТребуетсяПовторноеПодключение = 
			СтрШаблон(ШаблонТребуетсяПовторноеПодключение, КоличествоОрганизацийТребуетсяПовторноеПодключение);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОрганизацииТребуетсяПовторноеПодключениеНадпись", "Заголовок", 
				ТекстТребуетсяПовторноеПодключение);

		ДоступностьСсылки = Не ОрганизацияОтбораФормыПоиска.Пустая();
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОткрытьМоиТорговыеПредложения", "Доступность", ДоступностьСсылки);
		
	КонецЕсли;
	
#КонецОбласти
	
#Область АвтоматическаяПубликация
	
	УсловноеГруппыОформлениеСинхронизации();
	
#КонецОбласти 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатистикуПубликации(ИспользоватьСтатистикуСопоставления, ИспользоватьСтатистикуПубликации,
		ИспользоватьСведенияАбонента, ИспользоватьРегистрациюОрганизации)
	
	Если ИспользоватьСтатистикуСопоставления Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СтраницыСопоставления", "ТекущаяСтраница", Элементы.СтраницаСопоставленияДлительнаяОперация);
						
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеНоменклатурыУспех", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеНоменклатурыОшибка", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеНоменклатурыОбновление", "Видимость", Истина);
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеКатегорийУспех", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеКатегорийОшибка", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СопоставлениеКатегорийОбновление", "Видимость", Истина);
				
	КонецЕсли;
	
	Если ИспользоватьСтатистикуПубликации Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ТорговыеПредложенияУспех", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ТорговыеПредложенияТребуетсяСинхронизация", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ТорговыеПредложенияОшибка", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ТорговыеПредложенияОбновление", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СтраницыСостоянияПубликаций", "ТекущаяСтраница", Элементы.СтраницаСостоянияПубликацийДлительнаяОперация);
			
	КонецЕсли;
	
	Если ИспользоватьРегистрациюОрганизации Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОрганизацияУспех", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОрганизацияОшибка", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОрганизацииТребуетсяПовторноеПодключение", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОрганизацияОбновление", "Видимость", Истина);

	КонецЕсли;
	
	ПараметрыПроцедуры = ТорговыеПредложенияКлиент.ПараметрыОбновленияСтатистикиСинхронизации(ЭтотОбъект);
	ПараметрыПроцедуры.ИспользоватьСтатистикуСопоставления = ИспользоватьСтатистикуСопоставления;
	ПараметрыПроцедуры.ИспользоватьСтатистикуПубликации    = ИспользоватьСтатистикуПубликации;
	ПараметрыПроцедуры.ИспользоватьСведенияАбонента        = ИспользоватьСведенияАбонента;
	ПараметрыПроцедуры.ИспользоватьРегистрациюОрганизации  = ИспользоватьРегистрациюОрганизации;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьСтатистикуПубликацииЗавершение", ЭтотОбъект);
	ТорговыеПредложенияКлиент.ОбновитьСтатистикуСинхронизации(ОповещениеОЗавершении, ПараметрыПроцедуры, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатистикуПубликацииПоОповещению(Результат, ДополнительныеПараметры) Экспорт
	
	ИспользоватьСтатистикуСопоставления = Ложь;
	ИспользоватьСтатистикуПубликации    = Ложь;
	
	Если Не ДополнительныеПараметры = Неопределено Тогда
		
		Если ДополнительныеПараметры.Свойство("ИспользоватьСтатистикуСопоставления") Тогда
			ИспользоватьСтатистикуСопоставления = ДополнительныеПараметры.ИспользоватьСтатистикуСопоставления;
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ИспользоватьСтатистикуПубликации") Тогда
			ИспользоватьСтатистикуПубликации = ДополнительныеПараметры.ИспользоватьСтатистикуПубликации;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьСтатистикуПубликации(ИспользоватьСтатистикуСопоставления, ИспользоватьСтатистикуПубликации, Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатистикуПубликацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено
		Или Результат.Статус <> "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанныеФормы(Результат.АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область СопоставлениеНоменклатуры

&НаКлиенте
Процедура ОбработатьОткрытиеФормыСопоставленияНоменклатуры()

	ОчиститьСообщения();
	
	Если Не ИспользоватьСопоставление1СНоменклатура Тогда 
		
		ОбщийМодульРаботаСНоменклатуройКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСНоменклатуройКлиент");
		
		ПараметрыОткрытия = ОбщийМодульРаботаСНоменклатуройКлиент.ПараметрыФормыПанелиАдминистрирования();
		ПараметрыОткрытия.Раздел          =    "НастройкиРаботаСНоменклатурой";
		ПараметрыОткрытия.Заголовок       = НСтр("ru = 'Сервис 1С:Номенклатура'");
		ПараметрыОткрытия.ОписаниеРаздела = 
			НСтр("ru = 'Для возможности сопоставления номенклатуры необходимо включить использование сервиса 1С:Номенклатура.'");
			
		ОбщийМодульРаботаСНоменклатуройКлиент.ОткрытьФормуПанелиАдминистрирования(ПараметрыОткрытия, ЭтотОбъект, 
			Новый ОписаниеОповещения("СопоставитьНоменклатуруСервисаПродолжение", ЭтотОбъект), 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	Иначе
		
		ОткрытьФормуСопоставленияНоменклатурыСервиса();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СопоставитьНоменклатуруСРубрикаторомПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = Неопределено И Результат.ИспользоватьСервисРаботаСНоменклатурой Тогда
		ОткрытьФормуСопоставленияНоменклатурыСРубрикатором();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьНоменклатуруСервисаПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = Неопределено И Результат.ИспользоватьСервисРаботаСНоменклатурой Тогда
		
		ОткрытьФормуСопоставленияНоменклатурыСервиса();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСопоставленияНоменклатурыСервиса()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИспользоватьСтатистикуСопоставления", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьСтатистикуПубликацииПоОповещению", ЭтотОбъект, ДополнительныеПараметры);
	МодульРаботаСНоменклатуройКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСНоменклатуройКлиент");
	ПараметрыОткрытия = МодульРаботаСНоменклатуройКлиент.ПараметрыФормыСопоставленийНоменклатуры("ТорговыеПредложения");
	МодульРаботаСНоменклатуройКлиент.ОткрытьФормуСопоставленияНоменклатуры(ПараметрыОткрытия, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСопоставленияНоменклатурыСРубрикатором()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИспользоватьСтатистикуСопоставления", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьСтатистикуПубликацииПоОповещению", ЭтотОбъект, ДополнительныеПараметры);
	МодульРаботаСНоменклатуройКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСНоменклатуройКлиент");
	ПараметрыОткрытия = МодульРаботаСНоменклатуройКлиент.ПараметрыФормыСопоставленияНоменклатурыСРубрикатором();
	
	ПараметрыОткрытия.Номенклатура = ТорговыеПредложенияВызовСервера.ПубликуемаяНоменклатураТорговыхПредложений();
	
	МодульРаботаСНоменклатуройКлиент.ОткрытьФормуСопоставленияНоменклатурыСРубрикатором(ПараметрыОткрытия, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СинхронизацияТорговыхПредложений

&НаКлиенте
Функция ПараметрыСинхронизации()
	
	ПараметрыСинхронизации = ТорговыеПредложенияКлиент.ПараметрыСинхронизацииТорговыхПредложений(ЭтотОбъект);
	ПараметрыСинхронизации.ВыводитьПрогрессВыполнения     = Истина;
	ПараметрыСинхронизации.ГруппаДлительнойОперации       = Элементы.ГруппаДлительнаяОперация;
	ПараметрыСинхронизации.НадписьПрогресса               = Элементы.ДекорацияДлительнаяОперацияНадпись;
	ПараметрыСинхронизации.ОповещениеОЗавершении          = 
		Новый ОписаниеОповещения("СинхронизироватьТорговыеПредложенияЗавершение", ЭтотОбъект);
	
	Возврат ПараметрыСинхронизации;
	
КонецФункции

&НаКлиенте
Процедура СинхронизироватьТорговыеПредложенияЗавершение(Результат, ДополнительныеПараметры) Экспорт 

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "РезультатНадпись", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "КартинкаСостоянияСинхронизации", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОпубликоватьТорговыеПредложения", "Видимость", Истина);
	ДлительнаяОперация = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура УсловноеГруппыОформлениеСинхронизации(РегламентноеЗаданиеВключено = Неопределено)
	
	ТорговыеПредложенияСлужебный.УсловноеОформлениеГруппыСинхронизации(ЭтотОбъект, РегламентноеЗаданиеВключено);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НастроитьРасписание", "Видимость", АвтоматическиСинхронизировать);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Расписание", "Видимость", АвтоматическиСинхронизировать); 
	
	 УстановитьКартинкуКомандыАвтоматическойСинхронизации(Элементы, АвтоматическиСинхронизировать);
	 
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияОрганизации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Организации = ДополнительныеПараметры.ОрганизацииТорговыхПредложений;
	ПодключаемаяОрганизация = ДополнительныеПараметры.ПодключаемаяОрганизация;
	
	Если ЗначениеЗаполнено(Организации) Тогда
		Организации.Удалить(Организации.Найти(ПодключаемаяОрганизация));
	КонецЕсли;
	
	Отказ = Ложь;
	Если Организации.Количество() > 0 Тогда
		ТорговыеПредложенияКлиент.ПодключитьОрганизацииТорговыхПредложений(ДополнительныеПараметры, Отказ);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если РезультатЗакрытия <> Неопределено 
		Или Не Отказ Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатНадпись", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "КартинкаСостоянияСинхронизации", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОпубликоватьТорговыеПредложения", "Видимость", Ложь);
		ПараметрыСинхронизации = ПараметрыСинхронизации();
		ТорговыеПредложенияКлиент.ВыполнитьСинхронизациюТорговыхПредложений(
			ПараметрыСинхронизации, 
			ДлительнаяОперация);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыОткрытияФормыСпискаПубликаций()

	Результат = Новый Структура; 
	Если СписокОтборовСостоянийСинхронизацииТорговыхПредложений.Количество() > 0 Тогда
		Результат.Вставить("ОтборСостояния", СписокОтборовСостоянийСинхронизацииТорговыхПредложений.ВыгрузитьЗначения()); 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьКартинкуКомандыАвтоматическойСинхронизации(Элементы, АвтоматическиСинхронизировать)
	
	Если АвтоматическиСинхронизировать Тогда
		КартинкаКоманды = БиблиотекаКартинок.ПереключательВключенТорговыеПредложения;
	Иначе
		КартинкаКоманды = БиблиотекаКартинок.ПереключательВыключенЦветнойТорговыеПредложения;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ВключитьВыключитьАвтоматическуюСинхронизацию", "Картинка", КартинкаКоманды);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПослеВыбораОрганизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОрганизацияОтбораФормыПоиска = Результат.Значение;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Контрагент", ОрганизацияОтбораФормыПоиска); 
	
	Оповестить("ТорговыеПредложения_ПоискПоОтборам_Обновить", ПараметрыОткрытияФормы, ЭтотОбъект);
	
	ТорговыеПредложенияКлиент.ОткрытьФормуПоискаПоОтборам(ПараметрыОткрытияФормы);
	
КонецПроцедуры

#Область Диаграммы

&НаСервере
Процедура УстановитьОформлениеДиаграммыСостоянияПубликации(Статистика)
	
	Если Не ЗначениеЗаполнено(Статистика) Тогда
		Возврат;
	КонецЕсли;
	
	ДиаграммаСостоянийПубликации.Обновление = Ложь;
		
	ДиаграммаСостоянийПубликации.УстановитьЗначение(0, 0, Статистика.КоличествоОпубликованных);
	ДиаграммаСостоянийПубликации.УстановитьЗначение(0, 1, Статистика.ТребуетсяСинхронизация);
	ДиаграммаСостоянийПубликации.УстановитьЗначение(0, 2, Статистика.КоличествоОшибок);
	
	ДиаграммаСостоянийПубликации.Обновление = Истина;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОформлениеДиаграммыСопоставления(КоличествоТоваров, 
	КоличествоСопоставленнойНоменклатуры, КоличествоСопоставленныхКатегорий)
	
	ДиаграммаСопоставления.Обновление = Ложь;
	
	ДиаграммаСопоставления.УстановитьЗначение(0, 0, КоличествоСопоставленнойНоменклатуры);
	ДиаграммаСопоставления.УстановитьЗначение(0, 1, КоличествоТоваров - КоличествоСопоставленнойНоменклатуры);

	ДиаграммаСопоставления.УстановитьЗначение(1, 0, КоличествоСопоставленныхКатегорий);
	ДиаграммаСопоставления.УстановитьЗначение(1, 1, КоличествоТоваров - КоличествоСопоставленныхКатегорий);
	
	ДиаграммаСопоставления.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область Инициализация 

КлючНастроекФормы = "Обработка.ТорговыеПредложения.Форма.ПомощникПубликации85/ТекущиеДанные";

#КонецОбласти
