
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПоиска = Неопределено;
	Если НЕ Параметры.Свойство("ЗначенияПоиска", ЗначенияПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуНоменклатурыДляОстатков(ЗначенияПоиска);
	
	ЭтоБазоваяРМК = ОбщегоНазначенияРМК.ЭтоБазоваяРМК();
	Элементы.ГруппаПоказыватьОстаток.Видимость = Не ЭтоБазоваяРМК;
	
	Если ЭтоБазоваяРМК И ТаблицаНоменклатурыДляОстатков.Количество() > 0
		И Параметры.Свойство("ОтображатьОстаток", ПоказыватьОстатокНоменклатуры) Тогда
		
		Элементы.КолонкиОстатка.Видимость = ПоказыватьОстатокНоменклатуры;
		СкладОстатков = Параметры.ТорговыйОбъект;
		
	ИначеЕсли Не ЭтоБазоваяРМК И ТаблицаНоменклатурыДляОстатков.Количество() > 0 Тогда
		
		НастройкиВыбора = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиФормыВыбораДанныхПоискаПоШК", "");
		Если ТипЗнч(НастройкиВыбора) = Тип("Структура") Тогда
			Если НастройкиВыбора.Свойство("ПоказыватьОстатокНоменклатуры") Тогда
				ПоказыватьОстатокНоменклатуры = НастройкиВыбора.ПоказыватьОстатокНоменклатуры;
			КонецЕсли;
			Если НастройкиВыбора.Свойство("СкладОстатков") Тогда
				СкладОстатков = НастройкиВыбора.СкладОстатков;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СкладОстатков) Тогда
			РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьТекущийСклад(СкладОстатков);
		КонецЕсли;
		
		Элементы.СкладОстатков.Доступность = ПоказыватьОстатокНоменклатуры;
		Элементы.КолонкиОстатка.Видимость = ПоказыватьОстатокНоменклатуры;
		
	Иначе
		
		Если Параметры.Свойство("ПоказыватьБонусы") Тогда
			Элементы.ТаблицаВыбораШаблонШтрихкода.Видимость = Ложь;
			Элементы.КолонкиОстатка.Видимость = Параметры.ПоказыватьБонусы;
			Элементы.ТаблицаВыбораРезерв.Видимость = Ложь;
		Иначе
			Элементы.КолонкиОстатка.Видимость = Ложь;
		КонецЕсли;
		Элементы.СкладОстатков.Доступность 			= Ложь;
		Элементы.ГруппаПоказыватьОстаток.Видимость	= Ложь;
		
	КонецЕсли;
		
	Параметры.Свойство("Штрихкод", Штрихкод);
	Параметры.Свойство("ДанныеПО", Штрихкод);
	Параметры.Свойство("МагнитныйКод", МагнитныйКод);
	Элементы.ТаблицаВыбораВыбрана.Видимость = Ложь;
	Элементы.ТаблицаВыбораКодПоиска.Видимость = Ложь;
	СтрокаЗаголовка = "";
	
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		СтрокаЗаголовка = НСтр("ru = 'Найдено по штрихкоду: %1'");
		СтрокаЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаЗаголовка, Штрихкод);
	Иначе
		СтрокаЗаголовка = НСтр("ru = 'Найдено по магнитному коду: %1'");
		СтрокаЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаЗаголовка, МагнитныйКод);
	КонецЕсли;
	
	ЭтотОбъект.Заголовок = СтрокаЗаголовка;
	ЭтотОбъект.АвтоЗаголовок = Ложь;
	
	СтрокиДерева = ДеревоВыбора.ПолучитьЭлементы();
	
	СтруктураВыбораНомераТелефона = Неопределено;
	СтруктураВыбораАдресаЭП = Неопределено;
	СтруктураВыбораСоздатьКарту = Неопределено;
	Элементы.ТаблицаВыбораЗаписатьНомерТелефона.Видимость = Ложь;
	Элементы.ТаблицаВыбораЗаписатьАдресЭП.Видимость = Ложь;
	Элементы.ТаблицаВыбораСоздатьКарту.Видимость = Ложь;
	
	Для Каждого СтрокаВыбора Из ЗначенияПоиска Цикл
		
		Если СтрокаВыбора.Владелец = Неопределено Тогда
			
			Если СтрокаВыбора.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.Телефон Тогда
				Элементы.ТаблицаВыбораЗаписатьНомерТелефона.Видимость = Истина;
				СтруктураВыбораНомераТелефона = СтрокаВыбора;
			ИначеЕсли СтрокаВыбора.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.АдресЭП Тогда
				Элементы.ТаблицаВыбораЗаписатьАдресЭП.Видимость = Истина;
				СтруктураВыбораАдресаЭП = СтрокаВыбора;
			ИначеЕсли СтрокаВыбора.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.Карта Тогда
				Элементы.ТаблицаВыбораСоздатьКарту.Видимость = Истина;
				СтруктураВыбораСоздатьКарту = СтрокаВыбора;
			КонецЕсли;
		
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = СтрокиДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыбора);
		
		Если НЕ НоваяСтрока.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.Телефон
			И НЕ НоваяСтрока.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.АдресЭП
			И НЕ НоваяСтрока.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.НоменклатураВесовой Тогда
			НоваяСтрока.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.ПустаяСсылка();
		КонецЕсли;
		
		НоваяСтрока.ПредставлениеОбъекта =
		"" + СтрокаВыбора.Владелец
		+ ?(ЗначениеЗаполнено(СтрокаВыбора.Характеристика), ", " + СтрокаВыбора.Характеристика , "")
		+ ?(ЗначениеЗаполнено(СтрокаВыбора.Упаковка), ", " + СтрокаВыбора.Упаковка, "");
		
		РаботаСоШтрихкодамиПереопределяемый.ДополнитьСтрокуТаблицыВыбора(НоваяСтрока, СтрокаВыбора);
		
		Если СтрокаВыбора.Свойство("АктивизироватьСтроку") Тогда
			Элементы.ТаблицаВыбора.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ТаблицаВыбора.ТолькоПросмотр = Истина;
	
	Если ПоказыватьОстатокНоменклатуры Тогда
		ОбновитьОстаткиНоменклатурыВДереве();
	КонецЕсли;
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаВыбора;
	
	МРЦ = 0;
	Если Параметры.Свойство("ПоказатьКолонкуЦена") Тогда
		Элементы.ТаблицаВыбораЦена.Видимость = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("МРЦ", МРЦ) Тогда
		Элементы.ДекорацияПодсказка.Видимость = Истина;
		Элементы.ТаблицаВыбораЦена.Видимость = Истина;
		Элементы.ТаблицаВыбораЦена.Заголовок = СтрШаблон(НСтр("ru = 'Цена  (МРЦ=%1)'"), МРЦ);
		
		Если Элементы.ТаблицаВыбора.ТекущаяСтрока = Неопределено Тогда
			Элементы.ДекорацияПодсказка.Заголовок =
				СтрШаблон(НСтр("ru = 'МРЦ=%1. Отсутствует товар с соответствующей ценой.'"), МРЦ);
		Иначе
			Элементы.ДекорацияПодсказка.Заголовок = СтрШаблон(НСтр("ru = 'МРЦ=%1.'"), МРЦ);
		КонецЕсли;
		
	КонецЕсли;
	
	Параметры.Свойство("ПараметрыШтрихкода", ПараметрыШтрихкода);
	
	УстановитьУсловноеОформление();
	
	Если НЕ КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5 Тогда
		Элементы.Переместить(Элементы.ТаблицаВыбораВыбрать, Элементы.ГруппаКоманднаяПанель,
			Элементы.ТаблицаВыбораЗаписатьНомерТелефона);
	КонецЕсли;
	ИспользоватьНастройкиКаталога = Истина;
	УстановитьВидимостьЭлементаФормы(Элементы.НастройкаКаталогаПереключитьНастройку, Ложь);
	СоздатьЭлементыНастроекКаталога();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.ТаблицаВыбора.ТекущаяСтрока = Неопределено Тогда
		Элементы.ТаблицаВыбора.ТекущаяСтрока = 0;
		Элементы.ТаблицаВыбора.ТекущаяСтрока = Неопределено;
	КонецЕсли;
	
	НастроитьОтображениеКаталогаПриОткрытии();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СкладОстатковПриИзменении(Элемент)
	СкладОстатковПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОстатокНоменклатурыПриИзменении(Элемент)
	ПоказыватьОстатокНоменклатурыПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВыбора

&НаКлиенте
Процедура ТаблицаВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные.КартаНедействительна Тогда
		ТекстСообщения = НСтр("ru = 'Дисконтная карта %1 недействительна'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
			ТекущиеДанные.ПредставлениеОбъекта);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		Закрыть(ПодготовитьСтруктуруВыбора());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораВыбранаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПодчиненныеСтроки = ТекущаяСтрока.ПолучитьЭлементы();
		Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
			ПодчиненнаяСтрока.Выбрана = ТекущаяСтрока.Выбрана;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНомерТелефона(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора(СтруктураВыбораНомераТелефона));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьАдресЭП(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора(СтруктураВыбораАдресаЭП));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКарту(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора(СтруктураВыбораСоздатьКарту));
	
КонецПроцедуры

#Область КомандыНастройкиКаталога

&НаКлиенте
Процедура КомандаПолеКаталогаКнопка(Команда)
	
	НомерПоля = СтрЗаменить(Команда.Имя,"ПолеКаталогаКнопка_", "");
	ИмяПоля = НастройкаКаталогаИменаПолей.НайтиПоИдентификатору(НомерПоля);
	ИмяКолонки = СтрЗаменить(ИмяПоля, "ДеревоВыбора.", "");
	
	ЗначениеСписка = НастройкаКаталогаКолонкиОтключенные.НайтиПоЗначению(ИмяКолонки);
	
	Если ЗначениеСписка = Неопределено Тогда
		НастройкаКаталогаКолонкиОтключенные.Добавить(ИмяКолонки);
		УстановитьВидимостьЭлементаФормы(Элементы.Найти("ТаблицаВыбора" + ИмяКолонки), Ложь);
		КартинкаКнопки = БиблиотекаКартинок.СкрытьПароль;
	Иначе
		НастройкаКаталогаКолонкиОтключенные.Удалить(ЗначениеСписка);
		УстановитьВидимостьЭлементаФормы(Элементы["ТаблицаВыбора" + ИмяКолонки], Истина);
		КартинкаКнопки = БиблиотекаКартинок.ПоказатьПароль;
	КонецЕсли;
	
	Элементы[Команда.Имя].Картинка = КартинкаКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКаталогаОткрытьНастройки(Команда)
	Элементы.ГруппаНастройкиКаталогаВсплывающая.Показать();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКаталогаПоУмолчанию(Команда)
	
	ВосстановитьВидимостьПоУмолчанию();
	Элементы.ГруппаНастройкиКаталогаВсплывающая.Скрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКаталогаЗакрыть(Команда)
	Элементы.ГруппаНастройкиКаталогаВсплывающая.Скрыть();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКаталогаПереключитьНастройку(Команда)
	
	НастройкаКаталогаТекущаяНастройкаПолей = НастройкаКаталогаТекущаяНастройкаПолей + 1;
	
	Если НастройкаКаталогаТекущаяНастройкаПолей = 3 Тогда
		НастройкаКаталогаТекущаяНастройкаПолей = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПодготовитьСтруктуруВыбора(ТекущиеДанные = Неопределено)
	
	СтруктураРезультат = СтруктураДанныхПоиска();
	СтруктураРезультат.НеизвестныеДанныеПО = Ложь;
	СтруктураРезультат.ПараметрыШтрихкода = ПараметрыШтрихкода;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Элементы.ТаблицаВыбора.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		СтруктураСтроки = Новый Структура;
		Если ЗначениеЗаполнено(Штрихкод) Тогда
			СтруктураСтроки.Вставить("Штрихкод", Штрихкод);
			СтруктураСтроки.Вставить("МагнитныйКод", "");
			СтруктураСтроки.Вставить("ДанныеПО", Штрихкод);
			СтруктураРезультат.ДанныеПО = Штрихкод;
			СтруктураРезультат.ТипДанныхПО = "Штрихкод";
		Иначе
			СтруктураСтроки.Вставить("Штрихкод", "");
			СтруктураСтроки.Вставить("МагнитныйКод", МагнитныйКод);
			СтруктураСтроки.Вставить("ДанныеПО", МагнитныйКод);
			СтруктураРезультат.ДанныеПО = МагнитныйКод;
			СтруктураРезультат.ТипДанныхПО = "МагнитныйКод";
		КонецЕсли;
		
		СтруктураСтроки.Вставить("ШаблонШтрихкода", ТекущиеДанные.ШаблонШтрихкода);
		СтруктураСтроки.Вставить("ТипОбъекта", ТекущиеДанные.ТипОбъекта);
		
		СтруктураСтроки.Вставить("Владелец", ТекущиеДанные.Владелец);
		СтруктураСтроки.Вставить("Характеристика", ТекущиеДанные.Характеристика);
		СтруктураСтроки.Вставить("Упаковка", ТекущиеДанные.Упаковка);
		СтруктураСтроки.Вставить("СерияНоменклатуры", ТекущиеДанные.СерияНоменклатуры);
		СтруктураСтроки.Вставить("Количество", ТекущиеДанные.Количество);
		
		Если Не ПараметрыШтрихкода = Неопределено Тогда
			ДанныеМаркировки = ПараметрыШтрихкода.ДанныеМаркировки;
		Иначе
			ДанныеМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(Штрихкод);
		КонецЕсли;
		
		Если ТипЗнч(ДанныеМаркировки) = Тип("Структура") Тогда
			Если ДанныеМаркировки.Свойство("Разобран") И ДанныеМаркировки.Разобран Тогда
				СтруктураСтроки.Вставить("ДанныеМаркировки", ДанныеМаркировки);
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ДополнительныйПараметр Из ТекущиеДанные.ДополнительныеДанные Цикл
			СтруктураСтроки.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
		
		СтруктураРезультат.ЗначенияПоиска.Добавить(СтруктураСтроки);
		
		ДополнитьСтруктуруДляРегистрацииНовогоОбъекта(СтруктураРезультат);
		
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции

// Формирует предопределенную структуру,
// Которая используется при поиске по ШК.
//
// Возвращаемое значение:
//  Структура - структура данных поиска.
//
&НаКлиенте
Функция СтруктураДанныхПоиска()
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ЗначенияПоиска", Новый Массив);
	СтруктураПараметров.Вставить("НеизвестныеДанныеПО", Истина);
	СтруктураПараметров.Вставить("ДанныеПО", "");
	СтруктураПараметров.Вставить("ТипДанныхПО", "Штрихкод");
	СтруктураПараметров.Вставить("ПараметрыШтрихкода", Новый Структура);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Процедура ДополнитьСтруктуруДляРегистрацииНовогоОбъекта(СтруктураПараметров)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("РегистрацияНовойКарты");
	НеизвестныеДанныеПО = Ложь;
	
	РаботаСоШтрихкодамиПереопределяемый.СкорректироватьСтруктуруРезультата(
			СтруктураПараметров,
			Штрихкод,
			СтруктураДействий,
			НеизвестныеДанныеПО,
			Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПоказыватьОстатокНоменклатурыПриИзмененииНаСервере()
	
	Элементы.СкладОстатков.Доступность = ПоказыватьОстатокНоменклатуры;
	Элементы.КолонкиОстатка.Видимость = ПоказыватьОстатокНоменклатуры;
	НастройкиВыбора = Новый Структура;
	НастройкиВыбора.Вставить("ПоказыватьОстатокНоменклатуры", ПоказыватьОстатокНоменклатуры);
	НастройкиВыбора.Вставить("СкладОстатков", СкладОстатков);
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиФормыВыбораДанныхПоискаПоШК", "", НастройкиВыбора);
	Если ПоказыватьОстатокНоменклатуры Тогда
		ОбновитьОстаткиНоменклатурыВДереве();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкладОстатковПриИзмененииНаСервере()
	ОбновитьОстаткиНоменклатурыВДереве();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстаткиНоменклатурыВДереве()
	
	ТаблицаОстатков = ТаблицаНоменклатурыДляОстатков.Выгрузить();
	ИсходнаяТаблица = ТаблицаНоменклатурыДляОстатков.Выгрузить();
	РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьОстаткиПоСкладу(ИсходнаяТаблица, СкладОстатков, ТаблицаОстатков);
	ТаблицаНоменклатурыДляОстатков.Загрузить(ТаблицаОстатков);
	ОбновитьОстаткиВСтроках();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстаткиВСтроках(ТекущаяСтрока = Неопределено)
	
	Если ТекущаяСтрока = Неопределено Тогда
		СтрокиДерева = ДеревоВыбора.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = ТекущаяСтрока.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого ПодчиненнаяСтрока Из СтрокиДерева Цикл
		Если ПодчиненнаяСтрока.ОтображатьОстатки Тогда
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура", ПодчиненнаяСтрока.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика", ПодчиненнаяСтрока.Характеристика);
			СтрокиОстатков = ТаблицаНоменклатурыДляОстатков.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаОстатка Из СтрокиОстатков Цикл
				ПодчиненнаяСтрока.Остаток = СтрокаОстатка.Остаток;
				ПодчиненнаяСтрока.Резерв = СтрокаОстатка.Резерв;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		ОбновитьОстаткиВСтроках(ПодчиненнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНоменклатурыДляОстатков(ЗначенияПоиска)
	
	Для Каждого СтрокаВыбора Из ЗначенияПоиска Цикл
		Если СтрокаВыбора.Свойство("ОтображатьОстатки") Тогда
			НоваяСтрокаНоменклатуры = ТаблицаНоменклатурыДляОстатков.Добавить();
			НоваяСтрокаНоменклатуры.Номенклатура = СтрокаВыбора.Номенклатура;
			НоваяСтрокаНоменклатуры.Характеристика = СтрокаВыбора.Характеристика;
			НоваяСтрокаНоменклатуры.Упаковка = СтрокаВыбора.Упаковка;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеСписок = Элемент.Поля.Элементы.Добавить();
	ПолеСписок.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаВыбора.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоВыбора.КартаНедействительна");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПредупреждения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементаФормы(Элемент, Знач Видимость)
	Элемент.Видимость = Видимость;
КонецПроцедуры

#Область НастройкиКаталога

&НаСервере
Процедура СоздатьЭлементыНастроекКаталога()
	
	Если ИспользоватьНастройкиКаталога Тогда
		УстановитьВидимостьЭлементаФормы(Элементы.НастройкаКаталогаОткрытьНастройки, Истина);
	Иначе
		УстановитьВидимостьЭлементаФормы(Элементы.НастройкаКаталогаОткрытьНастройки, Ложь);
		Возврат;
	КонецЕсли;
	
	НастройкаКаталогаИменаПолей.Очистить();
	
	КолонкиСписка = Новый Массив;
	КолонкиСписка.Добавить(Элементы.ТаблицаВыбораТипОбъекта);
	КолонкиСписка.Добавить(Элементы.ТаблицаВыбораШаблонШтрихкода);
	КолонкиСписка.Добавить(Элементы.КолонкиОстатка);
	КолонкиСписка.Добавить(Элементы.ТаблицаВыбораЦена);
	
	Для Каждого КолонкаСписка Из КолонкиСписка Цикл
		Если Не КолонкаСписка.Видимость Тогда
			Продолжить;
		КонецЕсли;
		Если КолонкаСписка.Вид = ВидГруппыФормы.ГруппаКолонок Тогда
			Для Каждого КолонкаГруппы Из КолонкаСписка.ПодчиненныеЭлементы Цикл
				Если КолонкаГруппы.Видимость И ЗначениеЗаполнено(КолонкаГруппы.ПутьКДанным) Тогда
					ДобавитьПолеВНастройкиКаталогаИменаПолей(НастройкаКаталогаИменаПолей,
						ЗаголовкиПолей, КолонкаГруппы);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если ЗначениеЗаполнено(КолонкаСписка.ПутьКДанным) Тогда
				ДобавитьПолеВНастройкиКаталогаИменаПолей(НастройкаКаталогаИменаПолей,
					ЗаголовкиПолей, КолонкаСписка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ИмяРодительскойГруппы = "ГруппаНастройкиКаталогаПоляПоиска";
	ЭлементГруппаПолей = Элементы[ИмяРодительскойГруппы];
	НомПП = 0;
	Для Каждого ИмяПоляКаталога Из НастройкаКаталогаИменаПолей Цикл
		
		ИмяКолонки = НомПП;
		ИмяКоманды = "ПолеКаталогаКнопка_" + ИмяКолонки;
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = "КомандаПолеКаталогаКнопка";
		НоваяКоманда.Заголовок = ИмяКолонки;
		
		КнопкаПолеПоискаКаталога = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементГруппаПолей);
		КнопкаПолеПоискаКаталога.ИмяКоманды = ИмяКоманды;
		КнопкаПолеПоискаКаталога.РастягиватьПоГоризонтали = Истина;
		КнопкаПолеПоискаКаталога.Высота = 2;
		КнопкаПолеПоискаКаталога.Картинка = БиблиотекаКартинок.ПоказатьПароль;
		КнопкаПолеПоискаКаталога.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КнопкаПолеПоискаКаталога.ПоложениеКартинки = ПоложениеКартинкиКнопкиФормы.Лево;
		КнопкаПолеПоискаКаталога.Фигура = ФигураКнопки.Овал;
		
		КнопкаПолеПоискаКаталога.Заголовок = ЗаголовкиПолей.НайтиПоЗначению(ИмяПоляКаталога.Значение).Представление;
		
		НомПП = НомПП + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПолеВНастройкиКаталогаИменаПолей(НастройкаКаталогаИменаПолей, ЗаголовкиПолей, Знач ПолеФормы)
	
	ИмяКолонки = СтрЗаменить(ПолеФормы.ПутьКДанным, "Список.", "");
	НастройкаКаталогаИменаПолей.Добавить(ИмяКолонки);
	Если ЗначениеЗаполнено(ПолеФормы.Заголовок) Тогда
		ЗаголовкиПолей.Добавить(ИмяКолонки, ПолеФормы.Заголовок);
	Иначе
		ЗаголовкиПолей.Добавить(ИмяКолонки, СтрЗаменить(ИмяКолонки, "ДеревоВыбора.", ""));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтображениеКаталогаПриОткрытии()
	
	Если НЕ ИспользоватьНастройкиКаталога Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьПоляКаталогаПриОткрытии();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПоляКаталогаПриОткрытии()
	
	Для Каждого Колонка Из НастройкаКаталогаКолонкиОтключенные Цикл
		
		ИмяКолонки = Колонка.Значение;
		НомПП = 0;
		Для Каждого ИмяПоля Из НастройкаКаталогаИменаПолей Цикл
			Если ИмяПоля.Значение = "ДеревоВыбора." + ИмяКолонки Тогда
				УстановитьВидимостьЭлементаФормы(Элементы.Найти("ТаблицаВыбора" + ИмяКолонки), Ложь);
				КартинкаКнопки = БиблиотекаКартинок.СкрытьПароль;
				Элементы["ПолеКаталогаКнопка_" + НомПП].Картинка = КартинкаКнопки;
				Прервать;
			КонецЕсли;
			НомПП = НомПП + 1;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьВидимостьПоУмолчанию()
	
	НомПП = 0;
	Для Каждого ИмяПоля Из НастройкаКаталогаИменаПолей Цикл
		ИмяКолонки = СтрЗаменить(ИмяПоля.Значение, "ДеревоВыбора.", "");
		УстановитьВидимостьЭлементаФормы(Элементы.Найти("ТаблицаВыбора" + ИмяКолонки), Истина);
		КартинкаКнопки = БиблиотекаКартинок.ПоказатьПароль;
		Элементы["ПолеКаталогаКнопка_" + НомПП].Картинка = КартинкаКнопки;
		НомПП = НомПП + 1;
	КонецЦикла;
	
	НастройкаКаталогаКолонкиОтключенные.Очистить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

