
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.СдвигДат = Параметры.СдвигДат;
	Объект.СдвигДатПериодичность = Параметры.СдвигДатПериодичность;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("СдвигДат", Объект.СдвигДат);
	ПараметрыЗакрытия.Вставить("СдвигДатПериодичность", Объект.СдвигДатПериодичность);
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти



