#Область ПрограммныйИнтерфейс

// В процедуре нужно показать диалоговое окно для ввода штрихкода и передать полученные данные в описание оповещения.
//
// Параметры:
//  Оповещение - ОписаниеОповещения - процедура, которую нужно вызвать после ввода штрихкода.
//  СтандартнаяОбработка - Булево - признак дальнейшей стандартной обработки события.
Процедура ПоказатьВводШтрихкода(Оповещение, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияМОТПУНФКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

// В процедуре необходимо реализовать алгоритм обработки после получения данных по штрихкодам и попытки обработать эти данные.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой были обработаны штрихкоды,
//  ОбработанныеДанные - Структура - подготовленные ранее данные штрихкодов,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
Процедура ПослеОбработкиШтрихкодов(Форма, ОбработанныеДанные, КэшированныеЗначения) Экспорт
	
	ИнтеграцияМОТПУНФКлиент.ПослеОбработкиШтрихкодов(Форма, ОбработанныеДанные, КэшированныеЗначения);
	
КонецПроцедуры

// В процедуре необходимо реализовать открытие формы, в которой будет возможность сопоставить неизвестные штрихкоды с номенклатурой.
//
// Параметры:
//  НеизвестныеШтрихкоды - Массив - Штрихкоды для сопоставления.
//  ФормаВладелец - ФормаКлиентскогоПриложения - Форма владелец.
//  ОповещениеОЗакрытии - ОписаниеОповещения - Оповещение, которое должно быть вызвано после сопоставления номенклатуры.
Процедура ОткрытьФормуПодбораНоменклатурыПоШтрихкодам(НеизвестныеШтрихкоды, ФормаВладелец = Неопределено, ОповещениеОЗакрытии = Неопределено) Экспорт
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	Если ПараметрыРаботыКлиента.Свойство("ЕстьПрофильРМК") И ПараметрыРаботыКлиента.ЕстьПрофильРМК Тогда
		
		ИнтеграцияИСУНФКлиент.ОповеститьОНенайденныхШтрихкодах(НеизвестныеШтрихкоды, Истина);
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаВладелец, "КэшМаркируемойПродукции") 
			И ЭтоАдресВременногоХранилища(ФормаВладелец.КэшМаркируемойПродукции) Тогда
		  
		  	Кэш = ПолучитьИзВременногоХранилища(ФормаВладелец.КэшМаркируемойПродукции); 
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Кэш, "ОтложенныеКодыМаркировки") Тогда
				Кэш.ОтложенныеКодыМаркировки.Очистить();
				ПоместитьВоВременноеХранилище(Кэш, ФормаВладелец.КэшМаркируемойПродукции);
			КонецЕсли;
			
		КонецЕсли;
			
		Возврат;
		
	КонецЕсли;
	
	СтруктураПараметров  = Новый Структура;
	СтруктураПараметров.Вставить("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды);
	СтруктураПараметров.Вставить("ВызовГосИС", Истина);
	
	ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры", 
		СтруктураПараметров, ФормаВладелец, Новый УникальныйИдентификатор, , , ОповещениеОЗакрытии);
	
КонецПроцедуры

// В процедуре необходимо реализовать очистку коллекции штрихкодов, которые находятся в структуре кэшированные значения.
//
// Параметры:
//  ДанныеШтрихкодов - Соответствие - Данные штрихкодов.
//  КэшированныеЗначения - Структура - Содержит поля кэшируемых значений.
Процедура ОчиститьКэшированныеШтрихкоды(ДанныеШтрихкодов, КэшированныеЗначения) Экспорт
	
	ИнтеграцияМОТПУНФКлиент.ОчиститьКэшированныеШтрихкоды(ДанныеШтрихкодов, КэшированныеЗначения);
	
КонецПроцедуры

// В данной процедуре нужно переопределить параметры записи журнала регистрации при отказе ввода кода маркировки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, для которой происходит обработка штрихкода.
//  СтруктураСообщения - Структура:
//   * ИмяСобытия - Строка - Имя события журнала регистрации.
//   * Уровень - Строка - Уровень журнала регистрации. Возможные уровни: "Информация", "Ошибка", "Предупреждение",
//        "Примечание".
//   * Данные - Произвольный - Данные журнала регистрации.
//   * СсылкаНаОбъект - ЛюбаяСсылка - Ссылка на объект, на основании которого будут полученные метаданные для записи
//        в журнал регистрации.
//   * КодМаркировки - Строка - Введенный код маркировки. Если значение кода не заполнено - ввод кода маркировки отменен
//        по инициативе пользователя.
Процедура ПриОпределенииИнформацииОбОтказеВводаКодаМаркиДляЖурналаРегистрации(Форма, СтруктураСообщения) Экспорт
	
	Возврат;

КонецПроцедуры

// Для РМК. При уточнении данных после сканирования штрихкода.
//  
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ОповещениеПриЗавершении - ОписаниеОповещения
Процедура ПриУточненииДанныхПослеСканированияШтрихкода(Форма, ОповещениеПриЗавершении) Экспорт
	
	ПоказатьПредупреждение(, НСтр("ru = 'Требуется уточнение данных. Обратитесь к администратору.'"));
	
КонецПроцедуры

#КонецОбласти
