#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура Мигрировать(ПараметрыОбработчика) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	НастройкиРассылкиСостояниеКомпанииНастройкиФильтров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиРассылкиСостояниеКомпании.НастройкиФильтров КАК
	|		НастройкиРассылкиСостояниеКомпанииНастройкиФильтров
	|ГДЕ
	|	НастройкиРассылкиСостояниеКомпанииНастройкиФильтров.Значение <> НастройкиРассылкиСостояниеКомпанииНастройкиФильтров.УдалитьЗначение
	|	И НастройкиРассылкиСостояниеКомпанииНастройкиФильтров.УдалитьЗначение <> НЕОПРЕДЕЛЕНО";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;

	МетаданныеНастройкиРассылкиСостояниеКомпании = Метаданные.Справочники.НастройкиРассылкиСостояниеКомпании;
	МетаданныеПолноеИмя = МетаданныеНастройкиРассылкиСостояниеКомпании.ПолноеИмя();
	ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	ПроблемныхОбъектов = 0;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		НачатьТранзакцию();

		Попытка

			ПричинаИсключения = "Блокировка";

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(МетаданныеПолноеИмя);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();

			НастройкаРассылки = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого НастройкаФильтра Из НастройкаРассылки.НастройкиФильтров Цикл
				ТипПоля = ТипЗнч(НастройкаФильтра.УдалитьЗначение);
				Если Не ОбщегоНазначения.ЭтоСсылка(ТипПоля) Тогда
					Продолжить;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(НастройкаФильтра.УдалитьЗначение) Тогда
					Продолжить;
				КонецЕсли;
				Если НастройкаФильтра.Значение = НастройкаФильтра.УдалитьЗначение Тогда
					Продолжить;
				КонецЕсли;
				НастройкаФильтра.Значение = НастройкаФильтра.УдалитьЗначение;
			КонецЦикла;

			ПричинаИсключения = "Запись";
			Если НастройкаРассылки.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НастройкаРассылки);
			КонецЕсли;

			ЗафиксироватьТранзакцию();

		Исключение

			ОтменитьТранзакцию();

			ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось обработать настройку рассылки по причине:
				 |%1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение, МетаданныеНастройкиРассылкиСостояниеКомпании,
				Выборка.Ссылка, ТекстСообщения);

			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;

			Если ПричинаИсключения <> "Блокировка" Тогда
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;

		КонецПопытки;

	КонецЦикла;

	Если ПроблемныхОбъектов = 0 Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли