#Область ПрограммныйИнтерфейс

// Распознать.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьРаспознавание(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать РаспознатьАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Подтвердить распознавание.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьПодтверждениеРаспознавания(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ПодтвердитьРаспознаваниеАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Распознать.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - см. ОборудованиеУстройствоРаспознаванияКлиентСервер.ПараметрыОперацииРаспознать
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура:
//    * Результат - Булево
//    * ОписаниеОшибки - Строка
//    * ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование
//    * РаспознанныеТовары - Массив из Структура :
//       ** Код - Строка - Код товара при распознавании
//       ** Вероятность - Число -
//
Асинх Функция РаспознатьАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "Recognize";
	Контекст = ОборудованиеУстройствоРаспознаванияКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ОбработатьДанныеСервер = Истина;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		Устройство = Ждать ВыбратьУстройствоАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Подтвердить распознавание.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - см. ОборудованиеУстройствоРаспознаванияКлиентСервер.ПараметрыОперацииПодтвердить.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура:
//    * Результат - Булево
//    * ОписаниеОшибки - Строка
//    * ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование
//
Асинх Функция ПодтвердитьРаспознаваниеАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "ConfirmRecognize";
	Контекст = ОборудованиеУстройствоРаспознаванияКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Не ЗначениеЗаполнено(Устройство) Тогда
		Устройство = Ждать ВыбратьУстройствоАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела: Начать выгрузку данных в весы с печатью этикеток.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Процедура НачатьВыгрузкуТоваровВУстройствоРаспознавания(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	Контекст.Вставить("ИдентификаторКлиента"   , ИдентификаторКлиента);   
	Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	Контекст.Вставить("ПараметрыОперации"      , ПараметрыОперации);
	Контекст.Вставить("ДополнительныеПараметры", ДополнительныеПараметры); 
	Контекст.Вставить("ПодготовитьДанные"      , Истина); 
	Контекст.Вставить("ОбработатьДанные"       , Ложь); 
	Контекст.Вставить("Команда"  , "UploadGoods"); 
	Контекст.Вставить("Результат", Истина);
	
	Если ИдентификаторУстройства = Неопределено Или ПустаяСтрока(ИдентификаторУстройства) Тогда
		НачатьВыборУстройства(Контекст);
	Иначе
		НачатьВыполнениеКоманды(ИдентификаторУстройства, Контекст);
	КонецЕсли

КонецПроцедуры

// Устарела: Начать очистку данных в весах с печатью этикеток.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Процедура НачатьОчисткуТоваровВРаспознавателе(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства = Неопределено, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	Контекст.Вставить("ИдентификаторКлиента"   , ИдентификаторКлиента);   
	Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	Контекст.Вставить("ПараметрыОперации"      , ПараметрыОперации);
	Контекст.Вставить("ДополнительныеПараметры", ДополнительныеПараметры); 
	Контекст.Вставить("ПодготовитьДанные"      , Ложь); 
	Контекст.Вставить("ОбработатьДанные"       , Ложь); 
	Контекст.Вставить("Команда"  , "ClearBase"); 
	Контекст.Вставить("Результат", Истина);
	
	Если ИдентификаторУстройства = Неопределено Или ПустаяСтрока(ИдентификаторУстройства) Тогда
		НачатьВыборУстройства(Контекст);
	Иначе
		НачатьВыполнениеКоманды(ИдентификаторУстройства, Контекст);
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти  

#КонецОбласти  

#Область СлужебныйПрограммныйИнтерфейс

Асинх Функция ВыбратьУстройствоАсинх() Экспорт
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.УстройствоРаспознавания = Истина;
	РезультатВыбора = Ждать МенеджерОборудованияКлиент.ВыбратьУстройствоАсинх(
		ПоддерживаемыеТипы,
		НСтр("ru='Выберите устройство распознавания.'"),
		НСтр("ru='Устройства распознавания не подключены.'"), 
		НСтр("ru='Устройства распознавания не выбраны.'"));
		
	Если Не РезультатВыбора.Результат Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатВыбора.ИдентификаторУстройства;
	
КонецФункции

Асинх Функция ПриПодготовкеДанныхОперацииАсинх(ДанныеОперации, ПараметрыПодключения, Команда, ПараметрыОперации) Экспорт
	
КонецФункции

Асинх Функция ПриОбработкеРезультатовОперацииАсинх(ДанныеОперации, ПараметрыПодключения, Команда, РезультатОперации) Экспорт
	
КонецФункции

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции


Процедура НачатьВыполнениеКоманды(ИдентификаторУстройства, Контекст)
	
	ПараметрыКоманды = МенеджерОборудованияКлиентСервер.ПараметрыВыполнениеКоманды(
		Контекст.Команда,
		"ОборудованиеУстройствоРаспознавания", 
		Контекст.ДополнительныеПараметры, 
		Контекст.ПодготовитьДанные, 
		Контекст.ОбработатьДанные);
	МенеджерОборудованияКлиент.НачатьВыполнениеКоманды(
		Контекст.ОповещениеПриЗавершении, 
		Контекст.ИдентификаторКлиента, 
		ИдентификаторУстройства, 
		Контекст.ПараметрыОперации, 
		ПараметрыКоманды);
		
КонецПроцедуры

// Начать выгрузку данных в весы с печатью этикеток.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Процедура НачатьВыборУстройства(Контекст)
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.УстройствоРаспознавания = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
	МенеджерОборудованияКлиент.ВыбратьУстройство(Оповещение, ПоддерживаемыеТипы,
		НСтр("ru='Выберите устройство распознавания.'"),
		НСтр("ru='Устройства распознавания не подключены.'"), 
		НСтр("ru='Устройства распознавания не выбраны.'"));

КонецПроцедуры

Процедура ВыбратьУстройствоЗавершение(РезультатВыбора, Контекст) Экспорт
	
	Если РезультатВыбора.Результат Тогда 
		НачатьВыполнениеКоманды(РезультатВыбора.ИдентификаторУстройства, Контекст);
	Иначе
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеПриЗавершении, РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  
