
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("КатегорияНоменклатуры") Тогда
		КатегорияНоменклатуры = Параметры.Отбор.КатегорияНоменклатуры;
		
		Если Не Параметры.Отбор.Свойство("Владелец") Тогда
			Параметры.Отбор.Вставить("Владелец", КатегорияНоменклатуры);
		КонецЕсли;
		
	ИначеЕсли Параметры.Отбор.Свойство("Владелец") Тогда
		КатегорияНоменклатуры = Параметры.Отбор.Владелец;
	Иначе
		КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ВидНаименования") Тогда
		ВидНаименования = Параметры.Отбор.ВидНаименования;
	КонецЕсли;
	
	АдаптацияФормыТакси();
	
	УправлениеВидимостьюФормы(ВидНаименования);
	ПриИзмененииКатегорииНоменклатуры();
	
	Если Не ЗначениеЗаполнено(КатегорияНоменклатуры) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НастройкаПорядкаЭлементов", "Видимость", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура СоздатьШаблонДляНоменклатуры(Команда)
	
	СтруктураПараметров = Новый Структура("ДляХарактеристики,КатегорияНоменклатуры", Ложь, КатегорияНоменклатуры);
	ОткрытьФорму("Справочник.ШаблоныНаименований.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблонДляХарактеристики(Команда)
	
	СтруктураПараметров = Новый Структура("ДляХарактеристики,КатегорияНоменклатуры", Истина, КатегорияНоменклатуры);
	ОткрытьФорму("Справочник.ШаблоныНаименований.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблон(Команда)
	
	СтруктураПараметров = Новый Структура("ДляХарактеристики,ВидНаименования,КатегорияНоменклатуры", ДляХарактеристики, ВидНаименования, КатегорияНоменклатуры);
	ОткрытьФорму("Справочник.ШаблоныНаименований.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКакОсновной(Команда)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		Или Элементы.Список.ТекущиеДанные = Неопределено
		Или Элементы.Список.ТекущиеДанные.ЭтоОсновнойШаблон Тогда
		
		Возврат;
	КонецЕсли;
	
	
	ЗаписатьОсновнойШаблонДоговоров(Элементы.Список.ТекущиеДанные.Ссылка);
	
	Оповестить("Запись_ШаблоныНаименований");
	ОбновитьПовторноИспользуемыеЗначения();
	
	// Обновим динамический список
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьОсновнойШаблонДоговоров(Шаблон)
	УстановитьПривилегированныйРежим(Истина);
	Константы.ШаблонНаименованияДоговоров.Установить(Шаблон);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КатегорияНоменклатурыПриИзменении(Элемент)
	
	ПриИзмененииКатегорииНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Интерфейс8_5 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	ОтображатьКоманднуюПанель = Интерфейс8_5;
	
	Элементы.Список.КоманднаяПанель.Видимость = Не Интерфейс8_5;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИзменитьФорму", "Видимость", Не Интерфейс8_5);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Справка", "Видимость", Не Интерфейс8_5);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКоманднаяПанель", "Видимость", Не Интерфейс8_5);
	
	Элементы.СоздатьШаблон.Видимость = Не Интерфейс8_5;
	Элементы.ГруппаСоздать.Видимость = Не Интерфейс8_5;
	
	Если Интерфейс8_5 Тогда
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
		Если ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ДоговорКонтрагента Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НастройкаПорядкаЭлементовОбычное_Элемент_Список_Вверх", "Видимость", Не Интерфейс8_5);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НастройкаПорядкаЭлементовОбычное_Элемент_Список_Вниз", "Видимость", Не Интерфейс8_5);
		КонецЕсли;
		
		
	Иначе
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
		ПараметрыРазмещения.КоманднаяПанель = Элементы.Список.КоманднаяПанель;
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКатегорииНоменклатуры()
	
	Если ЗначениеЗаполнено(КатегорияНоменклатуры) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "КатегорияНоменклатуры", КатегорияНоменклатуры);
		
		Элементы.СписокКатегорияНоменклатуры.Видимость = Ложь;
		Элементы.СоздатьШаблон.Доступность = Истина;
		Элементы.ГруппаСоздать.Доступность = Истина;
		
		Элементы.СоздатьШаблон85.Доступность = Истина;
		Элементы.ГруппаСоздать85.Доступность = Истина;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Список, "КатегорияНоменклатуры");
		
		Если ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ДоговорКонтрагента Тогда
			Элементы.СписокКатегорияНоменклатуры.Видимость  = Ложь;
			Элементы.ДляХарактеристикиПредставление.Видимость  = Ложь;
			Элементы.КатегорияНоменклатуры.Видимость		   = Ложь;
			Элементы.СоздатьШаблон.Доступность = Истина;
			Элементы.ГруппаСоздать.Доступность = Ложь;
			
			Элементы.СоздатьШаблон85.Доступность = Истина;
			Элементы.ГруппаСоздать85.Доступность = Ложь;
			
		Иначе
			Элементы.СписокКатегорияНоменклатуры.Видимость = Истина;
			Элементы.СоздатьШаблон.Доступность = Ложь;
			Элементы.ГруппаСоздать.Доступность = Ложь;
			
			Элементы.СоздатьШаблон85.Доступность = Ложь;
			Элементы.ГруппаСоздать85.Доступность = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюФормы(ВидНаименования)
	
	ГруппаКоманд = Элементы.Найти("НастройкаПорядкаЭлементов");
	Элементы.ЭтоОсновнойШаблон.Видимость = Ложь;
	Элементы.ИспользоватьКакОсновной.Видимость = Ложь;
	Элементы.ИспользоватьКакОсновной85.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(КатегорияНоменклатуры) Тогда
		Если ГруппаКоманд <> Неопределено Тогда
			ГруппаКоманд.Видимость = Истина;
		КонецЕсли;
		Элементы.КатегорияНоменклатуры.Видимость = Ложь;
	Иначе
		Если ГруппаКоманд <> Неопределено Тогда
			ГруппаКоманд.Видимость = Ложь;
		КонецЕсли;
		Элементы.КатегорияНоменклатуры.Видимость = Истина;
	КонецЕсли;
	
	Если ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ДоговорКонтрагента Тогда
		Элементы.ЭтоОсновнойШаблон.Видимость = Истина;
		Элементы.ИспользоватьКакОсновной.Видимость = Истина;
		Элементы.ИспользоватьКакОсновной85.Видимость = Истина;
		Элементы.ГруппаСоздать.Видимость = Ложь;
		Элементы.ДляХарактеристикиПредставление.Видимость = Ложь;
	ИначеЕсли ВидНаименования = Неопределено
		ИЛИ НЕ ЗначениеЗаполнено(КатегорияНоменклатуры) Тогда
		
		Если ЗначениеЗаполнено(КатегорияНоменклатуры) Тогда
			ЕстьХарактеристики = КатегорияНоменклатуры.ИспользоватьХарактеристики;
		Иначе
			ЕстьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
		КонецЕсли;
		
		Если ЕстьХарактеристики Тогда
			Элементы.СоздатьШаблон.Видимость = Ложь;
			Элементы.ГруппаСоздать.Видимость = Истина;
			Элементы.ДляХарактеристикиПредставление.Видимость = Истина;
		Иначе
			Элементы.СоздатьШаблон.Видимость = Истина;
			Элементы.ГруппаСоздать.Видимость = Ложь;
			Элементы.ДляХарактеристикиПредставление.Видимость = Ложь;
		КонецЕсли;
		
		Если ЕстьХарактеристики Тогда
			Возврат;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДляХарактеристики", Ложь);
		
	ИначеЕсли ВидНаименования = Перечисления.ВидыНаименованийОбъектов.НоменклатураРабочее
		ИЛИ ВидНаименования = Перечисления.ВидыНаименованийОбъектов.НоменклатураДляПечати Тогда
		
		ДляХарактеристики = Ложь;
		
		Элементы.СоздатьШаблон.Видимость = Истина;
		Элементы.ГруппаСоздать.Видимость = Ложь;
		Элементы.ДляХарактеристикиПредставление.Видимость = Ложь;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДляХарактеристики",
			ДляХарактеристики);
		
	ИначеЕсли ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаРабочее
		ИЛИ ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаДляПечати Тогда
		
		ДляХарактеристики = Истина;
		
		Элементы.СоздатьШаблон.Видимость = Истина;
		Элементы.ГруппаСоздать.Видимость = Ложь;
		Элементы.ДляХарактеристикиПредставление.Видимость = Ложь;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДляХарактеристики",
			ДляХарактеристики);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
