#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Заголовок <> "" Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Информация = Параметры.ВходящаяИнформация;
	
	Элементы.ДекорацияНадпись.Заголовок = Информация;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкопироватьВБуферОбмена(Команда)
	
	ЭлементБуфера = Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, Информация);
	
	СредстваБуфераОбмена.ПоместитьДанныеАсинх(ЭлементБуфера);
	
КонецПроцедуры

#КонецОбласти
