
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.КадровыеДокументыУпрУчет <> Неопределено Тогда
		ДанныеЗаполнения = Обработки.ФормированиеКадровыхДокументовРеглУчет.ДанныеДляЗаполненияПоУпрУчету(
			Параметры.КадровыеДокументыУпрУчет);
	    Если НЕ ДанныеЗаполнения.Отказ Тогда
			Для Каждого ДанныеСотрудника Из ДанныеЗаполнения.Данные Цикл
				ВыбранныеСтрокиИд.Добавить(ДанныеСотрудника.ИдСтроки);
				Элементы.СписокДокументовКадровогоУчетаУпр.ВыделенныеСтроки.Добавить(ДанныеСотрудника.ИдСтроки);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	СписокДокументовКадровогоУчетаУпр.Параметры.УстановитьЗначениеПараметра("ВыбранныеСтроки", ВыбранныеСтрокиИд);

	УстановитьУсловноеОформление();
	АдаптацияТакси();
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ГруппаИнформацияМК.Видимость = Истина;
		Элементы.ДекорацияТекст.Шрифт = ШрифтыСтиля.ТекстТретьегоУровня;
		Элементы.ДекорацияИнформация.Шрифт = ШрифтыСтиля.ТекстТретьегоУровня;
	Иначе
		ИнициализироватьТекстПодсказок();
	КонецЕсли;
	
	ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(ОтборПериод);
	
	Элементы.ОтборТипДокумента.СписокВыбора.Добавить(Метаданные.Документы.ПриемНаРаботуУНФ.Имя,
		НСтр("ru = 'Прием на работу'"));
	Элементы.ОтборТипДокумента.СписокВыбора.Добавить(Метаданные.Документы.КадровоеПеремещениеУНФ.Имя,
		НСтр("ru = 'Кадровый перевод'"));
	Элементы.ОтборТипДокумента.СписокВыбора.Добавить(Метаданные.Документы.УвольнениеУНФ.Имя,
		НСтр("ru = 'Увольнение'"));
	
	// УНФ.ОтборыСписка
	ИменаНетиповыхОтборов = "ОтборПоказыватьСДокументамиРеглУчета";
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокДокументовКадровогоУчетаУпр);
	// Конец УНФ.ОтборыСписка
	
	ОбновитьСписокСозданныхДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьОтборПоНаличиюДокументовРеглУчета();
	Если ВыбранныеСтрокиИд.Количество() > 0 Тогда
		ПодключитьОбработчикОжидания("НачатьСозданиеДокументовРеглУчета", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "СписокДокументовКадровогоУчетаУпр",
		"ДокументУпрУчет.Дата");
КонецПроцедуры

#Область ОбработчикиОтборов

&НаКлиенте
Процедура ПредставлениеПериодаТаксиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "СписокДокументовКадровогоУчетаУпр",
		"ДокументУпрУчет.Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением,
	СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением,
	СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Подразделение", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ОтборСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением,
	СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Сотрудник", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением,
	СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеОтбора = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение).Представление;
	ЗначениеТип = ?(ЗначениеЗаполнено(ВыбранноеЗначение), ВыбранноеЗначение, "");

	УстановитьМеткуИОтборСписка("ТипДокумента", Элемент.Родитель.Имя, ЗначениеТип, ПредставлениеОтбора);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоказыватьСДокументамиРеглУчетаПриИзменении(Элемент)
	УстановитьОтборПоНаличиюДокументовРеглУчета();
	РаботаСОтборамиКлиентСервер.ОбновитьКоличествоФильтров(ЭтотОбъект);
	РаботаСОтборамиКлиентСервер.УстановитьОтображениеКомандыСброситьВсеОтборы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументовКадровогоУчетаУпр

&НаКлиенте
Процедура СписокДокументовКадровогоУчетаУпрВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Выбран = ВыбранныеСтрокиИд.НайтиПоЗначению(ВыбраннаяСтрока);
	Если Выбран = Неопределено Тогда
		ВыбранныеСтрокиИд.Добавить(ВыбраннаяСтрока);
	Иначе
		ВыбранныеСтрокиИд.Удалить(Выбран);
	КонецЕсли;
	
	СписокДокументовКадровогоУчетаУпр.Параметры.УстановитьЗначениеПараметра("ВыбранныеСтроки", ВыбранныеСтрокиИд);
	Элементы.СписокДокументовКадровогоУчетаУпр.Обновить();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если НЕ ЭтоИнтерфейсТакси Тогда
		ВыбранныеСтрокиИд.Очистить();
		Для Каждого Строка Из Элементы.СписокДокументовКадровогоУчетаУпр.ПолучитьСтрокиДляОбработки() Цикл
			ВыбранныеСтрокиИд.Добавить(Строка);
		КонецЦикла;
	КонецЕсли;
	
	Если ВыбранныеСтрокиИд.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Выберите документы упр. учета'"));
		Возврат;
	КонецЕсли;
	
	НачатьСозданиеДокументовРеглУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	ТекущиеДанные = Элементы.СписокДокументовКадровогоУчетаУпр.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ДокументУпрУчет) Тогда
		ПоказатьЗначение( , ТекущиеДанные.ДокументУпрУчет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписок(Команда)
	СписокСозданныхДокументов.Очистить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СозданныеДокументы,
		"Ссылка", СписокСозданныхДокументов, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	
	ИмяРеквизитаСписка = "СписокДокументовКадровогоУчетаУпр";
	ИмяТЧДанныеМеток = "ДанныеМеток";
	ИмяТЧДанныеОтборов = "ДанныеОтборов";
	ИмяГруппыОтборов = "ГруппаОтборы";
	ИмяПредопределенныеОтборыПоУмолчанию = "ПредопределенныеОтборыПоУмолчанию";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизитаСписка", ИмяРеквизитаСписка);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеОтборов", ИмяТЧДанныеОтборов);
	ДополнительныеПараметры.Вставить("ИмяГруппыОтборов", ИмяГруппыОтборов);
	ДополнительныеПараметры.Вставить("ИмяПредопределенныеОтборыПоУмолчанию", ИмяПредопределенныеОтборыПоУмолчанию);
	
	РаботаСОтборамиКлиент.НастроитьОтборыНажатие(ЭтотОбъект, ПараметрыОткрытияФормыСНастройкамиОтборов(
		ДополнительныеПараметры), ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеОтборы(Команда)
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "СписокДокументовКадровогоУчетаУпр", "Дата");
	
	ОтборПоказыватьСДокументамиРеглУчета = Ложь;
	ОбновитьРеквизитыОтбораПоНаличиюДокументовРеглУчета();
	
	СброситьВсеМеткиОтбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоИнтерфейсТакси = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИндексФильтрыТакси",
		"Видимость", ЭтоИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеПериодаТакси",
		"Видимость", ЭтоИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеПериода",
		"Видимость", НЕ ЭтоИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИндексФильтры",
		"Видимость", НЕ ЭтоИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтрокаВыбрана",
		"Видимость", ЭтоИнтерфейсТакси);
	
	Элементы.СписокДокументовКадровогоУчетаУпр.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
	
	ОтображатьКоманднуюПанель = Ложь;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаИзменитьФорму",
		"Видимость", ЭтоИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправка",
		"Видимость", ЭтоИнтерфейсТакси);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТекстПодсказок()
	
	ПараметрыИнформации = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыИнформации.ТипСообщения = "Информация";
	ПараметрыИнформации.Скрываемый = Ложь;
	ПараметрыИнформации.Идентификатор = "Информация_Создание";
	ПараметрыИнформации.КраткоеПредставление = НСтр("ru = 'Выберите документы'");
	ПараметрыИнформации.Сообщение = НСтр(
		"ru = 'Установите отметки рядом с документами упр. учета и нажмите на ""Создать документы рег. учета""'");

	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыИнформации);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере()
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, СписокДокументовКадровогоУчетаУпр);
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры)
	
	Возврат РаботаСОтборами.ПараметрыДляОткрытияФормыСНастройкамиОтборов(ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение,
	ПредставлениеЗначения = "")
	
	Если ПредставлениеЗначения = "" Тогда
		ПредставлениеЗначения = Строка(ВыбранноеЗначение);
	КонецЕсли;
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение,
		ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, СписокДокументовКадровогоУчетаУпр, ИмяПоляОтбораСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРеквизитыОтбораПоНаличиюДокументовРеглУчета()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДокументовКадровогоУчетаУпр,
		"ДокументРеглУчет", , ВидСравненияКомпоновкиДанных.НеЗаполнено, , НЕ ОтборПоказыватьСДокументамиРеглУчета);
	КоличествоДопФильтров = ?(ОтборПоказыватьСДокументамиРеглУчета, 1, 0);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоНаличиюДокументовРеглУчета()
	
	ОбновитьРеквизитыОтбораПоНаличиюДокументовРеглУчета();
	РаботаСОтборамиКлиентСервер.ОбновитьКоличествоФильтров(ЭтотОбъект);
	РаботаСОтборамиКлиентСервер.УстановитьОтображениеКомандыСброситьВсеОтборы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтборовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтборовЗавершениеНаСервере(Результат.АдресВыбранныеОтборы, Результат.АдресУдаленныеОтборы,
		ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаОтборовЗавершениеНаСервере(АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры)
	
	РаботаСОтборами.НастройкаОтборовЗавершение(ЭтотОбъект, АдресВыбранныеОтборы, АдресУдаленныеОтборы,
		ДополнительныеПараметры);
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(Знач МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, СписокДокументовКадровогоУчетаУпр, МеткаИД);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтборПриИзменении(Элемент)
	
	Подключаемый_ОтборПриИзмененииНаСервере(Элемент.Имя, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборПриИзмененииНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборПриИзменении(ЭтотОбъект, ЭлементИмя, ЭлементРодительИмя);
	
КонецПроцедуры

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ОтборОчистка(Элемент)
	
	Подключаемый_ОтборОчисткаНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборОчисткаНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборОчистка(ЭтотОбъект, ЭлементИмя);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();
	
	ОформлениеУжеСоздан = СписокДокументовКадровогоУчетаУпр.УсловноеОформление.Элементы.Добавить();
	ОформлениеУжеСоздан.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.ТекстВторостепеннойНадписиУНФ);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ОформлениеУжеСоздан.Отбор, "ДокументРеглУчет", Неопределено,
		ВидСравненияКомпоновкиДанных.Заполнено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыбраныРеквизитыДокументов(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьДокументыРеглУчета(Результат);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоОтмеченнымСтрокам()
	
	СписокВсехДокументов = Элементы.СписокДокументовКадровогоУчетаУпр;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДокументовКадровогоУчетаУпр,
		"СтрокаИд", ВыбранныеСтрокиИд, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	
	СхемаКомпоновки = СписокВсехДокументов.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКомпоновки = СписокВсехДокументов.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокДокументовКадровогоУчетаУпр,
		"СтрокаИд");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновки, , ,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ДанныеСписка = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеСписка);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ДанныеЗаполнения = Обработки.ФормированиеКадровыхДокументовРеглУчет.ДанныеДляЗаполненияПоУпрУчету(
		ДанныеСписка.ВыгрузитьКолонку("ДокументУпрУчет"));
	
	Если ДанныеЗаполнения.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыСотрудников.Очистить();
	ОтборСтрок = Новый Структура("ДокументУпрУчет, Сотрудник");
	Для Каждого ДанныеСотрудника Из ДанныеЗаполнения.Данные Цикл
		ЗаполнитьЗначенияСвойств(ОтборСтрок, ДанныеСотрудника);
		СтрокиДокумента = ДанныеСписка.НайтиСтроки(ОтборСтрок);
		Если СтрокиДокумента.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДокументыСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСотрудника);
		НоваяСтрока.ДанныеДокумента = ДанныеСотрудника;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСозданиеДокументовРеглУчета()
	
	Если ВыбранныеСтрокиИд.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеПоОтмеченнымСтрокам();
	
	ПараметрыВыбораПользователем = Новый Структура;
	ПараметрыВыбораПользователем.Вставить("СписокПодразделений", Новый СписокЗначений);
	ПараметрыВыбораПользователем.Вставить("СписокДолжностей", Новый СписокЗначений);
	ПараметрыВыбораПользователем.Вставить("СписокНачислений", Новый СписокЗначений);
	ПараметрыВыбораПользователем.Вставить("ТипыДокументов", Новый СписокЗначений);
	
	ЕстьДокументыДляОбработки = Ложь;
	Для Каждого Строка Из ДокументыСотрудников Цикл
		Если ЗначениеЗаполнено(Строка.ДокументРеглУчет) Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьДокументыДляОбработки = Истина;
		Если Строка.ДанныеДокумента.ИмяДокументаРеглУчет = "ПриемНаРаботу"
			ИЛИ Строка.ДанныеДокумента.ИмяДокументаРеглУчет = "КадровыйПеревод" Тогда
			
			Если НЕ ЗначениеЗаполнено(Строка.ДанныеДокумента.Подразделение) Тогда
				ДобавитьУникальныйЭлементВСписок(ПараметрыВыбораПользователем.ТипыДокументов,
					Строка.ДанныеДокумента.ИмяДокументаРеглУчет);
				ДобавитьУникальныйЭлементВСписок(ПараметрыВыбораПользователем.СписокПодразделений,
					Строка.ДанныеДокумента.ПодразделениеУпр);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строка.ДанныеДокумента.ТрудоваяФункция) Тогда
				ДобавитьУникальныйЭлементВСписок(ПараметрыВыбораПользователем.ТипыДокументов,
					Строка.ДанныеДокумента.ИмяДокументаРеглУчет);
				ДобавитьУникальныйЭлементВСписок(ПараметрыВыбораПользователем.СписокДолжностей,
					Строка.ДанныеДокумента.Должность);
			КонецЕсли;
			
			Для Каждого СтрНачисление Из Строка.ДанныеДокумента.Начисления Цикл
				Если НЕ ЗначениеЗаполнено(СтрНачисление.Начисление) Тогда
				ДобавитьУникальныйЭлементВСписок(ПараметрыВыбораПользователем.ТипыДокументов,
					Строка.ДанныеДокумента.ИмяДокументаРеглУчет);
				ДобавитьУникальныйЭлементВСписок(ПараметрыВыбораПользователем.СписокНачислений,
					СтрНачисление.НачислениеУпр);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДокументыДляОбработки Тогда
		ТекстСообщения = НСтр("ru = 'Документы регламентированного учета уже существуют'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыВыбораПользователем.ТипыДокументов.Количество() > 0 Тогда
		ОповещениеЗаполненыДанные = Новый ОписаниеОповещения("ОповещениеВыбраныРеквизитыДокументов", ЭтотОбъект);
		ОткрытьФорму("Обработка.ФормированиеКадровыхДокументовРеглУчет.Форма.ЗаполнениеРеквизитов",
			ПараметрыВыбораПользователем, ЭтотОбъект, , , , ОповещениеЗаполненыДанные,
			РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	Иначе
		СоздатьДокументыРеглУчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыРеглУчета(ВыбранныеПользователемДанные = Неопределено)
	Результаты = СоздатьДокументыРеглУчетаСервер(ВыбранныеПользователемДанные);
	Элементы.СписокДокументовКадровогоУчетаУпр.Обновить();
	
	Если Результаты.ВсегоСоздано = 0 Тогда
		ОповещениеЗаголовок = НСтр("ru = 'Возникли ошибки, документы не созданы'");
		ОповещениеКартинка = БиблиотекаКартинок.ОформлениеКрест;
		ОповещениеТекст = "";
	ИначеЕсли Результаты.ВсегоСоздано = Результаты.КоличествоПроведено Тогда
		ОповещениеЗаголовок = НСтр("ru = 'Документы созданы и проведены'");
		ОповещениеКартинка = БиблиотекаКартинок.ОформлениеФлажок;
		ОповещениеТекст = "";
	ИначеЕсли Результаты.КоличествоОшибок = 0 Тогда
		ОповещениеЗаголовок = НСтр("ru = 'Документы созданы'");
		ОповещениеКартинка = БиблиотекаКартинок.ОформлениеВосклицательныйЗнак;
		ШаблонТекста = НСтр("ru = 'Всего создано: %1
									|- из них проведено: %2'");
		
		ОповещениеТекст = СтрШаблон(ШаблонТекста, Результаты.ВсегоСоздано, Результаты.КоличествоПроведено);
	Иначе
		ОповещениеЗаголовок = НСтр("ru = 'Документы созданы частично'");
		ОповещениеКартинка = БиблиотекаКартинок.ОформлениеВосклицательныйЗнак;
			
		ШаблонТекста = НСтр("ru = 'Всего создано: %1
									|- из них проведено: %2
									|Пропущено: %3'");
		
		ОповещениеТекст = СтрШаблон(ШаблонТекста, Результаты.ВсегоСоздано, Результаты.КоличествоПроведено,
			Результаты.КоличествоОшибок);
	КонецЕсли;
	
	Если Результаты.ВсегоСоздано > 0 Тогда
		ВыбранныеСтрокиИД.Очистить();
		Элементы.СписокДокументовКадровогоУчетаУпр.ВыделенныеСтроки.Очистить();
		Элементы.ГруппаСпискиДокументов.ТекущаяСтраница = Элементы.ГруппаСозданныеДокументы;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(ОповещениеЗаголовок, , ОповещениеТекст, ОповещениеКартинка);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеРезультатовРаботы()
	Описание = Новый Структура;
	Описание.Вставить("ВсегоСоздано", 0);
	Описание.Вставить("КоличествоОшибок", 0);
	Описание.Вставить("КоличествоПроведено", 0);
	
	Возврат Описание;
КонецФункции

&НаСервере
Функция СоздатьДокументыРеглУчетаСервер(Знач ЗаполненоПользователем = Неопределено)
	РезультатыРаботы = ОписаниеРезультатовРаботы();
	
	ШаблонСозданДокумент = НСтр("ru = 'Для документа %1 кадровый документ рег. учета уже существует'");
	Для Каждого Строка Из ДокументыСотрудников Цикл
		Если ЗначениеЗаполнено(Строка.ДокументРеглУчет) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСозданДокумент, Строка.ДокументУпрУчет),
				Строка.ДокументРеглУчет);
			Продолжить;
		КонецЕсли;
		
		НовыйДокумент = Документы[Строка.ДанныеДокумента.ИмяДокументаРеглУчет].СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(НовыйДокумент, Строка.ДанныеДокумента);
		
		// Нужный вид занятости может измениться, если для физ. лица в этой же обработке создан другой кадровый документ
		Если ТипЗнч(НовыйДокумент) = Тип("ДокументОбъект.ПриемНаРаботу") Тогда
			НовыйДокумент.ВидЗанятости = Обработки.ФормированиеКадровыхДокументовРеглУчет.ВидЗанятостиНовогоСотрудника(
				НовыйДокумент.Организация, НовыйДокумент.Сотрудник, НовыйДокумент.ФизическоеЛицо,
				НовыйДокумент.ДатаПриема, Строка.ДокументРеглУчет);
			ЗаполнятьМестоРаботы = Истина;
		ИначеЕсли ТипЗнч(НовыйДокумент) = Тип("ДокументОбъект.КадровыйПеревод") Тогда
			НовыйДокумент.ВидЗанятости = Обработки.ФормированиеКадровыхДокументовРеглУчет.ВидЗанятостиРаботающегоСотрудника(
				НовыйДокумент.Сотрудник, НовыйДокумент.ДатаНачала, Строка.ДокументРеглУчет);
			ЗаполнятьМестоРаботы = Истина;
		Иначе
			ЗаполнятьМестоРаботы = Ложь;
		КонецЕсли;
		
		Если ЗаполнятьМестоРаботы И ЗаполненоПользователем <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(НовыйДокумент.Подразделение) Тогда
				НовыйДокумент.Подразделение = ЗаполненоПользователем.Подразделения.Получить(
					Строка.ДанныеДокумента.ПодразделениеУпр);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НовыйДокумент.ТрудоваяФункция) Тогда
				НовыйДокумент.ТрудоваяФункция = ЗаполненоПользователем.ТрудовыеФункции.Получить(
					Строка.ДанныеДокумента.Должность);
			КонецЕсли;
		КонецЕсли;
			
		// Начисления и удержания
		Для Каждого Начисление Из Строка.ДанныеДокумента.Начисления Цикл
			НоваяСтрокаНачислений = НовыйДокумент.Начисления.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаНачислений, Начисление);
			Если НЕ ЗначениеЗаполнено(НоваяСтрокаНачислений.Начисление) И ЗаполненоПользователем <> Неопределено Тогда
				НоваяСтрокаНачислений.Начисление = ЗаполненоПользователем.Начисления.Получить(Начисление.НачислениеУпр);
			КонецЕсли;
		КонецЦикла;
		
		СтатусДокумента = 0;
		ТекстОшибки = "";
		Если НовыйДокумент.ПроверитьЗаполнение() Тогда
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				СтатусДокумента = 1;
			Исключение
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		КонецЕсли;
			
		Если СтатусДокумента = 0 Тогда
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовыйДокумент.Ссылка) Тогда
			Строка.ДокументРеглУчет = НовыйДокумент.Ссылка;
			РезультатыРаботы.ВсегоСоздано = РезультатыРаботы.ВсегоСоздано + 1;
			Если НовыйДокумент.Проведен Тогда
				РезультатыРаботы.КоличествоПроведено = РезультатыРаботы.КоличествоПроведено + 1;
			КонецЕсли;
			СписокСозданныхДокументов.Добавить(НовыйДокумент.Ссылка);
		Иначе
			РезультатыРаботы.КоличествоОшибок = РезультатыРаботы.КоличествоОшибок + 1;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Создание кадровых документов'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);			
		КонецЕсли;
		
		Строка.СостояниеДокументаРеглУчет = СтатусДокумента;
	КонецЦикла;
	
	ОбновитьСписокСозданныхДокументов();
	
	Возврат РезультатыРаботы;
КонецФункции

&НаСервере
Процедура ОбновитьСписокСозданныхДокументов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СозданныеДокументы,
		"Ссылка", СписокСозданныхДокументов, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьУникальныйЭлементВСписок(Список, НовоеЗначение)
	Если Список.НайтиПоЗначению(НовоеЗначение) = Неопределено Тогда
		Список.Добавить(НовоеЗначение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
