#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	Список.Параметры.УстановитьЗначениеПараметра("УказываетсяВСписке", НСтр("ru = 'Указывается в списке'"));
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ФормаКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	КоманднаяПанельПодменюДиректБанк = Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ПодменюДиректБанк");
	Если КоманднаяПанельПодменюДиректБанк <> Неопределено Тогда
		КоманднаяПанельПодменюДиректБанкОбычное = КоманднаяПанельПодменюДиректБанк.ПодчиненныеЭлементы.Найти("ПодменюДиректБанкОбычное");
		Если КоманднаяПанельПодменюДиректБанкОбычное <> Неопределено Тогда
			Для Каждого КнопкаФормыДБ Из КоманднаяПанельПодменюДиректБанкОбычное.ПодчиненныеЭлементы Цикл
				КнопкаФормыДБ.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
			КонецЦикла;
		КонецЕсли;		
		Элементы.Переместить(КоманднаяПанельПодменюДиректБанк, Элементы.ФормаКоманднаяПанель);
	КонецЕсли;
	
	АдаптацияФормыТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		РаботаСОтборами.ИзменитьОтборПоОсновнойОрганизации(Список, , Параметр);
	ИначеЕсли ИмяСобытия = "ЗагрузкаЧековСамозанятых" 
		Или ИмяСобытия = "ИзменениеВыписки" 
		Или ИмяСобытия = "ОбновитьСостояниеОбменСБанками"
		Или ИмяСобытия = "Запись_ВыплатыСамозанятым" Тогда
			Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	РаботаСОтборами.ВосстановитьОтборСписка(Список, Настройки, "Организация");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКонтекстныеНовости(Команда)

	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаКомандыНовости(
		ЭтотОбъект,
		Команда
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	// ЧекиЗагружены
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Состояние");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "Список.Состояние",
		ВидСравненияКомпоновкиДанных.Равно, Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЗагружены);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветПлатежныйДокументОплачен);
	
	// ЧекиЧастичноЗагружены
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Состояние");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "Список.Состояние",
		ВидСравненияКомпоновкиДанных.Равно, Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЧастичноЗагружены);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаПалитры.Красный);
	
	// Документ Оплачен
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Состояние");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "Список.Состояние",
		ВидСравненияКомпоновкиДанных.Равно, Перечисления.СтатусыДокументовВыплатыСамозанятым.Оплачено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветГиперссылки);
	
	// Отклонено
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Состояние");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "Список.Состояние",
		ВидСравненияКомпоновкиДанных.Равно, Перечисления.СтатусыДокументовВыплатыСамозанятым.Отклонено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаПалитры.Красный);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	Если СтрЗаканчиваетсяНа(Команда.Имя, "ДиректБанкОтправка")
		И Элементы.Список.ТекущиеДанные <> Неопределено
		И Не УВсехСамозанятыхЗаполненИНН(Элементы.Список.ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
	
КонецПроцедуры

&НаСервере
Функция УВсехСамозанятыхЗаполненИНН(Документ)
	
	Возврат Документы.ВыплатыСамозанятым.УВсехСамозанятыхЗаполненИНН(Документ);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ПереводНа85

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Элементы.ГруппаГлобальныеКоманды.Видимость = ИнтерфейсТакси;
	Элементы.Состояние.ОтметкаЯчейки = ТипОтметкиЯчейкиТаблицы.ФигураПодТекстомОвальная;
	
	Если ИнтерфейсТакси Тогда
		УстановитьУсловноеОформление();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
